[
    {
        "Title": "Murder Offscreen",
        "Authors": "By Osborne, Denise",
        "Description": "Meet spirited Queenie Davilov in her first appearance on the mystery scene. A struggling screenwriter who moonlights doing security checks on the Hollywood film community, she's clever and wry, with an indefatigable sense of curiosity. She's a woman with a taste for Jack Daniels and her own hand-rolled cigarettes, who isn't superstitious but keeps a Goddess icon or two around the house, \"just in case.\"When Queenie attends the premiere of Lucifer's Shadow, a horror film she worked on as the script supervisor, she breathes a sigh of relief that filming is finally over. A suicide and the accidental deaths of two of the movie's crew plagued its production, setting nerves on edge and Hollywood's gossip columnists agog. Now, as the lights dim and the cinematic horrors unfold onscreen, the specter of death once again intrudes offscreen when producer/director Burke Lymon is spectacularly murdered, in a manner worthy of his own creation.As Hollywood reels in an atmosphere of terror and suspicion, Queenie is hired to find the demonic killer. Who wanted Lymon dead, anyway - and why? Rumor had it his production company was failing, but was that reason enough for murder? Or did an obsessed and greedy insider plan the crime to make the movie's popularity \"go ballistic\"? And what about skeletons in the secretive director's murky past? Queenie must use all her wits to save the next intended victim - before he or she falls within Lucifer's shadow.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Henry Holt and Cmpany",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Motion to Suppress: A Novel (Nina Reilly)",
        "Authors": "By O'Shaughnessy, Perri",
        "Description": "Returning from her late shift as a barmaid at a casino in Lake Tahoe, Misty Patterson struck her violently jealous husband in self-defense.  She admits that--but did she kill him?  She says she can't remember.  Like so many times before, Misty blacked out and the rest of the evening is a blank.  Now her husband has disappeared, leaving behind a trail of blood, and she's the number-one murder suspect with no one to turn to for help.        San Francisco attorney Nina Reilly is also on the run—from a bad marriage and a worse career setback.  Relocated to Lake Tahoe, Nina is resolved to recover her spirit, give her young son a secure home, and build up a small solo practice.  But, when Misty Patterson walks in the door, a blond Barbie doll of a cocktail waitress accused of murder, it triggers a harrowing series of events that will change both women's lives forever.       Common sense says Misty is lying.  To win this case Nina will have  to trust her own instincts, diving headlong into the dark convolutions of the human mind.  This murder case—teeming with sinister secrets, unspoken betrayals, and jolting revelations—is going to change everything Nina Reilly believes about the law.  It's going to rock everything Misty believes about herself.  And if they can learn to trust each other, it's going to give both women their one and only chance to reclaim their shattered lives.        In a spellbinding novel that doesn't let go from the first page until the shocking unforgettable conclusion, Perri O'Shaughnessy delivers an electrifying legal thriller about two women risking all they have for the truth that could cost them their lives—or set them both free.",
        "Category": "",
        "Publisher": "Island Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Unfit to Practice: A Novel (Nina Reilly)",
        "Authors": "By O'Shaughnessy, Perri",
        "Description": "It’s the moment every attorney fears most...one careless moment that threatens careers, reputations, lives. For Nina Reilly, it will change everything—and ignite a case where her own clients are witnesses against her...and where the defendant is Nina herself.As an attorney championing desperate people, Nina Reilly has skirted the edges of legal ethics in pursuit of a just result, but she has never before broken the rule of absolute protection of her clients’ secrets. One September night in Lake Tahoe when her unlocked truck is stolen, her life changes forever. Gone are her most sensitive case files, complete with the sometimes brutally candid notes she took while interviewing her clients. It’s every attorney’s nightmare. And now the worst has happened: The secrets are being revealed, one by one, in ways that will cause the greatest harm. Nina’s own clients complain to the State Bar of California, and suddenly Nina is fighting for her license and her livelihood in a legal proceeding that may ultimately lead her to disbarment. In desperation, Nina turns to her ex-husband, celebrated San Francisco lawyer Jack McIntyre, to represent her. And as personal tensions erupt between McIntyre and Nina’s sometime boyfriend, private investigator Paul van Wagoner...as reputations are ruined and people begin to die...a chilling pattern of rage and revenge comes into focus. Someone is bent on destroying the lives of Nina’s clients and, in the process, Nina Reilly.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Duh! The Stupid History Of The Human Race",
        "Authors": "By Fenster, Bob",
        "Description": "Never kiss a rattlesnake. Put on the parachute before jumping from the plane. Don't bring your dog along if you're going to rob a bank. These seem like obvious enough strategies but, unfortunately, we seem to be a race of rattlesnake kissers.Duh! The Stupid History of the Human Race is a hilarious collection of the stupid things that people do-even the really smart people. \"Part 1: The Stupid Chronicles\" details the unbelievably idiotic things people have done, organized by such topics as politics, history, sports, arts, science, and dumb plays in the face of fate. \"Part 2: Everything You Always Wanted to Know about Stupidity but Were Too Smart to Ask\" looks at the track record of human stupidity in all its dumb glory. And \"Part 3: How to Destupify\" offers tongue-in-cheek advice on how to avoid ending up in a future edition of the book.",
        "Category": " Humor , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Getting a Life: Strategies for Simple Living Based on the Revolutionary Program for Financial Freedom, \"Your Money or Your Life\"",
        "Authors": "By Blix, Jacqueline, Heitmiller, David, and Dominguez, Joseph R.",
        "Description": "Written by a couple who used the nine principles in the bestselling Your Money or Your Life to transform their lives, this guide to simpler financial living offers practical advice on how to access and use each of those nine steps. Reprint.",
        "Category": " Business & Economics , Personal Finance , Budgeting",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Chicken Soup for the Writer's Soul: Stories to Open the Heart and Rekindle the Spirit of Writers",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), and Gardner, Bud (COM)",
        "Description": "Being a writer can be a lonely and frustrating experience. The stories in this book-by a wide range of professional writers, novelists, journalists, freelancers, poets and screenwriters-will give readers insight into the human trials, tribulations and triumphs of writers, and writers a source of inspiration and commiseration. Whether readers are beginning writers, seasoned pros or wannabes, the stories of purpose, passion, endurance and success contained in Chicken Soup for the Writer's Soul will inform, entertain, uplift and inspire them. In its pages, they will learn important lessons on: the importance of perseverance, the value of being yourself, the process of discovering your own voice, the need for mentors and allies, and the power of following your heartfelt dreams. Contributors include: Sue Grafton, Steve Allen, Dave Barry, Agatha Christie, Art Linkletter, Terry McMillan, and more.",
        "Category": " Religion , Inspirational",
        "Publisher": "Health Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The Millennium Bug : How to Survive the Coming Chaos",
        "Authors": "By Hyatt, Michael S.",
        "Description": "At the stroke of midnight on January 1, 2000, the world could erupt into complete chose. Imagine: social security checks stop coming, planes all over the world are grounded, VISA balances skyrocket, and the military, police officers, and firefighters walk off the job. Any one of these problems could generate enormous social consequences. Combined, they will cause complete chaos. Experts know how to solve the Year 2000 crisis, but can it be implemented in time? Now, for the first time in non-computer nerd language, author Michael S. Hyatt tells the rest of us, in a straightforward manner, the magnitude and scope of the Year 2000 crisis and its impact on federal, state and local governments; the banking and finance industries; public utilities; and the personal computer.",
        "Category": " History , Modern , 21st Century",
        "Publisher": "Regnery Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Lessons of Experience: How Successful Executives Develop on the Job",
        "Authors": "By Morrison, Ann M., Lombardo, Michael M., and McCall, Morgan W.",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "Pasta (Great Taste, Low Fat)",
        "Authors": "By Gluck, Sandra Rose",
        "Description": "Offers a collection of kitchen-tested,  low-fat recipes featuring pasta, with recipes for vegetable, poultry, meat, and seafood sauces",
        "Category": " Cooking , Specific Ingredients , Pasta",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "The Versatile Grain and the Elegant Bean: A Celebration of the World's Most Healthful Foods",
        "Authors": "By London, Sheryl and London, Mel",
        "Description": "Presents over 300 recipes drawn from cultures around the world, featuring dishes that combine beans and grains for enhanced nutritional value and flavor",
        "Category": " Cooking , Specific Ingredients , Rice & Grains",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Riding the Bus with My Sister: A True Life Journey",
        "Authors": "By Simon, Rachel",
        "Description": "Rachel Simon’s sister Beth is a spirited woman who lives intensely and often joyfully. Beth, who has mental retardation, spends her days riding the buses in her Pennsylvania city. The drivers, a lively group, are her mentors; her fellow passengers are her community. One day, Beth asked Rachel to accompany her on the buses for an entire year. This wise, funny, deeply affecting book is the chronicle of that remarkable time. Rachel, a writer and college teacher whose hyperbusy life camouflaged her emotional isolation, had much to learn in her sister’s extraordinary world. These are life lessons from which every reader can profit: how to live in the moment, how to pay attention to what really matters, how to change, how to loveand how to slow down and enjoy the ride.Elegantly woven throughout the odyssey are riveting memories of terrifying maternal abandonment, fierce sisterly loyalty, and astonishing forgiveness. Rachel Simon brings to light the almost invisible world of mental retardation, finds unlikely heroes in everyday life, and, without sentimentality, portrays Beth as the endearing, feisty, independent person she is. This heartwarming book about the unbreakable bond between two very different sisters takes the reader on an inspirational journey at once unique and universal.",
        "Category": " Biography & Autobiography , Reference",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "ADHD & Teens: A Parent's Guide to Making it through the Tough Years",
        "Authors": "By Alexander-Roberts, Colleen",
        "Description": "A complete parenting guide that provides you with the information you need to survive these trying years.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Taylor Trade Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Why Didn't I Think of That?",
        "Authors": "By Firestein, Roger",
        "Description": "",
        "Category": "",
        "Publisher": "Innovation Resources, Inc.",
        "Price Starting With ($)": "12.11",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Big Trouble Movie Tie-In",
        "Authors": "By Barry, Dave",
        "Description": "Describes the lives of the troubled denizens of Coconut Grove, including a career-threatened adman, an alcoholic embezzler dodging a couple of hit men, and their dysfunctional families. Reissue. (A Touchstone Pictures film, directed by Barry Sonnenfeld, releasing Spring 2002, starring Tim Allen, Rene Russo, Janeane Garofalo, Jason Lee, Dennis Farina, Andy Richter, Tom Sizemore, Stanley Tucci, & Patrick Warburton) (General Fiction)",
        "Category": " Fiction , Media Tie-In",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Sacred Cows Make Gourmet Burgers: Ministry Anytime, Anywhere, By Anyone",
        "Authors": "By Easum, William M.",
        "Description": "This book shows how an atmosphere of permission-giving, which signals the end of leaders as enablers, can help church leaders transcend bureaucracy and enhance spiritual gifts rather than assign them. The 'sacred cows' of control and regulation can be devoured, as leaders and people are converted to a new style of ministry.",
        "Category": " Religion , Christian Ministry , Pastoral Resources",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Pursuit of Wow! Every Person's Guide to Topsy-Turvy Times",
        "Authors": "By Peters, Thomas J.",
        "Description": "Organized into more than 200 thought- and action-provoking elements—from the importance of clean trucks and bathrooms to conversations with entrepreneurs creating new markets—Tom Peters, bestselling management guru offers a practical guide to impractical times.   In The Pursuit of Wow!, Tom Peters offers readers the words, the tools, to survive in tumultuous business environments.  In his groundbreaking book, In Search of Excellence changed the way business does business. Now it’s time to take the next leap into the cyberstage era.  Getting to a place called excellence is no longer the idea.  You’ve got to take that leap, then leap again—catapult their imaginations, blow their mindsets—in a word, wow! them.   Once more the unconventional Peters stimulates corporate thought processes. Along with the best of his columns, Peters includes questions and rebuttals that come from readers and listeners, as well as his own candid responses. A must-read for every business person.",
        "Category": " Business & Economics , Organizational Development",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "How to Get Organized When You Don't Have the Time",
        "Authors": "By Culp, Stephanie",
        "Description": "Explains how to use one's time more effectively, tells how to avoid procrastination, and includes advice on organizing kitchens, closets, dens, and garages",
        "Category": " Self-help , Adult Children of Substance Abusers",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Secret Prey",
        "Authors": "By Sandford, John",
        "Description": "The company chairman lay on the cold ground of the woods, his eyes unseeing, his orange hunting jacket punctured by a rifle bullet fired at close range. Near him stood the four executives with whom he had been hunting, each with his or her own complicated agenda, each with a reason not to be sorrowful about the man's death.There were currents running through this group, hints and whispers of something much greater than the murder of a single man. Davenport had felt this way not long before, sensed the curling of an indefinable evil, and not only had it almost gotten him killed, it had lost him his fiancee, who'd never been able to recover from the violence of the encounter. Sometime soon, unless he could stop it, there would be another death, and then another, and Davenport couldn't help wondering if maybe this time, the final death might not be his own...",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "AMER POLIT TRADITN V9",
        "Authors": "By Hofstadter, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1974"
        }
    },
    {
        "Title": "The Kidnapping of Aaron Greene",
        "Authors": "By Kay, Terry",
        "Description": "When someone wealthy is kidnapped, it makes sense to us, the motive is obvious, the ransom money is raised, and we may even think secretly that somehow he deserved it. But when a John Doe is abducted - a mailboy named Aaron Greene, say - we might sit up and take notice, realizing that the missing person could be our son or daughter, our sister or brother - or us.He is barely a year out of high school, but even his former teachers scarcely remember the shy young man who disappears on his way to work in the mailroom of a powerful downtown bank in Atlanta. The kidnappers demand ten million dollars for his life - with one condition: The money is to come from the bank, not Aaron's parents. But the bank refuses to pay.Suddenly, Aaron is the quiet eye in the center of a hurricane of public outrage that sweeps the nation. On call-in shows and on every street corner, the same questions are being asked: Where is Aaron? Who could possibly be responsible for this? What is being done by the authorities? And the most important question of all: How much is the life of a nonentity like Aaron Greene really worth?",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Robert Ludlum's The Lazarus Vendetta: A Covert-One Novel",
        "Authors": "By Ludlum, Robert and Larkin, Patrick",
        "Description": "For the past three decades Robert Ludlum's bestselling novels have been enjoyed by hundreds of millions of readers worldwide and have set the standard against which all other thrillers are measured.  His Covert-One series has been among his most beloved creations and now comes the latest thrilling novel in the series.  The Lazarus Movement, the dominant force in the eco-conscious, \"anti-technology\"  protest movement, has sent rumblings down the halls of the world's intelligence agencies.  Led by a mysterious, never-seen figure known only as Lazarus, this increasingly prominent group is believed by some to be preparing a bold strike.When an attack on a nano-technology research facility leaves thousands dead--- protestors and scientists alike---from what appears to be a cloud of inadvertently released but gruesomely deadly nanobots, pandemonium reigns.  Lt. Col. Jon Smith is activated by Covert-One to find and uncover the truth about Lazarus where all others have failed. As Smith slowly uncovers the deadly underpinnings of the group, he soon learns that the Lazarus Movement is only the very tip of the iceberg in a deadly scheme that threatens billions of lives and will forever change the nature of the world itself.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "And the Sea Is Never Full: Memoirs, 1969-",
        "Authors": "By Wiesel, Elie and Wiesel, Marion (TRN)",
        "Description": "Originally published in French by +ditions du Seuil, Paris, 1996; the translation is by Marion Wiesel. Continuing from his earlier  All Rivers Run to the Sea , this volume of memoirs begins when Weisel is 40 years old and a writer of international repute determined to speak out actively for both Holocaust survivors and the disenfranchised everywhere. Here he discusses his feelings concerning Reagan's visit to the German military cemetery at Bitburg, Lech Walesa, Francois Mitterand, Holocaust deniers, Israel and its internal conflicts, and the Holocaust Museum in Washington, D.C., among other topics. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "The Curious Incident of the Dog in the Night-Time",
        "Authors": "By Haddon, Mark",
        "Description": "A bestselling modern classic—both poignant and funny—about a boy with autism who sets out to solve the murder of a neighbor's dog and discovers unexpected truths about himself and the world.Nominated as one of America’s best-loved novels by PBS’s The Great American ReadChristopher John Francis Boone knows all the countries of the world and their capitals and every prime number up to 7,057. He relates well to animals but has no understanding of human emotions. He cannot stand to be touched. And he detests the color yellow.This improbable story of Christopher's quest to investigate the suspicious death of a neighborhood dog makes for one of the most captivating, unusual, and widely heralded novels in recent years.",
        "Category": " Fiction , Coming of Age",
        "Publisher": "Vintage Contemporaries",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Re-Entry",
        "Authors": "By Paul Preuss",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Doubleday Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The Gasp",
        "Authors": "By Romain Gary",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1974"
        }
    },
    {
        "Title": "Fox on the Rhine",
        "Authors": "By Niles, Douglas and Dobson, Michael",
        "Description": "Fox on the Rhine is a novel that postulates what might have happened had a single incident of World War II been different.July 20, 1944.A group of disillusioned officers of Hitler's high command plant a bomb that succeeds in killing the Fuhrer, bringing forth an option for surrender, peace, and survival for all of Germany . . . but Himmler has other plans.Backed by a fanatical cadre of SS officers, Himmler seizes control from the conspirators and instigates plans to change the course of the war and corrects the faults of Hitler's plans with solutions of his own. First an armistice with Russia, and then the mass production of jet fighters, making an offensive against the West not just a chance for victory, but a sure thing.The lines are drawn. New plans are made . . . and the campaign is on, leading to a very different Battle of the Bulge, where the legendary \"Desert Fox\" Erwin Rommel meets \"Blood 'n' Guts\" George Patton in a confrontation that will determine the fate of Europe and quite possibly the entire free world.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "A Pocket Guide to Hawai'i's Flowers",
        "Authors": "By Peebles, Douglas and Miyano, Leland",
        "Description": "",
        "Category": " Gardening , Regional , West (AK, CA, CO, HI, ID, MT, NV, UT, WY)",
        "Publisher": "Mutual Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Frankenstein or The Modern Prometheus: The 1818 Text (The World's Classics)",
        "Authors": "By Shelley, Mary Wollstonecraft and Butler, Marilyn (EDT)",
        "Description": "Frankenstein was Mary Shelley's immensely powerful contribution to the ghost stories which she, Percy Shelley, and Byron devised one wet summer in Switzerland. Its protagonist is a young student of natural philosophy, who learns the secret of imparting life to a creature constructed from relics of the dead, with horrific consequences.Frankenstein confronts some of the most feared innovations of evolutionism: topics such as degeneracy, hereditary disease, and mankind's status as a species of animal. The text used here is from the 1818 edition, which is a mocking expose' of leaders and achievers who leave desolation in their wake, showing humanity its choice - to live co-operatively or to die of selfishness.Drawing on new research, Marilyn Butler examines the novel in the context of the radical sciences, which were developing among much controversy, and shows how Frankenstein's experiment relates to a contemporary debate between the champions of materialist science and of received religion.",
        "Category": " Fiction , Classics",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "The World According to Dave Barry",
        "Authors": "By Barry, Dave and MacNelly, Jeff (ILT)",
        "Description": "An illustrated omnibus edition featuring the best of the Pulitzer Prize-winning humorist encompasses Dave Barry Turns 40, Dave Barry Talks Back, and Dave Barry's Greatest Hits.",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Colorful Desert Wildflowers: California & Arizona",
        "Authors": "By Grace B. Ward, Onas M. Ward",
        "Description": "",
        "Category": "",
        "Publisher": "Living Desert Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Pygmalion (Dover Thrift Editions: Plays)",
        "Authors": "By Shaw, Bernard",
        "Description": "One of George Bernard Shaw's best-known plays, Pygmalion was a rousing success on the London and New York stages, an entertaining motion picture and a great hit with its musical version, My Fair Lady. An updated and considerably revised version of the ancient Greek legend of Pygmalion and Galatea, the 20th-century story pokes fun at the antiquated British class system. In Shaw's clever adaptation, Professor Henry Higgins, a linguistic expert, takes on a bet that he can transform an awkward cockney flower seller into a refined young lady simply by polishing her manners and changing the way she speaks. In the process of convincing society that his creation is a mysterious royal figure, the Professor also falls in love with his elegant handiwork.The irresistible theme of the emerging butterfly, together with Shaw's brilliant dialogue and splendid skills as a playwright, have made Pygmalion one of the most popular comedies in the English language. A staple of college drama courses, it is still widely performed.",
        "Category": " Drama , European , English, Irish, Scottish, Welsh",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "On Distant Ground",
        "Authors": "By Butler, Robert Olen",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Enter The Zone: A Dietary Road map",
        "Authors": "By Sears, Barry and Lawren, Bill",
        "Description": "For years experts have been telling Americans what to eat and what not to eat. Fat, they told us, was the enemy. Then it was salt, then sugar, then cholesterol... and on it goes.Americans listened and they lost -- but not their excess fat. What they lost was their health and waistlines. Americans are the fattest people on earth... and why? Mainly because of the food they eat.In this scientific and revolutionary book, based on Nobel Prize-winning research, medical visionary and former Massachusetts Institute of Technology researcher Dr. Barry Sears makes peak physical and mental performance, as well as permanent fat loss, simple for you to understand and achieve.With lists of good and bad carbohydrates, easy-to-follow food blocks and delicious recipes, The Zone provides all you need to begin your journey toward permanent fat loss, great health and all-round peak performance. In balance, your body will not only burn fat, but you'll fight heart disease, diabetes, PMS, chronic fatigue, depression and cancer, as well as alleviate the painful symptoms of diseases such as multiple sclerosis and HIV.This Zone state of exceptional health is well-known to champion athletes. Your own journey toward it can begin with your next meal. You will no longer think of food as merely an item of pleasure or a means to appease hunger. Food is your medicine and your ticket to that state of ultimate body balance, strength and great health: the Zone.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Regan Book",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Smart Approach to Window Decor",
        "Authors": "By Elliott, Lynn and Lent, Lisa",
        "Description": "The Smart Approach to Window Decor is more than a book of window treatment styles-it is a book that teaches the reader how to select a treatment with the discerning eye of a professional interior designer. It shows the reader how to change or enhance the overall style of a room with window treatments, provide privacy without sacrificing the view, create a realistic budget, and how lifestyle considerations can influence choices. With 278 beautiful color illustrations and 159 gorgeous photographs, it also thoroughly provides a reference for numerous styles of curtains, draperies, shades, blinds, and shutters, as well as swags, valances, and cornices.",
        "Category": " House & Home , Decorating",
        "Publisher": "Creative Homeowners Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Happy New Year! Kung-Hsi Fa-Ts'Ai",
        "Authors": "By Demi",
        "Description": "Pop! Pop! Pop! Set off firecrakers! Enjoy the feasts and join in the Dragon Dances!Chinese New Year has arrived and these are just a few of the customs included in Demi's newest book, Happy New Year! Kung-Hsi Fa-Ts'ai!. The activities and traditions that make up the Chinese New Year festivities are portrayed in beautiful, full-color detail.  There are lavish illustrations of playful children, and each spread contains a brief explanation of the significance of each custom and how it fits into the month-long celebration. This glorious book is a sure delight and will be ideal for use both at home and in the classroom.",
        "Category": " Juvenile Nonfiction , People & Places , Asia",
        "Publisher": "Crown Publication",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Fair Game",
        "Authors": "By White, Elizabeth",
        "Description": "'Nothing worth having is easy to get... ana Cutrere's homecoming to Vancleave, Mississippi, is anything but dull. Before she's even reached town, the beautiful young widow has a run-in with a stray cow, loses her son in the woods, rescues an injured fawn, and comes face-to-face with Grant Gonzales, her high school crush.Grant recently returned to town himself amid hushed controversy. His only plan: leave the corporate world behind and open a hunting reserve. Seeing Jana again ignites old memories . . . and a painful past.Tensions boil over when he learns exactly why she returned. Jana plans to convince her grandfather to develop a wildlife rescue center---dead center on the prime hunting property he promised to sell to Grant! Jana is determined to make a new start for herself and her two children---and willing to fight for it. With deadlines drawing near for the sale of the property and no decision from her grandfather, can Jana trust God with her and Grant's future, or will explosive emotions and diametrically opposing views tear them apart?",
        "Category": " Fiction , Religious",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Kaffir Boy: An Autobiography--The True Story of a Black Youth's Coming of Age in Apartheid South Africa",
        "Authors": "By Mathabane, Mark",
        "Description": "The classic story of life in Apartheid South Africa.Mark Mathabane was weaned on devastating poverty and schooled in the cruel streets of South Africa's most desperate ghetto, where bloody gang wars and midnight police raids were his rites of passage. Like every other child born in the hopelessness of apartheid, he learned to measure his life in days, not years. Yet Mark Mathabane, armed only with the courage of his family and a hard-won education, raised himself up from the squalor and humiliation to win a scholarship to an American university.  This extraordinary memoir of life under apartheid is a triumph of the human spirit over hatred and unspeakable degradation. For Mark Mathabane did what no physically and psychologically battered \"Kaffir\" from the rat-infested alleys of Alexandra was supposed to do -- he escaped to tell about it.",
        "Category": " Social Science , Ethnic Studies , African American Studies",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Adult Children of Abusive Parents: A Healing Program for Those Who Have Been Physically, Sexually, or Emotionally Abused",
        "Authors": "By Farmer, Steven",
        "Description": "A history of a childhood abuse is not a life sentence. Here is hope, healing, and a chance to recover the self lost in childhood. Drawing on his extensive work with Adult Children, and on his own experience as a survivor of emotional neglect, therapist Steven Farmer demonstrates that through exercises and journal work, his program can help lead you through grieving your lost childhood, to become your own parent, and integrate the healing aspects of spiritual, physical, and emotional recovery into your adult life.",
        "Category": " Self-help , Personal Growth , Self-Esteem",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Shoot Out the Lights: The Amazing , Improbable, Exhilarating Saga of the 1969-70 New York Knicks",
        "Authors": "By Spitz, Bob",
        "Description": "Willis Reed ... Bill Bradley ... Walt Frazier ... Dave DeBusschere ... Dick Barnett. Even after a quarter of a century, the names still resonate. The team is a basketball legend.The year was 1969, and a nation in the throes of political and cultural upheaval turned its attention from the streets to the arenas in search of new heroes. In New York, a team cobbled together by general manager Eddie Donovan and molded by coach Red Holzman showed early on how it intended to bring the city its first NBA title ever. After a third of the season the Knicks' record was a remarkable 25-2, including an eighteen-game winning streak. They would win going away.But the play-offs were another story: the Knicks had to overcome a feisty Baltimore Bullets team, a Milwaukee Bucks squad led by rookie sensation Lew Alcindor (later Kareem Abdul-Jabbar), and the tough, tough Los Angeles Lakers, with Wilt Chamberlain, Elgin Baylor, and Jerry West. They did it - in seven agonizing games, with Willis Reed playing twenty-seven minutes of the finale virtually on one leg and in tremendous pain.",
        "Category": " Sports & Recreation , Basketball",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "6.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Hershey's Chocolate and Cocoa Cookbook",
        "Authors": "By Susan Noland",
        "Description": "Advice on the basic techniques for cooking with chocolate and cocoa is accompanied by an assortment of recipes for cookies, cakes, pies, candies, breads, and beverages",
        "Category": " Cooking , General",
        "Publisher": "Ideals Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1982"
        }
    },
    {
        "Title": "The Kama Sutra: The Hindu Ritual of Love - Complete and Unexpurgated",
        "Authors": "By VaÌ\u0084tsyaÌ\u0084yana",
        "Description": "",
        "Category": "",
        "Publisher": "Castle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Angus, Thongs and Full-Frontal Snogging: Confessions of Georgia Nicolson (Confessions of Georgia Nicolson, Book 1)",
        "Authors": "By Rennison, Louise",
        "Description": "Angus:My mixed-breed cat, half domestic tabby, half Scottish wildcat. The size of a small Labrador, only mad.Thongs:Stupid underwear. What's the point of them, anyway? They just go up your bum, as far as I can tell.Full-Frontal Snogging:Kissing with all the trimmings, lip to lip, open mouth, tongues ... everything.Her dad's got the mentality of a Teletubby (only not so developed). Her cat, Angus, is trying to eat the poodle next door. And her best friend thinks she looks like an alien -- just because she accidentally shaved off her eyebrows. Ergghhhlack. Still, add a little boy-stalking, teacher-baiting, and full-frontal snogging with a Sex God, and Georgia's year just might turn out to be the most fabbitty fab fab ever!",
        "Category": " Young Adult Fiction , Humorous , General",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "George Foreman's Big Book Of Grilling Barbecue And Rotisserie: More than 75 Recipes for Family and Friends",
        "Authors": "By Foreman, George and Witt, Barbara",
        "Description": "King of the ring and king of the grill, George Foreman joins forces with chef Barbara Witt to provide all-new dishes for grill and rotisserie cooking. The recipes in this book can be prepared indoors, using an electric or stovetop grill; or outdoors, on an electric, charcoal, or gas-powered barbecue.  Grilling is healthful and quick. If you do a little work in advance, once you fire up the grill, dinner can be ready in a matter of minutes. So dishes like Rib Roast with Rosemary and Roasted-Garlic Wine Sauce, Chicken Breasts with Peanut Sauce, Ginger Honey Duck, and Curried Salmon Steak become easy weeknight dinners instead of party fare.  Foreman and Witt have created delicious recipes for grilled meats, poultry, seafood, vegetables, innovative grilled salads and pasta sauces -- even pizza. Complete with full nutritional information, the recipes reflect an international range of flavors -- Caribbean, Pan-Asian, and Latin -- and provide new twists on all-American favorites. In the recipe introductions and in the vegetable chapter, there are suggestions for side dishes, some of which can be prepared on the grill alongside the main course.  You'll find everything you need to know about equipment; ways to maximize flavor by using seasoning rubs, pastes, marinades, and brines; and there are sources for the best meats and ingredients. While these dishes are full of big flavors, the ingredients can be found in any well-stocked supermarket. Whether you want a quick-fix family meal, a backyard barbecue feast, or an elegant dinner party, you'll find the perfect recipe in George Foreman's Big Book of Grilling, Barbecue, and Rotisserie.",
        "Category": " Cooking , Methods , Barbecue & Grilling",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "America's Regional Quilting",
        "Authors": "By Moore, Marsha Evans and Lee, Schecter (PHT)",
        "Description": "Provides detailed instructions and illustrations for creating thirty-six quilting and patchwork projects featuring American themes",
        "Category": " Art , General",
        "Publisher": "Meredith Pr",
        "Price Starting With ($)": "6.16",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Successful Quilting: A Step-By-Step Guide to Mastering the Techniques of Piecing, Applique and Quilting",
        "Authors": "By Seward, Linda",
        "Description": "",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Straight Talk on Decorating from Lynette Jennings",
        "Authors": "By Jennings, Lynette",
        "Description": "Takes a down-to-earth approach to decorating: Design isn’t mysterious; it’s about tools, not rules.Tour fabulous homes from coast to coast, including exclusive, never-before-seen tours of Jennings’ homes in Toronto and Atlanta.Teaches the basics on color, accessories, fabrics, proportion, and furniture.",
        "Category": " House & Home , Decorating",
        "Publisher": "Meredith Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Outer Banks Mysteries and Seaside Stories",
        "Authors": "By Whedbee, Charles H.",
        "Description": "Whedbee's collections of legends and folklore have become regional classics. The continuing popularity of these books stems from the author's intimate knowledge of the places, people, and events of which he writes. He gathers the mysteries, tales, legends, and lore that have been handed down for generations on the North Carolina coast and recounts them with a sensitivity for tradition that makes him a master at what he does.For decades, the folk tales of Charles Harry Whedbee have been available wherever you care to look on the Outer Banks. Their popularity has transcended Whedbee's loyal readership among North Carolinians and visitors from the Northeast and the Midwest.Charles Harry Whedbee was an elected judge in his native Greenville, North Carolina, for thirty-plus years, but his favorite place was the Outer Banks, Nags Head in particular. Whedbee was the author of five folklore collections. He died in 1990.",
        "Category": " Fiction , Fairy Tales, Folk Tales, Legends & Mythology",
        "Publisher": "Blair",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Render Me My Song: African-American Women Writers from Slavery to the Present",
        "Authors": "By Russell, Sandi",
        "Description": "",
        "Category": " Literary Collections , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "The Messianic Legacy: Secret Brotherhoods. The Explosive Alternate History of Christ",
        "Authors": "By Baigent, Michael, Leigh, Richard, and Lincoln, Henry",
        "Description": "Holy Blood, Holy Grail rocked the very foundations of Christianity. Now four more years of research have uncovered shocking material — and its earthshaking consequences.• What extraordinary meaning lies behind Jesus' title — \"King of the Jews\"?• Was there more than one Christ?• Who really constituted Jesus' following — and what were the real identities of Simon Peter and Judas Iscariot?• Who now has the ancient treasure of the Temple of Jerusalem?• What is the true source of today's Christian \"Fundamentalism\"?• What links the Vatican, the CIA, the KGB, the Mafia, Freemasonry, and the Knights Templar?• What is the stunning goal of the European secret society that traces its lineage back to Christ and the House of David?The Messianic Legacy. Here is the book that reveals the answers to these intriguing, potentially explosive questions. Utilizing the same meticulous research that catapulted their first book onto the best seller lists, the authors again bring an enlighteneing message of truth — and urgent importance — to Christians and non-Christians the world over.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Delta",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Chicken Soup for the Working Woman's Soul: Humorous and Inspirational Stories to Celebrate the Many Roles of Working Women (Chicken Soup for the Soul)",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), and Donnelly, Chrissy (COM)",
        "Description": "Whether she is a corporate executive or a factory worker, an entrepreneur or a \"mompreneur,\" today's woman is an integral part of the workforce and the American Dream. Women have made inroads in many professions that were once the domain of only men while juggling the many demands of work and family. From the woman who manages a staff of fifty, to the mother who choreographs the comings and goings of a family of five, women are the ultimate multitaskers. This collection celebrates the diversity and special contributions of women in the world of work-their hopes, their dreams and aspirations, and their accomplishments.This very special book also acknowledges the important and often unappreciated women in the homeplace through stories of stay-at-home moms for whom raising children was their most important task. These tales recognize the vital contributions of women who find their reward in devoting their lives to their families instead of collecting a paycheck.Chapters include: All in a Day's Work; Balancing Work and Family; Teamwork; Special Moments, and more, and each shares the trials of working women and the special joys that achieving career dreams can bring. Readers will laugh, cry and nod in agreement as they connect with women who are not just making a living, but making a life.",
        "Category": " Self-help , Affirmations",
        "Publisher": "Hci",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Cats: The Most Comprehensive Guide to All the World's Breeds.",
        "Authors": "By Cutts, Paddy",
        "Description": "",
        "Category": "",
        "Publisher": "Longmeadow Pr",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Yuwipi: Vision and Experience in Oglala Ritual",
        "Authors": "By Powers, William K.",
        "Description": "A profoundly spiritual book, Yuwipi describes a present-day Oglala Sioux healing ritual that is performed for a wide range of personal crises. The vivid narrative centers on the experience of a hypothetical father and son in need of spiritual and physical assistance. The author combines the Yuwipi ceremony with two ancient Sioux rituals often performed in conjunction with it, the vision quest and the sweat lodge. Wayne Runs Again, suffering from alcoholism and worried about his father’s health, seeks out a shaman who, while bound in darkness, calls on supernatural beings to free him and to communicate. While the young man undergoes purification in a sweat lodge and waits on a hill for a vision, the community prays for him and his father. The ceremony serves not only to cure the sick but also to reaffirm the continuity of Oglala society.",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "University of Nebraska Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Sex and Sensibility: The Thinking Parent's Guide to Talking Sense About Sex",
        "Authors": "By Roffman, Deborah M.",
        "Description": "How young is too young to talk with children about sex and reproduction? Are we clear as adults about the meaning of the words \"sex\" and \"sexuality,\" or \"gender\" and \"sexual orientation\"? Do we know what we want our children to think and value about sexuality, and how to combat unhealthy cultural influences?With a rare directness and clarity about these profoundly important issues, nationally recognized sexuality educator Deborah Roffman challenges and teaches readers to develop a blueprint for opening the lines of communication with children of all ages. Raising sexually healthy children requires that we master what Roffman identifies as five core parenting skills: we must affirm our children's emerging sexuality; provide accurate sexual information; demonstrate the connection between values and action; set safe and healthy limits; and provide constant and effective anticipatory guidance. Powerfully instructive on how to talk in ways that will be meaningful to kids, Sex and Sensibility will help parents confidently interpret and comfortably respond to virtually any question a child might pose or any situation that arises.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Dynamite Salary Negotiations: Know What You're Worth and Get It!",
        "Authors": "By Krannich, Ronald L. and Krannich, Caryl Rae",
        "Description": "Explains the process of salary negotiation, from acquiring salary information and setting realistic expectations to handling tough interview questions and finalizing job offers",
        "Category": " Business & Economics , Careers , Job Hunting",
        "Publisher": "Impact Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Paris Real Guide",
        "Authors": "By Kate Baillie, Martin Dunford, Philip C. Lee",
        "Description": "",
        "Category": "",
        "Publisher": "Hungry Minds Inc,U.S.",
        "Price Starting With ($)": "6.43",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Helping Yourself Help Others: A Book for Caregivers",
        "Authors": "By Golant, Susan K. and Carter, Rosalynn",
        "Description": "Having cared at home for her ailing father and grandfather, Rosalynn Carter's involvement has taught her that Americans are in the middle of a caregiving crisis. In this book, Mrs. Carter addresses the social issues that have created this crisis and offers practical solutions to the problems caregivers typically experience, such as isolation, burnout, anger, and helplessness.",
        "Category": " Health & Fitness , General",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "9.48",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Anton the Dove Fancier: Anton the Dove Fancier",
        "Authors": "By Gotfryd, Bernard",
        "Description": "A collection of stories depict the author's journey through the Holocaust as a young boy, from the first hints of war on the tranquil Polish countryside, through the ghettos and concentration camps, to bittersweet post-war reunions",
        "Category": " History , Jewish",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "In Laws/Out Laws: How to Make Peace With His Family and Yours",
        "Authors": "By Bilofsky, Penny and Sacharow, Fredda",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "An Ocean Apart",
        "Authors": "By Pilcher, Robin",
        "Description": "A moving evocation of the healing process follows David from his native Scotland to Long Island, where a gardening job and a lonely young boy help him discover reasons to go on living after the death of his wife from cancer. A first novel. 100,000 first printing.",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "My Rose: An African American Mother's Story of AIDS",
        "Authors": "By Bell, Geneva E.",
        "Description": "AIDS continues to be a forbidden topic in the African American community. My Rose is Geneva Bell's moving story of her gay son, Jeffery, as he lived with and eventually died of AIDS. It is a plainspoken, personal account of a mother's devastation, of her shame and her anger at God - but also of the deep faith that enabled her to come to terms with this tragedy, even without the full support of the church.Study questions are provided at the end of each chapter for individual reflection and group discussion. A list of suggested resource books and organizations is also included.",
        "Category": " Biography & Autobiography , Medical (incl. Patients)",
        "Publisher": "Pilgrim Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "It's Never Too Late: 150 Men and Women Who Changed Their Careers",
        "Authors": "By Otterbourg, Robert K.",
        "Description": "Offers case histories of successful career changers, discusses how to plan a career change, and examines opportunities in education, health care, law, community service, retail and service businesses, farming, and communications",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Barron's Educational Series, inc",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Too Late the Phalarope",
        "Authors": "By Alan Paton",
        "Description": "",
        "Category": "",
        "Publisher": "MacMillan Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Parent Effectiveness Training",
        "Authors": "By Gordon, Thomas",
        "Description": "",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1975"
        }
    },
    {
        "Title": "Helping Children Grieve",
        "Authors": "By Huntley, Theresa M.",
        "Description": "Shows how children of various ages understand death and offers positive ways for parents and other caring adults to help them grieve",
        "Category": "",
        "Publisher": "Augsburg Fortress Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Golf in the Kingdom (An Esalen Book)",
        "Authors": "By Murphy, Michael",
        "Description": "",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Battered Woman",
        "Authors": "By Walker, Lenore E.",
        "Description": "Based on case studies of a clinical psychologist, this book theorizes that battered women become trapped in a learned helplessness syndrome, become convinced that there is nothing they can do to help themselves, and so continue the relationship",
        "Category": " Family & Relationships , Abuse , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1980"
        }
    },
    {
        "Title": "Tathea",
        "Authors": "By Perry, Anne",
        "Description": "The lovely Queen Tathea guided her country through many peaceful years. But in one fateful moment on one bloody, brutal night, her kingdom - and her life- were changed forever. Now, exiled from the land she loves, she is about to embark upon an extraordinary journey. Thrilling and surprising, full of danger and adventure, it will lead her to a deeper understanding of life's important questions - and inspire her to spread new hope throughout the world.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Decorating With Fabric Liberty Style",
        "Authors": "By Watkins, Charmian",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Cottage Style",
        "Authors": "By Caringer, Denise L. (EDT)",
        "Description": "Breaks one of the hottest categories of decorating into doable increments with chapters on furnishings, fabrics, floor coverings, window treatments, and choosing and arranging accessories.Ideas include whole-room schemes, as well as dozens of small ideas readers can adapt to warm—and charm—their homes.Covers the range of styles from rustic to refined.Helps readers find ideas and adapt them to create the cottage-style of their dreams, no matter where they live.\"Finding Your Style\" tip boxes throughout the book move readers from inspiration to action.",
        "Category": " House & Home , Decorating",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Say Yes to Change: 25 Keys to Winning in Times of Transition",
        "Authors": "By Cappannelli, George A. and Cappannelli, Sedena C.",
        "Description": "Explains how to take advantage of opportunities to develop new skills and experience new things, covering topics including networking, balance, sexuality, spirituality, humor, and honor.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Walking Stick Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Burn Rate : How I Survived the Gold Rush Years on the Internet",
        "Authors": "By Wolff, Michael",
        "Description": "For much of the 1990s, starting up a business on the Internet offered young go-getters with a taste for risk the fastest route to glittering prosperity. Our light-speed economy has made possible a new American dream, to take an idea overnight from the kitchen table to hundreds of millions of dollars in market value. But the desperate Internet entrepreneur knows every day, every night -- that the chances of success and survival dwindle at the same rate as the cash evaporates. Make the right deals, announce the right products at the right time, and the investors will beat down your doors with money. Falter, and the venture capitalists will eat you alive.  Michael Wolff was one of the first to see the potential of the Internet and one of the pioneers of new media. As he labored to build his own company, Wolff, a former journalist, knew he had stumbled on the seminal business story of the 1990s. Burn Rate is about the heart-in-your-throat struggles of being an entrepreneur. It is about witnessing an industry being born: the founding of Wired magazine, the launch of Time Warner's much-touted Pathfinder, the conflict between content centered on the East Coast and technology on the West Coast, the rise of the search engines, the dominance and dysfunctionality of America Online, and the thud of Microsoft stumbling and falling down on the Net.  In the precarious world of the Internet, where income is a rosy projection and profit little more than a hope and a prayer, a company is no better than the confidence it radiates to its potential partners. After the freewheeling early years of the World Wide Web, the financial prospects of fledgling Web businesses collectively dropped in one stunning month when Wired, the most famous Internet company, failed to launch its stock. Wolff found himself at the head of a rapidly expanding company with seven weeks of capital remaining, trapped between the insatiable needs of his business and the chilling machinations of his investors. With the clock ticking, his only hope was to strike a winning deal.  With mordant wit, Burn Rate portrays life on the bleeding edge of capitalism -- a realm where your savior, the venture capitalist, may also be your undoing. A Faustian figure, the venture capitalist reveals to Michael Wolff the secret workings of business, as well as the human dimensions of how companies are made, bought, and sold. But the price he asks in return is steep. He never risks too much of his own money but makes sure that he will profit best and first from the entrepreneur's work.  As Wolff builds his business, you'll get to know the geeks, billionaires, weasels, and, of course, visionaries he meets along the way. Louis Rossetto, the unemployed expat who creates Wired. Walter Isaacson, the prince of Time Warner, who throws the resources of America's largest media company behind the Web. The boy investor, the \"dumb money\" who backs Wolff's company. Halsey Minor, the executive recruiter who founds a publishing empire on the Net. The CMP boys, the computer magazine publishers who are desperate to get into the Internet game. Robert Maxwell's children, whose high-flying company is one of the first bubbles to burst on the Internet. Even Barry Biller, who advises Wolff that getting in on the ground floor is good only if you're still standing in the end.  Wolff discovers, much to his own consternation, that his work, inspiration, and imagination entitle him to no more than a minor share of his own company's potential wealth. And, in the end,",
        "Category": " Business & Economics , Entrepreneurship",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Eat and Heal",
        "Authors": "By Frank W. Cawood and Associates (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Stress Management: A Comprehensive Guide to Wellness",
        "Authors": "By Charlesworth, Edward A. and Nathan, Ronald G.",
        "Description": "STRESS MANAGEMENT helps you identify the specific areas of stress in your life--family, work, social, or emotional--and offers proven techniques for dealing with every one of them. Here is a wealth of practical advice you can use right away.",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Kiplinger's Looking Ahead 70 Years of Forecasts from the Kiplinger Washington Letter",
        "Authors": "By Shay, Susan Ten Abby",
        "Description": "Stock market crashes in '29 and '87. World war in Europe and Asia. The Baby Boom. Television. Office computers. Automated manufacturing. Migration to the Sun Belt. The economic rise of Japan. VCRs. Booming world trade and investment. ATMs. Environmental activism. Fax machines. Stock market surge in the '80s. Soaring budget deficits. Equal-opportunity revolution. Corporate downsizing. Collapse of the Soviet empire.Before these events, inventions and trends - so familiar to us today - became history, they were the future. No one was fully prepared for them, but regular readers of The Kiplinger Washington Letter were less surprised than most people. That's because all these developments, and dozens more of similar significance, were foreshadowed in weekly issues of the Kiplinger Letter, the oldest and most widely read forecasting publication in the world.Kiplinger's Looking Ahead presents a compilation of hundreds of excerpted forecasts from 70 years of the Letter. In these pages, you'll find example after example of bold, informed predictions made months and even years ahead of the final outcome. Of course, no forecaster has a flawless record, so you'll find a fair number of miscalls, too, ranging from the election of Thomas Dewey in '48 to periodic predictions of Fidel Castro's imminent overthrow.Kiplinger's Looking Ahead is much more than a collection of forecasts and judgments. It's also a unique journey through the last seven decades, a period of accelerating change in America and the world. In its pages you'll witness the gradual transformation of an insular America into the greatest superpower of a global economy.There's much truth in the saying \"the more things change, the more they remain the same,\" so there will be a familiar ring to many items from earlier times - discussions of an overly complex tax code in the 1920s, fear of soaring imports from Japan in the '30s and '50s and the tendency of democracies to habitually exceed government budgets.To appreciate accurate forecasting in decades past, you'll need to recall what actually happened, and when. To refresh your memory, each decade chapter of Kiplinger's Looking Ahead opens with a lively narrative highlighting major events and trends. Timelines mark some of the cultural and social milestones that paralleled the economic trends tracked by Kiplinger.Hundreds of photographs and political cartoons truly bring the text selections to life, illustrating what Americans experienced and what they - and the general media - through about events as they happened.Every issue of The Kiplinger Washington Letter focuses on the future, so this book wouldn't be an accurate representation if it pointed the telescope only backward. The last chapter of the book, highlighting Letter excerpts from the first years of the '90s, offers many intriguing Kiplinger forecasts of what to expect between now and the year 2000.",
        "Category": " Reference , General",
        "Publisher": "Kiplinger Books",
        "Price Starting With ($)": "7.46",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Endometriosis Sourcebook",
        "Authors": "By Ballweg, Mary Lou (EDT) and Endometriosis Association (COR)",
        "Description": "The Endometriosis Sourcebook is the definitive resource for the millions of sufferers urgently seeking up-to-date, authoritative information. It covers everything women need to know, including the latest research, treatments, nutrition and advice.",
        "Category": " Health & Fitness , Reference",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "6.47",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Princes in the Tower",
        "Authors": "By Weir, Alison",
        "Description": "Despite five centuries of investigation by historians, the sinister deaths of the boy king Edward V and his younger brother Richard, Duke of York, remain two of the most fascinating murder mysteries in English history. Did Richard III really kill “the Princes in the Tower,” as is commonly believed, or was the murderer someone else entirely? Carefully examining every shred of contemporary evidence as well as dozens of modern accounts, Alison Weir reconstructs the entire chain of events leading to the double murder. We are witnesses to the rivalry, ambition, intrigue, and struggle for power that culminated in the imprisonment of the princes and the hushed-up murders that secured Richard’s claim to the throne as Richard III. A masterpiece of historical research and a riveting story of conspiracy and deception, The Princes in the Tower at last provides a solution to this age-old puzzle.",
        "Category": " Biography & Autobiography , Royalty",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Biosphere Politics",
        "Authors": "By Rifkin, Jeremy",
        "Description": "Rifkin challenges the conventional vision of the future, which promises security through military might and high technology, setting instead a revolutionary new course for science, economics, and politics that is grounded in humanity's newfound responsibilities to the living earth. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Social Science , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "A Changed Man: A Novel (P.S.)",
        "Authors": "By Prose, Francine",
        "Description": "“Francine Prose has a knack for getting to the heart of human nature. . . . We are allowed to enter the moral dilemmas of fascinating characters whose emotional lives are strung out by the same human frailties, secrets and insecurities we all share.”—USA Today One spring afternoon, Vincent Nolan, a young neo-Nazi walks into the office of a human rights foundation headed by Meyer Maslow, a charismatic Holocaust survivor. Vincent announces that he wants to make a radical change. But what is Maslow to make of this rough-looking stranger with Waffen SS tattoos who says that his mission is to save guys like him from becoming guys like him? As Vincent gradually turns into the sort of person who might actually be able to do that, he also begins to transform everyone around him, including Maslow himself. Masterfully plotted, darkly comic, A Changed Man poses essential questions about human nature, morality, and the capacity for change, illuminating the everyday transactions, both political and personal, in our lives.",
        "Category": " Fiction , Literary",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "The Intruder",
        "Authors": "By Blauner, Peter",
        "Description": "Can a good man go too far to protect his family? That is the question underlying this gripping tale of a family fighting for its life, which pulls the reader into its stranglehold of terror in the tradition of Straw Dogs and Cape Fear.Having survived a childhood of physical beatings and psychological torture, successful Manhattan lawyer Jacob Schiff cherishes his stable family life with his wife, Dana, a psychiatric social worker, and their teenage son, Alex. But Jake sees it all unraveling when John Gates, a homeless man who has become Dana's patient, starts stalking her and menacing the family. As Gates's behavior becomes even more bizarre and violent, and no one seems able to stop him, Jake is driven to the breaking point by fear and desperation and takes a fatal step that could destroy everything he cares about.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "The Seven Storey Mountain (Harvest/HBJ Book)",
        "Authors": "By Merton, Thomas",
        "Description": "One man's search to find his role in the world is revealed in the writer's portrait of his youthful political activism and entry into a Trappist monastery",
        "Category": "",
        "Publisher": "Harcourt, Brace and Co",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "Gods and Generals: A Novel of the Civil War (Civil War Trilogy)",
        "Authors": "By Shaara, Jeff",
        "Description": "The New York Times bestselling prequel to the Pulitzer Prize–winning classic The Killer Angels   In this brilliantly written epic novel, Jeff Shaara traces the lives, passions, and careers of the great military leaders from the first gathering clouds of the Civil War. Here is Thomas “Stonewall” Jackson, a hopelessly by-the-book military instructor and devout Christian who becomes the greatest commander of the Civil War; Winfield Scott Hancock, a captain of quartermasters who quickly establishes himself as one of the finest leaders of the Union army; Joshua Chamberlain, who gives up his promising academic career and goes on to become one of the most heroic soldiers in American history; and Robert E. Lee, never believing until too late that a civil war would ever truly come to pass. Profound in its insights into the minds and hearts of those who fought in the war, Gods and Generals creates a vivid portrait of the soldiers, the battlefields, and the tumultuous times that forever shaped the nation.",
        "Category": " Fiction , Sagas",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Born to Grill: An American Celebration",
        "Authors": "By Love, Sara (ILT), Jamison, Cheryl Alters, and Jamison, Bill",
        "Description": "Two award-winning experts on outdoor cooking present three hundred recipes for all-American standbys and regional favorites hot off the grill, along with their own recommended technique and a helping of grilling lore and color illustrations. Reprint.",
        "Category": " Cooking , Methods , Barbecue & Grilling",
        "Publisher": "Harvard Common Press",
        "Price Starting With ($)": "6.32",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "The Art of Cooking for Two",
        "Authors": "By Coralie and Newton, Astrid Castle",
        "Description": "",
        "Category": "",
        "Publisher": "101 Productions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "One Dish Meals The Easy Way",
        "Authors": "By Reader's Digest Association",
        "Description": "A guide to cooking for one offers recipes for everything from stews to vegetarian dishes to stir fries to pasta, and includes information on microwaved meals, per serving nutrition counts, and ingredients substitutes. 20,000 first printing.",
        "Category": " Cooking , Reference",
        "Publisher": "Readers Digest Association",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Country: Classic and Contemporary Ideas for Living",
        "Authors": "By Rogers, Barbara Radcliffe",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Darkness Visible: A Memoir of Madness",
        "Authors": "By Styron, William",
        "Description": "A work of great personal courage and a literary tour de force, this bestseller is Styron's true account of his descent into a crippling and almost suicidal depression. Styron is perhaps the first writer to convey the full terror of depression's psychic landscape, as well as the illuminating path to recovery.",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Vintage",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Paddy Clarke Ha Ha Ha",
        "Authors": "By Doyle, Roddy",
        "Description": "It is 1968. Patrick Clarke is ten. He loves George Best, Geronimo, and the smell of his hot water bottle. He hates zoos, kissing, and the boys from the Corporation houses. He can't stand his little brother Sinbad. He wants to be a missionary like Father Damien, and he coerces the McCarthy twins and Willy Hancock into playing lepers. He never picks the scabs off his knees before they're ready.Kevin is his best friend. Their names are all over Barrytown, written with sticks in wet cement. They play football, knickknack, jumping to the bottom of the sea. They shoplift. Robbing Football Monthly means four million years in purgatory. But a good confession before you died and you'd go straight to heaven.Paddy wants to know why no one jumped in for him when Charles Leavy had been going to kill him. He wants to stop his da arguing with his ma. He's confused: he sees everything, but he understands less and less.",
        "Category": " Fiction , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Still A Babe After All These Years?",
        "Authors": "By Ken O'Brien",
        "Description": "",
        "Category": "",
        "Publisher": "Shoebox Greetings / Hallmark",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Jeanne Jones' Food Lover's Diet",
        "Authors": "By Jones, Jeanne",
        "Description": "Calorie, cholesterol, sodium, and fiber content information for more than five hundred foods supplements a diet program based on meals that are high in complex carbohydrates and fiber, low in cholesterol and sodium, and sucrose free",
        "Category": " Health & Fitness , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "The Natural Pharmacist: Your Complete Guide to Vitamins and Supplements",
        "Authors": "By Bratman, Steven (EDT), Kroll, David (EDT), and Depalma, Angelo",
        "Description": "Discover What Vitamins and Supplements Can Do for YouDid you know that scientific evidence suggests that many vitamins and supplements may be effective treatments for several of today's most common ailments? It's true. Millions are discovering the power of natural remedies. With this book, so can you.Inside you'll learn which vitamins or supplements may reduce the severity of cold symptoms, help prevent osteoporosis, improve sports performance, help relieve PMS symptoms, help osteoarthritis, and much more!Includes an A–Z guide to supplements, including: ·Vitamin C ·Zinc ·Creatine ·Glucosamine ·Lycopene ·Selenium ·Carnitine ·Coenzyme Q10 ·5-HTP ·Iron ·Folic Acid ·Calcium ·And much moreIt's all here in simple, straightforward language. You'll find yourself turning to this helpful, trusted companion again and again.",
        "Category": " Medical , Diet Therapy",
        "Publisher": "Prima Lifestyles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "EDITORS CHOICE:  Smithsonian",
        "Authors": "By Smithsonian Institution",
        "Description": "Celebrates  Smithsonian magazine's  20th birthday. The editors of Smithsonian Books reviewed 240 issues of the monthly publication and selected an eclectic assortment of articles on topics in the arts and sciences. With some 300 of the usual (for them) vivid illustrations, most in color. No scholarly paraphernalia. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Smithsonian",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "Descending into Greatness",
        "Authors": "By Hybels, Bill and Wilkins, Rob",
        "Description": "In a society where \"upward mobility\" is the highest goal, Bill Hybels asks a tough question: Do Christians place God's desires first-or their own? In Descending into Greatness, Hybels and writer Rob Wilkins take the example of Christ's downward journey as it was meant to be; the radical and essential answer for every Christian. In fourteen powerful chapters, the authors explore such topics as How Jesus managed power. The intentional decisions necessary to move down. The uplifting nature of true humility. Abundant life through dying to self. The ambush of joy. Moving down is never an easy matter that can be reduced to a formula. It involves a life committed to discipleship. Descending into Greatness introduces you to the touching stories of modern men and women committed to advancing the kingdom of God: from the pro football player, to the medical missionary, to a businessman wrestling with the priorities in the world of finance. Descending into Greatness asks tough questions and gives hopeful answers. Now, this powerful, urgent message also includes a discussion guide so that you can follow through, too. \"Like Christ, we must descend-into self-abandonment, unconditional giving, sacrifice, and death to self. And, like Christ, we will then ascend-into fulfillment, blessing, joy, and purpose.\"",
        "Category": " Religion , Christian Life , Personal Growth",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "6.74",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Norton Anthology of English Literature: Media Companion",
        "Authors": "By Abrams, M. H. (EDT)",
        "Description": "",
        "Category": " Literary Criticism , European , English, Irish, Scottish, Welsh",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Shakespeare On Management: Wise Business Counsel from the Bard",
        "Authors": "By Shafritz, Jay M.",
        "Description": "Long before the Harvard Business School, there was William ShakespeareWilliam Shakespeare's vast and important contributions to literature have long been acknowledged, but his shrewd insights into business and management have been all but ignored--until now. A pithy book of wise business musings from the bard,  Shakespeare On Management captures entertaining and uncannily accurate reflections on fifty-six of the most popular topics in business today, from mergers and acquisitions to office politics, power lunches to public relations. Think of  Hamlet, the poignant case of too-sensitive young executive who fails to move up the corporate ladder because of his inability to make decisions. Or  Julius Caesar, which at its heart is nothing of not an attempt at a hostile takeover by disgruntled stockholders. Or consider  King Lear, a warning to all executives of family businesses the perils of divestiture and early retirement.  Smart, thought-provoking, and astonishingly contemporary,  Shakespeare On Management is truly a time-tested classic that belongs on every well-read executive's bookshelf.",
        "Category": " Business & Economics , Management",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Hunting Season",
        "Authors": "By Barr, Nevada",
        "Description": "\"Readers familiar with Barr's entertaining national park mystery series know that Anna rarely finds tranquility in God's country. Her fans can only be grateful that there are still plenty of national parks left for Anna Pigeon to visit.\" (People)  When Anna answers a call to historic Mt. Locust, once a producing plantation and inn on Mississippi's Natchez Trace Parkway and now a tourist spot, the last thing she expects to encounter is murder. But the man Anna finds in the stand's old bedroom is no tourist in distress. He's nearly naked, and very dead, his body bearing marks consistent with an S&M ritual gone awry. On a writing table nearby is an open Bible, ominous passages circled in red.  It seems the deceased is the brother of Raymond Barnette, local undertaker and a candidate for sheriff, who wants to keep any hint of kinkiness out of the minds of the God-fearing populace. Ray may be hiding a house full of secrets in the old family homestead, but before Anna can start her investigation, she's waylaid by malevolent poachers, peevish coworkers, and a suddenly turbulent romantic life. And when hidden agendas and old allegiances are revealed, it's suddenly Anna's life that's on the line.  Tightly plotted, brilliantly suspenseful, and beautifully written, Hunting Season offers solid evidence that mankind can be as unpredictable and dangerous as the great outdoors.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Small Pleasures",
        "Authors": "By Waites, Raymond, Cavera, R., Maraia, C., and Riggs, C.",
        "Description": "A sourcebook of inexpensive home design projects, divided into four prevailing styles--Neo-Classical, Country Baroque, Country Classic, and Neo-Traditional--shows readers how to transform bookcases, do decoupage, and more.",
        "Category": " Art , General",
        "Publisher": "Bulfinch Pr",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "A Great Place to Work: What Makes Some Employers So Good--And Most So Bad",
        "Authors": "By Levering, Robert",
        "Description": "Explains what makes a company a good place to work and offers specific strategies for fostering a positive work environment",
        "Category": " Business & Economics , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.65",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "For God, Country and Coca-Cola: The Unauthorized History of the Great American Soft Drink and the Company That Makes It",
        "Authors": "By Pendergrast, Mark",
        "Description": "Uncovering family tensions and questionable tactics, this unauthorized history traces the evolution of Coca-Cola from its quiet beginnings to the influential giant of today",
        "Category": " History , United States , General",
        "Publisher": "Scribner Paper Fiction",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "The California Missions: A Complete Pictorial History and Visitor's Guide (Sunset Pictorial)",
        "Authors": "By Sunset",
        "Description": "Numerous photographs complement a history of California's twenty-one Spanish missions, historic relics of the industrious colonists",
        "Category": " History , United States , State & Local , West (AK, CA, CO, HI, ID, MT, NV, UT, WY)",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "The Fifty Year Wound: The True Price of America's Cold War Victory",
        "Authors": "By Leebaert, Derek",
        "Description": "Drawn from literature, strategy, biography, and economics, a meticulously researched history of the Cold War, complete with valuable lessons for today, examines the social, moral, financial, technological, and political sacrifices that America made to win the Cold War--sacrifices that still impact our nation in this day and age. 20,000 first printing.",
        "Category": " History , World",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    }
]