[
    {
        "Title": "Monsters, Inc. (Read-Along)",
        "Authors": "By Dom Deluise",
        "Description": "",
        "Category": "",
        "Publisher": "Walt Disney Records",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Crafts for Girls (American Girl Library)",
        "Authors": "By Pelikan, Judy (ILT) and Seamans, Sally",
        "Description": "Step-by-step instructions and illustrations make nineteen projects--for keeping or for giving to friends--fun and easy, including squiggle eggs, rainbow headbands, flower crowns, and rose-colored glasses. Original.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Golden Book of Sharks and Whales",
        "Authors": "By Daly, Kathleen N. and Spence, James (ILT)",
        "Description": "Describes the characteristics and behavior of a variety of species of sharks and whales, and looks at their unique place in the marine ecology",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Dora's Costume Party! (Dora the Explorer)",
        "Authors": "By Saunders, Zina (ILT) and Ricci, Christine",
        "Description": "It's almost time for Dora's Halloween costume party, and everyone is getting ready. But Boots has a problem -- he can't decide what to be. Come to the party to help Dora and friends celebrate Halloween...and find out how Boots solves his costume crisis!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Halloween",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Tiny Terrors, Level 2 Extreme Reader (Extreme Readers)",
        "Authors": "By Kenah, Katharine",
        "Description": "Dare to read the extreme!The Tiny Terrors Extreme Reader introduces spine-tingling facts about some of the smallest and deadliest, creatures of the world including, the blue poison dart frog, blue-ringed octopus, flea, fly, killer bee, hornet, mantis shrimp, mosquito, puffer fish, sea anemone, scorpion, tarantula, termite, and tick. This unique level 2 nonfiction reader for kindergarten to grade 1 learners will help them explore reading on their own. Dramatic photographs, graphic illustrations, and an amazing “Extreme Facts” list will keep them turning the page. The fact-based approach also makes this book a valuable resource. Children will love to learn to read when given this Extreme Reader!Children will love to learn to read when given this Extreme Reader! The best-selling Extreme Readers is an exciting series for early readers to explore reading on their own. These unique leveled nonfiction readers feature over 30 titles for preschool to grade 2, covering high-interest topics that will grab children’s attention from the very first page. With the current educational emphasis on reading in content areas and reading comprehension, the Extreme Readers will be a welcome addition at school and at home! Check out our other titles!",
        "Category": " Juvenile Nonfiction , Animals , General",
        "Publisher": "Brighter Child",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Pug Hill",
        "Authors": "By Pace, Alison",
        "Description": "For Holly Golightly, there was always Tiffany’s.  For me, there’s always Pug Hill.  For as long as I’ve lived in New York, whenever I’ve just wanted to think, or relax, or be happy, or even sad, my destination of choice has been, without fail, Pug Hill.For Hope McNeill, pugs are love, unconditional friendship, happiness, and freedom—all qualities currently in short supply in her own life.  She’s also short on time and apartment space, and for those reasons she doesn’t have a pug of her own.  But she does have Pug Hill in Central Park, where pugs (and their owners) from all over New York City convene.She also has a serious crush on one of her co-workers at the Metropolitan Museum of Art, a flailing relationship with her squash-playing, cold-weather-loving boyfriend, and an unspeakable fear of public speaking. When Hope’s father calls with a daunting assignment--to make a speech at her parent’s fortieth wedding anniversary party--Hope is completely taken off guard.  As a last resort, she signs up for a public speaking class, but can't help wondering, will it be enough? Some fears are so big that even all the pugs in the world might not be enough...",
        "Category": " Fiction , Women",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Mom and Me Cookbook",
        "Authors": "By Karmel, Annabel",
        "Description": "The perfect cookbook for teaching little ones the joy of preparing meals, with basic cooking techniques, tips, simple first recipes, and tasty, nutritious meal ideas. A family-oriented cookbook that helps children ages three and up work with their parents to prepare an assortment of yummy treats.   Karmel, the bestselling author of First Meals and Superfoods for Babies and Children, teaches kids the fun of cooking and encourages healthy eating habits. Includes delicious recipes, from cookies and cupcakes to pancakes and pizzas! With step-by-step instructions and gorgeous colorful photographs, both parents and children will become top chefs in no time! A fantastic addition to your kitchen.",
        "Category": " Juvenile Nonfiction , Cooking & Food",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "A Framework for Understanding Poverty: Modules 1-9 Workbook",
        "Authors": "By Ruby K. Payne, Ph.D.",
        "Description": "",
        "Category": "",
        "Publisher": "RFT Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Garage Sale and Flea Market Annual: Cashing in on Today's Lucrative Collectibles Market (Garage Sale and Flea Market Annual, 8th ed)",
        "Authors": "By Huxford, Bob and Huxford, Sharon",
        "Description": "Lists prices for a wide variety of items that might be found at garage sales and flea markets, including toys, glassware, china, souvenirs, advertising and promotional pieces, and other collectibles",
        "Category": " Antiques & Collectibles , General",
        "Publisher": "Collector Books",
        "Price Starting With ($)": "7.46",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Horizons of Mission (New Church's Teaching Series)",
        "Authors": "By Presler, Titus",
        "Description": "In this volume of the New Church's Teaching Series, Titus Presler offers a fresh vision of mission in the multicultural environment of a global community.",
        "Category": " Religion , Christian Ministry , Missions",
        "Publisher": "Cowley Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "The Laws of Spirit: Simple, Powerful Truths for Making Life Work",
        "Authors": "By Millman, Dan",
        "Description": "The author of Way of the Peaceful Warrior explains twelve of the spiritual laws upon which all religions and moral systems are founded, laws that point the way to a life of harmony and insight. 100,000 first printing. $50,000 ad/promo. Tour. IP.",
        "Category": " Body, Mind & Spirit , Spiritualism",
        "Publisher": "H. J. Kramer",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Conscious Evolution: Awakening Our Social Potential",
        "Authors": "By Hubbard, Barbara Marx",
        "Description": "A well-known futurist reveals a quantum change in society and points the way to the third millennium. Barbara Marx Hubbard issues a call to action for the current generation to fulfill its creative potential. Hubbard asserts that we must quickly become capable of wise and ethical guidance of evolution itself, if life on Earth is to survive.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "New World Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Levi's Will",
        "Authors": "By Cramer, W. Dale",
        "Description": "Will flees his Old Order community at the age of 19, leaving behind a pregnant girlfriend and all things Amish. He begins a new life, joining the army and later marrying and having two sons of his own. But his new life, and his new family, are tainted by the hidden sins of his past. Hoping to patch things up with his father,Will finally takes his new family to meet the old one. But his father rejects him. Determined,Will spends years working to regain his father's respect. But Will's own sons may pay the price. Or can Will learn that love, not work, will heal the past and give hope to his family's future",
        "Category": " Fiction , Religious",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Stealing Athena",
        "Authors": "By Essex, Karen",
        "Description": "Stealing Athena is the story of two women, separated by centuries but united by their association with some of the world's greatest and most controversial works of art. Aspasia, a philosopher and courtesan to visionary politician Pericles during Athens's Golden Age, defies societal restrictions to become fiercely influential in Athens' power circle. Mary, the Countess of Elgin and a beautiful Scottish heiress, charms the fearsome men of the Ottoman Empire to make possible her husband's costly acquisitions, all the while brazenly defying the social conventions of her time. Both women prevail yet pay a heavy price for their rebellion. A tale of romance, intrigue, greed, and glory, Stealing Athena interweaves the lives of two of history's most beguiling heroines.",
        "Category": " Fiction , Literary",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Rebecca's Promise (The Adams County Trilogy)",
        "Authors": "By Eicher, Jerry S.",
        "Description": "Readers of Amish fiction will delight in this new series by a veteran author in this popular genre (50,000 Jerry Eicher books sold).Rebecca Keim has just declared her love to John Miller and agreed to become his wife. But she's haunted by her schoolgirl memories of a long ago love—and a promise made and a ring given. Is that memory just a fantasy come back to destroy the beautiful present...or was it real?When Rebecca's mother sends her back to the old home community in Milroy to be with her aunt during and after her childbirth, Rebecca determines to find answers that will resolve her conflicted feelings.Faith, love, and tradition all play a part in Rebecca's divine destiny.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "The Alphabet from A to Y With Bonus Letter Z!",
        "Authors": "By Chast, Roz and Martin, Steve",
        "Description": "The acclaimed entertainer and bestselling author Steve Martin and the wildly clever New Yorker cartoonist Roz Chast team up in a weird, wonderful excursion through the alphabet. The ABCs have never had it so good. Created by two of today’s wittiest, most imaginative minds, The Alphabet from A to Y with Bonus Letter Z! is a sheer delight from A to Z. In twenty-six alliterative couplets, Steve Martin conjures up much more than mere apples and zebras. Instead we meet Horace the hare, whose hairdo hides hunchbacks, and Ollie the owl, who owed Owen an oboe. Roz Chast contributes the perfect visual settings for Martin’s zany two-liners. Her instantly recognizable drawings are packed with humorous touches both broad and subtle. Each rereading—and there will be many—delivers new delights and discoveries. There, hidden behind Bad Baby Bubbleducks, is a framed picture of a beatnik holding balloons; and the letter C finds clunky Clarissa all clingy and clueless adrift in a landscape cluttered with images ranging from a curiously comfortable clown to Chuck’s Chili stand. A smart, laugh-inducing introduction to the alphabet for young children, The Alphabet from A to Y with Bonus Letter Z! will also enchant adults with its matchless mix of the sophisticated and the silly.",
        "Category": " Juvenile Fiction , Concepts , Alphabet",
        "Publisher": "Flying Dolphin Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Rebecca's Return (The Adams County Trilogy)",
        "Authors": "By Eicher, Jerry S.",
        "Description": "Readers who enjoyed Rebecca's Promise will eagerly devour the next entry in this Amish series set in southern Ohio. Rebecca Keim returns to Wheat Ridge full of resolve to make her relationship with John Miller work. But in her absence, John has become suspicious of the woman he loves. Before their conflict can be resolved, John is badly injured and Rebecca is sent back to Milroy to aid her seriously ill Aunt Leona.In Milroy, Rebecca once again visits the old covered bridge over the Flatrock River, the source of her past memories and of her promise made so long ago.Where will Rebecca find happiness? In Wheat Ridge with John, the man she has agreed to marry...or should she stake her future on the memory that persists...and the ring she has never forgotten? Does God have a perfect will for Rebecca—and if so how can she know that will?",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Love Finds You in Paradise, Pennsylvania",
        "Authors": "By Lough, Loree",
        "Description": "For as long as anyone can remember, tourists have flocked to the quaint town of Paradise, Pennsylvania, where Amish buggies are as common as shops selling handcrafted goods. But to attorney Julia Spencer this town is anything but a paradise. Raised in foster homes, Julia has succeeded in life only through steely determination and independence. The closeknit Amish people are a mystery to her, but local veterinarian Simon Thomas knows them well and is fiercely protective of their simple ways, which are increasingly threatened by the outside world. When Julia agrees to defend a local teenager charged in a case involving an Amish boy, she and Simon find themselves on opposite sides of an intense and emotional legal battle. Just when it seems they will never understand one another, God has something to teach them both about the power of forgivenessand the joys to be found in Paradise.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Summerside Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "You and Your Puppy: Training and Health Care for Your Puppy's First Year",
        "Authors": "By Hodgson, Sarah and Debitetto, James",
        "Description": "First published in 1995, this authoritative book has helped nearly 40,000 families raise healthy, content pets. Packed with illustrations and photos, it explains how to keep puppies healthy, put them through basic training, correct behavior problems, and integrate them into family life.Since the initial publication, coauthor Sarah Hodgson has become the media's favorite puppy expert—a dog trainer who writes for The New York Times, appears on the Rosie O'Donnell Show,\"\" the \"\"Today Show,\"\" and other programs, and even helped Katie Couric choose a puppy.\"\"",
        "Category": " Pets , Dogs , General",
        "Publisher": "*Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "The Royal Pain",
        "Authors": "By Davidson, MaryJanice",
        "Description": "In a world nearly identical to ours, the North won the Civil War, Ben and JLo got married, and everyone dresses well to attend the Grammys. Oh, and Russia never sold Alaska to the U.S. Instead, Alaska is a rough, beautiful country ruled by a famously eccentric royal family, including oldest daughter, Princess Alexandria, whose acid wit and bad case of insomnia have turned her into a tabloid darling, a palace problem, and overall. . .The Royal PainMarine biologist Dr. Shel (\"Never Sheldon\") Rivers has a problem. Some princess expects him to wait on her, hand and dimpled foot. His boss is taken with the royal redhead--brunette, whatever, it's not like he keeps track of that stuff--and nobody realizes that he just wants to be left alone in his lab. All alone. All the time. Weekends, holidays. . .it's all good.Now here's Miss Royalpants, insisting that he escort her around the marine institute, explain what he's doing, kiss her until her toes curl. . .no, wait, that was his idea. She's not even apologetic about being born into a royal family! Says it's his problem to overcome, not hers. Which leaves him with one option: to kiss her again. And again. And. . .So she's nothing like he expected. In fact, Dr. Rivers can see that this fantastic, exasperating woman has problems no princess should ever have to deal with. And he has an idea to help her get some much-needed sleep. Of course, it involves getting very, very tired beforehand, but if she's up to it, then so is he. . .In this delightfully madcap sequel to The Royal Treatment, the Baranov family is back and as unpredictable as ever, and a prickly princess and cranky Ph.D. are about to discover that love conquers attitude every time. . .",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Teaching Telephone Activity Book",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "9118043",
        "Price Starting With ($)": "5.59",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Childrens Illustrated Dictionary",
        "Authors": "By JOHN GRISEWOOD",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Polar Bear, Polar Bear, What Do You Hear?",
        "Authors": "By Bill Martin Jr",
        "Description": "",
        "Category": "",
        "Publisher": "Henry Holt and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Mom Can Fix Anything (Emergent Reader Science; Level 2)",
        "Authors": "By Graves, Kimberlee",
        "Description": "A young girl follows her mother's example and learns to repair various items using simple tools.",
        "Category": " Self-help , General",
        "Publisher": "Creative Teaching Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "The Secret of Parenting: How to Be in Charge of Today's Kids--from Toddlers to Preteens--Without Threats or Punishment",
        "Authors": "By Wolf, Anthony E.",
        "Description": "Essential advice from the author of the bestselling Get Out Of My LifeToday's children--from toddlers to preteens--challenge their parents in ways that would have been unthinkable a generation ago, notes Anthony E. Wolf, and parents are often uncertain about how to cope.In his new book, Wolf presents a fresh perspective on this less pleasant behavior and a surprisingly simple method for dealing with it. He argues that punishments and rewards don't work and may even be counterproductive. Instead, parents must act swiftly and decisively following Wolf's easy but powerful technique. Using numerous examples of effective and ineffective parent-child interactions, he offers practical advice on a wide range of basic issues, from tantrums and back talk, to getting kids off to school in the morning and eliminating sibling fights.Humorous and easy to use, The Secret of Parenting is guaranteed to dramatically increase the joy parents get from raising their children.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Desire of Ages: God's Greatest Gift",
        "Authors": "By White, Ellen G.",
        "Description": "",
        "Category": "",
        "Publisher": "Better Living Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Alice's Adventures in Wonderland and Through the Looking-Glass (Signet Classics)",
        "Authors": "By Carroll, Lewis",
        "Description": "A little girl falls down a rabbit hole and discovers a world of nonsensical and amusing characters",
        "Category": " Fiction , General",
        "Publisher": "New Amer Library (Mm)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1960"
        }
    },
    {
        "Title": "Mary, Queen of Scots",
        "Authors": "By Fraser, Antonia",
        "Description": "Author of Marie AntoinetteShe was the quintessential queen: statuesque, regal, dazzlingly beautiful. Her royal birth gave her claim to the thrones of two nations; her marriage to the young French dauphin promised to place a third glorious crown on her noble head.Instead, Mary Stuart became the victim of her own impulsive heart, scandalizing her world with a foolish passion that would lead to abduction, rape and even murder. Betrayed by those she most trusted, she would be lured into a deadly game of power, only to lose to her envious and unforgiving cousin, Elizabeth I. Here is her story, a queen who lost a throne for love, a monarch pampered and adored even as she was led to her beheading, the unforgettable woman who became a legend for all time.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Laurel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "The Judgment of Caesar: A Novel of Ancient Rome (Novels of Ancient Rome)",
        "Authors": "By Saylor, Steven",
        "Description": "In 48 B.C., Roman generals Caesar and Pompey have long engaged in a battle to rule the world. Now, as Pompey plots a reckless stand on the banks of the Nile, Gordianus the Finder-who has brought his wife Bethesda to the river seeking a cure for her in its sacred waters-finds himself suddenly at the heart of a series of treacherous and history-altering events.While Caesar and Cleopatra embark on a legendary romance, Egypt remains ravaged by the brutal contest between the Queen and her brother King Ptolemy. Worst of all for Gordianus, his once-disowned son and Caesar's right-hand man, stands falsely accused of murder. Caesar's judgment will decide Meto's fate, and it is up to Gordianus to somehow overcome colossal malevolent forces to reveal the carefully obscured truth and spare his son's life.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "How & When to Tell Your Kids About Sex: A Lifelong Approach to Shaping Your Child's Sexual Character",
        "Authors": "By Jones, Stanton L. and Jones, Brenna B.",
        "Description": "",
        "Category": " Philosophy , Ethics & Moral Philosophy",
        "Publisher": "NavPress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Unlucky: A Season of Struggle in Minor League Professional Soccer",
        "Authors": "By Ungrady, Dave",
        "Description": "",
        "Category": "",
        "Publisher": "Sports Pub Intl",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Complete Idiot's Guide(R) to Private Investigating",
        "Authors": "By Brown, Steven Kerry",
        "Description": "",
        "Category": " Law , Criminal Law , General",
        "Publisher": "Alpha",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Perfect (2) (The Paradise series)",
        "Authors": "By McNaught, Judith",
        "Description": "From the New York Times bestselling author of the Paradise and Westmoreland Dynasty series comes a romantic adventure that seamlessly melds danger and desire.A rootless foster child, Julie Mathison has blossomed under the love showered upon her by her adoptive family. Now a lovely and vivacious young woman, she is a respected teacher in her small Texas town and is determined to give back all the kindness she has received, believing that nothing can ever shatter the perfect life she has fashioned. Zachary Benedict is an actor whose Academy Award-winning career was shattered when he was wrongly convicted of murdering his wife. After the tall, ruggedly handsome Zack escapes from a Texas prison, he abducts Julie and forces her to drive him to his Colorado mountain hideout. She’s outraged, cautious, and unable to ignore the instincts that whispers of his innocence. He’s cynical, wary, and increasingly attracted to her. Desire is about to capture them both in its fierce embrace but the journey to trust, true commitment, and proving Zack’s innocence is just beginning. “A mixture of virtue and passion that is almost—ahem—perfect” (Kirkus Reviews), this is a captivating tale that fans will adore.",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "This Side of Paradise (Dover Thrift Editions)",
        "Authors": "By Fitzgerald, F. Scott",
        "Description": "Fitzgerald's first novel, This Side of Paradise (1920) was an immediate, spectacular success and established his literary reputation. Perhaps the definitive novel of that \"Lost Generation,\" it tells the story of Amory Blaine, a handsome, wealthy Princeton student who halfheartedly involves himself in literary cults, \"liberal\" student activities, and a series of empty flirtations with young women. When he finally does fall truly in love, however, the young woman rejects him for another. After serving in France during the war, Blaine returns to embark on a career in advertising. Still young, but already cynical and world-weary, he exemplifies the young men and women of the '20s, described by Fitzgerald as \"a generation grown up to find all gods dead, all wars fought, all faiths in man shaken.\"",
        "Category": " Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Ideas and Opinions",
        "Authors": "By Einstein, Albert",
        "Description": "IDEAS AND OPINIONS contains essays by eminent scientist Albert Einstein on subjects ranging from atomic energy, relativity, and religion to human rights, government, and economics. Previously published articles, speeches, and letters are gathered here to create a fascinating collection of meditations by one of the world's greatest minds.",
        "Category": " Philosophy , General",
        "Publisher": "Bonanza Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Impossible Journey: Two Against the Sahara (Penguin Travel Library)",
        "Authors": "By Asher, Michael",
        "Description": "",
        "Category": " Travel , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "You Can Help With Your Healing: A Guide for Recovering Wholeness in Body, Mind, and Spirit/Includes Study Guide",
        "Authors": "By Bittner, Vernon J.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Augsburg Fortress Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Silver on the Tree (The Dark is Rising Sequence)",
        "Authors": "By Cooper, Susan",
        "Description": "The Dark is rising in its last and greatest bid to control the world. And Will Stanton -- last-born of the immortal Old Ones, dedicated to keeping the world free -- must join forces with this ageless master Merriman and Bran, the Welsh boy whose destiny ties him to the Light. Drawn in with them are the three Drew children, who are mortal, but have their own vital part in the story. These six fight fear and death in the darkly brooding Welsh hills, in a quest through time and space that touches the most ancient myths of the British Isles, and that brings Susan Cooper's masterful sequence of novels to a satysfying close.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Margaret K. McElderry Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Coastal Georgia",
        "Authors": "By Reiter, Beth Lattimore, Martin, Van Jones",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Coast Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Essentials of International Relations, Third Edition",
        "Authors": "By Mingst, Karen A.",
        "Description": "Taking a balanced view of major theoretical approaches, including liberalism, Marxism, feminism, and constructivism, Mingst (University of Kentucky) provides analytical tools students need to understand world political affairs at the individual, state, and international system levels. Updated to reflect recent developments and debates in world politics, this third edition provides expanded coverage of intergovernmental organizations, such as the UN, and of both terrorist and peaceful nongovernmental organizations. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , International Relations , General",
        "Publisher": "W. W. Norton",
        "Price Starting With ($)": "5.63",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Quiet Strength: The Principles, Practices, & Priorities of a Winning Life",
        "Authors": "By Dungy, Tony and Whitaker, Nathan",
        "Description": "2008 Retailer's Choice Award winner!Tony Dungy's words and example have intrigued millions of people, particularly following his victory in Super Bowl XLI, the first for an African American coach. How is it possible for a coach—especially a football coach—to win the respect of his players and lead them to the Super Bowl without the screaming histrionics, the profanities, the demand that the sport come before anything else? How is it possible for anyone to be successful without compromising faith and family? In this inspiring and reflective memoir, Coach Dungy tells the story of a life lived for God and family—and challenges us all to redefine our ideas of what it means to succeed. Includes a foreword by Denzel Washington and a 16-page color photo insert.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Tyndale",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "The Romanov Bride: A Novel (A Romanov Novel)",
        "Authors": "By Alexander, Robert",
        "Description": "The bestselling tale of Romanov intrigue from the author of The Kitchen BoyBook groups and historical fiction buffs have made Robert Alexander's two previous novels word-of-mouth favorites and national bestsellers. Set against a backdrop of Imperial Russia's twilight, The Romanov Bride has the same enduring appeal. The Grand Duchess Elisavyeta's story begins like a fairy tale-a German princess renowned for her beauty and kind heart marries the Grand Duke Sergei of Russia and enters the Romanov's lavish court. Her husband, however, rules his wife as he does Moscow-with a cold, hard fist. And, after a peaceful demonstration becomes a bloodbath, the fires of the revolution link Elisavyeta's destiny to that of Pavel-a young Bolshevik-forever.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "The Baby Trail: A Novel",
        "Authors": "By Moriarty, Sinead",
        "Description": "Meet Emma Hamilton. She's thirty-three, has a great husband, and loves her life. It's the perfect time to start a family!   Emma has it all mapped out: Go off the pill in December, have sex, get pregnant by January, have the baby in September. And with the help of a personal trainer, Emma figures she'll be back in shape by Christmas. Happy New Year!   But when three months of candle-scented sex fails to produce the desired result, Emma's life becomes a rollercoaster of post-coital handstands, hormone inducing (a.k.a. sanity reducing) drugs, and a veritable army of fertility specialists. Emma and James try everything, from ovulation kits to in-vitro, but all their carefully laid plans seem to go south -- in direct proportion to Emma's plummeting self-esteem. And just when Emma feels she's alienated everyone in her life -- her twice-pregnant confidante, her singleton friend, even her own husband -- events take a ninety-degree turn that will have unforeseen consequences for everyone.   With The Baby Trail Sinead Moriarty brings a wicked sense of humor to a subject of fevered concern for women today. Sizzlingly funny yet deeply moving, this novel is sure to ring true for women who can hear the tick-tock of their own biological clocks.",
        "Category": " Fiction , General",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Secret (Seasons of Grace, Book 1)",
        "Authors": "By Lewis, Beverly",
        "Description": "In the seemingly ordinary Amish home of Grace Byler, secrets abound. Why does her mother weep in the night? Why does her father refuse to admit something is dreadfully wrong? Then, in one startling moment, everything Grace assumed she knew is shattered. Her mother's disappearance leaves Grace reeling and unable to keep her betrothal promise to her long-time beau. Left to pick up the pieces of her life, Grace questions all she has been taught about love, family, and commitment. Heather Nelson is an English grad student, stunned by a doctor's diagnosis. Surely fate would not allow her father to lose his only daughter after the death of his wife a few years before. In denial and telling no one she is terminally ill, Heather travels to Lancaster County--the last place she and her mother had visited together. Will Heather find healing for body and spirit? As the lives of four wounded souls begin to weave together like an Amish patchwork quilt, they each discover missing pieces of their life puzzles--and glimpse the merciful and loving hand of God.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Overcoming Procrastination: Practice the Now Habit and Guilt-Free Play",
        "Authors": "By Fiore, Neil A.",
        "Description": "",
        "Category": "",
        "Publisher": "MJF Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Slipknot",
        "Authors": "By Greenlaw, Linda",
        "Description": "The exciting debut of a snappy, spirited, and irresistible mystery series from beloved and bestselling author Linda Greenlaw In her bestselling nonfiction book All Fishermen Are Liars, Linda Greenlaw confessed a desire to write fiction -- and readers responded with an enthusiastic \"Please do!\" At last, she satisfies their hunger with this sharp-witted, compulsively readable mystery, the first in a series featuring marine investigator Jane Bunker. When Jane moves back to the sleepy Maine fishing community where she was born, it's to escape the seamy crime scenes and unsavory characters that crossed her path in Miami. Surely whatever crimes are committed in touristy, idyllic Green Haven wont involve anything as nasty as what she saw in Florida. It's a bit of a shock, then, when Nick Dow, the town drunk, turns up dead, and it's not the simple accident that everyone assumes it to be. Jane soon discovers that Dow wasnt even a drunk -- it was all an act. But why? And what does it have to do with a heated town hall meeting about fishing rights and paternity suits? The more Jane digs, the more confused she gets. Only two things are certain: Nothing is what it seems; and the whole town is in each other's business. But it's not until Jane impulsively hops on a boat with the killer -- a boat that suddenly heads out to sea -- that things become downright dangerous . . . As she proved in The Hungry Ocean, no one knows the sea like Linda Greenlaw. And as she proved in The Lobster Chronicles, no one has a better way with the telling details of Maine village life. This new mystery series features everything readers want: a great setting, wonderful characters, an authentic and original detective -- and a story that will keep them on the edge of their seats.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Promises for Moms",
        "Authors": "By Molly C.Detweiler",
        "Description": "",
        "Category": "",
        "Publisher": "Inspirio / Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "In His Steps: What Would Jesus Do?",
        "Authors": "By Sheldon, Charles M.",
        "Description": "",
        "Category": "",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Magic Street",
        "Authors": "By Card, Orson Scott",
        "Description": "Orson Scott Card has the distinction of having swept both the Hugo and Nebula awards in two consecutive years with his amazing novels Ender’s Game and Speaker for the Dead. For a body of work that ranges from science fiction to nonfiction to plays, Card has been recognized as an author who provides vivid, colorful glimpses between the world we know and worlds we can only imagine.In a peaceful, prosperous African American neighborhood in Los Angeles, Mack Street is a mystery child who has somehow found a home. Discovered abandoned in an overgrown park, raised by a blunt-speaking single woman, Mack comes and goes from family to family–a boy who is at once surrounded by boisterous characters and deeply alone. But while Mack senses that he is different from most, and knows that he has strange powers, he cannot possibly understand how unusual he is until the day he sees, in a thin slice of space, a narrow house. Beyond it is a backyard–and an entryway into an extraordinary world stretching off into an exotic distance of geography, history, and magic.Passing through the skinny house that no one else can see, Mack is plunged into a realm where time and reality are skewed, a place where what Mack does and sees seem to have strange affects in the “real world” of concrete, cars, commerce, and conflict. Growing into a tall, powerful young man, pursuing a forbidden relationship, and using Shakespeare’s Midsummer’s Night Dream as a guide into the vast, timeless fantasy world, Mack becomes a player in an epic drama. Understanding this drama is Mack’s challenge. His reward, if he can survive the trip, is discovering not only who he really is . . . but why he exists.Both a novel of constantly surprising entertainment and a tale of breathtaking literary power, Magic Street is a masterwork from a supremely gifted, utterly original American writer–a novel that uses realism and fantasy to delight, challenge, and satisfy on the most profound levels.",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The Prayer of Jabez for Young Hearts",
        "Authors": "By Wilkinson, Bruce, Suggs, Rob, and Martinez, Sergio (ILT)",
        "Description": "Retells, in the form of a rhyme, the Old Testament story of Jabez, who learned how powerful prayer can be.",
        "Category": " Juvenile Nonfiction , Religion , Christianity",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "What They Still Don't Teach You At Harvard Business School: Selling More, Managing Better, and Getting the Job",
        "Authors": "By McCormack, Mark H.",
        "Description": "An advanced course in street-smart business tactics from the bestselling author of What They Don’t Teach You At Harvard Business School.The key to executive success is innovation, and if you want to keep up with today’s fast-paced global economy, you’d better keep up with Mark McCormack. Now, one of America’s hottest entrepeneurs teaches you how to sell more, manage better, and get the job done in the ’90s.What They Still Don’t Teach You At Harvard Business School is a straight-talking, hard-hitting, practical guide to getting organized, moving ahead, and gaining the competitive edge. Here are a superstar businessman’s powerful winning strategies for buying, selling, managing, and negotiating that will give you the advantage no matter what the situation—in even the toughest business environments.• How to land your first great job—and four ways to prove your worth for a higher salary.• Ten ways careers (and companies) get stalled—and how to get them started again.• The five attributes of a winner: how to make the most of limited opportunities.• The keys to corporate culture: leadership, management, and networking.• The ten commandments of street smarts.• The seven most dangerous people in your company . . . and much more!Mark McCormack’s uniquely successful management style offers savvy advice for executives and executives-to-be on every rung of the corporate ladder. Now you no longer have to struggle to keep up with the competition—they’ll be struggling to keep up with you!",
        "Category": " Business & Economics , Education",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Wanted (Sisters of the Heart, Book 2)",
        "Authors": "By Gray, Shelley Shepard",
        "Description": "For a split second, Katie feels certain she's about to receive everything she's ever wanted. . .Twenty-year-old Katie Brenneman has always quietly fancied Jonathan Lundy. So when the brokenhearted widower asks her to help him take care of his two young girls, Katie knows it will be a trying time—yet she cannot pass up a golden opportunity to get to know this man better.Just as she's settling into her new life, a message arrives from Katie's past, threatening to expose her darkest secrets. During her Rumspringa, her running-around years, she experimented with activities forbidden in the Amish way of life. Frightened by how far she'd strayed from her values, Katie ran back home, vowing to cut all ties with the outside world. Now her transgressions are coming back to haunt her, just as Jonathan seems willing to welcome her into his heart. Will the past destroy Katie's chances for love? Or will Katie allow herself to accept God's love, forgive her past, and receive everything she's ever wanted?",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "The Forbidden (The Courtship of Nellie Fisher, Book 2)",
        "Authors": "By Lewis, Beverly",
        "Description": "After Caleb Yoder's father forbids him to court Nellie Fisher, Caleb continues to meet Nellie at their secret place, risking to lose everything, but Nellie is also torn as she feels a gentle pull toward the faith of her New Order family. Simultaneous.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "A Court Divided: The Rehnquist Court and the Future of Constitutional Law",
        "Authors": "By Tushnet, Mark V.",
        "Description": "Tushnet (constitutional law, Georgetown U. Law Center) analyzes the legal personalities and decisions of the US Supreme Court under Chief Justice Rehnquist. His overarching argument has to do why the Rehnquist court, to the dismay of the religious right, could generally be counted on to advance economic conservatism but simultaneously failed to roll back the cultural leftism unleashed by the Warren Court. His explanation distinguishes between new (Reagan/Goldwater) Republicans such as Scalia and Thomas and old Republicans such O'Connor and Souter, who tended not to join their Republican colleagues on such issues as abortion, affirmative action, and gay rights. In addition to examining these issues and explaining this dynamic, he profiles four of the justices in relation to signature issues: Clarence Thomas and constitutional \"originalism,\" Ruth Bader Ginsberg and gender discrimination; Antonin Scalia and the absolute First Amendment; and Anthony Kennedy and gay rights. Annotation ©2007 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Law , Courts",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "The Bishop's Daughter",
        "Authors": "By Brunstetter, Wanda E.",
        "Description": "Leona is Bishop Jacob Weaver's daughter and a dedicated teacher in a one-room Amish schoolhouse. After her father's tragic accident, Leona's faith wavers. How could God allow something like this to happen to one of His servants? Outlander Jimmy Scott comes to Pennsylvania in search of his real family. When he is hired to paint an Amish schoolhouse, Jimmy and Leona find themselves irresistibly drawn to each other. Can anything good come from the love between an Amish woman and an English man? What secrets will be revealed and what miracles await God's people in Lancaster County? The Bishop's Daughter is book 3 in the Daughters of Lancaster County series. Other books in the series include The Storekeeper's Daughter: Book 1 and The Quilter's Daughter: Book 2.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Barbur",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Sabre's Edge (Ralph Cotton Western Series)",
        "Authors": "By Cotton, Ralph W.",
        "Description": "Arizona Ranger Sam Burrack rides into Sabre Ridge with one prisoner and  a list of the man's kinfolk wanted for robbery and murder. Burrack  doesn't want the whole clan-just the killers. He has the entire town  against him and no hard evidence. The odds are heavily stacked against  the Ranger-but that's just the way he likes it...",
        "Category": " Fiction , Westerns",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Law for Hire: Defending Cody",
        "Authors": "By Brooks, Bill",
        "Description": "A Bullet for Buffalo BillNo one knows better than the great showman William Cody what a burden fame can be, especially when he has to move quickly to narrowly dodge an assassin's bullet. Organizing a hunting party for himself and some would-be investors, Buffalo Bill knows he needs some professional protection, and the name Teddy Blue comes immediately to mind. The young Pinkerton agent with razor-edge instincts and dead-on aim once got Cody's pal Bill Hickok out of a lethal jam. But Teddy's got a personal obligation to see to first, namely the rescue of an old friend from the hangman's noose in New Mexico. And once he joins Cody and his entourage in the wild, Teddy's immediately caught in a deadly tangle that may be too much for one hired guardian -- trapped by the cruelty of unpredictable nature…and in the gunsights of hunters determined to get one last trophy.",
        "Category": " Fiction , Westerns",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Shards of Empire",
        "Authors": "By Shwartz, Susan",
        "Description": "Set during the fall of the Byzantine Empire, a historical fantasy follows the adventures of Leo Ducas, an exiled nobleman, who falls in love with a beautiful Jewess with world-shaking powers. Reprint.",
        "Category": " Fiction , Historical",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Weekend Getaways Around Washington, D.C.: Including Virginia, Maryland, Delaware, Pennsylvania, New Jersey, West Virginia, and North Carolina",
        "Authors": "By Shosteck, Robert, Heland, Victoria J. (EDT), Heland, Ken, and Scott, Willard (FRW)",
        "Description": "This comprehensive guide covers attractions throughout the Mid- and South Atlantic regions from archaeological sites and battlegrounds to pick-your-own-fruit farms and museums.",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Pelican Publishing",
        "Price Starting With ($)": "5.46",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "The Complete Sherlock Holmes, Volume I (Barnes & Noble Classics Series)",
        "Authors": "By Doyle, Arthur Conan, Sir and Freeman, Kyle",
        "Description": "&&LDIV&&R&&LDIV&&R&&LI&&RThe Complete Sherlock Holmes, Volume I&&L/I&&R, by &&LB&&RSir Arthur Conan Doyle&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R&&LI&&R&&L/I&&R &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R&&LI&&RThe Complete Sherlock Holmes&&L/I&&R comprises four novels and fifty-six short stories revolving around the world’s most popular and influential fictional detective—the eccentric, arrogant, and ingenious Sherlock Holmes. He and his trusted friend, Dr. Watson, step from Holmes’s comfortable quarters at 221b Baker Street into the swirling fog of Victorian London to exercise that unique combination of detailed observation, vast knowledge, and brilliant deduction. Inevitably, Holmes rescues the innocent, confounds the guilty, and solves the most perplexing puzzles known to literature. &&LBR&&R&&LBR&&R&&LI&&RVolume I&&L/I&&R of &&LI&&RThe Complete Sherlock Holmes&&L/I&&R starts with Holmes’s first appearance, &&LI&&RA Study in Scarlet&&L/I&&R, a chilling murder novel complete with bloodstained walls and cryptic clues, followed by the baffling &&LI&&RThe Sign of Four&&L/I&&R, which introduces Holmes’s cocaine problem and Watson’s future wife. The story collections &&LI&&RThe Adventures of Sherlock Holmes&&L/I&&R and &&LI&&RThe Memoirs of Sherlock Holmes&&L/I&&R feature such renowned tales as “A Scandal in Bohemia,” “The Red-Headed League,” and “The Musgrave Ritual.”&&LBR&&R&&LBR&&RTired of writing stories about Holmes, his creator, &&LB&&RSir Arthur Conan Doyle&&L/B&&R, killed him off at the end of “The Final Problem,” the last tale in &&LI&&RThe Memoirs&&L/I&&R. But the public outcry was so great that eight years later he published the masterful &&LI&&RThe Hound of the Baskervilles&&L/I&&R, which supposedly takes place before Holmes’s death.&&LBR&&R&&LBR&&RThe separate &&LI&&RVolume II&&L/I&&R of &&LI&&RThe Complete Sherlock Holmes&&L/I&&R collects the remaining accounts of Holmes’s exploits, including “The Adventure of the Empty House,” which reveals the elaborate circumstances behind Holmes’s literary resurrection.&&LBR&&R&&L/P&&R&&LDIV&&R&&LB&&RKyle Freeman&&L/B&&R, a Sherlock Holmes enthusiast for many years, earned two graduate degrees in English literature from Columbia University, where his major was twentieth-century British literature.&&L/DIV&&R&&L/DIV&&R",
        "Category": " Fiction , Literary",
        "Publisher": "Barnes & Noble Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Wuthering Heights (Modern Library Classics)",
        "Authors": "By Bronte, Emily",
        "Description": "Nominated as one of America’s best-loved novels by PBS’s The Great American ReadWuthering Heights, first published in 1847, the year before the author's death at the age of thirty, endures today as perhaps the most powerful and intensely original novel in the English language. “Only Emily Brontë,” V.S. Pritchett said about the author and her contemporaries, “exposes her imagination to the dark spirit.” And Virginia Woolf wrote, “It is as if she could tear up all that we know human beings by, and fill these unrecognisable transparencies with such a gust of life that they transcend reality. Hers, then, is the rarest of all powers. She could free life from its dependence on facts, with few touches indicate the spirit of a face so that it needs no body; by speaking of the moor make the wind blow and the thunder roar.” This Modern Library edition contains a biographical note, a preface by the author's sister Charlotte Brontë, an Introduction by Diane Johnson, and commentary by George Henry Lewes, Virginia Woolf, and E. M. Forster. This edition also includes a Modern Library Reading Group Guide.",
        "Category": " Fiction , Literary",
        "Publisher": "Modern Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "STORY OF CRAZY HORSE, THE, Signature Biography Series",
        "Authors": "By Meadowcroft, Enid Lamonte",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.16",
        "Publish Date": {
            "Month": "January",
            "Year": "1954"
        }
    },
    {
        "Title": "50 Below Zero",
        "Authors": "By Munsch, Robert N. and Martchenko, Michael (ILT)",
        "Description": "Jason’s dad falls asleep everywhere &#133; except in his own bed.  All night long, Jason gets woken up by strange noises that lead him to find his dad in the most unexpected places&#151;from on top of the refrigerator to the freezing cold woods outside his house. In order to finally get a good night’s sleep, Jason musters up all of his resources and comes up with a most unexpected solution&#151;tying his dad’s toe to the bathroom doorknob to keep him in place.",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "Annick Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Tooth Fairy Magic (Sparkle-And-Glow Books)",
        "Authors": "By Barkan, Joanne and Wheeler, Jody (ILT)",
        "Description": "Willy Weber wakes up to find the Tooth Fairy at his bedside, looking for her missing address list, and offers to show her where the other children she is looking for live",
        "Category": "",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Can You Find Sadie? (Look-Look)",
        "Authors": "By Miller, Susan (ILT) and Ohanesian, Diane",
        "Description": "A little girl looks in each room of her house and even outside for her dog, Sadie",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Why Be Catholic?: Understanding Our Experience and Tradition",
        "Authors": "By Rohr, Richard and Martos, Joseph",
        "Description": "\"The book should help every thinking Catholic. It would alsomake a good RCIA resource as well as a blockbuster stimulus fordiscussions.\"&#151;Book Nook, Pecos BenedictineThe authors answer the question, \"Why Be Catholic?\" fairly and squarely, showing a deep appreciation about what is good in Catholicism and a penetrating honesty about the Church's shortcomings. Rohr and Martos also examine what it means to be Catholic in the United States today. Finally, to answer the title question in a more personal way, they present portraits of some outstanding Catholics, especially those we call saints, who have found personal fulfillment by living their faith to the utmost. After reading this book, you will appreciate more fully the unique heritage of the Catholic Church. You will understand how its magnificent tradition enriches the lives of Catholics today and propels the ever-changing Church into the 21st century and third millennium. A popular resource for RCIA, evangelization and religious education.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Franciscan Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Secrets of Successful Speakers: How You Can Motivate, Captivate, and Persuade",
        "Authors": "By Walters, Lilly",
        "Description": "",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Maitland Maternity Christmas: A Heartbeat Away/The Ends of the Earth/Once in a Lifetime (Maitland Maternity Clinic Anthology)",
        "Authors": "By Christenberry, Judy, Leonard, Tina, and Jenson, Muriel",
        "Description": "As Hugh Blake gets ready to become a stepfather to the Maitland clan, he desperately wants his own children--Suzanne, a work-obsessed CEO; Thomas, a lawyer whose relationship with the woman he loves is disintegrating; and Diane, a teacher who is devoted to her students--to find romance and happiness, and with a little holiday magic, all of them will discover the power of love. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "In the Hills of Monterey",
        "Authors": "By Brand, Max",
        "Description": "When Francisco Valdez, a wealthy Spanish bridegroom who is on his way to meet his bethrothed, and fellow passenger Louis Mortier arrive in California, the unlikely pair joins forces and embarks on a grand adventure, filled with danger and romance, across the untamed frontier. Reprint.",
        "Category": " Fiction , Westerns",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Firstlight: The Early Inspirational Writings",
        "Authors": "By Kidd, Sue Monk",
        "Description": "From the bestselling author of The Secret Life of Bees and the new novel The Book of Longings comes a thoughtful, revelatory book of writings on self and spirit Before she won an international readership with her novels, Sue Monk Kidd was best known for her smart, passionate spiritual writings. Now many of those early stories and essays (most of which first appeared in Guideposts) are collected in one volume, organized around thirteen spiritual motifs. In Firstlight, Kidd charts her emergence as a writer and seeker; reflects on her roles as wife, mother, daughter, nurse, and artist; and assesses what she has learned in settings as far-flung as Africa and her own home. The result is an intimate, uplifting book, filled with moments of recognition and discovery.",
        "Category": " Religion , Christian Living , Devotional",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Living Through Grief and Growing With It",
        "Authors": "By Freese, Arthur",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "19.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1978"
        }
    },
    {
        "Title": "This is Kendo: The Art of Japanese Fencing",
        "Authors": "By Sasamori, Junzo and Warner, Gordon",
        "Description": "",
        "Category": " Sports & Recreation , Martial Arts & Self-Defense",
        "Publisher": "Tuttle Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Driving the Drunk Off the Road",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Acropolis Books Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "Mary Mcleod Bethune: Voice of Black Hope (Women of Our Time)",
        "Authors": "By Meltzer, Milton and Marchesi, Stephen (ILT)",
        "Description": "Traces the life of the Black social reformer, and recounts how she founded Bethune-Cookman College and the National Council of Negro Women, and served as an adviser to President Roosevelt",
        "Category": " Social Science , Discrimination & Race Relations",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "The Christmas Books Volume 2 (The Penguin English Library)",
        "Authors": "By Dickens, Charles",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "December",
            "Year": "1971"
        }
    },
    {
        "Title": "Abandoned Heart",
        "Authors": "By Parrish, Richard",
        "Description": "Kate O'Dwyer thinks she is starting a new life by escaping a very bad marriage and moving with three-year-old Jennifer to Phoenix. She gets a teaching job, volunteers at a youth shelter, and falls in love with young, struggling attorney Mike Fallon. She also adopts sixteen-year-old Donna Alvarez, a refugee from poverty and delinquency.But Kate's serenity is shattered when young Donna's volatile past catches up with them all. When Kate is out one night, both Donna and little Jennifer are viciously molested by Philip Wilkott, the sociopathic son of one of Arizona's most powerful citizens. As if this violation is not unspeakable enough, it quickly becomes apparent to Kate and Mike that Wilkott is no stranger to the corrupt use of legal loopholes that eventually sets him free.Driven to desperation, Kate turns to the oldest form of justice - retribution - to stop this savage criminal who has made her worst nightmare come true. But in an unexpected and shocking turn of events, she finds herself on trial for murder. Stacked up against Kate is not only the assembled might of the Tucson district attorney's office but the full vindictive force of Wilkott's powerful family. In her defense all she has is Mike Fallon - and the truth.",
        "Category": " Fiction , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "World Regional Geography Mapping Workbook & Study Guide",
        "Authors": "By Rogalsky, Jennifer and Aspaas, Helen Ruth",
        "Description": "The study guide retains the exercises that have made it a useful pedagogical tool over three editions. Mapping exercises help the students understand and explain geographic patterns by employing the skills geographers themselves routinely use.",
        "Category": " Science , Earth Sciences , Geography",
        "Publisher": "W. H. Freeman",
        "Price Starting With ($)": "6.59",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "A is for America",
        "Authors": "By Carroll, Pamela (ILT) and Scillian, Devin",
        "Description": "From the British and our Constitution that replaced their rule, to Yellowstone Park and Zane Grey's stories of the west, \"A is for America\" is a sweeping tribute to all we know and love about our country. With delightful poems that beg to be read aloud, and expository text to broaden a student's horizons, this American alphabet will make you fall in love with the United States over and over again. Bright, beautifully detailed illustrations from California artist Pam Carroll bring each letter to life, from eagles to Thomas Edison to the veterans of two World Wars.",
        "Category": " Juvenile Nonfiction , People & Places , United States , General",
        "Publisher": "Sleeping Bear Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "A History of Evangelical Lutheran Church, 1738-1988",
        "Authors": "By Abdel Ross Wentz, Francis E. Reinberger",
        "Description": "",
        "Category": "",
        "Publisher": "Published for the Church by University Pub. Group",
        "Price Starting With ($)": "19.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Justine",
        "Authors": "By Lawrence Durrell",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1969"
        }
    },
    {
        "Title": "The Complete Book of Color",
        "Authors": "By Chiazzari, Suzy",
        "Description": "A guide to the therapeutic uses and effects of color includes information on color therapy, color types and personalities, use of color in the home and work, and color and nutrition",
        "Category": " Psychology , General",
        "Publisher": "Element Books Ltd.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Understanding Business",
        "Authors": "By Nickels, William G., McHugh, James M., and McHugh, Susan M.",
        "Description": "Understanding Business by Nickels, McHugh, and McHugh has been the number one textbook in the introduction to business market for several editions for three reasons: (1) The commitment and dedication of an author team that teaches this course and believes in the importance and power of this learning experience, (2) we listen to our customers, and (3) the quality of our supplements package.  We consistently look to the experts –full-time faculty members, adjunct instructors, and of course students– to drive the decisions we make about the text itself and the ancillary package. Through a series of focus groups, symposia, as well as full-book, single-chapter, revised manuscript reviews of both text and key ancillaries, we have heard the stories of more than 500 professors and their insights and experiences are evident on every page of the revision and in every supplement. As teachers of the course and users of their own materials, the author team is dedicated to the principles of excellence in business education. From providing the richest most current topical coverage to using dynamic pedagogy that puts students in touch with today’s real business issues, to creating groundbreaking and market-defining ancillary items for professors and students alike, Understanding Business leads the way.",
        "Category": " Business & Economics , Development , General",
        "Publisher": "McGraw-Hill/Irwin",
        "Price Starting With ($)": "8.4",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "The Ultimate Book of Decorating&Do-It-Yourself",
        "Authors": "By Mike Lawrence",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "9.45",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Lincoln and the Civil War; a Profile and a History",
        "Authors": "By Courtlandt (Editor) Canby",
        "Description": "",
        "Category": "",
        "Publisher": "Dell Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1958"
        }
    },
    {
        "Title": "The Biosphere.",
        "Authors": "By Scientific American",
        "Description": "",
        "Category": "",
        "Publisher": "W H Freeman & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1976"
        }
    },
    {
        "Title": "The Twelve Gifts for Healing (Twelve Gifts Series, 3)",
        "Authors": "By Seabrook, Alexis (ILT) and Seabrook, Alexis",
        "Description": "A wonderful and compassionate illustrated gift book that will inspire readers to triumph over adversity of any kind. The author of The 12 Gifts of Birth has produced another beautifully illustrated book that will uplift and inspire all who turn its pages. Everyone goes through some sort of loss in life, and in The Healing Place, Charlene Costanzo provides words of encouragement that will help readers triumph over adversity of any kind--whether it is cancer, job loss, divorce, or just a bad day. The book will give readers a renewed faith in themselves.  The Healing Place opens with a simple yet powerful story of a troubled woman searching for healing. The book then offers twelve healing aspirations that will reaffirm readers sense of peace and dignity, accompanied by beautiful illustrations and colorized photographs. The Healing Place is certain to become a cherished companion on life′s journey.",
        "Category": " Body, Mind & Spirit , Mindfulness & Meditation",
        "Publisher": "HarperResource",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "The Year of the Panda",
        "Authors": "By Mak, Kam (ILT) and Schlein, Miriam",
        "Description": "Daxiong mao is rare and mysterious, like a god, living in the midst of the mountains.Strange things are happening on Lu Yi's farm. First, some men from the Chinese government ask Lu Yi's father to sell the property that has belonged to the family for generations. Then a giant panda appears in a neighbor's field, A rare occurrence, given the farm's distance from the high-mountain bamboo forests that pandas inhabit.Lu Yi has a feeling that the two mysteries are somehow connected. And before long, an orphaned baby panda he finds in the' woods provides an answer. As the boy nurses the helpless animal back to health, he begins an adventure that may, well change his entire future.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Powerful and Brutal Weapons: Nixon, Kissinger, and the Easter Offensive",
        "Authors": "By Randolph, Stephen P.",
        "Description": "As America confronts an unpredictable war in Iraq, Stephen Randolph returns to an earlier conflict that severely tested our civilian and military leaders. In 1972, America sought to withdraw from Vietnam with its credibility intact. As diplomatic negotiations were pursued in Paris, President Richard Nixon and National Security Advisor Henry Kissinger hoped that gains on the battlefield would strengthen their position at the negotiating table--working against the relentless deadline of a presidential election year. In retaliation for a major North Vietnamese offensive breaking over the Easter holidays, the President launched the all-out air campaign known as Linebacker--overriding his Secretary of Defense and clashing with the theater commander in whom he had lost all confidence. He intended to destroy the enemy with the full force of America's \"powerful and brutal weapons\" and thus shape the endgame of the war. Randolph's narrative, based not only on the Nixon White House tapes and newly declassified materials from the National Security Council, the Pentagon, and the White House but also on never before used North Vietnamese sources, re-creates how North Vietnam planned and fought this battle from Hanoi and how the U.S. planned and fought it from Washington. Randolph's intimate chronicle of Nixon's performance as commander-in-chief gains us unprecedented access to how strategic assessments were made, transmitted through the field of command, and played out in combat and at the negotiating table. It is a compelling story about America's military decision-making in conflicts with nontraditional belligerents that speaks provocatively to our own time.",
        "Category": " History , Military , Vietnam War",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Guide to Trees",
        "Authors": "By Zim, Herbert Spencer",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Books Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "Splat! (All Aboard Reading)",
        "Authors": "By O'Connor, Jane and Mets, Marilyn (ILT)",
        "Description": "A young boy, bothered by his size, thinks that the super squirt gun he buys will transform him from \"Squirt\" into \"Splat Master\"",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Clea",
        "Authors": "By Lawrence Durrell",
        "Description": "",
        "Category": "",
        "Publisher": "Cardinal : Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Statistics For Dummies",
        "Authors": "By Rumsey, Deborah, Ph.D.",
        "Description": "In the numbers explosion all around us in our modern-day dealings, the buzzword is data, as in, “Do you have any data to support your claim?” “The data supported the original hypothesis that . . .” and “The data bear this out. . . .” But the field of statistics is not just about data. Statistics is the entire process involved in gathering evidence to answer questions about the world, in cases where that evidence happens to be numerical data.Statistics For Dummies is for everyone who wants to sort through and evaluate the incredible amount of statistical information that comes to them on a daily basis. (You know the stuff: charts, graphs, tables, as well as headlines that talk about the results of the latest poll, survey, experiment, or other scientific study.) This book arms you with the ability to decipher and make important decisions about statistical results, being ever aware of the ways in which people can mislead you with statistics. Get the inside scoop on number-crunching nuances, plus insight into how you canDetermine the oddsCalculate a standard scoreFind the margin of errorRecognize the impact of pollsEstablish criteria for a good surveyMake informed decisions about experimentsThis down-to-earth reference is chock-full of real examples from real sources that are relevant to your everyday life: from the latest medical breakthroughs, crime studies, and population trends to surveys on Internet dating, cell phone use, and the worst cars of the millennium. Statistics For Dummies departs from traditional statistics texts, references, supplement books, and study guides in the following ways:Practical and intuitive explanations of statistical concepts, ideas, techniques, formulas, and calculations.Clear and concise step-by-step procedures that intuitively explain how to work through statistics problems.Upfront and honest answers to your questions like, “What does this really mean?” and “When and how I will ever use this?”Chances are, Statistics For Dummies will be your No. 1 resource for discovering how numerical data figures into your corner of the universe.",
        "Category": " Mathematics , Probability & Statistics , General",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The New Beacon Book of Quotations by Women",
        "Authors": "By Maggio, Rosalie (EDT)",
        "Description": "Here are 16,000 quotes from 2,600 women—most of them found in no other collection. With dynamic and witty words by sources ranging from Bella Abzug to Ann Zwinger on over 1,400 topics, this is an indispensable reference and browser's delight.\"An important counterpoint to general collections of quotations, which, unfortunately, still don't offer equitable coverage of women's words.\"-Carolyn Mulac, Library Journal",
        "Category": " Reference , General",
        "Publisher": "Beacon Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "George S Kaufman: An Intimate Portrait",
        "Authors": "By Teichmann, Howard",
        "Description": "",
        "Category": "",
        "Publisher": "Dell Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Gandhi : Peaceful Warrior (Easy Biographies)",
        "Authors": "By Snow, Scott (ILT) and Bains, Rae",
        "Description": "A biography of the Indian leader whose nonviolent passive resistance tactics influenced reformers in other countries",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Historical",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "SUM OF GOOD GOVERNMENT-OP",
        "Authors": "By Crane, Philip M.",
        "Description": "",
        "Category": "",
        "Publisher": "Jameson Books Inc.",
        "Price Starting With ($)": "5.59",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "A Sierra Club Naturalist's Guide to the Sierra Nevada (Sierra Club Naturalist's Guides)",
        "Authors": "By Whitney, Stephen",
        "Description": "Drawings, photographs, maps, and diagrams enhance a guide to the geology, climate, plants, and animals of the foothill, forest, and mountain zones of the Sierra Nevada",
        "Category": " Science , General",
        "Publisher": "Sierra Club Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1979"
        }
    },
    {
        "Title": "Nothing Lost",
        "Authors": "By Dunne, John Gregory",
        "Description": "In the town of Regent, a lurid murder becomes a magnet for the media, the best and worst of the local courtroom powers, and a rich cast of hangers-on. There is Teresa Kean, the advocacy lawyer whose life is changed by a mysterious secret; J.J. McClure, the prosecutor who contemplates his own secrets under the radar screen of Poppy, his glamorous, funny, right-wing congressman wife. There is Max Cline, a tough gay former state's attorney, once J.J.'s boss and now a marginalized defense counsel. There is the sociopathic seventeen-year-old Carlyle, half sister of the accused, a supermodel whose addiction is attention - no matter the cost. And - as if it were a character itself - there is the reckless passion that will fulfill a self-destructive destiny for one of the players.",
        "Category": " Fiction , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "E=mc2: A Biography of the World's Most Famous Equation",
        "Authors": "By Bodanis, David",
        "Description": "Already climbing the bestseller lists-and garnering rave reviews&#151;this \"little masterpiece\" sheds brilliant light on the equation that changed the world.Bodanis begins by devoting chapters to each of the equation's letters and symbols, introducing the science and scientists forming the backdrop to Einstein's discovery&#151;from Ole Roemer's revelation that the speed of light could be measured to Michael Faraday's pioneering work on energy fields. Having demystified the equation, Bodanis explains its science and brings it to life historically, making clear the astonishing array of discoveries and consequences it made possible. It would prove to be a beacon throughout the twentieth century, important to Ernest Rutherford, who discovered the structure of the atom, Enrico Fermi, who probed the nucleus, and Lise Meitner, who finally understood how atoms could be split wide open. And it has come to inform our daily lives, governing everything from the atomic bomb to a television's cathode-ray tube to the carbon dating of prehistoric paintings.",
        "Category": " Science , Physics , General",
        "Publisher": "Berkley Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Can Poetry Matter?: Essays on Poetry and American Culture",
        "Authors": "By Gioia, Dana",
        "Description": "Essays explore the role of poets and poetry in contemporary society and discuss the life and work of Robinson Jeffers, Elizabeth Bishop, Robert Bly, and others",
        "Category": " Literary Criticism , Poetry",
        "Publisher": "Graywolf Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    }
]