[
    {
        "Title": "Unbecoming Behavior",
        "Authors": "By Rowe, Stephanie",
        "Description": "With her life in complete and utter disarray, Shannon McCormick, recently fired from her prestigious job, must get back on track and discover what she truly wants, despite her sister's impending nuptials to a wealthy plastic surgeon and a complicated love triangle. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "The Megalith Builders Of Western Europe",
        "Authors": "By Glyn Daniel",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Worlds beyond the Horizon",
        "Authors": "By Joachim G. Leithauser",
        "Description": "",
        "Category": "",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "Bottom of the Garden and Other Stories",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Paragon Publishing",
        "Price Starting With ($)": "6.83",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Decks: Your guide to designing and building (Do-it-yourself)",
        "Authors": "By Better Homes and Gardens Books (COR) and Carter, Joe (EDT)",
        "Description": "Detailing how to add a deck to an existing home, from needs assessment and budgeting to planning, construction, and finishing touches, a do-it-yourself guide helps homeowners create their perfect dream deck. Original. 40,000 first printing.",
        "Category": " House & Home , Outdoor & Recreational Areas",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Children of the Dust Bowl: The True Story of the School at Weedpatch Camp",
        "Authors": "By Stanley, Jerry",
        "Description": "Illus. with photographs from the Dust Bowl era. This true story took place at the emergency farm-labor camp immortalized in Steinbeck's The Grapes of Wrath. Ostracized as \"dumb Okies,\" the children of Dust Bowl migrant laborers went without school--until Superintendent Leo Hart and 50 Okie kids built their own school in a nearby field.",
        "Category": " Juvenile Fiction , Historical , United States , General",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Intimacy Struggle: Revised and Expanded for All Adults",
        "Authors": "By Woititz, Janet Geringer",
        "Description": "The struggle for intimacy is a complex issue, key to the happiness of every man and woman. It goes on for all of us as long as we live. To be intimate is to be close, to be vulnerable, qualities that are very different from the survival skills we learned. This book will help clarify the issues for you. You can learn to: Identify family myths to make you wonder whether having a healthy, intimate relationship is possible. Know the questions to ask to find out whether you and your partner have a long-term future together. Be aware of misunderstandings that can sabotage your relationship. Express your feelings and fears so as to avoid misunderstandings. Find our what to do when your relationship is not working. Create good relationships. Acquiring intimacy skills can be difficult, but through understanding and effort, they can be learned. This insightful book is a good place to begin.",
        "Category": " Family & Relationships , General",
        "Publisher": "Health Communications Inc",
        "Price Starting With ($)": "6.19",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Is It Red? Is It Yellow? Is It Blue?",
        "Authors": "By Hoban, Tana",
        "Description": "What color do you see? Red? Yellow? Blue? Here is a concept book young children can grow with, as they explore colors, sizes, shapes, and relationships with the master of the photo-concept book ' Tana Hoban.",
        "Category": " Juvenile Nonfiction , Concepts , Colors",
        "Publisher": "Greenwillow Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Simon and Schuster Pocket Art Museum Guide",
        "Authors": "By Langdon, Helen",
        "Description": "A guide to art galleries and museums around the world",
        "Category": " Art , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1981"
        }
    },
    {
        "Title": "How To Become a Power Agent in Real Estate : A Top Industry Trainer Explains How to Double Your Income in 12 Months",
        "Authors": "By Davis, Darryl",
        "Description": "The realtor's essential guide to harnessing true earning powerHow to Become a Power Agent in Real Estate gives real estate agents both the powerful sales techniques and the practical management tips they need to double their income by closing more transactions. Based on the outstanding success of Darryl Davis's seminar \"The POWER Program,\" this motivational guide utilizes POWER Principles to help the new agent as well as the experienced top producer dramatically increase listings and sales.The book is full of Davis's surefire methods for managing the sales process, including time management for agents, prospecting for listings, handling the seller's and buyer's concerns, maintaining a winning attitude, and generating more sales in less time. He also reveals how clever use of the Web can provide a competitive edge and how the top producers work smarter­­not harder. Offering field-proven tools and techniques, Davis shows agents how to progress at their own pace to their own personal Next Level and accelerate their entry into Top Agent status.",
        "Category": " Business & Economics , Real Estate , General",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Collected Works of Billy Graham: Three Bestselling Works Complete in One Volume (Angels, How to Be Born Again, and The Holy Spirit)",
        "Authors": "By Graham, Billy",
        "Description": "Here in one volume for the first time are three individual titles - Angels, How to Be Born Again, and The Holy Spirit - from Billy Graham, the foremost evangelist of our time who has reached more people with the Gospel than any other person on earth.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Passion for Pilgrimage: Notes for the Journey Home",
        "Authors": "By Jones, Alan W.",
        "Description": "The Christian spiritual journey is a pilgrimage to wholeness, a search for home that is in God. In this classic work on contemporary spiritual living, Alan Jones explores the various parts of the pilgrimage home. Using literature, art, and biblical texts as illustrations, he explores our search for light and love, repentance, and forgiveness in the context of the Passion and Easter stories.An excellent book for group study during Lent and Easter, this new edition includes study questions at the end of each chapter. Passio for Pilgrimage is also provocative reading for individuals at any time of the year who want to understand the Christian journey more deeply.",
        "Category": " Religion , Spirituality",
        "Publisher": "MOREHOUSE PUBLISHING",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Contemporary Drama",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1956"
        }
    },
    {
        "Title": "Faith of Our Founding Fathers",
        "Authors": "By LaHaye, Tim F.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Master Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Toward a Psychology of Art: Collected Essays",
        "Authors": "By Arnheim, Rudolf",
        "Description": "Presents an interpretation of the expression of art and the relationship between this psychology and the art form. Bibliogs",
        "Category": " Art , General",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1972"
        }
    },
    {
        "Title": "The Festive Vegetarian",
        "Authors": "By Elliot, Rose",
        "Description": "Collects a wide variety of recipes for vegetarian soups, appetizers, salads, main courses, desserts, and breads suitable for dinner parties and special meals",
        "Category": " Cooking , Vegetarian",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1983"
        }
    },
    {
        "Title": "Visual Thinking",
        "Authors": "By Arnheim, Rudolf",
        "Description": "A psychologist analyzes the vision processes and argues that all thinking is perceptual in nature",
        "Category": " Art , General",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1972"
        }
    },
    {
        "Title": "The Modern American Novel and the Movies",
        "Authors": "By Peary, Gerald",
        "Description": "A selection of articles by well-known writers and literature-trained, film-oriented critics illuminates the ways in which modern American novels and their film adaptations differ in characterization, scope, and ideological content",
        "Category": " Performing Arts , General",
        "Publisher": "Olympic Marketing Corp",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "Easy Mini-Lessons for Building Vocabulary (Grades 4-8)",
        "Authors": "By Robb, Laura",
        "Description": "There's not a more potent medicine for correcting reading problems and boosting test scores than effective vocabulary-building. This book shows you how to dynamically teach vocabulary before, during, and after reading?in every subject area. Easy mini-lessons on tackling key concept words, roots, prefixes, and suffixes, using context clues, and more. Lots of fun word games, including idiom sleuthing, word history maps, vocabulary quilting, synonym sentences, homophone hunts, and more. A handy Appendix provides key roots and origins, eponyms, and portmanteau words kids will be captivated by. For use with Grades 4-8.",
        "Category": " Education , Teaching Methods & Materials , Language Arts",
        "Publisher": "Teaching Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Clear Light of Day",
        "Authors": "By Desai, Anita",
        "Description": "Evokes the traumatic history of India after the departure of the British in a story of a Hindu family in Old Delhi and the relationships among four people",
        "Category": " Fiction , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Sushi (Essential Kitchen Series)",
        "Authors": "By Yoshii, Ryuichi",
        "Description": "",
        "Category": "",
        "Publisher": "Periplus Editions",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Oliver Twist (Dover Thrift Editions)",
        "Authors": "By Dickens, Charles",
        "Description": "Starved and mistreated, empty bowl in hand, the young hero musters the courage to approach his master, saying, \"Please, sir, I want some more.\" Oliver Twist's famous cry of the heart has resounded with readers since the novel's initial appearance in 1837, and the book remains a popular favorite with fans of all ages.Dickens was no stranger to the pain of hunger and the degradation of poverty. He poured his own youthful experience of Victorian London's unspeakable squalor into this realistic depiction of the link between destitution and crime. Oliver escapes his miserable servitude by running away to London, where he unwillingly but inevitably joins a scabrous gang of thieves. Masterminded by the loathsome Fagin, the underworld crew features some of Dickens' most memorable characters, including the juvenile pickpocket known as the Artful Dodger, the vicious Bill Sikes, and gentle Nancy, an angel of self-sacrifice.A profound social critic, Dickens introduced genteel readers to the problems of the poor in a way that had rarely been attempted before. This tale of the struggle between hope and cruelty continues to speak to modern audiences.",
        "Category": " Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "The Hydra Head",
        "Authors": "By Fuentes, Carlos",
        "Description": "Carlos Fuentes, Mexico's leading novelist, author of The Old Gringo, Terra Nostra and The Death of Artemio Cruz, has produced what is probably the first Third World spy thriller, an action-filled, quick-paced novel of intrigue as contemporary as a headline. The Hydra Head has a constant political reality as backdrop: the permanent tension in the Middle East and the vast new oil resources of Mexico, the setting for a brilliant attempt to portray the diversity of one man's experience.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Dictionary of Sodium, Fats and Cholesterol",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "Homosexuality (Contemporary Issues)",
        "Authors": "By Baird, Robert M. (EDT) and Baird, M. Katherine (EDT)",
        "Description": "This could be the most controversial book yet in the Contemporary Issues Series. Its balanced approach could risk the wrath of advocates and critics alike, offering powerful essays on four key issues: the causes of homosexuality, disputes about the role the courts should play, gays and the military, and religious attitudes toward homosexuality.",
        "Category": " Social Science , LGBT Studies , Gay Studies",
        "Publisher": "Prometheus Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Giant Book of Dirty Jokes",
        "Authors": "By J., Mr.",
        "Description": "Giant Book of Dirty Jokes is a collection of graphic, shocking, and especially funny jokes and anecdotes.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Castle Books",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "2013"
        }
    },
    {
        "Title": "Daddy",
        "Authors": "By Inglis, Janet",
        "Description": "Ruined. Everything ruined. During the two years since her parents separated, Olivia had shuttled numbly between their North London homes. Her father and mother were consumed with their new lives: Ross, a professor, enamored of his beautiful new housemate, a former student; Emma involved with her gallery and with her lover, Nick, a photographer. No safety now. For Olivia, not even the distractions of school and friends could ease the crushing feeling that she was now unnecessary. Perhaps a daughter who needed an appointment to see her own father wasn't worth seeing at all. And then Nick moved in with her mother, and Olivia had to surrender even the sanctuary of her own home. Always now, she could feel him watching her, his eyes wandering over her body. Often now, she crossed her arms self-consciously to cover her breasts.Nick was everything Olivia's father was not; he was blond and broad-shouldered, he smoked, he filled the house with growling jazz. And although she avoided him, he was persistent - offering a lift in his Jaguar, arranging a special dinner. Before long, Olivia was confiding in this stranger, the only adult who seemed to have the time or the desire to listen to her. Then one day, his hand lingered a moment too long on her shoulder, and Olivia could feel its warmth.",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Healthy Cooking: An Ultimate Collection of Step-by-Step Recipes",
        "Authors": "By KATHRYN HAWKINS",
        "Description": "",
        "Category": "",
        "Publisher": "5438525",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Excellence: Can we be equal and excellent too? (Harper Colophon books)",
        "Authors": "By Gardner, John William",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "William Donald Schaefer: A Political Biography",
        "Authors": "By Smith, C. Fraser",
        "Description": "Baltimore's \"Do It Now\" mayor, two-term Maryland governor, and recently elected comptroller of the treasury, William Donald Schaefer may be the most colorful character ever to play on the Free State's political stage—though competition for the honor is intense. In this wonderfully readable account, Fraser Smith explores the formative influences, backroom deals, personal relationships, quirky Baltimorisms, vicious fights, civic pride, splashes in the National Aquarium seal pool, victories, defeats, draws—everything that makes Schaefer's career colorful and that helps us to understand the man himself.A seasoned reporter who covered Schaefer's terms as mayor and governor for the Baltimore Sun, Smith takes a serious-minded but also throughly human-interest approach to his subject—a study in character and the capacity of certain people to make a difference in the story of their time and locale. In Schaefer's case, the story concerns the struggle of Baltimore to survive and, if possible, renew itself. Smith draws on a sizable body of documentary source material; his scores of interviews provide him with juicy quotation and vibrant commentary. The book includes a gallery of photos, most never before published, which recall memorable moments in Schaefer's eventful career.William Donald Schaefer: A Political Biography will fascinate Maryland voters, appeal to students of twentieth-century America, and engage anyone who loves a good story well told.\"His life in politics had been vouchsafed by do gooders, club house operators, slick businessmen, and others. He managed to find the best in each of these without being a servant to any. He was a classic 1950s-style Can-Do man, a veteran of the Second World War, a holdover from the time in American life when learning from experience and respected elders was a way of life. He was a career politician who ran for office to serve—to work for people, to care about their welfare. He wanted to think of himself—and to have others think of him—as a distinguished city father, a public servant. He seemed to be the last Baltimorean to see how well he had succeeded.\"—from the Preface",
        "Category": " Political Science , American Government , State",
        "Publisher": "Johns Hopkins University Press",
        "Price Starting With ($)": "46.98",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Visionary Selling: How to Get to Top Executives and How to Sell Them When You're There",
        "Authors": "By Larsen, Michael, Geraghty, Barbara, and Hills, Fred",
        "Description": "Innovative and on the cutting edge, Visionary Selling shows you how to sell effectively to top decision makers by going beyond the hard sell of a specific product to aligning with the broader vision of top management.  As a result of reengineering and the trend towards new \"horizontal\" management structures, top executives are more accessible and more responsive to outside sources of information and ideas. By discovering customers' vision and formulating innovative ideas to enhance their businesses, salespeople can \"cross the boundary\" of sales to perform as business allies in a collaboration to fulfill the vision of their customers. The sales results can be spectacular.  In this practical and informative book, top saleswoman and professional trainer Barbara Geraghty explains that the best way to sell to a CEO or other top-level executive is to learn to think like one. Her Visionary Selling program will guide you through every step of this innovative process, using helpful true-life examples of how salespeople have used this approach effectively. You'll also learn how to discover the customer's vision, values, and core competencies; how to package the information into a strategic collaboration; and how to communicate a pertinent story that adds value at the executive level. With her gift for making complex ideas accessible, Geraghty explains:  How to \"cross the boundary\" of sales and become a business ally of your customers How to turn gatekeepers into allies (illustrated by success and horror stories from CEO administrative assistants at Fortune 500 companies) How to use the Internet to research industry issues, specific company information, and marketplace trends and opportunities How to approach executives through e-mail with compelling ideas and valuable information for their businesses How to craft a pertinent and provocative presentation that contains key elements of interest and value to an executive   Challenging its readers to look beyond the product to the achievement of a long-term alliance with their customers, Visionary Selling will be the turning point in the careers of salespeople everywhere.",
        "Category": " Business & Economics , Sales & Selling , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Sex: The Facts, the Acts and Your Feelings",
        "Authors": "By Carrera, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Crown Publishers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Arlington National Cemetery: A Moment of Silence",
        "Authors": "By Andrews, Owen",
        "Description": "",
        "Category": "",
        "Publisher": "Preservation Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "The Everything Guide To Washington, D.C. (Everything)",
        "Authors": "By Perkins, Lori",
        "Description": "A onestop travel resource to the nation's capital covers monuments, museums, hotels, restaurants, transportation, entertainment, kid's attractions, and much more. Original. $250,000 ad/promo.",
        "Category": " Travel , General",
        "Publisher": "Everything",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "The Western Heritage, Volume II: Since 1648 (7th Edition)",
        "Authors": "By Kagan, Donald, Ozment, Steven E., and Turner, Frank M.",
        "Description": "",
        "Category": " History , World",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "6.95",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Marco Polo: Voyager to the Orient (People of Distinction)",
        "Authors": "By Greene, Carol",
        "Description": "Presents the life and adventures of the thirteenth-century Venetian merchant who wrote a famous account of his travels and life at the court of Kublai Khan.",
        "Category": "",
        "Publisher": "Childrens Pr",
        "Price Starting With ($)": "8.51",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Conflicts and Contradictions",
        "Authors": "By Benvenisti, Meron",
        "Description": "Although largely concerned with developments on the West Bank, the former Deputy Mayor of Jerusalem's memoir/ political study transcends regional events to deal with the basic conflicts between Israelis and Palestinian Arabs",
        "Category": "",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "A Southern Exposure",
        "Authors": "By Adams, Alice",
        "Description": "\"A work that will be for many readers as memorable as the last decade's Superior Women, and her exquisite novel from the 1970s, Listening to Billie.\"--San Francisco ChronicleIt is 1939, a brief, hopeful moment between the Depression and war. The Baird family--Harry, Cynthia, and their precocious daughter Abby--have escaped the burdens of their Connecticut life to salvage themselves in the sleepy southern town of Pinehill, North Carolina. But the Bairds soon discover that their new home is not quite as idyllic as it seemed up north. And while the family's fondest desire is to be enveloped by the timeless town and its eccentric characters, clouds of war loom darkly, suggesting the possibility of change. But who among them will change, and in what startling ways, remains to be seen. . . .\"What a terrific book. I loved its rich, recognizable characters, the intricacies and excitement of the plot, the beauty of the writing. I laughed out loud a number of times, growled with jealousy at Alice's skills, and stayed up all night to finish it.\"--Annie Lamott\"Deliciously readable, evocative, sensuous, and intoxicating as a gossip with an old, smart friend.\"--Mary Gordon\"A seductive panorama of a small southern town in the late 30s . . . With great truth and clarity, this novel captures it all.\"--The Boston Globe\"Adams is a modern-day Jane Austen. . . . A Southern Exposure is a timeless comedy of manners.\"--The Dallas Morning News",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Four Things My Geeky-Jock-of-a-Best Friend Must Do in Europe",
        "Authors": "By Jane Harrington",
        "Description": "",
        "Category": "",
        "Publisher": "Darby Creek ™",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Seed of Abraham: Jews and Arabs in Contact and Conflict",
        "Authors": "By Patai, Raphael",
        "Description": "Traces the history of Arab-Jewish relations, describes their cultures, religions, and outlooks, and examines the treatment of Arabs in Israel",
        "Category": " History , Middle East , Israel",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "The Eagle's Secret: Success Strategies for Thriving at Work & in Life",
        "Authors": "By McNally, David",
        "Description": "David McNally, peak-performance consultant to businesses and author of Even Eagles Need A Push, returns with an inspiring and timely look at a problem faced by more and more of us. In today's dynamic global economy, the old rules for how to succeed--indeed, how to even stay employed--have been radically changed. The restructuring and re-engineering of our workplaces demanded by the new landscape of technology, international competition and communications now requires us to apply the lessons learned by organizations to our own professional and personal lives; what's needed now is a restructuring and re-engineering of ourselves.Combining a highly readable blend of a seminar's worth of exercises, research-driven insights, and inspiring stories of ordinary people doing extraordinary things, David McNally guides us through seven chapters, each illustrating the attitudes and behaviors needed to navigate this new world of work.The Eagle's Secret teaches us how to trust ourselves and find the strengths that allow us not only to survive, but thrive.",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "A Practical Guide for Business Speaking",
        "Authors": "By Bailey, Edward P.",
        "Description": "Whether you are an corporate executive or an entrepreneur, a military officer or an engineer, the ability to speak well in public is vital. Perhaps you are a medical researcher demonstrating a new surgical technique at a seminar. Or a sales manager outlining a new commission plan to your national sales force. Or the head of a small business trying to land a big account. It is essential that you deliver an effective presentation.In A Practical Guide for Business Speaking, consultant and educator Edward Bailey offers a thorough, down-to-earth, easy-to-use handbook that contains everything you need to give the best presentations possible. Bailey offers a gold mine of detailed advice as he takes you through the process a step at a time. He stresses that most presentations succeed or fail in the design stage. He then shows how to design your speech for maximum impact--using a \"blueprint\" and clear transitions to keep the audience focused--and how to use examples to avoid one of the worst pitfalls of public speaking, abstraction. He describes the many kinds of visual aids available, from overhead transparencies, to flip charts, to blackboards and whiteboards, and he discusses the pluses and minuses of each. He tells you what to look for when checking out a room in advance--for instance, see if the projector focuses well, if the room is cool enough to prevent drowsiness, if the microphone works, and so on. (Bailey provides a nineteen-point checklist for setting up the room in an appendix.) In addition, he offers solid advice on how to rehearse before a talk, how to break the ice with the audience, how to design your own visual aids, and how to handle question-and-answer periods.Perhaps what is most impressive is the wealth of detailed advice presented here. For instance, when using a pointer, hold it in the hand closer to the screen (with the far hand, you turn your back on the audience, making it harder to hear you). When designing a visual aid, use at least 18 point type, and seldom use all capital letters (sentences of capital letters are harder to read). And when reading from a text, don't staple the pages--constant page-turning distracts the audience. Instead, keep the pages loose, and slide each page to one side as you finish it.Based on years of experience, A Practical Guide for Business Speaking is a must for anyone who speaks in public. You can read it in an afternoon, but it will improve your presentations forever.",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "I Can Read About Planets",
        "Authors": "By Lapadula, Tom (ILT), Lapadula, Tom, and Schecter, Darrow",
        "Description": "",
        "Category": " Juvenile Nonfiction , Science & Nature , Astronomy",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Riches of France",
        "Authors": "By Clemente, Maribeth",
        "Description": "02 Whether you're a shopper, a browser, or a traveler with a love for all things French, this is your one-of-a-kind guidebook to the culture of regional France represented by the products and centuries-old craftsmanship of each region. At prices lower than what you would pay in Paris or the United States, you'll find endless treasures as you your boutiques, small factories, artisans' workshops, and wineries and distilleries:--Handmade paper in Auvergne--Moorish music boxes in Corsica--Artwork in the Cote d'Azur--Tapestries in the Limousin--Wine in the Loire Valley--Glasswork in Lorraine--Silk clothing in Lyons--Faience in the Western Loire--and much more, including where to find \"the best of the provinces\" in ParisComplete with details on exchange rates, shipping, French customs, touring, and restaurant and hotel selections, The Riches of France is an indispensable sourecbook for exploring every province of France.",
        "Category": " Travel , Europe , France",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Operation Red Jericho (The Guild of Specialists)",
        "Authors": "By Mowll, Joshua, Puttapipat, Niroot (ILT), Heller, Julek (ILT), and Mowll, Benjamin (ILT)",
        "Description": "A sister and brother's search for their missing parents uncovers a mysterious secret society in an action-filled sea-and-land saga centered in 1920s Shanghai.For Joshua Mowll, it was the surprise of a lifetime. There, among the archives inherited from his great-aunt Rebecca MacKenzie, was a 1920s journal recounting the thrilling and dangerous adventures of fifteen-year-old Rebecca and her younger brother, Doug, in the wake of their parents' mysterious disappearance in the deserts of China. Now carefully re-created in a lavish volume — complete with cloth binding and a journal-style elastic clasp — the siblings' tale begins aboard the Expedient, their uncle's enigmatic research ship, and moves at a breathless pace through the streets of Shanghai and on to a terrifying island fortress. Along the way, Doug and Becca encounter an ancient order of Chinese mercenaries, a brutal pirate warlord, a feisty Texan heiress, and a stolen cache of a volatile explosive called zoridium. By their saga's end, the intrepid duo has exposed a murderous plot involving their parents and uncovered a high-minded secret society hidden from the world for hundreds of years. Interspersed are such \"archival\" elements as: — elaborate diagrams and maps — vintage photos and illustrations — documents with stamps, seals, and watermarks — four full-color gatefolds, the largest a six-page foldout — extensive appendices and notes Painstakingly researched and packed with authentic detail, OPERATION RED JERICHO is the first of three nonstop-action tales of intrigue by first-time author Joshua Mowll — historical fiction at its finest.",
        "Category": " Young Adult Fiction , Historical , Exploration & Discovery",
        "Publisher": "Candlewick Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Buddha: A Story Of Enlightenment (Enlightenment Series)",
        "Authors": "By Chopra, Deepak",
        "Description": "Deepak Chopra brings the Buddha back to life in this gripping New York Times bestselling novel about the young prince who abandoned his inheritance to discover his true calling. This iconic journey changed the world forever, and the truths revealed continue to influence every corner of the globe today.A young man in line for the throne is trapped in his father's kingdom and yearns for the outside world. Betrayed y those closest to him, Siddhartha abandons his palace and princely title. Face-to-face with his demons, he becomes a wandering monk and embarks on a spiritual fast that carries him to the brink of death. Ultimately recognizing his inability to conquer his body and mind by sheer will, Siddhartha transcends his physical pain and achieves enlightenment.Although we recognize Buddha today as an icon of peace and serenity, his life story was a tumultuous and spellbinding affair filled with love and sex, murder and loss, struggle and surrender. From the rocky terrain of the material world to the summit of the spiritual one, Buddha captivates and inspires—ultimately leading us closer to understanding the true nature of life and ourselves.",
        "Category": " Fiction , Biographical",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "The National Endowments: A Critical Symposium",
        "Authors": "By Jarvik, Laurence (EDT), London, Herbert I. (EDT), and Cooper, James Fenimore (EDT)",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Center for the Study of Popular",
        "Price Starting With ($)": "6.1",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Carpenters and Builders Library No 4 : Millwork, Power Tools, Painting (Audel)",
        "Authors": "By John E. Ball",
        "Description": "",
        "Category": "",
        "Publisher": "Theodore Audel & Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Nuns and Soldiers",
        "Authors": "By Murdoch, Iris",
        "Description": "",
        "Category": "",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The Jewish 100: A Ranking of the Most Influential Jews of All Time",
        "Authors": "By Shapiro, Michael",
        "Description": "Ranging from biblical times to the modern era, this collective portrait of Jewish life offers biographical profiles of the most influential Jewish men and women of all time, in sports, religion, music, science, diplomacy, literature, philosophy, and many other fields.",
        "Category": "",
        "Publisher": "Citadel",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Where Will the Animals Stay?",
        "Authors": "By Calmenson, Stephanie and Appleby, Ellen (ILT)",
        "Description": "A kind woman lets the zoo animals stay in her apartment building until the remodeling of the zoo is completed",
        "Category": "",
        "Publisher": "Dutton Childrens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "Inside 100 Great Cars",
        "Authors": "By Hodges, David (EDT)",
        "Description": "",
        "Category": " Transportation , Automotive , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "7.51",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Solitaire & Double solitaire,",
        "Authors": "By Anderson, Robert Woodruff",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "The Astonishing Life of Octavian Nothing, Traitor to the Nation, Vol. 1: The Pox Party",
        "Authors": "By Anderson, M. T.",
        "Description": "National Book Award Winner!This deeply provocative novel reimagines the past as an eerie place that has startling resonance for readers today.It sounds like a fairy tale. He is a boy dressed in silks and white wigs and given the finest of classical educations. Raised by a group of rational philosophers known only by numbers, the boy and his mother — a princess in exile from a faraway land — are the only persons in their household assigned names. As the boy's regal mother, Cassiopeia, entertains the house scholars with her beauty and wit, young Octavian begins to question the purpose behind his guardians' fanatical studies. Only after he dares to open a forbidden door does he learn the hideous nature of their experiments — and his own chilling role in them. Set against the disquiet of Revolutionary Boston, M. T. Anderson's extraordinary novel takes place at a time when American Patriots rioted and battled to win liberty while African slaves were entreated to risk their lives for a freedom they would never claim. The first of two parts, this deeply provocative novel reimagines the past as an eerie place that has startling resonance for readers today.",
        "Category": " Young Adult Fiction , Historical , General",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Such a Pretty Fat: One Narcissist's Quest to Discover If Her Life Makes Her Ass Look Big, or Why Pie Is Not the Answer",
        "Authors": "By Lancaster, Jen",
        "Description": "A NOTE FROM JEN LANCASTER: \"To whom the fat rolls…I'm tired of books where a self-loathing heroine is teased to the point where she starves herself skinny in hopes of a fabulous new life. And I hate the message that women can't possibly be happy until we all fit into our skinny jeans. I don't find these stories uplifting; they make me want to hug these women and take them out for fizzy champagne drinks and cheesecake and explain to them that until they figure out their insides, their outsides don't matter. Unfortunately, being overweight isn't simply a societal issue that can be fixed with a dose healthy of positive self-esteem. It’s a health matter, and here on the eve of my fortieth year, I've learned I have to make changes so I don't, you know, die. Because what good is finally being able to afford a pedicure if I lose a foot to adult onset diabetes?\"Watch a QuickTime trailer for this book.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "If I Could: A Mother's Promise",
        "Authors": "By Milord, Susan and Denise, Christopher (ILT)",
        "Description": "\"If I could, I’d swim the deepin search of treasures for you to keep.\"From the first rays of the morning sun to the last nod of a tiny head at bedtime, a toddler and mother share a blissfully ordinary day. But there is nothing ordinary about the love between them — a love that is as bright as flowers, as lovely as a song, as comforting as stars, and as deep as the ocean.",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Liberal Judaism",
        "Authors": "By Borowitz, Eugene B.",
        "Description": "Formerly URJ Press #386050This book probes the varieties of Jewish thought and ritual practice from the perspective of liberal Judaism.",
        "Category": " Religion , General",
        "Publisher": "Behrman House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Emily Windsnap and the Monster from the Deep",
        "Authors": "By Kessler, Liz and Gibb, Sarah (ILT)",
        "Description": "An enchanting tale with a fabulous monster, engaging characters, plenty of mermaid magic, and a page-turning story, Liz Kessler's new middle-grade fantasy has all the charm and warmth of its predecessor, THE TAIL OF EMILY WINDSNAP.Picture an island set in a glittering blue sea, sparkling with white sand and palm trees, a secret place where humans and merfolk live together  and where a girl who grows a mermaid's tail when she enters the water is not considered a problem. To Emily Windsnap - half mermaid, half human - her new home is perfect. That is, until Emily ruins everything by waking a legendary sea monster known as the Kraken from its hundred-year sleep. As the Kraken rises from the deep, putting the future of the islanders in jeopardy, Emily makes a desperate attempt to save them. But how could she have dreamed that her best friend, Shona, would stop talking to her, or that Mandy Rushton, her old enemy from junior high, would turn up when least expected?",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "The Rise and Fall of the Kate Empire (Lizzie McGuire)",
        "Authors": "By Kirsten Larsen",
        "Description": "",
        "Category": "",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1900"
        }
    },
    {
        "Title": "The Wright Brothers: Pioneers of American Aviation (Landmark Books)",
        "Authors": "By Reynolds, Quentin",
        "Description": "Young Orville and Wilbur Wright loved building things. From the fastest sled in town to the highest-flying kite, the Wright brothers’ creations were always a step ahead of everyone else’s. They grew up learning all about mechanics from fixing bicycles and studied math and physics. On December 17, 1903, Orville took off in the world’s first flying machine! The Wright airplane is one of the most amazing–and life-changing–",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1981"
        }
    },
    {
        "Title": "Judaism and the World's Religions",
        "Authors": "By Bamberger, David",
        "Description": "A guide to the many paths through which people search for God. Jewish answers to tough questions:Atheism. Can we live an ethical life without God?Fundamentalism. What are the attractions--and the dangers--of simple answers in a complex world?Assimilation and Intermarriage. Does it matter if Judaism survives?Hinduism. Buddhism. Islam. Christianity. What do these faith share with Judaism, and how do they differ?The history, beliefs, practices, and teachings of each major religion, seen through Jewish eyes.",
        "Category": " Religion , General",
        "Publisher": "Behrman House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Sentimental Journey",
        "Authors": "By Barnett, Jill",
        "Description": "In her stunning hardcover debut, New York Times bestselling author Jill Barnett creates a powerful novel of love, honor, and courage, set against the epic panorama of World War II. Kitty Kincaid grew up in the shadow of her father, a famous research scientist. But when she is captured by the Nazis in French Morocco, she must rely on her own wits to survive.  J.R. Cassidy is a U.S. Army ofÞcer, an expert who specializes in impossible missions where rules don't matter...only winning does. But when he inÞltrates a mountain stronghold to get Kitty out, they are trapped, with only one route of escape -- through the burning Sahara Desert. Charlotte Morrison is a barnstormer's daughter who courageously ferries planes to Britain's Royal Air Force. But soon she is torn between two men: an idealistic younger man who will follow her into the jaws of the enemy and an intense stranger who cannot let go of the past.  Red Walker has spent his whole life in a small Texas town -- until the day someone special gives him the courage to walk away.  George \"Skip\" Inskip is a renowned þying ace in the British Royal Air Force, a man whose actions aren't driven by patriotism, but by a powerful need for vengeance.  In a love story spanning three continents and an inÞnite range of human emotions, these spirited men and women live hard, love hard, and Þght hard. On burning sands, in blue skies, and under screaming Nazi bombs, they all make their own personal journeys. But when fate brings them together in a place where duty comes before love, they can no longer live only for today -- not if they ever want to see tomorrow.  Passionate, poignant, and masterfully told, Sentimental Journey is a triumphant adventure of the choices made for love and country at a time when ordinary, everyday people became heroes.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Operation Typhoon Shore (The Guild of Specialists, No.2)",
        "Authors": "By Mowll, Joshua",
        "Description": "Get ready for Book II of the thrilling, novelty-packed Guild of Specialists trilogy.After being lashed by a typhoon on their uncle's ship, THE EXPEDIENT, intrepid siblings Becca and Doug MacKenzie want nothing more than to escape from the volcanic island on which they're stranded and resume the search for their parents. But their uncle, Captain MacKenzie, seems more concerned with the missing gyrolabe than their missing mother and father, and he refuses to discuss the role the mysterious Guild of Specialists played in their disappearance. As the formidable Kalaxx warriors close in on their hidden cove, Becca and Doug unearth a riddle linked to a 1533 painting, which may hold the key to the Guild's dark secrets and to finding their parents. But how can they possibly solve the puzzle and escape with their lives — before their enemies attack?",
        "Category": " Young Adult Fiction , Historical , Exploration & Discovery",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Tough Choices: Jewish Perspectives on Social Justice",
        "Authors": "By Vorspan, Albert and Saperstein, David",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "UAHC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The KILLING SEASON",
        "Authors": "By Corwin, Miles",
        "Description": "After gaining unprecedented access inside the LAPD, Miles Corwin hand picked a detective team whom he would be shadowing - day in and day out - throughout the summer. He struck gold with Pete \"Raz\" Razanskas and Marcella Winn. Larger than life and truly unsung heroes, Raz and Winn are as colorful as any fictional characters. Raz is a crusty veteran of the force and as the \"season\" begins he is newly paired with the most unlikely partner - Marcella Winn, a street smart young black woman who grew up in the 'hood and doesn't back down from anyone.The Killing Season is shocking, uncensored, and full of real-life drama. Although it reads like a fast-paced novel, this is an important work of nonfiction that offers readers a genuine sense of what life is like for the cops, the killers, the victims, and their families.",
        "Category": " Social Science , Criminology",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "America Back on Track",
        "Authors": "By Kennedy, Edward M.",
        "Description": "With a Senate career that has spanned more than four decades, Edward M. Kennedy has become one of the strongest voices in American politics. In this, his first major policy book in more than twenty years, he argues that America is at a crossroads, having departed more deeply from its fundamental ideals than at any time in its modern history. In response to this erosion of basic values, he presents a sweeping agenda for reform and renewal, speaking to the country's most significant needs at home and abroad. National security, the war in Iraq, terrorism, and key domestic challenges such as jobs, health care, education, civil rights, energy, and the environment all receive major attention in his proposals to counter the harmful policies of the current administration, restore America's respect in the world, and create a better America here at home where democracy, individual opportunity, equal justice, and innovation can flourish.--From publisher description.The four-decade senator contends that the United States has stepped away from its basic ideals and proposes changes to national security, health care, education, civil rights, energy, and the environment.",
        "Category": " Political Science , American Government , National",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "95.0",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "A Brief History of Saudi Arabia",
        "Authors": "By Wynbrandt, James and Gerges, Fawaz A. (FRW)",
        "Description": "Aimed at students and general readers, this text presents an overview of the history of Saudi Arabia from its settlement in prehistoric times to its designation as a key player in the global order of the present day. A sampling of topics includes the birth and spread of Islam, Bedouin society and culture, the origins of the House of Saud, and the current battle between conservative and progressive elements in the monarchy. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " History , Middle East , General",
        "Publisher": "Facts on File",
        "Price Starting With ($)": "29.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "A Rainbow of Hope: 777 Inspirational Quotes Plus Selected Scriptures",
        "Authors": "By Rainbow (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Rainbow Studies",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Practical Project Management: The Secrets of Managing Any Project on Time and on Budget",
        "Authors": "By Michael Dobson",
        "Description": "",
        "Category": "",
        "Publisher": "Skillpath Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Fragrant Flowers: Simple Secrets for Glorious Gardens -- Indoors and Out: A Garden Style Book",
        "Authors": "By Brennan, Georgeanne, Echtermeyer, Faith (PHT), and Echtermeyer, Faith",
        "Description": "Indulging the senses with the aroma and elegance of beautiful blooms is easier than ever with Fragrant Flowers. From window boxes of heliotrope and sweet pea to gardens perfumed by honeysuckle and tuberose, this richly illustrated guide offers recipes for growing 29 scented flowers -- indoors and out, all year long. Including ideas for creating sweet-smelling dried potpourri and sachets, this lovely, informative volume is perfect for both the novice and expert gardener.",
        "Category": " Gardening , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Kid's Room: Ideas and Projects for Children's Spaces",
        "Authors": "By Levy, Jennifer, Louie, Elaine, and Davey, Dania",
        "Description": "It's an age-old dilemma--how to create a stylish room that still allows a kid to be a kid. Kids' Rooms solves the problem by presenting fresh, original ideas for creating fun yet functional spaces. Aimed at parents of 4- to 13-year-olds, this essential guide to pint-sized dcor offers practical counsel on the necessities of room layout--everything from furniture and fixtures to lighting and window treatments is covered. Color choices, fabrics, and themes are explored along with kid-friendly storage systems (a Folding Screen with Pockets!). In addition, Kids' Rooms showcases 15 fabulous and innovative rooms, that will pique the imagination. These featured rooms, such as the Log Cabin Retreat, the Purple Power Room, and Sheer Heaven, all blend form and function with charm and creativity. Best of all, Kids' Rooms includes numerous projects with easy-to-follow directions, demonstrating that redecorating need not be difficult or expensive. A must-have for anyone who's ever faced the challenge of decorating a kid's room.",
        "Category": " House & Home , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "The Guide to Owning a Poodle (Re Dog)",
        "Authors": "By Dib, Pierre",
        "Description": "",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Instant Persuasion",
        "Authors": "By Puhn, Laurie",
        "Description": "Thirty-five fast, simple rules that will improve the way you communicate and change your life!  Instant Persuasion is a unique communication book that offers a creative way to reduce stress, resolve conflict, and enrich our relationships with family members, friends, and coworkers. Laurie Puhn cleverly translates complex mediation skills into simple, practical communication rules that readers can easily apply during everyday situations to instantly persuade others to listen to, cooperate with, respect, and like them. The rules are revealed through real-life anecdotes that show readers how to say the right words at the right time to convince others to give them what they want.  Some Instant Persuasion rules include how to:  - Find factual solutions. - Be a problem solver. - Disagree without being disagreeable. - Beware of uncomplimentary compliments. - Avoid superficial offers.  Puhn presents readers with a script that will allow them to smoothly implement these rules in everyday life and change the way they communicate forever. Instant Persuasion is an amazing tool that has the power to transform friendships, marriages, and careers.",
        "Category": " Self-help , General",
        "Publisher": "Tarcher/Penguin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "My Penguin Osbert: Midi Edition",
        "Authors": "By Kimmel, Elizabeth Cody and Lewis, H. B. (ILT)",
        "Description": "Fabulously illustrated by H. B. Lewis, Elizabeth Cody Kimmel's hilarious romp through the land of be-careful-what-you-wish-for offers a whole year's worth of holiday fun magic.This year, I was very specific in my letter to Santa Claus.Each year at Christmas, Joe writes a letter to Santa. But they've had a few misunderstandings in the past. Last year, for example, Joe wanted a fire-engine-red racecar with retracting headlights, and he did get one — but it was only three inches long. So this year Joe is really, really careful. He describes exactly what he wants — and on Christmas morning, guess what's waiting for him under the tree! Santa has brought him a living, breathing, black-and-white penguin named Osbert. Will anything in Joe's life ever be the same?",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "The Washington Post Dining Guide",
        "Authors": "By Sietsema, Tom",
        "Description": "",
        "Category": "",
        "Publisher": "The Washington Post",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "The Constant Gardener Movie Tie-In",
        "Authors": "By Le Carre, John",
        "Description": "Tessa Quayle -- young, beautiful, and dearly beloved to husband Justin -- is gruesomely murdered in northern Kenya. When Justin sets out on a personal odyssey to uncover the mystery of her death, what he finds could make him not only a suspect, but also a target for Tessa's killers.A master chronicler of the betrayals of ordinary people caught in political conflict, John le Carré portrays the dark side of unbridled capitalism as only he can. In The Constant Gardener he tells a compelling, complex story of a man elevated through tragedy, as Justin Quayle -- amateur gardener, aging widower, and ineffectual bureaucrat -- discovers his own natural resources and the extraordinary courage of the woman he barely had time to love.",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster Audio",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Windows 98 Annoyances: Taking Charge of Windows 98",
        "Authors": "By Karp, David A.",
        "Description": "An operating system is a piece of software that should do its work in the background while you do your work in the foreground. In an ideal world, that's precisely how an operating system would work. In our world, however, operating systems constantly get in our way. They annoy us. And few are more annoying than Microsoft Windows 98. Perhaps you're annoyed with the icons that Windows deposits on your desktop and that you never use. Or you're frustrated with the new elements of the Windows 98 interface. Or you consider Windows 98's central feature, its integration of Windows and the Web, to be a massive inconvenience.With Windows 98 Annoyances, you can put an end to these and countless other annoyances. Given the book's format, which presents particular problems and immediately offers one or more solutions, you can quickly identify the Windows 98 features that most annoy you and equally quickly provide a fix for them. In the process, you'll take charge of Windows so that it works the way you want, rather than the way that Microsoft or some other software publisher has configured it.Based on the author's extremely popular Windows Annoyances web site www.annoyances.org, Windows 98 Annoyances provides an authoritative collection of techniques for customizing Windows 98, including:Useful keyboard shortcuts that let you work with Windows 98 more efficientlyTechniques for working with the Windows registry, the database of system and application-specific configuration informationAvailable third-party software and utilities that handle some of the more complex workarounds and customizationsDealing with software applications that overwrite your file associations without warningA discussion of scripting with the Windows Scripting Host as a means of eliminating many of the Windows 98's annoyances to be the definitive resource for customizing Windows 98.",
        "Category": " Computers , Operating Systems , Windows Desktop",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "A Civil War Treasury of Tales, Legends & Folklore",
        "Authors": "By Botkin, B. A.",
        "Description": "Collection of personal narratives, anecdotes, tall tales, and fables convey the courage, imagination, and humor of the Civil War era",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Promontory Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Kaimira: The Sky Village: Book One (Kaimira (Hardcover))",
        "Authors": "By Ashland, Monk, Ashland, Nigel, and Nentrup, Jeff (ILT)",
        "Description": "From a village made of hot-air balloons to a subterranean battle arena, two young people struggle to discover who and what they are — and how to use the astonishing powers they share.High over China, twelve-year-old Mei arrives at the Sky Village, an intricate web of hot-air balloons floating above an Earth where animals battle machines for control. Deep below the ruins of Las Vegas, thirteen-year-old Rom enters a shadowy world where he is commandeered to fight, gladiator-style, against hybrid demons for the entertainment of a mercenary crowd. Mei and Rom have never met, but they share a common journal — a book that allows them to communicate with each other and reveals that they carry the strange and frightening Kaimira gene, entwining aspects of human, beast, and machine within their very DNA. In this thrilling, intricately plotted novel, Mei and Rom must find the courage to balance the powers that lurk within — and overcome outside forces that seek to destroy them — if they are to survive and save the ones they love.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "The Hunt: A Novel (Hunt Country Suspense)",
        "Authors": "By Neuharth, Jan",
        "Description": "The complex and romanticized lifestyle of elite fox hunters is revealed in this thrilling murder mystery. An attractive and wealthy lawyer and horseman, Doug Cummings personifies the old-money equine subculture of Middleburg, Virginia. Driven to succeed, Cummings’s climb to the top is halted when he becomes the target of a twisted scheme to frame him for the murders of his former lover and horse groom. As Cummings attempts to find the true culprits, the conflicting forces of his community offer a revealing look at how vengeance, love, and envy obscure the search for truth and justice.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Paper Chase Farms Publishing Group",
        "Price Starting With ($)": "5.57",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "My Very First Mother Goose",
        "Authors": "By Wells, Rosemary (ILT) and Opie, Iona Archibald (EDT)",
        "Description": "To a small child, words are magical.  And the most magical of all are the beloved, venerable words of Mother Goose.  Now folklorist Iona Opie has gathered more than sixty treasured rhymes in their most perfect, honest form.  From \"Hey Diddle, Diddle\" and \"Pat-a-Cake\" to \"Little Jack Horner\" and \"Pussycat, Pussycat,\" these are familiar verses that have been passed from parent to child for generations; these are the rhymes that are every child's birthright.With watercolors by Rosemary Wells that may prove equally enduring, MY VERY FIRST MOTHER GOOSE captures the simple joy and the sly humor that are the essence of Mother Goose.  Parents and children will find themselves exploring this volume together, savoring delightful details and funny surprises on every page.  This is a book that promises hours of quiet smiles and merry grins for readers of all ages.",
        "Category": " Juvenile Fiction , Nursery Rhymes",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "I'll Hold You in Heaven: Healings and Hope for the Parent of a Miscarried, Aborted, or Stillborn Child",
        "Authors": "By Hayford, Jack W.",
        "Description": "",
        "Category": "",
        "Publisher": "Regal Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Carpenter's Toolbox Manual (ARCO'S ON-THE-JOB REFERENCE SERIES)",
        "Authors": "By Meers, Gary D.",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "May Christ Be the Center of Your Christmas",
        "Authors": "By Phelps, V.",
        "Description": "",
        "Category": " Religion , Holidays , Christmas & Advent",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "10.34",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Abraham Lincoln: The Great Emancipator (Childhood of Famous Americans)",
        "Authors": "By Stevenson, Augusta and Robinson, Jerry (ILT)",
        "Description": "Describes Lincoln's boyhood on isolated farms in Kentucky and Illinois and recounts his career as lawyer, politician, and president",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Political",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Nightmare on Hannah Street (Hannah Montana)",
        "Authors": "By McElroy, Laurie (ADP)",
        "Description": "Series Description:Miley Stewart looks like a regular girl-next-door, but she's got a big secret. When the lights go down, Miley is the famous teen pop sensation Hannah Montana! Miley may be a celebrity when she's on stage, but she wants the rest of her life to be as normal as possible. The only people who know the truth about Miley's dual identity are her father, brother, and best friends Lilly and Oliver. But keeping that secret--and balancing school with her newfound fame and fortune--is harder than Miley ever thought it would be.  Hannah Montana #7: When Miley's scheming, look-alike cousin Luann pays a visit, she's surprisingly well behaved. Miley thinks they finally might have gotten over the rough patch from their childhood, and even invites Luann to the coolest Halloween party in town. But when Luann hog-ties Miley in her pop-star closet, Miley realizes she's made a big mistake! Will Miley's friends rescue her in time to stop Luann from revealing Miley's secret identity? Plus, when Miley's grandmother comes for a visit, Miley's brother Jackson seems to be getting more than his fair share of attention. Didn't anyone teach Grandma Stewart not to play favorites?  Hannah Montana #8: Ever since Jake Ryan started acting on the TV show, Zombie High, Miley thinks he's become a huge egomaniac. So when he invites Miley to the school Seventies Dance, she says no. Then Hannah Montana guest stars on Jake's show, and Miley realizes she might have been wrong about her former crush--but is it too late? Plus, when Miley and Jake start using other people to make each other jealous, it's bound to backfire--Miley just never expected it would be on her!Hannah Montana #9: When Hannah Montana becomes a spokesmodel in a TV commercial for a new perfume, there's only one problem--she hates it! But when she gets an incredibly hot gift for being the new face of Eau Wow, Miley starts to reconsider. . . . But could she really go on TV and lie to the whole world? Plus, when Miley accidentally gets her brother Jackson fired from his job, she makes him Hannah Montana's assistant--with serious consequences!",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Room Redo",
        "Authors": "By Julia Devillers",
        "Description": "",
        "Category": "",
        "Publisher": "Limited Too Creative Design, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Olive's Ocean",
        "Authors": "By Henkes, Kevin",
        "Description": "Sometimes life can change in an instantMartha Boyle and Olive Barstow could have been friends, but they weren't. Weeks after a tragic accident, all that is left are eerie connections between the two girls, former classmates who both kept the same secret without knowing it. Now, even while on vacation at the ocean, Martha can't stop thinking about Olive. Things only get more complicated when Martha begins to like Jimmy Manning, a neighbor boy she used to despise. What is going on? Can life for Martha be the same ever again?",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Greenwillow Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "KISS Guide to Massage (Keep It Simple Series)",
        "Authors": "By Maxwell-Hudson, Clare",
        "Description": "",
        "Category": " Health & Fitness , Reference",
        "Publisher": "DK Adult",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Amy Number Seven (Replica)",
        "Authors": "By Kaye, Marilyn",
        "Description": "Despite her amazingly keen senses, gymnast-like abilities, and genius brain, twelve-year-old Amy knows nothing of her past and wonders about a recurring nightmare, a strange birthmark, secret warnings, and more. Original.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Skylark",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The Art of Keeping Cool (Aladdin Historical Fiction)",
        "Authors": "By Lisle, Janet Taylor",
        "Description": "The War At Home Fear permeates the Rhode Island coastal town where Robert, his mother, and sister are living out the war with his paternal grandparents: Fear of Nazi submarines offshore. Fear of Abel Hoffman, a German artist living reclusively outside of town. And for Robert, a more personal fear, of his hot-tempered, controlling grandfather. As Robert watches the townspeople's hostility toward Hoffman build, he worries about his sensitive cousin Elliot's friendship with the artist. And he wonders more and more about the family secret everyone seems to be keeping from him—a secret involving Robert's father, a bomber pilot in Europe. Will Elliot's ability to detach himself from the turmoil around him be enough to sustain him when prejudice and suspicions erupt into violence? And can Robert find his own way to deal with the shocking truth about his family's past?",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Tuned In, Episode #7: Surprise Sleepover",
        "Authors": "By Julia Devillers",
        "Description": "",
        "Category": "",
        "Publisher": "Too Brands Investments, L.L.C.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Seventeenth Swap",
        "Authors": "By McGraw, Eloise",
        "Description": "",
        "Category": "",
        "Publisher": "Sonlight Curriculum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Singing the Tears The Immigrant Journey",
        "Authors": "By Gustaff, Leona",
        "Description": "",
        "Category": " Sports & Recreation , Bowling",
        "Publisher": "Albert J Gustaff",
        "Price Starting With ($)": "9.2",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Astonishing Life of Octavian Nothing, Traitor to the Nation, Vol. 2: The Kingdom on the Waves",
        "Authors": "By Anderson, M. T.",
        "Description": "\"A novel of the first rank, the kind of monumental work Italo Calvino called ‘encyclopedic’ in the way it sweeps up history into a comprehensible and deeply textured pattern.\" — The New York Times Book ReviewFearing a death sentence, Octavian and his tutor, Dr. Trefusis, escape through rising tides and pouring rain to find shelter in British-occupied Boston. Sundered from all he knows — the College of Lucidity, the rebel cause — Octavian hopes to find safe harbor. Instead, he is soon to learn of Lord Dunmore's proclamation offering freedom to slaves who join the counterrevolutionary forces. In Volume II of his unparalleled masterwork, M. T. Anderson recounts Octavian's experiences as the Revolutionary War explodes around him, thrusting him into intense battles and tantalizing him with elusive visions of liberty. Ultimately, this astonishing narrative escalates to a startling, deeply satisfying climax, while reexamining our national origins in a singularly provocative light.",
        "Category": " Young Adult Fiction , Historical , United States , Colonial & Revolutionary Periods",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "How to be Single: A Novel",
        "Authors": "By Tuccillo, Liz and Greer, Judy (NRT)",
        "Description": "It's the most annoying question and they just can't help asking you:Why are you single?On a brisk October morning in New York, Julie Jenson, a single thirty-eight-year-old book publicist, gets a hysterical phone call from her friend Georgia. Reeling from her husband's announcement that he is leaving her for a samba teacher, Georgia convinces a reluctant Julie to organize a fun girls' night out with all of their single friends to remind her why it is so much fun not to be tied down.But the night becomes a wake-up call for Julie because none of her friends seem to be having much fun: Alice, a former legal aid attorney has recently quit her job to start dating for a living; Serena, who is so busy becoming a fully realized person that she can't find time to look for a mate; and Ruby, a curvy and compassionate woman, has been mourning the death of her cat for months.Fed up being single in Manhattan, Julie sets off to find out how women around the world deal with this dreaded phenomenon. From Paris to Rio to Sydney, Bali, Beijing, Mumbai, and Reykjavik, Julie falls in love, gets her heart broken, sees the world, and learns more than she ever dreamed possible. Written in Liz Tuccillo's pitch-perfect, hilarious, and relatable voice, How to Be Single is the ultimate novel for the adventurer in us all.",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster Audio",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Kiss Good Night (Sam Books)",
        "Authors": "By Jeram, Anita (ILT) and Hest, Amy",
        "Description": "\"The finale is so satisfying that it calls for an encore. 'Again!' Sam says, as will readers of this cozy story.\" — Child MagazineIt was a dark and stormy night on Plum Street. In the little white house, Mrs. Bear was putting Sam to bed.Outside, the wind blows and the rain comes down. Inside, it is Sam's bedtime. Mrs. Bear reads him a story, tucks him in, and brings him warm milk. \"Are you ready now, Sam?\" she asks. \"I'm waiting,\" he says. What else does Sam need before he'll go to sleep? Could Mrs. Bear have forgotten a kiss? This New York Times best-selling story by two of the most beloved picture book creators is available in a board book edition suitable for the youngest listeners.",
        "Category": " Juvenile Fiction , Bedtime & Dreams",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Amelia Hits the Road",
        "Authors": "By Moss, Marissa",
        "Description": "Ten-year-old Amelia keeps a journal of the summer car trip she takes with her mother and sister to Grand Canyon, Death Valley, and their California home town to visit Amelia's best friend",
        "Category": " Juvenile Fiction , Transportation , General",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Each Peach Pear Plum (Picture Puffin Books)",
        "Authors": "By Ahlberg, Janet and Ahlberg, Allan",
        "Description": "In this book with your little eye, take a look and play I spy - so starts the classic story from best-selling author/illustrator team, Janet and Allan Ahlberg. Each Peach Pear Plum introduces favourite fairy tale characters, such as Tom Thumb and The Three Bears and, with a poem on each page hinting as to what is hiding in the picture, children are encouraged to participate and follow the story themselves.",
        "Category": " Juvenile Fiction , Imagination & Play",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "A Beautiful Blue Death: The First Charles Lenox Mystery (Charles Lenox Mysteries)",
        "Authors": "By Finch, Charles",
        "Description": "Charles Lenox, Victorian gentleman and armchair explorer, likes nothing more than to relax in his private study with a cup of tea, a roaring fire and a good book. But when his lifelong friend Lady Jane asks for his help, Lenox cannot resist the chance to unravel a mystery.Prudence Smith, one of Jane's former servants, is dead of an apparent suicide. But Lenox suspects something far more sinister: murder, by a rare and deadly poison. The grand house where the girl worked is full of suspects, and though Prue had dabbled with the hearts of more than a few men, Lenox is baffled by the motive for the girl's death.When another body turns up during the London season's most fashionable ball, Lenox must untangle a web of loyalties and animosities. Was it jealousy that killed Prudence Smith? Or was it something else entirely? And can Lenox find the answer before the killer strikes again—this time, disturbingly close to home?",
        "Category": " Fiction , Mystery & Detective , Traditional",
        "Publisher": "St. Martin's Minotaur",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    }
]