[
    {
        "Title": "Bear-ology: Fascinating Bear Facts, Tales & Trivia",
        "Authors": "By Dolson, Sylvia",
        "Description": "\"An informative review of the world's bears (including black bears, grizzlies, polar bears and giant pandas) reveals bear behavior and biology, past and present mythologies, plus modern day perceptions and human-bear coexisting issues; complete with numerous photos, illustrations and trivia\"--Provided by publisher.",
        "Category": " Nature , Animals , Bears",
        "Publisher": "PixyJack Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "The Illuminati",
        "Authors": "By Burkett, Larry",
        "Description": "The year is 2001 and the world is on the brink of economic collapse as the Illuminati, a deadly secret organization, succeeds in placing one of their people in the office of the presidency of the United States, gaining control of world events.Have John Elder and Randy Cross read the \"signs of the times\" soon enough to expose theIlluminatiand thwart their diabolical plan? Or will this organization and its leaders be hailed as the world's political saviors?",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "WestBow Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Common Sense Parenting: A Proven Step-By-Step Guide for Raising Responsible Kids and Creating Happy Families",
        "Authors": "By Burke, Raymond V., Herron, Ronald W., and Father Flanagan's Boys' Home (COR)",
        "Description": "",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Boys Town Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "10 Incredible Mistakes at Gettysburg: A Review of the Battle and How Blunders by the Generals Shaped the Outcome",
        "Authors": "By Mullen, Harris",
        "Description": "",
        "Category": "",
        "Publisher": "High Water Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The World Book of Space Exploration : Wonders of the Universe and Space Travel",
        "Authors": "By World Book Inc Staff",
        "Description": "",
        "Category": "",
        "Publisher": "World Book/Scott Fetzer",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "John Adams: Party of One",
        "Authors": "By Grant, James",
        "Description": "An acute examination of a paradoxical U.S. president.John Adams was an undiplomatic diplomat and an impolitic politician--a fierce revolutionary yet a detached and reluctant leader of the nation he helped to found. Few American public figures have ever been more devoted to doing the right thing, or more contemptuous of doing the merely popular thing. Yet his Yankee-bred fixation with ethical propriety and fiscal conservatism never stood in the way of his doing what was necessary. Adams hated debt, but as minister to the Netherlands during the Revolution, he was America's premier junk-bond salesman. And though raised a traditional Massachusetts Congregationalist, Adams was instrumental in bringing about the consecration of the first American Episcopal bishops. He was a warm and magnanimous friend and, on occasion, a man who fully vindicated the famous judgment of a rival he detested. Adams, said Benjamin Franklin, \"means well for his country, is always an honest man, often a wise one, but, sometimes, and in some things, is absolutely out of his senses.\" James Grant examines this complex and often contradictory founding father in the most well-rounded and multi-faceted portrait of Adams to date. Going from his beginnings on a hardscrabble Massachusetts farm to the Continental Congress to the Court of St. James and the White House, Grant traces the words and deeds of one of our most learned but politically star-crossed leaders.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "How Mumbo-Jumbo Conquered the World",
        "Authors": "By Wheen, Francis",
        "Description": "What characterizes our era? Cults, quacks, gurus, irrational panics, moral confusion and an epidemic of mumbo-jumbo, that's what. In How Mumbo-Jumbo Conquered the World, Francis Wheen brilliantly laments the extraordinary rise of superstition, relativism and emotional hysteria. From Middle Eastern fundamentalism to the rise of lotteries, astrology to mysticism, poststructuralism to the Third Way, Wheen shows that there has been a pervasive erosion ofEnlightenment values, which have been displaced by nonsense. And no country has a more vivid parade of the bogus and bizarre than the one founded to embody Enlightenment values: the USA. In turn comic, indignant, outraged, and just plain baffled by the idiocy of it all, How Mumbo-Jumbo Conquered the World is a masterful depiction of the absurdity of our times and a plea that we might just think a little more and believe a little less.",
        "Category": " History , World",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Word Spy: The Word Lover's Guide to Modern Culture",
        "Authors": "By McFedries, Paul",
        "Description": "Language wears many hats, but its most important job is to help us name or describe what's in the world.  Words define us, our actions, even our existence.  And just when you think that you have all the words you need, you discover new ones, hear new uses for old ones or see them mutate right before your eyes—a neologism is born.Those neologisms are actually one of the best ways of keeping tabs on the way our world and culture are changing.  One of the people who's been keeping tabs is Paul McFedries, the president of Logophilia Limited (logophilia is Greek for \"the love of words\"). His scorecard is Word Spy, a daily newsletter that has been reporting from the neological frontier since 1998 and that has more than 100,000 visitors a month and more than 12 million page views. In Word Spy, McFedries demonstrates how new words both reflect and illuminate not only the subcultures that coin them but also the larger culture in which these groups exist.  Neologisms give us insight into the way things are even as they act as linguistic harbingers of what's to come.  Each chapter of Word Spy is a cultural snapshot, a slice of the zeitgeist that focuses on a specific idea or sociological phenomenon, with an emphasis on the words and phrases that it has generated.  These snapshots cover various aspects of modern life, including relationships, business, technology, war, aging, multiculturalism, and even fast food, all the while introducing us to hybrid words:  If your kids can't seem to get away from their computers, they may be addicted to \"fritterware\" (time-wasting game software).  If you're a new mother with a passion for petitioning, you may be a \"lactivist\" (breast-feeding activist).  And if you keep finding yourself staying way later at the office than you ever imagined, you may be suffering from \"presenteeism.\"  Word Spy is an exciting and informative travelogue through the evolving landscape of our language and, consequently, the cultures and subcultures that continually mold and shape not just the language but all of us who speak it.",
        "Category": " Reference , Word Lists",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "The Moroccan",
        "Authors": "By Haddad, C. A.",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "We Were the Mulvaneys (Oprah's Book Club)",
        "Authors": "By Oates, Joyce Carol",
        "Description": "A New York Times Notable Book and a former Oprah Book Club® selection  Moving away from the dark tone of her more recent masterpieces, Joyce Carol Oates turns the tale of a family struggling to cope with its fall from grace into a deeply moving and unforgettable account of the vigor of hope and the power of love to prevail over suffering. The Mulvaneys of High Point Farm in Mt. Ephraim, New York, are a large and fortunate clan, blessed with good looks, abundant charisma, and boundless promise. But over the twenty-five year span of this ambitious novel, the Mulvaneys will slide, almost imperceptibly at first, from the pinnacle of happiness, transformed by the vagaries of fate into a scattered collection of lost and lonely souls. It is the youngest son, Judd, now an adult, who attempts to piece together the fragments of the Mulvaneys' former glory, seeking to uncover and understand the secret violation that occasioned the family's tragic downfall. Each of the Mulvaneys endures some form of exile--physical or spiritual--but in the end they find a way to bridge the chasms that have opened up among them, reuniting in the spirit of love and healing. Profoundly cathartic, Oates' acclaimed novel unfolds as if, in the darkness of the human spirit, she has come upon a source of light at its core. Rarely has a writer made such a startling and inspiring statement about the value of hope and compassion.",
        "Category": " Fiction , Literary",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Speed Racer Born To Race",
        "Authors": "By Michael Anthony Steele",
        "Description": "",
        "Category": "",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Daughter of the River: An Autobiography",
        "Authors": "By Ying, Hong",
        "Description": "Daughter of the River is a memoir of China unlike any other. Born during the Great Famine of the early 1960s and raised in the slums of Chongqing, Hong Ying was constantly aware of hunger and the sacrifices required to survive. As she neared her eighteenth birthday, she became determined to unravel the secrets that left her an outsider in her own family. At the same time, a history teacher at her school began to awaken her sense of justice and her emerging womanhood. Hong Ying's wrenching coming-of-age would teach her the price of taking a stand and show her the toll of totalitarianism, poverty, and estrangement on her family. With raw intensity and fearless honesty, Daughter of the River follows China's trajectory through one woman's life, from the Great Famine through the Cultural Revolution to Tiananmen Square.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "EVIDENCE",
        "Authors": "By Ravin, Neil",
        "Description": "Dr. Ann Payson and her lover and colleague, Dr. Ben Abrams, suspect that the legendary new chief of surgery, Ann's boss, is mishandling critical operations",
        "Category": " Fiction , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Five Little Christmas Angels",
        "Authors": "By Boniface, William and Adams, Lynn (ILT)",
        "Description": "",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "This Body of Death: An Inspector Lynley Novel (A Lynley Novel)",
        "Authors": "By George, Elizabeth",
        "Description": "\"George explores her characters' dreams and fears with a penetrating grace that makes reading her books a joy.\" —Washington Post Book World \"Elizabeth George reigns as queen of the mystery genre. The Lynley books constitute the smartest, most gratifyingly complex and impassioned mystery series now being published.\" —Entertainment Weekly The spellbinding new Inspector Lynley novel from Elizabeth George, New York Times bestselling author of Careless in Red and What Came Before He Shot Her.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Don't Sweat the Small Stuff . . . and It's All Small Stuff: Simple Ways to Keep the Little Things from Taking Over Your Life (Don't Sweat the Small Stuff Series)",
        "Authors": "By Carlson, Richard",
        "Description": "This groundbreaking inspirational guide--a classic in the self-help genre--shows you how to put challenges in perspective, reduce stress and anxiety through small daily changes, and find the path to achieving your goals. Among the insights it reveals are how to:Think of your problems as potential \"teachers\"Do one thing at a timeShare glory with othersLearn to trust your intuitions",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Sammy Keyes and the Art of Deception",
        "Authors": "By Van Draanen, Wendelin",
        "Description": "Sammy Keyes has a lot of nerve. Wearing high-tops to a fancy reception at an art gallery. Asking why a framed orange splot is worth $10,000. Eyebrows rise. Noses turn up.But then Sammy tackles a thief who tries to break up the soiree with a stickup. Now the patrons of the arts are glad she has a lot of nerve. Or are they? Sammy may have stopped a criminal, but the real crime has yet to be discovered. The real crime is more subtle, more artful, than anything Sammy’s ever seen.  She had no idea art could be so dangerous. . . .This edition also includes a free cd including an interview with Wendelin, a reading from Sammy Keyes and the Search for Snake Eyes, and \"The Sammy Keyes Song\".",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "The Economic Naturalist's Field Guide: Common Sense Principles for Troubled Times",
        "Authors": "By Frank, Robert H.",
        "Description": "Ask a dozen talking heads about how the economy works and what course of action we should take and you’ll get thirteen different answers. But what if we possessed a handful of basic principles that could guide our decisions—both the personal ones about what to buy and how to spend but also those national ones that have been capturing the headlines? Robert H. Frank, (a.k.a. the Economic Naturalist) has been illustrating those principles longer and more clearly than anyone else. In The Economic Naturalist’s Field Guide, he reveals how they play out in Washington, on Wall Street, and in our own lives, covering everything from tax policy to financial investment to everyday decisions about saving and spending. In today’s uncertain economic climate, The Economic Naturalist’s Field Guide’s insights have more bearing on our pocketbooks, policies, and personal happiness than ever.",
        "Category": " Psychology , Applied Psychology",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Europe Through the Back Door (Jmp Travel)",
        "Authors": "By Steves, Rick",
        "Description": "A refreshing guide to (highly) independent travel in Europe \"and beyond\" Morocco, Turkey, Egypt. We regret that over half the book explains phones, trains, toilets; only some 140 pages describe places. We regret nothing else a charming and practical book. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "John Muir Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Wine Spectator's: California Wine",
        "Authors": "By Laube, James",
        "Description": "The second edition of the most extensive book of California wine reviews ever published. Wine Spectator's California Wine is a definitive guide featuring descriptions and ratings for 5,000 individual California wines -- from widely available bargains to collectible rarities. Includes new tasting notes and in-depth profiles for more than 700 California wineries, along with starred ratings and details on history, vineyards, and specialties. Written by noted California wine expert and Wine Spectator senior editor James Laube.",
        "Category": " Cooking , Regional & Ethnic , American , California Style",
        "Publisher": "Running Press",
        "Price Starting With ($)": "6.86",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Angel Visions II: More True Stories of People Who Have Had Contact With Angels, and How You Can, Too!",
        "Authors": "By Virtue, Doreen (EDT)",
        "Description": "",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Hay House Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Envision: Writing and Researching Arguments (2nd Edition)",
        "Authors": "By Alfano, Christine L. and O'Brien, Alyssa J.",
        "Description": "A concise and practical guide, Envision teaches core skills in analysis, argument, and research, using both contemporary examples to capture reader interest and key principles from classical rhetoric.",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Longman",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Internet Riches: The Simple Money-making Secrets of Online Millionaires",
        "Authors": "By Fox, Scott C.",
        "Description": "In this strategy-packed guide, top e-business consultant Scott Fox reveals the powerful but simple methods for striking it rich on the Net. Exclusive interviews with dozens of “mom and pop” entrepreneurs prove how easy it is to get started and build a million-dollar enterprise. Readers get: • an inspiring guide to e-business opportunities, including “instant e-businesses” that require no start-up capital or technical training • proven strategies for making money from home and turning hobbies into businesses • low-cost web marketing and product tips • legal and financial advice • detailed vendor recommendations • years of expertise and experience in one easy-to-use book Internet Riches also offers an innovative action plan for brainstorming new business ideas, and fun exercises to help readers determine the best moves for their particular situations. Filled with practical pointers and motivational interviews, it's the most powerful guide ever to finding financial freedom online!",
        "Category": " Business & Economics , E-Commerce , General",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Cross Creek Cookery",
        "Authors": "By Rawlings, Marjorie Kinnan.",
        "Description": "",
        "Category": "",
        "Publisher": "Charles Scribner's Sons",
        "Price Starting With ($)": "59.55",
        "Publish Date": {
            "Month": "January",
            "Year": "1942"
        }
    },
    {
        "Title": "Triplet Trouble and the Field Day Disaster",
        "Authors": "By Speirs, John (ILT), Dadey, Debbie, and Jones, Marcia Thornton",
        "Description": "Looking forward to Field Day and its many fun-filled competitions, Adam, Alex, and Ashley spar over who among them is the best athlete, and Sam realizes that when the Tucker Triplets fight, everyone is in for trouble. Original.",
        "Category": "",
        "Publisher": "Little Apple",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Geraniums and pelargoniums (Success with)",
        "Authors": "By Riedmiller, A",
        "Description": "",
        "Category": "",
        "Publisher": "Landoll, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Explore: Stories of Survival from Off the Map (Adrenaline)",
        "Authors": "By Willis, Clint (EDT) and Willis, Jennifer Schwamm (EDT)",
        "Description": "Explore: Stories of Survival from Off the Map offers first-hand accounts by the world's boldest explorers, who have encountered storms, starvation, canibals, predators, and disease in their pursuit of mystery and adventure. Nunez Cabeza de Vaca writes of his 16th century expedition to the region north of the Gulf of Mexico, an amazing tale of survival and hardship that begins with the loss of de Vaca's ships and the capture and enslavement of his party by Indians. Argentinian novelist Abel Posse gives us an unforgettable Christopher Columbus facing down mutiny and the threat of starvation Tim Flannery almost dies while searching for Fulmer's Fruit Bat, thought to have become extinct 12,000 years ago. Thor Heyderdahl recounts his earliest adventure in Polynesia. Premier mountaineering and adventure writer David Roberts searches for a legendary lost city high in the cliffs of New Mexico. Following an ancient trail, Roberts discovers a beautifully preserved Anasazi city — and a curse. Explore also includes writing by Lawrence Millman, Gene Savay, John Long, Redmond O'Hanlon, Fanny Bullock Workman and William Hunter Workman, Andrea Barrett, and W.H. Murray.",
        "Category": " Sports & Recreation , Horse Racing",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Brand Name Calorie Counter",
        "Authors": "By Netzer, Corinne T.",
        "Description": "Lists calories for breakfast foods, yogurt, cheese, fruit, vegetables, meat, pasta, sauces, puddings, desserts and fast foods",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "It Only Takes a Minute to Change Your Life!",
        "Authors": "By Willie Jolley",
        "Description": "",
        "Category": "",
        "Publisher": "Jolley Publishing and Providence Publishing",
        "Price Starting With ($)": "15.41",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Jet Smart",
        "Authors": "By Diana Fairechild",
        "Description": "",
        "Category": "",
        "Publisher": "Flyana Rhyme",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Beginning Mindfulness: Learning the Way of Awareness",
        "Authors": "By Weiss, Andrew",
        "Description": "A Simple Manual That Really WorksKnowing that most people do not stop their lives to engage in spiritual practice, Buddhist teacher Andrew Weiss has always taught the direct application of practice to daily life. While also teaching sitting and walking meditation, he emphasizes mindfulness ? the practice of seeing every action as an opportunity to awaken meditative inquiry. Over the years, Andrew has honed his teachings into an effective ten-week course with progressive steps and home-play assignments. Beginning Mindfulness is intended for anyone practicing in daily life without the luxury of long meditation retreats. Weiss skillfully blends the traditions of his teachers into an easy and humorous program of learning the Buddhist art of mindfulness.",
        "Category": " Philosophy , Eastern",
        "Publisher": "New World Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Don't Kill in Our Names: Families of Murder Victims Speak Out against the Death Penalty",
        "Authors": "By King, Rachel",
        "Description": "Could you forgive the murderer of your husband? Your mother? Your son?Families of murder victims are often ardent and very public supporters of the death penalty. But the people whose stories appear in this book have chosen instead to forgive their loved ones’ murderers, and many have developed personal relationships with the killers and have even worked to save their lives. They have formed a nationwide group, Murder Victims’ Families for Reconciliation (MVFR), to oppose the death penalty.MVFR members are often treated as either saints or lunatics, but the truth is that they are neither. They are ordinary people who have responded to an extraordinary and devastating tragedy with courage and faith, choosing reconciliation over retribution, healing over hatred. Believing that the death penalty is a form of social violence that only repeats and perpetuates the violence that claimed their loved one’s lives, they hold out the hope of redemption even for those who have committed the most hideous crimes.Weaving third-person narrative with wrenching first-hand accounts, King presents the stories of ten MVFR members. Each is a heartrending tale of grief, soul searching, and of the challenge to choose forgiveness instead of revenge. These stories, which King sets in the context of the national discussion over the death penalty debate and restorative versus retributive justice, will appeal not only to those who oppose the death penalty, but also to those who strive to understand how people can forgive the seemingly unforgivable.",
        "Category": " Social Science , Criminology",
        "Publisher": "Rutgers University Press",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Stop Global Warming: The Solution Is You! (Speaker's Corner)",
        "Authors": "By David, Laurie",
        "Description": "Global warming has become the most important issue for the future of our planet, dominating news headlines and policy discussions. Stop Global Warming turns headlines into action, providing testimony of leading environmental activist Laurie David's own passionate work and showing how and why others (particularly young people) should get involved in this and other environmental issues.  In accessible and inspiring prose, David explains that Global warming is not an opinion but a scientific reality, one that policy makers by and large have failed to address. Interspersed throughout the text, short statements by celebrities such as John Mayer, Jack Johnson, and average Americans will reinforce why halting global warming is so important to our future. An important book that will cause you to think more about our planet and change your habits, Stop Global Warming is required reading for the 21st century.",
        "Category": " Political Science , Public Policy , Environmental Policy",
        "Publisher": "Fulcrum Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "What's Up, Duck?: A Book of Opposites (Duck & Goose)",
        "Authors": "By Hills, Tad and Hills, Tad (ILT)",
        "Description": "A quacktastic springtime read! The stars of the bestselling Duck & Goose and Duck, Duck, Goose return in this board book for preschoolers, this time, to introduce basic opposites.In this ALA-ALSC Notable Children's Book, Goose carries an oh-so-heavy log, while duck easily  balances a light-as-a-feather feather. Thistle is one fast bird, but Goose is slooo-w.  And when Duck is sound asleep, Goose is wide awake. With a simple text and colorful  illustrations–plus the inimitable characters, of course–here’s a wonderful, and humorous,  introduction to an important concept.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Random House Studio",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Seedling Bible: Sixteen Favorite Bible Stories for Toddlers (Seedlings)",
        "Authors": "By De Villiers Family (EDT)",
        "Description": "A Bible Storybook That Nurtures Young Faith  The early years are the ideal time to  introduce children to the stories and concepts that will shape their faith for years  to come. Through simple rhymes and contemporary illustrations, this unique Bible  storybook brings to life sixteen stories about Creation, Noah, the boy-hero David,  the birth of Jesus, the first Easter, and more. Interactive questions accompany each  story to help you engage your child’s heart and mind in the truths of God’s Word.  And appearing throughout each story, Seedling embodies the wonder-filled, energy-packed  early years of life, providing a delightful friend with whom your child will immediately  connect.  A captivating introduction to God and his love, Seedling Bible stimulates  a child’s sense of wonder and nurtures young faith, laying the foundation for a lifetime  of spiritual growth.",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "WaterBrook Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Book of Saints (Part 1): Super-Heroes of God",
        "Authors": "By Lovasik, Lawrence",
        "Description": "",
        "Category": " Religion , Christianity , Saints & Sainthood",
        "Publisher": "Catholic Book Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Top Ten Uses for an Unworn Prom Dress",
        "Authors": "By Ferraro, Tina",
        "Description": "Sophomore year, Nicolette Antonovich was dumped two days before prom by the hottest guy at school. As a result, she became the proud owner of one unworn, perfectly magical pink vintage dress. But Nic is determined to put that night behind her for good. She's a junior now— older, wiser, and completely overwhelmed by a new set of problems: (1) The bank's ready to foreclose on her childhood home. (2) Her father's too busy with his \"replacement\" daughter to care. (3) Her best friend's brother is an eternal thorn in her side. (4) Her best friend isn't exactly the rose attached to that thorn. (5) Rumors are flying around school that could get her kicked off the volleyball team, which would (6) ruin all chances of a college scholarship. (7) She still likes the boy who dumped her in the first place. (8) And what in the world do you do with an unworn prom dress, anyway? Strangely, it's getting to the bottom of this last dilemma that just might hold the answer to all Nic's problems.",
        "Category": " Young Adult Fiction , Family , General",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "The Stranger (The Labyrinths of Echo, Book 1)",
        "Authors": "By Frei, Max and Gannon, Polly (TRN)",
        "Description": "The millions-selling fantasy epic of the new Russian literary icon-a freeloading freebooter who finds a new home in a magical worldMax Frei's novels have been a literary sensation in Russia since their debut in 1996, and have swept the fantasy world over. Presented here in English for the first time,The Stranger will strike a chord with readers of all stripes. Part fantasy, part horror, part philosophy, part dark comedy, the writing is united by a sharp wit and a web of clues that will open up the imagination of every reader.Max Frei was a twenty-something loser-a big sleeper (that is, during the day; at night he can't sleep a wink), a hardened smoker, and an uncomplicated glutton and loafer. But then he got lucky. He contacts a parallel world in his dreams, where magic is a daily practice. Once a social outcast, he's now known in his new world as the \"unequalled Sir Max.\" He's a member of the Department of Absolute Order, formed by a species of enchanted secret agents; his job is to solve cases more extravagant and unreal than one could imagine-a journey that will take Max down the winding paths of this strange and unhinged universe.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Overlook Hardcover",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Oh My, Pumpkin Pie! (Step into Reading, Step 2)",
        "Authors": "By Ghigna, Charles and Spengler, Kenneth (ILT)",
        "Description": "Simple rhymes and bright illustrations provide beginning readers with an amusing tale about a fun-filled day of pumpkin picking at the local pumpkin patch on a beautiful autumn afternoon with family and friends. Simultaneous.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "White Protestant Nation: The Rise of the American Conservative Movement",
        "Authors": "By Lichtman, Allan J.",
        "Description": "Spanning nearly one hundred years of American political history, and abounding with outsize characters--from Lindbergh to Goldwater to Gingrich to Abramoff-- White Protestant Nation  offers a penetrating look at the origins, evolution, and triumph (at times) of modern conservatism. Lichtman is both a professor of political history at American University and a veteran journalist, and after ten years of prodigious research, he has produced what may be the definitive history of the modern conservative movement in America. He brings to life a gallery of dynamic right-wing personalities, from luminaries such as Strom Thurmond, Phyllis Schlafly, and Bill Kristol to indispensable inside operators like financiers Frank Gannett and J. Howard Pew. He explodes the conventional wisdom that modern conservative politics began with Goldwater and instead traces the roots of today’s movement to the 1920s. And he lays bare the tactics that conservatives have used for generations to put their slant on policy and culture; to choke the growth of the liberal state; and to build the most powerful media, fundraising, and intellectual network in the history of representative government.  White Protestant Nation  is entertaining, provocative, enlightening, and essential reading for anyone who cares about modern American politics and its history.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Atlantic Monthly Press",
        "Price Starting With ($)": "6.35",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Last Two Weeks of Georges Rivac",
        "Authors": "By Household, Geoffrey",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "18.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Profile of Deception",
        "Authors": "By Kincaid, Cliff and Irving, Reed",
        "Description": "",
        "Category": "",
        "Publisher": "Book Distributors",
        "Price Starting With ($)": "5.87",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Richer than all his tribe",
        "Authors": "By Monsarrat, Nicholas",
        "Description": "",
        "Category": "",
        "Publisher": "Morrow",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Usagi Yojimbo, Book 1: The Ronin",
        "Authors": "By Sakai, Stan",
        "Description": "With over fifty graphic novels in print, the samurai rabbit is more popular than ever! This is the seminal Usagi book collecting all the classic original Usagi stories from Albedo, Critters, Doomsday Squad, and the Usagi Yojimbo Summer Special. This is one of Fantagraphics' very best sellers, and is also where Usagi started—don't miss out! The setting is 17th century Japan, when the age of civil wars has barely ended and the Shogun has established power. The samurai is the ruling class throughout the land, following a warrior's code of honor known as Bushido. Usagi Yojimbo Vol. 1 chronicles this time of settling unrest and political intrigue, told through the story of a wandering and masterless samurai named Miyamoto Usagi, aka Usagi Yojimbo! One of the great classics of the last 20 years, perfect for all ages.",
        "Category": " Juvenile Fiction , Historical , Asia",
        "Publisher": "Fantagraphics",
        "Price Starting With ($)": "55.37",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Perfect Buzz, The",
        "Authors": "By Bramwell, David",
        "Description": "The Perfect Buzz is guaranteed to make you the life and soul of any bar or party -- from mixology and the delicate art of scoring to drinking games and bar etiquette. Anyone can sip a beer or down a shot, but The Perfect Buzz teaches the subtle art of drinking, with tips, tricks, and trivia that will liven up any night out, including:Knowing what to order from whiskey to organic beersOrdering a beer in twenty-five languages, so you can quench your thirst anytime, anywhereImproving your dating technique with dozens of pickup lines way cooler than \"You come here often?\"Rules for pool, darts, and Foosball so you can hold your own in any challengeTons of bar tricks and drinking games that will keep you entertained for hours.Order another -- the night is young.",
        "Category": " Humor , General",
        "Publisher": "WilliamMr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Calm at Work: Breeze Through Your Day Feeling Calm, Relaxed and In Control",
        "Authors": "By Wilson, Paul",
        "Description": "Are you feeling pressured by the daily grind? Are tension and worry getting you down? Whether you're a trainee or a CEO, a bored part-timer or a burned-out workaholic, Paul Wilson, author of the international bestseller The Little Book of Calm, offers simple, straightforward techniques for overcoming stress on the job and making your life a more tranquil place. You'll get through the workday feeling relaxed, positive, and fulfilled. So take a deep breath and discover:* How to use visualization and affirmation to overcome anxiety* How to control time, depressurize deadlines, and end procrastination* The best ways to handle superiors and co-workers* How to remain calm in a crisis--and who you can turn to for help* Calm-inducing programs for leaders, managers, and junior executives* The six steps to lasting calmWilson also includes deep-breathing routines and simple exercises for instant relief from tension, stress, and anxiety. The next time work-place anxiety rises and you need relief, New Woman puts it best--\"plenty of new-age gurus claim they have the answers to a stress-free life...but when the word comes from a 45-year-old businessman who hustles each day in the tension-packed business world, the advice somehow has more credibility.\"",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "THE PRITCHETT CENTURY (Modern Library Classics)",
        "Authors": "By Pritchett, V. S. (FRW)",
        "Description": "\"If, as they say, I am a Man of Letters, I come, like my fellows, at the tail-end of a long and once esteemed tradition in English and American writing. We have no captive audience. We do not teach. We write to be readable and to engage the interest of what Virginia Woolf called 'the common reader.'\"In a life that spanned almost the entire course of the twentieth century—he was born in 1900 and died in 1997—Sir Victor Pritchett mastered nearly every form of literature: the novel, short fiction, travel writing, biography, criticism, and memoir. Now, Sir Victor's son Oliver has selected representative samples to illustrate the tremendous scope of his father's brilliance. Included in this volume are sections of Pritchett's memoirs, A Cab at the Door and Midnight Oil; his reflections on turning eighty; and an account of a visit to the Appalachians written in 1925. There are also portraits of Dublin, New York, the Amazon, and Spain; selections from the novels Dead Man Leading and Mr. Beluncle; thirteen complete short stories; excerpts from biographies of Turgenev and Chekhov; and critical pieces on Twain, Scott, Dickens, Eliot, Henry James, Tolstoy, Saul Bellow, Salman Rushdie, and others.\"Pritchett has lived as a man of letters must, by his pen, and he has done it with a freshness of interest and an infectious curiosity that have never waned,\" observed novelist Margaret Drabble. Taken together with Oliver Pritchett's appreciation of his father, and John Bayley's \"In Memoriam,\" The Pritchett Century stands as the most comprehensive collection of Sir Victor's work available in one volume.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Random House Publishing Group",
        "Price Starting With ($)": "6.22",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "1,000 Common Delusions: And the Real Facts Behind Them",
        "Authors": "By Poppelmann, Christa",
        "Description": "The real truths behind what we think we know.    Certain \"facts\" are accepted as absolute truths. But are they indeed so? 1,000 Common Delusions debunks these persistent myths. From the stories of the ancient world to religion and sports, here are the real facts about common fallacies that have long been assumed to be true. Organized by theme -- history and politics, natural sciences and technology, society and everyday life, Earth and the universe, and others -- here are some examples:  Delusion. Stone Age humans lived in caves. Truth. They lived in huts and tents. The caves, decorated with hunting scenes and animal pictures, were used for ritual ceremonies.  Delusion. Geishas are always female. Truth. They are professional entertainers, and the first ones were exclusively            male.  Delusion. Marie-Antoinette told her subjects to eat cake. Truth. When Marie-Antoinette was still a child, a fictional princess in a story said, \"If they have no bread, let them eat brioches.\" Later this was attributed to Marie-Antoinette.  Delusion. A frightened ostrich will bury its head in the sand. Truth. An ostrich lays its head on the ground to detect vibrations. If its young are threatened, however, it will play dead and draw in its neck.  Delusion. The Hundred Years War lasted 100 years. Truth. The clash between France and England actually lasted 114 years, from 1339 till 1453.  Delusion. Bagpipes were invented in Scotland. Truth. They were introduced into the British Isles by Caesar's legionnaires and originated in Asia             Minor.    The myth-shattering truths in this intriguing book will shock, surprise and amuse readers. Fully indexed, it is a welcome resource -- and sure to be the final arbiter in many disagreements.",
        "Category": " Reference , Trivia",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Corporate Canaries: Avoid Business Disasters With a Coal Miner's Secrets",
        "Authors": "By Sutton, Gary",
        "Description": "When your business hits trouble, can you recognize the warning signs?A century ago, coal miners brought canaries into the mines for danger warnings. At the first hint of poisonous methane gas, the little birds stopped chirping . . . and many miners were saved.Your business faces invisible threats too. With equal doses of insight from Gary Sutton's experience as a hands-on, corporate turnaround CEO, and wisdom from his coal miner grandfather, this delightful volume helps you recognize trouble-before it's too late. In Corporate Canaries, Sutton reveals the five \"canary warnings\" that are a sure sign of trouble.Sutton's successes are measured not in millions but in billions of dollars. He's breathed life into many flatlining organizations. The secret, he reveals, is recognizing the warning signs-and recognizing themearly! Once you empower everyone in your organization to become a \"canary watcher,\" the success can be limitless.With the wit of a storyteller and the credibility of a Wall Street hero, Gary Sutton spins that rare breed of business book: the kind you won't want to put down.",
        "Category": " Business & Economics , Management",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Selling Ourselves Short: Why We Struggle to Earn a Living and Have a Life",
        "Authors": "By Wallace, Catherine M.",
        "Description": "Explaining how a tendency toward competition and the acquisition of material wealth is compromising human relationships, a cultural study challenges readers to embrace moral responsibility, compassion, and prayerful discernment.",
        "Category": " Social Science , LGBT Studies , Gay Studies",
        "Publisher": "Brazos Press",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Adolescent behavior and society: A book of readings",
        "Authors": "By Muuss, Rolf Eduard Helmut",
        "Description": "Such contemporary topics as alienation, drug abuse, political activism, and sex-role stereotypes are discussed as well as areas of traditional concern in adolescent development. Bibliogs",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Death Echo (St. Kilda Consulting)",
        "Authors": "By Lowell, Elizabeth",
        "Description": "“Elizabeth Lowell has long set a standard of excellence for thrillers that never stint on either romance or suspense.”—BookPage New York Times bestselling author Elizabeth Lowell cuts a razor-sharp new edge in romantic suspense with Death Echo, a thrilling tale of passion, danger, and international intrigue. A breakneck-paced novel that unites a beautiful former CIA agent with a tough and haunted ex-Special Forces operative, Death Echo is a top-rank thriller in the vein of Iris Johansen, Tami Hoag, and Lisa Gardner—and a dazzling example of the superior storytelling that inspired author Jayne Ann Krentz to declare, “I’ll buy anything with Elizabeth Lowell’s name on it.”",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Presidential Judgment : Foreign Policy Decision Making in the White House",
        "Authors": "By Lobel, Aaron (EDT), Bowie, Robert R. (CON), Sorensen, Theodore (CON), Bator, Francis (CON), Ford, Gerald R. (CON), Kirkpatrick, Jeane (CON), and Scowcroft, Brent (CON)",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Hollis Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Havemercy",
        "Authors": "By Jones, Jaida and Bennett, Danielle",
        "Description": "This stunning epic fantasy debut introduces two exciting new authors—and a world brimming with natural and man-made wonders, extraordinary events, and a crisis that will test the mettle of men, the boundaries of magic, and the heart and soul of a kingdom.Thanks to its elite Dragon Corps, the capital city of Volstov has all but won the hundred years’ war with its neighboring enemy, the Ke-Han. The renegade airmen who fly the corps’s mechanical, magic-fueled dragons are Volstov’s greatest weapon. But now one of its more unruly members is at the center of the city’s rumor mill, causing a distraction that may turn the tide of victory. With Volstov immersed in a scandal that may have international repercussions, the Ke-Han devise an ingenious plan of attack. To counter the threat, four ill-assorted heroes must converge to save the kingdom they love: an exiled magician, a naive country boy, a young student—and the unpredictable ace airman who flies the city’s fiercest dragon, Havemercy. But on the eve of battle, these courageous men will face something that could make the most formidable of warriors hesitate, the most powerful of magicians weak, and the most unlikely of men allies in their quest to rise against it....Filled with adventure and discovery, treachery and betrayal, Havemercy is a thrill ride to the unexpected—and an unforgettable journey that will linger long after the fire of battle has cleared",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Spectra",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Picking Up the Reins",
        "Authors": "By Moss, Norman",
        "Description": "An eloquent and enlightening account of America's postwar assumption of powerFollowing the devastation of the Second World War and the realization that the damage to Europe was irreparable, the balance of world power shifted across the Atlantic from the old powers of Europe to the extremely visible power of the United States. Historian and journalist Norman Moss looks at this transfer of global rule from the point of view of the changing \"special relationship\" of the U.S. and Britain, with the U.S. taking on something like the imperial role that Britain had previously held. Although some had predicted this transfer of roles, few were ready for it whenit happened.At a time when America's diplomatic role in the world is coming increasingly under scrutiny,Picking Up the Reins looks at the U.S.'s assumption and acceptance of the role of superpower, and its evolution from being an opponent of the concept of empire, to a defender and ultimately an inheritor of the imperial role.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "The Overlook Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "The Islamic Threat: Myth or Reality?",
        "Authors": "By Esposito, John L.",
        "Description": "Are Islam and the West on an inevitable collision course?  Are Islamic fundamentalists medieval fanatics--a threat to stability in the Muslim world and to American interests in the region?  Does a clash of world views loom on the horizon?  From the Ayatollah Khomeini to Saddam Hussein, the image of Islam as a militant, expansionist, and rabidly anti-American religion has gripped the minds of Western governments and the media.  But these questions and perceptions, John Esposito writes, stem from a long history of mutual distrust, criticism, and condemnation--and they are far too simplistic to help us understand one of the most important issues of our times.     In The Islamic Threat, Esposito places the challenge of Islam in critical perspective, exploring the vitality of Islam as a global force and the history of its relations with the western world.  He offers a systematic assessment of Islamic politics in several key nations (including Iran, Libya, Lebanon, Egypt, Sudan, Tunisia, and Algeria) and in particular Islamic movements (from moderates to radicals), demonstrating the diversity of the Islamic resurgence--and the mistakes western analysts make in assuming a hostile, monolithic Islam.  Esposito examines the potential challenge or threat of Islam in light of the Rushdie affair, the Gulf War of 1990-91, the New World Order, and the pressure for democratization in the Muslim world.  He goes on to explore the issues facing Islam and the West in the 1990s, such as pluralism, human rights, the status of women and minorities in the context of Islamic revivalism.     John Esposito is one of the foremost authorities on the Islamic world, widely acclaimed in both Muslim nations and the West.  His most recent work, Islam: The Straight Path, was praised as \"lucid and comprehensive\" (Washington Post Book World) and \"probably the best one-volume introduction\" (Voice Literary Supplement).  In this incisive and important new study, he throws fresh light on one of the most critical issues in world politics today.",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "National Geographic Field Guide to the Birds of North America : Revised and Updated",
        "Authors": "By Dunn, John",
        "Description": "A completely revised and updated new edition of the popular birding handbook provides identification tips, full-color artwork, location maps, information on behavior and nesting, and other valuable facts about more than eight hundred North American birds. Original. 100,000 first printing.",
        "Category": " Nature , Birdwatching Guides",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "A Wedding is a Family Affair",
        "Authors": "By Hunter, Brenda and Blair, Kristen",
        "Description": "For Ingest Only - Data needs to be cleaned up for all products being loaded",
        "Category": " Social Science , General",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Poker Bride: The First Chinese in the Wild West",
        "Authors": "By Corbett, Christopher",
        "Description": "When gold rush fever gripped the globe in 1849, thousands of Chinese immigrants came through San Francisco seeking fortune. InThe Poker Bride, Christopher Corbett uses a little-known Idaho legend as a lens into this Chinese experience. Before 1849, the Chinese in the United States were little more than curiosities. But as word spread of the discovery of gold, they soon became a regular sight in the American West. In San Francisco, a labyrinthine Chinatown arose where Chinese smuggled into the country were deposited. Polly, a young Chinese concubine, accompanied her owner to a mining camp in the highlands of Idaho. After he lost her in a poker game, Polly found her way with her new owner to an isolated ranch on the banks of the Salmon River. As the gold rush receded, it took with it the Chinese miners, but left behind Polly, who would make headlines when she emerged from the Idaho hills nearly half a century later to visit a modern city and tell her story. The Poker Bride vividly reconstructs a lost period of history when the first Chinese sojourners flooded into the country and left only glimmering traces of their presence scattered across the American West.",
        "Category": " Social Science , Ethnic Studies , Asian American Studies",
        "Publisher": "Atlantic Monthly Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "12 Simple Secrets Real Moms Know: Getting Back to Basics and Raising Happy Kids",
        "Authors": "By Borba, Michele D.",
        "Description": "Best-selling parenting guru Michele Borba, the mother of three, has surveyed 5,000 mothers for their experience and wisdom in raising happier, more confident kids by returning to a more natural, authentic kind of mothering. She shares 12 top secrets of successful moms culled from her research and shows how to apply them to your family.You’ll learn how to…Apply the 12 essential principles that child experts and 5,000 parents say matter most in good motheringRaise children with confidence, resilience, and characterCreate a customized mothering plan and use it so it leads to success with your childCut the guilt and reduce the stress by sticking to what really counts in parenting good kids todayDiscover simple ways to make big differences in your family’s life",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Easier Said",
        "Authors": "By Battle, LeRoy A.",
        "Description": "",
        "Category": "",
        "Publisher": "Annapolis Publishing Company",
        "Price Starting With ($)": "13.21",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "One, The: A Field Guide to Relationships That Last",
        "Authors": "By Harley, Willard F., Jr.",
        "Description": "Here today or here to stay? Find out how to stop the pattern of failed relationships and find someone who will commit to a lifetime of love.",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Revell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Sams Teach Yourself C++ in 10 Minutes",
        "Authors": "By Liberty, Jesse",
        "Description": "C++ remains a popular object-oriented language and Sams Teach Yourself C++ in 10 Minutes provides a quick, focused way to learn the language.  The author assumes no prior programming experience and begins by showing the reader the absolute fundamentals of what a program is and guides the readers to write their very first program.  It covers all the important topics in C++ and provides a sold foundation on which to build programming knowledge.  The material is reorganized to fit proven teaching techniques with about thirty percent of the text rewritten.  All examples are new to comply with the current ANSI C++ standard and make them completely compatible with all popular compilers.",
        "Category": " Computers , Programming Languages , C++",
        "Publisher": "Sams Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The 19th Hole: Favorite Golf Stories",
        "Authors": "By Mann, Carol",
        "Description": "More than seventy-five celebrities, from Jack Lemmon to Gerald Ford, to Deborah Norville, contribute original stories of their greatest successes and most embarrassing moments on the links",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Longmeadow Pr",
        "Price Starting With ($)": "11.98",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Tainted Love: A Nannies Novel",
        "Authors": "By Mayer, Melody",
        "Description": "Smart girls.Things are heating up between Kiley and Jorge . . . but the fire isn't out between her and Tom either. Tom's used to hanging out with gorgeous models—how can a girl from Wisconsin compete with that? The only way to cool off is at scuba class, except Kiley keeps having panic attacks. Is it because of the ocean—or her Bermuda love triangle?Crazy boys.Getting drunk and hooking up with Luis was not smart. That's why Lydia's decided to pretend the whole fiasco never happened. Why ruin what she has with Billy over one stupid mistake? But Luis won't take no for an answer.Crazier girls.Life's pretty sweet right now for Esme. She and Jonathan are free to be together, her artist-to-the-stars tattoo biz is booming, and the Goldhagens just gave her a raise. So when Tarshea, the girl Esme vowed to help, arrives in L.A. and begins to steal her life, Esme's not about to let it happen.",
        "Category": " Young Adult Fiction , Careers, Occupations, Internships",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "The Spice of Variety",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1952"
        }
    },
    {
        "Title": "Country Living: Handmade Pillows - Decorative Accents Throughout Your Home",
        "Authors": "By Arlene Hamilton Stewart",
        "Description": "",
        "Category": "",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Privileges: A Novel (Random House Reader's Circle)",
        "Authors": "By Dee, Jonathan",
        "Description": "Smart and socially gifted, Adam and Cynthia Morey are perfect for each other. With Adam’s rising career in the world of private equity, a beautiful home in Manhattan, gorgeous children, and plenty of money, they are, by any reasonable standard, successful. But for the Moreys, their future of boundless privilege is not arriving fast enough. As Cynthia begins to drift, Adam is confronted with a choice that will test how much he is willing to risk to ensure his family’s happiness and to recapture the sense that the only acceptable life is one of infinite possibility. The Privileges is an odyssey of a couple touched by fortune, changed by time, and guided above all else by their epic love for each other.",
        "Category": " Fiction , Sagas",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "The Next Queen of Heaven: A Novel",
        "Authors": "By Maguire, Gregory",
        "Description": "“A delight….[A] funny and warmhearted exploration of the sacred and the profane.”—Washington Post“Reading The Next Queen of Heaven is like hanging on to the back of an out-of-control carnival ride—terrifying, thrilling, a once-in-a-lifetime adventure.”—Ann Patchett New York Times bestseller Gregory Maguire—who re-imagined the land of Oz and all its fabled inhabitants in his monumental series, The Wicked Years—brings us The Next Queen of Heaven, a wildly farcical and gloriously imaginative tall tale of faith, Catholic dogma, lust, and questionable miracles on the eve of Y2K. The very bizarre and hilarious goings on in the eccentric town of Thebes make for a delightfully mad reading experience—as The Next Queen of Heaven shows off the acclaimed author of Confessions of an Ugly Stepsister and Mirror Mirror in a brilliant new heavenly light.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Children's Atlas of the World",
        "Authors": "By Rand McNally and Company",
        "Description": "Maps and facts about the world's terrain, animals, populations, countries, and cities, continent by continent.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Rand McNally",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Maps and History: Constructing Images of the Past",
        "Authors": "By Black, Jeremy",
        "Description": "Historical atlases offer an understanding of the past that is invaluable to historians, not only because they convey a previous age's sense of space and distance but also because they reveal what historians and educators of those periods thought important to include or omit. This book?the first comprehensive and wide-ranging account of the historical atlas?explores the role, development, and nature of this important reference and discusses its impact on the presentation of the past.Jeremy Black begins with a consideration of the \"pre-history\" of the historical atlas: individual maps depicting the Holy Land at the time of Christ and maps of the classical world. He then examines the first known historical atlas, the Parergon of Abraham Ortel, which was published in Antwerp in 1579 and was followed by other works that mapped the world of the Bible and the classics. In the eighteenth century, there was a growing interest in mapping the post-Classical world, and works appeared that included maps of medieval Europe. In the nineteenth century, historical maps came increasingly to embody a clear political emphasis, mapping blocs of territory separated by clear linear frontiers and reflecting an approach to the past focused on undivided sovereignty and the development of the nation-state.In the twentieth century, historical atlases have both contributed to and responded to other ideologies, portraying peoples, languages, and cultural differences in an immediate and often striking visual form. Since 1945 the range of atlases has broadened to include maps devoted to the global environment, health, population trends, and other sociological, cultural, and economic changes. And the \"liberation\" of the Third World and the ending of the Cold War have stimulated a full scale re-mapping of the globe and the way it is perceived.",
        "Category": " History , Historiography",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "6.32",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Gonzalez and Daughter Trucking Co.: A Road Novel with Literary License",
        "Authors": "By Escandon, Maria Amparo",
        "Description": "“A whimsical, humorous,  and passionate mystery that explores the love and hurt of a father and  daughter on the run.” —Jorge Ramos, News Anchor for Univision and  Bestselling AuthorWhile serving a sentence in a Mexican prison, Libertad González passes the time at the weekly Library Club, reading to her fellow inmates from whatever   books she can find in the prison’s meager supply. With her stories, Libertad enthralls a group of female prisoners every   bit as eccentric as the tales she tells. But the story that emerges   has nothing to do with the words printed on the pages. Instead, she tells the story of Joaquín González, a former   professor and fugitive of the Mexican government who reinvents himself as a trucker   in the United States. There he falls in love with a wild woman with whom he shares   his truck and his life, until he unexpectedly finds himself   alone on the road with a baby girl.   Joaquín and his daughter make the cab of an 18-wheeler their home, sharing everything—adventures,   books, truck-stop chow, and memories of the girl’s mother—until the girl   grows into a woman, and a chance encounter with one man causes her to rebel against   another.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Mr. Fooster Traveling on a Whim",
        "Authors": "By Corwin, Tom and Frazier, Craig (ILT)",
        "Description": "Mr. Fooster seems like your average fellow, albeit one who travels with an old bottle of bubble soap. One Tuesday morning, however, he takes us into a rich and vivid world unlike any we've seen before—a world where questioning your assumptions can set you free. Heading out the door with no particular place to go, Mr. Fooster is led by his boundless curiosity to reflect on questions like why is it you never see baby pigeons, and who figured out how to eat artichokes? Mr. Fooster shows us that pondering the little things in life can be a reward unto itself.The pairing of Tom Corwin's lyrical prose and Craig Frazier's enchanting illustrations create a world where believing is seeing. MR. FOOSTER TRAVELING ON A WHIM is the perfect gift book for anyone looking to escape the rigid confines of reality. Take a vacation you’ll never forget and explore a realm of wonders and possibilities with Mr. Fooster.",
        "Category": " Comics & Graphic Novels , General",
        "Publisher": "Flying Dolphin Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Family Affairs (Secrets of My Hollywood Life, 3)",
        "Authors": "By Calonita, Jen",
        "Description": "The filming for sure-to-be-blockbuster movie Pretty Young Assassins has wrapped, and teen movie star Kaitlin Burke returns to life on the set of primetime drama Family Affair. After ten seasons filming, she would have thought that she could see it all coming, but with a plotting new actress on set, all bets are off. The new diva, Alexis, makes even Sky seem like a puppy in comparison. Can Kaitlin keep her sane boyfriend, her insane job, and her composure in the face of this new star power?",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Poppy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "The Bookaholics' Guide to Book Blogs: the new literary force",
        "Authors": "By Gillieron, Rebecca (COM) and Kilgarriff, Catheryn (COM)",
        "Description": "As more and more bloggers write about books and with some of their Web sites receiving thousands of hits a day, this is an easy-to-follow guide to the top, book-related blogs.With the current craze for blogs, the phenomenon of book blogging is of interest from an objective standpoint as well as to those keen to read book reviews. How much influence do these bloggers have? Is there any kind of censorship or quality control? Are booksellers aware of them? Does Oprah Winfrey take note?Many people develop a real fondness for book bloggers who write reviews for love and not money. Taking in small, quirky Web sites like Book Slut, dovegreyreader, Bluestalking Reader, and MoorishGirl as well as large, well-known sites like salon.com, this book will show readers how to investigate literature from distant lands, to find the sites of authors who are yet to be discovered by the mainstream, and to find the pages of book industry pundits who have opened their daily lives to a wider world. Welcome to the honest world of book blogs. Catheryn Kilgarriff and Rebecca Gillieron are editors at Marion Boyars Publishers, and Meryl Zegarek is a book publicist of many years standing. All three have seen the book industry from the inside and are happy that blogs are now opening this world up to ordinary readers.",
        "Category": " Literary Collections , Essays",
        "Publisher": "Marion Boyars Publishers Ltd",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Ancient Maya Civilization",
        "Authors": "By Hammond, Norman",
        "Description": ".",
        "Category": "",
        "Publisher": "Rutgers University Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "Science Next: Innovation for the Common Good from the Center for American Progress",
        "Authors": "By Moreno, Jonathan D. (EDT) and Weiss, Rick (EDT)",
        "Description": "“As we turn the page on eight years of cynical science policy in the White House, Science Next is exactly the book we need, with more provocative ideas per ounce than any volume you are likely to read this year.”--Michael Pollan, author of In Defense of Food “Science Next addresses important topics in science policy in prose that is beautifully written, clear, and to the point.”--Marion Nestle, author of Food Politics and What to Eat   “Science Next illustrates the profound connections between science and many facets of our society.  I have enjoyed hop-scotching through the book and others who are concerned about the need for evidence-based policies in government and industry will too.”--Harold Varmus, Nobel Prize-winning author of The Art and Politics of Science “This elegant book lucidly covers an impressive amount of territory and sheds light on the current horizons of science.  It links science and innovation policy.  It bridges between the laboratory and the policy community. As such it will be invaluable to informed citizens, scientists and policy makers alike.”--John Kao, author of Innovation Nation Emerging from the Bush era when right-wing ideology frequently trumped mainstream science in government, America needs bold new approaches to the most important issues of our time, such as global warming, stem cell research, national security, and improving communication in the digital age. This is the informed citizen’s essential guide to science policy from the premier progressive think tank dedicated to improving the lives of Americans through ideas and action. With foreword by Elizabeth Edwards. Jonathan D. Moreno is editor-in-chief of the Center for American Progress’ online magazine, Science Progress, and a professor of bioethics at the University of Pennsylvania. Rick Weiss came to CAP from The Washington Post, where he was a science and medical reporter for fifteen years.",
        "Category": " Political Science , Public Policy , General",
        "Publisher": "Bellevue Literary Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "The Truth Behind Left Behind: A Biblical View of the End Times",
        "Authors": "By Hitchcock, Mark, Ice, Thomas, and LaHaye, Tim F. (INT)",
        "Description": "With the unparalleled worldwide success of the Left Behind series, both fans and critics are curious about the relationship between Bible prophecy and the events depicted in the novels. Responding to recent works that question Left Behind's biblical accuracy, two respected theologians set forth solid, biblical answers in this reader-friendly resource. Beginning with a clear presentation of prophecy interpretation and dispensationalism, the authors examine specific end times events represented in Left Behind and offer historical and biblical support for each event.Story Behind the BookWith the incredible success of this series, we believe that it would be beneficial to the body of Christ for someone to publish a book that gives solid, thoughtful, biblical answers to the critics of the Left Behind theology. With the questions that are being raised and will continue to be raised, many may begin to wonder if the Left Behind theology is really biblical. Some of the impact of the series could be undermined. This book would set forth substantive biblical points in favor of the various end times events presented in the series.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Medici: Story of a European Dynasty",
        "Authors": "By Cesati, Franco",
        "Description": "The Medici are pr4obably the best-known and most illustrious Italian family, one that produced two popes, two Queens of France and such a multi- faceted and extraordinary figure as Lorenzo the Magnificent. Their name is inextricably linked to the history of Florence. This concise and brilliant book recounts the history of this famous",
        "Category": " History , Europe , General",
        "Publisher": "Mandragora Srl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Another Summer: A Novel (Beach House)",
        "Authors": "By Bockoven, Georgia",
        "Description": "Georgia Bockoven’s enthralling Another Summer—the sequel to her phenomenal bestseller The Beach House—is a must for fans of Jodi Picoult and Marian Keyes.“Bockoven is magic. Don’t miss Another Summer.”  —New York Times bestselling author Catherine CoulterWeaving together love and laughter, heartache and hope, promise and passion, Another Summer returns to the world of The Beach House with new stories entwined in a powerful emotional journey.A twentieth high school reunion reunites lovers who must learn to trust again. Teenagers from opposite worlds discover that having a chip on their shoulder only makes it harder to get through doors. An ambitious corporate attorney finds herself falling for the man she has vowed to destroy in the courtroom. A young family, reeling from a devastating loss, meets a mysterious older couple and a half-starved stray cat that will guide them back to each other.None of these people will leave the beach house the same as they were before. . . .",
        "Category": " Fiction , Romance , Collections & Anthologies",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "The Kaleidoscope Book: A Spectrum of Spectacular Scopes to Make",
        "Authors": "By Boswell, Thom (EDT)",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Sterling Publishing Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "Shark and other sea creatures dictionary: An A to Z of sea life",
        "Authors": "By Twist, Clint",
        "Description": "",
        "Category": "",
        "Publisher": "Tangerine Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Prayer Powerpoints",
        "Authors": "By Roth, Randall D. (EDT)",
        "Description": "",
        "Category": " Religion , Biblical Meditations , General",
        "Publisher": "Victor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Cooking With Intuition",
        "Authors": "By Mansbridge, Fred",
        "Description": "Discusses the use of creative thought in cooking and provides recipes for a variety of appetizers, soups, sauces, main courses, vegetables, and desserts",
        "Category": " Cooking , General",
        "Publisher": "Acropolis Books Inc",
        "Price Starting With ($)": "5.87",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Solomon Snow and the Silver Spoon",
        "Authors": "By Nash, Scott (ILT) and Umansky, Kaye",
        "Description": "Prepare, dear reader, for the tale of Solomon Snow, his bossy friend Prudence, and the insufferable Infant Prodigy as they set out in search of Solly’s rightful inheritance — despite some woeful misadventures along the way!Solomon Snow lives in a run-down cottage just outside the village of Boring, works for Ma and Pa Scubbins's laundry business, and has nothing to eat but a gloppy stew known as pottage. It's a pitiful existence, but it's all Solly knows. Then, one day, a secret is revealed that changes his life forever—a secret that happens to involve a mysterious silver spoon. On his resulting quest, Solly is joined by a curious cast of characters: a sharp-minded girl named Prudence, a charming child called the Infant Prodigy, and a filthy (yet extremely cheerful) chimney sweep. Can Solly's new friends help him to reclaim his spoon—and his true identity?",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Sarkhan",
        "Authors": "By William J. Lederer, Eugene Burdick",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "365 Ways to a Smarter Preschooler",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Phoenix Intl Pubns Inc",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The Plumed Serpent",
        "Authors": "By Lawrence, D.H.",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1955"
        }
    },
    {
        "Title": "Lips That Touch Mine (Grayson Brothers, Book 3)",
        "Authors": "By Lindstrom, Wendy",
        "Description": "Determined to shut down the saloon across the street, boardinghouse owner Claire Ashier goes up against the owner, Boyd Grayson, with her revolver in hand, but she is not prepared for his irresistible charm and passionate kisses. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "The Simon & Schuster Pocket Book of Chess",
        "Authors": "By Keene, Raymond",
        "Description": "An International Chess Grandmaster describes the basic rules and moves of the game, how to avoid common errors and develop effective methods of attack and defense, and the strategis of some of the world's great champions",
        "Category": " Juvenile Nonfiction , Games & Activities , General",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Dogspeak : How to Learn It, Speak It, and Use It to Have a Happy, Healthy, Well-Behaved Dog",
        "Authors": "By Crenshaw, Mary Ann and Dibra, Bash",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Sugar Busters!: Cut Sugar to Trim Fat",
        "Authors": "By Bethea, Morrison C., Andrews, Sam S., Balart, Luis A., and Steward, H. Leighton",
        "Description": "",
        "Category": " Cooking , Health & Healing , Diabetic & Sugar-Free",
        "Publisher": "Sugar Busters Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "CliffsNotes Exploring the Internet with Yahoo! (Cliffsnotes Literature Guides)",
        "Authors": "By McCue, Camille",
        "Description": "There is a whole world of information at your fingertips, once you have Internet access. Yahoo! is a resource tool that makes organizing and working your way through the Internet an enjoyable, productive experience. Get online, become a \"Yahoo!\" and begin to enjoy the convenience of cyberspace!",
        "Category": " Computers , Web , General",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Triumph of the Meek: Why Early Christianity Succeeded",
        "Authors": "By Walsh, Michael J",
        "Description": "Uses the recent findings of archaeologists, historians, and Biblical scholars to explain the impact of Jesus's teachings and the rapid growth of the early Christian Church",
        "Category": " Religion , General",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Hey, That's Our Church!",
        "Authors": "By Schaller, Lyle E.",
        "Description": "",
        "Category": "",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Above the Tree Line (Carnegie Mellon Poetry Series)",
        "Authors": "By Mangan, Kathy",
        "Description": "The debut collection of poetry by Kathy Mangan.",
        "Category": " Poetry , American , General",
        "Publisher": "Carnegie Mellon University Press",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "A Look at Life from a Deer Stand",
        "Authors": "By Chapman, Steve",
        "Description": "Steve Chapman's popular A Look at Life from a Deer Stand (more than 280,000 copies sold) now includes new stories and illustrations as well as a stunning new cover.From the incredible rush of bagging \"the big one\" to standing in awe of God's magnificent creation, Steve Chapman captures the spirit of the hunt. In short chapters filled with excitement and humor, he takes readers on his successful--and not-so-successful--forays into the heart of deer country. As they experience the joy of scouting a trophy buck, they'll discover how the skills necessary for great hunting can help them draw closer to the Lord.This popular outdoor devotional focuses on time spent in the woods to offer unique insights into living for God. The perfect gift for every hunter and outdoorsman.",
        "Category": " Religion , Inspirational",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Casseroles Including Breads (Favorite Recipes of America)",
        "Authors": "By Mary Anne Richards",
        "Description": "",
        "Category": "",
        "Publisher": "Favorite Recipes Press",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Hemingway's a Farewell to Arms",
        "Authors": "By Hemingway, Ernest and Sexton, Adam",
        "Description": "The original CliffsNotes study guides offer a look into key elements and ideas within classic works of literature. The latest generation of titles in this series also features glossaries and visual elements that complement the familiar format.CliffsNotes on Farewell to Arms explores a potent and memorable love story set against the historical and geographical background of World War I.Following the growth of a rakish, indifferent soldier into a mature man capable of real love for the worldly-wise nurse who falls for him, this study guide provides summaries and critical commentaries for each chapter within the intense and descriptive novel.  Other features that help you figure out this important work includePersonal background on author Ernest Hemingway, including honors and awardsIntroduction to and synopsis of the booksCharacter analyses of primary figures Frederick Henry and Catherine BarkleyCritical essays on weather symbolism and Hemingway’s influenceReview section that features fill-in-the-blank questions, quoted passages, and suggested essay topics and practice projectsResource Center with books, articles, video and audio recordings, and websites that can help round out your knowledgeClassic literature or modern-day treasure—you&#39;ll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Literary Criticism , American , General",
        "Publisher": "CliffsNotes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Eighteenth Century Emigrants from Langenselbold in Hessen to America",
        "Authors": "By Kunselmann-Burgert, Annette",
        "Description": "",
        "Category": " History , General",
        "Publisher": "A K B Pubns",
        "Price Starting With ($)": "52.58",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    }
]