[
    {
        "Title": "Milk Glass Moon: A Big Stone Gap Novel (Big Stone Gap Novels)",
        "Authors": "By Trigiani, Adriana",
        "Description": "In the conclusion of the Big Stone Gap trilogy, Ave Maria faces unexpected upheavals and changes that test her faith, conscience, generosity, and understanding as her daughter, Etta, confronts the perils and choices of adulthood, her friends in Big Stone Gap deal with major life changes of their own, and her husband sets out to reinvent his life. 100,000 first printing.",
        "Category": " Fiction , Sagas",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Saddam's Bombmaker: The Terrifying Inside Story of the Iraqi Nuclear and Biological Weapons Agenda",
        "Authors": "By Stein, Jeff and Hamzah, Khidr Abd Al-Abbas",
        "Description": "Saddam Hussein's bomb expert--one of the highest-level defectors in American history--offers a detailed description of the Iraqi dictator's program to develop weapons of mass destruction. 40,000 first printing.",
        "Category": " History , Middle East , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "A Seeker's Guide to Christian Faith",
        "Authors": "By Johnson, Ben Campbell",
        "Description": "",
        "Category": " Religion , Christianity , General",
        "Publisher": "Upper Room",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Power and Terror: Post-9/11 Talks and Interviews",
        "Authors": "By Chomsky, Noam, Junkerman, John (EDT), and Masakazu, Takei (EDT)",
        "Description": "In this, his first new book since the international bestseller 9-11, Noam Chomsky presents his latest thinking on terrorism and U.S. foreign policy, focusing on alternatives to the current course of armed provocation.Noam Chomsky is the author of, among many other books, Profit over People, and the international anti-war bestseller 9-11, which has sold over 300,000 copies worldwide.",
        "Category": " Political Science , Essays",
        "Publisher": "Seven Stories Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Watch the Woolly Worm",
        "Authors": "By madge-tovey",
        "Description": "",
        "Category": "",
        "Publisher": "Electronic Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Indians (American Heritage)",
        "Authors": "By Brandon, William",
        "Description": "",
        "Category": " History , United States , General",
        "Publisher": "Amer Heritage Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "The American Heritage History of the Indian Wars (American Heritage Library)",
        "Authors": "By Washburn, Wilcomb E. and Utley, Robert Marshall",
        "Description": "Indian Wars recounts the conflicts between Native Americans and white settlers that lasted 400 years. The authors examine both small battles and major wars, from the native rebellion of 1492 to the massacre at Wounded Knee.",
        "Category": " History , United States , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Looking Into Space",
        "Authors": "By Nelson, Nigel and Harper, Piers (ILT)",
        "Description": "An exciting and thrilling introduction to space includes such adventures as visiting planets, investigating the inside of a space station, and more, with helpful acetate windows, simple text, and a wealth of fascinating trivia questions.",
        "Category": " Juvenile Nonfiction , Technology , Aeronautics, Astronautics & Space Science",
        "Publisher": "Reader's Digest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Shiloh (Yearling Newbery)",
        "Authors": "By Naylor, Phyllis Reynolds",
        "Description": "There's nothing eleven-year-old Marty Preston enjoys more than spending time up in the hills behind his home near Friendly, West Virginia.But this time is different. This time Marty sees a young beagle on the road past the old Shiloh school-house.Marty feels sure the dog is being abused by his owner. When the dog runs away to Marty's house, his parents say he must bring him back. But it hurts Marty to return the runaway dog to his cruel master.That's when Marty secretly decides he'll do anything to save the dog he names Shiloh.",
        "Category": " Juvenile Fiction , Social Themes , Physical & Emotional Abuse",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Hans Brinker (Illustrated Classics)",
        "Authors": "By Elwell, Peter (ILT), Dodge, Mary Mapes, and Betts, Louise",
        "Description": "A Dutch brother and sister work toward two goals, finding the doctor who can restore their father's memory and winning the competition for the silver skates.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Pueblo Boy: Growing Up in Two Worlds",
        "Authors": "By Keegan, Marcia",
        "Description": "Text and photographs depict the home, school, and cultural life of a young Indian boy growing up on the San Ildefonso Pueblo in New Mexico",
        "Category": " Juvenile Nonfiction , People & Places , United States , Native American",
        "Publisher": "Dutton Juvenile",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Comanche Moon",
        "Authors": "By McMurtry, Larry",
        "Description": "We join Texas Rangers August McCrae and Woodrow F. Call in their middle years, just beginning to deal with the perplexing tensions of adult life - Gus and his great love, Clara Forsythe; Call and Maggie Tilton, the young whore who loves him - when they enlist with a Ranger troop in pursuit of Buffalo Hump, the great Comanche war chief; Kicking Wolf, the celebrated Comanche horse thief; and a deadly Mexican bandit king with a penchant for torture. Assisting the Rangers in their wild chase is the renowned Kickapoo tracker, Famous Shoes.Comanche Moon joins the twenty-year time line between Dead Man's Walk and Lonesome Dove, as we follow beloved heroes Gus and Call and their comrades-in-arms - Deets, Jake Spoon, and Pea Eye Parker - in their bitter struggle to protect an advancing Western frontier against the defiant Comanches, courageously determined to defend their territory and their way of life.At once realistic and yet vividly imagined, Comanche Moon is a giant of a book - written by one of America's most honored and distinguished novelists - and the keystone to a mighty achievement of storytelling, unparalleled for its sweep, its meticulous re-creation of the past, its sheer energy, and its celebration of life: an epic adventure full of heroism, tragedy, cruelty, courage, honor and betrayal, and the culmination of Larry McMurtry's peerless vision of the American West.",
        "Category": " Fiction , Literary",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Paddington at Work",
        "Authors": "By Bond, Michael",
        "Description": "Paddington, a small well-meaning bear from Peru, endures many escapades and misadventures when he enters the business world.",
        "Category": " Juvenile Fiction , Business, Careers, Occupations",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1971"
        }
    },
    {
        "Title": "The Devil's Alternative",
        "Authors": "By Forsyth, Frederick",
        "Description": "The rescue of an unconscious man from the Black Sea, sometime in 1982, sets off a sequence of events that takes officials in Washington, Moscow, London, Berlin, Tel Aviv, and Rotterdam on the brink of global catastrophe",
        "Category": " Fiction , Political",
        "Publisher": "The Viking Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1980"
        }
    },
    {
        "Title": "The Smurf's Apprentice",
        "Authors": "By Peyo.",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Four Great Plays by Henrik Ibsen (Bantam Classics)",
        "Authors": "By Ibsen, Henrik",
        "Description": "Here, in a single volume, are four major plays by the first modern playwright, Henrick Ibsen. Ghosts -the startling portrayal of a family destroyed by disease and infidelity. The Wild Duck -- A poignant drama of lost illusions. An Enemy Of The People -- Ibsen's vigorous attack on public opinion.  And A Doll's House -- the play that scandalized the Victorian world with its unsparing views of love and marriage, featuring one of the most controversial heroines -- and one of the most famous exists -- in the literature of the stage.",
        "Category": " Drama , Continental European",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "Savannah or A Gift For Mr Lincoln",
        "Authors": "By Jakes, John",
        "Description": "As Sherman and his army march from Atlanta to the sea in 1864, the charming old city of Savannah lies directly in their path, threatening the livelihood of widow Sara Lester and her twelve-year-old daughter Hattie, who struggle to save the family plantation, but when Sherman offers Lincoln the city as a Christmas gift, he finds himself on a collision course with young Hattie. 225,000 first printing.",
        "Category": " Fiction , Historical",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "On a Wicked Dawn (Cynster Novels, 9)",
        "Authors": "By Laurens, Stephanie",
        "Description": "Amelia Cynster is stunned to hear these words from Lucien Ashford—the enigmatic sixth Viscount Calverton and the man she has always loved—just before the handsome rogue passes out at her feet. Dawn is breaking and she's already risked scandal by lying in wait for him just outside his London home. And though torn between indignant affront and astonished relief, she's nevertheless thrilled that Luc has agreed to her outrageous marriage proposal.However, rather than submitting to a hasty wedding as Amelia had planned, the exasperating lord insists on wooing her properly…in public and in private. She longs for their time alone, when she can learn all about seduction from a master, yet frustratingly, they all too often find themselves beneath the stifling gaze of the ton.But there is method behind the viscount's madness—he has a secret reason for wooing Amelia. And like all desirable things, his passion has a price.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Walt Disney's Mother Goose",
        "Authors": "By Disney",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Circus (Wide Wide World)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Froebel-Kan Co.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Spot Goes to the Beach",
        "Authors": "By Hill, Eric",
        "Description": "In this lift-the-flap book, Spot goes to the beach with his parents and finds all kinds of fun things to do, from almost catching a fish to meeting a new friend. Reprint.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Monday Mourning: A Novel (Reichs, Kathy)",
        "Authors": "By Reichs, Kathy",
        "Description": "A riveting new Temperance Brennan forensic thriller from Kathy Reichs, the internationally acclaimed forensic anthropologist and New York Times bestselling author...  Temperance Brennan, forensic anthropologist for both North Carolina and Quebec, has come from Charlotte to Montreal during the bleak days of December to testify as an expert witness at a murder trial.   She should be going over her notes, but instead she's digging in the basement of a pizza parlor. Not fun. Freezing cold. Crawling rats. And now, the skeletonized remains of three young women. How did they get there? When did they die?  Homicide detective Luc Claudel, never Tempe's greatest fan, believes the bones are historic. Not his case, not his concern. The pizza parlor owner found nineteenth-century buttons in the cellar with the skeletons. Claudel takes them as an indicator of the bones' antiquity.   But something doesn't make sense. Tempe examines the bones in her lab and establishes approximate age with Carbon 14. Further study of tooth enamel tells her where the women were born. If she's right, Claudel has three recent murders on his hands. Definitely his case.  Detective Andrew Ryan, meanwhile, is acting mysteriously. What are those private phone calls he takes in the other room, and why does he suddenly disappear just when Tempe is beginning to hope he might be a permanent part of her life? Looks like more lonely nights for Tempe and Birdie, her cat.  As Tempe searches for answers in both her personal and professional lives, she finds herself drawn deep into a web of evil from which there may be no escape. Women have disappeared, never to return....Tempe may be next.  With its powerful mix of nail-biting suspense and cutting-edge forensic science, Monday Mourning is the best yet from this superbly gifted, megastar author who, as New York Newsday says, is \"the real thing.\"",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Wolves Eat Dogs",
        "Authors": "By Smith, Martin Cruz",
        "Description": "Arkady Renko returns for his most enigmatic and baffling case: the death of one of Russia's new billionaires, which leads him to the Zone of Exclusion -- Chernobyl, and the surrounding areas closed to the world since the nuclear disaster of 1986.  In his groundbreaking Gorky Park, Martin Cruz Smith created one of the iconic detectives of contemporary fiction, Arkady Renko. Cynical, quietly subversive, brilliantly analytical and haunted by melancholy, Renko has survived, barely, the journey from the Soviet Union to the New Russia, only to find his transformed nation just as obsessed with secrecy, corruption and brutality as was the old Communist dictatorship.  In Wolves Eat Dogs, Renko enters the privileged world of Russia's new billionaire class. The grandest of them all, a self-made powerhouse named Pasha Ivanov, has apparently leapt to his death from the palatial splendor of his posh, ultra-modern Moscow condominium. While there are no signs pointing to homicide, there is one troubling and puzzling bit of evidence: in Ivanov's bedroom closet, there's a mountain of salt.  Ivanov's demise ultimately leads Renko to Chernobyl and its environs. (No one knows how many deaths resulted from the explosion in Reactor Number 4. The official government figure is just 41, though many experts estimate that the toll was really a half million or more.) It is a ghostly world, still aglow with radioactivity, now inhabited only by the militia, shady scavengers, a few reckless scientists, and some elderly Ukrainian peasants who would rather ignore the Geiger counters than relocate. Renko's journey to this netherworld, the crimes he uncovers there and the secrets they reveal about the New Russia, make for a tense, unforgettable page-turning adventure.  Each of Martin Cruz Smith's novels is a ticket to an unknown world. Wolves Eat Dogs is Smith's most harrowing trip yet.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Faith and Power",
        "Authors": "By Mortimer, Edward",
        "Description": "Traces the history of Islam and examines its manifestations in modern Turkey, Saudi Arabia, Pakistan, Iran, and Russia",
        "Category": " Religion , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1982"
        }
    },
    {
        "Title": "Chicken Soup for the Soul The Book of Christmas Virtues: Inspirational Stories to Warm the Heart",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), and Rehme, Carol Mcadoo (COM)",
        "Description": "Includes Mannheim Steamroller remixed classical Christmas music CD created exclusively for Chicken Soup!Designed as a gift book or family keepsake to be used as a holiday tradition, this beautiful hardcover features seven virtues that are traditionally associated with Christmas. Each one is discussed in a short inspirational essay then illustrated by four to five all-new heart-touching stories from Chicken Soup for the Soul, bringing the magic of the season to light. Each section ends with a one-page suggestion on how to start your own holiday tradition, from baking cookies to charity ideas that reflect the spirit of the virtue.Perfect for adults and children, this uplifting book is a wonderful celebration of the season.",
        "Category": " Self-help , Spiritual",
        "Publisher": "HCI",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Love Secrets for a Lasting Relationship",
        "Authors": "By Bloomfield, Harold H. and Josefowitz, Natasha",
        "Description": "A guide to making love last provides more than seventy practical tips to keeping the romance in a marriage or other committed relationship. By the author of How to Survive the Loss of Love. 50,000 first printing. $50,000 ad/promo.",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Trips & Treks: A Guide to Outings in New Jersey & Beyond",
        "Authors": "By Barbara Hudgins",
        "Description": "",
        "Category": "",
        "Publisher": "Woodmont Press",
        "Price Starting With ($)": "5.97",
        "Publish Date": {
            "Month": "May",
            "Year": "1983"
        }
    },
    {
        "Title": "A Furnace Afloat: The Wreck of the Hornet and the Harrowing 4,300-mile Voyage of Its Survivors",
        "Authors": "By Jackson, Joe",
        "Description": "Traces the story of an 1866 American clipper ship that accidentally caught on fire and sank, stranding its crews on three small life boats for more than six weeks—with limited resources and under the burning sun—before they resorted to cannibalism and eventually reached Hawaii. 25,000 first printing.",
        "Category": " History , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Just Me and My Mom (A Little Critter Book)",
        "Authors": "By Mayer, Mercer and Mayer, Mercer (ILT)",
        "Description": "Head to the big city with Little Critter and his mom in this adventurous picture book! Mercer Mayer's Little Critter is spending a special day with his mom in this classic, funny, and heartwarming story. Whether the duo is at the museum, the aquarium, or the toy store, both parents and children alike will relate to Little Critter’s beloved story. A perfect gift for Mother’s Day . . . or any day!",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "The Berenstain Bears Get the Gimmies",
        "Authors": "By Berenstain, Stan and Berenstain, Jan",
        "Description": "This classic Berenstain Bears story is a perfect way to teach children about self-control and the importance of compromise!Come for a visit in Bear Country with this classic First Time Book® from Stan and Jan Berenstain. Brother and Sister are having a bad case of the “gimmies.” Whenever they don’t get what they want, they throw a tantrum. But is this really the best way to handle their emotions? Includes over 50 bonus stickers!",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "A Man to Call My Own: A Novel (Lindsey, Johanna)",
        "Authors": "By Lindsey, Johanna",
        "Description": "",
        "Category": "",
        "Publisher": "Atria",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Multiplication Wipe-Off Book",
        "Authors": "By Hartley, Alan",
        "Description": "",
        "Category": "",
        "Publisher": "Scholastic",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Paul Revere: Boston Patriot (Childhood of Famous Americans)",
        "Authors": "By Stevenson, Augusta and Nicholas, Frank (ILT)",
        "Description": "Presents the boyhood of the well-known Boston silversmith and patriot of the Revolution, famous for his ride to warn the countryside of the approaching British",
        "Category": " Juvenile Fiction , Historical , United States , Colonial & Revolutionary Periods",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Our Endangered Values: America's Moral Crisis",
        "Authors": "By Carter, Jimmy",
        "Description": "In Our Endangered Values, Jimmy Carter describes quite personally his own involvement and reactions to some disturbing societal trends that have taken place during the past few years. These changes involve both the religious and the political worlds as they have increasingly become intertwined, and include some of the most crucial and controversial issues of the day - frequently encapsulated under 'moral values'.Many of these matters are under fierce debate, and include pre-emptive war, women's rights, terrorism, civil liberties, homosexuality, abortion, the death penalty, science and religion, environmental degradation, nuclear arsenals, America's global image, fundamentalism, and the welding of religion and politics. Carter, sustained by his own lifelong faith, assesses these issues in a forceful and unequivocal, but balanced and courageous way. Our Endangered Values is a book that his millions of readers have eagerly awaited.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "41.48",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "The Adventures of Danny Meadow Mouse (Dover Children's Thrift Classics)",
        "Authors": "By Burgess, Thornton W., Kliros, Thea (ILT), Cady, Harrison, Kliros, Thea, and Cady, Harrison (ILT)",
        "Description": "A plump little meadow mouse is always an inviting target for hungry hunters in the Green Meadows. This certainly should give Danny Meadow Mouse enough cause for concern; but lately, he's been worrying about something else — his short tail! In fact, he wants so much to have a different tail that he almost forgets to take care of the one he has.Danny spends much of his time avoiding the likes of Hooty the Owl, who drifts effortlessly above him in the open air; Reddy Fox and old Granny Fox, who stalk him as he races through snow tunnels; Mr. Blacksnake, who silently slithers after him through the grass; and other pesky predators.Youngsters will enjoy reading and listening to the adventures of the plucky vole and his friends as they explore Farmer Brown's orchard, the Old Briar-patch, and the enchanting world of the Green Forest. The text has been completely reset in large, easy-to-read type and Thea Kliros has adapted six black-and-white illustrations from the originals by Harrison Cady.",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Cold Hit: A Shane Scully Novel (Shane Scully Novels)",
        "Authors": "By Cannell, Stephen J.",
        "Description": "What if, under the PATRIOT Act, federal bureaucrats could take murder cases away from local cops—then bury those cases so they’re never investigated again? What if government agents could bug your home, your car, your place of business—your entire life—with nothing more than spoken permission from a secret panel of judges? What if the Department of Homeland Security could pull police officers off the street and hold them in cells indefinitely as material witnesses—because they’re working on “sensitive” investigations?They can . . . The PATRIOT Act and the Homeland Security Act give enormous power to our nation’s top federal law enforcement officials. They operate under the presumption that these officials are honest, diligent, and fair.But what if they’re not?In THE COLD HIT, Detective Shane Scully suspects that the regional boss of the Department of Homeland Security is thwarting a major murder investigation. But why? Robert Allen Virtue can act without oversight or accountability. There’s no way to question him; there’s no way to way to check up on him; there’s no way to find out if he’s exceeding his authority. Virtually at will, he can bug anyone he considers a threat to national security, take over criminal investigations, and jail cops. Even if he is breaking the law, there’s no way to know it. There’s nothing to rely on but his integrity. His professional commitment. His good name. Virtue.That may be a very big mistake.Shane and his partner are investigating \"the Fingertip Killer,” a serial murderer preying on homeless Vietnam vets in Los Angeles. A bullet taken from one victim's skull matches the bullet that killed another man ten years earlier—an unexpected ballistics match linking one unsolved case to another that police call a “cold hit.” When the earlier victim turns out to have been an LAPD cop, the investigation becomes very personal for Shane. But there’s a problem: Robert Allen Virtue wants him taken off it. To solve the cop’s murder, and possibly the Fingertip case, Scully must go behind the powerful bureaucrat’s back and deep undercover—where he will begin unraveling a deadly far-reaching conspiracy that threatens to destroy everything he loves: his career, his freedom, and his family.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "North by Night: A Story of the Underground Railroad",
        "Authors": "By Ayres, Katherine",
        "Description": "It's 1851 and Lucy Spencer's family is keeping a secret. Their Ohio home is a station on the Underground Railroad, the network of people and places that helps fugitive slaves escape to freedom in Canada. Lucy believes in what she and her family do to help the fugitives, even if it means putting herself in danger.So Lucy doesn't hesitate when she is asked to stay with the Widow Aurelia Mercer and help her with a family of runaway slaves hiding in her attic. And she learns so much from her experience--about growing up, love, and standing on her own. But what will Lucy do when she is asked to make the ultimate sacrifice and leave all she loves behind?",
        "Category": " Juvenile Fiction , Historical , United States , General",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Little Prince",
        "Authors": "By Saint-Exupery, Antoine de",
        "Description": "A pilot is forced down in the Sahara where he meets a strange little prince from another planet",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Harvest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "American Spartans: The U.S. Marines: A Combat History from Iwo Jima to Iraq",
        "Authors": "By Warren, James A.",
        "Description": "American Spartans is the first modern battle history of the Marines in a generation, showing exactly how \"the few and the proud\" have performed in key conflicts from Iwo Jima to the present, and how they have prepared and reinvented themselves between the wars. From the islands of the Pacific, to Korea, to the Middle East, the Marines' strategies and tactics have evolved considerably during the past six decades, yet in every conflict they have proven themselves to be America's finest warriors.Supported by dozens of interviews, hundreds of print sources, and firsthand observation of Marine training and exercises, James Warren offers a lively history of the frontline heroes, colorful personalities, and far-ranging strategists who have made the Marines what they are today. American Spartans shows how the Marines have maintained such basic, timeless precepts as \"first in, last out,\" and \"every man a rifleman,\" across every decade, and despite many changes in warfare, technology, and opponents.The Marines themselves are keenly aware of the lessons of history and of the great Marines of the past. They are more conscious of their role in famous battles, and moments and careers of courage, than any other branch of the armed services. They also know, as Warren explains, that their way of life has been threatened repeatedly by political and bureaucratic attempts to overcome their independence.As James Warren shows, the real lesson of Marine history is that they have been our elite all along, and we have much to learn from them.",
        "Category": " History , Military , United States",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "WORDS THAT SHINE LIKE STARS",
        "Authors": "By Douglas Pagels",
        "Description": "",
        "Category": "",
        "Publisher": "Blue Mountain Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Turning Your Stress into Strength",
        "Authors": "By Schuller, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "Spiritual gifts & the church",
        "Authors": "By Donald Bridge, David Phypers",
        "Description": "",
        "Category": "",
        "Publisher": "InterVarsity Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "The meaning of the sacraments",
        "Authors": "By Hellwig, Monika",
        "Description": "",
        "Category": "",
        "Publisher": "Pflaum/Standard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The Overcoming Power",
        "Authors": "By Shy Mackes",
        "Description": "",
        "Category": "",
        "Publisher": "New Puritan Library",
        "Price Starting With ($)": "6.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Book of the Dead",
        "Authors": "By Cornwell, Patricia Daniels",
        "Description": "From America's # 1 bestselling crime writer comes the extraordinary new Dr. Kay Scarpetta novel.  The \"book of the dead\" is the morgue log, a ledger in which all cases are entered by hand. For Kay Scarpetta, however, it is about to take on a new meaning. Fresh from her bruising battle with a psychopath in Florida, Scarpetta decides it's time for a change of pace, not only personally and professionally but geographically. Moving to the historic city of Charleston, South Carolina, she opens a unique private forensic pathology practice, one in which she and her colleagues-including Pete Marino and her niece, Lucy-offer expert crime-scene investigation and autopsy services to communities lacking local access to modern, competent death investigation technology.  It seems like an ideal situation, until the new battles start-with local politicians, with entrenched interests, with someone whose covert attempts at sabotage are clearly meant to run Scarpetta out of town. And that's before the murders and other violent deaths even begin.  A young man from a well-known family jumps off a water tower. A woman is found ritualistically murdered in her multimillion-dollar beach home. The body of an abused young boy is discovered dumped in a desolate marsh. Meanwhile, in distant New England, problems with a prominent patient at a Harvard-affiliated psychiatric hospital begin to hint at interconnections that are as hard to imagine as they are horrible.  Kay Scarpetta has dealt with many brutal and unusual crimes before, but never a string of them as baffling, or as terrifying, as the ones confronting her now. Before she is through, that book of the dead will contain many names-and the pen may be poised to write in her own.  The first name in forensics. The last name in suspense. Once again, Patricia Cornwell proves her exceptional ability to entertain and enthrall.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Why Do Dogs Have Wet Noses? and Other Imponderables of Everyday Life",
        "Authors": "By Feldman, David and Schwan, Kassie (ILT)",
        "Description": "Presents a collection of intriguing imponderables of everyday life for which encyclopedias do not have the answers",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "No more holiday blues: Uplifting advice for recapturing the true spirit of Christmas, Hanukkah, and New Year's",
        "Authors": "By Dyer, Wayne W.",
        "Description": "",
        "Category": "",
        "Publisher": "HarperPerennial",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Dangerous Hour: A Sharon McCone Mystery",
        "Authors": "By Muller, Marcia",
        "Description": "Complacency can make a person careless, and Sharon McCone, who makes crime her business, should know that better than most. One minute she's riding high with her detective agency expanding, her bank account growing, and her only \"problem\" a marriage proposal from her love, Hy Ripinsky, that's kicking up her longtime fears of commitment. The next minute, in the time it takes for a single phone call to bring bad news, she stands to lose everything.McCone is stunned to learn that a favorite employee, streetwise and savvy Julia Rafael, has been charged with credit-card fraud. She thinks there must be a mistake - until she finds the goods charged to the stolen credit card in the firm's mailroom. As she starts to dig into the facts of the case, McCone realizes that someone is out to ruin her business, blacken her reputation, and harm those close to her...Reaching back into her past to look for answers, she must come to grips with the violent twists and turns of her career, the choices she's faced, and the enemies she's made. How does the formerly trustworthy Julia fit into the big picture? And how does this new crisis tie into the recent murder of a popular Mission District fund-raiser? But when someone breaks into her car, invades her home, and upsets every aspect of her life, McCone knows one thing for sure: Now it's her turn to prove how tough she really is, and how far she'll go to get justice...and some payback of her own.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Mysterious Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Cooking with Faith: 125 Classic and Healthy Southern Recipes",
        "Authors": "By Clark, Melissa, Thomas, Mark (PHT), and Ford, Faith",
        "Description": "Beloved comic actress Faith Ford puts a fresh and healthy new spin on down-home cooking with 125 updated Southern classics and traditional favorites cooked by three generations of her family.  You wouldn't know it by looking at her -- either during her years as Corky Sherwood on CBS's Murphy Brown or now on her hit ABC comedy Hope & Faith -- but Faith Ford loves to eat.  Growing up in Pineville, Louisiana, Faith learned how to cook the great Southern classics from her mother and grandmother: Old-Fashioned Smothered Chicken, Mom's Smoky Beef Brisket, Southern-Style Fried Catfish, Cora's Skillet Candied Sweet Potatoes, Snap Beans and New Potatoes, Buttermilk Biscuits, Fluffy Lemon Icebox Pie, and more.  Then, at age seventeen, she left Pineville for a modeling and acting career in New York City and later Los Angeles. She longed for the comforting foods of home but sought to adapt them to match her new, California, health-conscious sensibility. Thus began a lifetime of experimentation in the kitchen, developing healthier versions of foods from her childhood by cooking with olive oil; incorporating loads of vegetables -- staples on the family farm in Louisiana -- into every meal; oven-frying; and using chopped fresh herbs for maximum flavor. The delicious results -- Golden Crispy Oven-Fried Chicken; Broiled Red Snapper with Olives, Onions, and Tomatoes; Grilled Veggie Po' Boys; Dilled Egg White Salad; Green Beans Braised with Balsamic Vinegar and Soy Sauce; Asparagus with Tarragon Vinaigrette; Peaches-n-Creamy Shake; and Sweet Summer Melon-Mint Salad -- regularly wow friends in Los Angeles and have even won over Mom and the folks back home.  An inspired combination of the best of both worlds -- the homespun, heirloom dishes Faith grew up on (because every once in a while you need to indulge and only the \"real thing\" will do) and her own healthier, more modern versions and creations -- Cooking with Faith is also about the bonds that grow between family and friends as they spend time together in the kitchen. After all, says Faith, \"well-made food is an experience. It's about taking pride in what you eat. It's a remedy for an increasingly fast-food-reliant society -- I mean, how can you be that much in a hurry?\"",
        "Category": " Cooking , Specific Ingredients , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Burned (Regan Reilly Mysteries, No. 8)",
        "Authors": "By Clark, Carol Higgins",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The Language of Teenagers: Words to Remember (Blue Mountain Arts Collection)",
        "Authors": "By Blue Mountain Arts Collection (EDT)",
        "Description": "",
        "Category": " Family & Relationships , Life Stages , Teenagers",
        "Publisher": "Blue Mountain Arts",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Anno-Dracula",
        "Authors": "By Newman, Kim",
        "Description": "In 1885, Count Dracula, after four hundred years' brooding in his Transylvanian Castle, came to London, intent on spreading the pestilence of vampirism to the heart of Victoria's Britain. The monster was defeated and destroyed by Professor Van Helsing and his stout-hearted companions, and the world was saved from further horrors.But what if Van Helsing failed, and Dracula's plan of conquest was successful...This panoramic novel of altered history and literary speculation combines horror, mystery, romance, politics, and wit as Kim Newman brilliantly reinvent the familiar world of late Victorian melodrama, intermingling famous historical and fictional characters while penetrating the fog to discover the shocking truths.",
        "Category": " Fiction , General",
        "Publisher": "Carroll & Graf Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The Bookman's Wake (Cliff Janeway Novels (Paperback))",
        "Authors": "By Dunning, John",
        "Description": "Denver cop-turned-bookdealer Cliff Janeway is lured by an enterprising fellow ex-policeman into going to Seattle to bring back a fugitive wanted for assault, burglary, and the possible theft of a priceless edition of Edgar Allan Poe's \"The Raven.\" The bail jumper turns out to be a vulnerable young woman calling herself Eleanor Rigby, who is also a gifted book finder.  Janeway is intrigued by the woman -- and by the deadly history surrounding the rare volume. Hunted by people willing to kill for the antique tome, a terrified Eleanor escapes and disappears. To find her -- and save her -- Janeway must unravel the secrets of the book's past and its mysterious maker, for only then can he stop the hand of death from turning another page....",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "George W. Bushisms V: New Ways to Harm Our Country",
        "Authors": "By Bush, George W., Weisberg, Jacob, and Trillin, Calvin (FRW)",
        "Description": "\"I can only speak to myself.\"  True -- and yet we must listen. Sometimes his accidental wit speaks louder than any prepared statement.  \"Our enemies are innovative and resourceful, and so are we. They never stop thinking about new ways to harm our country and our people, and neither do we.\"  \"I always jest to people, the Oval Office is the kind of place where people stand outside, they're getting ready to come in and tell me what for, and they walk in and get overwhelmed by the atmosphere. And they say, 'Man, you're looking pretty.'\"  \"I'm honored to shake the hand of a brave Iraqi citizen who had his hand cut off by Saddam Hussein.\"  Thanks to the faithful work of Jacob Weisberg, the wisdom of George W. Bush -- America's Malapropist in Chief -- has been carefully preserved for the ages in annual editions. Now that the president is armed with a new (and unprecedented!) popular electoral victory, America can breathe a sigh of relief -- or, as the president once put it, we can \"thank our blessings.\" The language experiments will continue. Stand-up comedians will enjoy full employment.  With George W. Bushisms V, the second term truly begins.",
        "Category": " Humor , Topic , Politics",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "American Heroes: In the Fight Against Radical Islam (War Stories)",
        "Authors": "By North, Oliver and Holton, Chuck (EDT)",
        "Description": "What is a Hero? New York Times best-selling author Oliver North says, “Real heroes are selfless. Those who serve America in harm’s way in the war against radical Islam have that quality in abundance. And so do their families and loved ones at home. Yet, they rarely get the attention or coverage they deserve.“Despite the way they are presented by too many in the press and politics, the men and women in uniform today are overwhelmingly good. I never cease to be amazed at the self-discipline of these brave young Americans. They can endure the adrenaline-pumping violence of an enemy engagement, and then, just minutes later, help school children get safely to their classes . . . No nation—ours included—has ever had a military force better than the one we have today. I’m proud of them. You should be too.” In American Heroes (a New York Times, Wall Street Journal, and Washington Post best seller), North offers an inspiring, first-hand account of the extraordinary men and women defending America against radical Islamic terror from his perspective as a forty year member of the United States military, a member of the National Security Council staff and serving as the U.S. government’s counter-terrorism coordinator from 1983-1986. This patriotic book also pulls in new reports and exclusive full-color photographs from War Stories, the award-winning FOX News Channel series hosted by North. Endorsements \"Oliver North has spent his life among America’s heroes. This book with its moving words and powerful images will inspire patriots, reassure the faint of heart, and infuriate our nation’s adversaries. These are our heroes, they deserve to have their story told, and no one is better to tell it than Col. North, because when it comes to heroes, it takes one to know one. This book is a treasure.\"—Newt Gingrich, former Speaker of the House of Representatives and New York Times bestselling author of Real Change\"Ollie North has ‘been there—done that’ with the American heroes who are winning the war against radical Islamic terror. This book is a magnificent tribute to the warriors who defend us all.\"—Sean Hannity, host of The Sean Hannity Show and FOX News Channel’s Hannity & Colmes",
        "Category": " Political Science , Terrorism",
        "Publisher": "B&H Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Sharing Good Times",
        "Authors": "By Carter, Jimmy",
        "Description": "In this wonderfully evocative volume, following the outstanding success of The Hornet's Nest, Christmas in Plains, and his classic, An Hour Before Daylight, Jimmy Carter writes about the things that matter most, the simple relaxed days and nights that he has enjoyed with family and friends through the years and across generations.  Here are lively and witty accounts of exploring the outdoors with his father and with black playmates; making furniture; painting; pursuing new adventures and going places with children, grandchildren, and friends. He describes how he learned to share life with his wife, Rosalynn -- and how they both learned how to grant each other personal space -- and to compete with her on the tennis court, high mountains, trout streams, and ski slopes.  These lifetime experiences can be an inspirational guide to anyone desiring to stretch mind and heart and to combine work and pleasure.",
        "Category": " History , United States , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Chicken Soup for the Teenage Soul II (Chicken Soup for the Soul)",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), and Kirberger, Kimberly (COM)",
        "Description": "Chicken Soup for the Teenage Soul II offers more inspiring stories to help you master the game we call life.  Today's teens have ever more issues and social pressures to juggle than young adults just 20 years ago.  This book, like its predecessor, can be your guide - a beacon in the darkness, a safe haven in a storm, a warm hug in the cold and a respite from loneliness.  There's no preaching as to what you should and shouldn't do.  Instead, this book is full of teens sharing their experiences on learning to accept like, becoming the best person you can be, being happy with who you are, and loving yourself - no matter what.",
        "Category": " Young Adult Nonfiction , Social Science , Sociology",
        "Publisher": "HCI Teens",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Hawley's Condensed Chemical Dictionary",
        "Authors": "By N. Irving Sax, Richard J. Lewis Sr.",
        "Description": "",
        "Category": "",
        "Publisher": "Van Nostrand Reinhold Company",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Through a Window - My Thirty Years With the Chimpanzees of Gombe",
        "Authors": "By Goodall, Jane",
        "Description": "Jane Goodall recounts the thirty years she spent in the company of chimpanzees and describes the dynamics of a chimpanzee family",
        "Category": "",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Electra (Dover Thrift Editions)",
        "Authors": "By Sophocles and Young, George",
        "Description": "Electra recounts the murders of Clytemnestra and Aegisthus by Clytemnestra's son Orestes, to avenge their murder of his father Agamemnon, commander of the Greeks at Troy, upon his return home. Sophocles' version is presented from the viewpoint of Electra, Orestes' sister, who laments her father, bears witness to her mother's crime, and for years endures her mother's scorn. When Orestes arrives at last, her mood shifts from grief to joy as Orestes carries out the bloody vengeance. Despite her overwhelming passion for just revenge, Electra admits that her own actions are shameful.",
        "Category": " Drama , Ancient & Classical",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The Riddle Book (Pictureback(R))",
        "Authors": "By McKie, Roy",
        "Description": "Silly people, animals, and monsters present sillier riddles and their answers",
        "Category": " Juvenile Nonfiction , Humor , Jokes & Riddles",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "1978"
        }
    },
    {
        "Title": "Effective legal writing: For law students and lawyers",
        "Authors": "By Block, Gertrude",
        "Description": "",
        "Category": "",
        "Publisher": "Foundation Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Hooray! It's Passover!",
        "Authors": "By Kimmelman, Leslie and Himmelman, John (ILT)",
        "Description": "From singing holiday songs to playing favorite games, this first introduction celebrates all of the wonderful festivities and traditions of Passover.The loving and lovable family of Hanukkah Lights, Hanukkah Nights comes together once again, this time to celebrate Passover. They sing songs, say prayers, eat special foods, and play a special Passover game. Young readers will delight as the simple text and playful illustrations introduce them to all the traditions of this joyous and important holiday.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Hanukkah",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Better Homes and Gardens Knitting and Crocheting",
        "Authors": "By",
        "Description": "",
        "Category": " Crafts & Hobbies , Needlework , Crocheting",
        "Publisher": "Meredith Corporation",
        "Price Starting With ($)": "6.2",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "PAINT MAGIC",
        "Authors": "By Innes, Jocasta",
        "Description": "Describes tools, equipment, and techniques for highlighting walls, woodwork, floors, and furniture with decorative paint finishes, such as stenciling, marbling, and graining",
        "Category": "",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "Saturday night date",
        "Authors": "By McManus, Jane",
        "Description": "",
        "Category": "",
        "Publisher": "Watermill Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "The Red Sox Reader",
        "Authors": "By Riley, Dan (EDT)",
        "Description": "Since 1901, the Boston Red Sox have enjoyed the adulation of baseball fans throughout New England. All of the history, heartbreak, humor, and high tension of the team is captured in this collection of essays by such writers as John Updike, Stephen King, Peter Gammons, Ward Just, Michael Blowen, and Bill Lee.",
        "Category": " Sports & Recreation , Baseball , Essays & Writings",
        "Publisher": "Houghton Mifflin (P)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "The Invisible Man",
        "Authors": "By H G Wells",
        "Description": "",
        "Category": "",
        "Publisher": "Playmore Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Arthur's Honey Bear (I Can Read Book)",
        "Authors": "By Hoban, Lillian",
        "Description": "Arthur and his sister Violet are selling their old toys--even Arthur's favorite Honey Bear.  When his little sister buys his bear, Arthur misses him terribly.  But Arthur realizes that even though he's growing up, he can still have a special relationship with an old friend.  Young children will delight in the adventures of Arthur and Violet and this very special story about friendship.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1974"
        }
    },
    {
        "Title": "Bartlett's Book of Business Quotations",
        "Authors": "By Kipfer, Barbara Ann (EDT) and Bartlett, John (EDT)",
        "Description": "More than one thousand memorable business-related quotations range from the paradoxes of Eastern philosophy to the shrewd wisdom of American capitalism and provide inspiration for businessmen and speech makers. 35,000 first printing.",
        "Category": " Business & Economics , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Enterprising Women",
        "Authors": "By Bird, Caroline",
        "Description": "Brief accounts of the lives and careers of American women who have, from 1776 to the present, achieved economic success, innovation, and advancement or who have made significant contributions to the nation's economic history. Bibliogs",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "15.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Guilty Pleasures",
        "Authors": "By Sanders, Lawrence",
        "Description": "Emmet Richard Folsby: Founder of a mighty publishing empire, a patriarch to be admired - with one unspeakable exception...Constance Louise Folsby: Emmet's wife, and cofounder of the empire, now an invalid dying by degrees, resolutely blind to the moral missteps of those she cares for...Barbara Ann Folsby: The wildcat of a daughter, a fiercely ambitious business-woman, inexorably lured to love at its most forbidden... Brett Sherwood Folsby: The dashing play-boy son, his sister's most bitter antagonist, and a man with sexual secrets of his own...Through two decades, the Folsbys embrace their checkered destinies as Barbara and Brett battle for future control of the empire - never guessing that a trusted family friend with a hidden agenda is quietly manipulating them all...",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Putnam",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Winter of the Ice Wizard (Magic Tree House 32)",
        "Authors": "By Murdocca, Sal (ILT) and Osborne, Mary Pope",
        "Description": "Merlin the magician and Morgan le Fay have disappeared, and in order to   find them, Jack and Annie journey with their friends Teddy and Kathleen to   the Land-Behind-the-Clouds, a frozen kingdom of ice and snow. There they must   overcome their fears and solve the Ice Wizard's riddle, because if Jack and   Annie don't complete their mission in time, Merlin and Morgan will disappear   forever! Did you know that there’s a Magic Tree House book for every kid? Magic Tree House: Adventures with Jack and Annie, perfect for readers who   are just beginning chapter books Merlin Missions: More challenging adventures for the   experienced reader Super Edition: A longer and more dangerous adventure Fact Trackers: Nonfiction companions to your favorite Magic Tree House   adventures Have more fun with Jack and Annie at MagicTreeHouse.com!",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Great Gilly Hopkins",
        "Authors": "By Paterson, Katherine",
        "Description": "This timeless Newbery Honor Book from bestselling author Katherine Paterson about a wisecracking, ornary, completely unforgettable young heroine. Now a feature film starring Kathy Bates, Glenn Close, and Octavia Spencer! Eleven-year-old Gilly has been stuck in more foster families than she can remember, and she's hated them all. She has a reputation for being brash, brilliant, and completely unmanageable, and that's the way she likes it. So when she's sent to live with the Trotters—by far the strangest family yet—she knows it's only a temporary problem.Gilly decides to put her sharp mind to work and get out of there fast. She's determined to no longer be a foster kid. Before long she's devised an elaborate scheme to get her real mother to come rescue her. Unfortunately, the plan doesn't work out quite as she hoped it would...",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Back Roads",
        "Authors": "By O'Dell, Tawni",
        "Description": "Harley Altmyer, the heartbreaking and lovable hero of Tawni O'Dell's debut novel, should be in college drinking Rolling Rock and chasing girls. He should be freed from his stifling coal town, with its lack of jobs and no sense of humor. Instead, he's marooned in the Pennsylvania backwoods caring for his three beloved but unruly younger sisters. He has, at best, a shaky hold on the vicissitudes of day care, mac and cheese dinners, and visits to a once-devoted mother who seems not only resigned, but glad to hand over the reins of motherhood to her son.Life is further complicated when he develops an obsession with the sexy, melancholic mother of two down the road. He wants Callie Mercer so badly he fears he will explode. Family secrets and the unspoken truths long held at bay collide with his obsession, unearthing a series of staggering surprises.",
        "Category": " Fiction , General",
        "Publisher": "Viking Penguin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "How to Talk to a Liberal (If You Must): The World According to Ann Coulter",
        "Authors": "By Coulter, Ann H.",
        "Description": "Welcome to the world of Ann Coulter. With her monumental bestsellers Treason, Slander, and High Crimes and Misdemeanors, Coulter has become the most recognized and talked-about conservative intellectual in years—and certainly the most controversial. Now, in How to Talk to a Liberal (If You Must), which is sure to ignite impassioned debate, she offers her most comprehensive analysis of the American political scene to date. With incisive reasoning, refreshing candor, and razor-sharp wit, she reveals just why liberals have got it so wrong.In this powerful and entertaining book, which draws on her weekly columns, Coulter ranges far and wide. No subject is off-limits, and no comment is left unsaid. After all, she writes, “Nothing too extreme can be said about liberals because it’s all true.” How to Talk to a Liberal (If You Must) offers Coulter’s unvarnished take on: •The essence of being a liberal: “The absolute conviction that there is one set of rules for you, and another, completely different set of rules for everyone else.”•John Kerry: “A reporter asked Kerry, ‘Are you for or against gay marriage?’ As usual, his answer was, ‘Yes.’ ”•Her 9/11 comments: “I am often asked if I still think we should invade their countries, kill their leaders, and convert them to Christianity. The answer is: Now more than ever!”•The state of the Democratic Party: “Teddy Kennedy crawls out of Boston Harbor with a quart of Scotch in one pocket and a pair of pantyhose in the other, and Democrats hail him as their party’s spiritual leader.”  •Her philosophy for arguing with liberals: “Tough love, except I don’t love them. My ‘tough love’ approach is much like the Democrats’ ‘middle-class tax cuts’—everything but the last word.”•The “Treason Lobby”: “Want to make liberals angry? Defend the United States.”In this full-on Coulterpalooza, you’ll find the real, uncensored Ann Coulter. A special concluding chapter even includes the pieces that squeamish editors refused to publish—“what you could have read if you lived in a free country,” says Coulter. How to Talk to a Liberal (If You Must) is a stunning reminder of why Ann Coulter’s commentary has achieved must-read status.“A fluent polemicist with a gift for Menckenesque invective...and she can harness such language to subtle, syllogistic argument.”--Washington Post Book World“Ann Coulter is a trailblazer.”--Los Angeles Times Book Review“She can zing one-liners faster than Zeus can throw lightning bolts.”--Kansas City Star“You know those pundits who bore you to tears trying to balance everyone’s point of view? Coulter isn’t one.”--People“A great deal of research supports Ms. Coulter’s wisecracks.”--New York Times“The conservative movement has found its diva.”--Bill Maher“Ann Coulter is a pundit extraordinaire.”--Rush LimbaughAlso available as a Random House AudioBook and as an e-Book",
        "Category": " Political Science , Political Process , Political Parties",
        "Publisher": "Crown Forum",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "A Baker's Field Guide to Holiday Candy: Sweet Treats All Year Long",
        "Authors": "By Wilson, Dede",
        "Description": "Celebrate the holidays (or any day!) with these fabulous recipes from around the world for festive homemade treats. Give your Valentine a special sweet, like Chocolate Hazelnut Italian Kisses, or scare up some frightfully delicious delights for Halloween, such as Spider Webs and Easy Marbled Candy Corn Bark. Featuring full-color photographs for each recipe, the fun field guide format provides quick reference to each type of candy and confection “species,” including its Habitat (country of origin), Field Notes (helpful information), and Lifespan (how long it will keep). You’ll find classic candies, new twists on old favorites, and utterly original creations in this newest, sweetest offering in the Baker’s Field Guide Series.",
        "Category": " Cooking , Courses & Dishes , Confectionery",
        "Publisher": "Harvard Common Press",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "LITTLE FOLKS' STORY OF RIN-TIN-TIN",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Whitman Publishing Co.",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1927"
        }
    },
    {
        "Title": "Mike Meyers' MCSE Windows (r) 2000 Network Infrastructure Administration Certification Passport (Exam 70-216)",
        "Authors": "By McCaw, Rory",
        "Description": "Mike Meyers, the industry expert on professional certification, brings you this concise, affordable, and portable study tool for the MCSE Windows 2000 Network Infrastructure Administration certification exam. With an intensive focus on only what you need to know to pass exam 70-216 plus practice exam software on CD, this Certification Passport is your ticket to success on exam day.",
        "Category": " Computers , Management Information Systems",
        "Publisher": "Osborne/McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "You Suck: A Love Story",
        "Authors": "By Moore, Christopher",
        "Description": "\"You bitch, you killed me. You suck!\"Being dead sucks. Make that being undead sucks. Literally. Just ask Thomas C. Flood. Waking up after a fantastic night unlike anything he's ever experienced, he discovers that his girlfriend, Jody—the woman of his dreams—is a vampire. And surprise! Now he's one, too.For some couples, the whole biting-and-blood thing would have been a deal breaker. But Tommy and Jody are in love, and they vow to work through their issues. Like how much Jody should teach Tommy about his new superpowers (and how much he needs to learn on his own). Plus there's Tommy's cute new minion, sixteen-year-old goth girl Abby Normal. (Well, someone has to run errands during daylight hours!)Making the relationship work, however, is the least of Jody and Tommy's problems. Word has it that the vampire who nibbled on Jody wasn't supposed to be recruiting any new members into the club. Even worse, Tommy's erstwhile turkey-bowling pals are out to get him, at the urging of a blue-dyed Las Vegas call girl named (duh) Blue. And that really sucks.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Stepping on the Cracks",
        "Authors": "By Hahn, Mary Downing",
        "Description": "Margaret and her best friend Elizabeth both have brothers fighting the war against Hitler and, like everyone else they know, they are filled with feelings of patriotism. But the girls are also involved in their own personal war at home. Gordy Smith, the worst bully in sixth grade, teases and torments them, and Margaret is scared to death of him. But when Gordy and his pals Toad and Doug grow bolder than ever, Margaret and Elizabeth come up with a daring plan to get even. That's when the girls discover a shocking secret about Gordy that turns their lives upside-down and draws them into a startling confrontation with family, friends...and their own strongly held ideas.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "HarperColl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Spoon River Anthology (Dover Thrift Editions)",
        "Authors": "By Masters, Edgar Lee",
        "Description": "In Spoon River Anthology, the American poet Edgar Lee Masters (1869–1950) created a series of compelling free-verse monologues in which former citizens of a mythical Midwestern town speak touchingly from the grave of the thwarted hopes and dream of their lives. First published in book form in 1915, the Anthology was the crowning achievement of Masters' career as a poet, and a work that would become a landmark of 20th-century American literature.In these pages, no less than 214 individual voices are heard — some in no more than a dozen moving lines. Alternately plaintive, anguished, enigmatic, angry, and contemptuous, the voices of Spoon River, although distinctively small-town Americans, evoke themes of love and hope, disappointment and despair that are universal in their resonance. This American classic is reprinted here from the authoritative 1915 edition.",
        "Category": " Poetry , American , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The Jesus Papers: Exposing the Greatest Cover-Up in History",
        "Authors": "By Baigent, Michael",
        "Description": "What if everything you think you know about Jesus is wrong? In The Jesus Papers, Michael Baigent reveals the truth about Jesus's life and crucifixion. Despite—or rather because of—all the celebration and veneration that have surrounded the figure of Jesus for centuries, Baigent asserts that Jesus and the circumstances leading to his death have been heavily mythologized.As a religious historian and a leading expert in the field of arcane knowledge, Baigent has unequaled access to hidden archives, secret societies, Masonic records, and the private collections of antiquities traders and their moneyed clients. Using that access to full advantage, Baigent explores the religious and political climate in which Jesus was born and raised, examining not only the conflicts between the Romans and the Jews, but the strife within the different factions of the Jewish Zealot movement. He chronicles the migrations of Jesus's family, his subsequent exposure to other cultures, and the events, teachings, and influences that were most likely to have shaped his early years. Baigent also uncovers the inconsistencies and biases in the accounts of the major historians of Jesus's time, including Josephus, Pliny, and Tacitus. The enduring influence of these accounts in forming our most common conceptions of Jesus reveals that spin is not a new phenomenon.Taking us back to sites that over the last twenty years he has meticulously explored, studied, and in some instances excavated for the first time, Baigent provides a detailed account of his groundbreaking discoveries, including many never-before-seen photos. The evidence he has uncovered has lead him to make shocking new assertions that threaten the conventional account of Jesus's life and death and shake the very foundation of Western thought, based as it is upon the assumption of Jesus's divinity. Ultimately, his investigation raises the hope that we may gain a new understanding of Jesus.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Harper Collins",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Handbook for Butterfly Watchers",
        "Authors": "By Pyle, Robert Michael and Hughes, Sarah Anne (ILT)",
        "Description": "Where to find butterflies; how to observe them and photograph them; their behavior, biology, ecology, and life histories; butterfly gardening; butterfly rearing; identification; and conservation. Beautifully written and beautifully illustrated (drawings by Sarah Anne Hughes). Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Nature , Animals , Butterflies & Moths",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Disney's Doug Chronicles: The Funnie Family Vacation - Book #10",
        "Authors": "By Ryan, Pam Munoz, Krulik, Nancy E., Jinkins, Jim, Presing, William (ILT), and Curanaj, Tony (ILT)",
        "Description": "Doug's disappointment over missing Beebe's party to go on a week-long camping trip with his family is short-lived when he realizes that hanging out with is family is not so bad after all. Original. TV tie-in.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Children's Crafts",
        "Authors": "By Sunset Books",
        "Description": "",
        "Category": "",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1976"
        }
    },
    {
        "Title": "Setting Limits: Medical Goals in an Aging Society",
        "Authors": "By Callahan, Daniel",
        "Description": "Examines the problems of providing and paying for health care for the increasing number of elderly Americans and offers controversial solutions to these problems",
        "Category": " Health & Fitness , General",
        "Publisher": "Touchstone Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "The Little Rabbit",
        "Authors": "By Dunn, Judy and Dunn, Phoebe",
        "Description": "Full-color photographs. \"The warm, cuddly world of a real rabbit family is introduced to young readers in enchanting photographs.\"--Children's Books of the Year, Child Study Assn.",
        "Category": " Juvenile Fiction , Animals , Rabbits",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1980"
        }
    },
    {
        "Title": "Horse&Pony Breeds - Complete Handbook",
        "Authors": "By Bell, Davis & McBane, Bell, Davis & McBane",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes&Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Exploring Your Solar System (Books for World Explorers)",
        "Authors": "By Rathbun, Elizabeth",
        "Description": "Presents a guided tour of the nine planets within the solar system and discusses the Milky Way Galaxy, comets, and the search for extraterrestrial intelligence",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Random House Childrens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "True Love: Stories",
        "Authors": "By Fulghum, Robert (EDT)",
        "Description": "In his third book, Uh-Oh, Robert Fulghum shared some short and somewhat unconventional love stories from his own experiences and casually suggested that if readers had their own tales to tell, he would love to hear them. To his surprise, his mailbox was soon stuffed with thousands of real-life love stories sent to him by his devoted fans. He used his nationally syndicated newspaper column to solicit additional material, and he also sat in a coffee shop in Seattle with a sign that read, Tell me a short love story and I will buy you coffee and make you famous. True Love is the result of the incredible response he received. These stories, specially chosen by Fulghum to reflect the many faces of love, are amusing, sentimental, and sometimes gritty - and bound to touch the hearts of all.There's the story of a woman who marries her mother's high school flame, a man who learns that \"old love\" and new pajamas are a dangerous mix, a man who miraculously reunites with his first love (after twenty years of separation) on an L.A. freeway, a husband's love for his wife after her disabling stroke, a fourteen-year-old's philosophy of looking for love on the boardwalk, and a smile shared at a stoplight.",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Winning the Future: A 21st Century Contract with America",
        "Authors": "By Gingrich, Newt",
        "Description": "According to former House Speaker Newt Gingrich, America currently faces five threats that could undermine, if not eliminate, the United States if immediate steps are not taken to correct them. The threats as he sees them are Islamic terrorists and rogue dictatorships armed with nuclear or biological weapons; the removal of God from American public life; a loss of patriotism and sense of America's history; a decline in economic supremacy because of poor science and math education; and the increasing budgetary burden of Social Security and Medicare. To tackle these problems, Gingrich offers his \"21st Century Contract with America,\" which he outlines in great detail in this bold and thought-provoking book. His updated contract, which comes a decade after the original Republican Contract with America that marked the high point of Gingrich's national power, calls for a dramatically simplified tax code that favors savings and investment; government investment in science and technology, particularly regarding space, energy, and the environment; transforming Social Security into personal savings accounts; overhauling the civil justice system to reduce the burden of lawsuits; and updating the federal government, including the privatization of some functions, so that it moves at the speed and effectiveness of the information age. And that's just the beginning. He also calls for tripling the size of America's intelligence community, reforming its election system, developing a more intelligent health care system that creates jobs and increases quality of life, and balancing the federal budget.Gingrich believes that this ambitious agenda can be accomplished, but only if it receives grassroots support. The entrenched political system, with its lobbyists, bloated bureaucracies, and the complicity of the media, is too self-serving to fix itself, he stresses. Concise and clearly presented, Winning the Future is long on specifics and short on rhetoric, and it succeeds as a springboard for political discourse. Gingrich's aim is clearly to inspire citizens to take responsibility for the county's direction by demanding more of their government and their leaders.",
        "Category": " Political Science , Political Process , Political Parties",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Maybe a Miracle: A Novel",
        "Authors": "By Strause, Brian",
        "Description": "In this disarming debut, Brian Strause has written a vastly entertaining novel about an American family transfixed by a series of mysterious events. From a comfortable suburb of Columbus, Ohio, emerges a story of rebellion, faith and hope, bridging the cultural gap between those who believe in miracles and those who wish they could.Monroe Anderson–as quiet on the outside as he is sardonic and alive on the inside–has spent most of his eighteen years trying to fly beneath the radar. If he can remain invisible, he believes, his sadistic older brother, a rising golf star, might not torment him, his workaholic father, a renowned litigator, might not notice him long enough to be disappointed, and his mother might not have to struggle so hard to find a hopeful word. The only people who glimpse the real Monroe are his girlfriend, Emily, and his eleven-year-old sister, Annika. On the night of his senior prom, Monroe finds Annika floating facedown in the family pool. He dives in and rescues her, but not quickly enough to prevent her from slipping into a coma. As the family copes with this crisis, Monroe’s mother turns to religion, his father turns to liquor, and Monroe himself must decide what’s worth believing in, what’s worth fighting for, and, finally, who he wants to be.By turns humorous and heartbreaking, personal and sweeping, familiar and extraordinary, Brian Strause’s mesmerizing novel takes readers on an unforgettable emotional journey into America’s heartland.",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Symbols of Catholicism",
        "Authors": "By Le Gall, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Vast Right-Wing Conspiracy's Dossier on Hillary Clinton",
        "Authors": "By Carpenter, Amanda B.",
        "Description": "She is the darling of the Manhattan elite, the hope of the national Democratic Party, the MVP of the pro-choice feminist movement, the rock star of the Hollywood Left, and the favorite of the liberal media.Luckily, over here at the Vast Right-Wing Conspiracy, we've been keeping a file on her.Written in the style and format of the New York Times bestseller The Official Handbook of the Vast Right-Wing Conspiracy, this expose is full of fresh reporting, devastating quotes, scandalous stories, funny sidebars, and forgotten but telling incidents from Hillary Clinton's past.",
        "Category": " Political Science , American Government , General",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Landscape Turned Red: The Battle of Antietam",
        "Authors": "By Sears, Stephen W.",
        "Description": "The death count from the Battle of Antietam was the largest of any single battle in American history. Landscape Turned Red, winner of the Fletcher Platt Award for best non-fiction book about the American Civil War, is the definitive work on this bitter battle. Sears bases his account on diaries, dispatches, and letters to recreate a vivid drama.",
        "Category": " History , United States , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Kida: The Heart of Atlantis",
        "Authors": "By M. L. Dunham",
        "Description": "",
        "Category": "",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Never Mind: Inspiring Words for Life's Difficult Moments",
        "Authors": "By Burns, Tom (EDT)",
        "Description": "A great pick-me-up, Never Mind  presents a collection of amusing animal photos and inspirational thoughts to cheer the disheartened and bring smiles to sad faces. A typical example shows a languid polar bear who appears to be marooned on an iceberg. The accompanying caption reads, \"If you were happy every day of your life you wouldn't be a human being, you would be a game show host.\"  A photograph accompanied by an appropriate comment appears on every two-page spread of this appealing gift book.",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Rottweiler",
        "Authors": "By Rendell, Ruth",
        "Description": "The first young woman murdered had a bite mark on her neck, prompting the media to dub her killer \"The Rottweiler.\" As the number of killings grows to two, three, and beyond, that nickname sticks, even though it has become clear that the original bite was incidental. The Rottweiler is a serial garroter, distinguished by his habit of taking a small trinket from each victim as a macabre souvenir.The strangled young women all lived in the same ethnically diverse London neighborhood near Lisson Grove, so it is here that the police focus their investigation. Soon their suspicions lead them to an antiques shop, where items taken from the victims start turning up amid the clutter. As we get acquainted with the odd assortment of characters who work in and pass through the shop, we sense that one of them will be the Rottweiler's next victim... unless the meticulous killer makes an uncharacteristic mistake.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Aunt Dimity Takes a Holiday",
        "Authors": "By Atherton, Nancy",
        "Description": "When Lori Shepherd's husband, Bill, is summoned to the reading of a will at the resplendent country estate of Earl Elstyn, Lori jumps at the chance to come along. She didn't expect, however, to find herself entangled in a messy - and dangerous - family dispute. The aristocratic earl has called together the entire Elstyn family to disclose the beneficiaries of his fortune, and all present will be affected. When Bill and Lori arrive at Hailesham, the earl's grand Palladian country house, they find that a beautiful dove-shaped topiary on the grounds is ablaze. Is this an extravagant welcoming gesture or the work of an arsonist? Later, a classic poison-pen note appears: Watch the birdie. It could happen to you. Leave Hailesham or it will. Someone has a grudge against the Elstyns and will stop at nothing to get revenge. The burning topiary, a suspicious maid, family secrets, and threatening notes lead Lori to seek her phantom Aunt Dimity's help in identifying the culprit before he or she can torch the whole house - with the guests in it. Atherton's signature whimsy and splendidly original twists make for yet one more delicious adventure with cozy-mystery lovers' favorite supernatural sleuth.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    }
]