[
    {
        "Title": "the coming struggle for peace",
        "Authors": "By Visson, Andre",
        "Description": "",
        "Category": "",
        "Publisher": "Viking Press",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1944"
        }
    },
    {
        "Title": "Multiple regression in behavioral research",
        "Authors": "By Kerlinger, Fred N.",
        "Description": "",
        "Category": "",
        "Publisher": "HOLT, RINEHART AND WINSTON",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "The Manhunters",
        "Authors": "By DEELEY, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "McCall",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Peer-to-Peer : Harnessing the Power of Disruptive Technologies",
        "Authors": "By Oram, Andrew (EDT)",
        "Description": "The term \"peer-to-peer\" has come to be applied to networks that expect end users to contribute their own files, computing time, or other resources to some shared project. Even more interesting than the systems' technical underpinnings are their socially disruptive potential: in various ways they return content, choice, and control to ordinary users.While this book is mostly about the technical promise of peer-to-peer, we also talk about its exciting social promise. Communities have been forming on the Internet for a long time, but they have been limited by the flat interactive qualities of email and Network newsgroups. People can exchange recommendations and ideas over these media, but have great difficulty commenting on each other's postings, structuring information, performing searches, or creating summaries. If tools provided ways to organize information intelligently, and if each person could serve up his or her own data and retrieve others' data, the possibilities for collaboration would take off. Peer-to-peer technologies along with metadata could enhance almost any group of people who share an interest--technical, cultural, political, medical, you name it.This book presents the goals that drive the developers of the best-known peer-to-peer systems, the problems they've faced, and the technical solutions they've found. Learn here the essentials of peer-to-peer from leaders of the field:Nelson Minar and Marc Hedlund of target=\"new\">Popular Power, on a history of peer-to-peerClay Shirky of acceleratorgroup, on where peer-to-peer is likely to be headedTim O'Reilly of O'Reilly & Associates, on redefining the public's perceptionsDan Bricklin, cocreator of Visicalc, on harvesting information from end-usersDavid Anderson of SETI@home, on how SETI@Home created the world's largest computerJeremie Miller of Jabber, on the Internet as a collection of conversationsGene Kan of Gnutella and GoneSilent.com, on lessons from Gnutella for peer-to-peer technologiesAdam Langley of Freenet, on Freenet's present and upcoming architectureAlan Brown of Red Rover, on a deliberately low-tech content distribution systemMarc Waldman, Lorrie Cranor, and Avi Rubin ofAT&T Labs, on thePublius project and trust in distributed systemsRoger Dingledine, Michael J. Freedman, andDavid Molnar ofFree Haven, on resource allocation and accountability in distributed systemsRael Dornfest of O'Reilly Network andDan Brickley of ILRT/RDF Web, on metadataTheodore Hong of Freenet, on performanceRichard Lethin on how reputation can be built onlineJon Udell 9781632940667//Deadworld is the long running horror series and this self contained graphic novel provides a great introduction to the overall story as each page features a scene or character with an accompanying narration that tells the tales of all those who live, died, and came back during the supernatural holocaust. Writer Gary Reed is joined by 47 different artists to bring forth this unique look at one of the longest running series in independent comics. Deadworld has been recently nominated for various awards including the Shel Dorf Fan Awards, Comic Monsters, and the Ghastlies. If you haven't read Deadworld yet, this is a fantastic entry to get a feel for the world of the dead...and if you're already a Deadworld reader, what a great way to keep up to date with a few reminders thrown in.9781632940674//The very first issue of Deadworld! A group of teens hide out in a school bus trying to find out what happened and how it has become a world of zombies. The initial group consists of John and his younger brother, Joey. Two friends who are known for their stance on anti-authority and suspected of being dope pushers, Mickey and Dan. Mike, who is the self-appointed leader and his girlfriend, Chris, and Donna who has fallen for Dan. The group tries to figure out what they should do and accumulate supplies. They decide to leave the Baton Rouge area and head west, towards California. But when they meet intelligent zombies, they realize that perhaps, the trek won't be as easy as they thought.9781632940681//The group is on the run in their bus, only to find themselves out of gas. Dan and Mike head off to a small town to gather supplies, leaving the rest of the group. They come across Deake who is running through the woods, plagued by visions. Little is known yet about him, except that he is \"the only one\" left. John recovers as Mike and Dan find themselves trapped in the town of Slaughter. They manage to fight their way out, stealing a truck to head back towards their companions. Unknown to them, King Zombie is on their trail.9781632940698//The teens barely manage to survive an attack while driving through a small city and lose most of their supplies. The bus is deemed unacceptable for our group and when they come across a riverboat on the Mississippi River, they figure it would be safer to be on the water, away from the zombies. Once on the boat, they figure they're safe. They do not realize that King Zombie is leading a massive army of zombies toward the boat and something like water is not going to stop him.9781632940704//The attack begins and most of the group is holed up. To their horror, they find out that young Joey is elsewhere and John has a confrontation with Mike. No one will try to rescue Joey...he has to survive on his own. After hearing screams from Joey, the group decides to split up and find him. They also find out that Dan is gone. The group decides to torch the boat, burning up all of the zombies on board. But two of the teens won't make it.9781632940711//A gateway opens in the sky and from there, come five hideous creatures. Four arms and built for power and speed, these are the Grakken...and they are pure killing machines. The group, camping in the wilderness, is surprised as Deake crashes their camp. Deake fills them in with what he knows. He explains that he has the power to close the gateway and end the zombie menace. The teens come across a family living in a secluded house. Things appear safe...for the moment.9781632940728//King Zombie discovers the whereabouts of the teens and unleashes his demon creatures to retrieve Deake and kill everyone else. Dan, thought dead, arrives on the scene just in time to save as many of the group as he can. But King Zombie has captured Deake and now instructs him to open the portal to the other dimension so the Earth can finally be consumed.9781632940735//The group, now with Dan more in charge, decide to leave. The family stays behind. King Zombie soon discovers that Deake has trouble completing the spell as he doesn't have the necessary books. Dan informs the group that he seems to have some kind of sensory perception towards zombies. The others are doubtful until Dan leads them to where the gate opening is going to occur. Dan stays there as Deake begins the ritual. Dan realizes that he can't save Deake, so he has to kill him to prevent the gate opening. Dan misses his opportunity and is surrounded by zombies.9781632940742//The group is discovered by a helicopter and there are ecstatic that they can now rejoin a civilized force. While on the copter, Dan overhears what the real situation is...they have been rescued only to become \"zombie chow.\" Too late and the group now realize the fate in store for them. Punk and Eddie are two of Bowker's men and they escort the group to the \"layaway\", a holding compound full of prisoners. Inside the dark warehouse, the group discovers some of the family they have left earlier is there...Betty and Julie. The grandfather and father are both dead.9781632940759//Betty explains what happened and how they were captured. She informs them how some of the people are taken away from the compound and never seen again. A strange character that eats bugs attaches himself to the group, and he is known as Percy. Bowker, Punk, and Eddie join Moloch in a special rendezvous to see for themselves the area where the gate opening ritual was held. Mike is with them. The helicopter has a battle with a group of zombies led by King Zombie and Moloch declares that he wants King Zombie captured...alive.9781632940766//Mike is being tortured by hanging upside down from the helicopter over the zombies. Moloch wants answers to what Mike knows but Mike doesn't know what else to tell him. In the prison camp Wolverine continues to tear up the zombies and demands a tougher challenge. Dan and John find a way out of the warehouse via an air duct. As King Zombie watches the helicopter, he is also trailing Deake's footprints. He is stunned when the footprints suddenly disappear. And unfortunately two of our fa9781622821761\\\\Keeping a faithful prayer life with your family isn't easy. From herding distracted children to managing the seemingly endless litany of prayers and devotions, our spiritual life all too often feels frantic and burdensome.This isn't the way it should be. Our prayer life, our family life, and our work life should — and can! — be in harmony. When they are, our family is a powerhouse of grace, and Our Lord transforms our home into a little Eden — a little bit of heaven on earth.With simplicity and holy wisdom, authors David Clayton and Leila Marie Lawler show you how to bring peace to your home by integrating your family into the calm, truly joyful way of Mother Church. Her feasts and seasons, prayers and devotions are gifts that draw us closer to God and unfold before us His marvelous plan of salvation.To help you live the liturgical life of the Church more fully, David and Leila reclaim here an almost lost tradition that families used for centuries to build a beautiful bridge between home and church: the little oratory.Consisting of a modest table and icons, the little oratory is a visible sign of spiritual awareness and devotion. It extends the Eucharistic worship of the Mass into the heart of your home, spiritually nourishing your family and preparing them to transform the world through prayer and charity.Building your own little oratory is simple, and in these pages you'll discover just how easy it is. In fact, you likely have most of the pieces in your home already except, perhaps, the sacred art. That's why we've included here seven full-colored icons that are ready for framing, enabling you to get started right away!By following the wise advice in this book, you'll discover the peace and love that flows from a home that is focused on Christ. You'll also learn . . .How to use sacred art to strengthen your prayer life. How to extend Catholic beliefs and devotions into every room of the house. Why the Liturgy of the Hours is important and how it can make your family holy.How to pray the Rosary with children and keep the rowdiest of them calm and reverent.The active role children can and should play in the prayer life of the family.What to do when only one parent takes the spiritual life seriously. How to overcome the feeling that you're too busy to pray. Practical ways to extend the liturgical life into your workplace. And countless other tips to help you practice your faith in the heart of your home.Scott Hahn\"This is one of the most beautiful books I've ever seen. How I wish I'd had it when I first became a Catholic, not just for myself, as a husband and father, but for my family, too. If one book has the potential to transform the Catholic family (and society), this is it.\".Thomas Howard\"This book is a rare treasure.\"Christopher West\"A superb guide to making that?encounter of thirsts a lived experience in the home.\"Daria Sockey, author of The Everyday Catholic's Guide to the Liturgy of the Hours\"The Little Oratory will help you discover a pattern of daily prayer that truly fits your family life while creating a place of beauty in the heart of your home.\"Andreas Widmer, author of The Pope and the CEO\"An indispensable resource for anyone seeking?to make their home a breeding ground for holiness.\"Elizabeth Foss, Founder, In the Heart of My Home \"Leila Lawler and David Clayton offer wisdom and grace?to Catholics seeking to make their homes a holy shelter.\"Joseph Pearce, editor of St. Austin Review\"Wonderful, inspiring, and deeply practical.Stratford Caldecott, an editor of Magnificat UKA great blessing to Catholic families.\"Father Robert Reed, President, CatholicTV Network \"A perfect guide for any family who strives to make their home a?place to experience the majesty and beauty of the Divine.\"",
        "Category": " Computers , Networking , General",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "You Read to Me & I'll Read to You: Stories to Share from the 20th Century",
        "Authors": "By Schulman, Janet",
        "Description": "A bright and irresistible invitation to reading, You Read to Me & I’ll Read to You will inspire a love of reading—and reading aloud—in children and parents alike.Compiled by Janet Schulman, editor of the bestselling The 20th-Century Children’s Book Treasury, this anthology is full of stories from both renowned classic children’s book creators and dazzling newer voices in children’s literature. Each of the 26 selections features original illustrations and complete text from such illustrious authors and artists as Maurice Sendak, James Marshall, Judy Blume, Ursula Le Guin, William Steig, and Roald Dahl.From picture books to short novels, from the poignant to the magical to the just plain silly, these stories have been carefully chosen for broad appeal, accessibility, and high literary quality, makingYou Read to Me & I’ll Read to You a must-have book for all families who want to inspire their children to develop a lifelong love of reading.",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Life: Our Century In Pictures",
        "Authors": "By Stolley, Richard B. (EDT) and Chiu, Tony (EDT)",
        "Description": "More than five hundred full-color and black-and-white images, selected from the photographic archives of LIFE and other collections, chronicle the history of the twentieth century through the people and events that transformed the modern era. 100,000 first printing. $500,000 ad/promo.",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "Bulfinch",
        "Price Starting With ($)": "9.94",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Baby Bear's Treasury: Twenty-Five Stories for the Very, Very Young",
        "Authors": "By Various",
        "Description": "A very special collection of stories, poems, pictures, songs, and general nonsense includes work by favorites such as Lucy Cousins and Helen Oxenbury, offering twenty-five selections sure to appeal to the very young.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Gary Nulls Ultimate Anti Aging Program",
        "Authors": "By Null, Gary",
        "Description": "",
        "Category": "",
        "Publisher": "Kensington Books",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Healthy Crockery Cookery",
        "Authors": "By Mable Hoffman",
        "Description": "",
        "Category": "",
        "Publisher": "HP",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Menopause Manager: A Safe Path for a Natural Change",
        "Authors": "By Mayo, Mary Ann and Mayo, Joseph L.",
        "Description": "A woman's guide to surviving menopause shows women how to manage this difficult transition, covering medical options, psychological health, risk factors, and much more. Original.",
        "Category": " Medical , Gynecology & Obstetrics",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Disney's Family Story Collection--75 Fables for Living, Loving, & Learning",
        "Authors": "By Various",
        "Description": "",
        "Category": "",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "6.78",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Rococo to Cubism in Art and Literature",
        "Authors": "By Wylie Sypher",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Max Danger, the Adventures of an Expat in Tokyo (Tut Books)",
        "Authors": "By Collins, Robert J",
        "Description": "",
        "Category": " Literary Collections , General",
        "Publisher": "Tuttle Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "National Geographic's Ultimate Adventure Sourcebook (NG's Greatest Photographs)",
        "Authors": "By McMenamin, Paul",
        "Description": "From floating above Burgundy in a hot-air balloon to cycling through the jungle and citrus orchards of the Vaca Plateau in Belize, seasoned traveler Paul McMenamin has scouted out the ultimate experiences in 25 categories of adventure worldwide. In the Ultimate Adventure Sourcebook, he clues you in to these thrilling destinations. The book describes each travel adventure in detail -- then tells you how to get there, which company to sign on with, and what you'll need in the way of gear and lore before you go.  * Profiles the top outfitters and guides in each sport. * Tells how to get into activities you've always wanted to try, such as caving, sea kayaking, and skydiving. * Provides maps to starter peaks in North America, dive sites in the Caribbean, trekking in the Himalaya, rafting, snowboarding, sailing, & more. * Highlights extreme sports such as skysurfing, waterfall running, bungee jumping, free climbing, kite surfing, shark diving, and BASE jumping. Lists websites, magazines, books, videos, and clubs devoted to ultimate adventures of all kinds.",
        "Category": " Travel , Special Interest , Adventure",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Acorna's Quest",
        "Authors": "By McCaffrey, Anne and Ball, Margaret",
        "Description": "In the first  volume of the Acorna series, the infant Acorna was secretly set adrift in a lifepod in an attempt by her parents to save her from the Khlevii who have attacked their spaceship.  She was rescued and raised by asteroid miners, growing at an astonishing pace into a young woman with coveted talents and genius. In Acorna's Quest, Acorna travels  across deep space in search for her long-lost planet and people.  What she doesn't know is that her people have come to her section of the galaxy with a dire warning that the Khlevii war fleet has targeted human space as it's next conquest.\"Acorna has the same atmosphere as the Pern books while having a very appealing and intriguing focus in the character of the unicorn girl.  Hope to see more of this story.\"- Baryon",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Harper Voyager",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Dragonseye (Dragonriders of Pern Series)",
        "Authors": "By McCaffrey, Anne",
        "Description": "Another episode in the author's perennially popular series, the Dragonriders of Pern, finds Weyrs and Holds struggling to ward off the second coming of the Red Star and the deadly silver Thread with dwindling technology.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "4.93",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Lonely Crowd",
        "Authors": "By Glazer, Nathan, Riesman, David, and DENNEY, Reuel.",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday Anchor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1953"
        }
    },
    {
        "Title": "Besieged (Skye's Legacy, #3)",
        "Authors": "By Small, Bertrice",
        "Description": "Traveling to Ulster to consider marriage to a wealthy Protestant, Fortune Lindley instead falls for the man's brother, the rebellious and disinherited Catholic. Original.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Made from Scratch: Reclaiming the Pleasures of the American Hearth",
        "Authors": "By Zimmerman, Jean",
        "Description": "In this stunning celebration and reappraisal of the importance of \"women's work,\" acclaimed journalist Jean Zimmerman poignantly addresses the tug that many Americans of the twenty-first century feel between our professional and private lives. With sharp wit and intelligence, she offers evidence that in the current domestic vacuum, we still long for a richer home life -- a paradox visible in the Martha Stewart phenomenon, in the continuing popularity of women's service magazines such as Better Homes and Gardens, Family Circle, and Ladies' Home Journal -- whose combined circulation of over 17 million is nearly twice the combined circulation of Time, Newsweek, and U.S. News & World Report -- and the booming business of restorations, where onlookers get a hands-on view of domestic life as it flourished in past centuries. This book is about the ways home traditions passed from one generation to the next -- baking a birthday cake from scratch, cherishing family heirlooms, or discovering the satisfaction of piecing a quilt -- sustain our souls, especially in our ever more processed, synthetic world, where we buy \"homemade\" goods and fail to see the irony in that.  Made from Scratch tells the story of the unsung heroines of the hearth, investigating the history of female domesticity and charting its cultural changes over centuries. Zimmerman traces the lives of her own family's homemakers -- from her tiny but indomitable grandmother, who managed a farm, strangled chickens with her bare hands, and sewed all the family clothing, to her mother, who rejected her country upbringing yet kept a fastidious suburban home where the gender divide stayed firmly in place, to her own experiences as a wife and mother weaned on the Women's Movement of the 1970s, with its emphatic view that housework was a dirty word and that the domestic sphere was to be fled rather than cherished. In this book Zimmerman questions the unexamined trade-off we have made in a shockingly brief time span, as we've \"progressed\" from home-raised chickens to frozen TV dinners to McNuggets from the food court at the mall. What is lost when we no longer engage, as individuals and as a community, in the ancient rituals of food, craft, and",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Zoo: The Modern Ark",
        "Authors": "By Page, Jake and Maier, Franz",
        "Description": "An account of the development of zoos from royal menageries to centers for the breeding of endangered species, and an account of the problems and techniques that that goal entails,  is interspersed with photographs of animals from different regions",
        "Category": " Science , General",
        "Publisher": "Facts on File",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Earth's Amazing Animals",
        "Authors": "By Allen, Thomas B.",
        "Description": "",
        "Category": "",
        "Publisher": "Natl Wildlife Federation",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "The Island Civilizations of Polynesia",
        "Authors": "By Suggs, Robert C.",
        "Description": "",
        "Category": "",
        "Publisher": "New American Library/Mentor Books",
        "Price Starting With ($)": "9.38",
        "Publish Date": {
            "Month": "October",
            "Year": "1960"
        }
    },
    {
        "Title": "Italian at a Glance: Phrase Book & Dictionary for Travelers (Barron's Languages at a Glance)",
        "Authors": "By Wald, Heywood, Costantino, Mario, and Constantino, Mario",
        "Description": "",
        "Category": "",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "German at a Glance: Phrase Book & Dictionary for Travelers (Barron's Languages at a Glance) (English and German Edition)",
        "Authors": "By Strutz, Henry",
        "Description": "",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "B E S Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Blowout (FBI Thriller)",
        "Authors": "By Coulter, Catherine",
        "Description": "Summoned back from a weekend trip when a prominent judge is murdered the night before a controversial death-penalty case, FBI agents Dillon Savich and Lacey Sherlock tackle a case during which numerous Washington power brokers are targeted. Reprint.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Jove Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Childrens Encyclopedia of the Animal Kingdom",
        "Authors": "By Bateman",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.75",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Celebrity Family Tree: The World's Most Celebrated and Scandalous Dynasties",
        "Authors": "By ed-wright",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Living Dead in Dallas (Sookie Stackhouse/True Blood, Book 2)",
        "Authors": "By Harris, Charlaine",
        "Description": "The second novel in #1 New York Times bestselling author Charlaine Harris’s “addictively entertaining”(Locus) Sookie Stackhouse series.Even though Sookie has her own vampire to look out for her—her red-hot, cold-blooded boyfriend, Bill Compton—she has to admit that the bloodsuckers did save her life. So when one of the local Undead asks the cocktail waitress for a favor, she feels like she owes them.Soon, Sookie’s in Dallas using her telepathic skills to search for a missing vampire. She’s supposed to interview certain humans involved. There’s just one condition: The vampires must promise to behave—and let the humans go unharmed. Easier said than done. All it takes is one delicious blonde and one small mistake for things to turn deadly...",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Hunting With the Moon: The Lions of Savuti",
        "Authors": "By Joubert, Beverly (PHT) and Joubert, Dereck",
        "Description": "Dereck and Beverly Joubert have lived among lions for most of their adult lives. Few people anywhere are on such intimate terms with these awe-inspiring creatures, and fewer still are the naturalists who can claim to have seen, let alone shared, their nocturnal forays. For unlike their East African cousins, the great cats of Savuti, a remarkable natural enclave just north of Botswana's Okavango Delta, do almost all of their stalking and killing at night when the moon is just a sliver in the sky.  Over a hundred breathtaking full-color images captured by Beverly Joubert's ever-watchful camera represent not just superb wildlife photography but a priceless record of a little-known natural phenomenon. They create a portrait of the Savuti lions at rest, at play, and on the shadowy hunts that end in a sudden, explosive kill, offering a rare glimpse of the lithe power and ruthless beauty that have mesmerized humans for millennia. Dereck Joubert's detailed and engaging text documents years of observation, providing invaluable insight into the biology, behavior, and social structure of an elusive species; at the same time he brings to life the individual animals the Jouberts came to know so well: Maome, the matriarch whose clan played together every evening; Ntchwaidumela, the bold and unflappable male who defied a charging elephant; Sequela, the old exile who returned to spend his last days with his pride, and many more.  Last but by no means least, Hunting With the Moon is a chronicle of human dedication, a deeply personal account of a couple who have devoted their lives to understanding and protecting the magnificent beasts who prowl these pages in all their majestic grace. It's an extraordinary book, filled with stunning images, fascinating facts, and vivid anecdotes -- a once-in-a-lifetime chance to enter the enthralling, unforgettable world of lions in the wild.",
        "Category": " Nature , Animals , Mammals",
        "Publisher": "National Geographic Society",
        "Price Starting With ($)": "6.9",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "A Primer of Freudian Psychology -1962",
        "Authors": "By Calvin S. Hall",
        "Description": "",
        "Category": "",
        "Publisher": "Mentor",
        "Price Starting With ($)": "6.71",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "The Hindu Religious Tradition (The Religious Life of Man)",
        "Authors": "By Hopkins, Thomas",
        "Description": "This book provides a comprehensive survey of Hindu development from the Indus civilization to the present.",
        "Category": " Religion , General",
        "Publisher": "Wadsworth",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Hard Green: Saving The Environment From The Environmentalists: A Conservative Manifesto",
        "Authors": "By Huber, Peter",
        "Description": "This book sets out the case for Hard Green, a conservative environmental agenda. Modern environmentalism, Peter Huber argues, destroys the environment. Captured as it has been by the Soft Green oligarchy of scientists, regulators, and lawyers, modern environmentalism does not conserve forests, oceans, lakes, and streams - it hastens their destruction. For all its scientific pretension, Soft Green is not green at all. Its effects are the opposites of green.This book lays out the alternative: a return to Yellowstone and the National Forests, the original environmentalism of Theodore Roosevelt and the conservation movement. Chapter by chapter, Hard Green takes on the big issues of environmental discourse from scarcity and pollution to efficiency and waste disposal. This is the Hard Green manifesto: Rediscover T.R. Reaffirm the conservationist ethic. Expose the Soft Green fallacy. Reverse the Soft Green agenda. Save the environment from the environmentalists.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Haley's Hints: A Compilation",
        "Authors": "By Haley, Graham, Haley, Rosemary, and McNiven, David (ILT)",
        "Description": "Provides hints on such topics as cleaning, pest control, laundry, sewing, plumbing, carpentry, painting, and gardening",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "3H Productions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Her Name, Titanic",
        "Authors": "By Pellegrino, Charles",
        "Description": "\"NOT EVEN GOD HIMSELF COULD SINK THIS SHIP?On the evening of Sunday, April 14, 1912, the awesome ocean liner Titanic-the majestic queen of the White Star fleet-struck an iceberg and quickly vanished into the frigid blackness of the North Atlantic. Seventy-three years later, a dedicated group of scientists set sail in search of the sunken behemoth-an incredible mission that uncovered shocking secrets buried two miles below the ocean's surface.In Her Name, Titantic, Dr. Charles Pellegrino combines two enthralling adventures in one: re-creating with breathtaking immediacy the terrible night the great ship went down...and offering a riveting, first-hand account of a remarkable expedition-and the miraculous scientific technology-that helped shed astonishing new light on the greatest seagoing disaster of the 20th century.",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "The Philosophy of History in Our Time",
        "Authors": "By Meyerhoff, Hans, Ed.",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday Anchor Book/ Anchor Books/ Doubleday & Company, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "The AIDS Crisis: What We Can Do",
        "Authors": "By Dortzbach, Deborah and Long, W. Meredith",
        "Description": "",
        "Category": " Religion , Christian Ministry , Missions",
        "Publisher": "IVP Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Faith of the First Ladies",
        "Authors": "By MacGregor, Jerry and Prys, Marie",
        "Description": "",
        "Category": " Religion , Prayer",
        "Publisher": "Baker Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "The Essential Grandparent: A Guide to Making a Difference",
        "Authors": "By Carson, Lillian",
        "Description": "Ready or not, you're a grandparent! How did you get here so fast? No one consults you about this new role. It is handed to you without your advice or consent. So now that you're here at this new stage of life, the question before you is, what are you going to make of it?This book will help you find your answer and assist you in developing a plan for your grandparenting. It will dispel the myths and \"tell it like it is.\" You'll learn that other grandparents feel just as you do. It will guide you to become aware of the possibilities, encourage you to trust your intuition, and teach you how to set goals so that you can make the most of this essential role. Just as babies don't come with instructions for parents, they certainly don't come with instructions for grandparents!The joys of grandparenting are available to all. It's healthy for us, the older generation, to nurture the young. It is our natural task to influence the future in this way. There are no requirements for a grandparent to be of a certain color, educational level, lifestyle or economic class. However, just loving our children and grandchildren is not enough. The joy comes from  our ingenuity, energy and determination to provide stability and purpose. It is ours for the doing.",
        "Category": " Family & Relationships , Parenting , Grandparenting",
        "Publisher": "HCI",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Circle of Women: An Anthology of Contemporary Western Women Writers",
        "Authors": "By Barnes, Kim (EDT) and Blew, Mary Clearman (EDT)",
        "Description": "A collection of stories, poems, and essays includes works by Tess Gallagher, Marilynne Robinson, Pam Houston, and Terry Tempest Williams",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "African Laughter: Four Visits to Zimbabwe",
        "Authors": "By Lessing, Doris May",
        "Description": "A highly personal story about returning to her African roots by the eminent British writer, African Laughter is also a rich and penetrating portrait of Doris Lessing's homeland. In it she recounts the visits she made to Zimbabwe in 1982, 1988, 1989 and 1992, after being exiled from the old Southern Rhodesia for twenty-five years for her opposition to the white minority government.The visits constitute an unforgettable journey to the heart of a country whose history, landscape, people and spirit are evoked by Lessing in a dazzling narrative of vivid detail and poignant scenes. Swooping from the verandahs to the grass roots and back again, noting the kinds of changes that can be appreciated only by one who has lived there before, Lessing embraces every facet of life in Zimbabwe from the lost animals of the bush to political corruption, from AIDS to a successful communal enterprise created by poor rural blacks. She talks with white farmers and black storytellers, reflecting on the easy mix of races in Zimbabwe today, in contrast with the racism of the past. She admires the new role of women in bringing about revolutionary social change.African Laughter is a book about memory. Lessing evokes her childhood on an isolated farm in the bush, her parents and brother. And she explores the often unexpected ways in which elements of the past - African traditions and white customs - survive and knit themselves into contemporary life.A passionate, profound and utterly original book, African Laughter uses memory and reminiscence together with recent experience to create an impressionistic picture of a country in the process of energetic change.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The Power of Positive Thinking",
        "Authors": "By Peale, N",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "7.68",
        "Publish Date": {
            "Month": "April",
            "Year": "1981"
        }
    },
    {
        "Title": "Always By My Side: A Father's Grace and a Sports Journey Unlike Any Other",
        "Authors": "By Nantz, Jim",
        "Description": "A top commentator describes his career as a reflection of some of America's most memorable sports events while paying tribute to the broadcast industry's forefront contributors, in an account that also commemorates the inspiring life of his Alzheimer's patient father.",
        "Category": " Sports & Recreation , General",
        "Publisher": "Gotham Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Wines And Spirits",
        "Authors": "By L. W. MARRISON",
        "Description": "",
        "Category": "",
        "Publisher": "Pelican",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1958"
        }
    },
    {
        "Title": "My first golden dictionary (Big golden book)",
        "Authors": "By Reed, Mary",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "6.8",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "How to Start a Home-Based Interior Design Business, 3rd (Home-Based Business Series)",
        "Authors": "By Dewalt, Suzanne",
        "Description": "Completely revised and updated, this guide includes the author's experiences and advice on every aspect of setting up and running a thriving home-based interior design business. It covers everything from developing a business plan and estimating start-up costs to pricing the services and staying profitable once in business.",
        "Category": " Business & Economics , Home-Based Businesses",
        "Publisher": "Globe Pequot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Count Me Gone",
        "Authors": "By Annabel Johnson",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books; Archway",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Realm of the Incas",
        "Authors": "By Victor W. Von Hagen",
        "Description": "",
        "Category": "",
        "Publisher": "Mentor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "The uneasy world (Premier Americana)",
        "Authors": "By Angle, Paul M.",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "The Seductive One (The Marcelli Sisters of Pleasure Road, Book 3)",
        "Authors": "By Mallery, Susan",
        "Description": "For the Marcelli sisters of California wine country, the season is ripe for romance!  Of all the Marcelli sisters, the one who dreams of running the family's winery is Brenna -- and she's about to get her chance. But taking the helm at Marcelli Winery is tougher than she bargained for -- especially when she butts heads with her grandfather, whose Old World ways dictate that a male should inherit the business. In need of some fast capital in order to prove her grandfather wrong, Brenna turns to Nic Giovanni, her family's nemesis....Years ago, she ended her secret relationship with Nic, choosing loyalty to her family over the hot passion they shared. But now he's back in her life, he's loaned her a million dollars, and their feelings for each other are stronger than ever. Brenna must find out for herself: is Nic the love of her life? Or the schemer who could topple the Marcelli dynasty -- and break her heart?  Meet three unforgettable sisters in a wonderful trilogy that's vintage Susan Mallery -- warm, witty, and stunningly sensual. Look for The Sparkling One and The Sassy One, available from Pocket Star Books!",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Of men and numbers (A Laurel men-of-science edition)",
        "Authors": "By Muir, Jane:",
        "Description": "",
        "Category": "",
        "Publisher": "Dell Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "A Miscellany of Parents' Wisdom",
        "Authors": "By Grunfeld, Nina",
        "Description": "Collects wisdom--ancient and modern, serious and amusing--about the challenges of bringing up children",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Divorce Among the Gulls: An Uncommon Look at Human Nature",
        "Authors": "By Jordan, William",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Perennial",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "This Land Is Your Land: A Guide to North America's Endangered Ecosystems",
        "Authors": "By Naar, Jon",
        "Description": "Discusses the individual ecosystems of the United States and demonstrates how they are all interconnected, revealing the state of these biospheres, what is being done to save them, and what each of us can do. Simultaneous.",
        "Category": " Business & Economics , General",
        "Publisher": "Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "No Excuse! Incorporating Core Values, Accountability, and Balance into Your Life and Career",
        "Authors": "By Rifenbary, Jay, Markowski, Mike, and Markowski, Marjie",
        "Description": "",
        "Category": " Self-help , General",
        "Publisher": "Possibility Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2014"
        }
    },
    {
        "Title": "World of Wildlife",
        "Authors": "By Nayman, Anthony, Jacqueline, and Nayman, Jacqueline",
        "Description": "Over 350 photographs of animals and their habitats are divided into sections based on six generally accepted zoogeographical regions in a survey of the world's climatic and zoological diversity",
        "Category": " Science , General",
        "Publisher": "Facts on File",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "History Lesson for Girls",
        "Authors": "By Sheehan, Aurelie",
        "Description": "Everyone remembers age thirteen. For Alison Glass, it was the year she moved to Weston, Connecticut, with her bohemian parents and her horse, Jazz. Back then life was about trying to navigate the hypocrisies of an unfamiliar affluent town and figuring out how she might blend in at school. Shy, observant, and in a back brace for scoliosis, Alison found strength in an unlikely friendship with Kate Hamilton, the charismatic but troubled daughter of an egomaniacal new age guru - the \"sham shaman\" - and his substance-loving wife.The year was 1975. As the sincere but comically misguided \"Women of History\" plan the town's bicentennial celebration (complete with red, white, and blue Porta-Potties), the girls escape into the world of their horses. Seeking refuge from the chaos surrounding them, Alison and Kate ride the trails on the edge of suburbia and make up their own alternate history. Aurelie Sheehan sends us reeling back to our adolescent years, making them feel as real as when we first lived them while deftly revealing their lingering influence on the adults we become. With the clarity of hindsight, Alison looks back on the giddy highs and crushing lows that made her the person she was at thirteen, and the friendship that simply couldn't survive the weight of the shadows under which it was forged.Set against the backdrop of the disturbingly reckless and often hilariously tacky 1970s, History Lessons for Girls is at once an emotional inquest and an elegy for a friendship that meant everything.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Integrated Broadband Networks: An Introduction to Atm-Based Networks (Electronic Systems Engineering Series)",
        "Authors": "By Handel, Rainer and Huber, Manfred N.",
        "Description": "",
        "Category": " Computers , General",
        "Publisher": "Addison-Wesley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "One True Thing: A Novel",
        "Authors": "By Quindlen, Anna",
        "Description": "NEW YORK TIMES BESTSELLER • “[Anna Quindlen] writes passionately . . . painstakingly uncovering all the intensity, suspicion and primitive love that bonds mothers and daughters.”—The Boston Globe   Ellen Gulden is enjoying her career as a successful magazine writer in New York City when she learns that her mother, Kate, is dying of cancer. Ellen’s father insists that she quit her job and return home to become a caregiver. A high-powered career woman, Ellen has never felt she had much in common with her mother, a homemaker and the heart of their family. Yet as Ellen begins to spend time with Kate, she discovers many surprising truths, not only about herself, but also about the woman she thought she knew so well.   Later, when Ellen is accused of the mercy killing of her mother, she must not only defend her own life but make a difficult choice—either accept responsibility for an act she did not commit or divulge the name of the person she believes committed a painful act of love.   Praise for One True Thing   “A triumph.”—San Francisco Chronicle   “We leave One True Thing stimulated and challenged, more thoughtful than when we began.”—Los Angeles Times   “Like a brush with mortality, One True Thing leaves the reader feeling grateful, wide awake, lucky to be alive.”—Michael Chabon   “It calls you back for another read. . . . This is a book of catharsis.”—The Denver Post   “Fiercely compassionate and frank.” —Elle",
        "Category": " Fiction , Literary",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "A Sentimental Education",
        "Authors": "By Oates, Joyce Carol",
        "Description": "A collection of stories exploring the puzzles and potentials of passionate love includes tales of a divorcee's hasty marriage, a rich executive's affair with a wayward girl, and the erotic love between two cousins",
        "Category": "",
        "Publisher": "E P Dutton",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Road to Air America: Breaking the Right Wing Stranglehold on Our Nation's Airwaves",
        "Authors": "By Drobny, Sheldon",
        "Description": "Road to Air America by Sheldon Drobny, is a candid look behind the scenes of the politics, wealth, and news media that inspired Mr. Drobny's vision and nearly derailed his ability to get America's first all liberal talk-radio network going. From his meetings with President Bill Clinton to his hiring of Al Franken as his marquee on-air talent, Drobny has plenty to say about where our nation's government is heading - and why the news media must stop being a slave to its corporate-owned puppeteers.This book shares numerous anecdotes of what its like to be a player in the Democratic Party, including his meetings with Bill Clinton, Al Gore, Hillary Clinton, and presidential candidates John Kerry, Howard Dean and Dick Gephardt.I'm here to show the nay-sayers are wrong, says Drobny. You can launch a radio network successfully despite the challenges to get funding, despite the right-wing media's slanted coverage and despite getting no cooperation from major distributors or station groups. The liberal voice needs to be heard and here it is.",
        "Category": " Political Science , General",
        "Publisher": "SelectBooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Different Drums: A Doctor's Forty Years in Eastern Africa",
        "Authors": "By Wood, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Doorposts",
        "Authors": "By Botts, Timothy R.",
        "Description": "A beautiful, inspiring work blending innovative calligraphy with the expressive language of The Living Bible. Combining his artistic talent with the majesty of Scripture, world-renowned calligrapher Timothy R. Botts has created 60 full-color pieces.",
        "Category": " Bibles , Other Translations , General",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "The World's Banker: A Story of Failed States, Financial Crises, and the Wealth and Poverty of Nations (Council on Foreign Relations Books (Penguin Press))",
        "Authors": "By Mallaby, Sebastian",
        "Description": "Unstoppable force, meet immovable object. Scene: the World Bank, a mighty development kingdom of many fiefs, its ten thousand employees operating in some one hundred countries responsible for tens of billions of dollars in aid to the world's poorest nations. Enter: James Wolfensohn, the smooth global deal maker and power broker of gargantuan appetites who has furiously worked his many connections to become the World Bank's president. Over the course of his dazzling career, Wolfensohn seduced everything in his way-surely the development gurus of the bank would be no different? Even if this wasn't much the crowd for private jets and homes in Jackson Hole, for friendship with European royalty and Harrison Ford, for fencing at the Olympics and playing the cello in Carnegie Hall with Yo-Yo Ma, surely they would see what a noble sacrifice James Wolfensohn had made in walking away from his multimillion-dollar income?  Not exactly. In 1995, Wolfensohn struck the World Bank like a whirlwind, determined to reinvent the institution founded by Franklin Roosevelt and his World War II allies. Never has the World Bank's work been more important, more in the public eye, or more controversial than in the past nine years when challenges from global financial crises to AIDS to the emergence of terrorist sanctuaries in failed states have threatened our prosperity. In Sebastian Mallaby's masterful hands, the story of Wolfenson and his World Bank is a marvelous tour through the messy reality of global development. What John Gutfreund and Salomon Brothers were to the 1980s and John Meriwether and Long Term-Capital Management were to the 1990s, James Wolfensohn and the World Bank are to our time: the emblematic story through which a gifted author has channeled the spirit of the age.",
        "Category": " Business & Economics , International , General",
        "Publisher": "Penguin Press HC, The",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The X Factor: A Quest for Excellence",
        "Authors": "By Plimpton, George",
        "Description": "George Plimpton is embarrassed. The noted amateur of odd sporting experience has lost one horseshoe match to George Bush, a match that was as much a test of wills as of skills. Now Bush has invited him back for a rematch. How to avoid humiliation the second time? What is that quality - we'll call it the X Factor - that all winners, from famous athletes to successful CEOs, seem to possess? Plimpton sets out to find it.The quest for this elusive ingredient is both hilarious and informative, leading from the locker room to the boardroom, with several strange stops in between. Plimpton corners superstars like Bill Russell and Billie Jean King, famous coaches, the chairman of American Express, sports doctors, and M & A king Henry Kravis, and puts the same question to all of them: What is it that allows an individual, or a team, to outperform competitors who are no less gifted, mentally and physically? Their answers run the gamut from motivational rage to new-age meditation, and Plimpton slowly pieces together a definition of this mysterious winning quality.",
        "Category": " Sports & Recreation , Sports Psychology",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The Best Little Magazine Fiction, 1970",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "New York University Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Hearts on Fire: Praying With Jesuits",
        "Authors": "By Harter, Michael G.",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Inst of Jesuit Sources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Band of Brothers: E Company, 506th Regiment, 101st Airborne from Normandy to Hitler's Eagle's Nest",
        "Authors": "By Ambrose, Stephen E.",
        "Description": "As good a rifle company as any in the world, Easy Company, 506th Airborne Division, U.S. Army, kept getting the tough assignments -- responsible for everything from parachuting into France early D-Day morning to the capture of Hitler's Eagle's Nest at Berchtesgaden. In Band of Brothers, Ambrose tells of the men in this brave unit who fought, went hungry, froze, and died, a company that took 150 percent casualties and considered the Purple Heart a badge of office. Drawing on hours of interviews with survivors as well as the soldiers' journals and letters, Stephen Ambrose recounts the stories, often in the men's own words, of these American heroes.",
        "Category": " History , Military , World War II",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "BETTY CROCKER'S RED SPOON COLLECTION BEST RECIPES FOR FISH AND SHELLFISH",
        "Authors": "By Betty Crocker",
        "Description": "Gathers recipes for appetizers, stews, chowders, bisques, souffles, omelets, salads, sandwiches, and main dishes that feature fish and seafood",
        "Category": " Cooking , General",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "9.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Pontoon: A Novel of Lake Wobegon (Lake Wobegon Novels)",
        "Authors": "By Keillor, Garrison",
        "Description": "A fresh and funny Lake Wobegon novel about a woman with a secret life  In Lake Wobegon lives a good Lutheran lady who is quite prepared to die and wishes to be cremated and her ashes placed inside a bowling ball and dropped into the lake, no prayers, no hymns, thank you very much.  Meanwhile, the Detmer girl returns from California where she has made a killing in veterinary aromatherapy to marry her boyfriend Brent aboard Wally's pontoon boat, presided over by her minister, Misty Naylor of the Sisterhood of the Sacred Spirit.  Brent arrives on Thursday.  On Saturday, a delegation of renegade Lutheran pastors from Denmark come to town on their tour of America, their punishment for having denied the divinity of Jesus.  And Barbara Peterson, whose mother, Evelyn, left the startling note about cremation and the bowling ball, is in love with a lovely fat man who slips around town in the dim light and reconnoiters with her at the Romeo Motel.   An the then there is Raoul of the cigars and tinted shades and rainbow sportscoat and his long phone message (\"Hey, Precious\") after the angel of death has already come and gone.  All is in readiness for the wedding--the giant shrimp shish kebabs, the French champagne, the wheels of imported cheese, the pate with whole peppercorns, the hot-air balloon, the flying Elvis, the pontoon boat, and the giant duck decoys--and then something else happens.  It is Lake Wobegon as you've imagined it--good loving people who drive each other slightly crazy.",
        "Category": " Fiction , Literary",
        "Publisher": "Viking",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Leviathan on the Right: How Big-Government Conservativism Brought Down the Republican Revolution",
        "Authors": "By Tanner, Michael D.",
        "Description": "Tanner (director of health and welfare studies at the Cato Institute) argues that the current policies of the Republican Party make a mockery of the traditional small government conservatism of Friedrich Hayek and Barry Goldwater and will lead the United States down Hayek's \"road to serfdom\" as well as lead to electoral disaster for the Republican Party. Largely avoiding the foreign policy of George W. Bush and the curtailments on civil liberties that have accompanied his \"War on Terror,\" he examines and critiques the rise of big government conservatism, finding it to be an admixture of neoconservatism, national greatness conservatism, the religious right, supply-side economics, technophiles exemplified by Newt Gingrich. Annotation ©2007 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , American Government , General",
        "Publisher": "Cato Institute",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Freedom from Headaches (Fireside Books (Holiday House))",
        "Authors": "By Saper, J. and Magee, K.",
        "Description": "",
        "Category": " Health & Fitness , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Visions: How Science Will Revolutionize the 21st Century",
        "Authors": "By Kaku, Michio",
        "Description": "In Visions, physicist and author Michio Kaku examines the great scientific revolutions that have dramatically reshaped the twentieth century--the quantum mechanics, biogenetics, and artificial intelligence--and shows how they will change and alter science and the way we live.The next century will witness more far-reaching scientific revolutions, as we make the transition from unraveling the secrets of nature to becoming masters of nature. We will no longer be passive bystanders to the dance of the universe, but will become creative choreographers of matter, life, and intelligence.The first section of Visions presents a shocking look at a cyber-world infiltrated by millions of tiny intelligence systems. Part two illustrates how the decoding of DNA's genetic structure will allow humans the \"godlike ability to manipulate life almost at will.\" Finally, VISIONS focuses on the future of quantum physics, in which physicists will perfect new ways to manipulate matter and harness the cosmic energy of the universe.What makes Michio Kaku's vision of the science of the future so compelling--and so different from the mere forecasts of most thinkers--is that it is based on the groundbreaking research taking place in labs today, as well as the consensus of over 150 of Kaku's scientific colleagues. Science, for all its breathtaking change, evolves slowly; we can accurately predict, asserts Kaku, what the direction of science will be, based on the paths that are being forged today.A thrilling, unique narrative that brings together the thinking of many of the world's most accomplished scientists to explore the world of the future, Visions is science writing at its best.",
        "Category": " Science , Reference",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "How the World Works: A Guide to Science's Greatest Discoveries",
        "Authors": "By Rensberger, Boyce",
        "Description": "Provides concise explanations of scientific concepts, principles, practices, theories, and discoveries and discusses the careers of important scientists",
        "Category": " Science , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "The Audubon Society Field Guide To The Natural Places Of The Northeast: Coastal",
        "Authors": "By Welch, Heidi, Kulik, Stephen, Salmansohn, Pete, and Schmidt, Matthew",
        "Description": "This guide to more than 100 ecologically significant inland sites includes an account of the natural history of the region, descriptions and illustrations of each site, and specific practical information",
        "Category": " Travel , Reference",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "Parallel Journeys",
        "Authors": "By Heck, Alfons, Ayer, Eleanor H., and Waterford, Helen",
        "Description": "She was a young German Jew. He was an ardent member of the Hitler Youth. This is the story of their parallel journey through World War II. Helen Waterford and Alfons Heck were born just a few miles from each other in the German Rhineland. But their lives took radically different courses: Helen’s to the Auschwitz concentration camp; Alfons to a high rank in the Hitler Youth. While Helen was hiding in Amsterdam, Alfons was a fanatic believer in Hitler’s “master race.” While she was crammed in a cattle car bound for the death camp Auschwitz, he was a teenage commander of frontline troops, ready to fight and die for the glory of Hitler and the Fatherland. This book tells both of their stories, side-by-side, in an overwhelming account of the nightmare that was World War II. The riveting stories of these two remarkable people must stand as a powerful lesson to us all.",
        "Category": " Young Adult Nonfiction , History , Holocaust",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Rabbits: The Key to Understanding Your Rabbit",
        "Authors": "By Guidry, Virginia Parker and Stockdale, Renee (PHT)",
        "Description": "Filled with accurate, up-to-date information, the Complete Care guides help new pet owners build lasting and loving relationships with their animal companions. No sleepy academic tomes, the Complete Care guides address all the major issues concerning owning a pet with down-to-earth language, honesty, humor and 100 full-color photographs. Reaching above and beyond ordinary pet care books, they remain essential long after a pet's first day home thanks to fascinating historical facts, a helpful resource guide, emergency first aid tips, fun activities and much more",
        "Category": " Pets , Reference",
        "Publisher": "Lumina Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "The Bichon Frise: An Owner's Guide to a Happy Healthy Pet",
        "Authors": "By Vogel, Mary and Vogel, Kathie D.",
        "Description": "Relates the history, standards, and characteristics of the breed, discusses how to get a dog settled into a new home, and covers feeding, breeding, grooming, basic health, and training",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Why Boys Don't Talk and Why We Care : A Mother's Guide to Connection",
        "Authors": "By Shaffer, Susan Morris and Gordon, Linda Perlman",
        "Description": "Explains why boys tend to supress their emotions and helps mothers and other individuals who work with young males to understand their lack of communication and range of emotions.",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Mid Atlantic Equity Consortium Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Lucia Triumphant: Based on the Characters Created by E.F. Benson",
        "Authors": "By Benson, E. F. and Holt, Tom",
        "Description": "Lucia, mayor of Tilling and leader of local society faces a new challenge from her social rival Elizabeth Mapp-Flint",
        "Category": " Fiction , Sagas",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "The Strange Case of Dr. Jekyll and Mr. Hyde (Great Illustrated Classics)",
        "Authors": "By Stevenson, Robert Louis",
        "Description": "",
        "Category": " Juvenile Nonfiction , Antiques & Collectibles",
        "Publisher": "Playmore Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Anastasia, Absolutely (An Anastasia Krupnik story)",
        "Authors": "By Lowry, Lois",
        "Description": "Irrepressible Anastasia is in junior high now and participating in the \"Values\" curriculum through which students learn to make moral decisions. Early one morning she hits the Cambridge streets with her pooper-scooper to walk her new dog. In her half-awake groggy state Anastasia mixes up the two plastic bags she's carrying: one containing letters to be deposited in the mailbox for her mother and the other with her responsible morning gatherings. She's too embarrassed to call the post office to confess and she begins to feel more and more guilty and scared as she notices some intense local police activity in the vicinity of the mailbox. What will Anastasia do?",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "7.19",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Away for the Weekend (R): Mid-Atlantic -- Revised and Updated Edition: Great Getaways within 250 Miles of Washington, D.C. in Delaware, Maryland, Virgi nia, West Virginia, Pennsylvania and New (1996)",
        "Authors": "By Berman, Eleanor",
        "Description": "Describes fifty-two weekend getaways, provides information on accomodations, and includes ideas for children",
        "Category": " Travel , United States , Northeast , Middle Atlantic (NJ, NY, PA)",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "The Alaska Almanac: Facts About Alaska--28th Edition",
        "Authors": "By Gates, Nancy (EDT) and Cole, Laura",
        "Description": "Now updated, this affordable, bestselling guide holds accurate, timely facts on geography, history, economy, employment, recreation, climate, and people of the vast state of Alaska. Photos. Maps.",
        "Category": " Reference , Almanacs",
        "Publisher": "Alaska Northwest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Japanese in Plain English",
        "Authors": "By De Mente, Boye",
        "Description": "Discusses Japanese pronunciation and grammar, offers practice exercises, and lists the Japanese equivalents for more than twelve hundred English words and expressions",
        "Category": " Foreign Language Study , Japanese",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "My Mother's House and Sido",
        "Authors": "By Colette",
        "Description": "",
        "Category": "",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Heart of Darkness & Other Stories (Wordsworth Classics)",
        "Authors": "By Conrad, Joseph",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Wordsworth Editions Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "About a Boy",
        "Authors": "By Hornby, Nick",
        "Description": "A wise, hilarious novel from the beloved, award-winning author of Funny Girl, High Fidelity and A Long Way Down. Will Freeman may have discovered the key to dating success: If the simple fact that they were single mothers meant that gorgeous women – women who would not ordinarily look twice a Will – might not only be willing, but enthusiastic about dating him, then he was really onto something. Single mothers – bright, attractive, available women – thousands of them, were all over London. He just had to find them. SPAT: Single Parents – Alone Together. It was a brilliant plan. And Will wasn’t going to let the fact that he didn’t have a child himself hold him back. A fictional two-year-old named Ned wouldn’t be the first thing he’d invented. And it seems to go quite well at first, until he meets an actual twelve-year-old named Marcus, who is more than Will bargained for…",
        "Category": " Fiction , Literary",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Herzl",
        "Authors": "By Elon, Amos",
        "Description": "",
        "Category": "",
        "Publisher": "HOLT, RINEHART AND WINSTON",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Rosh Hashanah Holiday Anthology",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Jewish Publication Society",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "August",
            "Year": "1970"
        }
    },
    {
        "Title": "Wisdom of the Celtic Saints",
        "Authors": "By Sellner, Edward C. and McLean-Keeney, Susan (ILT)",
        "Description": "",
        "Category": " Religion , Reference",
        "Publisher": "Ave Maria Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "If You Want Closure in Your Relationship, Start with Your Legs: A Guide to Understanding Men",
        "Authors": "By Big Boom",
        "Description": "NATIONAL ESSENCE BESTSELLER   Want to find real, committed love? The bodyguard for women's hearts reveals the minds of men in this tough-love guide to relationships.   After decades of preying on women as a pimp and a hustler, Big Boom knows all the games men play. He's now given up his player card, exposing the motivations of men and providing women with down-to-earth advice on how to create a fulfilling, loving relationship.   From sex with the ex to first dates, from the first look to the morning after, Boom leaves nothing out. His straight-talking advice exposes women's weaknesses and is invaluable to any woman determined to avoid common mistakes that lead to heartbreak.   This unique guide will show women not only how to find true love with Mr. Right, but also how to avoid Mr. Never-Gonna-Happen, Mr. Infidelity, and a variety of other Mr. Wrongs.",
        "Category": " Psychology , Human Sexuality",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Whom the Gods Love: A Julian Kestrel Mystery",
        "Authors": "By Ross, Kate",
        "Description": "Alexander Falkland hasn't an enemy in the world. Young, talented, charming, he shines in every field he enters: law, architecture, the investment market. But one night his luck runs out with a vengeance. In the midst of one of his famous parties, he is found in his study with his head smashed, a blood-stained poker beside him. No wonder the inscription on his gravestone reads: whom the gods love die young.When the Bow Street runners fail to solve the crime, Alexander's distraught father turns to Julian Kestrel, elegant dandy and intrepid amateur sleuth. Soon Kestrel is up to his ears in suspects.But the greatest enigma is Alexander himself. Who was he really? Social reformer or butterfly, devoted husband or rake? In this, his third murder case, Julian must peel off one mask after another, till at last he discovers an Alexander no one knew - except, perhaps, the killer.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Weight Watchers Stir-Fry to Szechuan: 100 Classic Chinese Recipes",
        "Authors": "By Weight Watchers",
        "Description": "Journey through the Far East with dishes such as Hot-and-Sour Soup with Mushrooms or Lamb Salays with Peanut Dipping Sauce. Imagine tasting a sumptuous plate of Sweet-and-Sour Turkey or the delicate flavors of Ginger Beef and Asparagus Stir-Fry or Shrimp with Lobster Sauce.Enjoy simple classic Asian fare such as Cold Noodles with Tofu-Peanut Sauce, Buddha's Delight and Red-Cooked Pork with Pineapple. These appealing recipes are wonderfully versatile - they can provide a quick weeknight supper or an exotic dinner for entertaining.These recipes are easy on the cook, too. We've made them easy-to-prepare using readily available ingredients. Also included are at-a-glance icons on each page to identify microwavable recipes, make-ahead dishes, one-pot dinners, spicy meals and recipes you can have on the table in about 20 minutes. You'll also find useful, creative ideas on \"Planning a Chinese Meal\" and making \"Lean Desserts, the Asian Way.\" Each recipe also includes complete nutrition information, as well as Weight Watchers classic Selection information.",
        "Category": " Cooking , Regional & Ethnic , Chinese",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The X Files Created By Chris Carter: Book of the Unexplained - Volume Two",
        "Authors": "By Goldman, Jane",
        "Description": "The X-Files Book of the Unexplained Volume Two provides insight into behind-the-scenes research on the show, and in-depth guides to the real events, phenomena and folklore which inspired the fictional stories in season two and season three.Among the mysteries, curiosities and 20th century nightmares, you'll find astral travel, near-death experiences, stigmata, serial-killing, cannibalism and other deviant behaviours, Native American wonders, psychic abilities and thought transference, freaks of nature, strange rains and other bizarre natural phenomena, animal mysteries, urban legends, vampires, the occult, voodoo, zombies, curses, astrology, conspiracy and cover-up, mind-control, covert tests and experiments, weird physics, alien abduction syndrome and the search for extra-terrestrial intelligence.Each chapter features stills from the show, interviews with The X-Files' creative team, reports from the cutting-edge of paranormal research and remarkable revelations from the world's leading investigators, scientists and officials.",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Summer: A  User's Guide",
        "Authors": "By Brown, Suzanne",
        "Description": "Make this the summer you try all the things you've always wanted to try!Find out how to:paddle a canoe; shuck an oyster; track the tides; do a flip turnplay badminton, bocce, and horseshoesturn seashells into wind chimes; tid-dye T-shirtsprepare summer staples such as the sea breeze, barbecued spareribs, and lobster rollsbuild a campfire; grill your just caught trout; toast s'moresspruce up your summer rental; banish mildew; get the upper hand on berry stainsread the night sky; identify animal tracks, leaves, and cloudshandle the flag with respect and remember all the words to the national anthemget back to flying a kite and using a hula hoopplay card games, word games, lawn games, and pool gameshost an instant party with 20 effortless appetizersbecome the most sought-after house guest or hostmake bird feeders; grow sunflowers; lure butterflies to your gardenkeep the kids occupied with fun activities for car trips and rainy daysorganize a clambake or a picnic; hang a tire swing; pack for a hikecontruct towering sand castles; master the art of knots. Hundreds of entries, glorious color photographs, and illustrations take you there and show you how. Whether you're in a cabin in the mountains, in a rental at the beach, at a weekend house in the country, or taking it easy in town or in your own backyard, Summer: A User's Guide is the summer necessity—packed with practical guidance, inspiring suggestions, useful resources, engaging history, nostalgic reminiscences, and the promise of a dream summer to come.",
        "Category": " Crafts & Hobbies , Seasonal",
        "Publisher": "Artisan",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Cafe Cuisine",
        "Authors": "By Conway, Linda Glick",
        "Description": "Gathers recipes for tapas, soups, sandwiches, pizzas, meat, poultry, seafood, pasta, salads, desserts, and brunches as prepared in a variety of cafes",
        "Category": " Cooking , General",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "5.13",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Grace Abounding",
        "Authors": "By Howard, Maureen",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown, and Company",
        "Price Starting With ($)": "18.3",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Insight Guide to Indonesia (Insight Guide Indonesia)",
        "Authors": "By Guides, Insight",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.95",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Out of Order: An incisive and boldly original critique of the news media's domination of America's political process",
        "Authors": "By Patterson, Thomas E.",
        "Description": "Why are our politicians almost universally perceived as liars? What made candidate Bill Clinton's draft record more newsworthy than his policy statements? How did George Bush's masculinity, Ronald Reagan's theatrics with a microphone, and Walter Mondale's appropriation of a Wendy's hamburger ad make or break their presidential campaigns?Ever since Watergate, says Thomas E. Patterson, the road to the presidency has led through the newsrooms, which in turn impose their own values on American politics. The results are campaigns that resemble inquisitions or contests in which the candidates' game plans are considered more important than their goals. Lucid and aphoristic, historically informed and as timely as a satellite feed, Out of Order mounts a devastating inquest into the press's hijacking of the campaign process -- and shows what citizens and legislators can do to win it back.",
        "Category": " Political Science , Political Process , Campaigns & Elections",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "I Never Came to You in White",
        "Authors": "By Farr, Judith",
        "Description": "This lovely fiction, by one poet about another, is cast in the form of letters that Emily Dickinson might well have written in 1847 as a seventeen-year-old student at Miss Lyon's Academy, where her teachers and fellow students found her original, witty, lovable ways beyond them. She struck them as little short of blasphemous in her expressed passion for the works of Shakespeare and for referring to the Bible as \"literature.\" Other versions of Emily are revealed in letters exchanged between her first editor, Thomas Wentworth Higginson, and a Miss Mann, who as a young teacher tried to instruct Emily in conventional Christian doctrine; in a letter from the only man ever to take her picture; in letters to and from her sister and her sister-in-law; and in letters from Emily herself, found after her death, to the person she addressed as \" Master.\" The revelations accrue until the poignant ending involves every member of the cast of this dramatic book, which combines the thorough knowledge of",
        "Category": " Fiction , Historical , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "6.28",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    }
]