[
    {
        "Title": "The Street Lawyer: A Novel",
        "Authors": "By Grisham, John",
        "Description": "Michael was in a hurry. He was scrambling up the ladder at Drake & Sweeney, a giant D.C. law firm with eight hundred lawyers. The money was good and getting better; a partnership was three years away. He was a rising star with no time to waste, no time to stop, no time to toss a few coins into the cups of panhandlers. No time for a conscience.But a violent encounter with a homeless man stopped him cold. Michael survived; his assailant did not. Who was this man? Michael did some digging, and learned that he was a mentally ill veteran who'd been in and out of shelters for many years. Then Michael dug a little deeper, and found a dirty secret, and the secret involved Drake & Sweeney.The fast track derailed; the ladder collapsed. Michael bolted the firm and took a top-secret file with him. He landed in the streets, an advocate for the homeless, a street lawyer.And a thief.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Dublins Lives",
        "Authors": "By Malamud, Bernard",
        "Description": "",
        "Category": "",
        "Publisher": "Farrar Straus & Giroux",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Stormy Weather",
        "Authors": "By Hiaasen, Carl",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "People Like Us",
        "Authors": "By Dunne, Dominick",
        "Description": "Gus Bailey, the confidant of New York society, observes the social repercussions of socialite Justine Altemus's engagement to TV anchorman Bernie Slatkin and inadvertently precipitates a social explosion",
        "Category": " Fiction , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Rudolph's Second Christmas",
        "Authors": "By Emberley, Michael (ILT) and May, Robert Lewis",
        "Description": "The manuscript of this sequel to Rudolph the Red-Nosed Reindeer was discovered by one of May's daughters in 1991. In this sequel, Rudolph and Santa find among the letters from children everywhere, a note from two children who were forgotten the Christmas before. Rudolph comes to their rescue and saves the day.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Applewood Books",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "He Was There from the Day We Moved In",
        "Authors": "By Rhoda Levine",
        "Description": "",
        "Category": "",
        "Publisher": "Harlin Quist",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Essential Spanish Grammar (Dover Language Guides Essential Grammar)",
        "Authors": "By Resnick, Seymour",
        "Description": "This Spanish grammar has been designed specifically for the adult with limited learning time. It covers the most important points of Spanish grammar in the clearest possible way, concentrating on the expressions that you would be most likely to use. All rules are illustrated with common phrases, and hints are included throughout the book on how to replace difficult constructions with simpler ones.All the major aspects of Spanish grammar are presented in logical order: vocabulary and vocabulary building; word order;  how to turn a positive sentence into a negative one; how to form questions; nouns; pronouns; adjectives; adverbs; how to conjugate verbs in the major tenses; how to use auxiliary verbs; prepositions and infinitives; useful expressions; and vocabulary tips. One section is devoted to the definition of all grammatical terms used throughout the book.Not a simplified grammar, this is a selected grammar for adult use. It can be used alone, either as an introductory course or as a refresher, or as a supplement to a record course. Its cognate list of more than 2500 words which are either the same or nearly the same in Spanish and English offers probably the easiest way for you to build your vocabulary, for you will discover that you have already been using very many words that with a slight change in pronunciation are already good Spanish. This is the only place where this useful teaching device is available.",
        "Category": " Foreign Language Study , Spanish",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1959"
        }
    },
    {
        "Title": "Pretty Good Magic (Step into Reading)",
        "Authors": "By Dubowski, Cathy East and Dubowski, Mark",
        "Description": "Presto's attempt to impress the town of Forty Winks with a really spectacular trick produces more rabbits than anyone expected.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "The Witch Who Was Afraid of Witches (I Can Read Level 4)",
        "Authors": "By Low, Alice and Manning, Jane (ILT)",
        "Description": "A bewitching tale for beginning readers, the perfect early chapter book story for Halloween! Wendy is a little witch who is afraid of her mean, bossy witch sisters—until one special Halloween night when she makes a magical discovery: Wendy’s sisters can fly fast, cackle loudly, and cast spells, but Wendy can fly even faster. Can she find a way to out-witch her sisters?In this I Can Read Level 4 paperback—complete with full-color art and short chapters—Alice Low has adapted her popular story specifically for readers bridging to chapter books.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The Lost Ships of Guadalcanal: Exploring the Ghost Fleet of the South Pacific",
        "Authors": "By Ballard, Robert D. and Archbold, Rick",
        "Description": "A chronicle of the search for the ships sunk during the Battle of Guadalcanal integrates a first-person narrative of the expedition with photographs of ships from both sides lost in the battle. TV tie-in. 150,000 first printing. $150,000 ad/promo. Tour.",
        "Category": " History , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The Man Who Stayed Below",
        "Authors": "By Gould, Alan",
        "Description": "In 1913, sixteen-year-old Johnny Boult joins the wool-clipper \"Emilia Denholm\" in Melbourne as it sails for London and finds the stark reality of shipboard life different from his glamorous dreams of seafaring",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "7.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Domes of Fire (Book One of the Tamuli)",
        "Authors": "By Eddings, David",
        "Description": "Six years had passed since the redoubtable knight Sparhawk had triumphed over the evil God Azash and returned to Elenia with Queen Ehlana, his bride. And now a new danger had arisen to threaten the peace of Ehlana's realm.The trouble had started quietly. At home, bandits began to plague the hill country. In neighboring Lamorkand, the customary political unrest turned ominous with whispers that the bloody heroes of old soon would rise again. And travelers reported that the Trolls had all disappeared from the icy northern haunts of Thalesia.Simple problems, apparently unrelated - until an ambassador arrived from the far-off Tamul empire, begging Sparhawk's aid. For these same dangers that stalked Ehlana's kingdom had already struck his realm full-force. The fabled ancient warriors of Tamuli had indeed returned - intent on carnage. Monsters and fell magics had followed, and the havoc and terror they spawned were tearing the empire apart.The empire had sent for the Pandion Knight who had killed the God Azash. If Sparhawk wanted to stop this danger before it could savage his own land, he now must lend his aid.Sparhawk, Ehlana, and their daughter, Princess Danae, agreed to make the grueling trek to the far-distant empire of the east. They traveled in company with a handful of trusted companions: the stalwart champions of the four Militant Orders, the knight Berit, Mirtai the giantess, and the young thief Talen.With the child-goddess Aphrael to speed their journey, they began the treacherous traverse of the utmost reaches of the Daresian continent, to Tamul's distant capital. There, in the emperor's glittering court, they would encounter corruption, treachery - and a greater danger than any man had faced before!David Eddings opens a bold new chapter in the saga begun in his bestselling series, The Elenium. In his dazzling trademark style, Eddings weaves a compelling tale of strange magic and breathtaking adventure, staunch friends and deadly enemies. Domes of Fire is a triumph of sheer story-telling magic from fantasy's premier genius!",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Cowboys (Random House Pictureback)",
        "Authors": "By Gorsline, Marie and Gorsline, Douglas W.",
        "Description": "Illus. in full color. \"Straightforward information on cowboys, their gear, history, daily lives, and famous and infamous cowboys gains additional appeal from detailed drawings.\"--Booklist.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Random House Childrens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1980"
        }
    },
    {
        "Title": "My Mom's the Best Mom",
        "Authors": "By Hample, Stuart",
        "Description": "She was there from your very first memory. She plans your birthday parties, but yells when you forget to put away the toys. She kisses the bruises and scrapes and fevered forehead, and makes them better. She stands up for you at school, but brooks no nonsense when it's time to do homework. She cuts out of meetings to see you play soccer, and tells you a joke after the game you lost. And while Dad says you look perfect no matter what, Mom gives it to you straight--including when you really are perfect. The relationship between a mother and child is as honest as it is loving as it is pragmatic as it is forever.Stuart Hample, who has been listening to and writing down the words of children for years and years, presents his newest collection of gems--dozens of reflections, appreciations, misgivings, and accolades from kids about their moms. Co-editor of Children's Letters to God, with over 1 million copies in print, and, most recently, Me and My Dad, Mr. Hample has perfect pitch when it comes to hearing what children say: \"When I wanted a sister she took that into consideration. So now I have one.\" --Flora\"My mom says whoever took out the garbage without being asked I am very proud of you.\" --Andy\"She says yes when she needs to say yes, and says no when she needs to say no. But I don't like to get kissed first thing in the morning.\" --Vanessa \"She may not be perfect but I think she's as close to it as a mom can get.\" --Lola",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "A Special Collection in Praise of Mothers",
        "Authors": "By Exley, Helen (EDT)",
        "Description": "",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Yiddishe Mamas: The Truth About the Jewish Mother",
        "Authors": "By Winston-MacAuley, Marnie",
        "Description": "The Jewish mother feels her job isn't done even after death. You're never too dead to be a Jewish mother.\" --Mallory Lewis, daughter of Shari Lewis * What do Steven Spielberg, Woody Allen, Barbra Streisand, Jon Stewart, Bette Midler, and Natalie Portman have in common with this book? A Jewish mother.Is there such a thing as a Jewish mother? And if so, who is she? For the first time, best-selling Jewish author and humorist Marnie Winston-Macauley examines all aspects of the Jewish mother. Chronicling biblical Jewish mothers to modern-day Yentls, she creates a compendium using celebrity interviews, anecdotes, humor, and scholarly sources to answer these questions with truth and humor.* Contributors to the book range from Dr. Ruth Gruber and Rabbi Bonnie Koppel to Jackie Mason, Amy Borkowsky, John Stossel, Lainie Kazan, and more.* \"The definitive source on Jewish mothers.\" --Eileen Warshaw, Ph.D., executive director of the Jewish Heritage Center of the Southwest",
        "Category": " Social Science , Jewish Studies",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "13.48",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "The Nazis",
        "Authors": "By Bruce, George",
        "Description": "",
        "Category": "",
        "Publisher": "Chancellor Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Shadows of the Night: The Hidden World of the Little Brown Bat",
        "Authors": "By Bash, Barbara",
        "Description": "When many of the earth's creatures are seeking shelter for the night, bats are waking and beginning to hunt. In this delightful picture book, award-winning author and artist Barbara Bash guides readers into the shadowy world of the Little Brown Bat, one of the most common species in North America.",
        "Category": " Juvenile Nonfiction , Animals , Mammals",
        "Publisher": "Sierra Club Books for Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Feelings (Reading Rainbow Book)",
        "Authors": "By Aliki",
        "Description": "This classic picture book is a great way to explore feelings with younger kids, whether at home or in the classroom.Happy, sad, shy, excited—how do you feel? Sometimes it's hard for children to understand or explain their feelings. Sharing this book helps foster dialogue about emotions, encouraging children to open up and to be empathic.\"Children often have difficulty articulating emotions. That fact is the underpinning for Aliki's catalog of feelings, be they happy, sad, or somewhere in between.\" —Booklist\"A delightful book.\" —New York Times Book Review",
        "Category": " Juvenile Nonfiction , Social Topics , Manners & Etiquette",
        "Publisher": "Greenwillow Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2019"
        }
    },
    {
        "Title": "Lower New England, a guide to the inns of Connecticut, Massachusetts, and Rhode Island (Country inns of America)",
        "Authors": "By Andrews, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "Knapp Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The Devil's Dictionary (Dover Thrift Editions)",
        "Authors": "By Bierce, Ambrose",
        "Description": "Born in Ohio in 1842, journalist, short-story writer and critic Ambrose Bierce developed into one of this country's most celebrated and cynical wits — a merciless \"American Swift\" whose literary barbs were aimed at folly, self-delusion, politics, business, religion, literature and the arts. In this splendid \"dictionary\" of epigrams, essays, verses and vignettes, you'll find over 1,000 pointed definitions, e.g. Congratulation (\"The civility of envy\"), Coward (\"One who in a perilous emergency thinks with his legs\") and Historian (\"A broad-gauge gossip\"). Anyone who likes to laugh will love The Devil's Dictionary. Anyone looking for a bon mot to enliven their next speech, paper or conversation will have a field day thumbing through what H. L. Mencken called \"some of the most gorgeous witticisms in the English language.\"",
        "Category": " Fiction , Satire",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "What Style is It?: A Guide to American Architecture",
        "Authors": "By Poppeliers, John C",
        "Description": "",
        "Category": "",
        "Publisher": "Preservation Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "The Saggy Baggy Elephant (Little Golden Book)",
        "Authors": "By Jackson, Kathryn, Jackson, Byron, and Tenggren, Gustaf (ILT)",
        "Description": "After a parrot makes fun of Sooki’s big ears, long nose, and wrinkled skin, the “saggy baggy” elephant isn’t too sure of himself. But once he meets some beautiful creatures who look just like him, Sooki celebrates with a joyful “one-two-three-kick.” For over 50 years, parents and children have treasured this tale, with gorgeous art by Gustaf Tenggren, the illustrator of The Poky Little Puppy.",
        "Category": " Juvenile Fiction , Social Themes , Self-Esteem & Self-Reliance",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Student Dictionary of Biology",
        "Authors": "By Gray, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "D. Van Nostrand",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "August",
            "Year": "1973"
        }
    },
    {
        "Title": "Did You Know?",
        "Authors": "By Editors of Reader's Digest",
        "Description": "A compendium of facts and stories from the worlds of science, history, and the arts features more than five hundred photographs, sketches, and diagrams, more than three hundred \"Did You Know\" information boxes, and other trivia. 25,000 first printing.",
        "Category": " Reference , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Loyalties",
        "Authors": "By Moynihan, Daniel Patrick",
        "Description": "The Senator from New York comments on international relations and examines the issues of international law, the arms race and international peace, and the Communist theory of racism, a charge applied to any who oppose Soviet totalitationism",
        "Category": " Political Science , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "Cub Scout Songbook",
        "Authors": "By Boy Scouts of America",
        "Description": "Offers the lyrics, sometimes accompanied by the tunes, of songs and rounds for Cub Scout groups, including traditional folk tunes, campfire favorites, and patriotic songs, as well as songs especially chosen to fit into the Cub Scout program",
        "Category": " Music , General",
        "Publisher": "Boy Scouts of America",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "June",
            "Year": "1969"
        }
    },
    {
        "Title": "Space almanac: Facts, figures, names, dates, places, lists, charts, tables, maps covering space from earth to the edge of the universe",
        "Authors": "By Curtis, Anthony R",
        "Description": "Subtitled,  Facts, figures, names, dates, places ... tables, maps, photos, covering space from Earth to the edge of the universe . Entries are brief ca. 100-200 words and more suitably organized for browsing than reference. The index does not adequately compensate for the idiosyncratic arrangement. Ugly illustrations made from camera-ready computer art. A fun, frustrating book by the editor of  Space today  magazine. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Arcsoft",
        "Price Starting With ($)": "6.38",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "What Life Was Like: At the Dawn of Democracy : Classical Athens 525-322 Bc",
        "Authors": "By Time-Life Books (EDT)",
        "Description": "Describes daily life in the golden age of Athens, and includes accounts of political, military, and philosophical innovations",
        "Category": " History , Ancient , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "She Who Loves A Garden",
        "Authors": "By Engelbreit, Mary (ILT)",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Andrews McMeel Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "What Makes a Rainbow?",
        "Authors": "By Schwartz, Betty Ann and Turner, Dona (ILT)",
        "Description": "Did you ever wonder what makes a rainbow? Discover the answer in Bendon's What Makes a Rainbow storybook! Join Little Rabbit on a journey to learn where rainbows come from.  Take part in his excitement as ribbons of color magically appear with the turn of each page!  This animal-themed story makes a great introduction to colors and matching concepts.",
        "Category": " Juvenile Nonfiction , Concepts , Colors",
        "Publisher": "The Five Mile Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Bird Alphabet Book (Jerry Pallotta's Alphabet Books)",
        "Authors": "By Pallotta, Jerry",
        "Description": "Ready to go birding? Quick! Can you think of a bird whose  name begins with X? Jerry  Pallotta found one, and also birds for Q and  Z and all the other letters  of the alphabet.But this isn't a  simple \"A is for Atlantic Puffin\" kind of alphabet book. Find out where  these birds live, how they survive, and the unique qualities that make  them interesting.  Full of facts and fun, this book is sure to  intrigue children with  its array of feathered friends, from the  familiar to the exotic. Take a  brilliant tour of the bird world.",
        "Category": " Juvenile Fiction , Concepts , Alphabet",
        "Publisher": "Charlesbridge",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Cooking Secrets: Mid-Atlantic & Chesapeake",
        "Authors": "By Fish, Kathleen DeVanna",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , Middle Atlantic States",
        "Publisher": "Bon Vivant Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Myths of Greece and Rome",
        "Authors": "By Bulfinch, Thomas and Holme, Bryan (EDT)",
        "Description": "Orpheus leading his beloved Eurydice back to life … Ulysses battling to resist the mesmerising Sirens’ song … The tragedy of the vengeful Medea … The timeless stories of the gods and goddesses of Greece and Rome are charged with passion and romance, magic and murder. Each one is brought to life beautifully in this lavishly illustrated edition of Thomas Bulfinch’s ‘The Age of Fable’ compiled by Bryan Holme. The narrative is clear and captivating, while the illustrations demonstrate the profound effect the myths had on the great artists of the West, via paintings and sculptures by masters from Botticelli to Picasso.",
        "Category": " Social Science , Folklore & Mythology",
        "Publisher": "Penguin Books (Non-Classics)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1981"
        }
    },
    {
        "Title": "F.I.A.S.C.O.: Blood in the Water on Wall Street",
        "Authors": "By Partnoy, Frank",
        "Description": "In F.I.A.S.C.O.: Blood in the Water on Wall Street, a former derivatives salesman takes readers onto the trading floor of a leading investment bank—and in a tell-all, no-holds-barred exposé, reveals for the first time the ugly truth about these complex financial products and the people who peddle them. Writing with the same eye for telling details as Michael Lewis in Liar’s Poker, Frank Partnoy shows how the once genteel world of investment banking has now become a place where the rallying cry is \"There’s blood in the water. Let’s go kill someone.\"Partnoy was in his late twenties when he landed the job of his dreams—a position in Morgan Stanley’s Derivatives Products Group, the single most profitable division of the venerable investment bank. With vivid character sketches and a wealth of funny-yet-disturbing anecdotes, Partnoy takes us inside the culture of Morgan Stanley’s derivatives group. Encouraged by upper management and egged on by gun-toting senior salesmen, derivatives had become a business-as-war, take-no-prisoners operation where people pored over Soldier of Fortune and gloated when they sold a product that \"ripped off\" a client’s face.As he leads us through the ups and downs of his fifteen months at Morgan Stanley, Partnoy explains in plain English what derivatives are—and shows how he and the other \"rocket scientists\" at the bank custom-designed these arcane financial products to dodge government regulators, encourage foreign currency speculation by pension and mutual funds, disguise risky gambles with AAA Standard & Poor’s ratings, and avoid capital gains taxes for weathy individuals. He also details, for the first time, the deal that earned Morgan Stanley the fattest fee in Wall Street history—a $74.5 million profit for devising a derivative that wiped hundreds of millions in losses off a Japanese company’s balance sheet.But dreaming up ever more complicated derivatives products—Dollarized Yield Curve Notes, Constant Maturity Treasury Floaters, Trigger Notes, and Total Return Swaps, to name a few—was never enough. For the bank to earn its fee, they had to be sold—usually, as Partnoy notes, either to \"cheaters\" (fund managers who wanted riskier investments than their regulators or charters normally allowed) or to \"widows and orphans\" (unsophisticated fund managers who couldn’t understand the risks in fine print).Throughout the book, Partnoy gives us a trading-floor view of the disasters fueled by derivatives trading and provides the formula of greed, daring, and ingenuity that are the basic ingredients of all derivatives. Written with humor, insight, and a mounting sense of moral outrage, F.I.A.S.C.O. is both a brilliant insider’s account of investment banking today and a blistering indictment of the largely unregulated market in derivatives—a book that everyone who has a pension plan or invests in mutual funds needs to read.",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Caging The Nuclear Genie: An American Challenge For Global Security",
        "Authors": "By Turner, Stansfield",
        "Description": "The Cold War may be over, but you wouldn’t know it from the tens of thousands of nuclear, chemical, and biological weapons of mass destruction still held by Russia, the United States, and other world powers. Arguing that the time has come to dispense with incremental approaches to arms control, Admiral Stansfield Turner, the former head of the CIA and an experienced senior military commander, proposes a practical yet safe plan that would move the world into a new and secure millennium.Turner carefully analyzes how many nuclear weapons are really needed to maintain our national security, regardless of how many weapons of mass destruction other nations may have. He then offers a dramatic, unilateral American initiative—to place all the world’s nuclear warheads in “strategic escrow” whereby none would be ready for immediate use; to initiate a pledge of “no first use” and call on other nations to do the same; and to build national defenses against nuclear attack when they become cost-effective.The paperback edition of this widely acclaimed work has been updated to consider the implications of such a build down if applied to non-nuclear weapons of mass destruction. Specifically, Admiral Turner details how a plan for weapons reduction could be carried out for biological and chemical weapons and what tactical and strategic differences exist between de-escalation of nuclear and non-nuclear weapons.The Turner Plan achieves genuine international security and has the potential to achieve wide, bipartisan support. It deserves to be widely studied, debated, and, finally, implemented.",
        "Category": " History , Military , General",
        "Publisher": "Westview Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "It's Greek to Me",
        "Authors": "By MacRone, Michael and Lulevitch, Tom (ILT)",
        "Description": "A treasure trove of information about words and phrases that originated in Greek and Roman texts.",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Catcher with a Glass Arm (Matt Christopher Sports Classics)",
        "Authors": "By Christopher, Matt",
        "Description": "A young baseball player struggles to overcome his fear of a pitched ball, improve his throwing, and somehow redeem himself in the eyes of his teammates.",
        "Category": " Juvenile Fiction , Sports & Recreation , Baseball & Softball",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "Clevelands Bottle Pricing Guide",
        "Authors": "By Cleveland, Hugh",
        "Description": "This revised edition of Cleveland's popular bottle guide features over 4,000 bottles listed alphabetically including Avon, medicine bottles, Jim Beam, bitters, and many more. Black and white photos.  5.5 X 8.5. 2009 values.",
        "Category": " Antiques & Collectibles , Bottles",
        "Publisher": "Collector Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "The Ghost's Grave",
        "Authors": "By Kehret, Peg",
        "Description": "Peg Kehret does it again in this spooky, suspenseful thriller!What Josh thought would be the dullest summer of his life, spent with his eccentric great-aunt, turns chilling when he meets the ghost of a coal miner killed in a mine explosion. Willie has been waiting years for some kind soul to dig up his leg and rebury it with the rest of him—only then will he be at peace. Josh agrees to do the grisly deed, but when he digs in the old cemetery, he finds more than Willie’s leg bones! Who buried the box of cash in the grave, and why? How far will that person go to get the money back? The Ghost’s Grave is a deliciously spooky adventure from a master of suspense.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "The Essentials of MLA Style: A Guide to Documentation for Writers of Research Papers",
        "Authors": "By Trimmer, Joseph F",
        "Description": "In easy-to-use outline form, this little book is a handy distillation of the best-selling MLA Handbook, with all the information a student needs to format a typescript, list sources at the end of the paper, cite sources in the paper's text, and avoid unintentional plagiarism. It also includes a sample outline and research paper and, for writers in the social sciences, a brief discussion of the style preferred by the American Psychological Association. Up to date-with rules for citing such new media as CD-ROMS, videotapes, and online databases. Includes a complete sample outline and research paper, with an appendix on APA style.",
        "Category": " Language Arts & Disciplines , Style Manuals",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Hometown Boy: The Hoodle Patrol and Other Curiosities of Baltimore",
        "Authors": "By Alvarez, Rafel",
        "Description": "",
        "Category": " Social Science , Sociology , Urban",
        "Publisher": "Baltimore Sun",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "American Bride",
        "Authors": "By Daniel, Megan",
        "Description": "Abigail Dawson, daughter of a wealthy Pennsylvania family travels to England, where she is to marry Lord Reginald Longford",
        "Category": " Fiction , Romance , Regency",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Traditions of Christmas",
        "Authors": "By Roth, Gail",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Ideals Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Curious George in the Snow",
        "Authors": "By Rey, H. A. and Rey, Margret",
        "Description": "George and the man with the yellow hat enjoy watching the winter sports competition. When they stop to warm up with some cocoa, George's curiosity about the racing equipment leads to some wild rides up and down the slopes. He creates quite a stir at the resort, and may even create a new sport! The adventures of Curious George continue in an all-new series beginning in fall 1998 with eight new stories. Written and illustrated in the style of Margret and H. A. Rey, the books appear in paperback (8 x 8\") and hardcover editions and feature the art of Vipah Interactive, the animators of HMI's Curious George CD-ROMs.",
        "Category": " Juvenile Fiction , Sports & Recreation , Winter Sports",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Little Gorilla",
        "Authors": "By Bornstein, Ruth",
        "Description": "A simple rhythmic text portrays Little Gorilla, who is loved by everyone in the jungle as he begins to grow . . . and Grow . . . and GROW.",
        "Category": " Juvenile Fiction , Animals , Apes, Monkeys, etc.",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "The Relatives Came",
        "Authors": "By Rylant, Cynthia, Gammell, Stephen (ILT), and Juvenile Collection (Library of Congress) (COR)",
        "Description": "In a rainbow-colored station wagon that smelled like a real car, the relatives came. When they arrived, they hugged and hugged from the kitchen to the front room. All summer they tended the garden and ate up all the strawberries and melons. They plucked banjos and strummed guitars. When they finally had to leave, they were sad, but not for long. They all knew they would be together next summer.",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "North American Indian Tales (Dover Children's Thrift Classics)",
        "Authors": "By Green, John and Larned, W. T.",
        "Description": "\"When the snow lay deep on the ground, the North Wind came howling from his home in the Land of Ice, and the cold moon shone from the frosty sky, it was then that the Indians gathered in the wigwam. It was then that Iagoo sat by the fire of blazing logs, and the little boys and girls gathered around him.\" So begins this charming collection of seven stories told by Iagoo the Indian storyteller.Young readers and listeners will love such charming, authentic tales as \"Shin-ge-bis Fools the North Wind,\" \"How the Summer Came,\" \"The Little Boy and Girl in the Clouds,\" \"The Child of the Evening Star,\" \"The Boy Who Snared the Sun,\" \"Grasshopper,\" and \"Mish-o-sha, the Magician.\"Adapted from legends collected by noted ethnologist Henry R. Schoolcraft in the Lake Superior region in 1839, these enchanting stories will delight youngsters and lovers of Native American myth and legend. Thirty illustrations by John Green enhance the text, printed in large, easy-to-read type.",
        "Category": " Social Science , Ethnic Studies , Native American Studies",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Teddy Bear, Teddy Bear:  A Classic Action Rhyme",
        "Authors": "By Hague, Michael (ILT)",
        "Description": "Complete with charming, warm-hearted illustrations and step-by-step instructions so that even the youngest child can follow along, a reprint of a classic action rhyme is designed to bring joy and fun into any preschooler's day. Reprint.",
        "Category": " Juvenile Fiction , Nursery Rhymes",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "A Field Guide to the Wild Flowers of North America",
        "Authors": "By Barker, Joan",
        "Description": "",
        "Category": " Nature , Plants , Flowers",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Best Christmas Hunt Ever (Read With Me Paperbacks)",
        "Authors": "By Speirs, John (ILT) and Speirs, John",
        "Description": "Young readers can hunt for Christmas trees, bells, Santa's little helpers, and other items in page after page of search-and-find puzzles that detail the holiday visit that Alexis and John and their three friends pay to their grandparents",
        "Category": " Juvenile Fiction , Holidays & Celebrations , General",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Coyote Places the Stars (Aladdin Picture Books)",
        "Authors": "By Taylor, Harriet Peck",
        "Description": "Coyote arranges the stars in the shapes of his animal friends",
        "Category": " Juvenile Fiction , People & Places , United States , Native American",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Clamshell Boy: A Makah Legend",
        "Authors": "By Cohlene, Terri and Reasoner, Charles (ILT)",
        "Description": "Retells the legend of Clamshell Boy, who rescues a captured group of children from the dreaded wild woman Ishcus; includes information on the customs and lifestyle of the Makah Indians.",
        "Category": " Juvenile Fiction , Legends, Myths, Fables , General",
        "Publisher": "Watermill Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Blue & the Gray",
        "Authors": "By Allen, Thomas B. and Abell, Sam",
        "Description": "History of the Civil War heavily illustrated with period and modern photos and drawings. 11x9.5\". Accompanied by a pocket-size guide to the battlefield parks. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "7.51",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Flawed victory;: A new perspective on the Civil War (New perspectives in American history)",
        "Authors": "By Barney, William L",
        "Description": "",
        "Category": "",
        "Publisher": "Praeger",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Concise Dictionary of Christianity in America",
        "Authors": "By Stout, Harry S. (EDT), Reid, Daniel G. (EDT), Linder, Robert D. (EDT), Shelley, Bruce L. (EDT), and Noll, Craig A. (EDT)",
        "Description": "",
        "Category": " Religion , Reference",
        "Publisher": "Intervarsity Pr",
        "Price Starting With ($)": "5.54",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "The History of Furniture",
        "Authors": "By Watson, Francis",
        "Description": "An up-to-date survey of Western furniture styles and designs, from Roman to contemporary times, with hundreds of color photographs of individual pieces, accessories, and rooms",
        "Category": "",
        "Publisher": "Crescent Books",
        "Price Starting With ($)": "8.24",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "The Spring Rabbit (Dell Picture Yearling book)",
        "Authors": "By Dunbar, Joyce and Varley, Susan (ILT)",
        "Description": "The tender story of a rabbit named Smudge who spends the end of the year wishing and waiting for a sibling of his own features illustrations of woodland life and leafy burrows reminiscent of Beatrix Potter's classic artwork. Reprint.",
        "Category": " Juvenile Fiction , Animals , Rabbits",
        "Publisher": "Bantam Doubleday Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Windfall",
        "Authors": "By Bagley, Desmond",
        "Description": "Jan-Willem Hendrykxx's legacies to a small college in Kenya, a South African living in London, and a California dropout involve an American private eye, the head of Europe's largest security company, and sundry others in a mysterious, sinister plot centered in Kenya",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Summit Books",
        "Price Starting With ($)": "6.38",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "The Classic Tradition of Haiku: An Anthology (Dover Thrift Editions)",
        "Authors": "By Bowers, Faubion (EDT)",
        "Description": "A highly distilled form of Japanese poetry, haiku consists of seventeen syllables, usually divided among three lines. Though brief, they tell a story or paint a vivid picture, leaving it to the reader to draw out the meanings and complete them in the mind's eye. Haiku often contains a hidden dualism (near and far, then and now, etc.) and has a seasonal tie-in, as well as specific word-images that reveal deeper layers in each poem.This unique collection spans over 400 years (1488–1902) of haiku history by the greatest masters: Bashō, Issa, Shiki, and many more, in translations by top-flight scholars in the field. Haiku commands enormous respect in Japan. Now readers of poetry in the West can savor these expressive masterpieces in this treasury compiled by noted writer Faubion Bowers, who provides a Foreword and many informative notes to the poems.",
        "Category": " Poetry , Asian , Japanese",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Poems and Songs of the Civil War",
        "Authors": "By Hill, Lois (EDT)",
        "Description": "",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Best-Ever Recipes Vol. III",
        "Authors": "By Gayton, Kim E.",
        "Description": "",
        "Category": "",
        "Publisher": "Family Circle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "After This: A Novel",
        "Authors": "By McDermott, Alice",
        "Description": "Alice McDermott's powerful novel is a vivid portrait of an American family in the middle decades of the twentieth century. Witty, compassionate, and wry, it captures the social, political, and spiritual upheavals of those decades through the experiences of a middle-class couple, their four children, and the changing worlds in which they live. While Michael and Annie Keane taste the alternately intoxicating and bitter first fruits of the sexual revolution, their older, more tentative brother, Jacob, lags behind, until he finds himself on the way to Vietnam. Meanwhile, Clare, the youngest child of their aging parents, seeks to maintain an almost saintly innocence. After This, alive with the passions and tragedies of a determining era in our history, portrays the clash of traditional, faith-bound life and modern freedom, while also capturing, with McDermott's inimitable understanding and grace, the joy, sorrow, anger, and love that underpin, and undermine, what it is to be a family.",
        "Category": " Fiction , Literary",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The Dieter's Prayer Book",
        "Authors": "By Kopp, Heather Harpham",
        "Description": "Friendly Support.  Daily Encouragement.  Spiritual Empowerment.Diets and diet books have never been more popular. At the same time, recent studies show that Americans have never been more overweight. It's no wonder, then, that women who are trying to lose weight--be it 10 or 100 pounds--are among the most frequently discouraged people around. Every day we are faced with fridge wars, bad mirror moments, diets that don't work, skinny friends who can eat whatever they like, and husbands who reminisce about the size 8 they married. Yet victory can be yours. Increasingly, scientific studies are indicating that in health matters, prayer works--and in The Dieter's Prayer Book, you'll find that daily ounce of spiritual encouragement you need. Not tied to any one particular diet, The Dieter's Prayer Book can be used in conjunction with any healthy-eating program, or on its own. Each day, these upbeat prayers will remind you what really matters, make you feel less alone, and empower you to achieve your goal of healthful living.",
        "Category": " Religion , Prayerbooks , General",
        "Publisher": "WaterBrook Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Getting Through the Tough Stuff: It's Always Something!",
        "Authors": "By Swindoll, Charles R.",
        "Description": "We live in a time when things are tough for a lot of folks.  The boomers are beginning to feel anxiety as they move toward retirement.  Many people are facing financial pressure and are up to their ears in debt.  We are having to care for both our kids and our parents.The pace of life, and the demands of life, just keep getting more intense.  And for many, these tough times bring life crises.  This is a book of encouragement, hope and freedom... an invitation to meet Christ at the crossroads of our lives and move beyond the tough times.",
        "Category": " Religion , Christian Ministry , Pastoral Resources",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Look into the Sun",
        "Authors": "By Kelly, James Patrick",
        "Description": "Unconventional architect Phillip Wing receives a commission from alien visitors to construct a tomb for the god/ruler of another world, in a story about the meaning of being human in an alien society",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Collected Poems: A. E. Housman",
        "Authors": "By Housman, A. E.",
        "Description": "",
        "Category": "",
        "Publisher": "Henry Holt & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1971"
        }
    },
    {
        "Title": "Customers.com: How to Create a Profitable Business Strategy for the Internet and Beyond",
        "Authors": "By Seybold, Patricia B. and Marshak, Ronni T.",
        "Description": "A high-tech business expert explains how to make the Web an integral part of corporate strategy, offering real-life examples of companies that have successfully incorporated Internet technology, and shares practical strategies on how to increase sales, profits, and customers with the Web. 25,000 first printing. Tour.",
        "Category": " Business & Economics , E-Commerce , Internet Marketing",
        "Publisher": "Crown Business",
        "Price Starting With ($)": "5.55",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "The Essential Bogosian: Talk Radio, Drinking in America, FunHouse and Men Inside",
        "Authors": "By Bogosian, Eric",
        "Description": "&#147;Mr. Bogosian has crossed the line that separates an exciting artist from a cultural hero.  What Lenny Bruce was to the 1950s, Bob Dylan to the 1960s, Woody Allen to the 1970s &#150; that’s what Eric Bogosian is to this frightening moment of drift&#133; I Know of no one else like him in pop culture right now.” -Frank Rich, New York Times&#147;Pure Theatrical Adrenaline.” -Time Out New YorkOne of America’s premier performers and most original playwrights, Eric Bogosian has earned increasing fame for his disturbing, comic appearances on stage, on film, and on the page.  From his earliest evenings of monologues (Men Inside; Voices of America; Funhouse), to his best-known solo shows (Drinking in America; Sex, Drugs, Rock & Roll) and his remarkable first play (Talk Radio), Bogosian has explored the dark underbelly of the American dream with blistering prose, trenchant social criticism and breathtakingly accurate characterizations of an astonishing range of fellow citizens.The Essential Bogosian brings together Talk Radio and all of Bogosian’s monologues up through Drinking in America, providing the fullest view yet of this mercurial, much-emulated talent.One of America's premier performers and most innovative and provocative artists, Eric Bogosian's plays and solo shows include Talk Radio (Pulitzer Prize finalist); subUrbia; Sex, Drugs, Rock & Roll; Pounding Nails in the Floor with My Forehead, among many others. He has starred in a wide variety of film, TV and stage roles. Most recently, he created the character Captain Danny Ross on the long-running series Law & Order: Criminal Intent. 100, a collection of monologues, commemorating thirty years of Bogosian's solo-performance career, was published by TCG in 2014.",
        "Category": " Drama , American , General",
        "Publisher": "Theatre Communications Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Silent Honor",
        "Authors": "By Steel, Danielle",
        "Description": "In her 38th bestselling novel, Danielle Steel creates a powerful, moving portrayal of families divided, lives shattered and a nation torn apart by prejudice during a shameful episode in recent American history.A man ahead of his time, Japanese college professor Masao Takashimaya of Kyoto had a passion for modern ideas that was as strong as his wife's belief in ancient traditions. It was the early 1920s and Masao had dreams for the future--and a fascination with the politics and opportunities of a world that was changing every day. Twenty years later, his eighteen-year-old daughter Hiroko, torn between her mother's traditions and her father's wishes, boarded the SS Nagoya Mare to come to California for an education and to make her father proud. It was August 1941.From the ship, she went directly to the Palo Alto home of her uncle, Takeo, and his family. To Hiroko, California was a different world--a world of barbeques, station wagons and college. Her cousins in California had become more American than Japanese. And much to Hiroko's surprise, Peter Jenkins, her uncle's assistant at Stanford, became an unexpected link between her old world and her new. But in spite of him, and all her promises to her father, Hiroko longs to go home. At college in Berkeley, her world is rapidly and unexpectedly filled with prejudice and fear.On December 7, Pearl Harbor is bombed by the Japanese. Within hours, war is declared and suddenly Hiroko has become an enemy in a foreign land. Terrified, begging to go home, she is nonetheless ordered by her father to stay. He is positive she will be safer in California than at home, and for a brief time she is--until her entire world caves in.On February 19, Executive Order 9066 is signed by President Roosevelt, giving the military the power to remove the Japanese from their communities at will. Takeo and his family are given ten days to sell their home, give up their jobs, and report to a relocation center, along with thousands of other Japanese and Japanese Americans, to face their destinies there. Families are divided, people are forced to abandon their homes, their businesses, their freedom, and their lives. Hiroko and her uncle's family go first to Tanforan, and from there to the detention center at Tule Lake. This extraordinary novel tells what happened to them there, creating a portrait of human tragedy and strength, divided loyalties and love. It tells of Americans who were treated as foreigners in their own land. And it tells Hiroko's story, and that of her American family, as they fight to stay alive amid the drama of life and death in the camp at Tule Lake.With clear, powerful prose, Danielle Steel portrays not only the human cost of that terrible time in history, but also the remarkable courage of a people whose honor and dignity transcended the chaos that surrounded them. Set against a vivid backdrop of war and change, her thirty-eighth bestselling novel is both living history and outstanding fiction, revealing the stark truth about the betrayal of Americans by their own government...and the triumph of a woman caught between cultures and determined to survive.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "McNally's Caper",
        "Authors": "By Sanders, Lawrence",
        "Description": "Palm Beach's premier man-about-crime plunges to the perilous depths of high society - in the loopiest Archy McNally thriller yet!If it were a soap opera, it might be called The Young and the Feckless. But McNally's Caper is real-life, real-death family meshugass. The clan in question bears the proud name Forsythe, but the devious saga played out within the fortresslike walls of their baronial estate is far too raw ever to make it to Masterpiece Theatre.Called in by patriarch Griswold Forsythe II - a client of Archy's father, who even the closemouthed senior McNally admits is pretty dull - our happy-go-lucky sleuth commences a covert search to discover which intimate relative is lifting the family valuables piece by piece.Before he solves that puzzle, Archy's in for a sordid rainbow of surprises that gives the lie to the dynasty's colorless repute. First there are the steamy Forsythe females hurling themselves his way. Then the buried scandals that keep bubbling up wherever he looks. But not until the murder of pater-familias do things finally boil over - into a white-hot crucible of corruption that menaces the guilty and the innocent alike.Mixing suspense, sensuality and high jinks with a Cordon Bleu chef's expertise, Lawrence Sanders' McNally's Caper is a thoroughly delectable read.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Putnam",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Biggest Valentine Ever",
        "Authors": "By Kroll, Steven and Bassett, Jeni (ILT)",
        "Description": "Clayton and Desmond are back in this companion to the bestselling book THE BIGGEST PUMPKIN EVER! A sheet of colorful foil stickers is bound into the book for extra valentine fun!When Mrs. Mousely asks her class to make valentines, Clayton and Desmond decide to make one together and give it to their teacher as a surprise. But things don't go as planned. First Clayton puts too much glitter on the card. Then Desmond puts on too many hearts. Soon the friends are arguing and they rip the card in half. \"I'm going to make my own valentine!\" they both say and go home in a huff. But then Desmond and Clayton realize that by working together they can make the biggest, best valentine ever! Kids can use the colorful foil stickers to make their own valentines!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Valentine's Day",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "The Best Thing About Valentines (Scholastic)",
        "Authors": "By Hudson, Eleanor and Melcher, Mary C. (ILT)",
        "Description": "A child makes, sends, and--best of all--receives valentine's in this 8x8 holiday paperback.Valentines, valentines, big ones and small--I love making valentines. I love it all!Ribbons, glitter, lace, and paste are all fun things to use when creating special Valentine's Day cards. Young children will enjoy reading this sweet rhyming story, narrated by a young child who loves to make cards and give them to family, friends, and classmates. But the very best thing of all is getting your very own valentines on Valentine's Day!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Valentine's Day",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "FIGHTING TERRORISM P",
        "Authors": "By Netanyahu, Benjamin",
        "Description": "In this innovative and concise work, Israeli politician Benjamin Netanyahu offers a compelling approach to understanding and fighting the increase in domestic and international terrorism throughout the world. Citing diverse examples from around the globe, Netanyahu demonstrates that domestic terrorist groups are usually no match for an advanced technological society which can successfully roll back terror without any significant curtailment of civil liberties. But Netanyahu sees an even more potent threat from the new international terrorism which is increasingly the product of Islamic militants, who draw their inspiration and directives from Iran and its growing cadre of satellite states. The spread of fundamentalist Islamic terrorism, coupled with the possibility that Iran will acquire nuclear weapons, poses a more frightening threat from an adversary less rational and therefore less controllable than was Soviet Communism. How democracies can defend themselves against this new threat concludes this provocative book.",
        "Category": " Political Science , Terrorism",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Love Notes",
        "Authors": "By Barbour Books Staff",
        "Description": "",
        "Category": "",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "On the Run: A Novel",
        "Authors": "By Johansen, Iris",
        "Description": "For eight years, single mother Grace Archer has been living a picture-perfect life raising her daughter on a horse farm in the small town of Tallanville, Alabama.   Watching Frankie grow into a talented and confident young girl has made Grace as happy as any mother could hope to be.  Happy enough, even, to forget the past.  But the past never quite goes away.  Which is why a certain charismatic man also moved to Tallanville eight years ago to watch over her.  But when violence threatens to shatter Grace and Frankie's idyllic home, the waiting is over.  The ghosts of the past have returned.  And they're hungry for blood.  Now Grace must resume an identity she thought she had cast off forever, and match wits with an opponent as deadly as he is cunning.  The prize: an extraordinary secret that only she can unfold.  The forfeit: losing the thing more precious to her than life itself.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "BANTAM",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Kilo Class",
        "Authors": "By Robinson, Patrick",
        "Description": "It's one of the stealthiest, most dangerous underwater warships ever built.and it's about to set off World War III.   Silent at less than five knots and capable of a massive nuclear warhead punch, it's the 240-foot Russian Kilo Class submarine. Strapped for hard cash, the Russians have produced ten new Kilos for Beijing. The Chinese have already received three of the subs and now the last seven are ready to be delivered—a code-red situation the Pentagon must avert. Armed with a full strike force of Kilos, China can cripple American interests, shatter the balance of power, and successfully achieve the unthinkable in the Pacific Rim. But not if the newly appointed National Security Adviser, wily Texas admiral Arnold Morgan, can stop them—using the navy's deadliest covert forces.   In a breathtaking race against time, a team of Navy SEALs penetrates deep inside the remote waters of northern Russia on a daring mission of destruction. And in the icy darkness of the North Atlantic, a brave U.S. captain takes his 7,000-ton nuclear vessel on a hair-raising trip beneath the polar ice cap to head off a powerful Russian cordon determined to transport the Kilos at any cost. Horns locked in a tense game of geomilitary survival, each of the world' three most powerful nations knows that one mistake will mean all-out war.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The Hunt (27)",
        "Authors": "By Diehl, William",
        "Description": "As the world trembles with the approach of World War II, a woman dies at the hands of Hitler's henchmen. Her murder forever changes her lover, Francis Scott Keegan, a relentless anti-Nazi mercenary, who becomes locked in a desperate cat-and-mouse game with the Third Reich's perfect spy, a man of a thousand faces. In an arena that encompasses presidents and gangsters, spies and sirens, the deadly present and the dark past, Keegan pursues his elusive quarry into the cutting edge of world events--and into the secret inner workings of a terrifying mission known only as \"27.\"\"The best book of its kind since THE DAY OF THE JACKAL...Edge-of-the-seat stuff.\"PEOPLE",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "The Gospel According to Larry",
        "Authors": "By Tashjian, Janet",
        "Description": "Josh Swensen is not your average 17-year-old. At the age of two, he was figuring out algebraic equations with colored magnetic numbers. He is a prodigy who only wants to make the world a better place. Josh’s wish comes true when his virtual alter ego, Larry, becomes a huge media sensation. Larry has his own Web site where he posts sermons on anti-consumerism and has a large following of adults and teens. Meanwhile, Larry’s identity is a mystery to everyone. While it seems as if the whole world is trying to figure out Larry’s true identity, Josh feels trapped inside his own creation. What will happen to the world, and to Larry, if he is exposed?",
        "Category": " Young Adult Fiction , Social Themes , General",
        "Publisher": "Dell Laurel Leaf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Good Grief: A Constructive Approach to the Problem of Loss",
        "Authors": "By Westberg, Granger E.",
        "Description": "A theologian describes the ten stages of grief through which an individual must pass in order to return to a meaningful existence",
        "Category": " Family & Relationships , Death, Grief, Bereavement",
        "Publisher": "Fortress Press",
        "Price Starting With ($)": "12.95",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "Strange deaths: More than 375 freakish fatalites",
        "Authors": "By Simmons, Ian, Sieveking, Paul, and Stevenson, Val",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Wisdom of Old-Time Television, The: Common Sense and Uncommon Genius from the Golden Age of Television",
        "Authors": "By Freeman, Criswell (EDT)",
        "Description": "Many years have passed since Uncle Miltie and Howdy Doody were fresh faces on the small screen, but America still loves old-time television. This book weaves a story of humor, hope and inpiration through the words of our favorite TV legends. Enjoy the entertaining advice of: Lucille ball, Jackie Gleaason, Danny Thomas, Rod Serling, Audrey Meadows, Loretta Young, Walt Disney and Many More.",
        "Category": " Performing Arts , Television , General",
        "Publisher": "Walnut Grove",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Kisses...",
        "Authors": "By Tabori, Lena",
        "Description": "Hollywood's most famous and infamous kisses are captured in high-quality photographs and recalled in their film context in a romantic look at movie history",
        "Category": " Performing Arts , General",
        "Publisher": "Citadel Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Trick or Treat, It's Halloween! (Pictureback(R))",
        "Authors": "By Keep, Linda Lowery and Keep, Richard",
        "Description": "This unique rhyming Pictureback® takes young kids through the celebrated routine of trick-or-treating--alphabetically! \"Apples dunked in caramel goo, Bats out playing peekaboo, Cats come creeping, black and lean. Trick or treat--it's Halloween!\" The striking collage-style art in bold colors is sure to be a hit with little trick-or-treaters everywhere.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Halloween",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "I Like Pumpkins",
        "Authors": "By Smath, Jerry",
        "Description": "From talented author/illustrator Jerry Smath comes a rhyming story about a little girl who likes pumpkins!Some pumpkins are tall; some pumpkins are squat.Some pumpkins are big; some pumpkins are not.It's that time of year again! The Halloween season is all about yummy candy, ghosts and goblins, and of course, pumpkins. In Jerry Smath's latest Halloween 8x8 title, a little girl tells her favorite things about pumpkins--like pumpkin masks, pumpkin seeds, and scary jack-o'-lanterns. But her favorite of all is . . . delicious pumpkin pie!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Halloween",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Vanishing Pumpkin",
        "Authors": "By Johnston, Tony and dePaola, Tomie (ILT)",
        "Description": "A classic Halloween story about a pumpkin gone missing is certain to delight readers of all ages!When a 700-year-old woman and an 800-year-old man want to make pumpkin pie on Halloween, they can’t find their pumpkin. “Our pumpkin’s been snitched,” cries the woman. And off they go to find it.   “A good bet for Halloween story hours.”—School Library Journal   “There can never be enough Halloween stories. This one is appealing, participatory, fast-paced and a delight in the telling.”—Children’s Book Review Service",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Stone Soup (Aladdin Picture Books)",
        "Authors": "By Brown, Marcia",
        "Description": "Clever soldiers outwit greedy townspeople with the creation of a special soup in this cherished classic, a Caldecott Honor book.First published in 1947, this picture book classic has remained one of Marcia Brown's most popular and enduring books. This story, about three hungry soldiers who outwit the greedy inhabitants of a village into providing them with a feast, is based on an old French tale.",
        "Category": " Juvenile Fiction , Legends, Myths, Fables , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Aesop's Fables (Owlet Book)",
        "Authors": "By Hague, Michael (ILT) and Aesop (EDT)",
        "Description": "\"Please, O King,\" cried the Mouse, \"spare me this time and I shall never forget your kindness. Someday I may be able to repay you.\" The Lion was so amused by this idea that he let the poor creature go. In sixth-century Greece, it is said, there lived a slave named Aesop who was renowned for his brilliant storytelling. The collection of sly, witty fables that bears his name continues to delight readers of all ages. Michael Hague has selected his favorite fables and illustrated them with beautiful paintings in the style that has made his work so popular.",
        "Category": " Juvenile Fiction , Legends, Myths, Fables , Greek & Roman",
        "Publisher": "Square Fish",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Nickel and Dimed: On (Not) Getting By in America",
        "Authors": "By Ehrenreich, Barbara",
        "Description": "The New York Times bestseller, and one of the most talked about books of the year, Nickel and Dimed has already become a classic of undercover reportage.Millions of Americans work for poverty-level wages, and one day Barbara Ehrenreich decided to join them. She was inspired in part by the rhetoric surrounding welfare reform, which promised that any job equals a better life. But how can anyone survive, let alone prosper, on $6 to $7 an hour? To find out, Ehrenreich moved from Florida to Maine to Minnesota, taking the cheapest lodgings available and accepting work as a waitress, hotel maid, house cleaner, nursing-home aide, and Wal-Mart salesperson. She soon discovered that even the \"lowliest\" occupations require exhausting mental and physical efforts. And one job is not enough; you need at least two if you intend to live indoors.Nickel and Dimed reveals low-wage America in all its tenacity, anxiety, and surprising generosity -- a land of Big Boxes, fast food, and a thousand desperate strategies for survival. Instantly acclaimed for its insight, humor, and passion, this book is changing the way America perceives its working poor.",
        "Category": " Social Science , Poverty & Homelessness",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Toddler Play (Gymboree)",
        "Authors": "By Masi, Wendy S. and Leiderman, Roni Cohen",
        "Description": "Children are naturally ready to learn, and parents are eager to teach them. TODDLER PLAY was created specifically to help parents teach their children through age-appropriate play that is fun and relaxed. Based on the content of the successful Gymboree's Play & Music Programs, this book is a \"recipe book\" of games, finger rhymes, nursery songs, and craft exercises that parents can use to help their children develop physical, cognitive, emotional, and social skills.Filled with fabulous color and fun photos, the book is structured chronologically to match key stages in a child's physical and intellectual development. Written with busy parents in mind, the book contains many quick-reference features, such as a skills checklist, cross-referencing of similar activities, and an index listing games by type of activity, such as art, ball games, discovery games, music and movement exploration, water play, etc. With over 100 activities any toddler will enjoy, quality playtime is just a page away.Check out the great features of TODDLER PLAY:Contains over 100 toddler-tested activities for quality play time.Features exciting, age-appropriate activities, clearly labeled to help parents match activities with the child's abilities.Written for parents of children ages 1 to 3 years.Includes a wide variety of play activities, such as active physical games for strengthening growing muscles or quieter creative games for stimulating the imagination and fostering independence.Developed in consultation with the play experts at Gymboree Play & Music Programs.Contains a helpful glossary of key terms used in child development.",
        "Category": " Family & Relationships , Life Stages , Infants & Toddlers",
        "Publisher": "Creative Publishing int'l",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Connecting Spheres: Women in the Western World, 1500 to the Present",
        "Authors": "By Boxer, Marilyn J., Quataert, Jean H., and Scott, Joan",
        "Description": "",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "The Debutante Divorcee",
        "Authors": "By Sykes, Plum",
        "Description": "As she navigates the perils of glamorous high-society New York, newlywed Sylvia Mortimer encounters Lauren Blount, a very rich, thin, pretty, and reckless member of Manhattan's Debutante Divorcée set and the city's most notorious Husband Huntress, who sets her sights on Sylvia's own spouse and awakens Sylvia's fears of adultery. By the author of Bergdorf Blondes. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Miramax",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Loose Screws (Red Dress Ink)",
        "Authors": "By Templeton, Karen",
        "Description": "Just when she thinks life cannot get any worse after being left at the altar by her congressman fiancT, thirty-year-old Ginger Petrocelli encounters her first love, now a cop, who is searching for her missing fiancT, loses her job, and is forced to move in with her zany mother and grandmother, both of whom unexpectedly help her decide what she really wants in life. Original. 125,000 first printing.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Red Dress Ink",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "44 Scotland Street (44 Scotland Street Series, Book 1)",
        "Authors": "By McCall Smith, Alexander and McIntosh, Iain (ILT)",
        "Description": "44 SCOTLAND STREET - Book 1 The residents and neighbors of 44 Scotland Street and the city of Edinburgh come to vivid life in these gently satirical, wonderfully perceptive serial novels, featuring six-year-old Bertie, a remarkably precocious boy—just ask his mother.  Welcome to 44 Scotland Street, home to some of Edinburgh's most colorful characters.  There's Pat, a twenty-year-old who has recently moved into a flat with Bruce, an  athletic young man with a keen awareness of his own appearance. Their neighbor, Domenica,  is an eccentric and insightful widow. In the flat below are Irene and her appealing  son Bertie, who is the victim of his mother’s desire for him to learn the saxophone  and italian–all at the tender age of five.Love triangles, a lost painting, intriguing  new friends, and an encounter with a famous Scottish crime writer are just a few  of the ingredients that add to this delightful and witty portrait of Edinburgh society,  which was first published as a serial in The Scotsman newspaper.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "How to Sell Yourself on an Interview",
        "Authors": "By Girard, Joe",
        "Description": "",
        "Category": "",
        "Publisher": "Not Avail",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Goodman and Gilman's The pharmacological basis of therapeutics",
        "Authors": "By Goodman, Louis S., Gilman, Alfred",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "9.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Patron Saint of Liars",
        "Authors": "By Patchett, Ann",
        "Description": "St. Elizabeth's is a home for unwed mothers in the 1960s. Life there is not unpleasant, and for most, it is temporary. Not so for Rose, a beautiful, mysterious woman who comes to the home pregnant but not unwed. She plans to give up her baby because she knows she cannot be the mother it needs. But St. Elizabeth's is near a healing spring, and when Rose's time draws near, she cannot go through with her plans, not all of them. And she cannot remain forever untouched by what she has left behind ... and who she has become in the leaving.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "HarpPeren",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Betty Crocker's Cookbook: New and Revised Edition",
        "Authors": "By Betty Crocker",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "8.07",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Principles and Practices of Tqm",
        "Authors": "By Cartin, T. J.",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Asq Pr",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "More Wok Cookery",
        "Authors": "By Dyer, Ceil",
        "Description": "Describes the basic wok cooking methods and presents recipes for the preparation of appetizers, vegetables, meat dishes, seafood, sauces, and desserts with a wok",
        "Category": " Cooking , Methods , Wok",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    }
]