[
    {
        "Title": "Aaron's Rod",
        "Authors": "By D. H Lawrence",
        "Description": "",
        "Category": "",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "9.25",
        "Publish Date": {
            "Month": "January",
            "Year": "1950"
        }
    },
    {
        "Title": "Virginia Folk Legends (Publications of the American Folklore Society. New Series)",
        "Authors": "By Barden, Thomas E. (EDT)",
        "Description": "What do devil dogs, witches, haunted houses, Daniel Boone, Railroad Bill, \"Justice John\" Crutchfield, and lost silver mines have in common? All are among the subjects included in the vast collection of legends gathered between 1937 and 1942 by the field workers of the Virginia Writers Project of the WPA. For decades following the end of the project, these stories lay untouched in the libraries of the University of Virginia. Now, folklorist Thomas E. Barden brings to light these delightful tales, most of which have never been in print. Virginia Folk Legends presents the first valid published collection of Virginia folk legends and is endorsed by the American Folklore Society.",
        "Category": " Social Science , Folklore & Mythology",
        "Publisher": "University of Virginia Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "The Sweet Far Thing (Gemma Doyle, Book 3)",
        "Authors": "By Bray, Libba",
        "Description": "IT HAS BEEN A YEAR OF CHANGE since Gemma Doyle arrived at the foreboding Spence Academy. Her mother murdered, her father alaudanum addict, Gemma has relied on an unsuspected strength and has discovered an ability to travel to an enchanted world called the realms, where dark magic runs wild. Despite certain peril, Gemma has bound the magic to herself and forged unlikely new alliances. Now, as Gemma approaches her London debut, the time has come to test these bonds.The Order - the mysterious group her mother was once part of - is grappling for control of the realms, as is the Rakshana. Spence's burned East Wing is being rebuilt, but why now? Gemma and her friends see Pippa, but she is not the same. And their friendship faces its gravest trial as Gemma must decide once and for all what role she is meant for.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "5.4",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Great Expectations: Your All-in-One Resource for Pregnancy & Childbirth",
        "Authors": "By Jones, Sandy and Jones, Marcie",
        "Description": "Highly praised by expectant parents and childbirth educators alike, this comprehensive pregnancy reference (704 pages) is specifically designed for today’s hurried moms (and dads) for getting them through pregnancy and early baby care. Numerous navigation aides in the volume help parents to rapidly access critical information.The beautifully-illustrated, Your Pregnancy Week-by-Week section details every body change for both Mom and Baby for nine months with hundreds of timely coping tips. The Managing Your Pregnancy section includes: strategies for planning maternity leave; exercise guidelines; what to eat and what to avoid; safe and unsafe medications; and how to locate the best childcare and pediatricians. The illustrated Baby Gear Guide warns about unsafe products and offers solid, research-based facts for choosing the safest car seats, cribs, soft carriers, baby diapers and clothing. Your Guide to Giving Birth is the most up-to-date labor and birth resource available to parents today.Based on brand-new medical evidence, it helps families to realistically plan for labor and delivery, including detailed \"you are there\" descriptions for every major intervention and medication they’re likely to encounter -- such as epidurals, inductions and cesarean sections. You and Your Baby presents a complete guide for the first six months of life after birth.There's mom-friendly advice for post-birth recovery, and baby-sensitive care strategies for feeding, bathing, diapering, soothing and helping a baby to sleep. The book’s Resource Guide lists over 100 of the best Internet sites for parents. The comprehensive Pregnancy Dictionary translates 200-plus pregnancy and medical terms into easy-to-understand lay language.\"I have this book as well as What to Expect When Expecting, and I find this book to be so much better as it gives a week to week breakdown of what is happening to both mom and baby. I pick up this book each week as my pregnancy progresses and even though not every issue listed in each week's summary necessarily happens to me, it's good to know what I 'could' expect. I would highly recommend this book to any expecting mom!\" --Cynthia, an expectant mother\"If you are searching for one book for your pregnancy or for that one book to refer all of your expectant clients to, this book is by far the greatest achievement in childbirth education reading material! Sandy Jones and her daughter Marcie Jones have included absolutely everything an expectant woman and her family needs to know. This book should be on everyone's recommended reading list\"--Connie Livingston, BS, RN, FACCE (Dona), CCE, CLD,birthsource.com\"Great Expectations is the perfect resource for moms-to-be. Sandy and Marcie Jones speak to the expectant mother of today in a friendly, approachable tone, and present their thorough information in a way that's great for both quick look-ups, and in-depth reading.\"--Stacia Ragolia, VP, Community & Parenting, iVillage.com\"Accurate, comprehensive, empowering, and current. I see this as being the new Dr. Spock for pregnancy...This is definitely a book I will recommend to my clients who are planning a pregnancy or currently pregnant.\"--Cherie C. Binns, RN, BS, MSCN",
        "Category": " Health & Fitness , Pregnancy & Childbirth",
        "Publisher": "Sterling",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Champions Body-for-LIFE",
        "Authors": "By Carey, Art and Body-for-LIfe Champions and Challengers",
        "Description": "The all-new official guide to the Body-for-LIFE Challenge, with success secrets and tips to help you win your own personal Body-for-LIFE Challenge, by Body-for-LIFE Challengers and Champions from the past 10 years. Champions Body-for-LIFE is not just another diet or fitness book—it's a book of personal transformation. The Body-for-LIFE 12-week journey has changed the lives of millions. What makes it so successful?It's Simple. It Works.All it takes:12 weeks4 hours of exercise per week6 small, balanced, and nutritious meals per day—never be hungry againNow, Body-for-LIFE Champions and Challengers share how they created new and better lives for themselves, simply by following these three rules:1. Know your reasons for changing (Chapter 2)2. Write them down (Chapter 3)3. Get started (Chapter 4)You do have the power to change your body, your mind, your life.Read how men and women become Champions as you follow the 12-week story of two Body-for-LIFE Challengers. Mark Unger, a major in the U.S. Marine Corps, and Alexa Adair, a college student, share their personal Journeys of Transformation—from their Decisive Moments, to Starting the Challenge, Week 12, and a year later. Week by week, they chronicle the excitement, the tough moments, and the life-transforming experience of finishing their own personal Challenges.Science Shows Body-for-LIFE WorksFor more than 10 years, millions of people have proven with their real-life transformations that Body-for-LIFE works. Now science shows it works, too! In a clinical study of overweight men and women, the people who followed Body-for-LIFE:Lost approximately twice as much body and belly fat as the control group and moderate exercise higher-carb groupDecreased body fat by 21 percent on averageDecreased body weight by 11 pounds on averageDecreased belly fat by 26 percent on averageChampions Body-for-LIFE is for everyone—whether you're starting your first Body-for-LIFE Challenge or your fourth.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "6.51",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "How to Say It: Choice Words, Phrases, Sentences, and Paragraphs for Every Situation, Revised Edition",
        "Authors": "By Maggio, Rosalie",
        "Description": "Provides lists of words, phrases, sentences, and paragraphs that help letter writers know what to say and how to say it when writing such letters as cover letters, fundraising letters, invitations, and refusals.",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Prentice Hall Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Into the Garden: A Wedding Anthology : Poetry and Prose on Love and Marriage",
        "Authors": "By Hass, Robert and Mitchell, Stephen (EDT)",
        "Description": "An anthology of poetry and prose suitable for reading at wedding ceremonies features unconventional readings from Chinese, African, native American, Buddhist, Christian, and other cultures. 35,000 first printing. $35,000 ad/promo.",
        "Category": " Religion , Inspirational",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Backlash (Pocket Cardinal edition)",
        "Authors": "By Morris L. West",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "American History: The New York Public Library Book of Answers",
        "Authors": "By Ochoa, George and Corey, Melinda",
        "Description": "A collection of American history trivia from the New York Public Library features intimate details about pivotal personalities and little-known events in America. Original.",
        "Category": " History , United States , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Eerdmans Handbook to the Bible",
        "Authors": "By Alexander, David and Alexander, Pat (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "William B. Eerdmans Publishing Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "God's Masterwork: A Concerto in Sixty-Six Movements (Volume 3: Hosea Through Malachi)",
        "Authors": "By Swindoll, Charles R.",
        "Description": "In the Minor Prophets of the Bible, stern-minded men proclaimed God's displeasure over sin, announced His Judgement, offered His mercy and forgiveness, and reminded people that God would keep His covenants with them. This study is for all who have struggled to follow the Lord, yet long to more clearly hear His voice.",
        "Category": " Religion , Biblical Studies , Old Testament",
        "Publisher": "Insight for Living",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Birth of Fire (Laser Books, No. 23)",
        "Authors": "By Jerry pournelle",
        "Description": "",
        "Category": "",
        "Publisher": "Laser Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1976"
        }
    },
    {
        "Title": "The Fine Wines of California",
        "Authors": "By Robert S. Blumberg, Hurst Hannum",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday & Company",
        "Price Starting With ($)": "5.59",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The View from Goose Ridge",
        "Authors": "By Bostrom, Cheryl",
        "Description": "What do barn cats, manure in a field, a pygmy goat, a lonely horse, a muddy pond, and pruning have in common? They offer lessons of grace from the life of Cheryl Bostrom, columnist for the Women of Faith Web site (which gets more than 1 million page views a month). The View from Goose Ridge  offers a refreshing look at the changing seasons in a woman's life-and a wise perspective on living a life of faith with grace and gentleness. Original observations and often unexpected applications to God's Word have made this column a word-of-mouth favorite. Women across the country are discovering the humor, hope, courage, and faith that can be found at Goose Ridge-and enjoyed by urban and rural women alike. Now readers everywhere can own a collection of the best of Cheryl's devotionals in The View from Goose Ridge. It's a fresh perspective for women of faith who need to be reminded of organic spirituality and God's down-to-earth ways with us as believers.",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Miserly Moms : Living on One Income in a Two Income Economy",
        "Authors": "By McCoy, Jonni",
        "Description": "",
        "Category": "",
        "Publisher": "GCB Publishing Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "When Families Pray: The Power of Praying Together",
        "Authors": "By Fuller, Cheri",
        "Description": "Families need prayer. In Cheri Fuller's latest release, When Families Pray, she addresses what so many parents express -- the need to slow down and connect with our God. This devotional features inspirational stories that are easy to understand for the youngest of family members, yet full of truths that reach the entire family. The format, including discussion-opener questions, encourages real conversation about the importance of prayer and God's faithfulness when we pray consistently. As families come together, children, parents, and grandparents will learn together about God's perfect plan for prayer in their family.",
        "Category": " Religion , Prayerbooks , Christian",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Tiger In The Stars",
        "Authors": "By Zach Hughes",
        "Description": "",
        "Category": "",
        "Publisher": "Laser Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Capitol Venture",
        "Authors": "By Oates, Marylouise and Mikulski, Barbara",
        "Description": "Eleanor \"Norie\" Gorzack, having been appointed to the U.S. Senate to fill her late predecessor's seat, is still a novice when it comes to Capitol Hill. Now gearing up for her own run in the November special election, Norie gets her campaign off to a rocky start when she surveys flood-ravaged Jericho County in her native Pennsylvania. There this popular front-runner finds that not everyone wants her to win, as a purported accident lands her in the hospital.While recuperating, she learns of the shocking death of Congressman Bob Bercolini, one of her truest supporters. Bercolini, an apparent victim of a random carjacking, had been hoping to meet with Norie upon her return. But about what, and why, Norie doesn't know. Finding out isn't so easy, either, with her newly selected campaign team demanding that she focus less time on solving the crime and more time on the upcoming election. Her opponent, Hank Dugdale, has allied himself with a very vocal activist group, one that is doing its best to discredit Norie and winning votes in the process.As Norie digs deep into the hotly debated issues of the campaign, another shocking murder occurs, and she begins to question whether all these loose ends could actually be tied together. But at what cost to herself? Suddenly winning the election has become the lowest priority on Norie's agenda - staying alive is her first...",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Steel, the Mist, and the Blazing Sun",
        "Authors": "By Christopher Anvil",
        "Description": "",
        "Category": "",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "July",
            "Year": "1980"
        }
    },
    {
        "Title": "Slam Dunk Mad Libs",
        "Authors": "By Price, Roger and Stern, Leonard",
        "Description": "The idea is simple. Someone asks for a part of speech: a verb, a noun, an adjective, or an adverb. We've included definitions and examples of the parts of speech in case you've forgotten. Players call out their ideas to fill in the blanks. In the end, you have a story reeling from one silly sentence to another until nothing makes sense, but it all makes you laugh. That's what you call a Mad Lib &#174, the world's greatest word game. Players have been howling with friends or laughing all to themselves for 35 years! This batch is from the sporting world; where baseball, bowling, and hockeyoeven surfing and scuba divingobecome game for hilarity. From the creators of the original Mad Libs &#174, Slam Dunk Mad Libs&#174 will score big on the bench, in the bleachers, at a tailgate partyoanywhere good sports can be found.",
        "Category": " Juvenile Fiction , Sports & Recreation , Games",
        "Publisher": "Mad Libs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Breaking Free Day by Day: A Year of Walking in Liberty",
        "Authors": "By Moore, Beth",
        "Description": "With 300,000 copies in print, Breaking Free is one of author Beth Moore’s best-selling releases to date. An empowering book for anyone held back by sin or doubt, it shows readers how to make freedom in Christ a daily reality by identifying spiritual strongholds in their lives and overcoming them through the truth of God’s Word.Now, the perennial favorite is available in a convenient day-by-day reading format, helping us find our satisfaction in God, experience His peace, and enjoy His presence with each glorious new sunrise.",
        "Category": " Religion , Christian Living , Devotional",
        "Publisher": "B&H Books",
        "Price Starting With ($)": "13.48",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "The Alien Way",
        "Authors": "By Dickson, Gordon R.",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "February",
            "Year": "1965"
        }
    },
    {
        "Title": "Human Molecular Genetics",
        "Authors": "By Strachan, Tom and Read, Andrew P.",
        "Description": "A complete, up-to-the-minute account of human molecular genetics from basic principles to current practice. Designed to engage and motivate students the text covers the organization, expression and evolution of the human genome. Features a comprehensive chapter on the latest progress in the Human Genome Project.",
        "Category": " Science , Life Sciences , Genetics & Genomics",
        "Publisher": "Wiley",
        "Price Starting With ($)": "7.0",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Swiss Family Robinson (Illustrated Classics Edition)",
        "Authors": "By Johann Wyss",
        "Description": "",
        "Category": "",
        "Publisher": "Moby Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "An Alphabet in Art",
        "Authors": "By Micklethwait, Lucy",
        "Description": "An alphabet book with a different fine-art painting for each letter. Each painting also depicts an object beginning with the appropriate letter, for the reader to identify.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "HarperCollinsChildren'sBooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Welcome to My Kitchen: A New York Chef Shares His Robust Recipes and Secret Techniques",
        "Authors": "By Friedman, Andrew and Valenti, Tom",
        "Description": "When chef Tom Valenti cooks at home for family and friends, flavors are big and bold, and preparations fast and flexible. For more than twenty years, Valenti has ranked among New York's top chefs, creating innovative and critically acclaimed menus for some of the city's most popular restaurants. Now join Valenti in the kitchen, where he reveals professional secrets for creating deep, robust flavors in your own home. Valenti offers more than 150 recipes for every occasion: Try a cup of Wild Mushroom Soup and a Sautéed Spinach Sandwich for a casual weekend lunch, or Foie Gras Ravioli with Chickpeas, Leeks, and Basil at that special dinner party. Each recipe is full of do-ahead suggestions as well as fascinating background notes on any unusual ingredients or unorthodox techniques (water, for example, is used in a number of ways to open up flavors). From tips on how to regulate heat for best flavor and texture to new uses for sugar in savory dishes, Valenti's culinary wisdom will help you cook like a chef. Welcome to My Kitchen will surprise and inspire kitchen veterans and casual cooks alike.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Fairy Tales (My First Treasury)",
        "Authors": "By Linda Dockey Graves, Barbara Lanza, Jane Maday",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Stay for Supper (Country Home)",
        "Authors": "By Henry, Linda and Hephner, Heather M. (EDT)",
        "Description": "Shares regional and country recipes from Country Home magazine for meat, seafood, chicken, soups and stews, breakfast foods, breads, vegetables, fruit, and desserts, as well as menus for special occasions",
        "Category": " Cooking , General",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Here Comes Peter Cottontail",
        "Authors": "By Nelson, Steve, Rollins, Jack, and Levy, Pamela R. (ILT)",
        "Description": "An illustrated accordion fold-out board book presentation of the beloved children's song about Peter Cottontail and his Easter activities plays the tune as the book is opened and follows Peter Cottontail's progress down the bunny trail.",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Easter & Lent",
        "Publisher": "Candy Cane Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Drawing: The Complete Course",
        "Authors": "By Smith, Stan",
        "Description": "An easy-to-follow program designed to teach amateur artists the fundamentals of drawing furnishes step-by-step instruction in the techniques of sketching simple geometric shapes, perspective, shading, shortening, movement, and style. 25,000 first printing.",
        "Category": " Art , Techniques , Drawing",
        "Publisher": "Reader's Digest",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Doors and Windows",
        "Authors": "By Time-Life Books",
        "Description": "Step-by-step illustrations and detailed instructions explain and help simplify the repair and construction of all types of windows and doors for home and garage",
        "Category": " House & Home , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "December",
            "Year": "1978"
        }
    },
    {
        "Title": "KISS Guide to Cat Care",
        "Authors": "By Duno, Steve and Walken, Christopher (FRW)",
        "Description": "Kiss the competition goodbye! Find out how to keep your cat happy and healthy with DK's KISS Guide to Cat Care. Uncover the origins of these mysterious creatures, from their feline ancestors, the Miacis, to today's fascinating breeds. Investigate the inner workings of the cat in simple diagrams. Master cat-care basics, from food and toilet training, to exercise and typical costs. Learn all about cat psychology to help you understand the quirks of different breeds. Discover how to care for a sick or injured cat, when to call the vet, and what can harm your cat. Find out about behavioral problems and tips for dealing with all personalities, from furniture scratchers to attention-seekers. The Keep It Simple Series is the new standard in how-to books! Written by leading experts, each book includes full-color photographs and illustrations throughout, making these the first and only truly accessible guides for beginners. The KISS format is designed to help readers build confidence from the start, and learn gradually and thoroughly to the very last page. Much more than introductions to various subjects, these inspiring and innovative books are the ones that readers can trust!",
        "Category": " Pets , Cats , General",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "6.93",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "The Eating Well Cookbook: Favorite Recipes from Eating Well, the Magazine of Food & Health",
        "Authors": "By Martin, Rux, Jamieson, Patricia, and Hiser, Elizabeth (EDT)",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Eating Well Book",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "California Wine Lover's Cookbook",
        "Authors": "By Hebert, Malcolm",
        "Description": "This kitchen companion features the top 100 award-winning recipes from the Wine Institute’s National Cooking with Wine Contest. They range From Artichoke Appetizer with Wine and Cold Apricot Soup to Limehouse Chicken and Pumpkin Beef Stew, these recipes were culled from more than 2,800 submissions, and featured recipe was screened and tested in order to provides readers with the most unique and reliable eating options. An in-depth chapter on California wine, a wine and food chart, and cooking with wine tips are also included.",
        "Category": " Cooking , Beverages , Alcoholic , Wine",
        "Publisher": "Wine Appreciation Guild",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "Sunset Seafood Cook Book",
        "Authors": "By Sunset Books",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Lane Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Cooking Light Chicken Cookbook",
        "Authors": "By McIntosh, Susan M. (EDT)",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Poultry",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Garlic 101 Savory & Sed Rec AL",
        "Authors": "By Kreitzman, Sue",
        "Description": "Discusses the buying, storing, and use of garlic and offers a variety of recipes for appetizers, soups, sauces, seafood, meats, pasta, and vegetables flavored with garlic",
        "Category": " Cooking , Specific Ingredients , Vegetables",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "Coming Up for Air: How to Build a Balanced Life in a Workaholic World",
        "Authors": "By Sawi, Beth",
        "Description": "A practical guide to balancing work and life in a workobsessed culture instructs readers in how to set priorities, carve out more personal time, confront the tradeoff between home life and ambition, and understand the effects of guilt and job security on personal decisions.",
        "Category": " Self-help , Stress Management",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Stolen Figs: And Other Adventures in Calabria",
        "Authors": "By Rotella, Mark",
        "Description": "Calabria is the toe of the boot that is Italy -- a rugged  peninsula where grapevines and fig and olive trees cling to the  mountainsides during scorching summers. Calabria is also a seedbed of  Italian-American culture; in North America, more people of Italian  heritage trace their roots to Calabria than to almost any other region  in Italy.Mark Rotella's Stolen Figs -- named a Best Travel Book of 2003 by Condé Nast Traveler -- is  a marvelous evocation of Calabria. A grandson of Calabrese immigrants,  Rotella persuades his father to visit the region for the first time in  thirty years; once there, he meets Giuseppe, a postcard photographer who  becomes his guide. As they travel around the region, Giuseppe initiates  Rotella -- and the reader -- into its secrets: how to make a soppressata and 'nduja, and, of course, how to steal a fig without committing a crime. Stolen Figs is a model travelogue -- at  once charming and wise, and full of an earthy and unpretentious sense  of life that now, as ever, characterizes Calabria and its people.",
        "Category": " Travel , Europe , Italy",
        "Publisher": "North Point Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Pero",
        "Authors": "By Tim Burtner",
        "Description": "",
        "Category": "",
        "Publisher": "Savage River Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Train",
        "Authors": "By Dexter, Pete",
        "Description": "Train is an 18-year-old black caddy at an exclusive L.A. country club. He is a golf prodigy, but the year is 1953 and there is no such thing as a black golf prodigy. Nevertheless, Train draws the interest of Miller Packard, a gambler whose smiling, distracted air earned him the nickname “the Mile Away Man.” Packard’s easy manner hides a proclivity for violence, and he remains an enigma to Train even months later when they are winning high stakes matches against hustlers throughout the country. Packard is also drawn to Norah Still, a beautiful woman scarred in a hideous crime, a woman who finds Packard’s tendency toward violence both alluring and frightening. In the ensuing triangular relationship kindness is never far from cruelty.In Train, National Book Award-winning Pete Dexter creates a startling, irresistibly readable book that crackles with suspense and the live-wire voices of its characters.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Inner Circle (Private, Book 5)",
        "Authors": "By Brian, Kate",
        "Description": "Reed Brennan arrived at Easton Academy expecting to find an idyllic private school experience -- challenging classes, adorably preppy boys, and a chance to create a new life for herself. Instead, she discovered lies, deception, blackmail, and...murder. But, thankfully, the killers were caught and the nightmare is finally over.   Now, with a new school year ahead of her, Reed steps back on Easton's ivy-covered campus ready to start over. So when the headmaster announces that billings is forbidden from holding their traditional, secretive initiation, Reed is relieved. She champions the new rules and the six new girls the administration has picked to live in Billings Hall: Constance, Missy, Lorna, Kiki, Astrid, and newcomer Sabine.   But Reed's fellow Billings resident and new nemesis, Cheyenne Martin, believes the changes are a mockery of Billings history. Despite the new rules, Cheyenne vows to keep the old ways alive, no matter what -- or who -- stands in her way...",
        "Category": " Young Adult Fiction , School & Education , General",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Tempted (It Girl, Book 6)",
        "Authors": "By Von Ziegesar, Cecily",
        "Description": "When Jenny Humphrey confessed to a crime she didn't commit-starting the rampant fire that burned down Miller Farm-she thought her life at elite Waverly Academy was over. But her last-minute escape from expulsion made her the most talked-about girl in school. What nobody knows is who saved her. Now at the annual Halloween masquerade ball, Jenny has a plan to unveil her secret admirer.     Callie Vernon knows who her Prince Charming is: Easy Walsh. But when he discovered she and Tinsley Carmichael tried to get Jenny kicked out, Easy dumped her on the spot. Now Callie is dressing up as Cinderella in hopes of winning back his heart. Can she convince him she's the one before the clock strikes midnight? Or will her glass slipper-and her heart-be permanently broken?      Everyone wants a fairytale ending. But there can only be one It Girl.     The sixth scandalous novel in the New York Times bestselling series about the naughty hijinx at an elite East Coast boarding school.",
        "Category": " Young Adult Fiction , School & Education , General",
        "Publisher": "Poppy",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Official Guide To The Smithsonian National Museum of Natural History",
        "Authors": "By Barry, Sharon L., Faitoute, Robin A., Grusin, Sarah, and Jones, Elizabeth",
        "Description": "With more than 124 million specimens, the Smithsonian's National Museum of Natural History houses one of the world's most important collections of natural history artifacts. This lavishly illustrated guidebook offers a beautiful tour and souvenir of the exciting collections.Starting with the history of the museum and a peek behind the scenes, readers then enter the museum through the Rotunda, where they are greeted by the famous elephant diorama—the world's largest mounted specimen of this enormous mammal. The tour continues into the Janet Annenberg Hooker Hall of Geology, Gems, and Minerals, home to the legendary Hope Diamond. The Fossils section traces the history of life on earth, from the earliest organisms to the great diversity of plants and animals in the modern world. Biology features living species, including the incredible array of furry creatures in the brand new Kenneth E. Behring Family Hall of Mammals. The Anthropology section examines human evolution, exploring cultures from all over the globe. The book's final section is devoted to experiences beyond the museum galleries—the IMAX theater, Jazz Café, and naturalist center in Leesburg, Virginia, where visitors get hands-on experience doing scientific research. This sturdy, flexibound guide also includes phone numbers, directions, hours, and all the other essential information needed to ensure a rewarding visit.",
        "Category": " Travel , Museums, Tours, Points of Interest",
        "Publisher": "Smithsonian Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Scuffy the Tugboat (Little Golden Storybook)",
        "Authors": "By Crampton, Gertrude and Gergely, Tibor (ILT)",
        "Description": "",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Johnny Unitas: America's Quarterback",
        "Authors": "By Sahadi, Lou",
        "Description": "Offering an in-depth look into the private life behind one of the most important athletes of the 20th century, this comprehensive biography of Johnny Unitas explores the man who made the quarterback position the crux of a football team's offense and was an icon to millions of fans across the country. From his upbringing near the Monongahela River and becoming the “Golden Arm” to his retirement and battle with numerous physical ailments, this book reveals how he was affected by his boss's bets that were as much as $1 million per game and his livid anger at Colts management over his trade to Chargers. It also includes more than 15,000 words of never-before-published commentary directly from Unitas himself about his career, fame, moments of great personal pride, and others he'd rather forget.",
        "Category": " Sports & Recreation , Football",
        "Publisher": "Triumph Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Mutants A Science Fiction Adventure",
        "Authors": "By Gordon Dickson",
        "Description": "",
        "Category": "",
        "Publisher": "Collier Books / Macmillan Co Inc [1973]",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Encouragement for Life: Words of Hope And Inspiration",
        "Authors": "By Swindoll, Charles R.",
        "Description": "Every book by best-selling author Charles R. Swindoll shares one quality-the rare ability to touch the reader with positive and assuring words of encouragement. This book is a collection of some of the most uplifting thoughts on paper from one of the most beloved and personable authors of our day. In a world touched by storms, conflicts, and heartache, Encouragement for Life reminds us where we can find the Eternal Source of encouragement and hope.",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Cat's Cradle (Klutz Activity Kit) 9.44\" Length x 0.5\" Width x 5.75\" Height",
        "Authors": "By Johnson, Anne Akers",
        "Description": "Kids have been looping string around their fingers to make cool patterns ever since the invention of string and fingers, passing the skill from generation to generation through some mysterious recreational osmosis. In today’s high tech world, though, people have completely forgotten how to make The Cup and Saucer, The Witch’s Broom, and Jacob’s Ladder. Thank goodness for Cat’s Cradle. Since its introduction in 1993, Cat’s Cradle has sold more than 3.9 million copies worldwide. That means we’ve introduced at least 39,000,000 fingers to the joy of string games. We couldn’t be prouder. The four-millionth copy will sell any day now and, to prepare for that happy occasion, we’ve given the book a brand-new cover. Inside, the simple instructions and ultra-clear tech art remain as foolproof as ever. And, of course, the book still comes with a never-ending loop of rainbow-colored string. Some things are just too good to mess with.",
        "Category": " Juvenile Nonfiction , Games & Activities , General",
        "Publisher": "Klutz",
        "Price Starting With ($)": "8.84",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Chapman Piloting: Seamship & Small Boat Handling",
        "Authors": "By Maloney, Elbert",
        "Description": "",
        "Category": "",
        "Publisher": "Morrow, William Company",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "The Mideast Peace Process: An Autopsy",
        "Authors": "By Kozodoy, Neal (EDT)",
        "Description": "Launched in 1993 after an agreement at Oslo, the Middle East ?peace process” collapsed in bloodshed after seven fitful years marked by escalating Arab rejectionism and terror. Tracing the evolving history of that immensely costly experiment in political wishful thinking, the essays included in the first (2002) edition of this book offered, as one Israeli reviewer put it, a ?timely” and ?important” collection of ?jeremiads, forewarnings of the perils to Israel should it ignore, or seek to fudge, the hard reality of its neighbors’ continuing malevolence.”  This new and expanded edition, drawn like the first from the pages of Commentary, takes note of a much larger ?hard reality,” brought home to Americans by the mass-murder attacks of September 11, 2001, and since then to the West as a whole by the unrelenting jihadist campaign against democratic civilization.  While retaining many of the essays from the first edition, this new volume brings the story of the Mideast conflict up past the Israeli disengagement from Gaza in the summer of 2005. It is a story still steeped in blood?but also, thanks in large part to the determination of the Israeli people and the vigorous American response to Islamist terror, one that may at last contain the seeds of a more realistic and therefore more hopeful future.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Encounter Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Seven-Day Magic (Tales of Magic)",
        "Authors": "By Eager, Edward and Bodecker, N. M. (ILT)",
        "Description": "“Luckily for Edward Eager’s fans, the children in his latest book are just as lively and literary as those in Half Magic.”--The New York Times Book Review",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Harcourt, Brace & World",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Gray Rabbit's Odd One Out (Little Rabbit Books)",
        "Authors": "By Baker, Alan",
        "Description": "Where's my book? wonders Gray Rabbit one fine morning. As he surveys his messy room, he decides the only way to find his book is to clean up -- but there's always one pesky item that doesn't belong!",
        "Category": " Juvenile Nonfiction , Concepts , General",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "CELEBRATIONS: SO FAT, LOW FAT, NO FAT: More Than 100 Recipes for Special Occasions",
        "Authors": "By Rohde, Betty",
        "Description": "CELEBRATE THE GOOD TIMES!  Whether you're having a gala New Year's Eve fete, an intimate Valentine's Day dinner, or an informal Halloween get-together for the gang, bestselling author Betty Rohde will show you how to celebrate in style, without the guilt that comes from overindulgence.  There are more than 100 tempting recipes so delicious you'll never believe that they're low-fat. Serve up Hoppin' John Salad on New Year's Day, and make an Easter brunch memorable with Hash Brown Quiche. Having a crowd for Sunday supper? Ladle out some White Chicken Chili or Chicken and Dumplings. Need something more elegant? Try the Rosemary Garlic Pork Tenderloin, and finish with a light and luscious Strawberry Festival Dessert. When guests drop by for tea or coffee, welcome them with Banana Sour Cream Coffee Cake and Lemon Poppy Seed Jam Bars, and you'll be sure of a return visit.  Betty gives her time-tested tips on making every event enjoyable for both hostess and guest. She shows you how to extend your table to accommodate the biggest crowd, tells how to set up a buffet for easy serving, offers a party-planning countdown to avoid last-minute jitters, and gives advice on decorating for the holidays without blowing your budget.  More than just a cookbook, Celebrations: So Fat, Low Fat, No Fat is a guide to making any festive occasion extra special.",
        "Category": " Cooking , Entertaining",
        "Publisher": "Fireside",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "The Measure of a Man: Twenty Attributes of A Godly Man",
        "Authors": "By Getz, Gene A.",
        "Description": "In this revised edition of the best-selling book The Measure of a Man, Gene Getz delivers the newly enhanced message of what it takes to be a man of God. Men will gain encouragement for what they can be in Christ as fathers, husbands, and mentors to other men. Since 1974, The Measure of a Man has taught hundreds of thousands of men around the world how to live according to God’s direction faithfully, lovingly and spiritually. True masculinity is not measured by the strength of a man, but by these 20 biblical guidelines. With life applications and words of inspiration, here is Gene’s greatest work, fully rewritten and updated to reach the new generation of modern men.",
        "Category": " Religion , Spirituality",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Mommy Guilt: Learn to Worry Less, Focus on What Matters Most, and Raise Happier Kids",
        "Authors": "By Bort, Julie, Pflock, Aviva, and Renner, Devra",
        "Description": "\"Parents today try too hard to be superhuman, often sacrificing their own well-being -- and relationships with friends, family, even their spouses -- to meet the ever-increasing demands of their children's lives. Of course, such efforts inevitably fall short, and parents blame themselves. Mommy Guilt encourages parents to let go of unobtainable (and ill-advised) goals in favor of parenting philosophies that concentrate on the whole family. This eye-opening book presents the results of an original, never-before-published nationwide survey of over 1,300 parents -- 96% of whom reported they felt guilty about some aspect of parenting. The most common include yelling, family time, work choices, school, and sports. Mommy Guilt offers straightforward principles for handling these and many other common issues -- as well as for dealing with everyday challenges that frequently add up to feelings of guilt. Through practical, tried-and-true tips, anecdotes, quizzes, and worksheets, Mommy Guilt illustrates how moms can fend off the guilt and focus on what really matters.\"",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Little House on the Prairie: Full Color Edition (Little House, 3)",
        "Authors": "By Wilder, Laura Ingalls and Williams, Garth (ILT)",
        "Description": "Immerse yourself in Laura Ingalls Wilder’s beloved Little House series, now featuring Garth Williams’ classic art in vibrant full-color. Laura Ingalls and her family are heading to Kansas! Leaving behind their home in the Big Woods of Wisconsin, they travel by covered wagon until they find the perfect spot to build a little house on the prairie. Laura and her sister Mary love exploring the rolling hills around their new home, but the family must soon get to work, farming and hunting and gathering food for themselves and for their livestock. Just when the Ingalls family starts to settle into their new home, they find themselves caught in the middle of a conflict. Will they have to move again?The nine books in the timeless Little House series tell the story of Laura’s real childhood as an American pioneer, and are cherished by readers of all generations. They offer a unique glimpse into life on the American frontier, and tell the heartwarming, unforgettable story of a loving family.",
        "Category": " Juvenile Fiction , Historical , United States , 19th Century",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Beaded Friendship Bracelets",
        "Authors": "By Kaylee Connor",
        "Description": "",
        "Category": "",
        "Publisher": "Mud Puddle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "CliffsQuickReview Statistics",
        "Authors": "By Orton, Peter Z., Voelker, David H., and Adams, Scott V.",
        "Description": "CliffsQuickReview course guides cover the essentials of your toughest classes. Get a firm grip on core concepts and key material, and test your newfound knowledge with review questions.CliffsQuickReview Statistics introduces you to the fascinating world of statistics — a powerful tool used for finding patterns in data and inferring important connections between events in the real world. Many people find statistics confusing and intimidating; however, whether you're new to statistics or need to review for an important test, this reference will easily help clarify some of the elements of statistical reasoning and analysis. As you work your way through this review, you'll be ready to tackle such concepts asGraphical displays and numerical measuresProbability and samplingPrinciples of testing and univariate inferential testsBivariate relationshipsCliffsQuickReview Statistics can act as a supplement to your textbook and to classroom lectures. Use this reference in any way that fits your personal style for study and review — you decide what works best with your needs. You can read the book from cover to cover or just look for the information you want and put it back on the shelf for later. Here are just a few ways you can search for topics:Use the free Pocket Guide full of essential informationGet a glimpse of what you’ll gain from a chapter by reading through the Chapter Check-In at the beginning of each chapterUse the Chapter Checkout at the end of each chapter to gauge your grasp of the important information you need to knowTest your knowledge more completely in the CQR Review and look for additional sources of information in the CQR Resource CenterUse the glossary to find key terms fastWith titles available for all the most popular high school and college courses, CliffsQuickReview guides are a comprehensive resource that can help you get the best possible grades.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Julie's Journey (American Girls)",
        "Authors": "By Hunt, Robert (ILT), McDonald, Megan, and McAliley, Susan (ILT)",
        "Description": "To celebrate the country's bicentennial, Julie joins her cousins on a pioneer-style wagon train which is filled with adventures, challenges, and self discovery. Simultaneous.",
        "Category": " Juvenile Fiction , Historical , United States , 20th Century",
        "Publisher": "American Girl",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Three against The Witch World",
        "Authors": "By Andre Norton",
        "Description": "",
        "Category": "",
        "Publisher": "Ace",
        "Price Starting With ($)": "48.71",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Front Porch Tales: Warm Hearted Stories of Family, Faith, Laughter and Love",
        "Authors": "By Gulley, Philip",
        "Description": "Wisdom and Humor from the Front PorchMaster storyteller Philip Gulley shares tender and hilarious real-life moments that capture the important truths of everyday life.When Philip Gulley began writing newsletter essays for the twelve members of his Quaker meeting in Indiana, he had no idea one of them would find its way to radio commentator Paul Harvey Jr. and be read on the air to 24 million people. Fourteen books later, with more than a million books in print, Gulley still entertains as well as inspires from his small-town front porch.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Photography (An Usborne Guide)",
        "Authors": "By Peach, Susan and Butterfield, Moira",
        "Description": "",
        "Category": " Juvenile Nonfiction , Photography",
        "Publisher": "Edc Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "Success: Advice for Achieving Your Goals from Remarkably Accomplished People",
        "Authors": "By Pincott, J. (EDT)",
        "Description": "How did Hillary Clinton, Michael Bloomberg, Jeffrey Bezos, David Sedaris, and Macy Gray get where they are today - and how can you get the same edge?Success is a collection of insights from more than 400 remarkably successful people in all fields - including business, politics, entertainment, and the arts.  Here are quotes and passages from J.K. Rowling and Federico Fellini on getting started, and Steve Jobs and Tiger Woods on passion.  Here, too, are George Lucas and Bill Clinton on goals, Katie Couric and George Foreman on competition, and Edmund Hillary and Carly Fiorina on leadership.The high achievers quoted here share one crucial belief: Success is possible as long as there's passion.  If you know where you want to be but not how to get there, use Success as your guide.",
        "Category": " Reference , Quotations",
        "Publisher": "Random House Reference",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The Usborne Book of Scientists From Archimedes to Einstein",
        "Authors": "By Reid, Struan, Dennis, Peter (ILT), Fara, Patricia, and Conlin, Stephen (ILT)",
        "Description": "Offers brief profiles of scientists from ancient times to the present day, including lesser-known figures and women pioneers",
        "Category": " Juvenile Nonfiction , People & Places , General",
        "Publisher": "Edc Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "My Life So Far",
        "Authors": "By Fonda, Jane",
        "Description": "#1 NEW YORK TIMES BESTSELLER • Discover Jane Fonda, in her own words—and now experience the story of her life in the HBO documentary Jane Fonda in Five Acts.“To hold this book in your hands is to be astonished by how much living can be packed into sixty-plus years.”—Los Angeles Times America knows Jane Fonda as actress  and activist, feminist and wife, workout guru and role model. In this extraordinary  memoir, Fonda shows that she is much more. From her youth among Hollywood’s elite  to her film career and her activism today, Fonda reveals intimate details and personal  truths she hopes “can provide a lens through which others can see their lives and  how they can live them a little differently.” Surprising, candid, and wonderfully  written, My Life So Far is filled with insights into the personal struggles of a  woman living a remarkable life.“In the process of writing this book I discovered there were clear, broad, even universal themes that ran through my life, a coherent arc to my journey that, if I could be truthful in the telling, might provide a road map for other women as they face the challenges of relationships, self-image, and forgiveness. What I did not anticipate was how my journey would also resonate with men.”—From the IntroductionPraise for My Life So Far“[A] sisterly, enveloping memoir . . . an intimate, haunting book that might as well be catnip from its ever controversial author.”—Janet Maslin, The New York Times “Terrific . . . rich . . . unexpectedly quite moving.”—San Francisco Chronicle “Fiercely intelligent, detailed, probing, rigorously revealing.”—O: The Oprah Magazine “Fonda possesses a raw and affecting candor. . . . Her honesty [is] a force.”—The Philadelphia Inquirer “A fearless book . . . fascinating.”—Chicago Sun-Times “Truly compelling.”—The Atlanta Journal-Constitution “Riveting.”—Seattle Post-Intelligencer",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Superimmunity for Kids: What to Feed Your Children to Keep Them Healthy Now, and Prevent Disease in Their Future",
        "Authors": "By Buchman, Dian Dincin and Galland, Leo",
        "Description": "This text employs the latest scientific data to explain to parents how they should feed their children for maximum health and to help conquer illness and reverse the immune disturbances that have been on the increase over the past three decades. Focusing on the importance of nutrition in immunology, the book is structured by age for infants, toddlers, school-age kids, and teenagers. It includes a chapter for pregnant mothers.",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Impressionist Masterpieces National Gallery",
        "Authors": "By House, John",
        "Description": "Features a selection of masterpieces by such artists as Monet, Renoir, Degas, and van Gogh, explores the historical and artistic roots of Impressionism, and places each work in historical and cultural context",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Cartooning For Kids",
        "Authors": "By Artell, Mike",
        "Description": "You don’t have to be a great artist to be a good cartoonist. Because cartoons are based in humor, not art; the secret to their success is to think funny. In this handy guide, you’ll find detailed instructions for creating cartoon people and animals. With a little practice you’ll be drawing adults and children, creatures, and more. &#147;A fun, funny, instruction book for all ages.”&#151;Copley News Service.",
        "Category": " Juvenile Nonfiction , Art , Drawing",
        "Publisher": "Union Square Kids",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Kids' Mandalas",
        "Authors": "By Arena Verlag",
        "Description": "This isn’t a coloring book—it’s a calming book, with beautiful patterns and inviting images that help kids concentrate. Plus, they’re fun to fill in, with kaleidoscopic designs, such as stars bursting from within larger stars, embedded flowers, and a circle with rays that features a bird flying toward the center. Some look like mazes, others like spider webs, but they’ll all fascinate kids for hours.",
        "Category": " Juvenile Nonfiction , Activity Books",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Stay-at-Home Mom's Guide to Making Money from Home, Revised 2nd Edition: Choosing the Business That's Right for You Using the Skills and Interests You Already Have",
        "Authors": "By Folger, Liz",
        "Description": "Increase Your Family’s Income While Taking Care of Your Children!Did you know that millions of moms just like you are making money from the comfort of their homes? You can do it too! Stay-at-home mom expert Liz Folger shows you step-by-step how you can stay home with your kids and make money doing something you really enjoy. From scrapbooking, catering, and massage therapy to pet sitting, accounting, Web designing, and hundreds more, you can turn your skills and talents into profits for you and your family. Inside, you’ll learn how to: ·Find a business you love ·Plan and budget your time ·Manage yourself, your business, and your family ·Tap into the Internet’s vast resources and opportunities ·Avoid get-rich scams and costly mistakes ·Obtain a business license ·And much, much more! You’ll also discover tips and advice from 35 moms who have started their own successful businesses from home. If they can do it, why not you? With The Stay-at-Home Mom’s Guide, you too can turn your home-business dreams into reality. \"This latest edition of The Stay-at-Home Mom’s Guide will continue to inspire moms (and dads) in finding that perfect balance between a work-from-home venture and family life.” —Priscilla Y. Huff, author of 101 Best Home-Based Businesses for Women “Liz Folger provides solid, invaluable information that will start you off right toward home-business success. The National Association of At-Home Mothers highly recommends this book for any mother wishing to make money from home.\" —Jeanette Lisefski, founder of AtHomeMothers.com and the National Association of At-Home Mothers \"On-target guidance that will hone your entrepreneurial skills and lead you to success in the right home-based business.\" —Richard Henderson, publisher of Home Business Magazine",
        "Category": " Business & Economics , Small Business",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Dachshunds: A Complete Pet Owner's Manual: Everything about Care, Training, and Health",
        "Authors": "By Fiedelmeier, Leni",
        "Description": "Tells how to select a dachshund, offers advice on feeding, training, and health care, traces the history of the breed, and provides insight into dachshund behavior",
        "Category": "",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Successful College Writing: Skills, Strategies, Learning Styles",
        "Authors": "By McWhorter, Kathleen T.",
        "Description": "",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "7.13",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Mosaicos: Spanish as a World Language (Student Activities Manual)",
        "Authors": "By Castells, Matilde Olivella, Guzmán, Elizabeth E., Lapuerta, Paloma",
        "Description": "",
        "Category": "",
        "Publisher": "Pearson Prentice Hall",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Final Warning (Maximum Ride, Book 4)",
        "Authors": "By Patterson, James",
        "Description": "\"Three cheers! Max is one of the smartest, strongest, funniest heroines around.\" - Diane Garrett, Diane's BooksIn this breathtaking new story from the astonishing imagination of James Patterson, a girl has to save herself from an army assembled just to capture her-and maybe save the planet while she's at it.Maximum Ride is a perfectly normal teenager who just happens to be able to fly, the result of an out-of-control government experiment. Max and the other members of the Flock-six kids who share her remarkable ability-have been asked to aid a group of environmental scientists studying the causes of global warming. The expedition seems like a perfect combination of adventure, activism-and escaping government forces who watch the Flock like a hawk.But even in Antarctica, trapped in the harshest weather on our planet, Maximum Ride is an irresistible target in constant danger. For whoever controls her powers could also control the world . . . Maximum Ride is James Patterson's greatest character, a heroine who manages to be human and fearless at once. THE FINAL WARNING is an unrelenting new adventure from the writer Time magazine has called \"The Man Who Can't Miss.\"A JAMES PATTERSON FAMILY PAGETURNERIn the spirit of the most enduring hit movies and books, James Patterson has written this story for readers from ten to a hundred and ten. Special care has been taken with the language and content of THE FINAL WARNING.",
        "Category": " Young Adult Fiction , Action & Adventure , General",
        "Publisher": "jimmy patterson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Hell's Faire (Posleen War Series #4)",
        "Authors": "By Ringo, John",
        "Description": "With the defenses of the Southern Appalachians sundered, the only thing standing between the ravening Posleen hordes and the soft interior of the Cumberland Plateau are the veterans of the 555th Mobile Infantry.Dropped into Rabun Pass, with a couple of million Posleen behind them and fourteen million to the front, the only question is which will run out first: power, bullets or bodies.But they have a hole card: far to the north the shattered SheVa Nine, nicknamed \"Bun-Bun,\" is undergoing a facelift. Rising from its smoking ashes is a new weapon of war, armed with the most advanced weaponry Terra has ever produced, capable of facing both the Posleen hordes and their redoubtable space-cruisers. Capable of dealing out Hell as only SheVa Nine can.But when push comes to vaporization, if Mike O'Neal and the other members of the 555th are going to survive, it will come down to how much Posleen butt Bun-Bun can kick.Prepare to eat antimatter, Posleen-boy.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Baen",
        "Price Starting With ($)": "8.0",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Boost Your Interview IQ",
        "Authors": "By Martin, Carole",
        "Description": "How to become an interview genius and land the job of your dreamsIf a job interview is an oral exam in which job seeker must give the right answers to a set of questions in order to get hired, then this is the ultimate guide to acing the exam. Written by The Interview Coach at Monster.com, Boost Your Interview IQ offers an enjoyable, interactive way to prepare for and succeed at any job interview.Combining the features of a step-by-step guide and a skill-building workbook, it:Shows job seekers how to craft job-winning answers to the 50 key questions interviewers ask Features an Interview IQ Test, interview skill-building exercises, and other interview aptitude boosting tools Teaches candidates how to shape their experiences into stories that showcase their skills, knowledge, and personalities Offers proven techniques for acing the behavioral interview--the popular new wave interviewing strategy",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Takeoff (Pennant Books, P15)",
        "Authors": "By C. [Cyril] M. Kornbluth",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1953"
        }
    },
    {
        "Title": "A Trailside Guide: Hiking & Backpacking (New Edition) (Trailside Guides)",
        "Authors": "By berger, karen",
        "Description": "Norton proudly reissues these best-selling guides with fully revised \"Sources & Resources\" sections (including where to find the Web sites, gear, services, books, clubs, and organizations that make for foolproof outings); updates to reflect the latest in gear technology, wilderness medicine, and first aid; and advances in techniques. You can take it with you: Trailside Guides are designed to be used on the trail. Their handy size makes them easy to take along on outdoor adventures. Picture this: Trailside Guides show you how it's done. Each book has more than 100 color photographs and dozens of informative, full-color technical illustrations you'll refer to again and again. Buying Guide: Each Guide has all the information readers need to make informed decisions about what gear is available, and what they should buy. Step-by-step: Tutorials take readers through every aspect of a given outdoor activity. Each Guide covers planning and preparing for a trip, getting in shape, technique, safety, and first-aid tips, and how to have more fun along the way! Easy to use: Trailside Guides provide information quickly. Every book contains detailed illustrations, information-packed sidebars, and a complete index and bibliography. Technique tips: Any physical activity is more fun when it's done right. Trailside Guides are written by experts and contain lucid explanations that help the reader quickly achieve proficiency. It's a big world out there. Get into it with the Trailside Guides.",
        "Category": " Sports & Recreation , Hiking",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "True for you, but not for me: Deflating the Slogans that Leave Christians Speechless",
        "Authors": "By Copan, Paul",
        "Description": "Fast, effective answers to today's tough questions and slogans that often leave Christians speechless.",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Cassell's Standard German Dictionary",
        "Authors": "By Betteridge, Harold T",
        "Description": "This thorough revision of Cassell&#39;s long-renowned German Dictionary incorporates recent developments in English and German to bring it completely up to date, and supplies more idiomatic phrases and illustrative examples than ever before.This new editionIs over 300 pages longer than the previous editionGives phonetic translations of German keywords and has a key to German pronunciationIndicates whether German verb prefixes are separable or notHas a bibliography of technical and specialist dictionariesIncludes proper names in the main textHas a new clearer lay-out with entries in strictly alphabetical sequence",
        "Category": " Foreign Language Study , Multi-Language Dictionaries",
        "Publisher": "Webster's New World",
        "Price Starting With ($)": "7.23",
        "Publish Date": {
            "Month": "August",
            "Year": "1978"
        }
    },
    {
        "Title": "In the Company of Children",
        "Authors": "By Hindley, Joanne",
        "Description": "In schools of every description, teachers are working to turn their classrooms into reading-writing workshops. They're filling bookcases with the best of childrens literature, and students are tucking writers' notebooks into their bulging backpacks.This new look calls for meaningful change in teaching practice, but many questions about implementing literacy workshops remain. In this clear and practical book, Joanne Hindley takes a hard look at how to make every minute count and offers specific suggestions for creating rigorous, efficient, and successful reading and writing workshops.Grounding her story in the lives of her third graders, Joanne tackles difficult issues and offers thoughtful direction and ideas you will appreciate:how to manage a productive workshop setting in a crowded classroom;how to launch writer's notebooks with your students;how the study of one genre can help you manage the reading/writing workshop;where to get ideas for mini-lessons for the reading/writing workshop;guidelines to help you improve your conferring with individual readers and writers;how to assess student progress in a process-oriented classroom.In the Company of Children is a treasure trove of fresh ideas and strategies that teachers—in service and preservice—will draw on and adapt for their own classrooms.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Stenhouse Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Possible Worlds of Science Fiction",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley Medallion",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "November",
            "Year": "1960"
        }
    },
    {
        "Title": "Sorceress of the Witch World (Witch World Chronicles)",
        "Authors": "By Andre Norton",
        "Description": "",
        "Category": "",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "5.5",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "The Space Dreamers",
        "Authors": "By Clarke, Arthur C.",
        "Description": "",
        "Category": "",
        "Publisher": "Lancer Books",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "A Generous Orthodoxy: Why I Am a Missional, Evangelical, Post/Protestant, Liberal/Conservative, Mystical/Poetic, Biblical, Charismatic/Contemplative, Fundamentalist/Calvinist, Anabaptist/Anglican, Methodist, Catholic, Green, Incarnational, Depressed-yet-Hopeful, Emergent, Unfinished CHRISTIAN",
        "Authors": "By McLaren, Brian D.",
        "Description": "A confession and manifesto from a senior leader in the emerging church movement---A Generous Orthodoxy calls for a radical, Christ-centered orthodoxy of faith and practice in a missional, generous spirit. Brian McLaren argues for a post-liberal, post-conservative, post-protestant convergence, which will stimulate lively interest and global conversation among thoughtful Christians from all traditions. In a sweeping exploration of belief, author Brian McLaren takes us across the landscape of faith, envisioning an orthodoxy that aims for Jesus, is driven by love, and is defined by missional intent. A Generous Orthodoxy rediscovers the mysterious and compelling ways that Jesus can be embraced across the entire Christian horizon. Rather than establishing what is and is not 'orthodox,' McLaren walks through the many traditions of faith, bringing to the center a way of life that draws us closer to Christ and to each other. Whether you find yourself inside, outside, or somewhere on the fringe of Christianity, A Generous Orthodoxy draws you toward a way of living that looks beyond the 'us/them' paradigm to the blessed and ancient paradox of 'we.'",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Zondervan/Youth Specialties",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Creation Hypothesis: Scientific Evidence for an Intelligent Designer",
        "Authors": "By Moreland, James Porter (EDT)",
        "Description": "Is there evidence from natural science for an intelligent creator of the universe?For a century the reigning scientific view has been that God is not necessary to account for the existence of the world and of life. Evolutionary theory is said to be all that is needed to explain how we got here. In addition, many theistic evolutionists contend that God likely used many of the mechanisms of evolution to achieve his will.In this book J. P. Moreland and a panel of scholars assert that there is actually substantial evidence pointing in a different direction. First, they consider philosophical arguments about whether it is possible for us to know if an intelligent designer had a hand in creation. Then they look directly at four different areas of science:  the origin of life, the origin of major groups of organisms, the origin of human language and the origin and formation of the universe.The team of experts for this work includes a philosopher, a mathematician, a physicist, a linguist, a theologian, a biophysicist, an astronomer, a chemist and a paleontologist.Their data and their conclusions challenge the assumptions of many and offer the foundation for a new paradigm of scientific thinking.",
        "Category": " Religion , Religion & Science",
        "Publisher": "IVP",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "The Mirror of Worlds (Crown of the Isles, Vol. 2)",
        "Authors": "By Drake, David",
        "Description": "The Mirror of the Worlds is the second in the Crown of the Isles trilogy, which will conclude the epic Lord of the Isles series.  The Fortress of Glass began the tale of how the new kingdom of the Isles is finally brought into being by the group of heroes and heroines who have been central to all the books in the series: Prince Garric, heir to the throne of the Isles, his consort Liane, his sister Sharina, her herculean sweetheart Cashel, and his sister Ilna.  The powers of magic in the Isles have flooded to a thousand-year peak, and even local magicians can perform powerful spells normally beyond their control. Fantastic forces from all angles threaten, trying to keep Garric and his companions apart to thwart the reunification of the Isles. Now the world itself has suffered a magical upheaval. The ocean has receded and the Isles have become the higher ground of a newly formed continent. But the new continent is a patchwork of geography from the dispast and future, peopled by creatures from all times and places. Garric and his companions must now struggle for the survival of humanity.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "27.83",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Left Hand of God, The: Healing America’s Political and Spiritual Crisis",
        "Authors": "By Lerner, Michael",
        "Description": "The unholy alliance of the Political Right and the Religious Right threatens to destroy the America we love. It also threatens to generate a popular aversion to God and religion by identifying religious values with a pro-war, pro-business, pro-rich, anti-science, and anti-environmental stance. Over the past few decades, the Republicans have achieved political dominance by forging a union with the Religious Right. This marriage has provided a sanctimonious veneer for policies that have helped the rich get richer while ignoring the needs of the middle class and the poor, dismantling environmental and civil liberties protections, and seeking global domination. The Right champions the materialism and ruthless selfishness promoted by unrestrained capitalism and then laments the moral crises of family instability and loneliness experienced by people who bring these commercial values into their homes and personal lives. In response, the Religious Right offers insular communities for the faithful and a culture that blames liberals, activist judges, homosexuals, independent women, and all secular people for the moral and spiritual emptiness so many Americans experience.Yet, however distorted both the Right's analysis and its solutions to America's spiritual crisis may be, it wins allegiance by addressing the human hunger for a life with some higher purpose. The Left, by contrast, remains largely tone-deaf to the spiritual needs of the American people. It is the yearning for meaning in life, not just the desire for money or power, that lies at the core of American politics.Addressing the central mystery of contemporary politics -- why so many Americans vote against their own economic interests -- The Left Hand of God provides an invaluable, timely, and blunt critique of the current state of faith in government. Lerner challenges the Left to give up its deeply held fear of religion and to distinguish between a domination-oriented, Right-Hand-of-God tradition and a more compassionate and hope-oriented Left-Hand-of-God worldview. Further, Lerner describes the ways that Democrats have misunderstood and alienated significant parts of their potential constituency. To succeed again, Lerner argues, the Democratic Party must rethink its relationship to God, champion a progressive spiritual vision, reject the old bottom line that promotes the globalization of selfishness, and deal head-on with the very real spiritual crisis that many Americans experience every day.Lerner presents a vision that incorporates and then goes far beyond contemporary liberal and progressive politics. He argues for a new bottom line in our economy, schools, and government. This is a fundamentally fresh approach, one that takes spiritual needs seriously in our economic and political lives. Presenting an eight-point progressive spiritual covenant with America, Lerner provides a blueprint for how the Democratic Party can effectively challenge the Right and position itself to win the White House and Congress. By appealing to religious, secular, and spiritual but not necessarily religious people,The Left Hand of God blazes a trail that could change our world and reclaim America from the Religious Right.",
        "Category": " Religion , Judaism , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "How to Give a Damn Good Speech: Even When You Have No Time to Prepare",
        "Authors": "By Theibert, Philip R.",
        "Description": "",
        "Category": " Language Arts & Disciplines , Speech",
        "Publisher": "Bbs Pub Corp",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Walking Wisely: Real Guidance For Life's Journey",
        "Authors": "By Stanley, Charles F.",
        "Description": "In Scripture, wisdom is portrayed as a most important treasure, something to be sought after with consistent discipline.  We, as Christians, tend to think of wisdom as something to be attained -- an ideal to which we aspire.  Charles Stanley contends that genuine wisdom is evidenced in how we live.  The truly wise person is one whose values, perspectives, career goals, and daily decisions are all shaped by the wisdom found in Christ.Choosing to live according to Biblical precepts is a lifestyle foreign to the worldly patterns among which we live.  Inevitably, there will be clashes between the wisdom of  God and that of the world.  Dr. Stanley teaches how to apply God's wisdom as we handle finances, relate to others, care for our physical health, and carry out day-to-day duties.  This significant volume presents a way of living that embodies wisdom from above.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Michelin Green Guide France (Michelin Green Guides) (French Edition)",
        "Authors": "By Michelin Travel Publications, Publications, Michelin Travel",
        "Description": "",
        "Category": " Travel , Special Interest , Adventure",
        "Publisher": "Michelin Travel Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Cruel Summer: Fast Girls, Hot Boys Series",
        "Authors": "By Adams, Kylie",
        "Description": "One gorgeous celebutante. One hip-hop dreamer. One second-generation Hollywood badboy. One anime-obsessed Latina. One British hottie....   They're five friends living the highlife in sexy South Beach, Miami. And one of them won't make it to graduation alive.   Life is fast and furious for these A-listers and their friends: the hottest bars, the hippest clubs, the coolest, most exclusive parties.   But not everybody loves this fabulous five from the Miami Academy for Creative and Performing Arts...and if they think they're untouchable, they're about to find out that they're wrong.   Dead wrong.",
        "Category": " Young Adult Fiction , Social Themes , Drugs, Alcohol, Substance Abuse",
        "Publisher": "MTV Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "America Celebrates!: A Patchwork of Weird & Wonderful Holiday Lore",
        "Authors": "By Cohen, Hennig and Coffin, Tristram Potter",
        "Description": "Extracted from Gale's  Folklore of American holidays, 2d ed.  (1991). See following entry. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Social Science , Holidays (non-religious)",
        "Publisher": "Visible Ink Pr",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Behavior Modification Approaches to Parenting",
        "Authors": "By Eric J. Mash, Lee C. Handy",
        "Description": "",
        "Category": "",
        "Publisher": "Brunner/Mazel",
        "Price Starting With ($)": "18.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Traitor to the Blood (The Noble Dead)",
        "Authors": "By Hendee, Barb and Hendee, J. C.",
        "Description": "Born a half-breed to an elven mother and human father, Leesil was raised in the Warlands as assassin, spy, and slave for Lord Darmouth, ruler of an independent province. But Leesil's mother trained him well, and he used his skills to escape, leaving his parents to suffer Darmouth's wrath for all such traitors and their kin. Now with newfound purpose in the company of his beloved Magiere, Leesil returns to confront the sins of his past and uncover his parents' fate.Unable to turn him from this dangerous course, Magiere follows Leesil into the darkness of his past in the Warlands. Knowing what may happen should Darmouth learn of Leesil's return, she is prepared to slaughter any who try to take him from her. But Magiere's own past may well pose a more deadly threat. Two creatures of unfathomable power continue to stalk her - one who believes she's the key to his salvation, and one who seeks to destroy her...and all those she loves.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Roc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Classic Adventures: Ayesha, the Return of She/Benita, an African Romance",
        "Authors": "By Haggard, H. Rider",
        "Description": "Reproduces two adventure stories--\"Ayesha: the return of She\" and \"Benita: an African romance\"",
        "Category": " Literary Criticism , General",
        "Publisher": "Olympic Marketing Corp",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "Emotional Health (Prevention Total Health System)",
        "Authors": "By Prevention Magazine Health Books and Brenton, Myron",
        "Description": "Identifies sources of emotional happiness, tells how to overcome stress, and gives advice about facing depression, phobias, and negative emotions",
        "Category": " Psychology , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Power Eating: Build Muscle Boost Energy Cut Fat (2nd Edition)",
        "Authors": "By Greenwood-Robinson, Maggie and Kleiner, Susan M.",
        "Description": "",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Human Kinetics Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Manager's Troubleshooter: Pinpointing the Causes and Cures of 125 Tough Day-To-Day Problems",
        "Authors": "By Carr, Clay and Fletcher, Mary",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    }
]