[
    {
        "Title": "Positive Imaging: The Powerful Way to Change Your Life",
        "Authors": "By Peale, Norman Vincent",
        "Description": "The power of positive thinking and other inspirational techniques are used to overcome the common problems of life and to release the powerful inner forces that can change one's life",
        "Category": "",
        "Publisher": "Fleming H. Revell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The Pursuit of Power: Technology, Armed Force, and Society Since A.D. 1000",
        "Authors": "By William H. McNeill",
        "Description": "",
        "Category": "",
        "Publisher": "The University of Chicago Press",
        "Price Starting With ($)": "46.27",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Reflections: Life After the White House",
        "Authors": "By Bush, Barbara",
        "Description": "\"There is a myth in the United States -- you've heard it many times. It says that all American mothers hope that their child will grow up to be President of the United States. In my case that certainly is a myth. I never dreamed that any of ours would; there were days when I hoped they'd just grow up!...But on January 20, 2001...there we were sitting on the west side of the United States Capitol, waiting for our son George W. to be sworn in as the forty-third President of the United States of America.\"             -- from the Prologue  This inspiring follow-up to Barbara Bush's number one bestselling memoir covers the momentous eight years between President George H. W. Bush's leaving office and President George W. Bush's inauguration.  Not since Abigail Adams has one woman been both the wife and mother to a president. Barbara Bush's prominent place in American history is matched by her extraordinary popularity: Republicans and Democrats alike appreciate her wit, her compassion, and her devotion to her family. Dignified, loyal, and unpretentious, Barbara Bush defied skeptics to become one of the most admired first ladies in history; she remains a beloved public figure today.  Picking up where Barbara Bush: A Memoir left off, Reflections begins with the inauguration of her son, President George W. Bush, in January 2001, and then flashes back eight years to President Clinton's inauguration, when she and her husband President George H. W. Bush were leaving the White House. Drawing on excerpts from her diary, Mrs. Bush chronologically takes us through this time in her life, devoting one chapter to each year. She reveals her and her husband's inner lives through sometimes touching and often hilarious stories about their extensive travels, their hobbies, and their charity work. She discusses her experiences on the campaign trail with her sons, and relates her continuing interactions with VIPs from around the world. Mrs. Bush also touches on more controversial issues, such as her husband's resignation from the NRA, the caning of an American student in Singapore, and the hypocrisy of certain politicians. The extraordinary amount of love she feels for her family and the pride she takes in their many achievements is always clear, particularly when she writes of her relationships with her five children and fourteen grandchildren. In the epilogue, she reflects on the experience of having a president for a son and discusses the family's reactions to September 11, 2001, and its aftermath.  Reflections will delight Barbara Bush's millions of admirers with the former first lady's warmth and wit, as well as with candid revelations and anecdotes from the past decade of a full and fascinating life.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Dust to Dust",
        "Authors": "By Hoag, Tami",
        "Description": "Sorry. The single word was written on the mirror. In front of it hung the body of Andy Fallon, a Minneapolis Internal Affairs cop. Was it suicide? Or a kinky act turned tragic accident?Either way, his death wasn't a crime. The investigation will be a formality, a duty that veteran Homicide detective Sam Kovac isn't looking forward to. He doesn't want to spend any more time than he has to in the bleak, empty world of the victim's father, Iron Mike, Kovac's old mentor and a department legend. It's too much like looking into his own future. But Kovac has a sixth sense for crime, and it's burning.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "What Is Stonehenge?",
        "Authors": "By Environment, Dept.of",
        "Description": "",
        "Category": "",
        "Publisher": "Stationery Office Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1962"
        }
    },
    {
        "Title": "Never Alone: A Personal Way to God by the author of JOSHUA",
        "Authors": "By Girzone, Joseph F.",
        "Description": "The #1 Publishers Weekly  religious best-seller now becomes a best-selling  paperback! Joseph Girzone, author  of Joshua, takes us on a personal spiritual quest in  his first book of nonfiction. Joseph Girzone is  that singular publishing phenomenon, an author who  answers the unasked questions that lie hidden in so  many hearts. The wisdom of his spirituality, at  once both simple and profound, transcends the many  factions of religion and speaks to millions,  regardless of background, in a language all can  understand. Never Alone is his most  intimate book to date, and has already brought him  many new readers because of its accepting message.  In it, he unveils his personal way to God -- a way  of such wisdom, sympathy, and generosity that  anyone can follow it and find satisfaction, happiness,  and serenity. As Father Girzone guides the reader,  he brings us before a god who is neither silent  nor condemning, but a patient God who heals gently  and thoroughly, a realistic God who knows quite  well how we function. We may be shocked or ashamed bv  what we see in ourselves, but God understands. In  Never Alone, Joseph Girzone unfolds  the spirituality of love and forgiveness, and  directs his readers toward peace.",
        "Category": " Religion , Inspirational",
        "Publisher": "Image",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Our Hopes, Our Dreams: A Vision for America",
        "Authors": "By Bauer, Gary Lee",
        "Description": "For Ingest Only - Data needs to be cleaned up for all products being loaded",
        "Category": " Family & Relationships , General",
        "Publisher": "Harpercollins Christian Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Best Beach Vacations: The Carolinas & Georgia (FROMMER'S BEST BEACH VACATIONS CAROLINA'S AND GEORGIA)",
        "Authors": "By Sluder, Lan",
        "Description": "Describes the beauty, swimming, sand, and amenities of the states' beaches",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "The Book of Rainbows: Art Literature, Science & Mythology",
        "Authors": "By Whelan, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "First Glance Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Grand Teton: The Story Behind the Scenery",
        "Authors": "By Crandall, Hugh",
        "Description": "",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "KC Publications, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "Zion: The Story Behind the Scenery",
        "Authors": "By A.J. Eardley",
        "Description": "",
        "Category": "",
        "Publisher": "Kc Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The Romans and their Empire (Cambridge Introduction to World History)",
        "Authors": "By Cairns, Trevor",
        "Description": "Traces the historical development of Rome from the days of Romulus to the fall of the Empire more than one thousand years later",
        "Category": " History , General",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1970"
        }
    },
    {
        "Title": "Husbands Who Won't Lead and Wives Who Won't Follow",
        "Authors": "By Walker, James",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Eat Right 4 Your Type: The Individualized Diet Solution to Staying Healthy, Living Longer & Achieving Your Ideal Weight",
        "Authors": "By Whitney, Catherine and D'Adamo, Peter J.",
        "Description": "\"What would you say if I told you that the secret to healthy, vigorous, and disease-free living might be as simple as knowing your blood type,\" ask Dr. Peter D'Adamo and Catherine Whitney, and in Eat Right 4 Your Type, they shows us the simple answer.     If you've ever suspected that not everyone should eat the same thing or do the same exercise, you're right. In fact, what foods we absorb well and how our bodies handle stress differ with each blood type.     Your blood type reflects your internal chemistry. It is the key that unlocks the mysteries of disease, longevity, fitness, and emotional strength. It determines your susceptibility to illness, the foods you should eat, and ways to avoid the most troubling health problems.     Only recently have all the pieces of the scientific and clinical puzzle started coming together. Dr. D'Adamo has spent the past fifteen years researching the connections among blood type and exercise, food, and disease, and his research is built on thirty years of work done by his father.     In Eat Right 4 Your Type he shows:   which foods, spices, teas, and condiments help someone of your blood type maintain optimal health and ideal weight;   which vitamins and supplements to emphasize or avoid;   which medications function best in your system;   whether your stress goes to your muscles or your nervous system;   whether your stress is relieved better through aerobics or meditation;   whether you should walk, swim or play tennis or golf as your mode of exercise;   how knowing your blood type can help you avoid many common viruses and infections;   how knowing your blood type can help you fight back against life-threatening diseases;   how to slow down the aging process by avoiding factors specific to your blood type that cause rapid cell deterioration.     Eat Right 4 Your Type provides a clear, simple life plan that anyone can follow and suggests the easiest ways to determine your blood type and diet for your blood type. Here is a breakthrough book that will change the way we eat and live.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Cat Who Went To Paris",
        "Authors": "By Gethers, Peter",
        "Description": "Relating his travels with his cat, Norton, the author discusses rotisserie league baseball, Fire Island social life, real estate, Roman Polanski, romantic relationships, and Harrison Ford",
        "Category": " Travel , Europe , France",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Childhood Emergencies In The Office, Hospital, And Community: Organizing Systems Of Care",
        "Authors": "By Seidel, James S. (EDT) and Knapp, Jane F., M.D. (EDT)",
        "Description": "",
        "Category": " Medical , Pediatrics",
        "Publisher": "Amer Academy of Pediatrics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The Merchants of Souls (Giraut)",
        "Authors": "By Barnes, John",
        "Description": "Giraut Leones, special agent for the shadowy instrumentality in charge of reintegrating humanity's sundered fragments, had been betrayed by his closest friend and superior. The result was the destruction of the planet Briand and the end of Giraut's marriage. Giraut swore then that he would never work for the Office of Special Projects again - but now he must.Now a new movement on Earth seeks to use the recorded personalities of the dead as helpless virtual-reality playthings. To the worlds of the interstellar Thousand Cultures, where the reborn are accepted as normal citizens, it's a monstrous crime and reinforces their distaste for Earth, which they consider the stagnant heart of humanity. If Giraut cannot stop Earth from ratifying its plans, the tenuous structure of interstellar human civilization will collapse. Complicating matters, Giraut's brain now hosts a second consciousness - the revived consciousness of his old, long-dead friend Raimbaut. Together, Giraut and Raimbaut must confront their shared past while struggling with a deadly present.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "18.39",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Understanding Nutrition, Ninth Edition",
        "Authors": "By Whitney, Eleanor Noss and Rolfes, Sharon Rady",
        "Description": "This text presents core information for an introductory nutrition course. Each chapter includes a section examining current and often controversial topics, such as functional foods and food biotechnology. Learning features include margin definitions and a glossary, health promotion advice, and interesting facts, plus exercises on nutrition- related calculations, Internet activities, and study questions. This ninth edition contains new information on genetics, phytochemicals, antioxidants, and alternative therapies. Whitney was formerly on the faculty at Florida State University. She is a dietician registered with the American Dietetic Association. Rolfes is a founding member of a nutrition information resource center. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Medical , Nutrition",
        "Publisher": "Wadsworth Publishing",
        "Price Starting With ($)": "9.03",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Soaring Above Adversity",
        "Authors": "By Bugg, Bill",
        "Description": "",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "PublishAmerica",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Saving The Earth: A Citizen's Guide to Environmental Action",
        "Authors": "By Steger, Will and Bowermaster, Jan",
        "Description": "This environmental action guide discusses the causes and impact of environmental threats, the history of the problem, potential solutions to the problems, and helpful resources",
        "Category": " Social Science , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Managing Stress: Principles and Strategies for Health and Well-Being",
        "Authors": "By Seaward, Brian Luke",
        "Description": "Managing Stress, Seventh Edition, Provides A Comprehensive Approach To Stress Management Honoring The Integration, Balance, And Harmony Of Mind, Body, Spirit, And Emotions. The Holistic Approach Taken By Internationally Acclaimed Lecturer And Author Brian Luke Seaward Gently Guides The Reader To Greater Levels Of Mental, Emotional, Physical, And Spiritual Well Being By Emphasizing The Importance Of Mind Body Spirit Unity. Referred To As The Authority On Stress Management By Students And Professionals, This Book Gives Students The Tools Needed To Identify And Manage Stress While Teaching Them How To Strive For Health And Balance. --Amazon.com",
        "Category": " Health & Fitness , Reference",
        "Publisher": "Jones & Bartlett Learning",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Polling and the Public: What Every Citizen Should Know, Fifth Edition",
        "Authors": "By Asher, Herbert B",
        "Description": "Although information from public opinion polls is ubiquitous wielded by political candidates, the media, and all kinds of organizations hoping to prove a point polling is poorly understood by most people. Asher (emeritus, political science, Ohio State U.) explains how surveys are constructed, conducted, and interpreted. He covers polling in campaign politics and media coverage and discusses issues such how a survey's questions influence the very attitudes they purport to measure. It's intended for students of political science, public opinion, communications, and journalism as well as for reporters, editors, and campaign managers; also useful for general readers who want to better understand the numbers in the news. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , Political Process , Campaigns & Elections",
        "Publisher": "Cq Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "You Have My Word 175 Promises of God",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Barbour Publishing, Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Sour Puss",
        "Authors": "By Brown, Rita Mae and Gellatly, Michael (ILT)",
        "Description": "In this latest whodunit, Rita Mae Brown and her feline partner-in-crime-detection, Sneaky Pie Brown, return to the scene of their bestselling crimes—picturesque Crozet, Virginia. Love is in the air as spring comes to the small town, but no sooner has Mary Minor “Harry” Haristeen remarried than she is rudely interrupted—by murder. And no sooner does the trouble start than curious cats Mrs. Murphy and Pewter, along with corgi Tee Tucker, sink their claws into the case.…After an unexpected rekindling of their romance, Harry and her veterinarian ex-husband, Fair Haristeen, have happily remarried. But the excitement of their nuptials is quickly overshadowed by the murder of Professor Vincent Forland, a world-famous grape and fungal expert who was in town visiting the local vineyards.Within days of giving a lecture on how distilled fungus and cattle diseases are the current basis of chemical warfare, Forland’s decapitated body is discovered.  After their initial fright, the residents of Crozet believe that this was a political murder and settle back into their routines–until a local is also found dead, killed in the same gruesome manner as Professor Forland. Now residents can’t help wondering, is this really the work of an outsider—or one of their own?    No longer working in the post office, Harry had just planted a quarter acre of grapes, which fuels her natural curiosity over just what the two murder victims knew and had in common.  Once the warmth of spring arrives, the grapevines blossom and Harry’s furry entourage discovers the first critical clue. But how can they show the humans what they’ve learned? And how can they—or anyone—stop the killing?",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Winning 'em Over: A New Model for Management in the Age of Persuasion",
        "Authors": "By Conger, Jay Alden",
        "Description": "A celebrated expert in business management illuminates the current style of leadership in business and its decisive effects on the workplace, and shows readers how to influence their colleagues and employees through the art of persuasion. 25,000 first printing.",
        "Category": " Business & Economics , Business Communication , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "The Apostle : A Life of Paul",
        "Authors": "By Pollock, John",
        "Description": "",
        "Category": "",
        "Publisher": "Billy Graham Evangelistic Association",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Stars: A Guide to the Constellations, Sun, Moon, Planets and Other Features of the Heavens",
        "Authors": "By Zim, Herbert Spencer, Baker, Robert Horace, and Irving, James Gordon (ILT)",
        "Description": "A field guide to the stars for everyone who wants to enjoy the wonders of the heavens",
        "Category": "",
        "Publisher": "Golden Books Pub Co (Adult)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The Diabetes Improvement Program: The Ultimate Handbook for Using Foods & Supplements to Slow and Reverse the Complications of Diabetes",
        "Authors": "By Quillin, Patrick",
        "Description": "",
        "Category": " Health & Fitness , General",
        "Publisher": "Leader Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Wildfire: Igniting the She/Volution",
        "Authors": "By Johnson, Sonia",
        "Description": "",
        "Category": "",
        "Publisher": "Wildfire Books",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "A Week in the Zone",
        "Authors": "By Sears, Barry",
        "Description": "A national bestseller for more than three years in hardcover, The Zone has introduced millions of people worldwide to a breakthrough approach to dieting based on Novel Prize–winning scientific research. Treating food as the most powerful drug available, The Zone plan shows how food, when used unwisely, can be toxic. Used wisely however, it will take anyone into the Zone, a state of exceptional health familiar to champion athletes. Now the benefits of Barry Sears߲evolutionary program can be experienced in just one week! With A Week in the Zone, everyone can start on the path to permanent weight loss and learn how to burn body fat, and keep it off – without deprivation or hunger. They'll also discover how the Zone helps to both increase energy and fight heart disease, diabetes, PMS, chronic fatigue, depression, and cancer.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Regan Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Understanding Aging Parents (Christian Care Books, 8)",
        "Authors": "By Lester, Andrew D. and Lester, Judith L.",
        "Description": "Discusses the physical and psychological changes brought about by aging, how family relationships can change, and how to cope with anxieties about death",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Westminster John Knox Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1980"
        }
    },
    {
        "Title": "The Yellow House Mystery (The Boxcar Children, No. 3) (The Boxcar Children Mysteries)",
        "Authors": "By Warner, Gertrude Chandler and Gehr, Mary (ILT)",
        "Description": "Relates the exploits of the four Alden children as they locate a missing man",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Albert Whitman & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "The Best American Short Stories 2006 (The Best American Series)",
        "Authors": "By Kenison, Katrina (EDT) and Patchett, Ann (EDT)",
        "Description": "“While a single short story may have a difficult time raising enough noise on its own to be heard over the din of civilization, short stories in bulk can have the effect of swarming bees, blocking out sound and sun and becoming the only thing you can think about,” writes Ann Patchett in her introduction to The Best American Short Stories 2006. This vibrant, varied sampler of the American literary scene revels in life’s little absurdities, captures timely personal and cultural challenges, and ultimately shares subtle insight and compassion. In “The View from Castle Rock,” the short story master Alice Munro imagines a fictional account of her Scottish ancestors’ emigration to Canada in 1818. Nathan Englander’s cast of young characters in “How We Avenged the Blums” confronts a bully dubbed “The Anti-Semite” to both comic and tragic ends. In “Refresh, Refresh,” Benjamin Percy gives a forceful, heart-wrenching look at a young man’s choices when his father -- along with most of the men in his small town -- is deployed to Iraq. Yiyun Li’s “After a Life” reveals secrets, hidden shame, and cultural change in modern China. And in “Tatooizm,” Kevin Moffett weaves a story full of humor and humanity about a young couple’s relationship that has run its course.Ann Patchett “brought unprecedented enthusiasm and judiciousness [to The Best American Short Stories 2006],” writes Katrina Kenison in her foreword, “and she is, surely, every story writer’s ideal reader, eager to love, slow to fault, exquisitely attentive to the text and all that lies beneath it.”",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "The Economic Way of Thinking",
        "Authors": "By Heyne, Paul T",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan Coll Div",
        "Price Starting With ($)": "6.21",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "How-To Cowboy",
        "Authors": "By Faine, Edward Allan",
        "Description": "",
        "Category": "",
        "Publisher": "IM Press",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Angel Book: A Handbook for Aspiring Angels",
        "Authors": "By Goldman, Karen and D'Agostino, Anthony (ILT)",
        "Description": "Angels hold profound meaning for people of all ages and from all walks of life. Ethereal and uplifting, these celestial beings reflect our deepest and best selves and embody our highest ideals of love and goodwill. In these pages, aspiring angel Karen Goldman takes us on a soul-warming journey filled with light, beauty, and goodness to the precious places where angels do exist. A road map to these higher realms, The Angel Book bridges the gap between Heaven and Earth, between hearts and souls, and between all people.  Written simply and serenely with pure wisdom and an unmistakable ring of truth, The Angel Book captures the essence of angels, teaching us what it means to fly, how to create miracles, and how to get our wings. We learn the rewards of becoming angels right here on Earth -- the privileges, the soul joys, and the ecstasies that await those of us whose spirits yearn to soar.  For both seekers and sophisticates, this magically illustrated book is truly a heavenly gift to oneself or a fellow angel. Open to any page and a pearl of inspiration is yours to contemplate and enjoy. Sending an honest message of love and encouragement that will endure, The Angel Book opens our hearts and illuminates our souls, helping us recognize and acknowledge who we are at our very best.",
        "Category": " Religion , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Crossing America",
        "Authors": "By National Geographic Society",
        "Description": "",
        "Category": " Travel , United States , General",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Haunted Kids: True Ghost Stories",
        "Authors": "By Zullo, Allan",
        "Description": "Eleven stories tell about a child saved by a ghost, the fate of a boy who knocked over a gravestone, and strange apparitions",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Leading Life-Changing Small Groups-paperback",
        "Authors": "By Donahue, Bill and Willow Creek Community Church (South Barrington, Ill.) (COR)",
        "Description": "The best-selling small group guidebook---over 100,000 sold. NOW UPDATED.Like nothing else, small groups have the power to change lives. They're the ideal route to discipleship---a place where the rubber of biblical truth meets the road of human relationships.For six years Bill Donahue provided training and resources for small group leaders so that Willow Creek could build a church of small groups. Now he is committed to creating tools that will help church leaders pursue the same goal---to provide a place in community for everyone in their congregation. In Leading Life-Changing Small Groups, Donahue and his team share in depth the practical insights that have made Willow Creek's small group ministry so effective.The Comprehensive, Ready-Reference Guide for Small Group LeadersThe unique, ready-reference format of this book gives small group leaders, pastors, church leaders, educators, and counselors a commanding grasp of:-Group formation and values-Leadership requirements and responsibilities-The philosophy and structure of small groups-Meeting preparation and participation-Discipleship within the group-Leadership training . . . and much moreFrom an individual group to an entire small group ministry, Leading Life-Changing Small Groups gives you the comprehensive guidance you need to cultivate life-changing small groups . . . and growing, fruitful followers of Christ.",
        "Category": " Religion , Christian Ministry , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Dinosaurs' Thanksgiving (Read With Me Paperbacks)",
        "Authors": "By Donnelly, Liza",
        "Description": "Rex and his dog, Bones, share an unusual Thanksgiving dinner with dinosaurs",
        "Category": "",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Piglet Feels Small (Step-Into-Reading, Step 1)",
        "Authors": "By Heller, Julek (ILT) and Skurzynski, Gloria",
        "Description": "An adventurous rescue set in the time of medieval knights, castles, bandits, and music. Before their father returns to France from the Crusades, daring Alice and musical Roger set off on their own journey: to find their long-lost uncle. But on the way, the siblings are kidnapped and locked in an ancient hidden tower. To finish their quest, they need to escape—and fast! Can Alice use her courage to slip away and find help? And can Roger use his musical talents to guide her back before it’s too late? History Stepping Stones now feature updated content that emphasizes Common Core and today’s renewed interest in nonfiction. Perfect for home, school, and library bookshelves!",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Dear Mr. Blueberry (Aladdin Picture Books)",
        "Authors": "By James, Simon",
        "Description": "Whales don’t live in ponds—or do they?“Dear Mr. Blueberry, I love whales very much and I think I saw one in my pond today. Please send me some information on whales.” It’s vacation time, so Emily has to write to her teacher to help when she discovers a blue whale living in her pond. Mr. Blueberry answers that she must be mistaken, because whales live in the ocean, not in ponds. Throughout the summer, Emily and Mr. Blueberry exchange letters, until Emily has a happy surprise to share with her teacher. In the process, Emily learns a lot about whales. And Mr. Blueberry learns even more about imagination, faith, and love.",
        "Category": " Juvenile Fiction , Animals , Mammals",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Montana Sky",
        "Authors": "By Roberts, Nora",
        "Description": "#1 New York Times bestselling author Nora Roberts presents a novel as sweeping and extraordinary as the Montana sky. . . .When Jack Mercy died, he left behind a ranch worth nearly twenty million dollars. Now his three daughters&apos;each born of a different mother, and each unknown by the others&apos;are gathered to hear the reading of the will. But the women are shocked to learn that before any of them can inherit, they must live together on the ranch for one year. For Tess, a screenwriter who just wants to collect her cash and get back to Hollywood, it&apos;s a nightmare. For Lily, on the run from her abusive ex, it&apos;s a refuge. And for Willa&apos;who grew up on the ranch&apos;it&apos;s an intrusion into her rightful home.They are sisters . . . and strangers. Now they face a challenge: to put their bitterness aside and live like a family. To protect each other from danger&apos;and unite against a brutal enemy who threatens to destroy them all. . . .&apos;Exciting, romantic, great fun.&apos;&apos;Cosmopolitan&apos;Roberts paints a vivid picture of the raw beauty of Big Sky country.&apos;&apos;Chicago Tribune",
        "Category": " Fiction , Romance , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Winnie-the-Pooh All Year Long (A Golden Sturdy Shape Book)",
        "Authors": "By Walt Disney Company",
        "Description": "During each season Pooh and Piglet find activities they can share like flying kites, swimming, raking leaves, and building a snowman",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1981"
        }
    },
    {
        "Title": "Michael Jackson's Complete Guide to Single Malt Scotch: A Connoisseur's Guide to the Single Malt Whiskies of Scotland",
        "Authors": "By Jackson, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Running Press Book Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Stories From a Soldier's Heart: For the Patriotic Soul",
        "Authors": "By Gray, Alice and Holton, Chuck",
        "Description": "To preserve our peace of mind and our way of life, the men and women of the United States military often sacrifice their youth-and sometimes even their lives. They steadfastly guard the futures of millions of people they will never meet. Now over seventy-five riveting stories-organized in six themed sections of patriotism, inspiration, faith on the frontlines, love and family, honor and sacrifice, and dedication and courage-bring to life these heroes and the loved ones they have fought for. Stories from a Soldier's Heart honors those who carry in their warrior hearts the world's hope for freedom.",
        "Category": " Religion , Inspirational",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Reading Workshop Survival Kit",
        "Authors": "By Muschla, Gary Robert",
        "Description": "A complete, step-by-step guide to setting up and running a successful reading workshop in grades 5-12. Part I, \"Management of the Reading Workshop,\" offers a host of specific strategies, techniques and reproducible materials for classroom management and student evaluation. Part II, \"Using Mini-lessons in the Reading Workshop,\" provides 100 different ready-to-use mini-lessons focusing on specific reading topic and skills.",
        "Category": " Language Arts & Disciplines , Reading Skills",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Joy of Nature: How to Observe and Appreciate the Great Outdoors",
        "Authors": "By Reader's Digest Association",
        "Description": "An illustrated information-and-guide book on the world of nature explores all geographical areas and climates, wildlife, the colors, sounds, shapes, and scents of nature, and other topics, and features more than one hundred activities and hobbies",
        "Category": " Science , General",
        "Publisher": "Random House Inc",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "2nd Chance (Women's Murder Club, 2)",
        "Authors": "By Patterson, James and Gross, Andrew",
        "Description": "The Women's Murder Club returns for another thrilling crime investigation. Will their skills be enough to take down a brutal madman?A brutal madman sprays bullets into a crowd of children leaving a San Francisco church. Miraculously-or was it intentionally?-only one person dies. Then an elderly black woman is hung. Police homicide inspector Lindsay Boxer senses a connection and together with medical examiner Claire, assistant D. A. Jill, and Chronicle reporter Cindy, finds a link that sends a chill through the entire nation. This killer's motives are unspeakable.In this \"inventive\" installment of the Women's Murder Club, James Patterson proves once again why he is the #1 master of the murder mystery (Sunday Times).",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Vision",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Breaking Free from Compulsive Eating",
        "Authors": "By Roth, Geneen",
        "Description": "",
        "Category": " Self-help , Eating Disorders & Body Image",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The Rose Rent",
        "Authors": "By Peters, Ellis",
        "Description": "Brother Cadfael investigates the disappearance of Judith Perle, owner of the Shrewsberry cottage his abbey rents for one rose per annum",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "crest",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "Hard Row",
        "Authors": "By Maron, Margaret",
        "Description": "As Judge Deborah Knott presides over a case involving a barroom brawl, it becomes clear that deep resentments over race, class, and illegal immigration are simmering just below the surface in the countryside. An early spring sun has begun to shine like a blessing on the fertile fields of North Carolina, but along with the seeds sprouting in the thawing soil, violence is growing as well. Mutilated body parts have appeared along the back roads of Colleton County, and the search for the victim's identity and for that of his killer will lead Deborah and her new husband, Sheriff's Deputy Dwight Bryant, into the desperate realm of undocumented farm workers exploited for cheap labor.In the meantime, Deborah and Dwight continue to adjust to married life and to having Dwight's eight-year-old son, Cal, live with them full time. When another body is found, these newlyweds will discover dark truths that threaten to permanently alter the serenity of their rural surroundings and their new life together.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Humboldt's Gift",
        "Authors": "By Bellow, Saul",
        "Description": "",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1976"
        }
    },
    {
        "Title": "A Guide Book of United States Coins: 1999",
        "Authors": "By Yeoman, R. S.",
        "Description": "Covers American coins from 1616 to the present, including early coins and tokens, mint issues, private, state and territorial coins, commemorative issues, and proofs",
        "Category": " Antiques & Collectibles , Coins, Currency & Medals",
        "Publisher": "Whitman Coin Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "The Pursuit of Happiness: A Novel",
        "Authors": "By Roiphe, Anne Richardson",
        "Description": "Five generations of the Gruenbaum family contend with a host of pressures as they immigrate to America, build an empire in the garment industry, and finally turn to Israel for identity",
        "Category": " Fiction , General",
        "Publisher": "Summit Books",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "New Adventures of Mary-Kate & Ashley #39: The Case of the Clue at the Zoo: (The Case of the Clue at the Zoo)",
        "Authors": "By Katschke, Judy and Olsen, Ashley",
        "Description": "Mary-Kate and Ashley are having tons of fun participating in a program at the zoo. They learn how to feed the animals, train them, and take care of their habitats. But just when they are going to be awarded their junior zookeeper badges, everything goes wrong! The chimps are given the wrong food to eat, the parrots start calling everyone names, and the snakes are set free from their tanks. Can the Trenchcoat Twins find out who is responsible for the monkey business at the zoo?",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "HarperEntertainment",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Helen Keller: Courage In The Dark",
        "Authors": "By Hurwitz, Johanna and Covington, Neverne (ILT)",
        "Description": "When a childhood illness leaves her blind and deaf, Helen Keller's life seems hopeless indeed. But her indomitable will and the help of a devoted teacher empower Helen to triumph over incredible adversity. This amazing true story is finally brought to the beginner reader level.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Historical",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "The Photographer's Handbook: A Complete Reference Manual of Techniques, Procedures, Equipment, and Style",
        "Authors": "By Hedgecoe, John",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1982"
        }
    },
    {
        "Title": "National Geographic Photography Field Guide: Secrets to Making Great Pictures",
        "Authors": "By National Geographic Society (U. S.) (COR), Burian, Peter K., and Caputo, Robert",
        "Description": "A comprehensive guide to field photography from respected experts offers advice to both beginners and professionals alike on how to create striking and original works, including step-by-step instructions on composition, facts on the latest equipment, secret techniques, and much more. Original. BOMC.",
        "Category": " Photography , Reference",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Colonial Latin America",
        "Authors": "By Johnson, Lyman L. and Burkholder, Mark A.",
        "Description": "Now featuring scholarship published since the first edition, revised lists of recommended readings that include important books published since 1988, and appendices of rulers of Spain and Portugal, this lively, very readable history provides a concise yet comprehensive study of the Iberian colonies in the New World from the pre-conquest background through European exploration, conquest, and colonization, to the wars of independence in the early nineteenth century. As before, numerous photographs and maps lend immediacy to the narrative, and biographical examples of both conqueror and conquered illustrate colonial life. Clear and engaging, this extremely well-balanced book is invaluable for anyone who wants to learn about Latin America's colonial legacy and difficult transition into the modern era.",
        "Category": " History , Latin America , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Candy Girl: A Year in the Life of an Unlikely Stripper",
        "Authors": "By Cody, Diablo",
        "Description": "Decreed by David Letterman (tongue in cheek) on CBS TV&#146;s The Late Show to be the pick of &#147;Dave&#146;s Book Club 2006,&#148; Candy Girl is the story of a young writer who dared to bare it all as a stripper. At the age of twenty-four, Diablo Cody decided there had to be more to life than typing copy at an ad agency. She soon managed to find inspiration from a most unlikely source&#151; amateur night at the seedy Skyway Lounge. While she doesn&#146;t take home the prize that night, Diablo discovers to her surprise the act of stripping is an absolute thrill.  This is Diablo&#146;s captivating fish-out-of-water story of her yearlong walk on the wild side, from quiet gentlemen&#146;s clubs to multilevel sex palaces and glassed-in peep shows. In witty prose she gives readers a behind-the-scenes look at this industry through a writer&#146;s keen eye, chronicling her descent into the skin trade and the effect it had on her self-image and her relationship with her now husband.",
        "Category": " Social Science , Popular Culture",
        "Publisher": "Avery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "The Great Explorers: The European Discovery of America",
        "Authors": "By Morison, Samuel Eliot",
        "Description": "",
        "Category": " History , United States , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1978"
        }
    },
    {
        "Title": "World's Strangest Football Stories (World's Strangest Sports Stories)",
        "Authors": "By Rockwell, Bart",
        "Description": "Relates unusual stories and facts from football history",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Ribsy (Henry Huggins, 6)",
        "Authors": "By Cleary, Beverly",
        "Description": "Newbery Medal-winning author Beverly Cleary gives Henry's dog, Ribsy, center stage in this dog's eye view of the adventure of a lifetime. This classic story about a dog and his boy is as fresh and funny as ever!Good ol' Ribsy's ever-curious mind has always gotten him into trouble, but this time he may have gone too far. After a comical turn of events, Ribsy finds himself in the wrong station wagon with the wrong children.Ribsy will do anything to find Henry, but there's plenty of excitement to be had along the way—and scoring a touchdown for a local high school team is only part of the fun!For kids looking for a fast, funny dog story, Ribsy is a winner.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2021"
        }
    },
    {
        "Title": "Pure Joy: Walking through Trials with Christ",
        "Authors": "By Luella Nash LeVee",
        "Description": "",
        "Category": "",
        "Publisher": "Luella Nash LeVee",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Little House in the Big Woods (Little House, No 1)",
        "Authors": "By Wilder, Laura Ingalls and Williams, Garth (ILT)",
        "Description": "Based on the real-life adventures of Laura Ingalls Wilder, Little House in the Big Woods is the first book in the award-winning Little House series, which has captivated generations of readers. This edition features the classic black-and-white artwork from Garth Williams.Little House in the Big Woods takes place in 1871 and introduces us to four-year-old Laura, who lives in a log cabin on the edge of the Big Woods of Wisconsin. She shares the cabin with her Pa, her Ma, her sisters Mary and Carrie, and their lovable dog, Jack.Pioneer life isn’t easy for the Ingalls family, since they must grow or catch all their own food as they get ready for the cold winter. But they make the best of every tough situation. They celebrate Christmas with homemade toys and treats, do their spring planting, bring in the harvest in the fall, and make their first trip into town. And every night, safe and warm in their little house, the sound of Pa’s fiddle lulls Laura and her sisters into sleep.The nine books in the timeless Little House series tell the story of Laura’s real childhood as an American pioneer, and are cherished by readers of all generations. They offer a unique glimpse into life on the American frontier, and tell the heartwarming, unforgettable story of a loving family.",
        "Category": " Juvenile Fiction , Historical , United States , 19th Century",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "New Kids on the Block",
        "Authors": "By Catalano, Grace",
        "Description": "A profile of the pop band's five members and their rise from a rough Boston neighborhood to worldwide travel and popularity.",
        "Category": " Music , General",
        "Publisher": "Starfire",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Homesick: My Own Story (Yearling Book)",
        "Authors": "By Fritz, Jean",
        "Description": "The acclaimed author provides a lively and perceptive account of growing up in China",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "The Trouble with Tuck (Avon Camelot Books)",
        "Authors": "By Taylor, Theodore",
        "Description": "A Girl's Best Friend\"No one can definitely say when Friar Tuck began to go blind. But the light probably began to fail for big Tuck long before any of us suspected it, and of course, being a dog, he couldn't very well talk about it. It didn't seem possible. Young, beautiful, so free-spirited, he had a long life ahead...\"Helen adored Tuck from the first moment he was placed in her arms, a squirming fat sausage of creamy yellow fur. And very soon Tuck returned her love. He faithfully slept on the rug beside her bed, guarded her against strangers, and rejoiced in their long walks together. So when Tuck began to lose his sight, Helen fought to be his eyes. She wouldn't let his blindness end his life or even limit it. Instead, Helen thought up a unique solution to Tuck's trouble, one that would keep Tuck free, proud, and hers forever.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "The Well-Wishers (Odyssey Classic)",
        "Authors": "By Eager, Edward and Bodecker, N. M. (ILT)",
        "Description": "Six children relate their experiences with an unpredictable old wishing well that involves them in some magical adventures during an eventful autumn",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Harcourt Childrens Books (J)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "There's A Boy in the Girls' Bathroom",
        "Authors": "By Sachar, Louis",
        "Description": "The beloved bestseller from Newbery Medalist and National Book Award winner Louis Sachar (Holes), with a brand-new cover!   “Give me a dollar or I’ll spit on you.”    That’s Bradley Chalkers for you. He’s the oldest kid in the fifth grade. He tells enormous lies. He picks fights with girls, and the teachers say he has serious behavior problems. No one likes him—except Carla, the new school counselor. She thinks Bradley is sensitive and generous, and she even enjoys his far-fetched stories. Carla knows that Bradley could change, if only he weren’t afraid to try.   But when you feel like the most hated kid in the whole school, believing in yourself can be the hardest thing in the world. . . .",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "The Grim Grotto (A Series of Unfortunate Events, Book 11) (A Series of Unfortunate Events, 11)",
        "Authors": "By Snicket, Lemony and Helquist, Brett (ILT)",
        "Description": "NOW A NETFLIX ORIGINAL SERIESWarning: Your day will become very dark—and possibly damp—if you read this book.Plan to spend this spring in hiding. Lemony Snicket is back with the eleventh book in his New York Times bestselling A Series of Unfortunate Events.Lemony Snicket's saga about the charming, intelligent and grossly unlucky Baudelaire orphans continues to provoke suspicion and despair in readers the world over. In the eleventh and most alarming volume yet in the bestselling phenomenon A Series of Unfortunate Events, the intrepid siblings delve further into the dark mystery surrounding the death of their parents and the baffling VFD organisation.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The tragedy of Greece;: A lecture delivered for the professor of Greek to candidates for honours in literae humaniores at Oxford in May 1920,",
        "Authors": "By Toynbee, Arnold Joseph",
        "Description": "",
        "Category": "",
        "Publisher": "Clarendon Press",
        "Price Starting With ($)": "18.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1921"
        }
    },
    {
        "Title": "Christmas From the Heart, Volume 8",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Words of Stone",
        "Authors": "By Henkes, Kevin",
        "Description": "While exploring the countryside outside of his home, ten-year-old Blaze Werla spots a devastating message on the side of a hill. By the author of Sheila Rae the Brave. Reprint.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Victoria: Bedrooms: Private Worlds & Places to Dream",
        "Authors": "By Waller, Kim and Lindemeyer, Nancy (EDT)",
        "Description": "Design a bedroom that's just made for sweet dreaming and relaxation! Whether it's your own personal retreat; the master suite; a comfy nursery; teen hideout, or guest room, here's how to make it great. Take advantage of fabrics applications; focus on unexpected pleasures that delight the eye (like a grouping of antique frames); and express your individual taste, from airily romantic to richly dramatic. You'll even learn tricks for transforming unusually shaped spaces--like sloping attic bedrooms-into something special!",
        "Category": " House & Home , Decorating",
        "Publisher": "Hearst",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Days of Our Lives: Complete Family Album, The",
        "Authors": "By Zenka, Lorraine",
        "Description": "For three decades, Salem has been a second home to millions of devotees of Days of Our Lives, one of the most popular daytime dramas ever aired on television. Here, at last, is a richly detailed, lavishly illustrated appreciation of the beloved show, prepared in full cooperation with its producers. Days of Our Lives: The Complete Family Album traces the intricate life-paths of the many characters who have inhabited Salem and chronicles the show's many innovations, from the first episode of any soap opera to appear in color to the first exorcism of the Devil on daytime TV. Here is a commemorative collection of memories, facts and images that every Days fan will treasure always.  Days of Our Lives: The Complete Family Album includes:  A dramatic account of Days' intricate plot line, from the '60s through the '90s Hundreds of photos and video images -- many never seen before -- from the producers' archives Profiles of all the leading characters and the actors who have played them Former cast members' reminiscences of their time in Salem Portraits of Days' most memorable couples, from Tom and Alice Horton to Bo and Hope Rare glimpses of what it's really like on the set and behind the scenes of Days In-depth interviews with executive producer Ken Corday and other backstage talents who have guided Days through its first 30 years   This beautiful keepsake volume gathers together the history, the people and the magic of Days of Our Lives. Anyone who has ever been touched by the magic will cherish this book.",
        "Category": " Performing Arts , Film , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Romeo and Juliet--Together (And Alive!) at Last",
        "Authors": "By Avi",
        "Description": "Pete Saltz, the pudgy poet from S.O.R. Losers, has fallen hard for Anabell Stackpoole, and she likes him, too. But both are much too shy to do anything about it. It's Pete's friend Ed Sitrow to the rescue, as he and other eighth-graders at South Orange River School cook up a scheme to give the budding romance a boost. The school production of Romeo and Juliet stars the bashful pair in the leading roles -- and everybody's waiting for the kissing scenes. What they get is more action than Shakespeare ever imagined, in the funniest, most disastrous...and most romantically successful production ever!",
        "Category": " Young Adult Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Bobbi Brown Beauty: The Ultimate Beauty Resource",
        "Authors": "By Brown, Bobbi and Iverson, Annemarie",
        "Description": "In this manual, Bobbi Brown strikes conventional thinking about beauty.  To her way of thinking , there is no one \"perfect\"  beauty standard but countless expressions of personalized beauty.  Bobbi helps readers recognize their own remarkable beauty traits and develop their own natural beauty styles.  She also analyzes the styles of some of the most celebrated beauties of the past--Marilyn Monroe, Jackie Onassis, Grace Kelly--and of our time--Christy Turlington, Demi Moore, and Kate Moss.",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "6.1",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Help! I'm Trapped In My Teacher's Body",
        "Authors": "By Strasser, Todd",
        "Description": "When twelve-year-old Jason discovers that he and the dorkiest teacher in school, Mr. Dirksen, have switched bodies, he enlists the aid of his skeptical sister, Jennifer, to help him set things right. Original.",
        "Category": "",
        "Publisher": "Apple (Scholsatic)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Dear Mr. Henshaw",
        "Authors": "By Cleary, Beverly and Zelinsky, Paul O. (ILT)",
        "Description": "Newbery Medal Winner * Teachers’ Top 100 Books for Children * ALA Notable Children’s BookBeverly Cleary’s timeless Newbery Medal-winning book explores difficult topics like divorce, insecurity, and bullying through the thoughts and emotions of a sixth-grade boy as he writes to his favorite author, Boyd Henshaw. After his parents separate, Leigh Botts moves to a new town with his mother. Struggling to make friends and deal with his anger toward his absent father, Leigh loses himself in a class assignment in which he must write to his favorite author. When Mr. Henshaw responds, the two form an unexpected friendship that will change Leigh’s life forever. From the beloved author of the Henry Huggins, Ramona Quimby, and Ralph S. Mouse series comes an epistolary novel about how to navigate and heal from life’s growing pains.",
        "Category": " Juvenile Fiction , Family , Marriage & Divorce",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Misty of Chincoteague",
        "Authors": "By Henry, Marguerite",
        "Description": "",
        "Category": "",
        "Publisher": "Scholastic Inc.",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1947"
        }
    },
    {
        "Title": "Practical Feng Shui: Arrange, Decorate and Accessorize Your Home to Promote Health, Wealth and Happiness",
        "Authors": "By Brown, Simon",
        "Description": "Promote good health and general well-being, improve your sex life and interpersonal relationships, and realize your personal and professional aspirations by arranging and decorating your home. Described by the author as \"a Shiatsu massage for your whole being,\" Feng Shui is the ancient Chinese art of designing your surroundings in order to channel the positive energies of the universe and promote success in life, health, wealth, and happiness. Begin by studying the basic principles of Feng Shui: the concepts of chi energy, yin and yang, the Five Elements, the Eight Directions, and Nine Ki astrology, and learn to use the tools of the art. Next, examine the structure and shape of your home as well as its setting, and determine how these affect your life favorably or unfavorably. See how to furnish and decorate each room in the house in the best possible way. Guidance is given in choosing colors, fabrics, plants, mirrors, lighting, artwork, and other decorative elements. Arrange the seating in the living room to promote family harmony and sociability. Select table settings that will improve mealtimes. Situate your bed to enhance your communication skills, cure insomnia, or heighten romance. Regardless of how you want to improve your life, using Feng Shui you can get the forces of nature to work with you rather than against you.  Ward Lock 160 pages (all in color), 7 3/4 x 10.",
        "Category": " Body, Mind & Spirit , Feng Shui",
        "Publisher": "CASSELL ILLUSTRATED",
        "Price Starting With ($)": "13.98",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Broken for You",
        "Authors": "By Kallos, Stephanie",
        "Description": "National best seller and Today show Book Club selection, Broken for You is the story of two women in self-imposed exile whose lives are transformed when their paths intersect. Stephanie Kallos's debut novel is a work of infinite charm, wit and heart. It is also a glorious homage to the beauty of broken things. When we meet septuagenarian Margaret Hughes, she is living alone in a mansion in Seattle with only a massive collection of valuable antiques for company. Enter Wanda Schultz, a young woman with a broken heart who has come west to search for her wayward boyfriend. Both women are guarding dark secrets and have spent many years building up protective armor against the outside world. As their tentative friendship evolves, the armor begins to fall away and Margaret opens her house to the younger woman. This launches a series of unanticipated events, leading Margaret to discover a way to redeem her cursed past, and Wanda to learn the true purpose of her cross-country journey. Both funny and heartbreaking, Broken for You is a testament to the saving graces of surrogate families and shows how far the tiniest repair jobs can go in righting the world's wrongs.",
        "Category": " Fiction , Literary",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Working Poor: Invisible in America",
        "Authors": "By Shipler, David K.",
        "Description": "“Most of the people I write about in this book do not have the luxury of rage. They are caught in exhausting struggles. Their wages do not lift them far enough from poverty to improve their lives, and their lives, in turn, hold them back. The term by which they are usually described, ‘working poor,’ should be an oxymoron. Nobody who works hard should be poor in America.” —from the Introduction    From the author of the Pulitzer Prize–winning Arab and Jew, a new book that presents a searing, intimate portrait of working American families struggling against insurmountable odds to escape poverty.     As David K. Shipler makes clear in this powerful, humane study, the invisible poor are engaged in the activity most respected in American ideology—hard, honest work. But their version of the American Dream is a nightmare: low-paying, dead-end jobs; the profound failure of government to improve upon decaying housing, health care, and education; the failure of families to break the patterns of child abuse and substance abuse. Shipler exposes the interlocking problems by taking us into the sorrowful, infuriating, courageous lives of the poor—white and black, Asian and Latino, citizens and immigrants. We encounter them every day, for they do jobs essential to the American economy.      We meet drifting farmworkers in North Carolina, exploited garment workers in New Hampshire, illegal immigrants trapped in the steaming kitchens of Los Angeles restaurants, addicts who struggle into productive work from the cruel streets of the nation’s capital—each life another aspect of a confounding, far-reaching urgent national crisis. And unlike most works on poverty, this one delves into the calculations of some employers as well—their razor-thin profits, their anxieties about competition from abroad, their frustrations in finding qualified workers.     This impassioned book not only dissects the problems, but makes pointed, informed recommendations for change. It is a book that stands to make a difference.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "The Ever-Running Man (Sharon McCone Mysteries)",
        "Authors": "By Muller, Marcia",
        "Description": "San Francisco private eye Sharon McCone is hired by her husband's security firm to track down \"the ever-running man,\" a shadowy figure who has been leaving explosive devices at their various offices. She doesn't have to search for long. When McCone narrowly escapes an explosion at the security firm's San Francisco location, she catches a glimpse of his retreating figure. The ever-running man is dangerously close - and anyone connected to the company seems to be within his deadly range.To complicate matters, McCone is forced to question her intensely private husband, Hy Ripinsky, about his involvement in some of the firm's dark secrets. The history of corruption may jeopardize their marriage, but uncovering the secrets of the firm may be the only way she can save her husband's life, and her own.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Kiplinger's 12 steps to a worry-free retirement",
        "Authors": "By Miller, Theodore J.",
        "Description": "This practical guide to managing money demonstrates how to take any financial situation and turn it around as it discusses such topics as investment, mortgages and buying a new home, saving for a child's education, credit, and more. Reprint.",
        "Category": " Business & Economics , Personal Finance , Money Management",
        "Publisher": "Kiplinger Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Into the Unknown: Solving Ancient Mysteries",
        "Authors": "By Fagan, Brian M.",
        "Description": "Explains the ways in which archaeologists use forensic medicine to study ancient corpses; nonintrusive methods to study the marks societies have left on the land, artifacts to study ancient trade, everyday objects to study the daily lives of the humble, and the remains of architecture, art, and arcane sources to study such intangible aspects of human life as religious beliefs, burial practices, and storytelling. Includes numerous color photos and diagrams of archeological sites and artifacts. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Social Science , Archaeology",
        "Publisher": "Natl Geographic Society",
        "Price Starting With ($)": "5.66",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Family Names",
        "Authors": "By Hook, Henry",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "April",
            "Year": "1982"
        }
    },
    {
        "Title": "Handmade Christmas (The Best of Martha Stewart Living)",
        "Authors": "By Oxmoor House",
        "Description": "",
        "Category": "",
        "Publisher": "Clarkson N. Potter - Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Red Ice",
        "Authors": "By Masters, Anthony and Barker, Nicholas",
        "Description": "With the renewal of the South Atlantic treaty up for grabs, Captain Maxwell of the patrol ship \"Mercator\" battles KGB backed Argentine terrorists, espionage, assassinations, and natural disasters to protect the vast mineral wealth of Antartica",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.91",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "The Nudist on the Late Shift: And Other True Tales of Silicon Valley",
        "Authors": "By Bronson, Po",
        "Description": "The Nudist on the Late Shift is the true story of a new generation at the proving point of their lives, written by the most exciting and authentic literary voice to emerge from Silicon Valley, Po Bronson.        This is a defining portrait of young people in the whirl of an information revolution and an international gold rush. Masses of entrepreneurs and tech wizards, immigrants and investors, dreamers and visionaries, are heading west to seek their fortune and a new destiny. In Bronson, they have found their troubadour.        Already hailed by The Village Voice Literary Supplement as \"the most complete and empathetic portrait of the Valley so far,\" The Nudist on the Late Shift establishes Bronson as the first author to capture the spirit of this new mecca. Recently chosen by the VLS as one of 1999's     \"Writers on the Verge,\" Bronson has spent the past decade searching Silicon Valley for the best stories, several of which have been published in Wired. Now he has woven those stories together, taking us inside the world of the newcomers, brainiacs, salespeople, headhunters, utopians, plutocrats, and innovators who are transforming our culture.         Writes the VLS: \"Bronson evocatively portrays the overwhelming unpredictability of life in the Valley: getting fired can be part of daily life. But with a zero unemployment rate, the wounded don't stay that way for long. Bronson is at his best describing this radically shifting environment, where everyday folk with the right idea and the stamina stand to make millions in a couple of years, skipping rungs on the career ladder at a mind-boggling pace. Bronson recognizes that Silicon Valley's boom is made up of small explosions, and The Nudist puts us at ground zero.\"",
        "Category": " Business & Economics , Industries , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "All the Great Pretenders",
        "Authors": "By Adams, Deborah",
        "Description": "Twin Elms Inn Was Becoming a Three-Ring Circus......featuring the disappearing act of an eccentric rich girl and the psychic hired to find her. Innkeeper Kate Yancy has all she can do just to live there, let alone manage the place -- coping with a beauty-queen chambermaid, a religious-fanatic cook, a handful of eccentric guests, and a yardful of reporters.It's a heady shot of excitement for little Jesus Creek, Tennessee, already in the throes of a Sesquicentennial celebration.Murder is the only thing missing -- but not for long.Set in the sultry heat of a Southern summer, Deborah Adams's first mystery is alight with small-town mischief, modest mayhem, and a homespun cast of unforgettable characters who turn a rural shindig into a real-life soap opera.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Crewel World (A Needlecraft Mystery)",
        "Authors": "By Ferris, Monica",
        "Description": "When Betsy's sister is murdered in her own needlecraft store, Betsy takes over the shop and the investigation.But to find the murderer, she'll have to put together a list of motives and suspects to figure out this killer's pattern of crime...Includes a beautiful embroidery pattern!",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Downriver",
        "Authors": "By Hobbs, Will",
        "Description": "No adults, no permit, no river map. Just some \"borrowed\" gear from Discovery Unlimited, the outdoor education program Jessie and her new companions have just ditched. Jessie and the others are having the time of their lives floating beneath sheer red walls, exploring unknown caves and dangerous waterfalls, and plunging through the Grand Canyon's roaring rapids. No one, including Troy, who emerges as the group's magnetic and ultimately frightening leader, can forsee the challenges and conflicts.What will be the consequences of their reckless adventure?",
        "Category": "",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "St. Oswald's Niche",
        "Authors": "By Frankos, Laura",
        "Description": "After moving into a dormitory with other students who are participating in an archaeological dig in England, Jennet suspects that someone is trying to frame her for stealing, and she sets out to discover why",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ivy Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "One Door Closes, Another Door Opens",
        "Authors": "By Houston, Julie and Pine, Arthur",
        "Description": "The personal stories of successful people show readers how failure, rejection, and even tragedy can become significant turning points in their lives",
        "Category": " Philosophy , Ethics & Moral Philosophy",
        "Publisher": "DELL",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Cold Comfort",
        "Authors": "By Lake, M.D.",
        "Description": "Campus security officer Peggy O'Neill investigates the death of computer whiz Mike Parrish and the disappearance of another man, both ex-lovers of a Swedish bombshell involved with a network of computer bandits",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "25.04",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "King David's Spaceship",
        "Authors": "By Jerry pournelle",
        "Description": "",
        "Category": "",
        "Publisher": "Timescape / Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1981"
        }
    },
    {
        "Title": "Feminine Ingenuity: Women and Invention in America",
        "Authors": "By MacDonald, Anne L.",
        "Description": "\"What useful things have American women conceived of and developed that have contributed to the progress of technology, science, and engineering?\" Raise that question, even among educated feminists of the 1990s, and you are likely to be met with a fumbling for names. Raise it among the skeptics of women's creative talents and they will reply \"Where, after all, is the historical record?\"\"In the Patent Office,\" replies historian Anne L. Macdonald, author of Feminine Ingenuity. In her engaging and meticulously researched history of American women inventors, she presents not only the official evidence of women's remarkable achievements contained in two centuries' worth of Patent Office archives, but also a wealth of material she has discovered in unofficial contemporary accounts of women's inventions: magazines, journals, lectures, major fairs and expositions, and the manuscripts of several important inventors.Feminine Ingenuity celebrates the achievements of women inventors from Mary Kies, whose 1809 patent for a method of weaving straw was the first issued to a woman, to Gertrude Elion, the Nobel Prize Laureate whose anticancer drugs led to her 1991 election as the first woman in the Inventors Hall of Fame. It is not, however, a litany of accomplishments of previously unsung individual women, for Macdonald doesn't ignore the downside of women's struggle.Society, with its relentless assignment of females to the domestic sphere, discouraged mechanically talented girls by barring them from the kind of technical education it lavished upon their brothers. It took the Civil War and the consequent absence of their men to force these alumnae of required cooking and sewing classes to learn not only to operate farm machinery but to invent major improvements to it.By presenting women inventors against such a historical backdrop, Macdonald keys their experiences to the larger themes of women's changing economic, political, and social position. This makes Feminine Ingenuity a thought-provoking account of a significant and previously neglected aspect of the history of women.",
        "Category": " History , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    }
]