[
    {
        "Title": "The Tree Bride: A Novel",
        "Authors": "By Mukherjee, Bharati",
        "Description": "National Book Critics Circle Award-winner Bharati Mukherjee has long been known not only for her elegant, evocative prose but also for her characters--influenced by ancient customs and traditions but also very much rooted in modern times. In The Tree Bride, the narrator, Tara Chatterjee (whom readers will remember from Desirable Daughters), picks up the story of an East Bengali ancestor. According to legend, at the age of five Tara Lata married a tree and eventually emerged as a nationalist freedom fighter. In piecing together her ancestor's transformation from a docile Bengali Brahmin girl-child into an impassioned organizer of resistance against the British Raj, the contemporary narrator discovers and lays claim to unacknowledged elements in her 'American' identity. Although the story of the Tree Bride is central, the drama surrounding the narrator, a divorced woman trying to get back with her husband, moves the novel back and forth through time and across continents.",
        "Category": " Fiction , Literary",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Freud and the Crisis of Our Culture",
        "Authors": "By Trilling, Lionel",
        "Description": "",
        "Category": "",
        "Publisher": "The Beacon Press",
        "Price Starting With ($)": "11.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "The Clear Skin Prescription: The Perricone Program to Eliminate Problem Skin",
        "Authors": "By Perricone, Nicholas",
        "Description": "From the #1 New York Times–bestselling author of The Perricone Prescription and The Wrinkle Cure comes a powerful new weapon in the fight for clear and healthy skin. No matter your age, race, or gender, here's everything you need to know about acne –– and how to prevent it.  Long recognized as a pioneer in reversing skin damage caused by aging, board–certified dermatologist and #1 New York Times–bestselling author Nicholas Perricone, M.D., now turns his knowledge and experience toward acne. Although often thought of as an unavoidable teenage problem, in reality millions of adults suffer from this inflammatory disease well into middle age.  The Clear Skin Prescription delivers a complete program that incorporates Dr. Perricone's trademark three–tiered approach (anti–inflammatory diet, targeted acne–fighting nutritional supplements, and breakthrough topical applications) that will help you clear your skin in a matter of days. Not only will you see impossible–to–ignore improvement in your skin, but the program will also help improve your body's overall health and appearance. Like the #1 bestseller The Perricone Prescription, The Clear Skin Prescription features dramatic before–and–after photos, rock–solid scientific background, and a day–by–day program of meals and exercise. And, Dr. Perricone dispels common medical myths regarding the causes and treatment of acne. By following the Perricone Program of diet, vitamins, topical applications and exercise, you can dramatically reduce the appearance of blemishes and breakouts and achieve a smoother, clearer complexion within three days –– to look and feel better than you ever thought possible.",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Companion to Literature",
        "Authors": "By Eta, Braubury, Mottram",
        "Description": "",
        "Category": "",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "October",
            "Year": "1973"
        }
    },
    {
        "Title": "Handbook Plus: The Handbook for Today's Driver",
        "Authors": "By Charles D. Torreiro",
        "Description": "",
        "Category": "",
        "Publisher": "Propulsion International Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Edith Wharton",
        "Authors": "By Lewis",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1977"
        }
    },
    {
        "Title": "Background to Egypt Five Thousand years of Civilization",
        "Authors": "By Editors",
        "Description": "",
        "Category": "",
        "Publisher": "Egypt",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The Gourmet Prescription for Low-Carb Cooking",
        "Authors": "By Chud, Deborah Friedson, M.D.",
        "Description": "Brings together 163 recipes that focus on high-fiber vegetables and fruits and are tailored for such dietary results as lower insulin, increased fat-burning capacity, more energy, and weight loss. Reprint. 25,000 first printing.",
        "Category": " Cooking , Methods , Gourmet",
        "Publisher": "BAY BOOKS",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "The Breakdown Lane",
        "Authors": "By Mitchard, Jacquelyn",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Behavioral Assessment of Adult Disorders",
        "Authors": "By Barlow, David H. (EDT)",
        "Description": "",
        "Category": " Psychology , Clinical Psychology",
        "Publisher": "The Guilford Press",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "December",
            "Year": "1981"
        }
    },
    {
        "Title": "Over Her Dead Body",
        "Authors": "By White, Kate",
        "Description": "I pushed the door to Mona's office fully open. She was lying on the floor just in front of her desk, face-up, dressed in black pants and top, her arms and legs twitching violently as if she had touched a high-voltage wire... New York Times bestselling author and Cosmopolitan editor in chief Kate White knows firsthand that the magazine business is murder. Now she's brought back her smart and gutsy crime writer Bailey Weggins for a case set against the glossy pages of a celebrity rag where somebody is about to give Bailey's new boss a lethal deadline. Talk about rapid turnover-in a matter of days Bailey Weggins gets axed from one New York magazine and hired by another. Her new job at Buzz, a weekly filled with sizzling gossip, has Bailey covering celebrity crime, including the starlet who got caught stuffing Fendi purses down her pants and the aging hunk who shot his lover with a Magnum. And Bailey doesn't have to look far for her next story: she finds her boss, Mona Hodges, gasping her last breath after being bludgeoned with a blunt object. A raging tyrant, Mona made Buzz a top 'zine but racked up an impressive enemies list along the way. Everyone from a chubby singer she dubbed \"Fat Chance\" to a mail guy she once reamed out would be glad to see Mona six feet under. And Bailey Weggins intends to get the scoop on whodunit even though one of her closest friends is at the top of the suspects list. Now, with her strappy sandals in one hand and her cell phone in the other, Bailey's out hunting for clues everywhere from the mean streets of Brooklyn's Little Odessa to a posh company picnic in the Hamptons. In just about a New York minute she's got a crush on a sexy filmmaker-and some scary insight into her boss's murder. The first can give her the hot summer fling she's itching to have. The second can get her killed...",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Yosemite: A Guide to Yosemite National Park, California (Handbook 138)",
        "Authors": "By Division of Publications National Park Service (U.",
        "Description": "Cover title reads: Yosemite: Official National Park Handbook.  Spine title reads: Yosemite National Park.  Part 1 introduces the park and its early conservationist champion, John Muir.  Part 2 explores the park's natural and cultural history.  Part 3 presents concise guide and reference materials, including a full-color map of the park.",
        "Category": " Travel , Parks & Campgrounds",
        "Publisher": "National Park Service",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Bill James Historical Baseball Abstract",
        "Authors": "By James, Bill",
        "Description": "Offers a decade-by-decade look at baseball history, encyclopedic listings of players and their stats, insightful player ratings and comparative performance evaluations, and essays on a host of baseball topics",
        "Category": " Sports & Recreation , Baseball , History",
        "Publisher": "Villard",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "New song in a strange land;",
        "Authors": "By Dendel, Esther Warner",
        "Description": "",
        "Category": "",
        "Publisher": "HOUGHTON MIFFLIN CO",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1948"
        }
    },
    {
        "Title": "FamilyFun - My Great Idea: 350 Parents Share Their Creative Tips",
        "Authors": "By Cook, Deanna F. (EDT) and Meryman, Charlotte (EDT)",
        "Description": "My Great Idea, an inspirational book showcasing practical, innovative ideas to solve everyday problems, is the latest addition to our successful FamilyFun book series. Filled with creative parenting and problem-solving ideas-many straight from parents who read FamilyFun magazine-My Great Idea tackles such challenges as sibling rivalry, harried morning routines, cranky pre-dinner hours, anxiety about moving to a new home; getting kids to do chores, and many more.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Disney Editions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "The Momstown Guide to Getting It All: A Life Makeover For Stay-At-Home Moms",
        "Authors": "By Goulet, Mary and Reider, Heather",
        "Description": "The hosts of the hit internet radio show MomsTown offer insights, resources, and motivation to help stay-at-home moms set and achieve their personal goals for a more satisfying life ore and more women are taking a break from their careers to devote time to being a mom. But as some women find, going from cleaning out the inbox to cleaning up the toy box can be a bit of a shocking transition. That's where The MomsTown Guide to Getting It All comes in. Internet radio hosts Mary Goulet and Heather Reider have been lifesavers to many stay-at-home moms, providing friendship, community, and motivation to women who might otherwise have felt marginalized. The MomsTown philosophy reminds moms that they can make their dreams come true without sacrificing family life in just ten weeks!",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "The Driveway Diaries: A Dirt Road Almanac",
        "Authors": "By Brookes, Tim",
        "Description": "While working on a doomed book about commuting, Tim Brookes developed an odd affection for dirt roads. This led him to study his own driveway, a tiny dirt road, a masterpiece of inconvenience, a many-mooded borderlands in the balance of power between order and chaos. The result: The Driveway Diaries, a well-balanced mix of poignant and humorous observations about nature, the seasons and family life.Tim Brookes is the author of A Hell of a Place to Lose a Cow, which was selected as one of the top travel books of the year by The New York Times and Booklist. He has lived for two decades in Vermont, where he teaches and writes.",
        "Category": " Family & Relationships , General",
        "Publisher": "Turtle Point Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Take Me Out to the Ballpark: An Illustrated Guide to Baseball Parks Past & Present",
        "Authors": "By Leventhal, Josh and MacMurray, Jessica M.",
        "Description": "Featuring hundreds of full-color photographs and illustrations of every Major League ballpark, famous stadiums from the past, and dozens of Minor and Negro league parks, Take Me Out to the Ballpark has surely earned its place as one of the most beloved baseball books. New stadiums in this completely revised and updated edition include Citizens Bank Ballpark (Philadelphia), PETCO Park (San Diego), and the newly renovated RFK Stadium (Washington, D.C.) home to the Washington Nationals. Crammed with the statistics baseball fans love, Take Me Out to the Ballpark will hit a home run with legions of new readers this fall.",
        "Category": " Sports & Recreation , Baseball , History",
        "Publisher": "Black Dog & Leventhal",
        "Price Starting With ($)": "7.4",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Forts and Fortresses: From the Hillforts of Prehistory to Modern Times-The Definitive Visual Account of the Science Fortification",
        "Authors": "By Brice, Martin",
        "Description": "Traces the history of fortification from the Ancient Babylonian brick structures in 3500 BC, to the massive Atlantic Wall erected by the Germans during World War II. Each chapter covers a specific period in history, or a recognizable culture, and documents the best examples of fortification, the defensive innovations of the period, and other key developments. With hundreds of illustrations, many in color. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " History , Military , Wars & Conflicts (Other)",
        "Publisher": "Facts on File",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Ty's Tricks: Home Repair Secrets Plus Cheap and Easy Projects to Transform Any Room",
        "Authors": "By Pennington, Ty",
        "Description": "From the beloved and sexy carpenter on The Learning Channel's Trading Spaces comes a creative, fun, and practical how-to book for home repair and improvement projects.Home improvement heartthrob Ty Pennington fuses carpentry with style in this practical and inspirational how-to book for tackling household projects both large and small--from decorating to home repair. Pennington shares the expertise gained from his years of experience as one of the carpenters on The Learning Channel's Trading Spaces and as a home renovation pro to create an accessible guide to eclectic decorating and renovation.Ty gives readers a sneak peek at some of the projects he's done in his own home and shows how they can be recreated. He also gives readers the lowdown on great tools--and provides a list of his favorite cheap and easy ways to transform any room. Filled with helpful tips, this inspirational book will help readers to explore their own personal style while building their confidence at the same time. It is a one-of-a-kind, fun, user-friendly guide, from a trusted and admired source.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "What Happens When Women Pray",
        "Authors": "By Christenson, Evelyn",
        "Description": "",
        "Category": " Religion , Prayer",
        "Publisher": "Victor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Metamagical Themas: Questing for the Essence of Mind and Pattern",
        "Authors": "By Hofstadter, Douglas R.",
        "Description": "Essays discuss the mind, creativity, artificial intelligence, Rubik's cube, the genetic code, self-referential sentences, musical patterns, and computer programming",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "See Naples: A Memoir : A Peter Davison Book",
        "Authors": "By Allanbrook, Douglas",
        "Description": "The memoir of a great and misunderstood city, this book is a contribution both to literature and history. A sensuous paean to Italian pleasures, it is also the story of the American military advance northward up the boot of Italy during World War II. See Naples begins four years after the war had ended. Allanbrook, living in a house above the gorgeous ruin of Naples, is passionately involved with an Italian woman who is a ringer for Bette Davis. He is in love with Italy, with the scugnizzi (wiseguys) of the back alleys, with the opera at San Carlo, with this most dramatic of cities. Allanbrook had earlier been among the first Americans to land in North Africa, at Christmas in 1943, and had lived for years uncomfortably close to the fighting, in a division that took heavy casualties. Watching as his friends died, he was among those few who won through to watch the tide of war ebb. See Naples has great sweep, rich humor, and broad learning. It is a remarkable creative act, a stunning tri",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Where the Rivers Ran Backward",
        "Authors": "By Merritt, William E.",
        "Description": "The author relates his own observations of and experiences during the Vietnam War, recalling the sights and sounds, the mood from one day to the next and the terror and absurdities of the war",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Univ of Georgia Pr",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Battles and Leaders of the Civil War",
        "Authors": "By Bradford, Ned (EDT)",
        "Description": "First-hand testimonials from officers, soldiers, and civilians involved in America's bloodiest conflict, accompanied by black and white line drawings, etchings, and maps.  Covers battles from Bull Run and Gettysburg to the surrender at Appomattox, with words from Lee, Grant, Sherman as well as lesser known participants such as medics and nurses.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Motherless Daughters: The Legacy of Loss",
        "Authors": "By Edelman, Hope",
        "Description": "Explores the profound impact of the loss of one's mother on women of all ages, offering a thought-provoking study of the nature of mother-daughter relationships and sharing insights and experiences designed to help motherless daughters cope with their loss. Reprint.",
        "Category": " Psychology , Emotions",
        "Publisher": "Delta",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Power of Five: Hundreds of 5-Second to 5-Minute Scientific Shortcuts to Ignite Your Energy, Burn Fat, Stop Aging and Revitalize Your Love Life",
        "Authors": "By Cooper, Robert K. and Bloomfield, Harold H.",
        "Description": "A practical health guide offers a collection of exercises for those without much time that promises to supply good health in just a few minutes each day, offering tips on losing weight, increasing energy, enhancing one' love life, and slowing down the aging process. Reprint.",
        "Category": " Health & Fitness , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Presidential Decision Making: The Economic Policy Board",
        "Authors": "By Porter, Roger",
        "Description": "Presidential Decision Making describes two organizational challenges the President faces - the interrelatedness of the issues he is expected to address and the fragmented structure of the executive departments and offices he presides over. The dynamics and problems of the Presidency are illuminated in this inside account of decision making in the White House. Newly elected presidents invariably proclaim their commitment to an enlarged role for cabinet, department, and agency heads but often abandon the effort after a few months in office. The Economic Policy Board, a cabinet-level body established shortly after Gerald Ford became President, was one of the most systematic and sustained attempts to organize advice for the President in recent decades. This book examines in detail the Board's deliberations over three controversial policy issues: the 1975 State of the Union tax proposals, the U.S.-U.S.S.R. Grain Agreement, and the 1976 footwear import decision. In evaluating these decisions and assessing the Board, which Gerald Ford called 'the most important institutional innovation of my administration', the author draws on scores of interviews with cabinet officials and career civil servants. The author proposes methods for organizing the decision-making process in the White House and for structuring the cabinet-level committees.",
        "Category": " Political Science , American Government , General",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "5.63",
        "Publish Date": {
            "Month": "December",
            "Year": "1982"
        }
    },
    {
        "Title": "Food from the Heartland: The Cooking of America's Midwest",
        "Authors": "By Andrews, Glenn",
        "Description": "The first and the latest settlers of the Midwest provide these recipes for a wide array of dishes, such as Polish Vegetable Salad, Swedish Limpa Bread, and Hungarian Veal Paprika",
        "Category": " Cooking , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "The Transformational Leader: The Key to Global Competitiveness",
        "Authors": "By Devanna, Mary Anne and Tichy, Noel M.",
        "Description": "How to transform an organization, based on fascinating, inside stories of major industrial companies and service companies (including Fortune 500 companies), aggressive smaller firms, and European companies. Provides insights into the styles and philosophies of leaders and executives who have transformed their companies, whether big or small, and offers practical advice on middle management's role in transforming large organizations.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Cat Breaking Free: A Joe Grey Mystery (Joe Grey Mysteries)",
        "Authors": "By Murphy, Shirley Rousseau",
        "Description": "Joe Grey isn't your average feline. After all, there's nothing ordinary about a cat who solves crimes. But it's more than his skill and cunning on the mean streets that makes Joe stand out among the legion of cat detectives on the prowl today -- it's how Joe cracks cases that makes him so unique. Join Joe Grey, his lady friend Dulcie, and their tattercoat friend Kit in the eleventh delightful installment in the series that \"raises the stakes of the feline sleuth genre\" (Booklist) and discover the secret they hide from most people -- and the mystery that makes Joe Grey so exceptional.CAT BREAKING FREEThe fur starts flying -- the fur of Joe Grey, Feline P.I., that is -- when a gang from L.A. comes up to tranquil Molena Point, California, and begins breaking into the village's quaint shops. After all, Molena Point has been his home since he was a kitten eating scraps from the garbage behind the local delicatessen, and he doesn't take well to marauding strangers. Joe even wonders whether the blonde who's moved in next door to his human companion Clyde could be a part of the gang -- she's been acting pretty suspicious lately.But when the strangers start trapping and caging feral cats -- speaking cats, like Joe and his girlfriend Dulcie -- it proves too much for the intrepid four-footed detective. And when one of the gang is murdered, and a second mysterious death comes to light, he has no choice but to try to stop the crimes. Joe, Dulcie, and Kit, who used to be a stray herself, are deep into the investigation when they are able to release the three trapped felines. But as Kit leads them away to freedom, will she herself return to that wild life?In this marvelous book that once again opens the door to the spectacular world of Joe Grey, meet three new cats -- winning cats drawn from among hundreds of their owners' entries and chosen at random to appear in this book -- and join old friends and new in Shirley Rousseau Murphy's most ambitious and enjoyable mystery to date.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Sewing With An Overlock - Singer Sewing Reference Library",
        "Authors": "By Cy Decosse Editors",
        "Description": "Introduces the features and accessories of overlock sewing machines, and shows how to baste and sew seams, adjust stitches, and make clothing",
        "Category": "",
        "Publisher": "Cy De Cosse Incorporated",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Other Side of Heaven: Post-War Fiction by Vietnamese and American Writers",
        "Authors": "By Karlin, Wayne (EDT), Khue, Le Minh, Le, Minh Khue (EDT), Truong, Vu (EDT), and Vu, Truong (EDT)",
        "Description": "These stories represent the \"second wave\" of fiction--works about the aftermath of the Vietnam conflict as it moved into both countries, touching and forever changing not only the veterans, but also their families and their societies. Contributors include John Edgar Wideman, Larry Brown, Robert Olen Butler, Philip Caputo, Bobbie Ann Mason, Ngo Tu Lap, Tim O'Brien, and others.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Curbstone Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "50 Greatest Golf Lessons Of The Century: Private Sessions with the Golf Greats",
        "Authors": "By Newell, Steve and Jacobs, John",
        "Description": "John Jacobs is one of the most respected golf teachers the game has ever known. Perhaps no one is better qualified than Jacobs to teach the greatest golf lessons of the 20th century because he has taught the greatest golfers of the 20th century. His reputation as an authority on the golf swing, with a sharp eye for detail and an uncanny talent for fixing faults, has made him a magnet for aspiring young stars as well as experienced champions. He is unique in having taught, studied, or played against (and often beaten) virtually every great golfer of the last 60 years.50 Greatest Gold Lessons of the Centuryis a remarkable collection of personal anecdotes, expert swing analysis, and fascinating insights into what makes a champion and how these great players play the game. Jacobs reveals the lessons he has given to the golfing greats, recounts many of the great shots he has witnessed in tournament play, and highlights the secrets to their successful swings.The lessons come from a veritable Who's Who of golf, from legends such as Ben Hogan, Bobby Jones, Sam Snead, Jack Nicklaus, and Arnold Palmer, to the stars of today's PGA TOUR, such as Tiger Woods, Mark O'Meara, Greg Norman, Nick Faldo, and Ernie Els.Each lesson is complemented by specially commissioned artwork, as well as full-color action shots of today's players-plus rare, vintage photography that brings to life some of the greatest players of all time.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "At the table of Israel: A unique collection of three hundred traditional and modern Israeli recipes",
        "Authors": "By Lesberg, Sandy",
        "Description": "",
        "Category": "",
        "Publisher": "The Bobbs-Merrill Company, Inc.",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "American Primitives",
        "Authors": "By Robert Miller",
        "Description": "",
        "Category": "",
        "Publisher": "Wallace-Homestead Book Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Wildlife Photography: The Art and Technique of Ten Masters",
        "Authors": "By Rayfield, Susan and Guilfoyle, Ann (EDT)",
        "Description": "Describes the careers of professional nature photographers and discusses their equipment and methods for photographing wild animals ranging from birds to fish",
        "Category": " Photography , General",
        "Publisher": "Amphoto",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Financial Management: Theory and Practice (Study Guide)",
        "Authors": "By Brigham and Gapenski",
        "Description": "",
        "Category": "",
        "Publisher": "Dryden Press",
        "Price Starting With ($)": "6.61",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Webster's Dictionary of American Women",
        "Authors": "By Merriam-Webster (EDT)",
        "Description": "",
        "Category": " Biography & Autobiography , Reference",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Women in the Middle Ages",
        "Authors": "By Frances Gies, Joseph Gies",
        "Description": "Explores the living conditions, expectations, roles, and accomplishments of real women of the high Middle Ages, ranging from peasant to merchant's wife to queen",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1979"
        }
    },
    {
        "Title": "The End of Marketing as We Know It",
        "Authors": "By Zyman, Sergio",
        "Description": "Marketing as we know it today is about image. It's about getting consumers to love your products. It's about producing award-winning commercials and promotions, and creating ads people like. It's about buzzwords like \"events,\" \"relationships,\" and \"intimacy.\" Problem is, it's not working. So says the \"Aya-Cola,\" Sergio Zyman, two-time marketing czar of Coca-Cola and today quite possibly the most famous marketer--and marketing gadfly--in the world. Brilliant and irascible, Zyman is best known for reinventing The Coca-Cola Company's marketing approach by spearheading the launches of such world-class global brands as Diet Coke, New Coke, Classic Coke, Fruitopia, and Sprite. Over a combined thirteen-year period, Zyman directed a zestful multibillion-dollar marketing effort, masterminding such timeless campaigns as \"Coke Is It!\" and \"Always Coca-Cola,\" that resulted in sales of more than 15 billion cases of Coke products per year to over 5 billion consumers in 190 countries. In The End of Marketing As We Know It, Zyman reveals, with characteristic flair, the counterintuitive and often provocative marketing strategies and tactics that earned him the nickname \"Aya-Cola\" on Madison Avenue and helped to increase the market value of The Coca-Cola Company from a mere $56 billion to an astounding $193 billion in just five years. Shattering the mystique surrounding the discipline of marketing and upending the tradition of creating popular, crowd-pleasing ads and promotions, Zyman recounts such illuminating anecdotes as why he decided not to rerun the much-loved \"I'd like to teach the world to sing\" Coke commercial and why \"feel-good\" marketing is pointless unless it results in sales. He also explores: Why marketing isn't an art but a science How a well-honed strategy is more important to your success than what your ads say How everything communicates--and what that means to consumers The rise of consumer democracy--and the threat of consumer communism How marketing locally is necessary to build global equity Why marketing is too important to be left to the marketing department How ad agencies are fixated on the wrong things And why: It's crucial to increase your marketing budget--not to cut it--when sales are down Megabrands are a terrible idea, but huge brands are a great idea It's suicide to base your sales projections on previous performance You must be focused on profit, not volume for volume's sake It's sometimes necessary to enter a category just to kill it All marketers must be accountable to shareholdersVisionary and rogue, The End of Marketing As We Know It captures a seismic shift in marketing, from the master of the trade.",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Touch the Top of the World: A Blind Man's Journey to Climb Farther Than the Eye Can See",
        "Authors": "By Weihenmayer, Erik",
        "Description": "The inspiring true tale of a mountain climber who was diagnosed with a degenerative eye disorder traces his struggle to ascend the \"Seven Summits\" in the wake of the bad news. 35,000 first printing.",
        "Category": " Biography & Autobiography , Sports",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Between Friends: Japanese Diplomats Look at Japan-U.S. Relations",
        "Authors": "By Kitamura, Hiroshi, Murata, Ryohei, and Okazaki, Hisahiko",
        "Description": "",
        "Category": "",
        "Publisher": "Weatherhill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "Emeril's Creole Christmas",
        "Authors": "By Lagasse, Emeril and Bienvenu, Marcelle",
        "Description": "Emeril kicks it up a notch Louisiana-style for the holidays.  The holidays should be a time for fun and family, but the planning can be murderous. Let Emeril guide you through it in high Louisiana fashion. Equipped with New Orleans traditions and over 100 recipes, Emeril's Creole Christmas provides complete menus down to the shopping lists, for a Christmas Eve dinner, Christmas Day brunch, and New Year's Eve and Day suppers. Emeril likes a party and at the holidays he kicks it up a notch, with food that impresses and satisfies Corn Cakes with Caviar, Brandied Baked Ham with Sugarcane Sauce, Funky Stuffed Oysters, and Chocolate Truffles are just a few of the recipes that will make your celebrations memorable. Emeril also makes a gift a lagniappe of his very favorite dishes such as Quail and Sausage Christmas Gumbo and Lobster Cheesecake. And there are the stocking stuffers gifts from the Creole kitchen including Emeril's Homemade Worcestershire Sauce, Buttercream Mints, and Cocoa Rum Balls. Filled with beautiful color photography to celebrate the season, Emeril's Creole Christmas will be a gift to give yourself as well as family and friends.    The holidays should be a time for fun and family, but the planning can be murderous. Let Emeril guide you through it in high Louisiana fashion. Equipped with New Orleans traditions and over 100 recipes, Emeril's Creole Christmas provides complete menus down to the shopping lists, for a Christmas Eve dinner, Christmas Day brunch, and New Year's Eve and Day suppers. Emeril likes a party and at the holidays he kicks it up a notch, with food that impresses and satisfies--Corn Cakes with Caviar, Brandied Baked Ham with Sugarcane Sauce, Funky Stuffed Oysters, and Chocolate Truffles are just a few of the recipes that will make your celebrations memorable. Emeril also makes a gift--a lagniappe--of his very favorite dishes such as Quail and Sausage Christmas Gumbo and Lobster Cheesecake. And there are the stocking stuffers--gifts from the Creole kitchen--including Emeril's Homemade Worcestershire Sauce, Buttercream Mints, and Cocoa Rum Balls. Filled with beautiful color photography to celebrate the season, Emeril's Creole Christmas will be a gift to give yourself as well as family and friends.",
        "Category": " Cooking , Holiday",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Soldier's Heart: Survivors' View of Combat Trauma",
        "Authors": "By Hansel, Sarah (EDT), Steidle, Ann, Zaczek, Grace, Zaczek, Ron (EDT), and National Trauma Institute at Baltimore, Inc. (COR)",
        "Description": "",
        "Category": " Psychology , Psychopathology , General",
        "Publisher": "Sidran Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Easy gardening with drought-resistant plants",
        "Authors": "By Nehrling, Arno",
        "Description": "",
        "Category": "",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Writing in General and the Short Story in Particular: An Informal Textbook",
        "Authors": "By Hills, L. Rust",
        "Description": "A practical guide to the craft of short fiction explores such essential problems as motivation, character, plot, flashback, foreshadowing, and the techniques of suspense",
        "Category": " Fiction , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Dr. Atkins' Quick and Easy New Diet Cookbook",
        "Authors": "By Atkins, Robert C., M.D. and Atkins, Veronica C.",
        "Description": "Great Taste in No Time  The companion cookbook to the bestselling Dr. Atkins' New Diet Revolution -- with mouthwatering recipes that go from stovetop to tabletop in 30 minutes or less.  Forget about salad without dressing, dried-out skinless chicken breasts, and tasteless steamed vegetables. Forget about tiny portions, no fat/no flavor foods, and no second helpings. Forget about spending hours in the kitchen. With the delicious recipes in Dr. Atkins' Quick and Easy New Diet Cookbook, you'll feast on juicy steaks, succulent chops, and savory egg and cheese dishes, and indulge in creamy sauces and desserts.  Based on the bestselling Dr. Atkins' New Diet Revolution, the recipes in the Quick and Easy New Diet Cookbook will let you eat the Atkins way, whether you're just beginning the diet, shedding pounds, or maintaining your ideal weight. Each recipe has a carbohydrate-gram count per serving, and there's even a guide to converting your own recipes to the Atkins standard. Designed for healthy eating, this cookbook will help you produce delectable meals every day that will be the key, to a whole new you.",
        "Category": " Cooking , Health & Healing , Weight Control",
        "Publisher": "Fireside",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Marilyn Monroe: Unseen Archives",
        "Authors": "By Clayton, Marie",
        "Description": "",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "7.62",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "World's Shortest Stories",
        "Authors": "By Moss, Steve (EDT)",
        "Description": "This is a quintessential short story book fo r everyone who thinks they don't have any time to read. Each story is less than 55 words long - ideal for the beach, bus , train, anywhere.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Running Press Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Cat Nips!",
        "Authors": "By Reynolds, Rick and Reynolds, Martha",
        "Description": "A guide to creating luscious treats for felines features recipes for Minnie's Morsels for Mature Cats, Aunt Olive's Kitty Vittle, and Ella's Sumptuous Sushi Rolls. Original.",
        "Category": " Cooking , General",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "What to Say and How To Say It: For All Occasions",
        "Authors": "By Belson, David",
        "Description": "Here is a compact, practical and conveniently arranged manual to meet the requirements of every person engaged in community or public activities. It will also prove invaluable to clubs, lodges, unions, associations, PTA's, schools, churches, and similar organizations.What to Say and How To Say It For All Occasions stands out as the only comprehensive and modern book devoted to guiding the participant in community or public activities in drafting resolutions, composing inscriptions, writing a testimonial, running a testimonial dinner, preparing a eulogy, or the like. Books on public speaking have for their function the teaching of the principles of speaking. This book not only explains how to speak, but what to say for the most frequently occurring occasions. It supplies a valuable, working tool which those in public activities need.The forms and models which are presented as illustrations throughout the book, stripped of excess verbiage, are ones which have been tested through use. They cover a broad field of activities, and are made complete by the insertion of names and organizations. Enough models are presented to enable the speaker or writer to make several choices, and care has been taken to help the reader to alter or modify them to suit his personality or the needs of the particular situation. A thorough index enables the reader to quickly find what he needs.",
        "Category": " Language Arts & Disciplines , Speech",
        "Publisher": "Castle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1956"
        }
    },
    {
        "Title": "The Great Illusion, 1900-1914 (Rise of Modern Europe)",
        "Authors": "By Hale, Oron James",
        "Description": "",
        "Category": " Travel , General",
        "Publisher": "Harpercollins College Div",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1971"
        }
    },
    {
        "Title": "Baby Einstein: Language Nursery",
        "Authors": "By Zaidi, Nadeem (ILT), Aigner-Clark, Julie, Aigner-Clark, Julie (EDT), and Baby Einstein Company (COR)",
        "Description": "Research has shown that infants have a natural ability to distinguish and assimilate the sounds of all languages, and that repeated exposure to these sounds will help develop a child's auditory abilities. With this book, parents can introduce their babies to the sounds of five languages through simple phrases and photographs of colorful toys. The book includes phrases and object names in English, Spanish, French, Japanese, and Hebrew.",
        "Category": " Juvenile Fiction , Concepts , Words",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "What Does Violet See? Sand and Sea  (Baby Einstein)",
        "Authors": "By Zaidi, Nadeem (ILT) and Aigner-Clark, Julie",
        "Description": "Young children will hve fun as they join Violet the mouse as she sets off on a walk on a beach. On this journey, she marvels at a huge wave, builds a sand castle, and discovers beautiful shell. Children will enjoy the tactile experience delivered through a touch-and-feel sand castle that's featured in the book.",
        "Category": " Juvenile Fiction , Nature & the Natural World , General",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Combat Golf: The Competitor's Field Manual for Winning Against Any Opponent",
        "Authors": "By Ollstein, Bruce Warren and Sweny, Stephen (ILT)",
        "Description": "Combat Golf is certainly great fun to read but it is also a practical guide to improving your game at every level, especially the level that counts the most - winning. \"Make no mistake about it,\" counsels leading golf expert Captain Ollstein, West Point grad and a golfer of formidable reputation, \"golf is war. If you're not looking to win, you probably shouldn't show up.\"Even if your hunger for victory is less than savage, you'll learn inside secrets that will help you in every aspect of your play. Captain Ollstein does it by applying centuries-proven military strategies to all the situations that might arise hole by hole. Whether you're negotiating a handicap, assessing your opponent, preparing yourself mentally, rallying from a triple bogey, fighting as a team, or, most important, applying subtle psychological operations (\"Psyops\" as they're called in the armed forces), the ultimate goal is \"to destroy your opponent's will to win.\"Immortal military quotations down through the ages and amusing illustrations flavor Captain Ollstein's clear-headed packet of for-your-eyes-only instructions. Just don't let this document fall into enemy hands.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Viking",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "200 Years of Innovation in American Business: The Legacy of Alex Brown",
        "Authors": "By Alex Brown",
        "Description": "",
        "Category": "",
        "Publisher": "Deutsche Banc Alex Brown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Roots of English: A Reader's Handbook of Word Origins",
        "Authors": "By Claiborne, Robert",
        "Description": "The richest of languages, English contains some 600,000 words  OED . Of these perhaps 450,000 are in current use. Clairborne discusses the sources of the language in general, then specifically describes the Germanic, Latin, Greek roots of our words. A delightful browse with much value as a reference. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "TimesBooks",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Ephesus",
        "Authors": "By Naci Keskin",
        "Description": "",
        "Category": "",
        "Publisher": "KESKIN COLOR",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Mayor of Casterbridge (Modern Library Classics)",
        "Authors": "By Hardy, Thomas and Stewart, J. I. M. (INT)",
        "Description": "One of Hardy’s most powerful novels, The Mayor of Casterbridge opens with a shocking and haunting scene: In a drunken rage, Michael Henchard sells his wife and daughter to a visiting sailor at a local fair. When they return to Casterbridge some nineteen years later, Henchard—having gained power and success as the mayor—finds he cannot erase the past or the guilt that consumes him. The Mayor of Casterbridge is a rich, psychological novel about a man whose own flaws combine with fate to cause his ruin. This Modern Library Paperback Classic reprints the authoritative 1912 Wessex edition, as well as Hardy’s map of Wessex.",
        "Category": " Fiction , Classics",
        "Publisher": "Modern Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Hours: A Novel",
        "Authors": "By Cunningham, Michael",
        "Description": "In The Hours, Michael Cunningham draws inventively on the life and work of Virginia Woolf to tell the story of a group of contemporary characters who are struggling with the conflicting claims of love and inheritance, hope and despair.The novel opens with an evocation of Woolf's last days before her suicide in 1941, and moves to the stories of two modern American women who are trying to make rewarding lives for themselves in spite of the demands of friends, lovers, and family.Clarissa Vaughan is a book editor who lives in present-day Greenwich Village; when we meet her, she is buying flowers to display at a party for her friend Richard, an ailing poet who has just won a major literary prize. Laura Brown is a housewife in postwar California who is bringing up her only son and looking for her true life outside of her stifling marriage.With rare ease and assurance, Cunningham makes the two women's lives converge with Virginia Woolf's in an unexpected and heart-breaking way during the party for Richard.",
        "Category": " Fiction , Literary",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "A Little English Book of Teas",
        "Authors": "By Mashiter, Rosa and Lopez, Milanda",
        "Description": "A brief history of the English tradition of afternoon tea is accompanied by recipes for tea-time sandwiches, scones, biscuits, cakes and buns",
        "Category": " Cooking , Reference",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Bible Assort Weight Loss Bible",
        "Authors": "By Hornick, Betsy A.",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "7.17",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Bride Stripped Bare: A Novel",
        "Authors": "By Gemmell, Nikki",
        "Description": "A woman disappears, leaving behind an incendiary diary chronicling a journey of sexual awakening. To all who knew her, she was the good wife: happy, devoted, content. But the diary reveals a secret self, one who's discovered that her new marriage contains mysteries of its own. She has discovered a forgotten Elizabethan manuscript that dares to speak of what women truly desire, and inspired by its revelations, she tastes for the first time the intoxicating power of knowing what she wants and how to get it. The question is: How long can she sustain a perilous double life?",
        "Category": " Fiction , Erotica , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2012"
        }
    },
    {
        "Title": "The Wild Girl: The Notebooks of Ned Giles, 1932",
        "Authors": "By Fergus, Jim",
        "Description": "Now in paperback, a stirring historical novel from the author of One Thousand White Women When Ned Giles is orphaned as a teenager, he heads West, hoping to leave his troubles behind. He joins the 1932 Great Apache Expedition on their search for a young boy, the son of a wealthy Mexican landowner, who was kidnapped by wild Apaches. But the expedition's goal is complicated when they encounter a wild Apache girl in a Mexican jail cell, victim of a Mexican massacre of her tribe that has left her orphaned and unwilling to eat or speak. As he and the expedition make their way through the rugged Sierra Madre mountains, Ned's growing feelings for the troubled girl soon force him to choose allegiances and make a decision that will haunt him forever. In this novel based on historical fact, Jim Fergus takes readers on a journey of magnificent sweep and heartbreaking consequence peopled with unforgettable characters. With prose so vivid that the road dust practically rises off the page, The Wild Girl is an epic novel filled with drama, peril, and romance, told by a master. This is the novel your reading group will be talking about long past your discussion!",
        "Category": " Fiction , Historical , General",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Behold: Spot the Difference Bible Stories",
        "Authors": "By Madgwick, Wendy and Alles, Hemesh (ILT)",
        "Description": "Ten favorite Old Testament stories are introduced to readers as paired full-color pictures, with up to ten differences per scene, along with answers and simple versions of each story on subsequent pages.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Yet she must die (A Rinehart suspense novel)",
        "Authors": "By Woods, Sara",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Holt, Rinehart and Winston",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Power in Washington;: A critical look at today's struggle to govern in the Nation's Capital",
        "Authors": "By Cater, Douglass",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "3rd Degree",
        "Authors": "By Patterson, James and Gross, Andrew",
        "Description": "Detective Lindsay Boxer is jogging along a beautiful San Francisco street when a fiery explosion rips through the neighborhood. A town house owned by an Internet millionaire is immediately engulfed in flames, and when Lindsay plunges inside to search for survivors, she finds three people dead. An infant who lived in the house cannot be found - and a mysterious message at the scene leaves Lindsay and the San Francisco Police Department completely baffled.Then a prominent businessman is found murdered under bizarre circumstances, with another mysterious message left behind by the killer. Lindsay asks her friends Claire Washburn of the medical examiner's office, Assistant D.A. Jill Bernhardt, and Chronicle reporter Cindy Thomas to help her figure out who is committing these murders - and why they are intent on killing someone every three days.Even more terrifying, the killer has targeted one of the four friends who call themselves the Women's Murder Club. Which one will it be?While the investigation rages furiously, Lindsay works very closely with a federal officer assigned to the case. At the same time, she learns that one member of the Women's Murder Club is hiding a secret so dangerous and unbelievable that it could destroy them all.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Little & Brown",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Choosing Up Sides",
        "Authors": "By Ritter, John H.",
        "Description": "When preacher's boy Luke Bledsoe steps on a baseball field, he discovers he has real pitching talent. For once, he can be proud of being left-handed. But Reverend Bledsoe believes that the left side is the side of Satan and the baseball field is the Devil's playground. Luke has spent his whole life trying to please his father. Will he choose to give up the game he's come to love-or turn his back on his family?An ALA Best Book for Young Adults1999 IRA Children's Book AwardA BCCB Blue Ribbon Book",
        "Category": " Juvenile Fiction , Historical , United States , General",
        "Publisher": "Viking Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Dr. Koop's Self-Care Advisor: The Essential Home Health Guide for You and Your Family",
        "Authors": "By Ed, Time Life",
        "Description": "",
        "Category": "",
        "Publisher": "Health Publishing Company",
        "Price Starting With ($)": "12.48",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Down on Ponce",
        "Authors": "By Willard, Fred",
        "Description": "This cracker-noir crime novel follows a crew of eccentric career criminals as they take down a powerful group of money launderers in Atlanta.",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "Longstreet Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Change of Life: The Menopause Handbook",
        "Authors": "By Trien, Susan Flamholtz",
        "Description": "Once upon a time, menopause was a deep, dark secret. But not today.   Today we want to know exactly what to expect, how to deal with our physical and emotional changes, and how to continue to live life to the fullest.  • The menopause handbook answers all your questions. You’ll learn• How and why menopause occurs—and how to recognize the physical signs • What to eat for your changing nutritional needs to avoid weight gain and stay healthy• How menopause may affect your sexuality—and why many women find sex better after menopause• What types of exercise are best for you• Strategies for coping with the “middle-age blues”• How to prevent osteoporosis• What causes hot flashes—and how to get fast relief• The truth about the emotional side of menopause—career and role changes, men’s own mid-life crises, and how to deal with stress Combining solid, up-to-date medical information with personal anecdotes from women who have been there, this comprehensive handbook dispels the myths about menopause and guides every woman through this time with confidence.",
        "Category": " Self-help , Aging",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "Growing Up Jewish: An Anthology",
        "Authors": "By David, Jay (EDT)",
        "Description": "The experience of growing up Jewish in America has produced some of the very best works of fiction and nonfiction ever written. Now, Growing Up Jewish brings together twenty-five accounts by some of our most popular and admired authors as well as newer and lesser-known voices. These twenty-five stories of childhood and adolescence explore issues of Jewish identity, language, generational differences, and family life. But above all, they touch on the universal themes, the rites of passage, and the joys and tensions of coming-of-age.",
        "Category": " Social Science , Ethnic Studies , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Gardening Made Easy (An Essential Guide)",
        "Authors": "By Betty Barr Mackey",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Out of Control: Global Turmoil on the Eve of the Twenty First Century",
        "Authors": "By Brzezinski, Zbigniew",
        "Description": "Rarely has there been a book as explosive and challenging as this brilliant analysis of today's massive geopolitical disorder. The triumphant collapse of communism has brought neither economic stability nor social democracy to the former Soviet Union. Nor, for that matter, to the rest of the world. We are living in a time of fragmentation: increasing disunity in Europe, dangerous eruptions in the Islamic republics, growing disparity between the world's rich and poor, and the evils of the \"permissive cornucopia\" in America which, through overstimulation of material desires and sensual self-gratification, is leading to the collapse of Western moral and spiritual values. In short, we are living in a philosophical climate that is \"out of control.\" It is Zbigniew Brzezinski's firm belief that we must draw both moral and political lessons from the \"megadeaths\" of the twentieth century, a century in which at least 167 million people were slaughtered in the name of the \"politics of organized insanity,\" or the \"metamyths\" of such dictators as Hitler, Stalin, and Mao, among others. Unless we can practice selfrestraint derived from a moral commitment in the quest for global democratic \"interdependence,\" we stand destined to risk again our very own survival.",
        "Category": " History , General",
        "Publisher": "Charles Scribner's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "The Book of Pasta",
        "Authors": "By Stewart, Jon and MacKley, Lesley",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Pasta",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Nelson",
        "Authors": "By Warner, Oliver",
        "Description": "",
        "Category": "",
        "Publisher": "Follett Pub. Co",
        "Price Starting With ($)": "7.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Wife of ...: An Irreverent Account of Life in Powertown",
        "Authors": "By Gotlieb, Sondra",
        "Description": "",
        "Category": "",
        "Publisher": "Acropolis Books Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "The Flavour of Concord: Menus & Traditions of an Historic Town",
        "Authors": "By Ahern, Nell Giles",
        "Description": "",
        "Category": "",
        "Publisher": "Concord Antiquarian Society",
        "Price Starting With ($)": "7.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Movie Book - Mini Edition",
        "Authors": "By Phaidon Press (EDT)",
        "Description": "",
        "Category": " Performing Arts , Film , Reference",
        "Publisher": "Phaidon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The Truth Pops Out (Arthur's Family Values, 5 - Honesty)",
        "Authors": "By Marc Brown",
        "Description": "",
        "Category": "",
        "Publisher": "Advance Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Essential Pasta Cookbook",
        "Authors": "By Wendy Stephen",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Thunder Bay Pr",
        "Price Starting With ($)": "7.42",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Retribution",
        "Authors": "By Hoffman, Jilliane",
        "Description": "At the heart of Retribution is C. J. Townsend, a brilliant state prosecutor in Miami well-known for keeping her cool while trying even the most horrific cases. The latest suspect is as base as they come: a vicious killer who savors cruelty and considers murder an art. Amid a maelstrom of media attention, C. J. has just begun to build her case when she is struck with a shattering personal blow connected to her past. Now everything will ride on her ability to hold herself together long enough to put the accused away forever.",
        "Category": " Fiction , Legal",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Virtual Community: Homesteading On The Electronic Frontier The Edge",
        "Authors": "By Rheingold, Howard",
        "Description": "The technology news is filled with money as corporate moguls from Hollywood, the cable business, the computer industry, and the telephone companies scramble to exploit America's much ballyhooed \"Electronic Superhighway\". Suddenly, the interlinked network for computerized communication that grew up quietly on its own is gushing \"Infotainment\" possibilities. Interactive is the buzz word today, alongside convergence, cyberspace, and digital future.In The Virtual Community, Howard Rheingold returns the focus of our attention to people, working back from this commercialized present to the very beginnings of computer-mediated communication, giving us the lay of the land before it was discovered by government and the corporate giants. What he reveals to us is a true electronic frontier of fiercely independent enthusiasts who have created closely knit communities and a rich culture on-line, exchanging everything from scientific data to sexual fantasies, child-rearing tips, and free-ranging political opinions.As Rheingold makes clear, this one of several possible \"futures\" already exists in very appealing form on-line. The question he poses is: Will these original homesteaders on the electronic frontier now be driven out by the \"railroad and cattle barons\" of the communications industry? Even more important, through censorship and commercialization, will we all lose the greatest resource ever for community-building and the free expression of ideas, even before most of us know of its existence?Howard Rheingold is the ultimate insider on networked communication, a key participant in the Bay Area \"WELL\" on-line community. Venturing out from his own neighborhood on the WELL, he gives us a tour of on-line culture in Japan, England, France, and on small and large bulletin boards and networks throughout the United States. He shows us the depth of human interaction made possible, ironically enough, by this seemingly faceless technology, as well as the power of true electronic democracy, and the positive educational force of this medium with which school children in Wyoming can download the greatest research libraries in the world onto their own desktop computers, or interact directly with the White House through electronic mail.But while The Virtual Community is filled with the promise of the ultimate in human development through the global network, Rheingold tempers his enthusiasm with warnings of darker possibilities. What could be the electronic Athens is in danger of becoming one more massive, worldwide opportunity for \"amusing ourselves to death\" with drivel as Geraldo and The Brady Bunch go interactive. Even more chilling are the Orwellian possibilities once we are all wired into the NET, and all our transactions - commercial, political, personal - are electronically mediated and recorded. \"When Big Brother arrives,\" Rheingold warns us, \"he may come in the form of a grocery clerk.\"Visionary, cautionary, hopeful, exciting - The Virtual Community is a must-read for anyone hoping to understand the next wave of human culture as it moves on-line.",
        "Category": " Language Arts & Disciplines , Communication Studies",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Jane Fonda's Workout Book",
        "Authors": "By Fonda, Jane",
        "Description": "Describes Jane Fonda's philosophy of well-being, and includes her fitness program, which is designed to burn calories, improve body shape, and increase stamina and flexibility",
        "Category": " Health & Fitness , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1981"
        }
    },
    {
        "Title": "Quadrangle Considerations",
        "Authors": "By Byron, William J.",
        "Description": "",
        "Category": " Education , Higher",
        "Publisher": "Loyola Pr",
        "Price Starting With ($)": "6.82",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "A Stranger in My House: Jews and Arabs in the West Bank",
        "Authors": "By Reich, Walter",
        "Description": "Traces the history of the West Bank region, describes its importance to both the Palestinians and the Israelis, and assesses the chances for a peaceful solution",
        "Category": " Social Science , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "Thrilling legends of Virginia",
        "Authors": "By Robert F Nelson",
        "Description": "",
        "Category": "",
        "Publisher": "Robert Nelson",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Treatment for children: The Work of a Child Guidance Clinic",
        "Authors": "By David Maclay",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Rowman & Littlefield Publishers",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1977"
        }
    },
    {
        "Title": "The Ma Cuisine Cooking School Cookbook",
        "Authors": "By Lloyd, Linda",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Teachings Around the Sacred Wheel",
        "Authors": "By Andrews, Lynn V.",
        "Description": "For the first time millions of Lynn Andrews's readers can participate directly in a vision quest for enlightenment and personal power. Here the bestselling author of theMedicine Woman, Jaguar Woman, and Crystal Womantakes her readers on a journey around the sacred wheel and helps them tap their own Shamanic power. Based on her popular books and workshops, this powerful workbook facilitates shamanic initiation into the Dreamtime.Andrews provides helpful explanations and easy-to-follow visualization exercises for traveling the inner paths to the four points of the sacred wheel.Readers will discover their own special Power Animal, energize within a circle of crystals, seek self-knowledge through mirroring, and make a visionary mountain ascent. Exercises unlock a unique visualization process that blends controlled traveling in the Dreamtime with specific physical postures that help initiate \"a journey to discover one's own enlightenment and to help heal our mother earth.\"",
        "Category": " Self-help , Spiritual",
        "Publisher": "HarperSanFrancisco",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Southwestern Indian Arts and Crafts",
        "Authors": "By Bahti, Tom",
        "Description": "",
        "Category": " Art , Reference",
        "Publisher": "Kc Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "There's Something in My Attic",
        "Authors": "By Mercer Mayer",
        "Description": "",
        "Category": "",
        "Publisher": "Dial Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Introduction to Artificial Intelligence (Addison-Wesley Series in Computer Science)",
        "Authors": "By Charniak, Eugene and McDermott, Drew",
        "Description": "",
        "Category": " Computers , General",
        "Publisher": "Addison Wesley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "Healing Outside the Margins: The Survivor's Guide to Integrative Cancer Care",
        "Authors": "By O'Toole, Carole and Hendricks, Carolyn B.",
        "Description": "In this book the author, a breast cancer survivor, tells other cancer patients about integrative healing and the use of complimentary therapies to combat cancer",
        "Category": " Health & Fitness , Diseases , Cancer",
        "Publisher": "LifeLine Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Top Secret Information The Government, Banks and Retailers Don't Want You to Know",
        "Authors": "By Frank W. Cawood and Associates (EDT)",
        "Description": "",
        "Category": " Self-help , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Vivir Bien Con Poca Grasa: Habilidad No Voluntad",
        "Authors": "By Robert K. Cooper",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale Press",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Field Guide to Photographing Gardens (Center for Nature Photography Series/Allen Rokach)",
        "Authors": "By Rokach, Allen and Millman, Anne",
        "Description": "",
        "Category": " Photography , Subjects & Themes , Plants & Animals",
        "Publisher": "Amphoto Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Spies: A Novel",
        "Authors": "By Frayn, Michael",
        "Description": "The National BestsellerThe sudden trace of a disturbing, forgotten aroma compels Stephen Wheatley to return to the site of a dimly remembered but troubling childhood summer in wartime London. As he pieces together his scattered memories, we are brought back to a quiet, suburban street where two boys--Keith and his sidekick, Stephen--are engaged in their own version of the war effort: spying on the neighbors, recording their movements, and ferreting out their secrets. But when Keith utters six shocking words, the boy's game of espionage takes a sinister and unintended turn, transforming a wife's simple errands and the ordinary rituals of family life into the elements of adult catastrophe.Childhood and innocence, secrecy, lies and repressed violence are all gently laid bare as once again Michael Frayn powerfully demonstrates that what appears to be happening in front of our eyes often turns out to be something we cannot see at all.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    }
]