[
    {
        "Title": "America and Western Europe: Problems and prospects (Studies of the Research Institute of the German Society for Foreign Affairs, Bonn)",
        "Authors": "By Kaiser, Karl (EDT) and Schwartz, Hans Peter (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Lexington Books",
        "Price Starting With ($)": "5.87",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "American Revolutionaries in the Making",
        "Authors": "By Sydnor, Charles S.",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1965"
        }
    },
    {
        "Title": "American Deserts (Planet Earth)",
        "Authors": "By Smithey, William K.",
        "Description": "",
        "Category": "",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "19.25",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Atlas of Descriptive Histology",
        "Authors": "By Ross, Michael H. and Reith, Edward J.",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Harpercollins College Div",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "101 practical ways to make money at home,",
        "Authors": "By Staff of Publisher",
        "Description": "",
        "Category": "",
        "Publisher": "Good Housekeeping Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The Earliest Relationship: Parents, Infants, And The Drama Of Early Attachment",
        "Authors": "By Brazelton, T. Berry and Cramer, Bertrand G.",
        "Description": "Examines parents' psychological images of their newborns during the first stages after birth, uniting the latest knowledge about infants and the tools of psychoanalysis",
        "Category": " Psychology , Developmental , Child",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "From Botany to Bouquets: Flowers in Northern Art",
        "Authors": "By Wheelock, Arthur K.",
        "Description": "",
        "Category": "",
        "Publisher": "Natl Gallery of Art",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Glorious Needlepoint: Extraordinary Stitchery Designs from the Author of Glorious Knits",
        "Authors": "By Fassett, Kaffe and Lovi, Steve",
        "Description": "This illustrated guide features twenty needlepoint projects for creating screens, pillows, lampshades, and wearable objects based on the use of vibrant color and complex patterns as found in nature, art, and architecture",
        "Category": " Crafts & Hobbies , Needlework , Needlepoint",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "50 SIMPLE STEPS SAVE EARTH GLOBAL WARMING",
        "Authors": "By Green Patriot Working Group, Woolsey, R. James (FRW), and Steinman, David (INT)",
        "Description": "An entertaining, easy-to-follow guide explains how each individual can make a difference in preventing and alleviating the devastation of global warming, outlining a series of simple but effective steps that include recycling, reducing energy use, purchasing sustainable wood products, avoiding petroleum products and petrochemicals, and more. Original.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Freedom Press",
        "Price Starting With ($)": "36.61",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Royal Diaries: Marie Antoinette, Princess of Versailles, Austria-France, 1769 (The Royal Diaries)",
        "Authors": "By Lasky, Kathryn",
        "Description": "In 1769, thirteen-year-old Maria Antonia Josepha Johanna, daughter of Empress Maria Theresa, begins a journal chronicling her life at the Austrian court and her preparations for her future role as queen of France. Includes information about the history of the period, a family tree, and contemporary portraits.In 1769, thirteen-year-old Maria Antonia Josepha Johanna, daughter of Empress Maria Theresa, begins a journal chronicling her life at the Austrian court and her preparations for her future role as queen of France.",
        "Category": " Juvenile Fiction , Royalty",
        "Publisher": "Scholastic Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Damron City Guide",
        "Authors": "By Gatta, Gina M. (EDT), O'Connor, Erika (EDT), Philips, Ian (EDT), and Pratt, Kathleen (CON)",
        "Description": "",
        "Category": " Travel , General",
        "Publisher": "Damron Guides",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "American Kennel Club Dog Care and Training",
        "Authors": "By American Kennel Club",
        "Description": "American Kennel Club Dog Care and Training Sharing life with a dog is one of life's greatest pleasures. For the first-time owner?in fact, for every dog owner?the experience should be a long and memorable voyage of happy discovery. As with any learning experience, you must have the proper knowledge and skills to successfully choose and raise your new friend. That's exactly what the experts at the American Kennel Club had in mind when they created this book. Here?packed with great photographs of purebred dogs?is everything you need to know before and after you bring your new pet home. From selecting the right dog to keeping it healthy (as well as looking terrific), American Kennel Club Dog Care and Training is the one dog book you'll always be glad to have close at hand. A Howell Dog Book of Distinction",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Andrew Jackson Symbol for an Age",
        "Authors": "By Wrad, John William",
        "Description": "",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "Weber's Art of the Grill: Recipes for Outdoor Living",
        "Authors": "By Turner, Tim (PHT), Purviance, Jamie, and Kempster, Mike (INT)",
        "Description": "The art of grilling means so much more than burgers around the picnic table. Whether using charcoal kettle barbecues or gleaming top-of-the-line backyard kitchens, today's grill lovers can create a fantastic range of sophisticated dishes. Folks are firing up the barbecue more often than ever these days, and no one understands the lure of the flame like the people at Weber, the preeminent maker of home grills. Their delightful cookbook brings grilling to a whole new level. It starts off with techniques, tricks, and tools of the trade; includes basic sauces, bastes, rubs, and marinades; and continues with more than 100 fabulous recipes for everything from your classic burger and perfect steak to succulent garlic-mint chicken, spicy swordfish, and vegetarian entrees with a smoky accent. And to quench an outdoor thirst, there are ideas for the right wine or microbrew to serve with them. Also included are tips for entertaining with sizzle and menu suggestions for both casual and celebratory occasions. Full of festive and luscious photographs, Webers Art of the Grill is a year-round treat for any backyard chef.",
        "Category": " Cooking , Methods , Outdoor",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Evening News: A Novel",
        "Authors": "By Swick, Marly A.",
        "Description": "It must seem odd to him how you got punished for the minor infractions. A \"time out\" for talking back. No Popsicle for coming home late. But for the major crimes, there was no punishment. How much \"time out\" for shooting your little sister?Giselle thought she finally had it all together. She'd escaped from the Midwest to temperate southern California with her young son, Teddy. She'd married Dan Trias, the impassioned professor of her Thursday evening composition class at Cal Tech. Dan seemed the perfect man for her: handsome literate, articulate. They had a baby - Trina - who bound the four of them together. They had become a family, inviolable. Or so she'd thoughtWhen Trina and Teddy are involved in a terrible accident, fault lines immediately appear, revealing them as a family divided. Dan's ability to communicate collapses in the face of the crisis, and Giselle finds herself pulled between her grieving husband and her shocked son. And as she struggles to piece her family back together, Giselle has to teach herself the hardest lesson a mother can learn: how to forgive your child the unforgivable.",
        "Category": " Fiction , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "The Dean's List",
        "Authors": "By Hassler, Jon",
        "Description": "The New York Times Book Review called Jon Hassler's last novel, Rookery Blues, \"one of his finest and funniest novels.\" Now, Hassler brings back the delightful hero from that novel. He's older, not necessarily wiser, and still fumbling with love and life amid the strange campus doings of the 1990s.Leland Edwards, a piano-playing, fly-fishing English professor, has become Dean of Rookery State College. And since the president of the college has been on automatic pilot for the last thirty years, it falls to Leland to save his beloved campus from diminished enrollment, hockey thuggery, and its ignoble associations with Paul Bunyan.Then his old pal from the Icejam Quartet, Peggy Benoit Connor, drops a fund-raising plum in his lap. The most famous poet in America, Richard Falcon, has agreed to come to Rookery. Leland envisions thousands coming from all over the Midwest to hear Falcon's reading--an event that will put Rookery State on the literary map.But when he arrives, the poet is both more and  less than what Leland expected. Their relationship leads Leland back to memories of the father he lost when he was fourteen--and on a wild ride that will compel him to harbor a fugitive, stand up to his domineering mother, and finally make peace with his brief attempt at love and the tragedy that ensued. Like old friends past and present, Leland and his cronies come alive to amuse, provoke, and ultimately surprise us with their touching, complicated humanity. Once again, Jon Hassler has written a novel that shows that is he one of the most gifted authors working today.",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "F. A. O. Schwarz Toys through the Years",
        "Authors": "By Marvin Schwartz",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Congress: Process and policy",
        "Authors": "By Ripley, Randall B.",
        "Description": "",
        "Category": "",
        "Publisher": "WW Norton & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Baseball Lives",
        "Authors": "By Bryan, Mike",
        "Description": "",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Ghost Woman: A Novel",
        "Authors": "By Thornton, Lawrence",
        "Description": "Converted to Catholicism by a well-meaning priest, native American woman Soledad settles into a white community in Santa Barbara, California, in the 1800s and encounters friendship and betrayal. 15,000 first printing. Tour.",
        "Category": " Fiction , Literary",
        "Publisher": "Ticknor & Fields",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Conservation Alternative",
        "Authors": "By Dasmann, Raymond Frederick",
        "Description": "",
        "Category": "",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1975"
        }
    },
    {
        "Title": "Dictionary of Historical Terms: Second Edition",
        "Authors": "By Jaffe, Susanne (EDT) and Cook, Chris",
        "Description": "Designed for students, speech writers, and history buffs, a compilation of more than two thousand entries, organized alphabetically, outlines the historical context of historical words, terms, and phrases, and identifies their language of origin.",
        "Category": " Reference , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Pearl Harbor : Ready To Read Level 3",
        "Authors": "By Krensky, Stephen and Day, Larry (ILT)",
        "Description": "Bringing a dramatic moment of World War II to vivid life, author Stephen Krensky answers questions about the historic importance of the military action at Pearl Harbor. Written in simple yet clear language, the book teaches readers about the political scene before and after the bombing of Pearl Harbor by the Japanese in December 1941, and how this event shaped our country's place in the world.",
        "Category": " Juvenile Nonfiction , Humor , General",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Headache Free: A Personalized Program to Stop Migraine, Cluster, Sinus, Tension, Menstrual, and Rebound Headaches",
        "Authors": "By Aher, Jackie (ILT), Cady, Roger K., and Farmer, Kathleen",
        "Description": "You Don't Have to Suffer From Headache PainHeadache is one of the most painful and disabling of common medical disorders. It is also one of the most treatable. Major advances in headache management offer new hope and help for chronic headache sufferers. Written by a leading headache specialist and a psychologist specializing in pain management, this comprehensive guide provides you with the latest, most up-to-date information on living headache free.-- How to pinpoint the type of headache you get, what triggers attacks, and how to end the pain-- How to eliminate hidden headache inducers at home and in the workplace-- How to identify common food allergies that can cause headaches-- How diet and exercise can help prevent recurrent headaches-- Five easy desk-side exercises to prevent tension headaches at the office-- The latest medical breakthroughs and biofeedback techniques-- A complete guide to headache medications and alternative treatments-- Plus: how to treat headache in children, when to seek medical help, and much more!",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "The Backpower Program",
        "Authors": "By Imrie, David and Barbuto, Lu",
        "Description": "Back problems affect more people over longer periods of time than any other physical condition—and they are unsurpassed for testing the patience of both doctors and sufferers. A revolutionary program—Back Power—has been created by an occupational health physician and a chiropractor. Together, Imrie and Barbuto challenge the notion of ``physician versus chiropractor,'' bringing an interdisciplinary approach to the problems associated with the diagnosis, treatment and management of back pain—with resounding success.",
        "Category": " Health & Fitness , Health Care Issues",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Home for the Holidays",
        "Authors": "By Lindsey, Johanna",
        "Description": "There is no other name more synonymous with romance -- there is no other talent as rich in warmth, wit, and bold sensuality than that of Johanna Lindsey, the unsurpassed Queen of historical romantic fiction. And now she shares a treasured gift of love with an enchanting winter's tale that sees two warring hearts warmed and delightfully joined in a season of giving.Home For the HolidaysFor the first time in her sheltered life, Larissa Ascot's wishes for a merry Christmas seem to be in peril. Her father is off to the Colonies on business, but is far overdue to be home. Thus Larissa is left to handle the rumors of her family's bankruptcy, panicked creditors pounding on her door, and eviction. On top of all that, she must now contend with her enigmatic would-be \"benefactor,\"  Vincent Everett, the Baron of Windsmoor. The charming and handsome rogue has offered to shelter Larissa, her little brother, and their few remaining servants in his own home, and Larissa has no choice but to accept his proposal -- unless she and her younger brother Thomas wish to wake up chin-deep in snow on Christmas morning.The baron would be the first to admit that it is more than the Yuletide spirit of good will that has inspired his generosity. From the moment he first set eyes on the enchanting Miss Ascot, he was bewitched. And now that she has taken up residence in his home as well as in his heart, he aches with wanting her -- a most unfortunate state of Airs, since the proud beauty obviously despises him...and since Vincent had previously sworn to seek a righteous vengeance on Larissa's family.But Christmas is a time of miracles, after all, when love, at the seasonal peak of its power, can triumph over all adversity. The more the lovely lady resists Vincent's considerable attractions, the hotter her desire for him grows. And in these magical days, something truly wondrous could occur -- as the spirit of forgiveness reaches down to touch two rival souls ... and shower Vincent and Larissa with precious gifts of tenderness and ecstasy unbound.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "1st to Die (Women's Murder Club)",
        "Authors": "By Patterson, James",
        "Description": "Four crime-solving friends face off against a killer in San Francisco in the Women's Murder Club novel that launched James Patterson's thrilling series.Each one holds a piece of the puzzle: Lindsay Boxer is a homicide inspector in the San Francisco Police Department, Claire Washburn is a medical examiner, Jill Bernhardt is an assistant D.A., and Cindy Thomas just started working the crime desk of the San Francisco Chronicle. But the usual procedures aren't bringing them any closer to stopping the killings. So these women form a Women's Murder Club to collaborate outside the box and pursue the case by sidestepping their bosses and giving each other a hand. The four women develop intense bonds as they pursue a killer whose crimes have stunned an entire city. Working together, they track down the most terrifying and unexpected killer they have ever encountered-before a shocking conclusion in which everything they knew turns out to be devastatingly wrong.Full of the breathtaking drama and unforgettable emotions for which James Patterson is famous, 1st to Die is the start of the #1 New York Times bestselling series of crime thrillers.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.74",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Sunflowers",
        "Authors": "By Rebecca Atwater Briccetti",
        "Description": "",
        "Category": " Gardening , Flowers , General",
        "Publisher": "Metro Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "The Lover of Gardens",
        "Authors": "By Harvey, Gail",
        "Description": "",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Bringing in the sheaves",
        "Authors": "By Ken and Janice Tate",
        "Description": "A collection of recollections about \"that old-time religion\": Churches we knew; Preachers we knew; Revivals, socials & goin' to meetin'; Saints, sinners & samaritans.",
        "Category": "",
        "Publisher": "House Of White Birches",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Complete Book of U.S. Presidents",
        "Authors": "By Degregorio, William A. and Dickerson, Connie Jo",
        "Description": "So completely updated, this edition will include brand new information about the life and election of the 1996 president—whoever that might be!—Take a factual look at each of our chief executives—their lives, loves, administrations, friends and foes, successes and failures. This totally comprehensive single-volume sourcebook is arranged in chronological order for easy reference and features a photographed portrait of each president.  43 photographs, 769 pages.",
        "Category": " History , United States , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Faithless",
        "Authors": "By Slaughter, Karin",
        "Description": "“Brilliant plotting, relentless suspense,” raved the Washington Post. “A new synonym for terror,” crowned the Detroit Free Press.  The critics agree: no one writes suspense like Karin Slaughter, whose thrillers featuring medical examiner Sara Linton and her ex-husband, police chief Jeffrey Tolliver, have propelled her to the top of bestseller lists the world over. Now Slaughter fuses her unmatched grasp of forensic science and a mastery of complex relationships in a riveting tale of faith, doubt, and murder.The victim was buried alive in the Georgia woods—then killed in a horrifying fashion. When Sara Linton and Jeffrey Tolliver stumble upon the body, both become consumed with finding out who killed the pretty, impeccably dressed young woman.  And for Sara and Jeffrey, a harrowing journey begins, one that will test their own turbulent relationship and draw dozens of lives into the case.Lena Adams is one of them. A Grant County detective for years, she has her own reasons for being drawn to this case and a fierce drive to see justice done.  For these three people, who have each seen the darkest side of human nature, the body of the murdered girl is but the first in a series of shocking and sordid revelations.Now, as Jeffrey and Sara narrow the field of suspects, they must confront their own doubts and indiscretions, while Lena Adams sees herself reflected in the frightened eyes of a battered woman who may be the key figure in the case. As Faithless builds to a stunning and unforgettable climax, Karin Slaughter masterfully brings together strands of interlocking lives, family secrets, and hidden passions with one astounding truth: the identity of a killer who is more evil and dangerous than anyone could have guessed.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "The Rescue",
        "Authors": "By Sparks, Nicholas",
        "Description": "Reluctant to take chances in the world of romance, volunteer firefighter Taylor McAden experiences a dramatic change in heart after a near-fatal automobile accident leads to a fateful encounter with Denise Holden, a single mother who has just moved to the small town of Edenton, North Carolina, to build a new life for herself. 1,000,000 first printing.",
        "Category": " Fiction , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "No Way to Treat a First Lady: A Novel",
        "Authors": "By Buckley, Christopher",
        "Description": "A New York Times Notable Book of the YearElizabeth Tyler MacMann, the ambitious First Lady of the United States (and known in the tabloids as “Lady Bethmac”), is on trial for the death of her philandering husband, and the only man who can save her is the boyfriend she jilted in law school—now the most shameless defense attorney in America. Published to rave reviews, No Way to Treat a First Lady is a hilariously warped love story for our time set in the funniest place in America: Washington, D.C.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Assateague: Island of Wild Ponies",
        "Authors": "By Points, Larry and Jauck, Andrea",
        "Description": "Describes the life and natural environment of the pony breed that lives on the long barrier island off the Maryland and Virginia coasts",
        "Category": " Juvenile Nonfiction , Animals , Horses",
        "Publisher": "Park Partners, Inc and Sierra Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Butterfly Alphabet Book (Jerry Pallotta's Alphabet Books)",
        "Authors": "By Pallotta, Jerry, Cassie, Brian, and Astrella, Mark (ILT)",
        "Description": "Welcome to the wonder and beauty of butterflies! Look through the wings of a Transparent, marvel at the size of the Queen Alexandra Birdwing, and try to find the camouflaged Indian Leaf Butterfly! Learn about these amazing butterflies, and more, as you read from A to Z about a group of the world's most beautiful insects. Jerry Pallotta and Brian Cassie's fun, informative text, accompanied by Mark Astrella's detailed and breathtaking illustrations, will be a sure favorite with both the young butterfly lover and the experienced lepidopterist!",
        "Category": " Juvenile Nonfiction , Concepts , Alphabet",
        "Publisher": "Charlesbridge",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Mad Cowboy: Plain Truth from the Cattle Rancher Who Won't Eat Meat",
        "Authors": "By Lyman, Howard F. and Merzer, Glen",
        "Description": "When former cattle rancher Howard Lyman appeared on The Oprah Winfrey Show in 1996 to share his insider view of the danger of Mad Cow Disease spreading to this country, his revelations about the beef industry prompted a group of Texas cattlemen to file a lawsuit charging Lyman and the talk show host with \"food disparagement.\" That wasn't enough to silence Howard Lyman, and in this stirring account of his journey from meat-loving cowboy to vegetarian environmental activist, he tells the whole truth about the catastrophic consequences of an animal-based diet.  Lyman is well aware of what goes into our livestock -- high doses of pesticides, growth hormone, and the ground-up remains of other animals. A fourth-generation Montana farmer, he regularly doused his cattle and soil with chemicals. It was only when he narrowly escaped paralysis from a spinal tumor that Lyman began to question his vocation and the effect it was having on people and on the land he loved. The questions he raised and the answers he found led him, surprisingly, to adopt a vegetarian diet. As a result, he lost 130 pounds and lowered his cholesterol by more than 150 points. He is now one of America's leading spokesmen for vegetarianism.  Along the way, Lyman learned even more about the alarming dangers associated with eating meat. Here he blasts through the propaganda of the beef and dairy industries (and the government agencies that often protect them) and exposes an animal-based diet as the primary cause of cancer, heart disease, and obesity in this country. In a powerful and original voice, he warns that our livestock industry has repeated the mistakes that led to Mad Cow Disease in England while it simultaneously visits frightful, lasting damage on our environment.  Persuasive, straightforward, and full of the down-home good humor and optimism of a son of the soil, Mad Cowboy is both an inspirational story of personal transformation and a convincing call to action for a plant-based diet -- for the good of the planet and the health of us all.",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Legal Briefs",
        "Authors": "By Shook, Michael D. and Meyer, Jeffrey D.",
        "Description": "For lawyers, law students, and anyone else who can't escape the long arm of the law, this entertaining volume includes hundreds of intriguing facts and anecdotes about a profession we all love to hate. Organized by topic, here are scores of brief entries, informative lists, witty quotations, and fascinating sidebars on every aspect of jurisprudence. From malpractice to Miranda, acquittal to voir dire, Legal Briefs is sure to amuse, instruct, and perhaps even alarm you about the state of the legal profession today.",
        "Category": " Business & Economics , Industries , Hospitality, Travel & Tourism",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The Last Noel",
        "Authors": "By Malone, Michael",
        "Description": "Award-winning author Michael Malone's The Last Noel is a beautiful gift to American fiction. In a deeply touching tale, The Last Noel captures the exuberance and poignance of a lasting friendship between a man and a woman from very different backgrounds. Noni Tilden and Kaye King grow up and grow close as their lives come dramatically together through four decades of tumultuous change in a small southern town. The story begins in 1963 when Kaye first meets Noni on the eve of their seventh birthdays. On that Christmas Eve, Kaye climbs through her bedroom window to invite her to come sledding with him in a rare southern snowfall. Over the next thirty years on twelve days of Christmas, they meet to share the passion, the sacrifice and the romance of a lifetime. At once exquisitely written and tearfully joyful, The Last Noel is one of the great love stories of our time.A Book Sense 76 Top 10 Selection\"Malone's latest novel reaffirms his brilliance in crafting carefully plotted fiction with a literary burnish, most often through Southern manners and intrigue.\"-Denver Post\"A warm, engaging love story.\"-Booklist\"Malone writes with such quiet authority and clear understanding of the world his characters inhabit that the story strikes deep emotional chords.\"-Washington Post Book World",
        "Category": " Fiction , Literary",
        "Publisher": "Sourcebooks Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Best-Loved Art From American Museums",
        "Authors": "By Failing, Patricia",
        "Description": "A collection of the best-loved works of art in fifty-seven museums throughout the U.S. and Canada includes reproductions of works by such masters as Rembrandt, Rubens, El Greco, and Goya, as well as modern artists as Matisse, Picasso, and Pollack",
        "Category": "",
        "Publisher": "Clarkson N Potter, Inc.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Asia Rising: Why America Will Prosper as Asia's Economies Boom",
        "Authors": "By Rohwer, Jim",
        "Description": "Makes the argument that Asia's growing economies will offer terrific opportunities for American businesses and that America should follow the lead of Asia's small anti-welfare governments and free-market economies. Reprint. 15,000 first printing.",
        "Category": " Business & Economics , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "From Parnassus: Essays in Honour of Jacques Barzun (A Cass Canfield Book)",
        "Authors": "By Weiner, Dora B.",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row Publishers",
        "Price Starting With ($)": "6.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Cecilia Bartoli: The Passion of Song",
        "Authors": "By Chernin, Kim and Stendhal, Renate",
        "Description": "A portrait of the Grammy Award-winning opera singer explores the reasons behind her success, the people who have surrounded her career, and her personal life. $25,000 ad/promo. Tour.",
        "Category": " Music , Genres & Styles , Opera",
        "Publisher": "Pub Overstock Unlimited Inc",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Demian: The Story of Emil Sinclair's Youth",
        "Authors": "By Hesse, Hermann, Roloff, Michael, and Lebeck, Michael",
        "Description": "A friend's mother, war, and newly discovered self-respect draw a young man toward his psychological awakening",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "By Jove!: Brush Up Your Mythology",
        "Authors": "By MacRone, Michael and Lulevitch, Tom (ILT)",
        "Description": "Do you know why we call a book of maps an \"atlas\"? Or why you don't ever want to be \"tantalized\" again? And would you still avoid that sticky almond candy \"ambrosia\" if you knew it could make you immortal?You'll cry \"By Jove!\" when you discover the answers to these and other questions in this follow-up volume to Michael Macrone's Brush Up Your Shakespeare! and It's Greek to Me! Both an entertaining handbook to classical mythology and a revealing catalogue of divinely inspired word origins, By Jove! recounts great stories in a fresh, new way, offering concise synopses while exploring the odd twists these tales have taken during the ages. As you make your way through the magical places of myth, you'll meet all the major gods and goddesses, heroes and heroines, and beasts and monsters who have lent their names to our language, and their stories to our tradition.By Jove! will pique your imagination and supply you with a store of fascinating details to impress friends and nemeses alike - including the tale of the original \"nemesis.\" You'll discover which goddess lent her name to money, why you don't want to lie on a \"Procrustean bed,\" and why the mythical Adonis was no muscle-bound he-man. And if someone pops you a \"trivia\" question on classical mythology, you will be sure to find the answer in this illuminating \"cornucopia\" - including the interesting origins of \"trivia\" itself.Whether you love mythology, language, or both, you will find By Jove! indispensable. And if you didn't know how amusing myths and words could be, this book will acquaint you with their pleasures.",
        "Category": " Literary Criticism , Reference",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Genealogy Online",
        "Authors": "By Crowe, Elizabeth Powell and Mann, Bill",
        "Description": "A guide to using the America Online service and the Internet for genealogical research on a computer.  Explains how to use the golden gate genealogy forum on AOL, mailing lists, newsgroups, the World Wide Web, search engines, and library card catalogs as resources to find family roots. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Reference , Genealogy & Heraldry",
        "Publisher": "Computing McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "All-Bright Court",
        "Authors": "By Porter, Connie",
        "Description": "A compelling first novel covering two decades in the lives of the Taylor family and  their neighbors in an African-American working class  neighborhood in Buffalo, NY. In a clear, quiet but powerful prose, the author draws the gaudily painted, rundown bungalows of All-Bright Court and peoples it convincingly.",
        "Category": " Fiction , Sagas",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "25 Myths You've Got to Avoid If You Want to Manage Your Money Right : The New Rules for Financial Success",
        "Authors": "By Clements, Jonathan",
        "Description": "A cheerful guide to investing debunks common money myths, explores the flaws in some of today's popular money strategies, and offers advice and unconventional tips designed to help readers make the most of their investment dollar. 30,000 first printing.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Earthwatch, a Survey of the World from Space",
        "Authors": "By Sheffield, Charles",
        "Description": "Contains photographs of the earth's surface transmitted from the orbiting Landsat satellite",
        "Category": " Science , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1981"
        }
    },
    {
        "Title": "Gastrointestinal Health: A Self-Help Nutritional Program to Prevent, Cure, or Alleviate Irritable Bowel Syndrome, Ulcers, Heartburn, Gas, Constipation & Many Other Digestive, Revised Edition",
        "Authors": "By Peikin, Steven R.",
        "Description": "Do you suffer from heartburn?  Is an ulcer bothering you?  Are the difficult symptoms of irritable bowel syndrome compromising your life?  If so, you are not alone.  One in three Americans has some sort of digestive problem.  After the common cold, gastrointestinal complaints are the biggest cause of employee absenteeism in the United States.  And since GI disorders are so often interrelated, many people who have them suffer from two or more at the same time. Here, in a completely revised and updated edition, is everything you need to know to find fast relief from a wide range of gastrointestinal difficulties.  Whether it&#39;s constipation, diarrhea, gas, hemorrhoids, ulcers, heartburn, colitis, gallstones, or one of the many other digestive tract problems, Dr. Steven Peikin&#39;s self-help nutritional program will help keep you out of the doctor&#39;s office--and feeling great.Based on the latest research and his own clinical experience, Dr. Peikin prescribes a healthy diet high in fiber and low in fat, spices, lactose, and caffeine.  He provides a detailed list of \"flag foods\" to avoid in the case of specific problems and shows you how to use exercise, over-the-counter drugs, prescription drugs, and stress management to complement the program.  In this new edition, Dr. Peikin offers the latest information on the diagnosis and treatment of H. pylori, the bacterium that causes ulcers and stomach cancer; the newest remedies for severe heartburn; recommendations for avoiding colon cancer through screening and prevention; and a significantly expanded section on Inflammatory Bowel Disease. If you suffer from digestive problems, you know that gastrointestinal health can make all the difference in living comfortably from day to day.  Dr. Peikin&#39;s classic book can show you the way.",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Garden Tales",
        "Authors": "By Gottlieb, Jane (PHT)",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Studio",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Behind the Oscar: Secret History of the Academy Awards",
        "Authors": "By Holden, Anthony",
        "Description": "Simple hype? Is that really all there is behind the Oscar? Just a lot of propaganda, a frenzied ritual of self-promotion, a debasement of character and culture - and for what? A shiny statuette of a naked and featureless little man?Well, yes, maybe \"hype\" is a major part of the whole affair, but \"simple\"...? Not by a long shot.Every year, on the last Monday in March, the reigning royalty of the movie business dress up in their finest feathers - sometimes literally - to attend the ceremony sponsored by the Academy of Motion Picture Arts and Sciences. At that ceremony, years of struggle and study and sacrifice and hard work - capped by weeks of intense campaigning, awesome in-fighting, blatant self-aggrandizement, and shameless displays of naked desire - are rewarded. The Academy Awards!As Anthony Holden explains at the start of Behind the Oscar, his fascinating and devilish look at this perennial affair, \"However rich and famous movie stars may become, however admired and envied by audiences and colleagues alike, their cup will not actually run over until their name emerges from one of [the] envelopes, and they can sob their way through an Oscar acceptance speech. [The] winners will bask in the glow of apparent immortality - the highest honor even Hollywood can confer - as well a boosting their fantastical fees. For those already in possession of most that this world can offer, it is a consummation devoutly to be wished - and a wish they will go to any lengths to consummate.\"Historically, the Academy Awards, first presented in 1927, were an offshoot of an effort by the then-powerful Hollywood studios to defeat the unions that threatened to cut into their considerable profits. At first the Awards were self-congratulatory, back-slapping affairs, dinner parties at which actors and actresses who had kept their noses clean and whose movies had made money were rewarded for their work.Quickly, however, these annual rites assumed a life of their own, growing over the years to the self-congratulatory, back-slapping colossus that today fascinates millions and millions of people the world over.Behind the Oscar is the story of these awards and how they grew, and, in a way, it's the story of Hollywood itself. Spanning the entire history of the Awards (including the 1991 Academy Awards) and reviewing the famous winners and losers (e.g., Katharine Hepburn, Charlie Chaplin), and the not-so-famous people (Luise Rainer, winner of back-to-back Oscars for Best Actress) whose lives have been touched by Oscar magic, Anthony Holden cleverly guides the reader through the ins and outs, the complex, confounding machinations that make up Oscar's history.Complete with a multitude of award lists, dozens of photos, and enough behind-the-scenes gossip to satisfy even the most jaded, Behind the Oscar is the best written, most enlightening, and easily the most entertaining look ever at Hollywood at its best and worst.To paraphrase Sally Field upon winning her second Oscar: \"You'll like it, you'll really like it!\"",
        "Category": " Performing Arts , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Cognition: An Introduction",
        "Authors": "By Posner, Michael I.",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Scott Foresman & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1973"
        }
    },
    {
        "Title": "The Good Society",
        "Authors": "By Bellah, Robert N. and Madsen, Richard (CON)",
        "Description": "The authors show how readers can better understand social institutions--families, schools, corporations, religious groups, and so on--taking responsibility within and for them and transforming them",
        "Category": " Social Science , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Best of Gourmet 1992 Edition",
        "Authors": "By Gourmet Magazine Editors",
        "Description": "An anthology culled from issues of Gourmet magazine features menu plans for intimate and formal entertaining, and recipes for hors d'oeuvres, breads, soups, main dishes, side dishes, sauces, and desserts, as well as special presentations on the foods of specific areas",
        "Category": " Cooking , Methods , Gourmet",
        "Publisher": "Random House",
        "Price Starting With ($)": "7.46",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Dark Lady",
        "Authors": "By Patterson, Richard North",
        "Description": "In Dark Lady, Richard North Patterson displays the mastery of setting, psychology, and story that makes him unique among writers of suspense, and one of today's most original and enthralling novelists.In Steelton, a struggling Midwestern city on the cusp of an economic turnaround, two prominent men are found dead within days of each other. One is Tommy Fielding, a senior officer of the company building a new baseball stadium, the city's hope for the future. The other is Jack Novak, the local drug dealers' attorney of choice. Fielding's death with a prostitute, from an overdose of heroin, seems accidental; Novak is apparently the victim of a ritual murder. But in each case the character of the dead man seems contradicted by the particulars of his death. Coincidence or connection?The question falls to Assistant County Prosecutor Stella Marz. Despite a traumatic breach with her alcoholic and embittered father, she has risen from a working-class background to become head of the prosecutor's homicide unit. A driven woman, she is called the Dark Lady by defense lawyers for her relentless, sometimes ruthless, style: in seven years only one case has gotten away from her, and only because the defendant took his own life. She has earned every inch of both her official and her off-the-record titles, and recently she's decided to go after another: to become the first woman elected Prosecutor of Erie County. But that was before the brutal murder of her ex-lover--Jack Novak.Novak's death leads her into a labyrinth where her personal and professional lives become dangerously intertwined. There is the possibility that Novak fixed drug cases for the city's crime lord, Vincent Moro, with the help of law enforcement personnel, and perhaps with someone in Stella's own office . . . the bitter mayoral race which threatens to undermine her own ambitions . . . her attraction to a colleague who may not be what he seems . . . the lingering, complicated effects of her painful affair with Novak . . . the growing certainty that she is being watched and followed. Making her way through a maze of corruption, deceit, and greed, trusting no one, Stella comes to believe that the search for the truth involves the bleak history of Steelton itself--a history that now endangers her future, and perhaps her life.For his uncanny dialogue, subtle delineation of character, and hypnotic narrative, critics have compared Richard North Patterson to John O'Hara and Dashiell Hammett. Now, in the character of the Dark Lady, he has created a woman as fascinating as her world is haunting. Dark Lady is his signature work.",
        "Category": " Fiction , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Women of Sand and Myrrh",
        "Authors": "By Al-Shaykh, Hanan and Cobham, Catherine (TRN)",
        "Description": "In an unnamed Arab country, four women--Suha, who has a management degree; Tamr, who went on a hunger strike to learn to read; Suzanne, who pretends to commit suicide; and Nur, who sneaks out dressed as a man--try to survive in a society where the one thing they can never have is freedom",
        "Category": " Fiction , Literary",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Women Who Kill",
        "Authors": "By Jones, Ann",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Fawcett Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1981"
        }
    },
    {
        "Title": "The Random House Book of Perfect Plants",
        "Authors": "By Phillips, Roger and Rix, Martyn",
        "Description": "Part of the bestselling Random House Book of . . . gardening series, this volume also stands alone as a necessary handbook for any gardener, novice or experienced. More than 1,500 of the easiest-to-growt trees, shrubs, roses, perennials, annuals, and bulbs are profiled, with tips on planting, feeding, propagating, transplanting, and more. 1,500+ color photos. Size D. 320 pp. 25,000 print.",
        "Category": " Gardening , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Complete Guide to Flower Gardening (Better Homes & Gardens)",
        "Authors": "By Roth, Susan A.",
        "Description": "Complete information on planning, designing, planting and caring for flower gardens.Offers garden plans for country, traditional, and naturalistic gardens adaptable to any location and color scheme.More than 700 lush color photos and illustrations offer both inspiration and instruction.Encyclopedia features more than 450 species of flowers, ornamental grasses, and ferns.Profiles flower gardeners from across the country who share their secrets for success.Includes a handy list of mail-order nurseries, plus frost date and hardiness zone maps.",
        "Category": " Gardening , Flowers , General",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Random House Book of Perennials, Vol. 1: Early Perennials",
        "Authors": "By Phillips, Roger and Rix, Martyn",
        "Description": "These 2 handbooks--organized by seasonal flowering periods--feature over 3,000 color photos, as well as practical advice on selection, planting and cultivation. Some 5,000 of the world's favorite flowering plants are depicted.",
        "Category": " Gardening , Flowers , Perennials",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Rock Gardening (Burpee American Gardening Series)",
        "Authors": "By Cresson, Charles O.",
        "Description": "Reveals the secrets to getting the most out of the harsh conditions and small spaces for which rock gardens are ideal, discussing the selection, growing, and maintenance of plants, choosing and moving stone, and common problems for rock gardeners. Original.",
        "Category": " Reference , General",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Shrubs and Hedges",
        "Authors": "By Sinnes, A. Cort and McKinley, Michael",
        "Description": "Describes a variety of evergreen and flowering shrubs, offers tips on pruning and caring for hedges, and explains how to select shrubs for specific uses and locations",
        "Category": " Gardening , Shrubs",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Trees and Shrubs",
        "Authors": "By Fell, Derek and Frain, Joan (ILT)",
        "Description": "Describes the care requirements, characteristics, and uses of more than two hundred ornamental trees and shrubs, and gives advice on layering, grafting, pruning, planting, and landscaping",
        "Category": " Gardening , General",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Bulbs (The Time-Life gardener's guide)",
        "Authors": "By Time-Life Books",
        "Description": "Tells how to select and plant bulbs, discusses forcing, and describes the characteristics and care requirements of a variety of popular bulbs",
        "Category": "",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Naked Republicans: A Full-frontal Exposure of Right-wing Hypocrisy and Greed",
        "Authors": "By Lewis, Shelley",
        "Description": "“Shelley Lewis figured out a way to make me laugh out loud at adultery, corruption, bribery, prevarication, hypocrisy, pumpkin shooting, race baiting, insanity, cat murder, and filthy, groping old men. Naked Republicans is an instruction manual for the things you can get away with and still keep your job in Washington, D.C.”——Rachel Maddow, Air America RadioNaked Republicans is the exposé you’ve been waiting for. From Cheney to Condi, from DeLay to the Dukester, from Newt to Rummy, these are the weasels, wackos, and wingnuts who turned the party of Lincoln into a five-kegger blowout. For the first time, in one hilarious roundup, Shelley Lewis reveals the naked truth about the fiscal conservatives who spend money like they print it themselves (oh, right–they do); the pious pols who regard the institution of marriage so highly they’ve moved on to their second and third wives; and the deceitful dissemblers who’ve earned a place in the Hall of Shame. In these troubled times, when you don’t know whether to laugh or cry, Naked Republians puts the hip back in hypocrisy and restores the fun to fundamentalism! “If you crave a hilarious exposé of the weasels who need to be sent home from Washington, you need to buy this book!”——Katrina vanden Heuvel, editor and publisher, The Nation BACK",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Color With Annuals/05405 (Ortho Library)",
        "Authors": "By Ferguson, Barbara, Stremple, Barbara Ferguson (EDT), McKinley, Michael D. (EDT), Sinnes, A. Cort (EDT), and Clark-Huegel, Cyndie (EDT)",
        "Description": "Describes more than fifty of the most popular annuals, explains how to plan the use of color in the garden, and includes tips on growing annuals",
        "Category": " Gardening , Flowers , Annuals",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "The Word Detective: Solving the Mysteries Behind Those Pesky Words and Phrases",
        "Authors": "By Morris, Evan",
        "Description": "The \"Word Detective\" searches out clues to the origin of interesting words and phrases, such as Big Apple, moxie, yahoo, gormless, feed a cold, and many others, in a collection of articles from the syndicated \"Word Detective\" column. Reprint.",
        "Category": " Reference , Curiosities & Wonders",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Crime Brulee (Culinary Food Writer)",
        "Authors": "By Fairbanks, Nancy",
        "Description": "Forty-something homemaker Carolyn Blue is through with cooking and cleaning. She’s finally decided to throw in the dishtowel—and take on a dream job as food writer. Now her plate is filled with exotic locales, delectable foods, and even a dash of crime—to taste. She could very well get used to this.It was a perfect arrangement. Carolyn had already planned to accompany her husband to an academic conference in New Orleans—an event that meant visiting old college pals. So why not use the opportunity to write a story about Cajun cuisine? But just as she gets a taste of Creole, she gets a bite of crime…Her friend Julienne disappears at a dinner party. True, she had been fighting with her husband, but this only worries Carolyn more. Now, she has to put her taste-testing aside to search for answers—and the trail leads her right to an alligator swamp. Carolyn better act fast, because in these parts, it’s eat or be eaten…Includes over a dozen delicious Southern recipes!",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Doctors Book of Food Remedies: The Newest Discoveries in the Power of Food to Treat and Prevent Health Problems-From Aging and Diabetes to Ulcers",
        "Authors": "By Yeager, Selene",
        "Description": "",
        "Category": " Health & Fitness , Healing",
        "Publisher": "Rodale Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Rage (Alex Delaware)",
        "Authors": "By Kellerman, Jonathan",
        "Description": "In a host of consecutive bestsellers, Jonathan Kellerman has kept readers spellbound with the intense, psychologically acute adventures of Dr. Alex Delaware–and with excursions through the raw underside of L.A. and the coldest alleys of the criminal mind. Rage offers a powerful new case in point, as Delaware and LAPD homicide detective Milo Sturgis revisit a horrifying crime from the past that has taken on shocking and deadly new dimensions. Troy Turner and Rand Duchay were barely teenagers when they kidnapped and murdered a younger child. Troy, a remorseless sociopath, died violently behind bars. But the hulking, slow-witted Rand managed to survive his stretch. Now, at age twenty-one, he’s emerged a haunted, rootless young man with a pressing need: to talk–once again–with psychologist Alex Delaware. But the young killer comes to a brutal end, that conversation never takes place. Has karma caught up with Rand? Or has someone waited for eight patient years to dine on ice-cold revenge? Both seem strong possibilities to Sturgis, but Delaware’s suspicions run deeper . . . and darker. Because fear in the voice of the grownup Rand Duchay–and his eerie final words to Alex: “I’m not a bad person”–betray untold secrets. Buried revelations so horrendous, and so damning, they’re worth killing for.As Delaware and Sturgis retrace their steps through a grisly murder case that devastated a community, they discover a chilling legacy of madness, suicide, and multiple killings left in its wake–and even uglier truths waiting to be unearthed. And the nearer they come to understanding an unspeakable crime, the more harrowingly close they get to unmasking a monster hiding in plain sight.Rage finds Jonathan Kellerman in phenomenal form–orchestrating a relentlessly suspenseful, devilishly unpredictable plot to a finale as stunning and thought-provoking as it is satisfying.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Betrayed",
        "Authors": "By Hosp, David",
        "Description": "There are many terrible ways to die, but few die as terribly as Elizabeth Creay, a young mother and Washington Post reporter. Tortured in her Washington, D.C., townhouse, she didn't go out of this world easily. Now it's the job of Detective Jack Cassian and Sergeant Darius \"D\" Train to figure out who could have committed such a monstrous crime.Sydney Chapin, Elizabeth's younger sister, has a mission of her own. Returning to her wealthy, politically influential family from nine years of self-imposed exile, she is determined to discover the truth for herself, and willing to risk anything and everything to find the answers. Stunned and grieving, she is driven by the need to comprehend her sister's murder, but the more she learns the less she understands, as the elusive motive for the killing remains shrouded in mystery.Cassian and Train, too, suspect that the homicide has a dark, hidden dimension. But secrets are nothing new in the District, where the best and worst of humanity nestle side by side in marble halls and on rubble-strewn streets. Only after the personal lives of cops and victims become intertwined does the truth begin to emerge, and even the hardened detectives are unprepared to grasp the full horror behind Elizabeth's murder and a terrifying conspiracy with its roots in the arrogance of money, the burdens of power, and the secrets of ... the betrayed.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Great Masters (Library of great masters) by Vasari, Giorgio (1986) Hardcover",
        "Authors": "By Vasari, Giorgio",
        "Description": "",
        "Category": "",
        "Publisher": "Hugh Lauter Levin Associates",
        "Price Starting With ($)": "6.5",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "False Impression",
        "Authors": "By Archer, Jeffrey",
        "Description": "Why was an elegant lady brutally murdered the night before 9/11?  Why was a successful New York banker not surprised to receive a woman's left ear in the morning mail? Why did a top Manhattan lawyer work only for one client, but never charge a fee? Why did a young woman with a bright career steal a priceless Van Gogh painting? Why was an Olympic gymnast paid a million dollars an assignment when she didn't have a bank account?  Why was an honors graduate working as a temporary secretary after inheriting a fortune?  Why was an English Countess ready to kill the banker, the lawyer and the gymnast even if it meant spending the rest of her life in jail?  Why was a Japanese steel magnate happy to hand over $50,000,000 to a woman he had only met once?   Why was a senior FBI agent trying to work out the connection between these eight apparently innocent individuals?  All these questions are answered in Jeffrey Archer's latest novel, False Impression, but not before a breathtaking journey of twists and turns that will take readers from New York to London to Bucharest and on to Tokyo, and finally a sleepy English village, where the mystery of Van Gogh's last painting will finally be resolved.  And only then will readers discover that Van Gogh's Self-portrait with Bandaged Ear has a secret of its own that acts as the final twist in this unforgettable yarn.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Zero-Sum Society: Distribution and the Possibilities for Economic Change",
        "Authors": "By Thurow, Lester C.",
        "Description": "Argues that the only solution to U.S. economic stagnation is the redistribution of income through federal work programs, income tax reform, and repeal of antitrust laws",
        "Category": " Business & Economics , General",
        "Publisher": "Viking Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1981"
        }
    },
    {
        "Title": "The book of our founding fathers",
        "Authors": "By Wilson, Vincent",
        "Description": "",
        "Category": "",
        "Publisher": "American History Research Associates",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Empire of Time",
        "Authors": "By Kilian, Crawford",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine, 1978",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Bitches and Abdicators",
        "Authors": "By Scalia, Toni",
        "Description": "For women who are juggling work, love, and parenting--but feel that little has changed in their lives as women--this book offers a behavioral approach to solving the problems still facing post-liberation women",
        "Category": " Social Science , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "The Executive's Guide to Supply Management Strategies: Building Supply Chain Thinking Into All Business Processes",
        "Authors": "By Riggs, David A. and Robbins, Sharon L.",
        "Description": "Uses examples drawn from the authors' experiences at General Electric, RCA, Scott Paper, Gillette, and other companies to demonstrate the competitive advantages of astute supply side management. Emphasizes a three tiered process to procurement procedure consisting of a market and evaluation process to determine best suppliers, meet the company's cost objectives and consolidate the supply base; identification of opportunities for optimizing materials and service flow and usage; and determining how changes in process, product, or technology can provide competitive advantages. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Business & Economics , Purchasing & Buying",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Betty Crocker's Eat and Lose Weight",
        "Authors": "By Crocker, Betty",
        "Description": "This nutritionally sound weight loss program includes one month of 1,200-calories-a-day menus, a personal workbook enabling dieters to make a weight-loss commitment and track their progress, and a five-point program designed to incorporate healthy habits",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Fishbait: The Memoirs of the Congressional Doorkeeper",
        "Authors": "By Miller, William",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "July",
            "Year": "2012"
        }
    },
    {
        "Title": "Greenwich",
        "Authors": "By Fast, Howard",
        "Description": "In the comfortable confines of Greenwich, Connecticut, live some of the wealthiest and most sophisticated Americans. When eight of them sit down to dinner at the home of Richard Castle, a story of deception, infidelity, and murder unfolds, powered by a richly intriguing cast of characters.Castle, former Assistant Secretary for Latin American Affairs, permitted, if not directed, the murder of three Catholic nuns and a lay worker in El Salvador in 1980. Now, State Department complicity in these murders has become public knowledge, and Castle may well be called before Congress to testify. While he cannot be certain that his former colleagues intend to silence him, he knows how they do business. And he knows how silence is ensured.Against the background of Castle's deeply secret drama, the stories of the other seven guests - Castle's wife, a Catholic priest, a nun, a linguistics professor and his wife, a successful novelist, and a woman who may be having an affair with Castle - become a portrait of arrogance and innocence, brutality and compassion in America today.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Big Bird's Color Game (Golden Sturdy Shape Book / Sesame Street)",
        "Authors": "By Sesame Workshop (COR) and Cooke, Tom (EDT)",
        "Description": "Big Bird invites small children to play a guessing game with him as he asks youngsters to guess what different colored objects he is thinking of by studying the crucial clues he gives them",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "John Calvin: A Sixteenth-Century Portrait",
        "Authors": "By Bouwsma, William J.",
        "Description": "Historians have credited--or blamed--Calvinism for many developments in the modern world, including capitalism, modern science, secularization, democracy, individualism, and unitarianism. These same historians, however, have largely ignored John Calvin the man. When people consider him at all, they tend to view him as little more than the joyless tyrant of Geneva who created an abstract theology as forbidding as himself.This volume, written by the eminent historian William J. Bouwsma, who has devoted his career to exploring the larger patterns of early modern European history, seeks to redress these common misconceptions of Calvin by placing him back in the proper historical context of his time.Eloquently depicting Calvin's life as a French exile, a humanist in the tradition of Erasmus, and a man unusually sensitive to the complexities and contradictions of later Renaissance culture, Bouwsma reveals a surprisingly human, plausible, ecumenical, and often sympathetic Calvin. John Calvin offers a brilliant reassessment not only of Calvin but also of the Reformation and its relationship to the movements of the Renaissance.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Junie B., First Grader: Cheater Pants (Junie B. Jones, 21)",
        "Authors": "By Brunkus, Denise (ILT) and Park, Barbara",
        "Description": "Meet the World's Funniest First Grader—Junie B. Jones!With over 50 million books in print, Barbara Park's New York Times bestselling chapter book series, Junie B. Jones, is a classroom favorite and has been keeping kids laughing—and reading—for over 20 years! In the 21st Junie B. Jones book, Junie B. has all the answers when it comes to cheating. It's just plain wrong! But what about copying someone else's homework? That's not cheating, right? 'Cause homework isn't even a test! And speaking of tests . . . what if a friend shares an answer that you didn't even ask for? Sharing definitely isn't cheating . . . is it? Uh-oh. Maybe this cheating business is more complicated than Junie B. thought. Could she be a cheater pants and not even know it?USA TODAY:\"Junie B. is the darling of the young-reader set.\" Publisher's Weekly:\"Park convinces beginning readers that Junie B.—and reading—are lots of fun.\" Kirkus Reviews:\"Junie's swarms of young fans will continue to delight in her unique take on the world….A hilarious, first-rate read-aloud.\"Time Magazine:\"Junie B. Jones is a feisty six-year-old with an endearing penchant for honesty.\"",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "A Visit to William Blake's Inn: Poems for Innocent and Experienced Travelers",
        "Authors": "By Willard, Nancy, Provensen, Alice (ILT), and Provensen, Martin (ILT)",
        "Description": "Inspired by William Blake’s Songs of Innocence and Songs of Experience, this delightful collection of poetry for children brings to life Blake’s imaginary inn and its unusual guests.",
        "Category": " Juvenile Nonfiction , Poetry , General",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1982"
        }
    },
    {
        "Title": "Is That a Politician in Your Pocket: Washington on $2 Million a Day",
        "Authors": "By Sifry, Micah L. and Watzman, Nancy",
        "Description": "\"Get rich quick! Read this book and learn how to invest in politicians for fun and profit! Just don&#146;t leave this book where any regular voters can read it!\"&#150;Arianna Huffington, author of Pigs at the TroughEvery day corporations and other wealthy special interests pump another $2 million into the coffers of our elected officials in Washington and their party committees. For their money they get an estimated $160 billion a year in tax breaks, subsidies, and other sweet deals. That&#146;s $160 billion lifted from taxpayers&#146; pockets&#150;or about $1,500 per taxpayer per year! But that&#146;s not the worst of it. Their money also buys them the opportunity to shape public policy to suit their bottom lines. And the cost we pay for that is much dearer. Blending satirical bite with mountains of eye-opening research, this rollicking call to arms breaks the issue into manageable, kitchen-table topics and makes it accessible with graphs, tables, sidebars, quizzes, and fascinating factoids.\"Sifry and Watzman lay it all out with no bark on it in this devastatingly straight-forward book&#150;the overt corruption of our country through what we politely call &#145;the campaign finance system.&#146; Legalized bribery is the root of our political rot and few people know more about how to fix it and have done more to fix it than the good folks at Public Campaign.\"&#150;Molly Ivins, author of Bushwhacked\"Sifry and Watzman are two of the most astute observers of political influence in this country. Their important new book names names and cuts through the bull about the issues that affect our daily lives, in a wonderfully amusing but drop-dead accurate way!\"&#150;Charles Lewis, author of The Buying of the President 2004",
        "Category": " Political Science , American Government , Legislative Branch",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Effective Argument: A Writer's Guide With Readings",
        "Authors": "By Nicholas, J. Karl and Nicholl, James R.",
        "Description": "",
        "Category": "",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "9.05",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Basic Marketing: A Managerial Approach (Irwin Series in Marketing)",
        "Authors": "By E. Jerome McCarthy, William D. Perreault, Jr.",
        "Description": "",
        "Category": "",
        "Publisher": "Richard D. Irwin, Inc.",
        "Price Starting With ($)": "7.67",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Generous Lives: American Catholic Women Today",
        "Authors": "By Redmont, Jane",
        "Description": "Women are the heart and soul of the Catholic church, passing on its faith and traditions to the next generation. But an exclusively male hierarchy voices official teaching on faith and the moral life, and excludes from the ordained ministry the women who dedicate so much of their lives to the Church. More and more American Catholic women are choosing to leave the Church, yet most of them stay. Why? What does it mean to these women to be Catholic? To be women? To be American? In Generous Lives, Jane Redmont has gone beyond theories and taken these questions directly to the women in the street, creating a realistic and fascinating portrait of the female half of a living religion.Redmont interviewed more than a hundred American women between the ages of seventeen and ninety-two, in cities, suburbs, and rural areas from New England to south Texas and California to Wisconsin. They represent a changing church, one that reflects the diversity of American cultures and that is as much African-American and Asian-American as Irish or Hispanic. Deeply committed to their church, painfully alienated, or barely involved, all these women have deep and rich spiritual lives. Few experience crises of faith, but many question the shape and practices of the institutional church. Priests are key religious figures in their lives, but so are other women. Virtually all wonder whether their religious family views them as fully adult human beings.Being a Catholic woman in the United States has as much to do with \"American\" and \"woman\" as it does with \"Catholic.\" Redmont examines how Catholic women work, love, vote, and pray. A lively and opinionated group, the women of Generous Lives speak their minds on a range of issues including poverty, violence, death and the afterlife, abortion, child-rearing, feminism, friendship, marriage, homosexuality, and the relationship and difference between women and men.Those who do stay in the Church stay on their own terms, critical yet positive, testing tradition against their experience and the voice of their conscience, which guides them on matters ranging from politics to birth control. Most do not see themselves as dissenters. Faithful, active, strong, and generous - often to a fault - the women of Generous Lives are the living church. The core of their Catholic life is the celebration of the sacraments and the commitment to the welfare of others - a belief in a generous God and in the necessity of leading a generous life.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Condemned to Repetition: The United States and Nicaragua",
        "Authors": "By Pastor, Robert A.",
        "Description": "The new epilogue to Condemned to Repetition covers events, such as the Arias peace plan and the debate over funding for the Contras, through February 1988.",
        "Category": " Social Science , Ethnic Studies , Hispanic American Studies",
        "Publisher": "Princeton University Press",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Great Masterpieces of the World",
        "Authors": "By Korn, Irene",
        "Description": "",
        "Category": "",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Exploding the Doomsday Money Myths: Why It's Not Time to Panic",
        "Authors": "By Smith, Sherman S., Ph.D.",
        "Description": "A sure cure for financial panic. Have you bought into a doom and gloom economic scenario that may never happen? Dr. Smith says today's popular money myths are built on shaky ground, and that there is great reason to be hopeful about our economic future. He refutes the doomsday money myths by exploring the theories they are based on. He offers sensible guidelines to help you handle your money wisely and from a biblical standpoint.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Bitter Grounds",
        "Authors": "By Benitez, Sandra",
        "Description": "Bitter Grounds depicts the luxurious lives of the wealthy in Salvadoran society through the Contreras family, owners of a coffee plantation. Elena de Contreras travels to Europe with her daughter to select wardrobes, spends idle time at luncheons and teas with society friends, and supports her daughter in opening an expensive gift shop in town. Yet when betrayal rocks Elena's protected and pampered world, she reveals an iron will no one had glimpsed in her before.In stark contrast are the lives of the coffee pickers, who must live a hard-scrabble existence in close proximity to the privileged elite. Jacinta Prieto comes from such a background, and as housekeeper to the Contreras family, is privy to their innermost secrets. Jacinta has secrets of her own, including a love affair with a married man whose identity she risks all to conceal. By interweaving the stories of these women, Benitez draws dramatic differences and surprising parallels in their worlds, evoking their passions and revealing their hatreds with amazing empathy.",
        "Category": " Fiction , Historical",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Proud Sisters: The Wisdom and Wit of African-American Women (Gift Editions)",
        "Authors": "By Johnson, Diane J. (EDT)",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Peter Pauper Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Rich and Dangerous (Nancy Drew Casefiles, Case 25)",
        "Authors": "By Keene, Carolyn",
        "Description": "Staying at the Plaza Hotel in New York with her father, Nancy Drew decides to investigate when Sarah Amberly, a guest in the suite next door, has a fatal heart attack under mysterious circumstances",
        "Category": "",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "Same sex Marriage: Putting Every Household At Risk",
        "Authors": "By Staver, Mathew D",
        "Description": "",
        "Category": " Social Science , LGBT Studies , Gay Studies",
        "Publisher": "B & H Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Potato Garden: A Grower's Guide",
        "Authors": "By Oster, Maggie and Ehlers, Lesley (ILT)",
        "Description": "Here is the first and only book devoted exclusively to cultivating the world's most widely grown vegetable - the potato. For the home gardener, few pursuits can be more rewarding than growing this perenially popular plant: The potato proffers a prodigious harvest - one 20-foot-square plot can yield over 400 pounds of spuds! Besides providing tasty tubers, however, potato plants will also add beauty to any plot with their lush, dark green leaves and lovely white flowers. For both beginning and experienced gardeners it's the perfect addition to a vegetable garden.More than a growing manual, The Potato Garden is the ultimate guide to potato culture. Chapter One serves up the history of the potato and is heaped with tuber trivia, such as the spud's South American origins, its voyage to Europe, and subsequent success on supper tables around the world. Later chapters offer invaluable hands-on information on how to create a potato plot that will thrive from early summer through late autumn, and include step-by-step instructions on selecting and preparing a planting site; preparing seed potatoes and slips; planting, watering, and feeding; pest prevention and control; harvesting; and storage. Alternative planting methods, such as deep mulch, specialized potato binds, and even ornamental containers, complete the range of cultivation options. And, since all of the growing methods are organic, potato planters can avoid harmful pesticides and enjoy a healthy and delicious harvest.The centerpiece of The Potato Garden is the Potato Portfolio packed with complete portraits of over 200 potatoes - virtually every variety that will grow in an American garden! From pint-size Peruvians to bulky ldahos, from mellow to tangy to fruity-tasting tubers, each spud encompasses a spectacular spectrum. Here are 'Fenton Blue,' an heirloom variety from Maine with purple skin and appealing blue flesh; 'Cherries Jubilee,' a tasty new variety that is irresistibly rosy outside and delicately pale pink inside; 'Desiree,' a popular European variety with a sultry, fullbodied taste well-suited to baking and boiling; 'Anna Cheeka's Ozette' named for a Peruvian tribe; and 'Butte,' unusually high in both vitamin C and protein. Readers can choose the best keepers, broilers, bakers, mashers, fryers, steamers and roasters to cultivate.Finally, an extensive Sources section lists local and mail-order potato purveyors, vendors of potato paraphernalia and organic gardening supplies, potato councils, boards, associations and even a potato museum!Sure to appeal to both the potato gardener and the cook, The Potato Garden should be on every spud lover's shelf.",
        "Category": " Gardening , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Caught in motion: High-speed nature photography",
        "Authors": "By Dalton, Stephen",
        "Description": "Color photographs show insects, birds, and bats in flight and are accompanied by the author's explanation of how the pictures were taken",
        "Category": "",
        "Publisher": "Van Nostrand Reinhold",
        "Price Starting With ($)": "16.21",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Complete Illustrated Guidebook to Washington, DC's Public Parks and Gardens",
        "Authors": "By Diane Ney",
        "Description": "",
        "Category": "",
        "Publisher": "BARNES&NOBLE",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    }
]