[
    {
        "Title": "Fort Mchenry (Famous Forts Throughout American History)",
        "Authors": "By Maynard, Charles W.",
        "Description": "The star-shaped Fort McHenry was made famous in 1814 during the Battle of Baltimore by Francis Scott Key’s poem “The Defense of Fort McHenry.” In 1931, Key’s renowned poem became the U.S. national anthem, “The Star-Spangled Banner.” Students learn about the fort’s commander, Major George Armistead, about Fort McHenry’s flag, and about the fort’s designation as a national monument and historic shrine—the only place in the country today with such a title.",
        "Category": " Juvenile Nonfiction , History , United States , General",
        "Publisher": "Powerkids Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Birds Of Prey Of The World",
        "Authors": "By Grossman, Mary Louise and Hamlet, J.",
        "Description": "Photographically-illustrated compilation of definitive data about the various birds of prey, their history, environment, characteristics, and habits",
        "Category": " Science , General",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "10.24",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Feathers in My Cap: An Early Reading Program in Language Experience Through Art",
        "Authors": "By Cromwell, Ellen",
        "Description": "Presents drawing, writing, speaking, listening, and storytelling activities which aid young children in learning to read",
        "Category": " Social Science , General",
        "Publisher": "Acropolis Books Inc",
        "Price Starting With ($)": "12.27",
        "Publish Date": {
            "Month": "July",
            "Year": "1980"
        }
    },
    {
        "Title": "Teaching With Favorite Clifford® Books: Great Activities Using 15 Books About Clifford the Big Red Dog \u0097That Build Literacy and Foster Cooperation and Kindness",
        "Authors": "By Hollenbeck, Kathleen M.",
        "Description": "Make room in your classroom for Clifford the Big Red Dog! This fun-filled, learning-rich resource uses 15 popular Clifford books to teach kids about getting along with others, health and safety, communities, the seasons, and other themes. Includes 60 irresistible Clifford Incentive Stickers, reproducible Clifford bookmarks, stationery, mini-books, hands-on learning games, and lots more! For use with Grades PreK-1.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Teaching Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Managing Cultural Differences",
        "Authors": "By Harris, Philip R. and Moran, Robert T., Ph.D.",
        "Description": "",
        "Category": "",
        "Publisher": "Gulf Pub Co",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Handbook of Medical-Surgical Nursing",
        "Authors": "By Springhouse Publishing",
        "Description": "",
        "Category": " Medical , Nursing , Medical & Surgical",
        "Publisher": "Springhouse Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "First Prayers (Children's Book)",
        "Authors": "By Caroline Jayne Church",
        "Description": "",
        "Category": "",
        "Publisher": "Backpack Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Junie B., First Grader: Dumb Bunny (Junie B. Jones, No. 27)",
        "Authors": "By Brunkus, Denise (ILT) and Park, Barbara",
        "Description": "Meet the World's Funniest First Grader—Junie B. Jones!It's an Easter Egg-stravaganza! With over 50 million books in print, Barbara Park’sNew York Times bestselling chapter book series, Junie B. Jones, is a classroom favorite and has been keeping kids laughing—and reading—for over 20 years! In the 27th Junie B. Jones book, Lucille is having an Easter Egg Hunt at her rich expensive mansion! And guess what? The winner gets a play date to swim in Lucille's heated indoor swimming pool! Only, here is the problem. How did Junie B. get stuck wearing a big dumb bunny suit? And how can she possibly find eggs when she keeps tripping over her huge big rabbit feet? Being a dumb bunny is definitely not as easy as it looks. Will Junie B. end up with egg on her face? Or will the day deliver some very uneggspected results?USA TODAY:\"Junie B. is the darling of the young-reader set.\" Publisher's Weekly:\"Park convinces beginning readers that Junie B.—and reading—are lots of fun.\" Kirkus Reviews:\"Junie's swarms of young fans will continue to delight in her unique take on the world….A hilarious, first-rate read-aloud.\"Time Magazine:\"Junie B. Jones is a feisty six-year-old with an endearing penchant for honesty.\"",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Claire Fontaine Crime Fighter: A novel of life and death....and shoes",
        "Authors": "By Enright, Tracey",
        "Description": "A Novel of Life and Death...and Shoes Claire Fontaine is sassy, sexy, sophisticated, and rich. Henry Bennett is fat, sloppy, slow, and a bad dresser. He's a private eye, and as far as he's concerned, she's his assistant. As far as she's concerned, he's her partner. Their entire relationship, in fact, is one big difference of opinion, and the results are hilarious. Now Henry has been hired to investigate the murder of a young woman who liked to party. Claire helps (or hinders, depending on your point of view) when she can drag herself away from her Brentwood mansion and the James Bond-like hunk who lives next door. As Claire and Henry try to trace the victim's last known companions, they stumble across streets that the rich and famous desperately try to hide. If you like sleuths who are stylish, seductive, and full of great fun, then Claire Fontaine is the crime fighter for you.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Tub Fun (Hooked on Phonics, Book 8)",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Hooked on Phonics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Troll Math Homework Survival Guide: A Reference for Students and Parents (Grades 4-6)",
        "Authors": "By Champlin, Andrea (ILT) and Jones, Teri Crawford",
        "Description": "",
        "Category": " Juvenile Nonfiction , Mathematics , Geometry",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Active Directory Cookbook for Windows Server 2003 and Windows 2000",
        "Authors": "By Allen, Robbie",
        "Description": "Those of you who run networks on Windows 2000 know the benefits of using Active Directory for managing user information and permissions. You also know what a bear it can be. The newer version included with Windows Server 2003 has over 100 new and updated features to simplify deployment, but once it's in place many system administrators still find Active Directory challenging. If you're among those looking for practical hands-on support, help is here with our new Active Directory Cookbook for Windows Server 2003 & Windows 2000, a unique problem-solving guide that offers quick answers for both versions of the directory.The book contains hundreds of step-by-step solutions for both common and uncommon problems that you might encounter with Active Directory on a daily basis--including recipes to deal with the Lightweight Directory Access Protocol (LDAP), multi-master replication, Domain Name System (DNS), Group Policy, the Active Directory Schema, and many other features. Author Robbie Allen, a Senior Systems Architect at Cisco Systems and co-author of our Active Directory tutorial, based this collection of troubleshooting recipes on his own experience, along with input from Windows administrators throughout the industry. Each recipe includes a discussion to explain how and why the solution works, so you can adapt the problem-solving techniques to similar situations.If your company is considering an upgrade from Windows NT or 2000 to Windows Server 2003, the Active Directory Cookbook for Windows Server 2003 & Windows 2000 will help reduce the time and trouble it takes to configure and deploy Active Directory for your network.This Cookbook is also a perfect companion to Active Directory, the tutorial that experts hail as the best source for understanding Microsoft's network directory service. While Active Directory provides the big picture, Active Directory Cookbook for Windows Server 2003 & Windows 2000 gives you the quick solutions you need to cope with day-to-day dilemmas. Together, these books supply the knowledge and tools so you can get the most out of Active Directory to manage users, groups, computers, domains, organizational units, and security policies on your network.",
        "Category": " Computers , Operating Systems , Windows Workstation",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "6.33",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Joy for the Journey: A Woman's Book of Joyful Promises",
        "Authors": "By",
        "Description": "Completely revised and updated, this redesigned edition of the best-selling Joy for the Journey features a contemporary color pallet along with current excerpts from the writings of beloved female authors. Based on a proven best-selling format that women have enjoyed for nearly ten years, this new edition perfectly captures the essence of a godly woman.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Fantasy and Your Family: Exploring The Lord of the Rings, Harry Potter, and Modern Magick",
        "Authors": "By Abanes, Richard",
        "Description": "",
        "Category": " Literary Criticism , Children's Literature",
        "Publisher": "Christian Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Riddle of Penncroft Farm (An Odyssey/Great Episodes Book)",
        "Authors": "By Jensen, Dorothea",
        "Description": "Lars Olafson's move to a farm near Valley Forge brings him friendship with the ghost of an eighteenth-century ancestor who recounts his adventures during the American Revolution.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Harcourt Brace & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "My First Step Bible (Pink Cover)",
        "Authors": "By Thomas, Mack",
        "Description": "",
        "Category": "",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "The Pony Craft Book",
        "Authors": "By Helene Lundberg",
        "Description": "",
        "Category": "",
        "Publisher": "Stabenfeldt Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Alaska Almanac",
        "Authors": "By Alaska Northwest Books",
        "Description": "Everyone knows Alaska is our biggest state, that Mt. McKinley is North America's tallest mountain, and that Nome is colder than anywhere you should ever want to be. But did you know that your chances of being killed by a bear in Alaska are greater than your chances of being run over by a New York City cabbie? Or that it gets so chilly up there that your tires will go flat? Or that half of all Alaskan man-overboard accidents happen because a guy tried to relieve himself over the side? Well these are things you should know. Now you have no excuse, because the 31st edition of THE ALASKA ALMANAC? will guide you toward a thorough understanding of this weird and wonderful state.",
        "Category": " Reference , Almanacs",
        "Publisher": "Alaska Northwest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Thunder from the East: Portrait of a Rising Asia",
        "Authors": "By Kristof, Nicholas D. and Wudunn, Sheryl",
        "Description": "From the Pulitzer Prize-winning journalists and authors of China Wakes comes this insightful and comprehensive look at Asia on the rise.The recent economic crisis in Asia heaped devastation upon millions. Yet Nicholas Kristof and Sheryl WuDunn argue that it was the best thing that could have happened to Asia. It destroyed the cronyism, protectionism, and government regulation that had been crippling Asian business for decades, and it left in its wake a vast region of resilient and determined millions poised to wrest economic, diplomatic and military power from the West. Thunder from the East is a riveting look at a complex region, a fascinating panoply of compelling characters, and a prophetic analysis from arguably the West's most informed and intelligent writers on Asia.",
        "Category": " Political Science , Political Economy",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Michelin THE GREEN GUIDE Sicily, 1e (THE GREEN GUIDE)",
        "Authors": "By Michelin Travel Publications",
        "Description": "",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Michelin Travel Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "The Dog Who Thought He Was Santa",
        "Authors": "By Wallace, Bill",
        "Description": "The Nose Knows    Don Franklin's dog, Frank, is a bloodhound, so he can smell when something's wrong. And a lot seems to be wrong in Don's family. Mom and Dad are worried about money, especially with Christmas right around the corner and the threat of the mine closing. Don's worried because he's just discovered how dangerous Dad's job in the mine is. And they're all worried about getting Don's little sister, Susan, what she wants for Christmas, when she won't tell anyone but Santa Claus what it is. It looks as if Christmas might not be all that merry at the Franklins' house.   But Christmas is a time for miracles, whether seen from a boy's perspective or a dog's -- and The Dog Who Thought He Was Santa looks at the Franklins' Christmas miracle from both.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Pugs: Everything About Purchase, Care, Nutrition, Breeding, Behavior, and Training With 43 Color Photographs (Complete Pet Owner's Manual)",
        "Authors": "By Earle-Bridges, Michele (ILT) and Maggitti, Phil",
        "Description": "Traces the history of the breed, discusses a pug's care requirements, and includes information on training and common health concerns",
        "Category": "",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Lu and Clancy's Secret Codes",
        "Authors": "By Mason, Adrienne and Cupples, Pat (ILT)",
        "Description": "Dog detectives Lu and Clancy try to solve another case that offers aspiring detectives a chance to develop their sleuthing skills with sixteen secret codes that must be deciphered to help solve the mystery. Original.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Kids Can Press",
        "Price Starting With ($)": "8.53",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Smoke Mountain (Seekers #3)",
        "Authors": "By Hunter, Erin",
        "Description": "The third book in a thrilling animal fantasy series following the epic journey of three bears, from the #1 nationally bestselling author of Warriors.United at last, polar bears Kallik and Taqqiq, black bear Lusa, grizzly bear Toklo, and Ujurak, the mysterious shape-shifting bear, learn of a place they think must be the destination of their quest: the Last Great Wilderness. But getting there means crossing the burning Smoke Mountains, which hold obstacles more treacherous than anything they've faced so far….For fans of Warriors, Survivors, and animal fantasy series like Wings of Fire and Foxcraft, Seekers is a sweeping and incredible journey through the beautiful, dangerous world of wild bears.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "The Legend of Scarface, A Blackfeet Indian Tale",
        "Authors": "By Robert San Souci",
        "Description": "",
        "Category": "",
        "Publisher": "Trumpet Club Special Edition D",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Influence: How Women's Soaring Economic Power Will Transform Our World for the Better",
        "Authors": "By Dychtwald, Maddy and Larson, Christine (CON)",
        "Description": "In the United States and in very many nations around the world, women are on the cusp of new financial power--and evidence suggests that women will use this power to improve society in ways we can only begin to imagine. Through candid interviews and lively reporting, and with exclusive research, Dychtwald reveals a huge cultural transformation that is about to occur--a true tipping point--after which more children may have quality health care and education, workplaces may be more responsive to families, men may experience new freedoms and opportunities to pursue more meaningful careers, and more corporations and nations will be led by women, and they will thrive. Dychtwald and Larson give us a sneak peek at the world turned right-side-up by women. To read this book is to prepare oneself for an altered--and improved--way of life.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Voice",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Greener Than You Think (Classics of Modern Science Fiction, Vol. 10)",
        "Authors": "By Moore, Ward",
        "Description": "A Los Angeles homeowner's dying grass has been treated with Metamorphizer and now threatens to cover the entire earth in a ten-foot-high, impenetrable mass of growing lawn",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Crown Publishers",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Dear Mother",
        "Authors": "By Hallmark",
        "Description": "",
        "Category": "",
        "Publisher": "Hallmark Editions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The Motley Fool's Investing Without a Silver Spoon: How Anyone Can Build Wealth Through Direct Investing",
        "Authors": "By Fischer, Jeff",
        "Description": "Shows how to avoid brokerage fees by buying stock directly from companies",
        "Category": " Business & Economics , Personal Finance , Taxation",
        "Publisher": "Motley Fool",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Multiple Sclerosis: The Questions You Have - The Answers You Need",
        "Authors": "By Kalb, Rosalind C., Ph.D. (EDT)",
        "Description": "",
        "Category": " Medical , Physical Medicine & Rehabilitation",
        "Publisher": "Demos Health",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Green Remodeling : Changing the World One Room at a Time (Mother Earth News Wiser Living Series (9))",
        "Authors": "By Johnston, David and Master, Kim",
        "Description": "An encyclopedic how-to of all you need to make your home green  Whether because of changing lifestyles or simply because houses are becoming outdated, millions of North Americans are renovating their homes every year, spending more money annually on renovation than on new home construction. But renovations can be fraught with unintended consequences like indoor air pollution. How do you remodel in a healthy, environmentally friendly way?  Green Remodeling is a comprehensive guide. It first points out the advantages of remodeling. Buildings are responsible for 40% of worldwide energy flow and material use; so how you remodel can make a difference. Upgrading furnaces, cabinets and toilets means less fossil fuel pollution, reduced resource depletion, and fewer health risks. Green remodeling is more energy-efficient, more resource-conserving, healthier for occupants and more affordable to create, operate and maintain.  The book then discusses simple green renovation solutions for homeowners, focusing on key aspects of the building including foundations, framing, plumbing, windows, heating and finishes. Room by room, it outlines the intricate connections that make the house work as a system. For example, how new windows may affect the structure and mechanical systems of the rooms below, the health of the family, and the future of old-growth forests. Then, in an easy-to-read format complete with checklists, personal stories, expert insights and an extensive resource list, it covers easy ways to save energy, conserve natural resources, and protect the health of loved ones. Addressing all climates, this is a perfect resource for conventional homeowners, as well as architects and remodeling contractors.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "New Society Publishers",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "100 Questions Every First-Time Home Buyer Should Ask: With Answers from Top Brokers from Around the Country",
        "Authors": "By Glink, Ilyce R.",
        "Description": "From the most trusted name in real estate, here is the latest edition of the indispensable guide that helps first-time buyers land the home of their dreams.Ilyce R. Glink has established herself as America’s most trusted real estate expert. In this new, fully revised and updated edition of the book that made her a household name, Glink offers more than 100 pages of new material addressing all of the current trends home buyers need to stay on top of, including:• The new construction housing boom and how home buyers can make the most of it• Mortgage lending innovations, such as interest-only financing and the ability to finance 103 percent of the purchase price• The changing habits of first-time home buyers (purchasing without a broker, using discount Internet-based services, and buying first homes as investments)• The latest information on asbestos, mold, radon, and other bio-environmental hazards and new, inexpensive testing methods any home buyer can useIn this third edition of 100 Questions Every First-Time Home Buyer Should Ask, Glink presents new stories of real people who have gone through the home-buying process for the first time and once again offers her trademark friendly advice on how to avoid common home-buyer mistakes.Also available as an eBook",
        "Category": " Business & Economics , Real Estate , General",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Omnibus Guidelines Preschool Through Third Grade (The Work Sampling System) (The Work Sampling System)",
        "Authors": "By Margo Dichtelmiller",
        "Description": "",
        "Category": "",
        "Publisher": "Margo Dichtelmiller",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Your Body can Heal Itself, over 87 Foods Everyone Should Eat",
        "Authors": "By Wood, Frank K.",
        "Description": "",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Easter Parade",
        "Authors": "By Chalmers, Mary",
        "Description": "The Easter animals--rabbits, ducks, and chickens--gather for a springtime parage, and everyone receives an Easter basket filled with candy, flowers, and decorated eggs",
        "Category": "",
        "Publisher": "Trophy Pr",
        "Price Starting With ($)": "9.66",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "The Quiz Book (American Girl Library)",
        "Authors": "By Tilley, Debbie (ILT) and Allen, Laura",
        "Description": "An eye-catching quiz book in a notebook format offers quizzes, questions, and activities for girls to foster self-discovery in such areas as personal style, friendship, and life skills. Original.",
        "Category": " Juvenile Nonfiction , Activity Books",
        "Publisher": "American Girl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "How Stuff Works",
        "Authors": "By Brain, Marshall",
        "Description": "From the award-winning Web site visited by more than 2.5 million people every month comes the hardcover reference guide How Stuff Works. This book is a definitive guide to the inner workings of everyday items. In this fun and infinitely informative guide, Marshall Brain and staff of \"stuff\" experts at HowStuffWorks, Inc. unravel the mysteries of more than 135 intriguing topics. You'll be fascinated by the world around you!In Marshall Brain's trademark easy-to-understand language, complemented by beautiful full-color illustrations, you'll discover the basic mechanisms behind everything from toasters to turbochargers, dieting to DVD players, and cell phones to submarines.Technology and scientific principles are all around you: whether in the chips needed to execute commands on your computer, or in determining how many calories you need to burn in order to lose five pounds. This exciting book explains?\"in a way you can easily grasp?\"how technology is a part of everyday life. No matter what your age, if you're intrigued by how stuff works, you won't be able to put down How Stuff Works!",
        "Category": " Reference , Curiosities & Wonders",
        "Publisher": "Chartwell Books, Inc.",
        "Price Starting With ($)": "7.54",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Augsburg Sermons for Children Series C (Luke)",
        "Authors": "By Augsburg, .",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Augsburg Fortress Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Seashells, Crabs and Sea Stars: Take-Along Guide (Take Along Guides)",
        "Authors": "By Garrow, Linda (ILT) and Tibbitts, Christiane Kump",
        "Description": "An introduction to the world of seashells, crabs, and sea stars including identification information, educational activities, and fun facts. Invites young naturalists to spot wildlife. Safety tips are provided and interesting activities are suggested.",
        "Category": " Juvenile Nonfiction , Animals , Marine Life",
        "Publisher": "Cooper Square Publishing Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Family Handyman: Toys, Games, and Furniture",
        "Authors": "By Reader's Digest Association",
        "Description": "38 handcrafted wooden toys, games, and furniture pieces that are beautiful and practical, and will be cherished for years.Designed, built, and clearly described by the do-it-yourself experts at The Family Handyman magazine - all professional woodworkers and carpenters.Each project features detailed drawings, photos, easy-to-follow instructions, and complete materials lists and sources to assure that the work goes smoothly right from the beginning.A special introductory section about building safely for children providing specific guidelines to help you build attractive products that are child-safe.Projects you can undertake with confidence whether you're a veteran woodworker or a novice.Projects: toys, games, wagons and rocking toys, and furniture and storage.",
        "Category": " Crafts & Hobbies , Woodwork",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Globalization and Maritime Power",
        "Authors": "By Tangredi, Sam J. (EDT)",
        "Description": "",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "National Defense Univ., 2002.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Little Dogs: Training Your Pint-Sized Companion",
        "Authors": "By Wood, Deborah",
        "Description": "Small dogs (described as those 12” and under or 20 lbs. and under) have special needs that require training techniques specifically formulated for their small statures and distinctive personalities. Little Dogs: Training Your Pint-Sized Companion offers gentle, positive, and extraordinarily effective solutions to many of the most common challenges facing small dogs and their owners today. The book features innovative training techniques geared specifically toward small dogs, with tips on how to clearly communicate with your dog and understand how he thinks. It also offers solutions to common behavioral issues and thorough coverage of a variety of issues—all with an emphasis on positive reinforcement.",
        "Category": " Pets , Dogs , General",
        "Publisher": "T.F.H. Publications, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Popular Mechanics Complete Car Care Manual",
        "Authors": "By Popular Mechanics (EDT)",
        "Description": "For more than 100 years, the editors of Popular Mechanics have been providing car enthusiasts with the skills and confidence they need to keep their vehicles running right and looking great. This manual is crucial for anyone who wants to know the automobile’s basic components, from the engine to the electronic systems, and to understand how they work, what can go wrong, and how to make repairs. Find out how to maintain and replace windshield washers, fix steering wander and faulty cruise control, and purge bad smells from the interior. Get smart advice on how to pass emission inspection and find service data online. And because car owners want their ride to look as good as it works, there are even instructions for removing bumper stickers, tinting windows, and adding pinstripes.With more than 90 projects, The Complete Car Care Manual—one of Popular Mechanics most successful books—will guide owners step-by-step through what it takes to hush those squeaks, replace the u-joints, change their own oil and filter, and so much more.",
        "Category": " Transportation , Automotive , Repair & Maintenance",
        "Publisher": "Hearst",
        "Price Starting With ($)": "7.0",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Family of Children",
        "Authors": "By Jerry Mason, ed.",
        "Description": "",
        "Category": "",
        "Publisher": "New York: Grosset & Dunlap, 1977.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "King of the Mild Frontier: An Ill-Advised Autobiography",
        "Authors": "By Crutcher, Chris",
        "Description": "Do you know: A good reason to be phobic about oysters and olives?  How shutting your mouth can help you avoid brain surgery? How to survive in the winter wilderness with only a fishing pole and a sausage?",
        "Category": " Young Adult Nonfiction , Social Topics , General",
        "Publisher": "Greenwillow Books",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Hornets' Nest (Watch It Grow)",
        "Authors": "By Camm, Martin (ILT) and Scarborough, Kate",
        "Description": "Follows the step-by-step process of a hornets' nest being built",
        "Category": " Juvenile Fiction , Animals , Insects, Spiders, etc.",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Debt-Proof Living: The Complete Guide to Living Financially Free (Debt-Proof Living (Paperback))",
        "Authors": "By Hunt, Mary",
        "Description": "Getting out of debt is only part of the plan. The reader learns how to give, save and build wealth using the Contingency Plan and Freedom Account along with the authors sound and proven principles.",
        "Category": " Business & Economics , Personal Finance , Money Management",
        "Publisher": "DPL Press",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Wound Too Tight",
        "Authors": "By Perkins, T. J.",
        "Description": "Shawn's fate and his friend's lives hang in the balance and everything depends on discovering the secret of an enchanted pocketwatch.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "GumShoe Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Animals of the Ocean (Windows on Nature)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Reading's Fun LTD",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Animals of the Polar Regions",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Reading's Fun LTD",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Animals of the Woodlands (Windows on Nature)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Reading's Fun LTD",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Individuality: Human Possibilities and Personal Choice in the Psychological Development of Men and Women (APPROX 296P#)",
        "Authors": "By Tyler, Leona Elizabeth",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Jossey-Bass Inc Pub",
        "Price Starting With ($)": "6.09",
        "Publish Date": {
            "Month": "February",
            "Year": "1978"
        }
    },
    {
        "Title": "Apologize, Apologize!",
        "Authors": "By Kelly, Elizabeth",
        "Description": "Apologize, Apologize! takes us into the perversely charmed world of the Flanagans and their son, Collie (His parents named him after their favorite breed of dog.) Collie comes of age on Martha's Vineyard, trying to make sense of his wildly wealthy, hyper-articulate, resolutely crazy family members: a philandering father, incorrigible brother, pigeon-racing uncle, radical activist mother, and a domineering media mogul grandfather (accused of being a murderer by Collie's mother). As Collie searches for his place in the world, he suffers insurmountable loss and grapples for bravery as he struggles to cope with people he has no choice but to love. Elizabeth Kelly's first novel is brilliantly written and utterly unpredictable - a remarkable debut.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Twelve",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "From a Whisper to a Scream (Key Books, 2)",
        "Authors": "By De Lint, Charles",
        "Description": "Originally published under the pen name \"Samuel M. Key\"\"Years after the death of a notorious child murderer, children have begun to die again...and a crime photographer begins to suspect he has the one true clue that connects the horrific events.\"In the early 1990s, Charles de Lint wrote and published three dark fantasy novels under the pen name \"Samuel M. Key.\" Now, Orb presents them for the first time under de Lint's own name.",
        "Category": " Fiction , Magical Realism",
        "Publisher": "Orb Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Lonely Planet Greece (3rd ed)",
        "Authors": "By Hellander, Paul and Hall, Rosemary",
        "Description": "Discusses the history and culture of Greece and recommends accommodations, restaurants, and attractions",
        "Category": " Travel , Asia , India",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Building a Christian World View",
        "Authors": "By Hoffecker, Andrew and Smith, Gary Scott (EDT)",
        "Description": "",
        "Category": " Religion , Christian Theology , Apologetics",
        "Publisher": "Presbyterian & Reformed Pub Co",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Studies on Hysteria",
        "Authors": "By Josef Breuer, Sigmund Freud",
        "Description": "",
        "Category": "",
        "Publisher": "Basic Books Inc.",
        "Price Starting With ($)": "64.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "Outgrowing the Pain Together",
        "Authors": "By Gil, Eliana",
        "Description": "Because love is not enough... a step-by-step plan for overcoming obstacles together. Childhood abuse has many forms, but the message is always the same: people who love you hurt you. If you are the spouse or partner of a survivor of an abusive childhood, you know what that means-a relationship that has you worried, angry, or frustrated. You may be wondering if the person you love will ever \"get over\" his or her past, and if you can ever have a \"normal\" relationship. You may even have thought about leaving out of frustration and despair. But there is real help. Therapist Eliana Gil understands the special problems you and your partner face. Based on her extensive clinical experience with adults abused as children, she has developed a unique, much-needed program specifically for couples. It provides guidance in:Anger management.Safe and successful ways to express feelings.The dangerous trigger words: what are they; what they do.Touching or being touched: no more fear; no more guilt.Good sex: Loving, fulfilling intimacy.Decision-making and power: equal partners at last.Ending the silence: communication that worked.Commitment: being able to count on tomorrow... and more.",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "12.42",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "515 Scrapbooking Ideas",
        "Authors": "By Vanessa-Ann",
        "Description": "Every page in this colorful collection will spark your imagination and spur you to experiment with ever more creative arrangements of photos, borders, frames, and captioning. Ideas for every special occasion appear: a new birth, recital, family trip, holidays, and more. “Get your photos ready, these ideas will keep you busy making album pages for a long time...tips and techniques galore...”—Quick & Easy Crafts.",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "Sterling/Chapelle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Gifts of Being Grand: For Grandparents Everywhere (Marianne Richmond)",
        "Authors": "By Richmond, Marianne",
        "Description": "The Gifts of Being Grand pays tribute to the special joys and rewards of grandparenthood.Filled with wit and warmth, the book's lyrical poetry and vibrant illustrations let \"grown-up\" moms and dads recall their parenting past, celebrate their own kids, and delight in the newfound gifts of grandparenthood.From a \"grand\" new name and lots of hugs and kisses...to a second chance for patience, adventure and fun, The Gifts of Being Grand counts each gift as a reason to cherish this grand season of life!The perfect gift to honor the seasoned grandparent or to enthuse the grandparent-to-be, The Gifts of Being Grand is a treasured reminder of how good it is to be grand!",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Sourcebooks Jabberwocky",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Crossroads cookery",
        "Authors": "By Hurd, Samuella L",
        "Description": "",
        "Category": "",
        "Publisher": "Women's Club",
        "Price Starting With ($)": "13.34",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Fodor's flashmaps, New York",
        "Authors": "By La Rocca, Fabrizio, Fodor's",
        "Description": "Includes maps showing the five boroughs, airports, museums, lodging, subways, and points of interest",
        "Category": "",
        "Publisher": "Fodor's Travel Publications, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Little Boy Book",
        "Authors": "By Moore, Sheila and Frost, Roon",
        "Description": "Complete, authoritative, and sensible, The Little Boy Book draws on four years of research, and numerous studies and interviews, to address the special needs of raising a boy today. Two writers, both parents of boys and one an early childhood educator, guide you from the day you bring your \"little blue bundle\" home through his crucial elementary school years. Inside, you'll learn how: ¸  Boys develop differently from girls--and why ¸  \"male aggressiveness\" originates--and where ¸  Order and direction can be painlessly established in your young son's life ¸  Working moms and their little boys can have a good relationship ¸  Traumas like divorce affect boys differently ¸  Your son will respond to love and discipline ¸  And much moreRaising a boy is a unique experience--and here's the guidebook that explores and explains not just your growing child but your very own son!",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Crown Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "Flea Market Handbook",
        "Authors": "By Miner, Robert G.",
        "Description": "Supplies practical advice on how to start an antiques business in flea markets with no cash investment, and includes tips on where and how to buy and sell",
        "Category": " Business & Economics , General",
        "Publisher": "Wallace-Homestead Book Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "MS-DOS batch files (Microsoft quick reference)",
        "Authors": "By Jamsa, Kris",
        "Description": "Explains how to create, save, and run batch files, and shows how to use advanced functions to enhance their efficiency and expand their versatility",
        "Category": "",
        "Publisher": "Microsoft Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Mythology (Dorling Kindersley Eyewitness Books)",
        "Authors": "By Neil Philip",
        "Description": "",
        "Category": "",
        "Publisher": "DORLING KINDERSLEY PUBLISHERS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Spot What Spectacular",
        "Authors": "By Bryant, Nick and Summers, Rowan",
        "Description": "",
        "Category": " Juvenile Fiction , Visionary & Metaphysical",
        "Publisher": "Penton Overseas Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "French Verb Drills (Language Verb Drills)",
        "Authors": "By De Roussy De Sales, R.",
        "Description": "Advanced Presents French verbs clearly and methodically, following the normal progression of most basic texts.",
        "Category": "",
        "Publisher": "Passport Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Rendering With Markers",
        "Authors": "By Kemnitzer, Ronald B.",
        "Description": "Introduces dry markers and related sketching equipment, demonstrates masking, blending, and editing techniques, and shows how to simulate materials and special lighting conditions",
        "Category": " Art , Techniques , Drawing",
        "Publisher": "Watson Guptill Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Santa Paws (Paw Pals)",
        "Authors": "By Gerver, Jane E. and Hale, Rachael (COR)",
        "Description": "Puppies chase kittens,Kittens chase mice.Have you been naughty?Or have you been nice?In this newest Paw Pals board book, little ones will read along as adorable kittens and pups frolic and play in the wintry world around them. The heartwarming photographs are presented alongside sweet rhyming text that captures the joyous spirit of winter and Christmastime in all their glory.Acclaimed photographer Rachael Hale uses her lens, her love of animals, and a great deal of patience, to create this enchanting perspective on the holiday season.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "LB Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Contacts Sixth Edition (French Edition)",
        "Authors": "By Valette, Jean-Paul and Valette, Rebecca M.",
        "Description": "",
        "Category": " Foreign Language Study , French",
        "Publisher": "Houghton Mifflin Harcourt (HMH",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Ready, Freddy! #16: Ready, Set, Snow! (16)",
        "Authors": "By Klein, Abby and McKinley, John (ILT)",
        "Description": "Everybody knows shark expert Freddy Thresher is also a snowshoe whiz--or is he? When Mrs. Wushy announces that the class will be competing in the mini-Winter Olympics, everyone is excited for the competition. But, after betting Max the bully that he will win the Snowshoe Race, Freddy heads straight for snowshoe boot camp, and fast! Will Freddy be able to win gold amid sled pulls and the infamous Snowball Toss? (copy continues) First grade and kindergarten teacher Abby Klein has been teaching for almost twenty years, and she brings her firsthand knowledge of children to this popular series. As well, she tailors each story and the language in it for new readers--using just the right words, as well as the issues that are most important to children this age.      For extra fun, the word \"fin\" is hidden in every illustration, and children will have a good time playing the games in \"Freddy's Fun Pages\" at the end of the book. Attention shark lovers! Freddy Thresher is a first grade expert on sharks, and each book features cool facts about sharks as an added bonus.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "The Blue Sky Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Eye On Nixon: A Photographic Study of the President and the Man",
        "Authors": "By Eisenhower, Julie Nixon",
        "Description": "",
        "Category": "",
        "Publisher": "W. Clement Stone / Hawthorn Books, Inc.",
        "Price Starting With ($)": "5.57",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "GRANDMOTHERS ARE LIKE SNOWFLAK",
        "Authors": "By Lanese, Janet",
        "Description": "",
        "Category": " Family & Relationships , Parenting , Grandparenting",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "God's Road Map for Moms",
        "Authors": "By Bordon, David and Winters, Tom",
        "Description": "An alphabetically organized, Scripture-inspired handbook for mothers confronted by the complex task of raising children in the modern world explains how to discover an oasis of peace amid the stresses and pressures of daily life. 40,000 first printing.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "FaithWords",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Colorful Knitwear Design: from Threads (Threads On)",
        "Authors": "By Editors of Threads",
        "Description": "In this collection of 19 articles from \"Threads\" magazine, knitting experts share design ideas and techniques to help readers create knits that flatter and fit and are enjoyable to make. Knitters will find practical information on how to: blend colours and fibres; make textural stitches; chart free-form geometric designs; make custom-embroidered embellishments, and inters; and create perfect ribbons, pockets and cardigan bands. It guides knitters through picking the fibre, colour and texture to choosing the finishing technique. The book is illustrated throughout and includes eight sweater schematics, two complete garment patterns plus numerous charts and stitch patterns.",
        "Category": " Crafts & Hobbies , Fashion",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "iPod & iTunes For Dummies, 3rd Edition",
        "Authors": "By Bove, Tony and Rhodes, Cheryl",
        "Description": "Imagine running your daily errands while listening to songs from five different albums, or creating a party mix that lasts all night long, or catching the news briefings while walking to class. Whether we’re commuting to work or heading off on a vacation, the iPod has revolutionized how we listen to music. Never before has a device with such capacity been so easy to carry that even the largest model weighs less than two CD jewel cases. IPod & iTunes for Dummies offers a comprehensive but friendly guide to this new technology that is sweeping the world.This book has updated advice to help you get the hang of the most recent iPod upgrades. Some of the things you’ll find out about are:Specs and information on the latest models, including the iPod Shuffle and iPod PhotoThe way to set up iTunes on your computerTips for acquiring and managing music, photos, and podcastsHow to transfer music from iTunes to your iPod, how to play songs, and what to do if something does not function properlyAdvanced techniques such as decoding and encoding, enhancing sound quality, recording and editing, and using your iPod as a hard driveWritten by computer experts and music enthusiasts, this complete resource will show you how to get the most out of your iPod and iTunes. Get ready to enjoy the wonders of this international phenomenon!",
        "Category": " Computers , Hardware , Peripherals",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Abuela",
        "Authors": "By Dorros, arthur",
        "Description": "",
        "Category": "",
        "Publisher": "BANTAM DOUBLEDAY @ DELL",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Exterior Planner (Better Homes & Gardens)",
        "Authors": "By Better Homes and Gardens Books",
        "Description": "Chapters covers siding, trim, roofing, windows, and doors.Guides homeowners through a maze of choices for color, design, and materials.Homeowners can visualize changes with before-and-after photos plus house-style basics and color suggestions.Handy reference provides tips on care and maintenance for newly revived exteriors.The only comprehensive guide of its kind available.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Celebrating Christmas: Christmas Decorations Learn to Read Holiday Reader (Learn to Read. Holiday Series)",
        "Authors": "By Urbanovic, Jackie (ILT) and Roark, Kimberly",
        "Description": "A story that explains the meaning behind the decorations used around the house at Christmas time.",
        "Category": " Juvenile Nonfiction , School & Education",
        "Publisher": "Creative Teaching Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The New Wine Lover's Companion",
        "Authors": "By Herbst, Sharon Tyler and Herbst, Ron",
        "Description": "The first edition of this popular wine reference was hailed by Jurgen Gothe of the Vancouver Sun as \"the best new wine book in more than a decade.\" The New Wine Lover's Companion has been completely rewritten and updated to make it even better. No wine snobbery here. This book's style is relaxed and conversational, serving up information without intimidating its reader. Arranged alphabetically, nearly 4,000 entries include innumerable details on grape varieties; wine styles; wine-growing regions; wine label terms; winemaking techniques; how to buy, store, and serve wine; how to have a wine tasting; wine-testing terms; sizes and styles of glassware, wine bottles, and wine openers; ordering wine in a restaurant; opening and serving wine at home; temperatures for serving wine; and much more. This book is the only A-to-Z wine reference that offers phonetic pronunciations. It boasts a totally revised and expanded appendix enhanced with charts, line art, and sample labels. Praise for the previous edition came from many food and dining authorities: \"…an invaluable, user-friendly reference. I learned something from the very first page I turned to, and keep learning as I keep turning.\"  --William Rice, Food and Wine Columnist, Chicago Tribune  . . .  \"A great reference! . . . excellent and accurate source for both wine professionals and those involved with wine purely for the love of it.\" --Jacques Pepin, cookbook author and TV chef",
        "Category": " Cooking , Beverages , Alcoholic , Wine",
        "Publisher": "B E S Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Operation: Survival (Hardy Boys: Undercover Brothers, No. 7)",
        "Authors": "By Dixon, Franklin W.",
        "Description": "ATAC BRIEFING FOR AGENTS FRANK AND JOE HARDY  MISSION: Determine the cause of recent injuries and deaths at a camp for troubled teens.   LOCATION: The wilderness surrounding Moosehead Lake in Maine.  POTENTIAL VICTIMS: More boys in the program. Counselors.   SUSPECTS: We have reason to suspect that the founder of the camp, Linc Saunders, is behind this.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Cat's Eyewitness: A Mrs. Murphy Mystery",
        "Authors": "By Brown, Rita Mae and Gellatly, Michael (ILT)",
        "Description": "It’s no secret that cats are a mystery writer’s best friend. Just ask the bestselling team of Rita Mae Brown and her furry partner, Sneaky Pie Brown, back on the prowl with another unforgettable whodunit. This time a controversial miracle in Virginia’s Blue Ridge Mountains sparks religious fervor–and a suspicious death. Now the indefatigable felines Mrs. Murphy and Pewter, along with the dogged corgi Tee Tucker, must trust their animal instincts to sniff out the worst of human nature....With the holidays approaching, Mary Minor “Harry” Haristeen and her best friend, Susan Tucker, take a much-needed time-out at the mountain monastery of Mount Carmel. There, under the benevolent gaze of the statue of the Virgin Mary, their worldly worries are soon overshadowed. For in front of their very eyes the statue begins to cry tears of blood. Legend has it that Mary’s crimson tears are harbingers of crises. And though skeptical, the ever-practical Harry can already see one on the horizon. If leaked, news of the so-called miracle could turn the monastery and the town of Crozet into a circus. What Harry doesn’t foresee is murder.…When Susan’s great-uncle Thomas, a resident monk, is found frozen to death at the base of the statue, foul play is ruled out–at first. But at Harry’s urging, the body is exhumed for an autopsy. There’s just one problem: the coffin is empty. That’s when Mrs. Murphy, Pewter, and Tucker get involved. Then there’s the shocking revelation of a mystery that has perplexed the citizens of Crozet for ages.With Christmas around the corner and the monastery overrun by the faithful, all Harry’s meddling menagerie can do is stay on her trail as she jumps knee-deep into an unofficial investigation–one that becomes more dangerous when another Crozet citizen meets an untimely demise. In this case it will be a miracle if Harry stays alive....",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "1,818 Ways to Write Better & Get Published",
        "Authors": "By Edelstein, Scott",
        "Description": "Discusses the writer's attitude and craft, writing successful fiction and nonfiction, publishing opportunities, doing business with editors and agents, and business and legal matters",
        "Category": " Language Arts & Disciplines , Writing , General",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Revolutions: Theoretcal, Comparative, and Historical Studies",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt, Brace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The Complete Book of the Olympics: Revised Edition",
        "Authors": "By Wallechinsky, David",
        "Description": "A compendium of trivia about the Olympic games offers information on all events and their scoring, medal winners since 1896, profiles of legendary athletes, play-by-play accounts, and numerous action photographs",
        "Category": " Sports & Recreation , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "The Legend of Storey County: A Novel",
        "Authors": "By Thoene, Brock",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Beautiful Perennials: Simple Techniques to Make Your Garden Sensational (Miracle Gro)",
        "Authors": "By Rogers, Marilyn (EDT)",
        "Description": "This \"everything-you-need-to-know\" book simplifies the concepts behind growing perennials into a handful of easy-to-understand steps.Easy-to-follow technique sections show readers how to plant and grow perennials; the encyclopedia showcases the most beautiful, easiest-to-grow perennials.Complete with a plant selection guide, Miracle-Gro Beautiful Perennials provides simple techniques and professional tips for designing, establishing, and caring for a multitude of perennial plants.",
        "Category": " Gardening , Flowers , Perennials",
        "Publisher": "Miracle-Gro",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Laptops For Dummies (For Dummies (Computers))",
        "Authors": "By Gookin, Dan",
        "Description": "With a generous dash of humor and fun, bestselling author Dan Gookin shows people how to select the right machine and tackle typical laptop challengesLaptop sales recently surpassed those of desktop machines-a trend that seems likely to continueA must for laptop newbies as well as road warriors who need to get the most out of their machinesCovers synchronizing with the desktop, accessing the desktop remotely, coordinating e-mail pickup between two machines, wireless networking, managing power, and securing a laptop",
        "Category": " Computers , Hardware , Personal Computers , PCs",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Ice Station Zebra",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Crest",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "The Search for Al Qaeda: Its Leadership, Ideology, and Future",
        "Authors": "By Riedel, Bruce",
        "Description": "Al Qaeda is the most dangerous terrorist movement in history. Yet most people in the Americas and Europe know very little about it, or their view is clouded by misperceptions and half truths. If the first rule of war is to ?know your enemy,' then we have a long way to go. This important book fills this gap with a comprehensive analysis of al Qaeda?the origins, leadership, ideology, and strategy of the terrorist network that brought down the Twin Towers and continues to threaten us today.  Bruce Riedel is an expert on the Middle East and South Asia, with thirty years of intelligence and policymaking experience. He was actually in the White House Situation Room during the 9/11 attacks, serving as special assistant to the president and National Security Council senior director for Near East Affairs. He draws on this insider experience in profiling the four most important figures in the al Qaeda movement: Osama bin Laden, its creator and charismatic leader; ideologue Ayman Zawahiri, its Egyptian coleader and principal spokesman; Abu Musaib al Zarqawi, leader of al Qaeda in Iraq until his death in 2006; and Mullah Omar, its Taliban host. These profiles provide the base from which Riedel delivers a much clearer understanding of al Qaeda and what must be done to counter it.  The Search for al Qaeda reviews how al Qaeda was created and developed, presenting authoritative and chilling background on ?The Manhattan Raid,' but Riedel focuses more closely on what has happened to it since that awful day. He outlines al Qaeda's ultimate goals, which are to drive America out of the Muslim world, to destroy Israel, and to create a jihadist caliphate larger than the Ottoman Empire at its height. The profiles and subsequent analysis reveal the network's multipronged strategy for accomplishing those goals:  ? Draw America into ?bleeding wars' like the one that drove the Soviets from Afghanistan.  ? Build a safe haven for al Qaeda in Pakistan.  ? Develop other ?franchises' in the Islamic world that can overthrow pro-American regimes.  ? Conduct more Western attacks along the lines of 9/11 or the transit bombings in Madrid and London.  The book concludes with a strategy for dealing with?and defeating?this most dangerous menace.",
        "Category": " Political Science , Terrorism",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Easy Borders: High Performance Plants for Low-Maintenance Gardens",
        "Authors": "By Ephraums, Molly",
        "Description": "More than one hundred full-color photographs and ten garden plans illustrate for beginning and expert gardeners alike how to plant easy-care blooms for year-round enjoyment and includes an extensive plant listing of perennials that flourish without constant attention.",
        "Category": " Gardening , Landscape",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Williamsburg's Nicholson Street",
        "Authors": "By McManus, M. G.",
        "Description": "",
        "Category": "",
        "Publisher": "Colonial Publishing Inc.",
        "Price Starting With ($)": "8.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The Age of Innocence (Barnes & Noble Classics)",
        "Authors": "By Wharton, Edith and Howard, Maureen (INT)",
        "Description": "&&LDIV&&R&&LDIV&&R&&LI&&RAge of Innocence&&L/I&&R, by &&LB&&REdith Wharton&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&RWinner of the 1921 Pulitzer Prize, &&LI&&RThe Age of Innocence&&L/I&&R is &&LB&&REdith Wharton&&L/B&&R’s masterful portrait of desire and betrayal during the sumptuous Golden Age of Old New York, a time when society people “dreaded scandal more than disease.”&&LBR&&R&&LBR&&RThis is Newland Archer’s world as he prepares to marry the beautiful but conventional May Welland. But when the mysterious Countess Ellen Olenska returns to New York after a disastrous marriage, Archer falls deeply in love with her. Torn between duty and passion, Archer struggles to make a decision that will either courageously define his life—or mercilessly destroy it.&&LBR&&R&&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R&&LSTRONG&&RMaureen Howard&&L/B&&R&&L/B&&R is a critic, teacher, and writer of fiction. Her seven novels include &&LI&&RBridgeport Bus&&L/I&&R, &&LI&&RNatural History&&L/I&&R, and &&LI&&RA Lover’s Almanac&&L/I&&R. Her memoir, &&LI&&RFacts of Life&&L/I&&R, won the National Book Critics’ Circle Award. She has taught at Yale and Columbia University.&&L/P&&R&&L/DIV&&R",
        "Category": " Fiction , Classics",
        "Publisher": "Barnes Noble Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Bush Pilots (The Epic of Flight)",
        "Authors": "By Seagrave, Sterling",
        "Description": "",
        "Category": "",
        "Publisher": "Time Life+ Books Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Beautiful Child",
        "Authors": "By Hayden, Torey L.",
        "Description": "From the bestselling author of One Child comes this amazing, true story of a mute and withdrawn seven—year—old girl and the special education teacher determined never to abandon a child in need.Seven-year-old Venus Fox never spoke, never listened, never even acknowledged the presence of another human being in the room with her. Yet an accidental playground “bump” would release a rage frightening to behold. The school year that followed would be one of the most trying, perplexing, and ultimately rewarding of Torey Hayden’s career, as she struggled to reach a silent child in obvious pain. It would be a strenuous journey beset by seemingly insurmountable obstacles and darkened by truly terrible revelations—yet encouraged by sometimes small, sometimes dazzling breakthroughs—as a dedicated teacher remained committed to helping a “hopeless” girl, and patiently and lovingly leading her toward the light of a new day.",
        "Category": " Psychology , Developmental , Child",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Medical Treason",
        "Authors": "By Strom-Paikin, Joyce E.",
        "Description": "The true story of addiction, crime, and corruption in the medical profession reveals such atrocities as drug-addicted doctors performing surgery, nurses who steal drugs and leave patients unmedicated, and more. Reprint.",
        "Category": " Health & Fitness , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Betty Crocker's Holiday Baking",
        "Authors": "By Crocker, Betty",
        "Description": "A collection of holiday recipes features chapters on brownies, bars, cakes, pies, tortes, tarts, creative cookies, festive breads, and other treats. Original.",
        "Category": " Cooking , Methods , Baking",
        "Publisher": "Betty Crocker",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Treasury of Christmas Crafts",
        "Authors": "By Berk, Ginger Kean",
        "Description": "",
        "Category": "",
        "Publisher": "Pubns Intl Ltd",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Repairing Furniture",
        "Authors": "By Time-Life Books",
        "Description": "Provides detailed instructions for regluing and refitting chair joints, repairing or patching damaged furniture surfaces, refinishing tables and chairs, replacing woven seats, and reupholstering couches and chairs",
        "Category": " Technology & Engineering , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "December",
            "Year": "1980"
        }
    }
]