[
    {
        "Title": "The Emperor's Children",
        "Authors": "By Messud, Claire",
        "Description": "From a writer “of near-miraculous perfection” (The New York Times Book Review) and “a literary intelligence far surpassing most other writers of her generation” (San Francisco Chronicle), The Emperor’s Children is a dazzling, masterful novel about the intersections in the lives of three friends, now on the cusp of their thirties, making their way—and not—in New York City.            There is beautiful, sophisticated Marina Thwaite—an “It” girl finishing her first book; the daughter of Murray Thwaite, celebrated intellectual and journalist—and her two closest friends from Brown, Danielle, a quietly appealing television producer, and Julius, a cash-strapped freelance critic. The delicious complications that arise among them become dangerous when Murray’s nephew, Frederick “Bootie” Tubb, an idealistic college dropout determined to make his mark, comes to town. As the skies darken, it is Bootie’s unexpected decisions—and their stunning, heartbreaking outcome—that will change each of their lives forever.            A richly drawn, brilliantly observed novel of fate and fortune—of innocence and experience, seduction and self-invention; of ambition, including literary ambition; of glamour, disaster, and promise—The Emperor’s Children is a tour de force that brings to life a city, a generation, and the way we live in this moment.",
        "Category": " Fiction , Literary",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The Mummy Case Mystery",
        "Authors": "By Morrah, Dermot",
        "Description": "Oxford professors Sargent and Considine investigate a disappearance at Beaufort College when fire destroys Professor Benchley's residence, along with the professor's newly acquired mummy, the late King Pepy I, but only one corpse is recovered at the scene",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Live Right 4 Your Type: 4 Blood Types, 4 Program -- The Individualized Prescription for Maximizing Health, Metabolism, and Vitality in Every Stage of Your Life (Eat Right 4 Your Type)",
        "Authors": "By Whitney, Catherine and D'Adamo, Peter J.",
        "Description": "From the doctor who brought us the blood-type health craze that has swept the nation, here is new research that shows you how to live according to your blood type so that you can achieve total physical and emotional well-being.Over a million readers have used the individualized blood-type diet solution developed by Dr. Peter J. D'Adamo to achieve their ideal weight. In the five years since the New York Times bestseller Eat Right 4 (for) Your Type was published, new research has indicated that there's a blood-type profile for almost every aspect of our lives, and thanks to that new research, your blood type reveals how you can live a better life. Live Right 4 (for) Your Type is Dr. D'Adamo's ground breaking book that will give you individualized prescriptions according to blood type.According to your blood type, should you:• Eat three regular meals a day, or small, frequent ones?• Have a regimented or flexible routine?• Go to sleep at the same time every night or have a flexible bedtime?• Do without rest periods or take them religiously?• Achieve emotional balance through exercise, meditation, or herbs?Each blood-type prescription is divided into five life areas. Recommendations, guidelines, and informational charts are provided for the following:• Lifestyle• Stress and Emotional Balance• Maximizing Health• Overcoming Disease• Strategies for AgingLive Right 4 (for) Your Type also has information compiled from new research that greatly expands on the information in Eat Right 4 (for) Your Type, featuring:• New metabolism-boosting supplement lists to increase the body's efficiency and ability to achieve ideal weight.• Refined food and supplement lists to increase cardiac efficiency, lower cholesterol, and strengthen your ability to fight colds, flu, and more serious diseases.• Instructions on how to use vegetables and herbs to improve Natural Killer Cell activity.• New information on blood type subgroups that influence not only weight, but also physical and mental health.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "China: A New History",
        "Authors": "By Fairbank, John King",
        "Description": "Recognized for decades as the West's doyen on China, John King Fairbank here offers the full and final expression of his lifelong engagement with this vast, ancient civilization. Fairbank's masterwork, China: A New History is without parallel as a concise, comprehensive, and authoritative account of China and its people over four millennia.Bringing to bear sixty years of research, travel, and teaching, Fairbank weaves a richly detailed history that reaches from China's neolithic days to its troubled present. With a deft hand, he depicts a country ever-changing and yet constant in its effort to achieve a cohesive identity, an enormous and enormously complex nation perpetually balancing between the imperatives of force and the power of ideas. Here are the Chinese autocrats in their various times and guises, maintaining Confucian civility and order through--paradoxically--the perpetual threat of irrational imperial violence. Here is the intellectual class, revered for its wisdom and counsel and yet--as events from the Cultural Revolution to the massacre in Tiananmen Square demonstrate--eminently expendable. And here are China's farmers engaged in a never-ending, backbreaking attempt to tame their temperamental countryside only to face repeated famine as China's agrarian-based economy fails to develop. At the center of all stands the Chinese family, until recently the model for both obedience and tyranny in society at large.Fairbank traces the growth of a civilization that could embrace so many contradictions and disruptions and yet retain a strong sense of its identity. Following China's ambivalent relations with the West and with the forces of modernization, he identifies, even in the great leap forward signaled by the Communist Revolution, the assumptions that have informed Chinese society for thousands of years.From the influences of Buddhism through the flowering of Song China to the reforms of Deng Xiaoping, this richly illustrated history unfolds in the wise yet often unconventional style that is quintessentially Fairbank: informal, witty, magisterial, and clear. Informed by the most recent scholarly research, this delicately nuanced and broadly interpretive introduction to the Chinese people and their past will enlighten both the novice and the seasoned China-watcher.",
        "Category": " History , Asia , China",
        "Publisher": "Belknap Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "The Last Girls: A Novel (Ballantine Reader's Circle)",
        "Authors": "By Smith, Lee",
        "Description": "On a beautiful June day in 1965, a dozen girls-classmates at a picturesque Blue Ridge women's college-launched their homemade raft (inspired by Huck Finn's) on a trip down the Mississippi. It's Girls A-Go-Go Down the Mississippi read the headline in the Paducah, Kentucky, paper.Thirty-five years later, four of those \"girls\" reunite to cruise the river again. This time it's on the luxury steamboat, The Belle of Natchez, and there's no publicity. This time, when they reach New Orleans, they'll give the river the ashes of a fifth rafter-beautiful Margaret (\"Baby\") Ballou.Revered for her powerful female characters, here Lee Smith tells a brilliantly authoritative story of how college pals who grew up in an era when they were still called \"girls\" have negotiated life as \"women.\" Harriet Holding is a hesitant teacher who has never married (she can't explain why, even to herself). Courtney Gray struggles to step away from her Southern Living-style life. Catherine Wilson, a sculptor, is suffocating in her happy third marriage. Anna Todd is a world-famous romance novelist escaping her own tragedies through her fiction. And finally there is Baby, the girl they come to bury-along with their memories of her rebellions and betrayals.THE LAST GIRLS is wonderful reading. It's also wonderfully revealing of women's lives-of the idea of romance, of the relevance of past to present, of memory and desire.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Everything Is Illuminated: A Novel",
        "Authors": "By Foer, Jonathan Safran",
        "Description": "With only a yellowing photograph in hand, a young man -- also named Jonathan Safran Foer -- sets out to find the woman who may or may not have saved his grandfather from the Nazis. Accompanied by an old man haunted by memories of the war; an amorous dog named Sammy Davis, Junior, Junior; and the unforgettable Alex, a young Ukrainian translator who speaks in a sublimely butchered English, Jonathan is led on a quixotic journey over a devastated landscape and into an unexpected past.",
        "Category": " Fiction , Literary",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Boomsday",
        "Authors": "By Buckley, Christopher",
        "Description": "In Boomsday, Christopher Buckley envisions the nation's next great brouhaha - generational warfare between profligate Baby Boomers and younger Americans who don't want to be stuck paying the bill, and how this conflict provokes the most outlandish presidential campaign in American history.Cassandra Devine, an idealistic, straight-A student was like any other seventeen year-old Yale hopeful until she learned that her father spent her tuition money on a dotcom start-up, and she would be forced to join the army.Ten years later, Cassandra has become a frustrated Washington spin doctor and devoted nighttime blogger who rails against the excesses of the \"Un-greatest\" generation and their negligent handling of the mounting Social Security debt. After she learns that her father has remarried and bought his dim-witted son's way into Yale, she politely suggests on her personal blog that Baby Boomers be given government incentives to kill themselves by age seventy-five.This modest proposal catches fire with millions of outraged citizens and an ambitious senator seeking the youth vote for his presidential bid. With the help of Washington's greatest PR strategist, Cassandra and the politician try to ride the issue of euthanasia for Boomers (they call it \"Transitioning\") all the way to the White House. Their opposition includes the president of the United States, who's running for reelection; a pro-life preacher, who may have killed his own mother in a mysterious automobile accident; and, of course, multitudes of Baby Boomers, who are deeply offended by demonstrations on the golf courses of their retirement resorts.",
        "Category": " Fiction , Political",
        "Publisher": "Twelve",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "The Client",
        "Authors": "By Grisham, John",
        "Description": "In the two years since The Firm first captured the imagination of America's readers, John Grisham, with three consecutive number-one bestsellers, has become one of the most popular authors of our time. Now, in The Client, he has written a novel so irresistible, so thoroughly entertaining and satisfying, that it is sure not only to please his millions of fans, but to win him new ones as well.This is the story of eleven-year-old Mark Sway, who, as the novel opens, witnesses the bizarre suicide of a New Orleans attorney. Just before he dies, the lawyer tells Mark a deadly secret concerning the recent murder of a Louisiana Senator, whose accused killer, Mafia thug Barry Muldanno, is about to go to trial. The police, the federal prosecutor and the FBI pressure Mark to tell them the attorney's last words, but he knows that with the mob watching his every move, revealing his secret will almost surely get him killed.So Mark, streetwise and old beyond his years, hires a lawyer: Reggie Love, a fifty-two-year-old divorcee who's been through more than anyone could imagine and survived, basically, because she's tough. And feisty. And loves helping kids overlooked or abused by the system. But when Mark's life is threatened, and Reggie discovers her office has been bugged, and even the Juvenile Court judge says Mark has no choice but to talk, she realizes that this time she's in way over her head. But then Mark comes up with a plan... a crazy plan, in Reggie's opinion, but it's their only hope. And it just might work.With the page-turning suspense and terrific plot twists that have become John Grisham's trademark, he has once again crafted a novel that simply cannot be put down. But in The Client Grisham has gone a step further - with a cast of unforgettable characters headed by the most original hero in years, he has mixed equal parts humor and warmth to truly expand the boundaries of the legal thriller.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "A Guide to Microsoft Office 2000 Professional",
        "Authors": "By brown, beth and Presley, Bruce (EDT)",
        "Description": "",
        "Category": " Computers , General",
        "Publisher": "Lawrenceville Pr",
        "Price Starting With ($)": "8.77",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Red Badge of Courage (Dover Thrift Editions)",
        "Authors": "By Crane, Stephen",
        "Description": "First published in 1895, this small masterpiece set the pattern for the treatment of war in modern fiction. The novel is told through the eyes of Henry Fleming, a young soldier caught up in an unnamed Civil War battle who is motivated not by the unselfish heroism of conventional war stories, but by fear, cowardice, and finally, egotism. However, in his struggle to find reality amid the nightmarish chaos of war, the young soldier also discovers courage, humility, and perhaps, wisdom. Although Crane had never been in battle before writing The Red Badge of Courage, the book was widely praised by experienced soldiers for its uncanny re-creation of the sights, sounds, and sense of actual combat. Its publication brought Crane immediate international fame and established him as a major American writer. Today, nearly a century later, the book ranks as an enduring landmark of American fiction.",
        "Category": " Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "Western Civilizations",
        "Authors": "By Lerner, Robert E., Meacham, Standish, Coffin, Judith G., Stacey, Robert C., Coffin, Judith G. (EDT), and Lerner, Robert E. (EDT)",
        "Description": "W. W. Norton & Company proudly announces an exciting revision of its best-selling Western Civilizations. Used successfully by well over 1,000,000 students, Western Civilizations is renowned for its balanced presentation, clear prose, and exceptional treatment of cultural history. New co-authors Judith Coffin (University of Texas, Austin) and Robert Stacey (University of Washington, Seattle) have reimagined these classic features for today's instructors and students. The new edition emphasizes the changing boundaries of traditional narratives by discussing the West in a wider world context and highlighting the diverse experiences of its peoples and states. Combined with an outstanding pedagogical program, an expanded website, and a new edition of the companion reader Perspectives from the Past, Western Civilzations offers the most complete and accessible package for students.",
        "Category": " History , World",
        "Publisher": "W W Norton & Co Inc (Np)",
        "Price Starting With ($)": "7.15",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Sign of the Unicorn (The Chronicles of Amber #3)",
        "Authors": "By Zelazny, Roger",
        "Description": "Accepting the responsibilities as ruler to the world of Amber, Corwin finds himself the target of sibling treachery, and must seek guidance in a land of visions, where a sinister prediction foretells his doom. Reissue.",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Diet for a New America",
        "Authors": "By Robbins, John",
        "Description": "Takes a hard look at the average American's diet and the health problems it causes, describes the methods used in raising and slaughtering animals for our meat and poultry, and suggests healthful alternatives",
        "Category": " Social Science , General",
        "Publisher": "Stillpoint Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "The Sacrifice (The Daughters of the Moon, No. 5)",
        "Authors": "By Ewing, Lynne",
        "Description": "Stanton is in love with Serena. But it is a relationship that can never be. Stanton is committed to the Atrox, an ancient evil that has been around since the beginning of time. And Serena is a Daughter of the Moon, a force of good whose mission is to stop Stanton and his kind.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Volo",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Second Chance (Left Behind: The Kids #2)",
        "Authors": "By LaHaye, Tim F. and Jenkins, Jerry B.",
        "Description": "This series is based on the best-selling adult Left Behind series. Readers will see the Rapture and Tribulation through the eyes of four kids who have been left behind.",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Leader of the Band (King Penguin)",
        "Authors": "By Weldon, Fay",
        "Description": "",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Wolf Stalker (Mysteries in Our National Park)",
        "Authors": "By Skurzynski, Gloria and Ferguson, Alane",
        "Description": "Twelve-year-old Jack, his sister, and the family's foster child Troy go to Yellowstone National Park, where Jack's mother, a wildlife veterinarian, is investigating the report that wolves reintroduced to the park have killed a dog there.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "National Geographic Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "I'm with Stupid: One Man. One Woman. 10,000 Years of Misunderstanding Between the Sexes Cleared Right Up",
        "Authors": "By Barreca, Regina, Thompson, Richard (ILT), Weingarten, Gene, and Barreca, Gina",
        "Description": "Is God male or female? Why do women, but not men, flush public toilets with their feet? Why are men, but not women, obsessed with parallel parking? Why do women, but not men, leave eleven-minute messages on answering machines? Why do men feel guilty about nothing, and women feel guilty about everything? Was Marilyn Monroe...fat?These philosophical quandaries, and more, are finally debated in I'm with Stupid, an uproariously funny dialogue between Gene Weingarten, the gleefully misogynistic Washington Post humor columnist, and Gina Barreca, the gleefully feminist University of Connecticut professor.The first significant book about men and women actually written by a man and a woman, I'm with Stupid is privy to the dark secrets of both sexes. It's not a lecture, but an extended argument, a combustion of viewpoints that winds up unearthing startling truths. In the words of Gene and Gina: \"Our Mars and Venus breach their orbits and collide in a screaming fireball from Hell.\"The subject matter spans art and expression, science and technology, politics and history, spirituality and religion, sex and sexuality, as well as the complex etiology, sociology, and etymology of dirty jokes. Men: Learn at last how to know for sure when you are having a fight. Women: Learn what he really means when he says \"I'm sorry.\" Take sides as Gene and Gina face off in a haggling challenge in which the winner manages to get the lowest price for a Mercedes S500. Or just take in the show.I'm with Stupid is the book that finally establishes, conclusively, that women are funnier than men. And vice versa.",
        "Category": " Social Science , Gender Studies",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "The Great East Coast Seafood Book",
        "Authors": "By Tarr, Yvonne",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Seafood",
        "Publisher": "Vintage Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1982"
        }
    },
    {
        "Title": "Sally's Christmas Miracle (Peanuts)",
        "Authors": "By Schulz, Charles M.",
        "Description": "Sally wants a Christmas tree, but has no idea how to cut one down, so when the perfect one falls down in her neighbor's yard, she is delighted, until the boy next door accuses her of stealing his tree.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "HarperCollins Children's Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Celebrating the Impressionist Table",
        "Authors": "By Todd, Pamela, Pickford, Louise, and Evans, Laurie",
        "Description": "The Impressionists were, for the most part, a gregarious crowd whose work bears witness to their insatiable and infectious appetite for life, food and friendship.Celebrating the Impressionist Table celebrates the travels, fetes and relationships of these friends against the backdrops of Normandy, Paris, the Seine, Brittany and Provence. Luminous canvases record the minutiae of domestic life - from exquisite still-lifes, to an idyllic picnic scene, or a beguiling table set for an open-air lunch - and provide an inspiring complement to one hundred beloved recipes. This timeless fare reflects regional specialties with a touch of the 19th century.This combination of text and recipes, illustrated by a feast of evocative paintings and specially commissioned photographs, adds up to a mouthwatering celebration of French regional cooking.",
        "Category": " Cooking , Regional & Ethnic , French",
        "Publisher": "Stewart Tabori & Chang",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Pilgrim Cat (Albert Whitman Prairie Books)",
        "Authors": "By Ettlinger, Doris (ILT) and Peacock, Carol Antoinette",
        "Description": "When young Pilgrim Faith Barrett discovers a stray cat on the Mayflower, she names her new friend Pounce. Together they face the long, cramped voyage and the perils of the first winter at the Plymouth colony.",
        "Category": " Juvenile Fiction , Historical , United States , Colonial & Revolutionary Periods",
        "Publisher": "Albert Whitman & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "A Fly Went by (Beginner Books(R))",
        "Authors": "By McClintock, Mike",
        "Description": "A fly is followed by a menagerie of characters in this humorous cumulative tale edited by Dr. Seuss. When a young boy sees a frantic fly buzzing past, he asks where the fly is headed—and with that, a chase begins. The fly and the frog, the cat and the dog, the pig and the cow, the fox and the hunter . . . who is causing all the fuss? A Fly Went By will have young readers buzzing with excitement! Originally created by Dr. Seuss, Beginner Books encourage children to read all by themselves, with simple words and illustrations that give clues to their meaning.\"The writing is merry and the pictures are real fun. Recommended.\"--School Library Journal.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1958"
        }
    },
    {
        "Title": "Five Silly Monkeys",
        "Authors": "By Haskamp, Steve",
        "Description": "Young readers may feel the raised faces of the monkeys bouncing on the bed as they count down from five to one. On board pages.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Piggy Toes Pr",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Funny Little Woman (Puffin Unicorn)",
        "Authors": "By Lent, Blair (ILT), Mosel, Arlene, and Hearn, Lafcadio",
        "Description": "In this Caldecott Medal-winning tale set in Old Japan, a lively little woman who loves to laugh pursues her runaway dumpling—and must outwit the wicked three-eyed oni when she lands in their clutches.   “The pictures are in perfect harmony with the humorous mood of the story. . . . It’s all done with a commendable amount of taste, imagination, and style.”—School Library Journal (starred review)   “A beautifully convincing tale.”—The New York Times Book Review   “Using elements of traditional Japanese art, the illustrator has made marvelously imaginative pictures.”—The Horn Book   “Lent’s pictures are a lively blend of finely detailed, delicate drawings and rip-roaring good humor.”—The Boston Globe   “A good read-aloud with lots of suspense.”—Learning   Awards: ALA Notable Children’s Book Child Study Association Book of the Year The Horn Book Fanfare",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Anthologies",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Horse Miracles",
        "Authors": "By Steiger, Brad and Steiger, Sherry Hansen",
        "Description": "",
        "Category": " Pets , General",
        "Publisher": "Miracles",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Mother Goose (Pictureback(R))",
        "Authors": "By Battaglia, Aurelius and Battaglia, Aurelius (ILT)",
        "Description": "The adventures of Simple Simon, Old King Cole, and other colorful characters are recreated in rhyme and pastel drawings",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1973"
        }
    },
    {
        "Title": "The Twelve Teas of Christmas",
        "Authors": "By Barnes, Emilie and Clough, Sandy Lynam (ILT)",
        "Description": "",
        "Category": " Religion , Holidays , General",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "A Katie Kazoo Christmas (Katie Kazoo, Switcheroo: Super Super Special)",
        "Authors": "By Krulik, Nancy E.",
        "Description": "Katie can’t wait for the holidays. There are so many things to look forward to! Her motorcycle-riding grandma is coming to visit, class 4A is having a Secret Santa grab bag, and it’s almost time for Cherrydale’s annual holiday lights display contest. But even the busy holiday season doesn’t stop the magic wind! Join Katie in these three separate holiday stories and find out how she handles the holiday hijinks!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Arthur's Christmas: An Arthur Adventure (Arthur Adventures (Paperback))",
        "Authors": "By Brown, Marc Tolon",
        "Description": "Arthur finds the spirit of Christmas when he makes the perfect gift for Santa in this holiday addition to the classic bestselling children's series.Christmas is only days away, and Arthur is taking his Christmas shopping for Santa very seriously. He wants his gift to be absolutely perfect, but with the clock ticking, he might need a little help from his sister, D.W., to make this the best Christmas ever.More than 5 million Arthur Adventure books sold!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "The Josefina Story Quilt (I Can Read Level 3)",
        "Authors": "By Degen, Bruce and Coerr, Eleanor",
        "Description": "California,here we come!Faith's Pa says there's no room on a wagon train for Josefina, a chicken who's too tough to eat and too old to lay eggs. But Faith loves her pet. Can Josefina show Pa that she still has a few surprises left in her?",
        "Category": " Juvenile Fiction , Readers , Intermediate",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "The Little Mouse, the Red Ripe Strawberry, and the Big Hungry Bear",
        "Authors": "By Wood, Don",
        "Description": "First published in 1984, a picture book in which the Little Mouse will do all he can to save his strawberry from the Big, Hungry Bear, even if it means sharing it with the reader. The Little Mouse and the Big Hungry Bear are known and loved by millions of children around the world. Little Mouse loves strawberries, but so does the bear… How will Little Mouse stop the bear from eating his freshly picked, red, ripe strawberry.",
        "Category": " Juvenile Fiction , Interactive Adventures",
        "Publisher": "Child's Play",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Counting Rhymes",
        "Authors": "By McKellar, Shona",
        "Description": "Traditional nursery rhymes, lively riddles, and contemporary verses by well-known poets teach children to count forward and backward, add, and subtract while being entertained.",
        "Category": " Juvenile Nonfiction , Social Science , General",
        "Publisher": "DK Preschool",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Nate the Great and the Snowy Trail",
        "Authors": "By Sharmat, Marjorie Weinman and Simont, Marc (ILT)",
        "Description": "Beginning readers are introduced to the detective mystery genre in these chapter books. Perfect for the Common Core, kids can problem-solve with Nate, using logical thinking to solve mysteries! Nate the Great has his work cut out for him. Rosamond has lost his birthday present! But how can Nate find his missing present when Rosamond won't tell him what it is?Check out the Fun Activities section in the back of the book! Visit Nate the Great and Sludge!NatetheGreatBooks.com“Brisk and bright as always, with pictures of a lovably scowling Nate and a voguishly strange Rosamond . . . for added appeal.”—Kirkus Reviews   “Readers will have a dandy time following the case and will sympathize with Nate’s wish that he had failed to solve it when he finds the dismaying ‘present’.”—Publishers Weekly   “The tongue-in-cheek mystery unfolds briskly. Simont's . . . cartoons are in tune with Sharmat’s comic touch.”—Booklist",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "A guide to physical examination",
        "Authors": "By Bates, Barbara",
        "Description": "",
        "Category": "",
        "Publisher": "Lippincott",
        "Price Starting With ($)": "8.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Persuasive Business Proposals: Writing to Win Customers, Clients, and Contracts",
        "Authors": "By Sant, Tom",
        "Description": "If you're involved in any kind of sales to other businesses or organizations, an entrepreneurial activity, or funded research, chances are that you find yourself writing proposals. Why? Because, these days, few business agreements, research grants, or government contracts are even considered without \"putting it in writing\" first. And you don't just want to be considered. You want to win.Persuasive Business Proposals provides a step-by-step process to help you organize, write, and deliver successful client proposals easily and inexpensively. Tom Sant's simple method will enable you to win contracts, sell projects, gain approval for new ideas, and build better relationships with the clients you already have. You'll learn how to use persuasion to great effect; organize your material and develop the proposal strategy; ensure every proposal is client-centered; create letter, formal, research, and grant proposals; and use automation to save time.Persuasive Business Proposals explains how to target key decisionmakers with language that is clear, effective, and credible. The book provides special writing suggestions, emphasizing word choice and sentence structure. You'll find numerous case studies and sample proposals from the author's work as a corporate writing consultant, which illustrate his advice and techniques. You'll even find a \"proposal writer's checklist\" to use to ensure that your proposal leaves nothing out.No business asset is more valuable than the ability to present your ideas clearly, effectively, and persuasively. \"A good proposal can be both useful to you and to your potential client,\" says the author. \"How useful it is depends on how carefully it's been designed, developed, and written. If you write a good proposal, you may win more than just a specific contract. You may win good will, respect, and credibility that will carry over into future business relations.\"",
        "Category": " Business & Economics , General",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Make Way for Lucia",
        "Authors": "By Benson, E. F.",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "7.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Avalanche Express",
        "Authors": "By Forbes, Colin",
        "Description": "When an unknown source, obviously high-up in the Politburo of the Soviet Union, sends word that his cover is blown, American intelligence launches an all-out attempt to rescue the man known only by his code name, Angelo",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1984"
        }
    },
    {
        "Title": "Jefferson's War: The Galactic Silver Star",
        "Authors": "By Randle, Kevin",
        "Description": "After surviving a suicide mission that he had been too afraid to refuse, David Jefferson is hailed for bravery, but he volunteers for the most dangerous combat mission in space, determined to earn the honor he was unduly accorded",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "The Songs of Distant Earth",
        "Authors": "By Clarke, Arthur C.",
        "Description": "From the New York Times bestselling author of the Space Odyssey series comes a dazzling adventure of exploration and paradise lost.   Just a few islands in a planetwide ocean, Thalassa was a veritable paradise—home to one of the small colonies founded centuries before by robot Mother Ships when the Sun had gone nova and mankind had fled Earth. Mesmerized by the beauty of Thalassa and overwhelmed by its vast resources, the colonists lived an idyllic existence, unaware of the monumental evolutionary event slowly taking place between their seas. . . . Then the Magellan arrived in orbit carrying one million refugees from the last, mad days on Earth. And suddenly uncertainty and change had come to the placid paradise that was Thalassa.",
        "Category": "",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "How Much Joy Can You Stand?: How to Push Past Your Fears and Create Your Dreams",
        "Authors": "By Falter-Barns, Suzanne",
        "Description": "",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Beyond Words Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Pasta Machine Cookbook (A Nitty Gritty Cookbook)",
        "Authors": "By German, Donna Rathmell",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Pasta",
        "Publisher": "Nitty Gritty Cookbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "One Little, Two Little, Three Little Pilgrims (Picture Puffin Books)",
        "Authors": "By Hennessy, B. G. and Cravath, Lynne Woodcock (ILT)",
        "Description": "Ten little Pilgrims and ten little Wampanoag boys and girls are getting ready for the harvest feast. In colonial Plimoth, the Pilgrims hunt ducks and geese and dig up turnips and carrots. In a nearby village, the Wampanoag dig for clams, fish for cod, and gather nuts and berries. Finally it’s time for the meal. First everyone gives thanks, then it’s time to eat and celebrate. The simple rhythmic text and autumn-colored illustrations are just right for practicing counting and sharing the history and fun of Thanksgiving with young children. “Cravath’s colorful pictures depict the busy activities in authentic detail.”—Booklist",
        "Category": " Juvenile Fiction , Historical , United States , Colonial & Revolutionary Periods",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Chinese Proverbs (Little Books Series)",
        "Authors": "By Tang, You-Shan (ILT) and McCunn, Ruthanne Lum",
        "Description": "",
        "Category": " Reference , Quotations",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Handy Religion Answer Book",
        "Authors": "By Renard, John",
        "Description": "",
        "Category": "",
        "Publisher": "Visible Ink",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Animals Should Definitely Not Wear Clothing",
        "Authors": "By Barrett, Ron (ILT) and Barrett, Judi",
        "Description": "Animals should definitely not wear clothing.  ...because a snake would lose it, a billy goat would eat it for lunch, and it would always be wet on a walrus! This well-loved book by Judi and Ron Barrett shows the very youngest why animals' clothing is perfect...just as it is.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Mother Goose (My First Treasury)",
        "Authors": "By Author Unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "I Know an Old Lady Who Swallowed a Fly",
        "Authors": "By Hoberman, Mary Ann and Westcott, Nadine Bernard (ILT)",
        "Description": "I know an old lady who swallowed a fly,I don't know why she swallowed a fly,Perhaps she'll die.So begins this well-loved, classic song. Now published for the first time in board book form with all new illustrations, this book is sure to delight a whole new audience: babies and toddlers.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "LB Kids",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Fortune Cookie Fortunes",
        "Authors": "By Lin, Grace",
        "Description": "Crack, crack, crack! The cookies snap open and the family&apos;s fortunes are revealed. Mei Mei wants to know how hers will come true. Jie Jie scoffs&apos;they never come true. But Pacy isn&apos;t so sure. As she waits and watches, she notices magical things happening in her family. Could the fortunes really be right? And what about Pacy&apos;s fortune: &apos;You will see the world in a new way&apos;? Well, yes, it&apos;s true! Pacy has been seeing the world through fortune cookies!This exhuberantly illustrated story about every kid&apos;s favorite part of a Chinese meal also includes a brief history of the fortune cookie.What will your fortune be? Crack! Open up a cookie and find out.",
        "Category": " Juvenile Fiction , People & Places , United States , Asian American",
        "Publisher": "Dragonfly Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Size 12 Is Not Fat: A Heather Wells Mystery (Heather Wells Mysteries, 1)",
        "Authors": "By Cabot, Meg",
        "Description": "Heather Wells Rocks!Or, at least, she did. That was before she left the pop-idol life behind after she gained a dress size or two -- and lost a boyfriend, a recording contract, and her life savings (when Mom took the money and ran off to Argentina). Now that the glamour and glory days of endless mall appearances are in the past, Heather's perfectly happy with her new size 12 shape (the average for the American woman!) and her new job as an assistant dorm director at one of New York's top colleges. That is, until the dead body of a female student from Heather's residence hall is discovered at the bottom of an elevator shaft.The cops and the college president are ready to chalk the death off as an accident, the result of reckless youthful mischief. But Heather knows teenage girls . . . and girls do not elevator surf. Yet no one wants to listen -- not the police, her colleagues, or the P.I. who owns the brownstone where she lives -- even when more students start turning up dead in equally ordinary and subtly sinister ways. So Heather makes the decision to take on yet another new career: as spunky girl detective!But her new job comes with few benefits, no cheering crowds, and lots of liabilities, some of them potentially fatal. And nothing ticks off a killer more than a portly ex-pop star who's sticking her nose where it doesn't belong . . .",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "This Woman Deserves a Party!",
        "Authors": "By Engelbreit, Mary and Bilsky, Terry Lee",
        "Description": "Illustrations and text depict the special joys of motherhood from pregnancy to the teenage years",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Celebrating Mothers: A Book of Appreciation",
        "Authors": "By Hale, Glorya (EDT) and Kelly-Gangi, Carol (EDT)",
        "Description": "\"I know how to do anything--I'm a mom.\"--Roseanne BarrThanks, Mom! From pregnancy and giving birth to raising a child: motherhood is among the most profound, life-changing experiences a woman can have. Celebrities, both male and female, pay tribute to their mothers' warmth, wisdom, humor, and strength; some even hold forth on the ticklish subject of the mother-in-law. Many women also share their own feelings and knowledge, offering a cradleful of advice on the seemingly endless quandary of how to balance career and family. From Lady Bird Johnson: \"Children are likely to live up to what you believe of them.\" Ralph Waldo Emerson amusingly notes, \"There never was a child so lovely but his mother was glad to get him asleep.\"  It's a valentine to all the women who take on this loving, lifelong role.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Metro Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "I Am a Bunny (A Golden Sturdy Book)",
        "Authors": "By Scarry, Richard (ILT) and Risom, Ole",
        "Description": "Cuddle up with Nicholas the bunny in Richard Scarry's beloved classic. I am a bunny. My name is Nicholas. I live in a hollow tree.In the spring, Nicholas picks flowers and chases butterflies, and in the summer, watches the frogs in the pond. In the autumn, he sees the animals preparing for the winter. When winter comes, Nicholas watches the snow falling from the sky, then curls up in his hollow tree and dreams about spring. In print for well over 50 years, this beautifully illustrated, gentle story has been a favorite Golden Book for generations.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Quiet Little Woman: Tilly's Christmas, Rosa's Tale : Three Enchanting Christmas Stories",
        "Authors": "By Alcott, Louisa May",
        "Description": "Three Christmas stories tell of an orphan who finds a new home, a little girl who rescues a bird, and a horse who shares her life story at midnight on Christmas Eve",
        "Category": " Fiction , Religious",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Ho Ho Ho, Ha Ha Ha: Holly-arious Christmas Knock-Knock Jokes (Lift-The-Flap Knock-Knock Book)",
        "Authors": "By Hall, Katy, Eisenberg, Lisa, and Carpenter, Stephen (ILT)",
        "Description": "There's snow better way to pass the time on a cold Christmas Eve than with fa-la-la-la-laughter!  Follow two children as they travel to the North Pole to find Santa himself, hoping he'll grant their Christmas wish.  Will they find him before he takes off in his sleigh?  Lift the flaps in this jolly joke book and find out.  Yule never laugh harder!Knock, knockWho's there?Gladys!Gladys who?Gladys Christmas.Aren't you?",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Christmas Cub, The (level 2) (Hello Reader)",
        "Authors": "By Fontes, Justine, Korman, Justine, and McQueen, Lucinda (ILT)",
        "Description": "A curious cub named Pip meets an evergreen tree that explains Christmas to him, and by celebrating the holiday together they create a new tradition.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Marilyn Monroe",
        "Authors": "By Anderson, Janice",
        "Description": "Contrasts the amazing career achievements and fame of one of America's most dazzling actresses to her strikingly different private life of loneliness and unfulfillment",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "A Pocket for Corduroy",
        "Authors": "By Freeman, Don",
        "Description": "This irresistible childhood classic is a delightful sequel to the original, well-loved tale Corduroy. This charming story takes readers into a multi-ethnic, urban neighborhood Laundromat, where Lisa's mother warns her to take everything out of her pockets before washing.Pockets! Corduroy doesn't have any pockets! The furry bear's search for a pocket of his own takes him on an adventure filled with the sights, sounds, smells and hazards of the Laundromat. As a result, Lisa and her beloved bear become separated as Corduroy ends up locked inside the Laundromat all night. And what do bears do all night in places like this? They ski in the soap flakes and nap in the baskets, of course!Fortunately, Lisa returns early the next morning to reclaim her tired little friend. Soon, Lisa is sewing Corduroy a pocket of his very own and again all is well in the life of Corduroy.\"This merry tale gets added interest from...the setting, a multi-ethnic urban neighborhood, of cuddly Corduroy and his pal Lisa, a black child, and her attractive mother.\" — Publishers Weekly.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "INGRAM BOOK & DISTRIBUTOR",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Bachelor's Children A Synopsis of the Radio Program",
        "Authors": "By Bess FLYNN",
        "Description": "",
        "Category": "",
        "Publisher": "Old Dutch Cleanser",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1939"
        }
    },
    {
        "Title": "Upon This Rock: The Life of St. Peter",
        "Authors": "By Murphy, Walter F.",
        "Description": "From the Mount of Olives to the road to Rome, this dramatic saga, based on the life of St. Peter, offers a passionate and provocative profile of the man whom Jesus chose to found his church",
        "Category": " Fiction , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "5.13",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Millicent Min, Girl Genius (Sid Fleischman Humor Award (Awards))",
        "Authors": "By Yee, Lisa",
        "Description": "Who would have thought being smart could be so hard (and so funny)?Millicent Kwan is having a bad summer. Her fellow high school students hate her for setting the curve. Her fellow 11-year-olds hate her for going to high school. And her mother has arranged for her to tutor Stanford Wong, the poster boy for Chinese geekdom. But then Millie meets Emily. Emily doesn't know Millicent's IQ score. She actually thinks Millie is cool. And if Millie can hide her awards, ignore her grandmother's advice, swear her parents to silence, blackmail Stanford, and keep all her lies straight, she just might make her first friend.     What's it going to take? Sheer genius.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Arthur A. Levine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "On Writing Well: An Informal Guide to Writing Nonfiction",
        "Authors": "By Zinsser, William Knowlton",
        "Description": "",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Harpercollins College Div",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "Sniper",
        "Authors": "By Taylor, Theodore",
        "Description": "A Killer Stalks The NightThe canyon is dark. Pitch dark. It is quiet. Deathly quiet, except for the howl of distanct coyotes and the occasional roar of one of the big cats. Fifteen-year-old Ben has been left in charge of the family's California wild animal preserve while his parents are in Africa.Suddenly the silence of the night is broken by screaming peacocks. Someone is out there. Someone with a score to settle. And tonight is only the beginning...",
        "Category": "",
        "Publisher": "HarperTrophy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Pilates on the Ball: The World's Most Popular Workout Using the Exercise Ball",
        "Authors": "By Craig, Colleen",
        "Description": "A unique and exciting synthesis of two highly acclaimed fitness techniques: Pilates Method and the Swiss exercise ball.• Non-impact Pilates exercises on the ball can be adapted for all levels of ability, from fitness trainers and weekend athletes to those healing from injury or chronic back pain. • Shows how to practice Pilates techniques without expensive equipment.• Profusely illustrated with black-and-white photographs for maximal learning.The Pilates Method of body conditioning is a highly effective workout technique that strengthens the body while engaging the mind. Developed in the early twentieth century by accomplished boxer and gymnast Joseph Pilates, the Pilates Method aligns the body; builds long, lean muscles; and develops core abdominal strength. Many lifestyle and fitness magazines have named Pilates the hottest workout of the decade. In a first-of-its-kind fusion, Pilates on the Ball merges the principles and exercises of the highly effective Pilates Method of body conditioning with the unique functions of the exercise ball, used by Olympic coaches, dancers, and athletes to fine-tune body awareness and enhance physical performance. The ball magnifies the benefits of the carefully developed and refined Pilates Method. Because maintaining balance on the ball recruits the deep, stabilizing muscles of the spine, the postural muscles are strengthened. The ball intensifies athletic performance by increasing resistance and heightening awareness of how the body moves in space. Chapters detail the Pilates principles step by step, with successive movements to challenge all levels of ability and \"watch points\" for careful evaluation of your form. Intense enough to engage seasoned athletes yet accessible enough to use as an everyday exercise routine or to alleviate chronic pain, Pilates on the Ball builds strong bodies and engaged minds.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Healing Arts Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Pirates & Buccaneers Coloring Book (Dover History Coloring Book)",
        "Authors": "By Copeland, Peter F.",
        "Description": "Come aboard to join sailors in the shadow of the Jolly Roger — rogues, rebels, and daredevil adventurers of the high seas! Ferocious, authentically drawn pirates from many countries await your colors in this swashbuckling coloring book: Khaired-Din Barbarossa, Henry Morgan, Bartolomew Portugues, Captain John Avery, Pierre Le Grand, Jean Bart, Captain William Kidd, Edward Teach (alias \"Blackbeard\"), Anne Bonny and Mary Read, Captain Bartholomew Roberts, \"Calico Jack\" Rackham, Gustavus Conyngham, Jean Lafitte, and many others.",
        "Category": " Juvenile Nonfiction , Activity Books",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "The Blonde: An Illustrated History of the Golden Era from Harlow to Monroe",
        "Authors": "By Conrad, Barnaby",
        "Description": "",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "34.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Humorous Stories and Sketches (Dover Thrift Editions)",
        "Authors": "By Twain, Mark and Smith, Philip",
        "Description": "Mark Twain's inimitable blend of humor, satire, and masterly storytelling earned him a secure place in the front rank of American writers. This collection of eight stories and sketches, among them the celebrated classic \"The Notorious Jumping Frog of Calaveras County,\" shows the great humorist at the top of his form. Also included here are \"Journalism in Tennessee,\" in which a novice newspaperman is shown the \"correct way\" to report a news story; \"About Barbers,\" a delightful account of every barbershop customer's worst fear; \"Fenimore Cooper's Literary Offenses,\" Twain's hilarious savaging of that author's style; and four more: \"A Literary Nightmare,\" \"The Stolen White Elephant,\" \"The Private History of a Campaign that Failed,\" and \"How to Tell a Story.\" Delightfully entertaining, these charming pieces will find an appreciative audience among students, general readers, and lovers of classic American humor.",
        "Category": " Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "From Williamsburg kitchens",
        "Authors": "By Gaertner, Carolyn",
        "Description": "",
        "Category": "",
        "Publisher": "Bicast Pub. Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The bad Popes",
        "Authors": "By Chamberlain, E. R.",
        "Description": "Let yourself be swept up by this colorful, panoramic story of seven men who ruled the Church of Rome at seven critical periods in the 600 years leading up to the Reformation. During this age of grandeur and corruption, popes led armies, made love and war, conspired for power, and armed themselves with the techniques of assassination and seduction while clothed with the authority of the Church. Dramatic accounts of these papal bad boys include: Urban VI, the wild man from Naples, whose grotesque savageries widened and maintained the scandalous gap of the Great Schism; Alexander VI, who brought to the See of Peter the intrigues of the Borgia; and Clement VII, the unskillful fox, whose fall brought down Rome itself. Profusely illustrated with architectural photographs and contemporary art from both Catholic and Protestant sources, this absorbing work vividly depicts the ecclesiastical corruptions which changed the course of history.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Dorset Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Aesop's Fables (Barnes & Noble Classics Series)",
        "Authors": "By Aesop (EDT), Ashliman, D. L. (EDT), and Rackham, Arthur (EDT)",
        "Description": "&&LDIV&&R&&LDIV&&R&&LI&&RAesop's Fables&&L/I&&R, by &&LB&&RAesop&&L/B&&R, is part of the &&LI&&R&&LI&&RBarnes & Noble Classics&&L/I&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&L/DIV&&R&&LDIV&&R &&L/DIV&&R&&LDIV&&RAs legend has it, the storyteller &&LB&&RAesop&&L/B&&R was a slave who lived in ancient Greece during the sixth century B.C. His memorable, recountable fables have brought amusing characters to life and driven home thought-provoking morals for generations of listeners and modern-day readers. Translated into countless languages and familiar to people around the world, Aesop’s fables never tarnish despite being told again and again. &&LP&&RThis collection presents nearly 300 of Aesop’s most entertaining and enduring stories—from “The Hare and the Tortoise” and “The Town Mouse and the Country Mouse” to “The Goose That Laid the Golden Eggs” and “The Wolf in Sheep’s Clothing.” Populated by a colorful array of animal characters who personify every imaginable human type—from fiddling grasshoppers and diligent ants to sly foxes, wicked wolves, brave mice, and grateful lions—these timeless tales are as fresh and relevant today as when they were first created. &&LP&&RFull of humor, insight, and wit, the tales in Aesop’s Fables champion the value of hard work and perseverance, compassion for others, and honesty. They are age-old wisdom in a delicious form, for the consumption of adults and children alike.&&L/P&&R&&LDIV&&R&&LB&&RD. L. Ashliman&&L/B&&R is emeritus professor at the University of Pittsburgh. He taught folklore, mythology, German, and comparative literature at that institution for thirty-one years. He has also served as guest professor at the University of Augsburg in Germany.&&L/DIV&&R&&L/DIV&&R",
        "Category": " Juvenile Fiction , Legends, Myths, Fables , General",
        "Publisher": "Sterling Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Boundaries: Where You End and I Begin (Fireside / Parkside Recovery Book)",
        "Authors": "By Katherine, Anne",
        "Description": "Are Your Boundaries Being Violated?  Boundaries separate us from others physically and emotionally. In fact, they are essential for our mental and physical health as well as for developing healthy relationships. Yet every day, people's boundaries are violated by friends, family, or coworkers. Despite the importance of personal boundaries many people are unaware of how or when these very important lines are crossed.  Which of the following are boundary violations? Esther tells Betty a secret Mary told her. Your therapist invites you to go for coffee. Your boss wants to know the details of your personal life. Your boss asks you if you'd like a hug. Mom tells little Debbie about her troubles with Dad. Your new neighbor pats you on the bottom as he turns away. Your mother makes a comment about your being overweight.  All but one of the above incidents violate boundaries (your boss asks you if you'd like a hug). In Boundaries: Where You End and I Begin, Anne Katherine explains what healthy boundaries are, how to recognize if your personal boundaries are being violated, and what you can do to protect yourself.  For anyone who has walked away from a conversation, a meeting, or a visit with others feeling violated and not understanding why, this is a book that can help.",
        "Category": " Psychology , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Pudd'nhead Wilson (Bantam Classics)",
        "Authors": "By Twain, Mark",
        "Description": "At the beginning of Pudd'nhead Wilson a young slave woman, fearing for her infant's son's life, exchanges her light-skinned child with her master's.  From this rather simple premise Mark Twain fashioned one of his most entertaining, funny, yet biting novels.  On its surface, Pudd'nhead Wilson possesses all the elements of an engrossing nineteenth-century mystery:  reversed identities, a horrible crime, an eccentric detective, a suspenseful courtroom drama, and a surprising, unusual solution.  Yet it is not a mystery novel.  Seething with the undercurrents of antebellum southern culture, the book is a savage indictment in which the real criminal is society, and racial prejudice and slavery are the crimes.  Written in 1894, Pudd'nhead Wilson glistens with characteristic Twain humor, with suspense, and with pointed irony:  a gem among the author's later works.",
        "Category": "",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "Tough Times Never Last, But Tough People Do!",
        "Authors": "By Schuller, Robert Harold",
        "Description": "Name your problem, and you name your possibility! Dr. Schuller shows you how to build a positive self-image, no matter what  your problem. Whether it's unemployment, poor  health, loneliness, fear or anything  else that blocks your success, you can turn your negative into a positive. No matter how tough  times get, you have the potential to achieve the best of life. Through Dr. Schuller’s dynamic principles, you can learn:• 4 ways to evaluate a  new idea • 10 commandments of possibility thinking  • 5 principles for putting problems in a proper  perspective • 18 principles of leadership • 5 phases  necessary for the faith to move mountains • 5 ways  to overcome a ‘brownout’ and prevent a burnout •  25 action words to get you started and never let  you quit",
        "Category": "",
        "Publisher": "BANTAM",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Child Lures: What Every Parent and Child Should Know About Preventing Sexual Abuse and Abduction",
        "Authors": "By Wooden, Kenneth",
        "Description": "",
        "Category": " Self-help , Abuse",
        "Publisher": "The Summit Publishing Group",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Triumph Over Darkness: Understanding and Healing the Trauma of Childhood Sexual Abuse",
        "Authors": "By Wood, Wendy Ann",
        "Description": "This collection of prose and therapeutic insights creates a powerful commentary on incest, rape, abuse, and the recovery process.     Women and men share their personal experiences of childhood abuse and walk with the reader along the path toward wellness. They reflect each stage of healing with a clarity that, while often painful, is also hopeful.     Addressing various aspects of abuse, including ritualistic abuse, multiple personality disorder, and partnering as well as providing a therapist's insights on the stages of healing, Triumph Over Darkness helps readers to understand recovery as a predictable process and see that healing is possible.",
        "Category": " Psychology , Developmental , Adulthood & Aging",
        "Publisher": "Beyond Words",
        "Price Starting With ($)": "9.1",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Words of Courage & Confidence",
        "Authors": "By Sue Patton Thoele",
        "Description": "",
        "Category": "",
        "Publisher": "MJF Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Queen of Spades and Other Stories (Dover Thrift Editions)",
        "Authors": "By Pushkin, Aleksandr Sergeevich and Keane, T.",
        "Description": "Alexander Pushkin (1799-1837), Russia’s greatest poet and a versatile writer whose great gifts and profoundly Russian sensibility influenced all of modern Russian literature, produced short stories that are masterpieces of the craft.Besides the brilliant title story, a cunningly wrought narrative of romance and murder in the haute bourgeoisie of St. Petersburg, this volume includes all five stories originally collected as The Tales of the Late P. Belkin. These include \"An Amateur Peasant Girl,\" \"The Shot,\" \"The Snowstorm,\" \"The Postmaster,\" and \"The Coffin-Maker.\"",
        "Category": " Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "The Suicide Club (Dover Thrift Editions)",
        "Authors": "By Stevenson, Robert Louis",
        "Description": "A generous and remarkable young prince, together with his loyal and brave servant, find more adventure than they bargained for in The Suicide Club, Robert Louis Stevenson's engrossing trilogy of short stories about a bizarre club for people with a strong desire to end their lives.In these interrelated tales, Prince Florizel of Bohemia and his aide, Colonel Geraldine, travel incognito through some of the most dangerous haunts of 19th-century London. \"The Story of the Young Man with the Cream Tarts\" introduces Florizel to the formidable Suicide Club, an organization for people who wish to end their lives, but don't have the courage to accomplish the act themselves. The \"Story of the Physician and the Saratoga Trunk\" reveals the grim contents of a large piece of luggage that travels hundreds of miles to its final destination; and in \"The Adventure of the Hansom Cab,\" a bloody resolution seals the fate of a notorious and elusive assassin.Brimming with heart-stopping drama, this rare, lesser-known work by a master storyteller will appeal to a wide circle of readers, including fans of the great 19th-century English writer as well as lovers of a good mystery story.",
        "Category": " Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Uncle Vanya (Dover Thrift Editions)",
        "Authors": "By Chekhov, Anton Pavlovich",
        "Description": "First produced by the Moscow Art Theater in 1899, Uncle Vanya is one of Chekhov's greatest plays and a staple of the theatrical repertoire. Both structurally and psychologically compact, it is among the most expressive of the Russian playwright's dramatic works.Set on an estate in nineteenth-century Russia, this deeply emotional tale of misplaced idealism and unrequited love concerns the complex interrelationships between a retired professor, his second wife, and his brother-in-law and daughter from a previous marriage. In deceptively mundane dialogue, the characters reveal their private tragedies — weakness and inability to communicate — the failures that lead them to lives of frustration and despair. Nevertheless, Chekhov's delineation of human frailties elicits sympathy for even the most irresolute and deluded characters, and the play's underlying message is one of courage and hope.Essential reading for any course in modern theater, this absorbing play continues to be popular. Students, theatergoers, and all lovers of great drama will appreciate this inexpensive edition of a masterpiece.",
        "Category": " Drama , Russian & Former Soviet Union",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "101 American English Idioms: Understanding and Speaking English Like an American",
        "Authors": "By Collis, Harry",
        "Description": "",
        "Category": " Foreign Language Study , English as a Second Language",
        "Publisher": "Natl Textbook Co Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "Tomas and the Library Lady (Dragonfly Books)",
        "Authors": "By Mora, Pat and Colon, Raul (ILT)",
        "Description": "A Common Core Exemplar Text by an award-winning author-illustrator teamTomás is a son of migrant workers. Every summer he and his family follow the crops north from Texas to Iowa, spending long, arduous days in the fields. At night they gather around to hear Grandfather's wonderful stories. But before long, Tomás knows all the stories by heart. \"There are more stories in the library,\"Papa Grande tells him.  The very next day, Tomás meets the library lady and a whole new world opens up for him. Based on the true story of the Mexican-American author and educator Tomás Rivera, a child of migrant workers who went on to become the first minority Chancellor in the University of California system, this inspirational story suggests what libraries--and education--can make possible.  Raul Colón's warm, expressive paintings perfectly interweave the harsh realities of Tomás's life, the joyful imaginings he finds in books, and his special relationships with a wise grandfather and a caring librarian.  \"A gentle text and innovative artwork. . . . While young readers and future librarians will find this an inspiring tale, the end note gives it a real kick: the story is based on an actual migrant worker [Tomás Rivera] who became chancellor of a university--where the library now bears his name.\"--Publishers Weekly",
        "Category": " Juvenile Nonfiction , School & Education",
        "Publisher": "Dragonfly Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Being There",
        "Authors": "By Kosinski, Jerzy N.",
        "Description": "",
        "Category": "",
        "Publisher": "BANTAM",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "A to Z",
        "Authors": "By Boynton, Sandra",
        "Description": "From A to Z, the alphabet gets a seriously silly twist in this Sandra Boynton classic.Serious silliness for all ages. Artist Sandra Boynton is back and better than ever with completely redrawn versions of her multi-million selling board books. These whimsical and hilarious books, featuring nontraditional texts and her famous animal characters, have been printed on thick board pages, and are sure to educate and entertain children of all ages.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Boynton Bookworks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "A Remarkable Medicine has been Overlooked",
        "Authors": "By Jack Dreyfus",
        "Description": "",
        "Category": "",
        "Publisher": "Dreyfus Medical Foundation",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Death on the Agenda",
        "Authors": "By Moyes, Patricia",
        "Description": "Representing Britain at an international conference on drug smuggling, Inspector Henry Tibbett must investigate the fatal stabbing of an important conference official",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "Falconer's Judgement (A William Falconer Medieval Mystery)",
        "Authors": "By MORSON, IAN",
        "Description": "In Rome, Pope Alexander IV lies dying. From the East, an assassin is sent by a powerful royal family. In Wallingford Castle a young man is held prisoner, charged with a murder he did not commit...In the swirling mists of Oxford, Regent Master William Falconer, Aristotelian philosopher and amateur sleuth, searches for the whereabouts of his mentor, Roger Bacon. But a political intrigue is about to explode. The Papal Legate's brother-a master cook-is killed with an arrow during a student riot. While authorities crack down on the disorder and zealots warn of the Apocalypse, Falconer begins an investigation. Now the man of reason must enter a labyrinth or madness-where ambition, deceit, and murder are the order of the day.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Psalms Now",
        "Authors": "By Brandt, Leslie F.",
        "Description": "A Lutheran pastor presents prayers and meditations based on the Old Testament Psalms",
        "Category": "",
        "Publisher": "Concordia Publishing@house",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1973"
        }
    },
    {
        "Title": "On being a Christian",
        "Authors": "By K-Ung, Hans",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Ethical Issues in Scientific Research: An Anthology (GARLAND STUDIES IN APPLIED ETHICS, VOL 2)",
        "Authors": "By Erwin, Edward, Gendin, Sidney, and Kleiman, Lowell (EDT)",
        "Description": "First published in 1994. Routledge is an imprint of Taylor & Francis, an informa company.",
        "Category": " Medical , Ethics",
        "Publisher": "Garland Publishing Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Gates: How Microsoft's Mogul Reinvented an Industry--and Made Himself the Richest Man in America",
        "Authors": "By Manes, Stephen and Andrews, Paul",
        "Description": "Gates reveals the guiding genius behind the unparalleled success of the Microsoft Corporation-- the biggest and most profitable personal computer software company in history-- and exposes the intensely competitive tactics that help it dominate the desktops of America. Chairman and co-founder of Microsoft, Bill Gates is the most powerful person in the computer industry and the youngest self-made billionaire in history. His company's DOS and Windows programs are such universal standards that more than nine out of ten personal computers depend on Microsoft software. Under the \"Microsoft Everywhere\" rallying cry, Gates intends to expand his company's worldwide dominance to office equipment, communications, and home entertainment. Vivid and definitive, Gates details the behind the scenes history of the personal computer industry and its movers and shakers, from Apple to IBM, from Steve Jobs to Ross Perot. Uncovering the inside stories of the bitter battle for control of the expanding personal computing market, Gates is a bracing, comprehensive portrait of the industry, the company, and the man-- and what they mean for a future where software is everything.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Amoskeag: Life and Work in an American Factory-City (Library of New England)",
        "Authors": "By Hareven, Tamara K. and Langenbach, Randolph",
        "Description": "First published in 1978, this classic book, through vivid oral histories and historic photographs, documents the social and cultural impact of the industry during America’s rise as a manufacturing power. For nearly a century, the Amoskeag Manufacturing Company was chief architect of the social, ethnic, and economic existence of Manchester, New Hampshire. In the early 1900s, it was the largest textile mill in the world, employing 17,000; its red brick facade stretched for nearly a mile along the Merrimack River and its payroll drew immigrants by the thousands. In their own words, laborers, foremen, managers, and town residents paint a detailed portrait of the mill’s nearly feudal dominance of every aspect of their lives and offer their response to this existence, with fierce pride and an unshakable sense of community. When competition, labor unrest, and obsolescence caught up with the mill in 1936, a weaver recalls, “the mills went out and the world stopped for everybody.”",
        "Category": " Social Science , Sociology , General",
        "Publisher": "University Press of New England",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "What Shape Is She In?: Guide to Surveying of Boats",
        "Authors": "By Vaitses, Alan",
        "Description": "Tells how to inspect a boat for necessary repairs, describes common problems, and also discusses the engine and electrical system",
        "Category": " Technology & Engineering , General",
        "Publisher": "Intl Marine Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "Mouse in the House",
        "Authors": "By Henrietta",
        "Description": "Somewhere there's a mouse in the house. Her name is Henrietta, and all you have to do is find her! Is she hiding among the cake and cookies...leaving a trail of crumbs? Where do those paw prints lead? Read Henrietta's story aloud and follow the antics of this mischievous mouse. Search for Henrietta, hidden among the objects in each room. Watch out! There are lots of look-alike mice...but only one Henrietta.",
        "Category": " Juvenile Nonfiction , Readers , Beginner",
        "Publisher": "DK Children",
        "Price Starting With ($)": "6.19",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Remember Pearl Harbor: American and Japanese Survivors Tell Their Stories",
        "Authors": "By Allen, Thomas B. and Ballard, Robert D. (FRW)",
        "Description": "This landmark volume will provide young readers with valuable insights into both the Japanese and American points of view and demonstrate why people on both sides feel the need to remember Pearl Harbor.     Many people today still remember the infamous morning of December 7, 1941. Compelling narrative laced with first-person accounts from both American and Japanese survivors combines with dramatic archival images and a brief overview to paint a vivid portrait of what it was like to have witnessed, participated in, and lived through the surprise attack on Pearl Harbor.From the Trade Paperback edition.",
        "Category": " Juvenile Nonfiction , History , United States , 20th Century",
        "Publisher": "National Geographic Children's Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Mark Twain: His Words, Wit, and Wisdom",
        "Authors": "By Twain, Mark and Rasmussen, R. Kent (EDT)",
        "Description": "Over 1,800 quips and quotes from an icon of American literature, on a variety of subjects from accidents to youth, and many in-between.  All the humor, irreverence, and insight that were uniquely Twain come alive, enhanced by charming black and white line drawings.  Also included is a chronology o Twain's life.",
        "Category": " Reference , Quotations",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Encyclopedia of Judaism",
        "Authors": "By Wigoder, Geoffrey (EDT)",
        "Description": "Fifteen hundred specially commissioned articles cover Jewish history and culture, including festivals, rituals, important individuals of the past, and prominent synagogues",
        "Category": " Religion , General",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "9.4",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "The Three Billy Goats Gruff (Paul Galdone Nursery Classic)",
        "Authors": "By Galdone, Paul",
        "Description": "Three innocent billy goats meet an ugly troll with a blue nose and yellow teeth while crossing a bridge to reach a meadow full of tempting grass",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1981"
        }
    },
    {
        "Title": "A Book of Princesses",
        "Authors": "By Gardner, Sally",
        "Description": "Cinderella, Snow White, Sleeping Beauty, The Frog Prince, and The Princess and the Pea are the five most beloved princess stories in all of children's literature. In these fresh retellings, just right for reading aloud, the magic of the tales combines with the charm of the illustrations to delight anyone who loves a princess.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Anthologies",
        "Publisher": "Orion Children's Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The Gardener's Handbook: The Essential Guide for Success With Plants",
        "Authors": "By Buczacki, Stefan, Paul, Tessa, and Chadwick, Nigel",
        "Description": "A compact, nicely illustrated guide, with plenty of good information and inspiration for both beginning and experienced gardeners. The author is a British gardening expert known for his presentations on BBC radio. Measurements are both US and metric. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Gardening , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Everything You Know is Wrong",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    }
]