[
    {
        "Title": "Barbie of Swan Lake (Picture Book)",
        "Authors": "By Lesser, Elana, Spector, Joel, and Spector, Joel (ILT)",
        "Description": "In a storybook version of the new Barbie video, beautiful Odette is led into an enchanted forest where she is turned into a swan by the evil wizard, Rothbart, who is determined to destroy the forest and all of its creatures.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Country & Ethnic",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Concise Oxford Dictionary of Quotations (Oxford Quick Reference)",
        "Authors": "By Simpson, J. A.",
        "Description": "The new edition of The Concise Oxford Dictionary of Quotations, drawn from the third edition of the best-selling Oxford Dictionary of Quotations, is a collection of 5800 well-known quotations by 1100 authors. Ranging in time from the eighth century BC to the 1970s and in space from Russia to South Africa, it provides excellent browsing among a varied company of authors and includes a generous index to guide the reader to a particular quote or selection of quotes.",
        "Category": " Reference , Quotations",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Kodak Guide to Shooting Great Travel Pictures : The Most Authoritative Guide to Travel Photography for Vacationers",
        "Authors": "By Wignall, Jeff, Karnow, Catherine (PHT), Guttman, Peter (PHT), and Norton, Boyd (PHT)",
        "Description": "KodakThe Most Authoritative Guide to Travel Photography For Vacationers\"Absolutely one of the nicest, most complete guides to creative photography that we've seen.\" -- Outdoor Photographer\"Next trip, invest in [this book]...it offers practical, clear picture-taking advice.\" -- CosmopolitanThis full-color guide is packed with easy tips and foolproof ideas from the pros. It will show you how to get the very best photographs on your vacation, whether you use a point-and-shoot camera or a single-lens reflex, an APS, or a digital camera. As Jeff Wignall explains approaches and essential techniques, terrific photos from Kodak's extensive archives illustrate every important point.  In special six-page albums, three distinguished travel photographers, Peter Guttman, Catherine Karnow, and Boyd Norton, give you in-depth looks at shooting portraits, keeping a travel journal, and capturing wildlife on film.",
        "Category": " Photography , Subjects & Themes , General",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "A Writer's Reference (Internet Edition)",
        "Authors": "By Hacker, Diana",
        "Description": "",
        "Category": "",
        "Publisher": "Bedford/St. Martin's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Walt Disney Story of Mickey Mouse",
        "Authors": "By Disney, Walt",
        "Description": "",
        "Category": "",
        "Publisher": "Whitman",
        "Price Starting With ($)": "19.25",
        "Publish Date": {
            "Month": "January",
            "Year": "1938"
        }
    },
    {
        "Title": "Adventures of Tom Sawyer A Facsimile of the Author's Holograph Manuscript",
        "Authors": "By Twain, Mark",
        "Description": "",
        "Category": "",
        "Publisher": "University Publications of America Georgetown University Library",
        "Price Starting With ($)": "53.57",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Little Mr. Thimblefinger and His Queer Country, What the Children Saw and Heard There",
        "Authors": "By Harris, Joel Chandler",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "10.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1922"
        }
    },
    {
        "Title": "Managing Anger: Methods for a Happier and Healthier Life (Crisp Fifty-Minute Books)",
        "Authors": "By Wolfe, Rebecca Luhn and Luhn, Rebecca R.",
        "Description": "The most successful people know how to manage their anger as well as the anger of others.",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "Crisp Pub Inc",
        "Price Starting With ($)": "8.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Essentials of Systems Analysis and Design",
        "Authors": "By Hoffer, Jeffrey A., George, Joey F., and Valacich, Joseph S.",
        "Description": "",
        "Category": " Computers , Management Information Systems",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "A Prayerbook for Husbands and Wives: Partners in Prayer",
        "Authors": "By Wangerin, Walter and Wangerin, Ruth",
        "Description": "",
        "Category": " Religion , Prayerbooks , General",
        "Publisher": "Augsburg Fortress Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "12,000 Religious Quotations",
        "Authors": "By Mead, Frank S. (EDT)",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Counted Cross Stitch Designs for the Home",
        "Authors": "By Lindberg, Jana Hauschild",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Applications Programming in ANSI C",
        "Authors": "By Johnsonbaugh, Richard and Kalin, Martin",
        "Description": "",
        "Category": " Computers , Programming Languages , C",
        "Publisher": "Macmillan Coll Div",
        "Price Starting With ($)": "6.58",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Command Performance: An Actress In The Theater Of Politics",
        "Authors": "By Alexander, Jane",
        "Description": "Jane Alexander had never been involved in mainstream politics and was happily engaged in her acting career when she was asked to consider becoming head of the embattled National Endowment for the Arts in the early 1990s. When, during her first visit to the Hill, Senator Strom Thurmond barked at her, \"You gonna fund pornography?\" she knew it would be a rough ride. Nothing had quite prepared her for the role of madame chairman. Her tenure coincided with the ascent of the infamous 104th Congress, presided over by Speaker Newt Gingrich, and its campaign to eliminate the Endowment completely. In Command Performance, Alexander brings a Washington outsider's perspective and an actor's eye for the telling human detail to an anecdote-filled story of the art of politics and the politics of art. And at the start of a new administration in Washington, she reminds us why we need art and why government should be in the business of supporting it.",
        "Category": " Art , Art & Politics",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Uncle John's Supremely Satisfying Bathroom Reader",
        "Authors": "By Bathroom Readers' Institute",
        "Description": "Supreme satisfaction awaits you in Uncle John’s 14th all-new edition, which covers a whole host of topicsfrom the silly (a branding iron for hot dogs), to the bizarre (an exploding whale), to the profound (the rise of the Democratic and Republican parties). Since 1987, the Bathroom Readers’ Institute has led the movement to stand up for those who sit down and read in the bathroom (and everywhere else for that matter). With more than 11 million books in print, theUncle John’s Bathroom Reader series is the longest-running, most popular series of its kind in the world.Where else could you learn how soap works, why people started tipping, and the history of chocolate? Uncle John rules the world of information and humor, so get ready to be thoroughly entertained. Read all about…Dumb 9-1-1 calls22 things that fell from the skyHow Star Trek went from failed series to cult phenomenonThe origins of football, photography, soap operas, and paperclipsQuack medicines from yesterday and todayThe Uplifting” history of the braAnd much more!",
        "Category": " Reference , Trivia",
        "Publisher": "Portable Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Live High on Low Fat",
        "Authors": "By Rosenthal, Sylvia Dworsky",
        "Description": "Nearly five hundred recipes offer ample low-fat and low-cholesterol fare for everyday meals and snacks and for special occasions",
        "Category": "",
        "Publisher": "Lippincott Williams & Wilkins",
        "Price Starting With ($)": "5.04",
        "Publish Date": {
            "Month": "June",
            "Year": "1975"
        }
    },
    {
        "Title": "Rose Recipes from Olden Times",
        "Authors": "By ROHDE, ELEANOUR SINCLAIR",
        "Description": "Even though nowadays roses are cultivated mostly for their beauty, previous ages have not been so singularly narrow-minded. Even at the turn of the century many people in appreciation of the fragrance, sweet flavor, and medicinal virtues of rose petals, hips, and leaves, still took pleasure in age-old traditional ways of making perfumes, sweet waters, jams, jellies, salads, sauces, and various kinds of confections with roses. They also knew how to crystallize the petals, to preserve the buds, to flavor wines and vinegar with rose leaves, and to use roses in many medicinal ways.With thanks in great measure to the extraordinary modern herbalist Eleanour Sinclair Rohde, this wonderful knowledge has not vanished beyond recall. Her collection of rose recipes between these covers is gathered from the works of a variety of old herbalists (notably Sir Hugh Platt, Gervase Markham, and Sir Kenelm Digby), as well as from her own vast knowledge of traditional herbal recipes. \"Receipts\" from four centuries include: pot-pourris, sweet bags and pomanders (using dried roses with such extra ingredients as mint, cloves, coriander, lavender flowers, and sandalwood); sweet waters (with ingredients like nutmeg, cardamom, orange peel, and cloves) that can be used for washing; perfumes, oil of roses, and \"odoriferous\" candles; and a host of culinary delights like conserves (both petals and hips), sauce eglantine, rossoly, rose jelly, rose hip marmalade, and pickled rosebuds.There are 83 recipes altogether, including instructions on how to dry rose leaves (four ways), how to candy rose leaves, how to preserve whole roses, and how to flavor sugar, wine, vinegar, and honey with roses. Every page is beautifully and distinctively decorated, making this not only a source of special joy for connoisseurs of herbs and herbals, but in all ways a pleasure to read and use for anyone wanting the best rose recipes.",
        "Category": " Nature , Plants , Flowers",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1973"
        }
    },
    {
        "Title": "Army Goose Melodies",
        "Authors": "By Krebs, Florence Kellogg",
        "Description": "",
        "Category": "",
        "Publisher": "Paul Elder & Co",
        "Price Starting With ($)": "5.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1910"
        }
    },
    {
        "Title": "The Opportunity",
        "Authors": "By Haass, Richard N.",
        "Description": "In this dramatic new perspective on international affairs, Richard N. Haass, one of the country's most brilliant analysts and able foreign policy practitioners, argues that it is hard to overstate the significance of there being no major  power conflict in the world. America's great military, economic, and political power discourages traditional challenges; no ideological fault line divides the world into  warring blocs. India, China, Japan, Russia, and Europe all seek a prolonged period of stability that would support economic growth.    The opportunity thus exists for unprecedented cooperation among the major powers. This is good, because they share vulnerabilities. Globalization, which promotes trade and investment and eases travel and communication,  also facilitates the spread of viruses (human and computer alike), weapons, terrorists, greenhouse gases, and drugs. And the United States, for all its strength, cannot defeat these threats alone.    But opportunity is not inevitability. The question is whether the United States will be able to integrate other countries into global efforts against terrorism, the spread of nuclear weapons, genocide, and protectionist policies  that jeopardize global economic prosperity. This compelling book explains why it must and how it can.",
        "Category": " Political Science , Reference",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Fathers and Sons",
        "Authors": "By Running Press",
        "Description": "This moving volume of photographs and essays explores the unique relationship between father and son, the first and most elemental expression of male bonding. Thirty essays accompany sixty evocative portraits of fathers and sons of all ages, including newsmen Mike and Chris Wallace; writer/radio personality Garrison Keillor and his son, Jason; golfer Jack Nicklaus and his sons Jackie, Steve, Gary, and Michael; and NASCAR legend Richard Petty and his racing son Kyle and grandson Adam.",
        "Category": " Family & Relationships , Parenting , Fatherhood",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Start Golf Young",
        "Authors": "By Ford, Doug",
        "Description": "",
        "Category": "",
        "Publisher": "STERLING PUBLISHING CO.",
        "Price Starting With ($)": "43.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "Vegetarian Gourmet Cookery",
        "Authors": "By Hooker, Alan",
        "Description": "",
        "Category": "",
        "Publisher": "productions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Creating Emotionally Safe Schools: A Guide for Educators and Parents",
        "Authors": "By Bluestein, Jane",
        "Description": "Something is terribly wrong with our schools. How did a place that should be a sanctuary for kids becomes a source of fear and intimidation? What has happened?  In Creating Emotionally Safe Schools, Jane Bluestein offers a plan to return schools to havens of nurturing and learning. She examines environmental, historical, developmental, psychological, sociological, interpersonal, instructional and administrative factors that contribute to the emotional climate of an educational institution. This is a comprehensive view of what makes a school feel the way it feels, and what we can do to make it feel safe for every child—and every adult—who walks through its doors.  Emotional safety has many dimensions, such as: the impact of the family and early development, childhood stress and coping, the changing role of the school, acceptance and emotional support, respect and belonging, temperament and labels, gangs and violence, instructional strategies, learning styles and multiple intelligences, teacher training and support, and the inherent need for a sense of community. The message Jane Bluestein brings is positive: information, programs and solutions are available that can ultimately make our schools inviting, inspiring, and, yes—safe. Includes:  Comprehensive list of references and resources Complete index",
        "Category": " Education , Philosophy, Theory & Social Aspects",
        "Publisher": "Health Communications Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Psychology in Action",
        "Authors": "By Huffman, Karen",
        "Description": "In this revision, Karen Huffman has built on what this text does well: pedagogy, guiding the student, facilitating the art & science of teaching & learning, technology, active learning, gender and culture. In addition, this revision focuses on updating the neuroscience and biology (ie the science) since these are the areas that are most rapidly changing the face of psychology.",
        "Category": " Psychology , Reference",
        "Publisher": "Wiley",
        "Price Starting With ($)": "8.38",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "It's My F---ing Birthday",
        "Authors": "By Markoe, Merrill",
        "Description": "It's her thirty-sixth birthday, and she really thought things would be different this year - that she'd have figured out men and how to get along with her narcissistic parents enough to survive a birthday celebration. But nothing's changed. Her disappointing day is capped off by the delivery of a huge bouquet of flowers from Carl, with whom she has recently, and bitterly, split. A gesture of reconciliation? Of passive aggression? She's too unhinged to tell.It's My F---ing Birthday unfolds in seven state-of-my-life addresses this hapless high school art teacher writes to herself on consecutive birthdays, as she is determined to break the patterns of behavior that are keeping her down. Her objective: to avoid making the same mistakes over and over and start making some new ones. Through seven outrageously funny years of needling parents, self-absorbed boyfriends, riots, O.J., and Monica - and bigger and bigger bouquets from Carl - she navigates a circuitous (and ultimately successful) route to happiness in a world where everything seems to conspire to the contrary.",
        "Category": " Fiction , Humorous",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Mini-Exams for the Engineer-In-Training Examination",
        "Authors": "By Lindeburg, Michael R.",
        "Description": "",
        "Category": "",
        "Publisher": "Professional Pubns Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Fit & Well",
        "Authors": "By Fahey, Thomas D., Insel, Paul M., and Roth, Walton T.",
        "Description": "",
        "Category": " Health & Fitness , General",
        "Publisher": "Mcgraw-Hill College",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "All You Need to Know About Back Pain: Beat Pain, Increase Mobility and Know Your Options",
        "Authors": "By Dunkin, Mary Anne and Klippel, John H.",
        "Description": "Provides information on the causes of back pain, conventional and alternative treatments, exercise programs to relieve pain and stiffness, and ways to manage stress.",
        "Category": " Health & Fitness , Pain Management",
        "Publisher": "Arthritis Foundation",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Betrayal: A Play",
        "Authors": "By Pinter, Harold",
        "Description": "",
        "Category": "",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The Oxford Companion to Politics of the World",
        "Authors": "By Krieger, Joel (EDT), Joseph, William A., and Kahler, Miles (CON)",
        "Description": "Will the end of superpower rivalry bring greater international harmony--or more volatile and dangerously unpredictable conflicts? Where two massive spheres of influence once divided the globe, now regional conflicts erupt into scenes of tragedy and confusion.  In Africa, the new Europe, Asia, and the Americas, nations chart a bold course toward democracy.  But they cannot break free of old divisions, as ethnic nationalism emerges amidst economic devastation.  Indeed, nations everywhere, however powerful, are buffeted on every side. Their sovereignty is checked by the global economy as well as powerful regional economic and political blocs.  At a time of exceptional ferment, Oxford is pleased to present the most authoritative, timely, in-depth reference available for understanding the people, nations, conflicts, movements, institutions, and issues that dominate the world political stage.     Edited by a team of eminent political scientists, The Oxford Companion to Politics of the World provides readers the depth of coverage, the historical contexts, and the richness of interpretation needed to come to terms with today's volatile international scene.  Drawing on the insights of nearly 500 authors from more than 40 countries, the volume provides comprehensive coverage of international affairs and domestic politics throughout the world.     Articles discuss virtually every nation in the world, and include extensive information on institutions, political parties, leaders, and the sources of political mobilization and conflict.  The volume also includes biographies of more than seventy-five political leaders and thinkers who have shaped the contemporary political world, and detailed discussions of critical historical developments and events, concepts, international law, and organizations.  For example, there is a biography of Richard M. Nixon by Garry Wills and one of Winston Churchill by Martin Gilbert; an essay on development and underdevelopment by Claude Ake; an article on human rights by Aryeh Neier; coverage of such subjects as Hiroshima, sovereignty, and the International Court of Justice by Richard Falk. Todd Gitlin writes on the New Left, Anthony Lake on the Vietnam War, and Robert B. Reich on deindustrialization.  Charlotte Bunch examines feminism, and Zhores A. Medvedev explains Chernobyl.     The Companion also presents major interpretive essays treating seminal contemporary themes such as ethnicity, nationalism, war, gender and politics, and environmentalism, essays that offer readers a deeper, more substantial understanding of headlines day after day. Drawn from a wide range of disciplines, including political science, economics, women's studies, law, anthropology, history, and business, the contributors to the volume provide factual information, new insights, and fresh interpretations as they consider the critical political developments of the twentieth century.      The Oxford Companions have long been respected for their lively and informative presentation of the finest scholarship. (Harper's has called the \"the best reference books in the language.\") The Oxford Companion to Politics of the World maintains this high standard in an accessible, timely, thought-provoking, and comprehensive reference that captures the complexity, vitality, and endless fascination of contemporary world affairs.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "7.82",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Eyes Wide Open: Looking for God in Popular Culture",
        "Authors": "By Romanowski, William D.",
        "Description": "In Eyes Wide Open, William Romanowski offers a fascinating, easy-to-read guide for interpreting and evaluating popular culture as a Christian. His practical, analytical approaches to movies, music, and television programs provide tools for imaginatively and faithfully engaging the media that now saturate our lives. His illuminating examples range from Titanic to Casablanca, from ER to The Simpsons, and from Bruce Springsteen to Amy Grant. Eyes Wide Open is the road map to popular culture for parents, teenagers, teachers, and pastors.",
        "Category": " Music , Religious , Christian",
        "Publisher": "Brazos Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Telecourse Guide For Living With Heath",
        "Authors": "By Donna Beck Richards",
        "Description": "",
        "Category": "",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "10.62",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "The Book of Terns",
        "Authors": "By Delacorte, Peter",
        "Description": "Cartoon drawings depicting all types of unusual terns are puns on common words and phrases as well as familiar quotations",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1978"
        }
    },
    {
        "Title": "Sweet Kids: How to Balance Diabetes Control and Good Nutrition With Family Peace",
        "Authors": "By Brackenridge, Betty Page and Rubin, Richard R.",
        "Description": "Offers parents advice on helping their diabetic children, and discusses diet, meal planning, snacks, low blood sugar, sports, and child development",
        "Category": " Health & Fitness , Diseases , Diabetes",
        "Publisher": "Amer Diabetes Assn",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Remember Me",
        "Authors": "By Clark, Mary Higgins",
        "Description": "In Remember Me, her new psychological thriller, Mary Higgins Clark has created a riveting tale of suspense revolving around a young mother's guilt.Menley Nichols has never stopped blaming herself for the accidental death of her two-year-old son Bobby, even though she was blameless - her car had been struck by an oncoming train at a railroad crossing.In the aftermath, as Menley suffers from post-traumatic stress disorder, her marriage to Adam, a high-profile criminal defense attorney, starts to fall apart. The birth of their daughter Hannah; however, promises to revitalize their relationship. Menley and Adam are determined to rebuild a life together around their precious new baby - unaware that someone in their midst has a very different agenda for them.With no foreboding that it could be a fatal move, Adam decides to return to his roots by renting a house on Cape Cod for the month of August, confident that the tranquillity of the place where his ancestors settled - and where he grew up - will be ideal for Menley and little Hannah. The place they rent is Remember House, an eighteenth-century landmark, built by a sea captain for his bride. It has the sinister legend that the captain deserted his wife on learning of her unfaithfulness, taking their infant daughter with him.When Menley and Adam move into Remember House, strange things start happening - incidents that make Menley relive the horror of the accident in which she lost Bobby, incidents that make her fear for Hannah....Step by step, they are drawn into a dark and threatening web of events that disrupts this seemingly peaceful town. They become involved with Scott Covey, suspected of murder when his wealthy young bride is drowned in a violent squall. Menley, sympathetic to Covey's plight, persuades Adam to take on his case. In the course of the investigation, they become entangled with others - among them, an Alzheimer's victim who may hold a vital clue, a teenage baby-sitter, a flamboyant young woman with a possible link to Covey, and an attractive real estate agent who is part of Adam's past on the Cape.In Remember Me, her most compelling novel, Mary Higgins Clark captures the legends and atmosphere of Cape Cod, where she herself has a home, and the rising terror of people in the grip of menace hovering over their lives.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Leadership Dilemmas- Grid® Solutions: a visionary new look at a classic tool for defining and attaining leadership and management excellence ... and Organization Development Series)",
        "Authors": "By Blake, Robert Rogers and McCanse, Anne Adams",
        "Description": "",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Gulf Professional Publishing",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Nuclear Arms Control: The Process of Developing Positions",
        "Authors": "By Schaefer, Henry W. (Henry Wilcox)",
        "Description": "",
        "Category": "",
        "Publisher": "National Defense University, Washington, DC",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Liberty for All Bk 5 (Heath Ed)",
        "Authors": "By Hakim",
        "Description": "",
        "Category": "",
        "Publisher": "Not Avail",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Mr. Timothy",
        "Authors": "By Bayard, Louis",
        "Description": "Welcome to the world of a grown-up Timothy Cratchit, as created by the astonishing imagination of author Louis Bayard.Mr. Timothy Cratchit has just buried his father. He's also struggling to bury his past as a cripple and shed his financial ties to his benevolent \"Uncle\" Ebenezer by losing himself in the thick of London's underbelly. He boards at a brothel in exchange for teaching the mistress how to read and spends his nights dredging the Thames for dead bodies and the treasures in their pockets.Timothy's life takes a sharp turn when he discovers the bodies of two dead girls, each seared with the same cruel brand on the upper arm. The sight of their horror-struck faces compels Timothy to become the protector of another young girl, the enigmatic Philomela. Spurred on by the unwavering enthusiasm of a street-smart, fast-talking homeless boy who calls himself Colin the Melodious, Timothy soon finds that he's on the trail of something far worse -- and far more dangerous -- than an ordinary killer.This breathless flight through the teeming markets, shadowy passageways, and rolling brown fog of 1860s London is wrought with remarkable depth and intelligence, complete with surprising twists and extraordinary heart.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Borzoi Handbook for Writers (text only--no practice book)",
        "Authors": "By Schor, Sandra, Crews, Frederick, and Hennessey, Michael",
        "Description": "Designed as an easy-to-use, non-jargon-bound reference for writers, the BORZOI features elegant, straightforward language suggestions and advice as it avoids complex grammatical explanations. The handbook is accompanied by a free Practice book that provides exercises based in real discourse units.",
        "Category": " Reference , Writing Skills",
        "Publisher": "McGraw-Hill Humanities/Social Sciences/Languages",
        "Price Starting With ($)": "8.24",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Healing the Incest Wound: Adult Survivors in Therapy",
        "Authors": "By Courtois, Christine A.",
        "Description": "Occasionally a book for psychotherapists instantly becomes a classic. Not only do clinicians recognize the excellence and importance of the book, but their clients respond enthusiastically to the accurate portrayal of their experiences and the model for healing. With the publication of Healing the Incest Wound, such a classic was born.Incest is not a rare aberrant happening, but a common childhood experience for a substantial minority of children. Since incest is generally hidden and denied, the victims are left to cope with their reactions in an atmosphere that contradicts their reality. Yet all incest is not the same; for instance, one-time fondling by an uncle has different effects from rapes repeated over many years by a stepfather. The book describes these variations and the symptoms, short-term aftereffects, and long-term secondary elaborations of incest from four theoretical perspectives: traumatic stress, developmental, feminist, and loss. The author not only comprehensively discusses the salient issues of incest therapy but also illustrates these with numerous case studies, showing how incest survivors can heal and build a core of self-respect and dignity.",
        "Category": " Psychology , Psychotherapy , Counseling",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Monet a Retrospective",
        "Authors": "By Stuckey, Charles",
        "Description": "",
        "Category": "",
        "Publisher": "Hugh Lauter Levin Associates",
        "Price Starting With ($)": "9.72",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Pacific Rim Almanac",
        "Authors": "By Besher, Alexander",
        "Description": "Some 2,000 items of information (overviews, analyses, articles, interviews, quotes, lists, tables, even proverbs) organized in \"information nuggets\" within nine main sections: marketing, trade, money, work, life on the Rim, ecology and environment, the South Pacific, information (technology and communications), infrastructure (cities, transportation, and travel), and the future. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "6.94",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Pekingese",
        "Authors": "By Pisano, Beverly",
        "Description": "",
        "Category": "",
        "Publisher": "TFH Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Quite Honestly",
        "Authors": "By Mortimer, John Clifford",
        "Description": "The creator of Rumpole of the Bailey returns to the novel with a comic tale of middle-class do-gooding gone awry  Thousands of readers have discovered the inimitable voice of John Mortimer through his Rumpole series of stories. But with Quite Honestly, Mortimer creates a cast of characters that rivals his usual Rumpole repertoire, delivering a wonderfully comic novel, packed with entertaining reflections on a life in crime.  Life couldn't be better for Lucinda Purefoy. She's got a steady boyfriend, a degree in social sciences from Manchester University, and the offer of a high-powered job in advertising. With all this good fortune, isn't it appropriate for her to give something back to society?  With her newly minted membership in Social Carers, Reformers, and Praeceptors (SCRAP for short), an organization that recruits women to become the guides, philosophers, and friends to ex-convicts coming out of prison, Lucy finds herself standing outside the gates of Wormwood Scrubs waiting to greet a career burglar called Terry Keegan. What happens next- after a short and hostile trip to Burger King-confounds expectations and produces a signature Mortimer tale full of wit and surprise.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Dimaggio: Setting the Record Straight",
        "Authors": "By Engelberg, Morris and Schneider, Marv",
        "Description": "Describes the life of the Yankee Clipper, covering his thirteen-year baseball career, including his fifty-six game hitting streak, and his relationships with his teammates, family, and his ex-wife, Marilyn Monroe.",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Motorbooks Intl",
        "Price Starting With ($)": "6.13",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Prodigal Troll",
        "Authors": "By Finlay, Charles Coleman",
        "Description": "The Prodigal Troll is a tale of a human child raised by a band of mythological creatures that is both hysterical and moving.When Lord Gruethrist's castle is laid under siege by an invading baron, he sends a trusted knight and nursemaid off with his infant son. Their escape across a wilderness landscape populated by fantastic creatures and torn by war takes unexpected turns until the baby is finally adopted by a mother troll grieving for her own lost child. Christened \"Maggot\" by a hostile stepfather, the human boy grows up amid the crude but democratic trolls until he leaves the band to rediscover the world of humankind.But the world of man is a complex and capricious place. Maggot must master its strange ways if he is to survive... let alone win the heart and hand of the Lady Portia.Finlay's society of trolls are unlike any you've ever read before, and his matriarchal medieval world, pitted as they are against an analog of Native American tribesmen, provides a rich setting for many poignant social and political insights.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Pyr",
        "Price Starting With ($)": "10.22",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Why New Orleans Matters",
        "Authors": "By Piazza, Tom",
        "Description": "Every place has its history. But what is it about New Orleans that makes it more than just the sum of the events that have happened there? What is it about the spirit of the people who live there that could produce a music, a cuisine, an architecture, a total environment, the mere mention of which can bring a smile to the face of someone who has never even set foot there?What is the meaning of a place like that, and what is lost if it is lost?The winds of Hurricane Katrina, and the national disaster that followed, brought with them a moment of shared cultural awareness: Thousands were killed and many more displaced; promises were made, forgotten, and renewed; the city of New Orleans was engulfed by floodwaters of biblical proportions—all in a wrenching drama that captured international attention. Yet the passing of that moment has left too many questions.What will become of New Orleans in the months and years to come? What of its people, who fled the city on a rising tide of panic, trading all they knew and loved for a dim hope of shelter and rest? And, ultimately, what do those people and their city mean to America and the world?In Why New Orleans Matters, award-winning author and New Orleans resident Tom Piazza illuminates the storied culture and uncertain future of this great and most neglected of American cities. With wisdom and affection, he explores the hidden contours of familiar traditions like Mardi Gras and Jazz Fest, and evokes the sensory rapture of the city that gave us jazz music and Creole cooking. He writes, too, of the city's deep undercurrents of corruption, racism, and injustice, and of how its people endure and transcend those conditions. And, perhaps most important, he asks us all to consider the spirit of this place and all the things it has shared with the world—grace and beauty, resilience and soul. \"That spirit is in terrible jeopardy right now,\" he writes. \"If it dies, something precious and profound will go out of the world forever.\"Why New Orleans Matters is a gift from one of our most talented writers to the beloved and important city he calls home—and to a nation to whom that city's survival has been entrusted.",
        "Category": " Social Science , Sociology , Urban",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "The Secret House: 24 Hours in the Strange and Unexpected World in Which We Spend Our Days and Nights",
        "Authors": "By Bodanis, David",
        "Description": "Vividly describes the invisible physical and biological events in a house that are a part of everyday life, such as the eggs quietly breathing in the refrigerator and the electrical force fields curling out of the wall sockets",
        "Category": " Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "Shroud for a Nightingale (Adam Dalgliesh Mystery Series #4)",
        "Authors": "By James, P. D.",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "329.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Telling",
        "Authors": "By Winik, Marion",
        "Description": "In May 1991, fans of National Public Radio's All Things Considered discovered Marion Winik, a candid and often hilarious personal essayist whose cliffhanger past and action-packed present reflect her entire generation's stormy voyage to maturity. From adolescent rebellion in New Jersey to bohemian decadence in Manhattan to the sometime-salvation of motherhood in Texas, Winik bravely chronicles the intimate experiences and decisions that shape us as adult.\"A born iconoclast, an aspiring artiste, a feminist vegetarian prodigal daughter, from early youth I considered myself destined to lead a startling life far outside the bounds of convention. I would be famous, dangerous, brilliant, and relentlessly cool: a sort of cross between Emma Goldman, Jack Kerouac, and Georgia O'Keeffe....So where did this station wagon come from?\"In pieces on subjects as diverse as sibling relationships, psychedelic drugs, parenthood, AIDS, and breastfeeding in public, with a case of characters ranging from hapless houseguests and bad-news beaux to gay friends, hero friends, and Friends You Love to Hate, Winik fuses the cadences of heart-to-heart talk with the concision of poetry. She takes us on a journey both personal and universal, a tour of the minefield of chance and circumstance that makes a life. There is great loss here - from a family pet to a parent to a baby. There are many pitfalls - from bulimia to drug addiction to the ordinary trauma of a stolen purse. Ultimately, though, there is a passion and energy for living, an unshaken belief that following one's heart is more important than following the rules, and a conviction that no dark secret is ever as dark as one thinks. Winik, in fact, is a connoisseur of her own foibles.\"The only thing that sticks with me is a kind of fitful, half-baked antimaterialism, an impatience with the tyranny of objects. Because of it, I just don't notice what kind of car other people drive, or the puddle I'm about to step into, or where I set down my bag when I got home. And this leaves the door wide open to the cold wind of chaos, which sweeps through my life at unpredictable intervals to exact its toll.\"This hip, funny, and moving collection marks the appearance of an appealing new voice in contemporary writing.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Exclusive",
        "Authors": "By Brown, Sandra",
        "Description": "A second-stringer with first-class talent, Barrie Travis is stuck at a low-budget independent television station struggling to survive among the giant networks. Then, suddenly, she receives an invitation from First Lady Vanessa Merritt for an off-the-record conversation. Barrie's reporter's instincts are instantly aroused.During a furtive, emotionally charged meeting, Barrie sees that the President's beautiful wife is stunned by grief after the crib death of her infant son. Vanessa's motive for meeting Barrie seems to be to share her heartache with another woman. What Barrie overlooks in her excitement at hearing the confidences of the First Lady are the questions she should be asking: Why would Vanessa Merritt call her? And why would the President's wife hint to an unknown reporter that her child may have been murdered?Blind to everything but getting her exclusive, Barrie is determined to investigate the death of the President's child. But she soon realizes that getting her story will test her ethics and her patriotism. Would she expose information that could topple the presidency? She confronts this problem when she tracks down Gray Bondurant, a former presidential aide and war hero who shunned the politics of Washington in favor of life on a remote Wyoming ranch. And when they both begin to follow a trail of lies and intrigue right to the White House door, Barrie's exclusive puts at least three people on the firing line: the First Lady, Gray, and herself - as crimes and ambitions combine to endanger their lives and the future of the nation.",
        "Category": " Fiction , General",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Heaven's Price",
        "Authors": "By Brown, Sandra",
        "Description": "New York dancer Blair Simpson is confronted with a difficult choice when a career-threatening injury forces her to put her life on hold and recuperate on Long Island, where she encounters Sean, her passionate and provocative new landlord. 150,000 first printing. $150,000 ad/promo.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Seasons Observed",
        "Authors": "By Lauder, Evelyn",
        "Description": "The Seasons Observed is a photographic portrait of the natural landscape, documented in such diverse settings as Aspen, the Hudson River and its environs, California, Florida, Hawaii, the Caribbean, Bali, Indonesia, South America, and that perennial pleasure spot, Italy. Turning her camera away from people and signs of cultural life, Evelyn Lauder has taken careful aim to celebrate nature season by season. A grove of birch trees whose trunks cast long, lean shadows in the grass, a swarm of golden leaves buzzing in the fall sunlight, an eddy of water cutting through a snowcovered bank are among the seventy-six color photographs in this quietly moving, spiritual book.",
        "Category": " Nature , Seasons",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Marching Toward the 21st Century: Military Manpower and Recruiting (Contributions in Military Studies)",
        "Authors": "By Eitelberg, Mark J. and Mehay, Stephen L. (EDT)",
        "Description": "This book will appeal to persons interested in national security issues and, more specifically, to those who may want to know more about the manpower and recruiting problems facing the military of the future. The authors come from a wide variety of backgrounds and academic disciplines--including economics, political science, psychology, sociology, operations research, education, and public administration. This book will also appeal to persons interested in human resource issues beyond the military, as well as those interested in tracking trends in the labor force, public opinion, education, youth attitudes, or society in general.",
        "Category": " Political Science , International Relations , Arms Control",
        "Publisher": "Praeger",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "American National Security: Policy and Process",
        "Authors": "By Jordan, Professor Amos A., Taylor Jr., Professor William J.",
        "Description": "",
        "Category": "",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1981"
        }
    },
    {
        "Title": "Galileo",
        "Authors": "By Ronan, Colin A",
        "Description": "",
        "Category": "",
        "Publisher": "Putnam",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Subjects/Strategies: A Writer's Reader",
        "Authors": "By Rosa, Alfred F. (EDT) and Eschholz, Paul A. (EDT)",
        "Description": "",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Bedford/St. Martin's",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Women of the Silk",
        "Authors": "By Tsukiyama, Gail",
        "Description": "In Women of the Silk Gail Tsukiyama takes her readers back to rural China in 1926, where a group of women forge a sisterhood amidst the reeling machines that reverberate and clamor in a vast silk factory from dawn to dusk. Leading the first strike the village has ever seen, the young women use the strength of their ambition, dreams, and friendship to achieve the freedom they could never have hoped for on their own. Tsukiyama's graceful prose weaves the details of \"the silk work\" and Chinese village life into a story of courage and strength.",
        "Category": " Fiction , Historical , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Discovering French Bleu (French Edition)",
        "Authors": "By Heath",
        "Description": "",
        "Category": "",
        "Publisher": "D C Heath & Co",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Cross Stitch: A Beautiful Gift",
        "Authors": "By Hall, Dorothea",
        "Description": "A variety of small and large gifts for all occasions for adults and children; easy-to follow designs for all levels of expertise; step-by-step instructions and charts for every project; and uniquely original projects embellished with extra embroidery, handmade tassels, buttons, beadwork and quitting.",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Washington, D. C. 100 Years Ago",
        "Authors": "By Whitson, Skip",
        "Description": "",
        "Category": "",
        "Publisher": "Sun Books",
        "Price Starting With ($)": "32.77",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Last Touch: Preparing for a Parent's Death",
        "Authors": "By Becker, Marilyn R.",
        "Description": "Offers advice for coping with the death of a parent, discussing handling a fatal diagnosis, arranging hospital care, making funeral arrangements, and working through the grieving process",
        "Category": "",
        "Publisher": "New Harbinger Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "Hugs from Uncle Henry and Aunt Susan",
        "Authors": "By Harrison, Henry and Harrison, Susan",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Life Enrichment Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Beyond Sarah and Sam: An Enlightened Guide to Jewish Baby Naming",
        "Authors": "By Rosenkrantz, Linda and Satran, Pamela Redmond",
        "Description": "From the authors of Beyond Jennifer & Jason, \"the best baby-naming book ever written\" (The News Journal), here is a book to help you find a name for your baby that reflects your Jewish heritage and suits your personal style:Beyond Sarah & Sam: An Enlightened Guide to Jewish Baby NamingYou want to name your baby after your grandfather Moishe, but it seems as if all the \"good\" M names-those that appeal to both the Jewish person and the modern parent in you-have been overused. Or you want to give your child a biblical name, but every time you open the Old Testament the only names you see are the usual Sarahs and Adams or the beyond-the-pale Jezebels and Jobabs.Here, at last, is a comprehensive guide to names that can work for a Jewish baby in America today-from the traditional to the trendy, from the well-worn to the unheard-of, and everything in between. With the insight and panache that have made them the reigning experts on baby names, the authors explore:Bubba and Zayde Names-Jewish names of yesteryear that are ripe for a comeback, and those in \"Lauderdale Limbo\" whose fate is undeterminedThe Good Book of Names-how to go beyond Sarah and Samuel and Rachel and David, and why not to name your son Cain!Haifa-Nated Names-Hebrew names that may be popular in modern Israel but are sure to make your little one stand out in AmericaPlus an explanation of the complex Jewish naming traditions, a list of Jewish celebrities and their real names, and much, much more...The authors' first baby name book revolutionized the field.From the authors of Beyond Jennifer & Jason, \"the best baby-naming book ever written\" (The News Journal), here is a book to help you find a name for your baby that reflects your Jewish heritage and suits your personal style:Beyond Sarah & Sam: An Enlightened Guide to Jewish Baby NamingYou want to name your baby after your grandfather Moishe, but it seems as if all the \"good\" M names-those that appeal to both the Jewish person and the modern parent in you-have been overused. Or you want to give your child a biblical name, but every time you open the Old Testament the only names you see are the usual Sarahs and Adams or the beyond-the-pale Jezebels and Jobabs.Here, at last, is a comprehensive guide to names that can work for a Jewish baby in America today-from the traditional to the trendy, from the well-worn to the unheard-of, and everything in between. With the insight and panache that have made them the reigning experts on baby names, the authors explore:Bubba and Zayde Names-Jewish names of yesteryear that are ripe for a comeback, and those in \"Lauderdale Limbo\" whose fate is undeterminedThe Good Book of Names-how to go beyond Sarah and Samuel and Rachel and David, and why not to name your son Cain!Haifa-Nated Names-Hebrew names that may be popular in modern Israel but are sure to make your little one stand out in AmericaPlus an explanation of the complex Jewish naming traditions, a list of Jewish celebrities and their real names, and much, much more...The authors' first baby name book revolutionized the field.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Manufactured Crisis: Myths, Fraud, And The Attack On America's Public Schools",
        "Authors": "By Berliner, David C. and Biddle, Bruce J.",
        "Description": "The Manufactured Crisis debunks the myths that test scores in America&#39;s schools are falling, that illiteracy is rising, and that better funding has no benefit. It shares the good news about public education. Disputing conventional wisdom, this book ignited debate in Newsweek, The New York Times, and the entire teaching profession. Winner of the American Educational Research Association book award, The Manufactured Crisis is the best source of facts and analysis for people who care about what&#39;s really happening in our schools.",
        "Category": " Psychology , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Why Fret that God Stuff?: Learn to Let Go and Let God Take Control",
        "Authors": "By Miller, Kathy Collard",
        "Description": "An author shares words of wisdom from men and women including Billy Graham and Barbara Johnson to help readers understand that God is present during daily life, as well as during times of crisis. Original. IP.",
        "Category": "",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "River Run Red: The Fort Pillow Massacre in the American Civil War",
        "Authors": "By Ward, Andrew",
        "Description": "An account of the controversial April 1864 Civil War battle between Confederate cavalry leader Nathan Bedford Forrest and a garrison of Unionists and former slave artillerymen offers insight into how corruption and racism in occupied Tennessee played a role in the Confederate victory and how Forrest went on to found the Ku Klux Klan. By the author of Dark Midnight When I Rise. 30,000 first printing.",
        "Category": " History , United States , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Learn Weight Training In A Weekend (Weekend Series)",
        "Authors": "By Whitehead, Nick",
        "Description": "Provides advice on equipment and preparations for weight lifting, describes a specific program of training spread over two days, and suggests follow-up activities",
        "Category": " Sports & Recreation , Bodybuilding & Weight Training",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Ultimate Golf Techniques: Improve Your Golf Game With The World'sGreatest Golfers",
        "Authors": "By Newell, Steve, Campbell, Malcolm, Newell, Steve (INT), and Cannon, Dave (PHT)",
        "Description": "Would you like to have the graceful swing of Fred Couples, the winning power of Laura Davies, and the inventive genius of Severiano Ballesteros? You can acquire all these skills and more under the expert direction of golf writer Malcolm Campbell.Ultimate Golf is a completely new approach to improving your game. More than 1,000 specially selected images, overhead shots, and photographic sequences of professional players illustrate key techniques that have helped the world's great golfers to reach the top.",
        "Category": " Sports & Recreation , Tennis",
        "Publisher": "DK Publishing, Inc.",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "NOONDAY 3: Stories, Articles and Poetry",
        "Authors": "By Cecil and Webb, Dwight W. (Eds.) Hemley",
        "Description": "",
        "Category": "",
        "Publisher": "NY: Noonday Press",
        "Price Starting With ($)": "7.17",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "Curves On The Go: 30 minutes a day, 3 days a week",
        "Authors": "By Colman, Carol and Heavin, Gary",
        "Description": "\"What would you give to have a great body without constantly dieting? Is it worth thirty minutes of your time three days a week? Are you willing to watch what you eat for two days a month if you could eat without deprivation the other twenty-eight days? Would you like to liberate yourself from the drudgery and monotony of constant dieting? I'm going to make you a promise that cannot be made by any other weight-loss program. I will show you an easy way to achieve permanent weight loss without permanent dieting. It won't take a lot of your time. And it will lead you out of diet hell.\"",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Gold By Gemini",
        "Authors": "By Joanathan Gash",
        "Description": "",
        "Category": "",
        "Publisher": "Harper and Row, Publishers",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Looking Back: A Book of Memories",
        "Authors": "By Lowry, Lois",
        "Description": "People are constantly asking two-time Newbery Medalist Lois Lowry where she gets her ideas. In this fascinating memoir, Lowry answers this question, through recollections of childhood friends and pictures and memories that explore her rich family history. She recounts the pivotal moments that inspired her writing, describing how they magically turned into fiction along the complicated passageway called life. Lowry fans, as well as anyone interested in understanding the process of writing fiction, will benefit from this poignant trip through the past and the present of a remarkable writer.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Literary",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "The Human Cycle",
        "Authors": "By Turnbull, Colin M.",
        "Description": "A noted and influential anthropologist surveys a broad spectrum of human societies to delineate the diversity and cultural richness surrounding passage through the stages of life in primitive cultures",
        "Category": " Social Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Employee Ownership: Revolution or Ripoff",
        "Authors": "By Blasi, Joseph R.",
        "Description": "Assesses the advantages and disadvantages of Employee Stock Ownership Plans, looks at several employee-owned companies, and argues that U.S. competitiveness depends on finding new roles for labor, management, and government",
        "Category": "",
        "Publisher": "Ballinger Pub Co",
        "Price Starting With ($)": "7.74",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "One L: The Turbulent True Story of a First Year at Harvard Law School",
        "Authors": "By Turow, Scott",
        "Description": "Newsweek calls him \"an extraordinarily canny and empathetic observer.\" In bestseller after bestseller, Turow uses his background as a lawyer to create suspense fiction so authentic it reads with the hammering impact of fact. But before he became a worldwide sensation, Scott Turow wrote a book that is entirely true, the account of his own searing indoctrination into the field of law called ... The first year of law school is an intellectual and emotional ordeal so grueling that it ensures only the fittest survive. Now Scott Turow takes you inside the oldest and most prestigious law school in the country when he becomes a \"One L,\" as entering students are known at Harvard Law School. In a book that became a national bestseller, a law school primer, and a classic autobiography, he brings to life the fascinating, shocking reality of that first year. Provocative and riveting, One L reveals the experience directly from the combat zone: the humiliations, triumphs, hazings, betrayals, and challenges that will make him a lawyer-and forever change Turow's mind, test his principles, and expose his heart.",
        "Category": " Law , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Fearless Brewing: The Beer Maker's Bible",
        "Authors": "By Kunath, Brian",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Answering the 8 Cries of the Spirited Child: Strong Children Need Confident Parents",
        "Authors": "By Arp, Dave and Arp, Claudia",
        "Description": "Besides feeling ready to pull their hair out, parents of spirited children are often convinced that their spirited child would behave better if only Mom or Dad were smarter, wiser or more patient! In their new book on\"difficult\" children, child development experts Claudia and David Arp remind readers that there's no such thing as a Super Parent.   Having a spirited child can make parenting more intense and sometimes overwhelming, but you can begin to recognize the eight most common cries for help and what they really mean: \"Look at me!\" \"Did I do good?\" \"You're not listening!\" \"Let me do it my way!\" \"You can't make me anymore!\" \"I hate you!\" \"I can do it myself!\" and \"I am a big kid already!\" The Arps -- with humor, compassion, insights from Scripture, and the latest in research -- show you ways to develop win-win strategies for nurturing your not-so-compliant child. Help just arrived.",
        "Category": " Religion , Inspirational",
        "Publisher": "Howard Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The New Language of Psychiatry: Learning and Using Dsm-III",
        "Authors": "By Levy, Ronald",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "7.34",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "An Introduction To Patents.",
        "Authors": "By BELL TELEPHONE LABORATORIES PATENT DEPARTMENT.",
        "Description": "",
        "Category": "",
        "Publisher": "Bell Telephone Laboratories, Inc., New York",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "The loved and the unloved;",
        "Authors": "By Mauriac, FrancÌ§ois",
        "Description": "",
        "Category": "",
        "Publisher": "pellegrini & cudahy",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1952"
        }
    },
    {
        "Title": "Political Ethics and Public Office",
        "Authors": "By Thompson, Dennis F.",
        "Description": "Are public officials morally justified in threatening violence, engaging in deception, or forcing citizens to act for their own good? Can individual officials be held morally accountable for the    wrongs that governments commit? Dennis Thompson addresses these questions by developing a conception of political ethics that respects the demands of both morality and politics. He criticizes conventional conceptions for failing to    appreciate the difference democracy makes, and for ascribing responsibility only to isolated leaders or to impersonal organizations. His book seeks to recapture the sense that men and women, acting for us and together with us in a    democratic process, make the moral choices that govern our public life.  Thompson surveys ethical conflicts of public officials over a range of political issues, including nuclear deterrence, foreign    intervention, undercover investigation, bureaucratic negligence, campaign finance, the privacy of officials, health care, welfare paternalism, drug and safety regulation, and social experimentation. He views these conflicts from the    perspectives of many different kinds of public officials - elected and appointed executives at several levels of government, administrators, judges, legislators, governmental advisers, and even doctors, lawyers, social workers, and    journalists whose professional roles often thrust them into public life.  In clarifying the ethical problems faced by officials, Thompson combines theoretical analysis with practical prescription, and    begins to define a field of inquiry for which many have said there is a need but to which few have yet contributed. Philosophers, political scientists, policy analysts, sociologists, lawyers, and other professionals interested in ethics    in government will gain insight from this book.",
        "Category": " Political Science , Public Affairs & Administration",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "The economics of equality (An L.I.D. pamphlet)",
        "Authors": "By Kahn, Tom",
        "Description": "",
        "Category": "",
        "Publisher": "League for Industrial Democracy",
        "Price Starting With ($)": "19.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "The Kid Who Only Hit Homers (Matt Christopher Sports Classics)",
        "Authors": "By Christopher, Matt and Kidder, Harvey (ILT)",
        "Description": "Over one million copies sold! A baseball fan learns the true meaning of success in this beloved classic that will capture the imaginations of a new generation of young readers.Sylvester loves baseball, but he isn't exactly what you'd call a good hitter. Even though he wants nothing more than to join his neighborhood team, the Hooper Redbirds, he's sure he'll never do anything more than warm the bench. But then he meets the mysterious Mr. Baruth who promises to make Sylvester one of the best players ever. Suddenly, Sylvester goes from the worst player on the team to the kid who can only hit homers.With his overnight success, however, come tough questions. Will Sylvester ever learn the true meaning of teamwork? And what will happen when he has to learn to stand on his own?This beloved story about baseball, confidence, perseverance, and being a good teammate is a modern classic and sure to win over a new generation of young sports fans.",
        "Category": " Juvenile Fiction , Sports & Recreation , Baseball & Softball",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1986"
        }
    },
    {
        "Title": "The Harper Book of American Quotations",
        "Authors": "By Carruth, Gorton",
        "Description": "More than 8000 quotations grouped into 264 alphabetical categories where they are listed alphabetically by author. Valuable index includes authors and their quotations, the topic of quotations and familiar or key words. Very enjoyable and comprehensive. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Reference , Encyclopedias",
        "Publisher": "Collins Reference",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Corduroy's Halloween (A Lift-the-Flap Book)",
        "Authors": "By McCue, Lisa (ILT) and Hennessy, B. G.",
        "Description": "It’s trick-or-treat time for everyone’s favorite bear, who is now celebrating his 50th anniversary!   Corduroy loves Halloween. Lift the flaps and share his holiday fun! Corduroy has lots to do to get ready. He visits the pumpkin patch and finds a perfect pumpkin. He goes to the store to get everything he needs for his Halloween costume. And he decorates the house and puts out treats for all the trick-or-treaters who will knock on his door. Join in the excitement of Halloween with this holiday tale perfect for even the youngest reader.",
        "Category": " Juvenile Fiction , Animals , Bears",
        "Publisher": "Viking Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Total Pilates: The Unique Step-by Step Guide to Pilates at Home for Everyone",
        "Authors": "By Crowther, Ann and Petre, Helena",
        "Description": "",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Thorsons",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "For Every Cat an Angel",
        "Authors": "By Davis, Christine",
        "Description": "",
        "Category": " Pets , Cats , General",
        "Publisher": "Lighthearted Press",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Onward!: 25 Years of Advice, Exhortation, and Inspiration from America's Best Commencement Speeches",
        "Authors": "By Smith, Peter (EDT)",
        "Description": "In this beguiling anthology of more than 200 excerpts from the best commencement addresses given during the last twenty-five years, editor Peter J. Smith proves that, in the right hands, the graduation speech is thriving. Far from being a tired truism, the commencement address can be a thoughtful, heartfelt epistle, a dispatch from the front lines of adulthood to the fresh recruits of the newly graduated. In Onward! Twenty-Five Years of Advice, Exhortation, and Inspiration from America's Best Commencement Speeches, Smith has culled what the best minds (and hearts) have imparted to college graduates and in the process has created both a remarkable social history and a stirring celebration of the human spirit. Arranged by year (and introduced with a recap of each year's cultural trends and events), the excerpts in Onward! spring from people with a wide array of talent, experience, and perspective: presidents and novelists, actors and news anchors, scientists and comedians. Their wisdom -- much of it surprising, all of it compelling -- will inform, delight, and inspire.  \"We live in an age in which men have walked on the moon, have harnessed the vast power of nuclear energy, and have created enormous material wealth and riches. Yet our age is marked by ethical retardation, and by the passive tolerance of racism and poverty.\"-- VERNON JORDAN, 1976  \"I want to discourage you from choosing anything or making any decision simply because it is safe. Things of value seldom are.\" -- TONI MORRISON, 1979 \"The best thing you can give yourselves for graduation is the gift of possibility. And the best thing you can give each other is the pledge to go on protecting that gift in each other as long as you live.\"-- PAUL NEWMAN, 1990  \"Do not let people make you cynical. And do not think for a minute that you can have a good, full life if you don't care about what happens to the other people who share this nation and this planet with you.\"-- BILL CLINTON, 1995  \"In all things in life, choose your conscience, and trust your instincts and lead your lives without regrets. It is simply easier that way.\" -- DAVID HALBERSTAM, 1996   Full of equal measures of common sense and goodwill, Onward! is the ideal companion with which to begin one's journey",
        "Category": " Reference , Quotations",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Grace Happens",
        "Authors": "By Czech, Jan M.",
        "Description": "Having a famous mother hasn't always been easy for Grace and not knowing the real identity of her father is yet another issue her mother won't address until they go to Martha's Vineyard for a summer holiday where family secrets are finally revealed.",
        "Category": " Young Adult Fiction , Family , Parents",
        "Publisher": "Viking Juvenile",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Inequality: Reassessment",
        "Authors": "By Jencks, Christopher",
        "Description": "Details the findings of a three-year study undertaken at the Center for Educational Policy Research on inequality in schooling in America and its relation to economic success",
        "Category": " Education , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1972"
        }
    },
    {
        "Title": "Becoming Madame Mao",
        "Authors": "By Min, Anchee",
        "Description": "In a sweeping, erotically charged story that moves gracefully from the intimately personal to the great stage of world history, Anchee Min renders a powerful tale of passion, betrayal, and survival and creates a finely nuanced and always ambiguous portrait of one of the most fascinating, and vilified, women of the twentieth century.Madame Mao is almost universally known as the \"white-boned demon\" -- ambitious, vindictive, and cruel -- whose bid to succeed her husband led to the death of millions. But Min's story begins with a young girl named Yunhe, the unwanted daughter of a concubine who ignored her mother's pleas and refused to have her feet bound. It was the first act of rebellion for this headstrong, beautiful, and charismatic girl. She later fled the miseries of her family life, first to a provincial opera troupe, then to Shanghai and fame as an actress, and finally to the arid, mountainous regions of Yenan, where she fell in love with and married Mao Zedong. The great revolutionary leader proved to be an inattentive husband with a voracious appetite for infidelity, but the couple stayed together through the Communist victory, the disastrous Great Leap Forward, and the chaos of the Cultural Revolution.Min uses the facts of history and her lush, penetrating psychological imagination to take us beyond the myth of the person who so greatly influenced an entire generation of Chinese. The result is a complex portrait of a woman who railed against the confines of her culture, whose deep-seated insecurities propelled her to reinvent herself constantly, and whose ambition was matched only by her ferocious, never-to-be-fulfilled need to be loved. A daring narrative with all the compressed drama and high lyrical poetry of great opera, BECOMING MADAME MAO is the most ambitious and provocative work of Anchee Min's career.",
        "Category": " Fiction , Historical",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Complete Book of Horse Care",
        "Authors": "By Tim Hawcroft",
        "Description": "",
        "Category": "",
        "Publisher": "Howell Books",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "It's Hard to Be Five: Learning How to Work My Control Panel",
        "Authors": "By Curtis, Jamie Lee and Cornell, Laura (ILT)",
        "Description": "Jamie Lee Curtis and Laura Cornell, the #1 New York Times bestselling team behind Today I Feel Silly and I'm Gonna Like Me, return with It’s Hard to Be Five, a story of self-control and learning to do your best every day!Learning not to hit? Having to wait your turn? Sitting still? It's hard to be five!But Jamie Lee Curtis's encouraging text and Laura Cornell's playful illustrations make the struggles of self-control a little bit easier and a lot more fun. Kids will laugh in recognition of siblings, classmates, and friends—and maybe even themselves.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "One for Sorrow (A John the Eunuch Mystery)",
        "Authors": "By Reed, Mary and Mayer, Eric",
        "Description": "Byzantium, capitol of the 6th century Roman Empire, simmers a rich stew of creeds, cultures, and citizens with a sprinkling of cutthroats and crimes. John the Eunuch, Emperor Justinian's Lord Chamberlain, orders a Christian court while himself observing the rites of Mithra. Thomas, a knight from Britain, Ahasuerus, a soothsayer, and two ladies from Crete stir up events and old memories for John, who must ask how the visitors link to the death of Leukos, Keeper of the Plate. An Egyptian brothel keeper and a Christian stylite know more than they are telling....In due course, John gets his man - and a love scene....",
        "Category": " Fiction , Historical , General",
        "Publisher": "Poisoned Pen Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "On Economics and Society",
        "Authors": "By Harry G. Johnson",
        "Description": "",
        "Category": "",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Judge Sewall's Apology: The Salem Witch Trials and the Forming of an American Conscience",
        "Authors": "By Francis, Richard",
        "Description": "The Salem witch hunt of 1692 has entered our vocabulary as the very essence of injustice. Biographer and novelist Richard Francis looks at the familiar drama with fresh eyes, grasping the true significance of this cataclysm through the personal story of Samuel Sewall, New England Puritan, Salem trial judge, antislavery agitator, defender of Native American rights, utopian theorist, campaigner against periwigs, family man, gallant wooer.Sewall's life encompassed the tensions that faced the second-generation colonists, caught between the staunch conservatism of the Puritans and the possibilities their new world offered. Everywhere there was conflict, schism, and violence; the new Americans were pitted against the Native Americans, whose pagan ways terrified them, and a hostile mother country intent on imposing her control over the colony. Out of the struggle to maintain unity emerged the forces that drove the Salem tragedy. For the first time, Francis reveals the nature and scale of the threat the authorities believed they were facing.Five guilt-wracked years after pronouncing judgment at the trials, Sewall walked into his church in Boston and recanted the guilty verdicts, praying for forgiveness. This extraordinary act not only proved a turning point for Sewall, it marked the moment when modern American values and attitudes came into being -- the shift from an almost medieval and allegorical view of good and evil to a respect for the mysteries of the human heart.Drawing on Sewall's copious diaries, Francis enables us to see the early colonists not as grim ideologues but as flesh and blood idealists, striving for a new society while coming to terms with the desires and imperfections of ordinary life. Through this unsung hero of conscience, we gain access to the first lost frontier of the New World.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Overcoming Depression: Respected Reference for the Millions Who Suffer from Depression and Manic Depression and for Their Families",
        "Authors": "By Papolos, Janice and Papolos, Demitri F., M.D.",
        "Description": "A revised and updated guide to medical information provides practical advice and extensive information on Prozac and other antidepressants, the benefits of psychological treatments, the origins of depression, and more. Original.",
        "Category": "",
        "Publisher": "Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Death, Bones, and Stately Homes (Tori Miracle Mysteries, No. 5)",
        "Authors": "By Malmont, Valerie S.",
        "Description": "In Pennsylvania's Amish country, New York author Toni Miracle investigates the death of a landowner, poisoned after he agreed to the construction of a nuclear waste dump on his land. The dump is opposed by environmentalists.",
        "Category": " Fiction , Medical",
        "Publisher": "Daniel & Daniel Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2015"
        }
    }
]