[
    {
        "Title": "Great Carrier Aircraft",
        "Authors": "By Darman, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "Hunter Publishing+inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Abraham Lincoln: An Illustrated Biography",
        "Authors": "By Eliot, Alexander",
        "Description": "Traces the life and political career of Abraham Lincoln, describes his childhood and education, and examines his conduct of the American Civil War",
        "Category": " History , General",
        "Publisher": "Brompton Books Corp",
        "Price Starting With ($)": "5.23",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "A Paradise Out of a Common Field: The Pleasures and Plenty of the Victorian Garden",
        "Authors": "By Morgan, Joan and Richards, Alison",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Higher Education",
        "Authors": "By Mahaffey, Redge",
        "Description": "",
        "Category": "",
        "Publisher": "Ramsgate Pr",
        "Price Starting With ($)": "8.58",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Hard Bargain",
        "Authors": "By Shogan, Robert",
        "Description": "With Hard Bargain, Robert Shogan, the distinguished author of Riddle of Power and None of the Above, offers the definitive account of one of World War II's most dramatic chapters - the inside story of how Franklin D. Roosevelt secretly brokered a deal to provide the destroyers Churchill needed to save Britain from destruction, irrevocably altering the postwar world order. Not fully understood until now, this episode transformed the role of the American presidency and paved Roosevelt's way to a third term.At the center of the momentous events of 1940 are these two extraordinary leaders, whom Shogan brings to vibrant life: Churchill, the forthright pragmatist, and Roosevelt, the suave politician. As Hitler's war machine threatened to starve England into submission, these two men initiated a complex negotiation that would shatter all precedents for conducting foreign policy. FDR yearned to enter the war and defeat Hitler, but he was handcuffed by domestic politics, including his need to win a third term. Churchill had to plead for American intervention at a time when the United States was intensely isolationist. Drawing on archives on both sides of the Atlantic, Shogan masterfully re-creates the President's maneuvers as FDR stepped around the Constitution in order to cinch the deal, a move that has had repercussions from Korea to Vietnam and the Persian Gulf.Told with novelistic flair, Hard Bargain is a riveting contribution to history and a penetrating analysis of the abuses of presidential power.",
        "Category": " History , Military , World War II",
        "Publisher": "Scribner",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Learning a Trade: A Craftsman’s Notebooks: 1955-1997",
        "Authors": "By Price, Reynolds",
        "Description": "From Reynolds Price, much acclaimed author of award-winning novels, plays, poems, stories, and essays, comes a work that is unique among contemporary writers of American literature. For more than forty years, Price has kept a working journal of his writing life. Now published for the first time, Learning a Trade provides a revealing window into this writer’s creative process and craftsman’s sensibilities. Whether Price is reflecting on the rhythm of his day-to-day writing process or ruminating about the central character in what would become, for instance, Kate Vaiden—should she be a woman, what would be her name, why would the story be told in the first person?—he envelops the reader in the task at hand, in the trade being practiced. Instead of personal memoir or a collection of literary fragments, Learning a Trade presents what Price has called the “ongoing minutes” of his effort to learn his craft. Equally enlightening as an overview of a career of developing prominence or as a perspective on the building of individual literary works, this volume not only allows the reader to hear the author’s internal dialogue on the hundreds of questions that must be turned and mulled during the planning and writing of a novel but, in an unplanned way, creates its own compelling narrative.These notebooks begin in “that distant summer in dazed Eisenhower America,” a month after Price’s graduation from Duke University, and conclude in “the raucous millennial present” with plans for his most recent novel, Roxanna Slade. Revealing the genesis and resolution of such works as The Surface of Earth, The Source of Light, Kate Vaiden, Clear Pictures, and Blue Calhoun, Learning a Trade offers a rich reward to those seeking to enter the guild of writers, as well as those intrigued by the process of the literary life or captured by the work of Reynolds Price.",
        "Category": " Language Arts & Disciplines , Writing , General",
        "Publisher": "Duke University Press Books",
        "Price Starting With ($)": "6.63",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Using Information Technology: A Practical Introduction to Computers & Communications",
        "Authors": "By Clifford, Sarah Hutchinson, Williams, Brian K., and Sawyer, Stacey C.",
        "Description": "",
        "Category": " Computers , General",
        "Publisher": "Richard d Irwin",
        "Price Starting With ($)": "7.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Beyond Chicken Soup: A Collection of Contemporary and Traditional Food Favorites",
        "Authors": "By Jewish Home Auxiliary, Kuh, Lois M. (EDT), Gwirtzman, Wendy (ILT), and Bernstein, Pam (EDT)",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Jewish Home Auxiliary of",
        "Price Starting With ($)": "5.63",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Religious writer's marketplace: The definitive sourcebook",
        "Authors": "By Gentz, William H",
        "Description": "",
        "Category": "",
        "Publisher": "Running Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Call Girls",
        "Authors": "By Koestler, Arthur",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "April",
            "Year": "1973"
        }
    },
    {
        "Title": "Yellowstone: A Visitor's Companion (National Park Visitor's Companions)",
        "Authors": "By Wuerthner, George",
        "Description": "Discusses the history of the park, and describes its ecology, plants, wildlife, and environment",
        "Category": " Travel , Parks & Campgrounds",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Demeter's Daughters: The Women Who Founded America, 1587-1787",
        "Authors": "By Williams, Selma R.",
        "Description": "Recounts the lives and achievements of notable colonial American women who played significant roles in early settlement, in the various areas of colonial life, including business and politics, and in the shaping of American self-sufficiency and independence",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Dutch Shea, Jr.",
        "Authors": "By Dunne, John Gregory",
        "Description": "A man struggling desperately to escape the past is plunged into a future over which he has no control",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "Tells, tombs, and treasure;: A pictorial guide to Biblical archaeology",
        "Authors": "By Boyd, Robert T",
        "Description": "",
        "Category": "",
        "Publisher": "Baker Book House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Casebook of Sexual Abuse Treatment",
        "Authors": "By Friedrich, William N. (EDT)",
        "Description": "Fifteen case descriptions of sexually abused children in treatment bring forth several themes: no one treatment is appropriate for all sexually abused children, successful therapists extend themselves beyond the therapy hour to serve as advocates for the child, long-term treatment is usually required, interaction with social services is essential, psychological evaluations are useful. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Mencken (Maryland Paperback Bookshelf)",
        "Authors": "By Bode, Carl",
        "Description": "Views the distinguished editor's career from his beginnings as a Baltimore reporter, bringing into view his great influence on the American literary world in the twenties and thirties",
        "Category": "",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "The Washington Reporters",
        "Authors": "By Hess, Stephen",
        "Description": "In the vast literature on the way democratic governments work, the role of the press is often overlooked. Yet the press, no less than the formal branches of government, is a public policy institution and deserves to be included in explanations of the governmental process.  In The Washington Reporters, Stephen Hess focuses on those who cover the U.S. government for the American commercial news media. His book is based on interviews with reporters and editors and on responses to questionnaires from nearly half of the over 1,200 American reporters in Washington. Analysis of these responses and comparison with the content and placement of over 2,000 of these reporters' news stories permit an unusual&#151;and sometimes startling&#151;perspective on Washington newswork. Mr. Hess demonstrates, for instance, how information in the news regularly comes from the legislative branch of the government, despite the greater number of stories on the presidency; and he shows that Washington news dominates the front pages of daily newspapers across the country, no matter how little may be going on in the nation's capital.  The author concludes that \"Washington news gathering fragments [media] power, while at the same time it shifts decisions on what is news and how it should be covered to the reporters.\" The import of this impression is that \"reporters are not simply passing along information; they are choosing, within certain limits, what most people will know about government. The freedom given and assumed by these news workers affects the shape of national affairs.\"",
        "Category": " Language Arts & Disciplines , Journalism",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "6.07",
        "Publish Date": {
            "Month": "March",
            "Year": "1981"
        }
    },
    {
        "Title": "Home Improvement Cost Guide",
        "Authors": "By R. S. Means Com",
        "Description": "",
        "Category": "",
        "Publisher": "Misclenious Publishers",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Fresh Flower Arranging: A Year of Flowers : A Seasonal Guide to Selection, Design, and Arrangement",
        "Authors": "By Rose, Jerry, Shelkin, Lisa, Lee, Tim, and Mccandless, bruce",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Running Pr Book Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Arabia Imperilled: The Security Imperatives of the Arab Gulf States",
        "Authors": "By Hameed, Mazher A",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Mazher Hameed",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "Victorian Treasures: An Album and Historical Guide for Collectors",
        "Authors": "By Wallace, Carol McD and Ferrari, Maria (PHT)",
        "Description": "The Victorian Era (1837-1901) produced a tremendous outpouring of beautifully designed objects for domestic use - from finely crafted, handmade decorative art pieces to humble, machine-made household work tools. We treasure them all today as Victoriana: objects handed down from generation to generation, collected for their nostalgic, aesthetic, and investment value, displayed in museums and historic house restorations, and copied by commerical manufacturers of authentic reproductions.Victorian Treasures is a houseful of these beloved objects, a sumptuous photo album organized into six chapters, each devoted to a separate room in a typical Victorian house: the parlor, library, dining room, kitchen, bedroom, and nursery. The book presents a selection of 200 superb examples of both English and American Victoriana, from the familiar, such as highly collectible painted biscuit tins and silver matchsafes, to the esoteric and arcane, such as the mysterious hair receiver and the blessed birthing scissors.The extended captions that accompany the photos provide curious and entertaining information about the life of the Victorian home: how (and where) one bathed; what the children were allowed to eat; who sat where at the dinner table; and what really went on in the library.Like the objects it collects, Victorian Treasures is both beautiful and useful. An informal cultural history, it is an indispensable guide and a charming companion for all lovers of Victoriana - collectors, dealers, flea market shoppers and the proud owners of old family heirlooms.",
        "Category": "",
        "Publisher": "Harry N Abrams Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Andorra (Spotlight Drama Book)",
        "Authors": "By Frisch, Max",
        "Description": "",
        "Category": "",
        "Publisher": "Hill & Wang",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "United States Military Almanac",
        "Authors": "By Lang, Walt",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Crescent",
        "Price Starting With ($)": "6.76",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Erwin Bauer's Bear in Their World",
        "Authors": "By Bauer, Erwin",
        "Description": "Describes the characteristics, behavior, and range of black bears, grizzlies, brown bears, and polar bears, tells the stories of encounters with bears, and gives advice on nature photography",
        "Category": " Science , General",
        "Publisher": "Outdoor Life",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "A reader's guide to contemporary literary theory",
        "Authors": "By Selden, Raman",
        "Description": "",
        "Category": "",
        "Publisher": "University Press of Kentucky",
        "Price Starting With ($)": "5.92",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Aristocracy of Everyone",
        "Authors": "By Barber, Benjamin R",
        "Description": "Until now, the current crisis in education has been defined by controversy over what should be taught, who should be taught, and, increasingly who should pay for it. What is less discussed is what these questions mean for the future of our country our society, and our very value system, the basis of which is democracy. In this brilliant, controversial, and profoundly original book, Benjamin R. Barber fundamentally alters the terms of the current debate over the value of opportunity in American education, politics, and culture.",
        "Category": " Philosophy , History & Surveys , Ancient & Classical",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Writings on the Wall: Peace at the Berlin Wall",
        "Authors": "By Tillman, Terry",
        "Description": "Briefly describes the history of the Berlin Wall, shows its graffiti, and depicts the wall being torn down",
        "Category": "",
        "Publisher": "22/7 Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Sacred America: The Emerging Spirit of the People",
        "Authors": "By Housden, Roger",
        "Description": "Sacred America, in lucid and poetic prose, is the story of ordinary people who have dared to follow and trust the voices of their own souls in the midst of everyday life in the United States. It is also the story of another America, one not seen on the nightly news. What Roger Housden finds on his journey across the country suggests to him that, contrary to popular belief, the United States is among the most creative and spiritually vibrant cultures on earth. Sacred America is his proof.  Just as Alexis de Tocqueville set out across our country in search of democracy, so too did Housden, an Englishman, travel throughout the United States in the waning years of the twentieth century in search of this country's heart. He discovered that, despite or perhaps due to the moral turpitude of Wall Street and Capitol Hill, the spirit of the American people is flourishing. Americans are continually redefining what it means to be human, what they want from democracy, and, most important, how a democratic society is an expression of the sacred.  As an outsider, Housden was both surprised and impressed by what he found -- the extent to which the aspirations, genius, actions, wisdom, and compassion of people in all walks of life are woven into the social and cultural fabric of America. For Housden, this presence of Being in the midst of everyday life, rather than in formal places of worship (though he found it there too), is reinventing what a sense of the sacred means for the American individual at the turn of the millennium.  Sacred America acknowledges that a spiritual materialism prospers here to an extent that would stagger any European mind; spiritual techniques and teachings have become major product lines along with everything else. Yet Housden also finds a genuine human spirit flourishing, found in small-town Wyoming, on a bus ride to Manhattan, on a remote Indian reservation, in an artist's cave in New Mexico, in the life of a letter carrier in California, and even in Hollywood. Further, he finds groups of people coming together to share their various faiths in a truly open spirit: at Wellesley College in Massachusetts; among the politicians of Washington, D.C.; at Habitat for Humanity; at a retreat center for ex-cons in North Carolina; as well as in churches, at an Islamic conference, in Buddhist meditation centers, and in the traditional Hispanic faith in northern New Mexico.  What is significant, Housden discovers, is that no one is in charge of this emergence of the human spirit. No one is doing it. This other America -- so different from the image that much of the world holds of this country -- is not a cause that you fight for or a movement orchestrated by any religious or spiritual denomination. It is something at work, Housden suggests, in the collective psyche. It is something we participate in, rather than direct or control. A broader intelligence is at work not as some external force acting on us but from within us as a collective. It is changing the way Americans feel about themselves, restoring a sense of meaning and moral authority to the wellspring of individual conscience -- Housden calls it the intelligence of the knowing heart. Sacred America is emerging, Housden concludes, as that growing community of individuals who are interconnected not by the external dictate of creed or culture but by the prompting of the heart's intelligence.",
        "Category": " Religion , Spirituality",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Though None Go with Me",
        "Authors": "By Jenkins, Jerry B.",
        "Description": "Though None Go with Me is a unique heart-wrenching love story of an unforgettable woman and her determination to make her life an experiment in obedience to God. Elisabeth Grace LeRoy, born at the turn of the century, wants something more. Then one night as a young teen she finds that her heart has been yearning for. The defining moment in her life comes when she stands and promises to deepen her commitment and follow Christ, no matter the cost. So begins a remarkable journey of resolve, winding through valleys of loss and deserts of testing toward a legacy of faith. Two world wars, the Great Depression, and devastating personal loss form the backdrop for a lifetime of walking with God despite all odds. Though None Go with Me is a powerful novel depicting one courageous woman&apos; determination to stand faithful in all circumstances. It is a moving saga of forgiveness and peace amidst the loves, trials, and joys of an American family. And ultimately, it is a portrait of the far-reaching impact of a life that fully embraces the steadfast promises of God. Jerry Jenkins weaves a tale of yesterday that speaks with immediacy, conviction, and encouragement to the lives we live today.",
        "Category": " Fiction , Religious",
        "Publisher": "Zondervan Publishing House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The singles almanac: A guide to getting the most out of being single",
        "Authors": "By Ullman, Jeffrey",
        "Description": "",
        "Category": "",
        "Publisher": "Distributed in the U.S. by Ballantine Books",
        "Price Starting With ($)": "11.08",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Everybody Counts: A Report to the Nation on the Future of Mathematics Education",
        "Authors": "By National Research Council (U. S.) (CON)",
        "Description": "A popularized summary of the studies for the NRC by the Mathematical Sciences Education Board, the Board on Mathematical Sciences, and their joint Committee on the Mathematical Sciences in the year 2000. No index. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Education , Teaching Methods & Materials , Mathematics",
        "Publisher": "National Academies Press",
        "Price Starting With ($)": "19.7",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Drinks Without Alcohol: Nonalcoholic Slurpies & Smoothies, Cocktails & Punches, 200 Fresh, Fast & Fruity Little Sips and Great Big Gulps! Revised Edition",
        "Authors": "By Zingone, Robin (ILT) and Brandt, Jane",
        "Description": "Here are 200 outstanding drinks that are literally for the whole family, including the designated driver. First published in 1983, and now revised, updated, and rejacketed, Drinks Without Alcohol is a collection of luscious smoothies, shakes, punches, eggnogs, sodas, coolers, and knock-your-socks-off alcohol-free cocktails. There are hot drinks and cold, energizers and set-me-downs, drinks for chocolate lovers, drinks for coffee lovers, and a host of drinks especially appropriate for children's parties. Bottoms up!",
        "Category": " Cooking , Beverages , Non-Alcoholic",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "American Stories",
        "Authors": "By Trillin, Calvin",
        "Description": "Compiles twelve of the author's favorite nonfiction narratives that have appeared in \"The New Yorker,\" capturing the spirit and rich detail of American living",
        "Category": "",
        "Publisher": "Ticknor & Fields",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "The Runaway Universe : The Race to Discover the Future of the Cosmos (Helix Books)",
        "Authors": "By Goldsmith, Donald",
        "Description": "For decades, astronomers have sought to discover the ultimate fate of the univers. Will the cosmos continue forever in its expansion, which began billions of years ago with the big bang? Or will gravity someday reverse the process, producing a \"big crunch?\" Within the past few years, two rival groups of astronomers have announced a discovery that seems to resolve the issue: Instead of slowing down, the expansion of the universe seems to be accelerating. This finding has shaken the science of cosmology to its very foundation. This is the story of the astronomers who have stood the world of cosmology on its ear--and of their competitive race to discover the future of the cosmos. It is also an investigation into whether their remarkable findings will stand the test of time. If the new results are verified in the coming years, we will eventually find ourselves in a \"runaway universe,\" in which every bit of matter is extremely far from its closest neighbor. Then the cosmological constant, which Einstein once rued as his \"greatest blunder,\" will turn out to be one of his finest insights into the nature of space itself.A vivid picture of an unexpected turn of events, The Runaway Universe presents the startling new discovery that is revolutionizing our view of the cosmos.",
        "Category": " Science , Cosmology",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Uncivil Seasons",
        "Authors": "By Malone, Michael",
        "Description": "Detective Justin Savile, the charming, black-sheep scion of one of Hillston's ruling families, investigates the murder of a state senator's wife and finds his life threatened when his pursuit becomes awkward",
        "Category": " Fiction , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Keeper of the Doves",
        "Authors": "By Byars, Betsy Cromer",
        "Description": "For aspiring writer Amen McBee, life at the end of the nineteenth century with her four older sisters (Augusta, Abigail, and the \"Bellas,\" twins Annabella and Arabella) is full of adventure. There are visits from Grandmama, who teaches them how to use the new Kodak cameras, and there are plenty of places to explore on the family estate, the Willows. There is also a new baby to look forward to-and everyone hopes Papa's prayers will finally be answered and this time Mama will have a boy. The only trouble in Amen's life is Mr. Tominski, the strange old man who lives in the woods and keeps a trained flock of doves. The Bellas warn Amen that the dove keeper is not to be trusted but Amen's father insists that Mr. Tominski wouldn't hurt a soul. Who is right?",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Viking Juvenile",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Next Visitor to Planet Earth",
        "Authors": "By Michael Esses",
        "Description": "",
        "Category": "",
        "Publisher": "Logos International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1975"
        }
    },
    {
        "Title": "Joie Warner's Caesar Salads: America's Favorite Salad",
        "Authors": "By Warner, Joie and Warner, Drew (PHT)",
        "Description": "The author of the The Complete Book of Chicken Wings offers her exciting take on unique Caesar salads, creating new combinations and sprucing up some old standards, as twenty-five color photographs display such dishes as Seafood Caesar Salad and Caesar Pasta Salad.",
        "Category": " Cooking , General",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Seabiscuit: An American Legend (Special Illustrated Collector's Edition)",
        "Authors": "By Hillenbrand, Laura",
        "Description": "A deluxe illustrated edition of one of the most beloved books of our time, with nearly 150 historic photographs personally selected by the authorThe spellbinding true story of how three men and a great racehorse captivated a nation, Laura Hillenbrand’s Seabiscuit: An American Legend became an immediate number one bestseller and cultural phenomenon upon its publication in 2001. Named one of the best books of the year by more than twenty publications—including The New York Times, The Washington Post, Time, People, USA Today, and The Economist—Seabiscuit was also honored as the BookSense Nonfiction Book of the Year and the William Hill Sports Book of the Year, and was a finalist for several other major prizes, including the National Book Critics Circle Award and the Los Angeles Times Book Prize. For this lavishly illustrated special edition, author Laura Hillenbrand has written a new Introduction and selected nearly 150 rare photographs from historic archives and private collections. Seabiscuit tells the story of three remarkable men: Charles Howard, a bicycle repairman who made a fortune by introducing the automobile to the American West; Red Pollard, a failed prizefighter and failing jockey who was abandoned as a boy at a makeshift racetrack; and Tom Smith, an enigmatic mustang breaker who came from the vanishing frontier, bearing generations of lost wisdom about the secrets of horses.      In the sultry summer of 1936, the lives of these men converged around a bad-legged, floundering racehorse named Seabiscuit. Forming an improbable partnership, they transformed the horse into one of the most extraordinary competitors in sports history. In four tumultuous years, the rags-to-riches horse overcame a phenomenal run  of misfortune to emerge as an American cultural icon, drawing an immense following, prompting an avalanche of merchandising, and establishing himself as the single biggest newsmaker of 1938—receiving more coverage than FDR, Hitler, or any other public figure.Seabiscuit is an inspiring tale of unlikely heroes, a classic story of three embattled individuals  and a remarkable racehorse overcoming the odds in the Great Depression.",
        "Category": " History , United States , 20th Century",
        "Publisher": "Random House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Organize Your Office: Simple Routines for Managing Your Workspace",
        "Authors": "By Kelly, Kate and Eisenberg, Ronni",
        "Description": "Ronni Eisenberg, who lectures and gives workshops on organization skills throughout the U.S., is also author of the popular but slightly more intimidatingOrganize Yourself! Here she's brought a slew of practical tips for managing your workspace, from your briefcase to your bulletin board, from your e-mail inbox to those endless interruptions from coworkers.She covers the basics, including organizing your desktop and stemming the flood of junk mail (send a note to the Direct Marketing Association). She also hits upon modern organizational dilemmas, such as how to decide if you'd be better off with or without a PalmPilot. Some of the hundreds of handy tips she offers include:ways for making both in-person and telephone meetings quicker and more productive; methods for confronting procrastination and poor work habits; 10 rules to adhere to when filing; and 14 ways to make meetings run smoothly and accomplish what you want them to.Much of Eisenberg's advice is geared toward the executive; she advises closing your office door to really concentrate on big projects, something that the cubicle-bound can't do. But if you aspire to have that corner office, or if you're prone to losing important documents or rushing to big meetings several minutes late with sweat beading up along your forehead, Eisenberg's words of wisdom should help you get your act in gear.",
        "Category": " Business & Economics , Management",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Eartha",
        "Authors": "By DeLorme, Stick, David",
        "Description": "",
        "Category": "",
        "Publisher": "DELORME MAPPING",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "Savannah Spectres and Other Strange Tales",
        "Authors": "By Debolt, Margaret",
        "Description": "",
        "Category": " Body, Mind & Spirit , Unexplained Phenomena",
        "Publisher": "The Donning Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "The International cooks' catalogue",
        "Authors": "By Beard, James (INT)",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "7.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Richard Wright: Daemonic Genius : A Portrait of the Man a Critical Look at His Work",
        "Authors": "By WALKER, MARGARET",
        "Description": "A friend and fellow writer offers a portrait of the late American novelist, discusses his political beliefs, and looks at his major works",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "The Giant Book of Myths and Legends",
        "Authors": "By Mike Edited By: Ashley",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "My Mothers' Daughter (Single Titles)",
        "Authors": "By Orgel, Doris and Mandel, Peter (ILT)",
        "Description": "Leto, Artemis, Demeter, Persephone: Four goddesses, two mothers and their daughters. Here are their stories, told in the first person with grace and eloquence by Doris Orgel, who has often dealt with classical subjects in her many distinctive books for young people. An accessible text and handsome illustrations by Peter Malone make this a beautiful, as well as significant, book.",
        "Category": " Juvenile Fiction , Legends, Myths, Fables , Arthurian",
        "Publisher": "Roaring Brook Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Pat and Betty's No-Fuss Cooking: More Than 200 Delicious, Time-Saving, and Easy Recipes From the Reynolds Kitchens",
        "Authors": "By Schweitzer, Patricia A. and Morton, Betty T.",
        "Description": "Pat & Betty show you how to . . . Wrap it up, Cook it up, & Serve it up, with no Cleanup!More Than 200 Delicious, Time-Saving, and Easy Recipes from the Reynolds Kitchens.America has fallen in love with Pat and Betty--television's favorite home economists. Now for the first time, Pat and Betty share their favorite recipes, tips, and shortcuts!Known to millions as the voice of Reynolds products, Pat and Betty appear regularly on TV, radio, and the internet. Now, for the first time, these home economists share over 200 no-fuss recipes for everything from appetizers, main courses, vegetables, and desserts, using foil, oven bags, plastic wrap, and other products. Also included in this cookbook is a special holiday cooking section to help you plan and cook a delicious meal for those large family gatherings. Pat and Betty guide you with time-saving tips and shortcuts. A cookbook that no home should be without, Pat & Betty's No-Fuss Cooking will ensure that you spend less time in the kitchen, and more time with family and friends.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Galactic Club: Intelligent Life in Outer Space",
        "Authors": "By Bracewell, Ronald Newbold",
        "Description": "",
        "Category": "",
        "Publisher": "W.H.Freeman & Co Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Ill Wind",
        "Authors": "By Anderson, Kevin J. and Beason, Doug",
        "Description": "A supertanker has crashed off the shores of San Francisco, producing the largest oil spill in history. Desperate to avert an ecological - and public relations - disaster, a multinational oil company releases an untested virus designed to break up the spill. A virus that spreads like wildfire on the wind, destroying anything made of petroleum - destroying gasoline in automobile tanks, plastic, nylon, the very fabric of modern civilization itself.Dr. Spencer Lockwood, one of the few scientists to recognize the danger, tries to alert government and industry to the impending danger. But his warnings go unheeded and the devastation mounts. As America descends into savagery, Lockwood forges a courageous band of scientists to carry out a daring plan to restore order. But humanity's last hope may be snuffed out by a ruthless general driven by an insatiable desire for power.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Forge",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Award-Winning Chicken",
        "Authors": "By Publications International",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "America and Its Cuisine",
        "Authors": "By Adams, Jane",
        "Description": "A collection of favorite recipes from the major regions of the United States, including dishes for every course of the meal",
        "Category": " Cooking , General",
        "Publisher": "Bdd Promotional Book Co",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "The February plan;",
        "Authors": "By Roberts, James Hall",
        "Description": "",
        "Category": "",
        "Publisher": "Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "A Face First",
        "Authors": "By Cummings, Priscilla",
        "Description": "Twelve-year-old Kelley decides to cut off contact with her friends and classmates after suffering third-degree burns to her face and body in a car accident near her home on Maryland's Kent Island.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Dutton Juvenile",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "If Life Is a Game These Are the Rules",
        "Authors": "By Carter-Scott, Cherie",
        "Description": "",
        "Category": "",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Walt Disney's Treasury of Cartoon Classics",
        "Authors": "By Geis, Darlene",
        "Description": "A collection of fairy tales, folklore, fables, original stories, and poems illustrated with scenes from Walt Disney films. Also includes a brief history, analysis, and filmography of the Silly Symphonies, seventy-six short films produced between 1929 and 1939.",
        "Category": "",
        "Publisher": "Harry N Abrams Inc",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "The Snake Game",
        "Authors": "By Johnson, Wayne",
        "Description": "Chronicles the lives and fates of a group of Native Americans along the Minnesota/Canada border and the young white man drawn into their world",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Barriers to European Growth: A Transatlantic View",
        "Authors": "By Lawrence, Robert Z. and Schultze, Charles L. (EDT)",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Brookings Inst Pr",
        "Price Starting With ($)": "6.08",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Patchwork Pillows",
        "Authors": "By Levy, Judy",
        "Description": "",
        "Category": "",
        "Publisher": "Dover Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "Chinese regional cooking",
        "Authors": "By Lo, Kenneth H. C.",
        "Description": "",
        "Category": "",
        "Publisher": "Pantheon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Uncle Sam's 200th Birthday Parade",
        "Authors": "By Shapiro, Irwin",
        "Description": "The animal inhabitants of Forest Town present a pageant of the history of the United States in honor of Uncle Sam's 200th birthday.",
        "Category": "",
        "Publisher": "Golden Press/Western Pub Co.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1974"
        }
    },
    {
        "Title": "France For Dummies (Dummies Travel)",
        "Authors": "By Porter, Darwin, Prince, Danforth, and Pientka, Cheryl A.",
        "Description": "Your insider?s guide to the best places and pricesHave fun exploring FranceFrom the romance of Paris and the glamorous Riviera to the castles of the Loire Valley and the half-timbered houses of Normandy, France is a traveler?s paradise. But where to begin? Relax! This friendly guide shows you the way. Bon voyage!Discover:Down-to-earth trip-planning adviceWhat you shouldn?t miss ? and what you can skipThe best restaurants and hotels for every budgetLots of detailed maps",
        "Category": " Travel , Europe , France",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Simple Southwest Cooking",
        "Authors": "By Walker, Judy Hille",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , Southwestern States",
        "Publisher": "Cooper Square Publishing Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The Comeback Kids: A Fan Relives the Amazing Baltimore Orioles 1989 Season",
        "Authors": "By Keplinger, Steve",
        "Description": "",
        "Category": "",
        "Publisher": "Pub Place",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "What To Expect When Your Wife Is Expanding",
        "Authors": "By Hill, Thomas and Merrell, Patrick (ILT)",
        "Description": "A humorous, tongue-in-cheek guide for fathers-to-be discusses each month of pregnancy and features such sections as \"What Your Wife Will Be Complaining About\" and \"What to Ask Your Wife to Show You Are Concerned.\" Original.",
        "Category": " Humor , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Pearl Harbor Ghosts: A Journey to Hawaii Then and Now",
        "Authors": "By Clarke, Thurston",
        "Description": "Investigates questions surrounding the December 7, 1941 attack and examines how that event is interwoven with the rise of Japanese economics and our response to it",
        "Category": " History , Military , World War II",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Front Pages (an exhibition catalogue)",
        "Authors": "By Corcoran Gallery of Art (COR), Chunn, Nancy, and Indiana, Gary",
        "Description": "The artist uses rubber stamps and pastels to alter and enhance the front page of the New York Times for each day of 1996",
        "Category": " Art , Collections, Catalogs, Exhibitions , General",
        "Publisher": "Rizzoli International Publications, Inc.",
        "Price Starting With ($)": "7.46",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Reporting America at War: An Oral History",
        "Authors": "By Ferrari, Michelle (EDT) and Tobin, James (EDT)",
        "Description": "Whether dodging sniper fire, accompanying strategic bombing raids over enemy territory, challenging the Pentagon's version of events, or crossing the frontlines to interview figures at the heart of the conflict, war correspondents have served as the eyes and ears of the nation, conveying the facts, the brutality and the drama of warfare, and shaping public opinion in the process. Now for the first time, in Reporting America at War, the nation's most respected reporters share their stories to create a fascinating oral history.",
        "Category": " Social Science , Media Studies",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "World Traveler: Ireland",
        "Authors": "By O'Shea, Coleen",
        "Description": "",
        "Category": "",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "POTATOES P (Particular Oalate Cookbook Series)",
        "Authors": "By Kreitzman, Sue",
        "Description": "Discusses the history of the potato and gathers recipes for soups, gratins, casseroles, salads, desserts, and other dishes featuring potatoes",
        "Category": " Cooking , Specific Ingredients , Vegetables",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Islands of Truth: A Mathematical Mystery Cruise",
        "Authors": "By Peterson, Ivars",
        "Description": "Peterson ( The mathematical tourist ) explores topics at the frontier of mathematics research, among them: new developments in fractal geometry, applications of number theory, computer graphics, and artificial intelligence. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "W H Freeman & Co",
        "Price Starting With ($)": "5.77",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "The Day The Martians Came (A Thomas Dunne Book)",
        "Authors": "By Pohl, Frederik",
        "Description": "Examines what happens to a Hollywood screen writer, a Russian emigre, a young man in a cult religion, a couple of flying saucer fakers, a space scientist, and a drug addict when real, live Martians are discovered",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "St Martins Press",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "George IV (Pocket Biographies)",
        "Authors": "By De-La-Noy, Michael",
        "Description": "",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Sutton Publishing",
        "Price Starting With ($)": "5.66",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Sensational Salads",
        "Authors": "By Evans, Michele",
        "Description": "Gathers recipes for salads featuring beans, lentils, grain, cheese, eggs, fruit, greens, pasta, potatoes, rice, vegetables, meat, poultry, and seafood",
        "Category": " Cooking , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "J.K. Lasser's Pick Winning Stocks",
        "Authors": "By Mrkvicka, Edward F., Jr.",
        "Description": "A Simple, Breakthrough Stock-Picking System! Pick winning stock after winning stock with nationally recognized financial expert Edward F. Mrkvicka, Jr. Using his proven Trinity Trading System, anyone can enter the market and profit, whether you?re a beginning investor on the Internet or a professional trader who needs to supercharge a portfolio. J.K. Lasser?s Pick Winning Stocks will put power into your investing as you scan key indicators listed daily in the Wall Street Journal. Then, the resistance barrier breakthroughs you chart today will begin rewarding you with a lifetime of significant returns. This easy-to-understand guide isn?t like other investing systems on the market, yet it is so clear and safe, you?ll be recognizing buy and sell signals in minutes?with or without a broker. Critical coverage will help you:Locate information you thought was available only to Wall Street insiders?and put it to use energizing your investmentsTake the \"emotion\" out of placing or canceling an order by picking stocks objectively and confidentlyIncrease profitability, no matter what kind of market conditions you?re investing in",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Restructuring World Economy",
        "Authors": "By Kolko, Joyce",
        "Description": "An analytical account of the current crisis in global capitalism, this study surveys the states of global eonomics, including the problems confronting socialist and Third World countries and how they relate to the economics of the industrialized West",
        "Category": "",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Florida's Fabulous Waterbirds: Their Stories",
        "Authors": "By Williams, Winston",
        "Description": "",
        "Category": " Nature , Birdwatching Guides",
        "Publisher": "World Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1983"
        }
    },
    {
        "Title": "Genius: a Mosaic of One Hundred Exemplary Creative Minds",
        "Authors": "By Bloom, Harold",
        "Description": "",
        "Category": "",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "12.48",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "MHQ: The Quarterly Journal of Military History: Summer 1991 - Volume 3, Number 4",
        "Authors": "By Cowley, Robert (Editor)",
        "Description": "",
        "Category": "",
        "Publisher": "MHQ Inc",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Celtic Design Coloring Book (Dover Design Coloring Books)",
        "Authors": "By Sibbett",
        "Description": "The designs in Celtic illuminated manuscripts represent a distinctive fusion of native Irish, Germanic, and Near Eastern motifs. Graphic artist Ed Sibbett has brilliantly captured the intricacy and beauty of this original art tradition in 37 drawings based on illustrations in the Book of Durrow, the Gospels of St. Willibrord, and the illustrious Book of Kells. Among the motifs are the characteristic Celtic interlacings, geometric-animal combinations, and decorative initials, plus powerful ornaments and symbolic abstractions of animals and people. A portrait of St. Matthew appears as a centerspread, not backed up, that may be taken out and framed. Captions identify the source of each picture and explain the iconography.",
        "Category": " Juvenile Fiction , Activity Books",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1979"
        }
    },
    {
        "Title": "The Rough Guide to Scotland (3rd Edition)",
        "Authors": "By Humphreys, Rob",
        "Description": "",
        "Category": " Travel , Europe , Great Britain",
        "Publisher": "Rough Guides",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "The Enthusiast: A Life of Thornton Wilder",
        "Authors": "By Harrison, Gilbert A.",
        "Description": "",
        "Category": "",
        "Publisher": "Ticknor & Fields",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Women Together a History In Documents Of",
        "Authors": "By J. Papachristou",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Making the Transition to a Macrobiotic Diet: A Beginner's Guide to the Natural Way of Health",
        "Authors": "By Heidenry, Carolyn",
        "Description": "",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Avery",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "The Quest for God: A Personal Pilgrimage",
        "Authors": "By Johnson, Paul",
        "Description": "In this probing, challenging and personal account of his feelings about God and religion, Paul Johnson shares with others the strength and comfort of his own faith. Informed by his great knowledge of history, The Quest for God is written with force, lucidity and eloquence by the author of Intellectuals, Modern Times, A History of the Jews and other works.",
        "Category": " Religion , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Lifestyle Origami (Origami Today)",
        "Authors": "By Hill, Mark (PHT) and Ansill, Jay",
        "Description": "Introduces the basic materials, folds, bases, and symbols of origami, and provides instructions for creating a number of decorative objects",
        "Category": "",
        "Publisher": "Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Cat Crafts. Cat Designs and Themes.",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "At Home with the French Classics",
        "Authors": "By Grausman, Richard",
        "Description": "Despite our growing kitchen savvy, many Americans still find French food too intimidating, too time-consuming, and too complicated. Richard Grausman, a well-known teacher of French cooking, has had a long-time mission to dispel this fear and make French cooking accessible and understandable to the American home cook. The result? AT HOME WITH THE FRENCH CLASSICS.  This compendium of over 250 classic and traditional French dishes offers recipes that are not only approachable, but are also geared to the contemporary American lifestyle. The author has cut back on salt, fat, eggs, butter, and cream without any loss of authenticity or taste. The recipes have been streamlined by the use of modern appliances. Certain classic techniques, which are neither sensible for the modern kitchen nor vital for the recipe's success, have been revised or eliminated. Mediterranean Fish Soup. Roquefort Cheese Souffle. Zucchini stuffed with Mushrooms and Ham. Broiled Baby Chickens with Herbs and Mustard. Poached Chicken with Creamy Tarragon Sauce. Pepper-Coated Steak with Cognac and Cream. Rack of Lamb with Watercress. And for dessert, Pears Poached in Port Wine, Chocolate Mousse, and Rich Vanilla and Chocolate Custards. Starting with first courses and ending with after-dinner chocolates, the book contains dozens of possibilities for entertaining. Many of the dishes can be made ahead of time. Others can be made in stages, from days to weeks in advance. Selection of Better Homes & Gardens Family Book Service and Book-of-the-Month Cooking & Crafts Club. 82,000 copies in print.",
        "Category": " Cooking , Regional & Ethnic , French",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Southwest Tastes: From the Television Series Great Chefs of the West",
        "Authors": "By Brown, Ellen",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , Southwestern States",
        "Publisher": "Great Chefs Pub",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Betty Crocker's 1-2-3 Dinner: 350 Quick and Delicious Supper Solutions",
        "Authors": "By Crocker, Betty",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "General Mills",
        "Price Starting With ($)": "5.18",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Rainbows, Snowflakes, and Quarks: Physics and the World Around Us",
        "Authors": "By Von Baeyer, Hans Christian",
        "Description": "Discusses the principles of physics at work in a variety of everyday occurrences including whirlpools, lightening, waves, warmth, and motion",
        "Category": " Science , General",
        "Publisher": "Mcgraw Hill",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1984"
        }
    },
    {
        "Title": "Misadventures of an American Abroad: Big Brother Exposed",
        "Authors": "By Tyrrell, Albert",
        "Description": "",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "Terril Pub",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Girlfriends",
        "Authors": "By Deeble, Sandra and Duchars, Dan (PHT)",
        "Description": "",
        "Category": " Family & Relationships , Friendship",
        "Publisher": "Ryland Peters & Small",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Ireland: A Cultural Encyclopedia",
        "Authors": "By De Breffny, Brian (EDT)",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Facts on File, NY",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Gabby Growing Up",
        "Authors": "By Hest, Amy and Schwartz, Amy (ILT)",
        "Description": "The creators of The Purple Coat present a sequel to their Christopher Award-winner, in which Gabby prepares for a day of ice-skating to celebrate Grampa's birthday, worrying whether he will like her new grown-up haircut.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Simon & Schuster Children's Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "A Day in a Life of a Police Officer (Level 1: Beginning to Read)",
        "Authors": "By Hayward, Linda",
        "Description": "Officer   Ann Young and her partner drive their police car down the street. A little boy is lost. Can they help him? This unique Level 1 series accurately portrays real-life situations   that help young children  identify with   and learn from while helping them improve their reading skills.Stunning photographs combine with lively illustrations and engaging, age-appropriate stories in DK Readers, a multilevel reading program guaranteed to capture children's interest while developing their reading skills and general knowledge. With DK Readers, children will learn to read—then read to learn!",
        "Category": " Juvenile Nonfiction , Art , General",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "The Runaway Soul",
        "Authors": "By Brodkey, Harold.",
        "Description": "Adopted as a child in 1930, Wiley Silenowicz is raised in the St. Louis home of his cousins, S.L. and Lila Silenowicz, and their daughter, Nonie, in a coming-of-age story that follows Wiley from childhood to adulthood",
        "Category": " Fiction , General",
        "Publisher": "Farrar Straus Giroux",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Customer Service For Dummies?",
        "Authors": "By Leland, Karen and Bailey, Keith",
        "Description": "Provides suggestions for improving customer service, including how to use surveys to understand customer needs, how to develop staff training programs, and how to reduce stress",
        "Category": " Business & Economics , Customer Relations",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "All You Really Need To Know About Prayer You Can Learn From The Poor",
        "Authors": "By Perrotta, Louise and Fontana, Gina (PHT)",
        "Description": "",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Charis/Servant Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Everyday Science Explained",
        "Authors": "By Suplee, Curt",
        "Description": "With hundreds of photographs, with specially commissioned illustrations, and with great good humor, Everyday Science Explained takes on the hows and whys of the science that shapes our daily lives. The first two chapters transform the often intimidating field of physics into a true joyride. Chapter three does the same for chemistry, while the final chapter explores the wonders of human biology and biochemistry. Throughout, in design as well as in content, this book is highly user-friendly. While it can be read cover to cover, it also lends itself readily to nonlinear browsing.",
        "Category": " Science , General",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "7.17",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Create And Celebrate!",
        "Authors": "By Rochelle Jay",
        "Description": "",
        "Category": "",
        "Publisher": "Fortress Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    }
]