[
    {
        "Title": "The wisdom of Jesus",
        "Authors": "By Trimiew, Anna",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "FOR THE LIFE OF YOUR DOG: A Complete Guide to Having a Dog From Adoption and Birth Through Sickness and Health",
        "Authors": "By Louganis, Greg and Siino, Betsy Sikora",
        "Description": "Four-time Olympic gold medalist Greg Louganis triumphed with his #1 New York Times bestselling autobiography Breaking the Surface. That heartfelt, revelatory book would not have been complete without the loving portrayals of his protectors and closest friends: his dogs. Now Greg, a breeder and trainer of Harlequin Great Danes, has teamed up with award-winning animal writer Betsy Sikora Siino to create an extraordinary guide to dog ownership that overflows with insight, intelligence, and compassion. With the same winning spirit he brought to world-class diving, Greg embraces the challenges and joys of living with dogs -- and shares his incredible bond and insider's knowledge that has produced best-of-breed winners. His distinctive philosophy illuminates every page of this special volume that keeps the dog's best interests in mind throughout every phase of life -- as puppies, in their prime, and in the final years.  In matters of choosing a new dog, basic care, and specific health and behavioral concerns, Greg tells owners where to be tough (on sales contracts), where to be accommodating (with blind and deaf dogs) and everything in between. Passionate in his opinions and wonderfully effective, Greg includes:   Cures for chewing, barking, biting, and other so-called behavior problems Answers to the great housetraining disputes including the pros and cons of crating Specific feeding programs for optimal nutrition -- and for combating the greatest health threat to your dog: obesityAn exercise program for the canine athlete (and they're all athletes!)Training tips for obedience, showing, and search-and-rescuePreventive medicine, common illnesses from nose to tail, and age-related concernsAdvice on breeding, whelping, adopting your second (third, fourth...) dogs, and more!   Woven throughout are Greg's moving stories of his own dogs, such as his beloved Dane Ryan, who taught him to communicate with a dog who couldn't hear, and the hardships of saying goodbye to Donna, whose early death broke his heart.  For The Life of Your Dog is an inspiring and eye-opening reference. Delivered with Greg's delightful candor, his sound advice makes it a classic for new and long-time dog owners -- and anyone who has ever loved a dog.",
        "Category": " Pets , Dogs , General",
        "Publisher": "POCKET",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Santabear's first Christmas",
        "Authors": "By Read, Barbara, Lewis, Howard B.",
        "Description": "Relates how a young polar bear, separated from his family in the North and living with new friends in a forest, earned the nickname of Santabear one Christmas.",
        "Category": "",
        "Publisher": "Santabear Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "A Kwanzaa Fable",
        "Authors": "By Copage, Eric V.",
        "Description": "Resenting the difficult responsibilities that are thrust upon him after his father's death, thirteen-year-old Jordan reluctantly helps his younger siblings and learns how the seven principles of Kwanzaa can be applied to everyday life. 30,000 first printing.",
        "Category": " Religion , Ethnic & Tribal",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Consumer Bible: Completely Revised",
        "Authors": "By Green, Mark J. and Youman, Nancy",
        "Description": "To address the needs of an ever-more-complex marketplace, Mark Green and co-author Nancy Youman have completely revised and updated The Consumer Bible, and added four chapters of all-new material. Green, a former top associate of Ralph Nader and current Public Advocate for the City of New York, incorporates new tips, strategies, and on-line information to guide consumers to the get the best in essential goods and services, and to avoid scams and schemes. The 65 chapters cover it all: food, health care, insurance, financial services including on-line trading, automobiles, travel and vacations, lawyers, outlet shopping, cable and direct satellite television, tax-preparation software, organic produce, buying a computer--even the best and worst times to purchase a product or service.And the authors and publisher so believe in this book that it comes with a guarantee: You'll save money with The Consumer Bible or get your money back. It demands to be placed at the top of every shopper's list.48,000 copies in print.",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "I Ain't Got Time to Bleed: Reworking the Body Politic from the Bottom Up",
        "Authors": "By Ventura, Jesse",
        "Description": "When he left the navy SEALs to become a pro wrestler, the fans knew him as \"Jesse, the Body.\"When he hosted his hard-hitting KFAN radio talk show, he became \"Jesse, the Mouth.\"And now that this body-slamming, straight-talking, charismatic hero is masterminding Minnesota's gubernatorial decisions, you'd better start calling him \"Jesse, the Mind.\"In I Ain't Got Time to Bleed, Jesse Ventura reveals the secret of his landslide electoral success—with record voter turnout—and maps his innovative strategies for pioneering  a new era in American government.  In his own inimitable words, he takes on bloated government, career politicians, and apathetic voters, and tells the wildly colorful story of his days as a navy SEAL, his nights in the pro-wrestling ring, and his experiences on radio and in films like Predator and Batman and Robin .I Ain't Got Time to Bleed is Rocky meets Mr. Smith Goes to Washington—a book that will challenge readers' ideas of traditional government as it introduces them to one of American politics' most ferocious new heroes.",
        "Category": " Political Science , American Government , State",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "At a Journal Workshop: The Basic Text & Guide for Using the Intensive Journal Process",
        "Authors": "By Progoff, Ira",
        "Description": "",
        "Category": " Self-help , Creativity",
        "Publisher": "Dialogue House Library",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1975"
        }
    },
    {
        "Title": "Making Sense of Adoption: A Parent's Guide",
        "Authors": "By Melina, Lois Ruskai",
        "Description": "When to tell, What to tell, and How to tellChildren who are adopted have predictable and often unspoken concerns about themselves and how they joined their families. In this wise and timely guide, Lois Melina, author of the classic manual Raising Adopted Children, helps parents anticipate and respond to those concerns in ways that build self-esteem. Through sample conversations, reassuring advice, and age-specific activities parents will find answers to such questions as:-- When should I give my child the letter her birthmother wrote?-- How do I share information that might upset my child?-- How can I know when my child is wondering about adoption?-- What should I tell school personnel about my child's history?    What about family and friends?-- How can I be sure we talk about adoption enough, but not too much?Whether parents adopted traditionally, as stepparents, or through donor insemination, surrogacy, or in vitro fertilization, Making Sense of Adoption will open the door to a lifetime of growth and understanding for adoptive families.",
        "Category": " Family & Relationships , Adoption & Fostering",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Hearts: Interior Decorating Effects With Stamps (Stampability Books)",
        "Authors": "By Walton, Stewart, Walton, Sally, and Rae, Graham (PHT)",
        "Description": "",
        "Category": " House & Home , Decorating",
        "Publisher": "Lorenz Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Perfect Women: Hidden Fears of Inadequacy and the Drive to Perform",
        "Authors": "By Dowling, Colette",
        "Description": "Profiles the all-too-common woman of today, one who is self-disparaging and desperate to be perfect, and paints a healthy and reasonable alternative portrait emphasizing self-respect and self-worth",
        "Category": " Psychology , General",
        "Publisher": "Summit Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "The Mormon Tabernacle Choir",
        "Authors": "By Calman, Charles Jeffrey",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "October",
            "Year": "1979"
        }
    },
    {
        "Title": "When the Fat Lady Sings: Opera History As It Ought To Be Taught",
        "Authors": "By Barber, David W.",
        "Description": "When The Fat Lady Sings: Opera History As It Ought To Be Taught is David W. Barber's third foray into the dangerous realm of musical humour.",
        "Category": " Music , Genres & Styles , Opera",
        "Publisher": "Sound And Vision",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Easy As Pie: Shortcuts to Making Fabulous Desserts (Memories in the Making Series)",
        "Authors": "By Childs, Anne Van Wagner (EDT)",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Pies",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Dumpling Cookbook",
        "Authors": "By Polushkin, Maria",
        "Description": "A collection of recipes extolling the delights of an international sampling of dropped dumplings, filled dumplings, fruit, vegetable, fish, and other fritters, and various sweet dumplings",
        "Category": " Cooking , Regional & Ethnic , Chinese",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The Consumer Bible: 1001 Ways to Shop Smart",
        "Authors": "By Green, Mark J.",
        "Description": "A guide to savvy shopping, by New York City's public advocate, includes sixty-five chapters on various goods and services, with tips on avoiding common traps and advertising hype. By the author of Who Runs Congress? Original. Tour.",
        "Category": "",
        "Publisher": "WORKMAN PUBL.",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Real Characters in the Making (Devotionals for Teens, #4)",
        "Authors": "By Peterson, Lorraine",
        "Description": "Stories of thirteen prominent Old Testament characters form the basis of thirteen weeks of daily lessons presenting issues common to today's teens and the Biblical heroes.",
        "Category": " Religion , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Ship of Gold in the Deep Blue Sea",
        "Authors": "By Kinder, Gary",
        "Description": "In one of the most exciting adventure stories of our time, Gary Kinder combines maritime disaster with visionary underwater technology. In September 1857, the SS Central America, a side-wheel steamer carrying passengers returning from the gold fields of California, went down during a hurricane off the Carolina coast. It would be the worst peacetime disaster at sea in American history, claiming more than 400 lives and 21 tons of gold. In the 1980s a maverick engineer named Tommy Thompson set out to find the wreck of the Central America and salvage its treasure from the ocean floor. With nail-biting suspense, Kinder reconstructs the terror of the Central America's last days, when passengers bailed sea water from the hold, then chopped up the ship's timbersto use as impromptu life rafts before being cast into the sea themselves. He goes on to chronicle Thompson's epic quest for the lost vessel, an enterprise marked by hair-raising weather, the hostility of the deep ocean at 8,000 feet, highly experimental technology, and unscrupulous rival treasure-hunters. The result is a magnificent tale, filled with heroism, entrepreneurialism, and perseverance.The entrepreneur describes his efforts to locate the ship which sank off the coast of the Carolinas in 1857, carrying more than four hundred people and twenty-one tons of gold",
        "Category": " History , United States , 19th Century",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Wednesday the Rabbi Got Wet",
        "Authors": "By Kemelman, Harry",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1981"
        }
    },
    {
        "Title": "Condi vs. Hillary: The Next Great Presidential Race",
        "Authors": "By Morris, Dick and McGann, Eileen",
        "Description": "Who will be president in 2008? Many believe that the White House is Hillary Clinton's to lose. As long-time strategists Dick Morris and Eileen McGann reveal in Condi vs. Hillary, however, Hillary's plans for higher office are vulnerable to a challenge from a most unexpected quarter: the Bush administration's secretary of state and former national security advisor, Condoleezza Rice.Rice is the only figure on the national scene who has the credentials, the credibility, and the charisma to lead the GOP in 2008. And, as this first book on the subject demonstrates, a race between these two commanding, but very different, women is a very real possibility -- and would inevitably prove one of the most fascinating and important races in American history.Blending insider insight and political foresight, Condi vs. Hillary surveys the strengths and weaknesses of the two candidates, finding persuasive clues about what we might expect from each of them as a chief executive. It traces their very different childhoods -- Hillary Rodham's in unchallenging suburban comfort, Condi Rice's in Birmingham, Alabama, during the civil rights era -- and finds in each the roots of their latter-day selves. It explores their career in public life -- Hillary's as an ambitious liberal who attached herself to a governor on the rise, Condi's as a woman of broad and deep talents who has earned her own way. It turns a discerning eye on how each has spent her time in government, contrasting Condi's growth and maturation in office with Hillary's record of underachievement as both first lady and senator from New York. And it reveals how a draft-Condi movement could sweep the secretary of state into the presidency even as she forgoes campaigning to address her responsibilities as secretary of state.America, in short, may be on the verge of a perfect storm of twenty-first-century politics, pitting two of America's most popular -- and controversial -- women against each other, and offering Americans a choice between fulfilling the ambitions of one of our most polarizing figures . . . or changing history by electing not just the first woman, but also the first African American woman, to lead the free world into the future.",
        "Category": " Political Science , Political Process , Campaigns & Elections",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Last on the menu,",
        "Authors": "By Sister Eleanor Quin",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Jewish Dimensions of Social Justice: Tough Moral Choices of Our Time",
        "Authors": "By Vorspan, Albert and Saperstein, David",
        "Description": "This is an updated successor to the authors' Tough Choices (1992). Examines social issues through the lens of Jewish practice and belief, and brings together analysis of issues such as bioethics, AIDS, gun control, economic justice, the environment, international affairs, civil rights, religion, and the changing Jewish family.  No index. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "URJ Press",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Bill Clinton's Little Black Book",
        "Authors": "By Barrett, Ron and Smith, Richard W.",
        "Description": "Kenneth Starr would love to have it.Now it's yours--for just $7.95.Everybody has his secrets, but our president has a few more than most. Now, newly unearthed--and re-created here in its entirety--is Bill Clinton's private little black book. They're all here: Gennifer, Paula, Monica--and many more you haven't heard about. Yet.        From the Oval Office to your home: a completely fabricated, meticulous reproduction--including the president's private entries, jottings, and doodles. Finally, we can all see what is going on in the mind of the leader of the free world: He only wants one thing--and it's not a balanced budget.",
        "Category": " Humor , Topic , Political",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Guide to the national park areas (Guide to the National Park Areas, Western States)",
        "Authors": "By David L. Scott",
        "Description": "Describes the history, facilities, and outdoor activities featured at national parks west of the Mississippi and includes addresses and phone numbers for visitor centers",
        "Category": "",
        "Publisher": "Globe Pequot Press",
        "Price Starting With ($)": "5.6",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The YOUNGEST MINDS : Parenting and Genetic Inheritance in the Development of Intellect and Emotion",
        "Authors": "By Barnet, Richard J. and Barnet, Ann B.",
        "Description": "Drawing on insights from recent advances in neuroscience and psychological research, The Youngest Minds offers a new look at how children learn language, establish emotional ties, gain control of their own emotions, and embrace moral values. The authors discuss recent research and theory about the effects of early experience on the physiology of the brain. They show how a child's genetic inheritance and experiences interact at many different levels. The capacities for language, emotional development, and moral understanding are inborn, but they are fine-tuned by human relationships that influence the landscape of the brain.  The Youngest Minds explains how parents and other caregivers support the intertwined processes of language, intellectual, and emotional development with the experiences they provide for a baby. Through daily interactions, infants establish ways of responding that will influence them all their lives.  The preschool years are critical in the lives of children because their brains are developing more rapidly than at any other time in life. In these years, children are especially dependent on parents and other primary caregivers to meet their needs for love, security, stimulation, and challenge. The Barnets describe how children learn to control their anger, consider the feelings of others, assimilate the standards of acceptable behavior in their family and culture, and develop moral sensibilities.  Using studies that follow groups of children over many years, the authors explain how an accumulation of risks in early years can lead to serious trouble in adult life. But they also present research demonstrating that many children overcome great odds. The Youngest Minds outlines the essential characteristics of a good caregiving environment. Whether a child is cared for at home or at a day care center, certain conditions need to be met. Because of many changes in our society over the last few decades, families are finding it harder to provide the unstressful but challenging environment that much scientific evidence indicates babies need. The authors conclude with a look at who is taking care of America's young children and offer some ideas for improving the quality of their care.",
        "Category": " Psychology , Psychotherapy , Child & Adolescent",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "A DARKER SHADE OF CRIMSON (Ivy League Mysteries)",
        "Authors": "By Thomas-Graham, Pamela",
        "Description": "Being young, gifted, and black at Harvard has always been difficult. For Rosezella Maynette Fisher, outspoken sister girl and controversial Dean of Students at Harvard Law School, it was murder.  And the debonair new President of Harvard is a prime suspect.  A Darker Shade of Crimson is a novel about how Ella Fisher ended up dead on the first day of the fall semester, and how her friend Veronica (Nikki) Chase -- a smart, ambitious, attractive, and well-connected black economics professor -- sets out to solve the crime, and in the process uncovers some of Harvard's most deeply buried secrets.  At twenty-eight, Nikki is a rising star, the only black professor in Harvard's economics department. After stumbling over Ella Fisher's body during a blackout in a classroom building, she is quickly plunged into the investigation of her death. With the occasional tip from Raphael Griffin, a Harvard policeman, Nikki learns that plenty of people could have wanted Ella dead. There is the new Harvard President Leo Barrett, whose rise to the top Ella helped engineer. Before her death, many thought Ella was Leo's lover. Now he's looking perpetually exhausted and guilty. Did they have a fatal falling out? Or did Leo's high-society Brahmin wife, Victoria Wolcott Barrett, kill Ella to stop the affair? Perhaps the sleek university comptroller, Christian Chung -- whom Nikki comes to suspect is the leader of an embezzlement scheme that Ella uncovered just before she died -- did the deed. Or it could have been the Chairman of the Economics Department and Nikki's mentor, Ian McAllister, who suddenly seems to have unlimited cash. Finally, there's Ella's radical Afrocentric ex-husband Isaiah Fisher, who Nikki discovers was holding a long-buried secret over Ella's head.  Only two people seem to mourn Ella's passing: her blue-blooded, Wellesley-educated secretary, Lindsey Wentworth; and Ella's best girlfriend, Alix Coulter, an actress from Texas with attitude. With their help, Nikki sets out to unravel simultaneously the mystery of Ella's death and the complications of her own love life. Dante Rosario, her long-lost exboyfriend, turns up and sets off a chemical reaction; meanwhile, Justin Simms, a Harvard Law School student who flirts like a master, won't take no for an answer. It takes the combined wisdom of Nikki's landlady, Magnolia Dailey, and her best friend, Jessica Leiberman, to help her understand her own heart as she drives toward the shocking conclusion that will turn all of Harvard on its ear.  Proving that love can be murder, A Darker Shade of Crimson launches a major new career in crime fiction.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Eyes Of A Child",
        "Authors": "By Patterson, Richard North",
        "Description": "We are in San Francisco: Ricardo Arias is found dead in his apartment, the gun that killed him wedged in his mouth. The physical evidence might confirm suicide, but there is no doubt that it strongly suggests murder. The police investigation quickly uncovers a maze of emotion and conflict that surrounded the dead man in the last months of his life: an estranged wife, Terri Peralta; an ugly custody fight over their six-year-old daughter, Elena; threats of extortion; accusations of adultery; and sexual abuse of the child.And then the police uncover a murder suspect.He's Terri's new lover, Christopher Paget, a man of wealth and prominence, an extremely high-profile San Francisco defense attorney. Paget has motive - it's his son accused of abusing Elena, his personal and political plans for the future put at risk by the dead man's accusations - and his alibi is dangerously threadbare.Now, defense attorney becomes defendant. Now Paget's defense attorney, Caroline Masters - an equally high-powered lawyer and former judge - works desperately to raise reasonable doubt in the minds of the jury, even as Paget and Terri struggle to preserve their future and that of their cherished children. But as the trial progresses, we begin to see that what comes to light in the courtroom may be fatefully intertwined with what threatens to remain hidden: by Paget's refusal to testify on his own behalf, by Elena's tangled loyalties, and by Terri's inability - or unwillingness - to recall the details of her own childhood trauma.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Flights of Passage: Reflections of a World War II Aviator",
        "Authors": "By Hynes, Samuel",
        "Description": "A firsthand account of the experiences of war describes the author's life as a combat pilot in the Pacific during World War II, from his joining the Marines at the age of eighteen in 1943, to the end of the war, two years and several hundred missions later",
        "Category": " History , Military , World War II",
        "Publisher": "Naval Institute Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Soaring With Ravens: Visions of the Native American Landscape (Spiritual Journeys in Nature)",
        "Authors": "By Fitzharris, Tim",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Faithful Parents, Faithful Kids",
        "Authors": "By Johnson, Greg and Yorkey, Mike",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Tyndale House Pub",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Let The Journey Begin God's Roadmap For New Beginnings",
        "Authors": "By Lucado, Max and Gibbs, Terri A.",
        "Description": "The wise and warm sayings of one of America's favorite Christian authors are collected in this unique gift book to guide and encourage graduates.  This delightful book includes intriguing four-color art and design throughout.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "The American Cancer Society Cancer Book: Prevention, Detection, Diagnosis, Treatment, Rehabilitation, Cure",
        "Authors": "By Holleb, Arthur I. (EDT)",
        "Description": "Discusses specific forms of cancer, the most recent medical advances, methods of prevention, early detection, and suggestions for living with the disease",
        "Category": " Health & Fitness , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "Perfect Pregnancy- How To Have a Healthy Pregnancy: Before, During, and After",
        "Authors": "By Thompson",
        "Description": "",
        "Category": "",
        "Publisher": "Mosby-year* Book Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Prepare for the Great Tribulation and the Era of Peace, Vol.2",
        "Authors": "By Leary, John",
        "Description": "",
        "Category": "",
        "Publisher": "Queenship Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Dixie City Jam (Robicheaux, Book 7)",
        "Authors": "By Burke, James Lee",
        "Description": "The search for a forgotten Nazi submarine sunk off the coast of New Orleans stirs up old hatreds submerged for just as long, in a brilliant new book by Edgar Award winner James Lee Burke. With Dixie City Jam, the writer USA Today called \"the Grisham Alternative\" enters the front ranks of contemporary fiction writers . . . and mainstream bestsellers.They're out there, under the salt - the bodies of German seamen who used to lie in wait at the mouth of the Mississippi for unescorted American tankers sailing from the oil refineries of Baton Rouge out into the Gulf of Mexico. As a child, Dave Robicheaux had been haunted by the sailors' images; then, as a young college student, he'd accidentally discovered one of their subs while scuba diving. Years later, in a New Orleans populated by desperate hustlers and millennium-watchers of all stripes, Robicheaux, a detective with the New Iberia sheriff's office, finds himself and his family at serious risk, stalked for his knowledge of a watery burial ground by a mysterious man named Will Buchalter - a man who believes that the Holocaust was one big hoax. American crime fiction's \"finest prose stylist\" (Los Angeles Times) is at the peak of his powers in Dixie City Jam as he looks long and deep into the human heart of darkness.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Living a Political Life: One of America's First Woman Governors Tells Her Story",
        "Authors": "By Kunin, Madeleine M.",
        "Description": "The first time Madeleine M. Kunin ran for office it was because she thought there ought to be more women in politics. In time she fulfilled that belief by becoming the first woman governor of Vermont. Throughout her career, Kunin found that the rules for women politicians were different: she would not be forgiven (nor would she forgive herself) for neglecting her family. She could not afford to display emotion at the wrong times lest she be thought \"weak.\" And she would have to learn to play political hardball with the best of them while keeping her integrity.In Living a Political Life, Kunin-who is now Deputy Secretary of the U.S. Department of Education-takes a frank look at the challenges that confronted her as she tried not just to succeed in politics but to set a precedent for other women. In doing so, she illuminates both what it means to be a woman and what it means to be a public servant and gives us a memoir as thoughtful and revealing as any to emerge from the corridors of power.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Where Have All Voters Gone, 2nd Edition",
        "Authors": "By Ladd, Everett Carll",
        "Description": "",
        "Category": " Political Science , Political Process , Political Parties",
        "Publisher": "W W Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "National Geographic Traveler: Sydney",
        "Authors": "By McHugh, Evan",
        "Description": "National Geographic offers a century of incomparable travel expertise to the high end of the travel market with this extraordinary series of world tours. These information-packed guides offer savvy advice and the in-depth information that sophisticated travelers demand. Each guide features: Detailed background and site descriptions; mapped walking and driving tours; full-service sidebars with fascinating vignettes on history, culture, and contemporary life; a 60-page directory of visitor information, including notable hotels and restaurants, entertainment, and shopping; and foldout end flaps, printed with maps and quick reference information, that serve as handy bookmarks.",
        "Category": " Travel , Australia & Oceania",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "It's Obvious You Won't Survive By Your Wits Alone",
        "Authors": "By Adams, Scott",
        "Description": "",
        "Category": "",
        "Publisher": "Andrews Mcmeel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "A House Called Awful End: Book One in the Eddie Dickens Trilogy",
        "Authors": "By Ardagh, Philip and Roberts, David (ILT)",
        "Description": "The first book in a hilarious, action-packed trilogy.Eddie Dickens is sent off to stay with his aunt and uncle and a riotously funny comedy of errors ensues.When both Eddie Dickens's parents catch a disease that makes them turn yellow, go a bit crinkly around the edges, and smell of hot water bottles, it's agreed he should go and stay with relatives at their house, Awful End. Unfortunately for Eddie, those relatives are Mad Uncle Jack and Even-Madder Aunt Maud. . . .This hilarious historical spoof, the first in the Eddie Dickens trilogy, has been called \"a scrumptious cross between Dickens and Monty Python.\"The first book in a hilarious, action-packed trilogy.Eddie Dickens is sent off to stay with his aunt and uncle and a riotously funny comedy of errors ensues.When both Eddie Dickens's parents catch a disease that makes them turn yellow, go a bit crinkly around the edges, and smell of hot water bottles, it's agreed he should go and stay with relatives at their house, Awful End. Unfortunately for Eddie, those relatives are Mad Uncle Jack and Even-Madder Aunt Maud. . . .This hilarious historical spoof, the first in the Eddie Dickens trilogy, has been called \"a scrumptious cross between Dickens and Monty Python.\"",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Henry Holt and Co. (BYR)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Innovation: The Attacker's Advantage",
        "Authors": "By Foster, Richard N.",
        "Description": "Takes an aggressive approach giving managers at all levels the competitive edge they need for business survival and market dominance, including advice on predicting the market, offensive and defensive market strategies, investing, and increasing program effectiveness",
        "Category": " Business & Economics , General",
        "Publisher": "Summit Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "The Work Of Nations: Preparing Ourselves for 21st-Century Capitalism",
        "Authors": "By Reich, Robert B.",
        "Description": "A study of the future of capitalism examines the need for a new approach to solving the problems of unskilled workers, a system that emphasizes education, training, infrastructure, pre- and post-natal care, and public investment",
        "Category": " Political Science , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Planning for Pregnancy, Birth, and Beyond",
        "Authors": "By Not Applicable (Na )",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "American College of Obstetricians & Gynecologists",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Historians at Work.",
        "Authors": "By Gay, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Lorenzaccio (French Edition)",
        "Authors": "By Musset",
        "Description": "",
        "Category": "",
        "Publisher": "Dessain et Tolra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The A to Z Guide to Bible Application",
        "Authors": "By Billy Graham",
        "Description": "",
        "Category": "",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Merlin's Harp",
        "Authors": "By Crompton, Anne Eliot",
        "Description": "Merlin's Harp is a female version of a male myth, a pagan telling of a Christian legend - the legend of King Arthur. Here Anne Eliot Crompton tells the classic story from the unique viewpoint of Niviene, daughter of the Lady of the Lake and apprentice to Merlin, within her world of the Fey, a world of enchantment where humans dare not go. The Lady of the Lake and her Fey people are creatures of power and mystery, a people to leave to their own devices. But it is equally frightening for young Niviene to leave the familiar safety of the Fey forest and venture into the world of humans - into Camelot - when Merlin, her mentor, requires her help in saving Arthur's kingdom.All the major Arthurian figures are in this wondrous tale: Arthur, Merlin, Morgan, Mordred, Lancelot and Gwenevere. And they are perceived from a fresh perspective, giving them new dimensions even as they remain, in essence, the characters that Arthurian enthusiasts ardently follow.",
        "Category": "",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "29.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Quiet Moments for Teachers",
        "Authors": "By Page, Linda McNatt",
        "Description": "",
        "Category": " Religion , Prayerbooks , General",
        "Publisher": "Vine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "The Search for Solutions",
        "Authors": "By Horace Freeland Judson",
        "Description": "",
        "Category": "",
        "Publisher": "HOLT, RINEHART, WINSTON",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Celebrating Christmas",
        "Authors": "By Schraffenberger, Nan",
        "Description": "",
        "Category": "",
        "Publisher": "Columbia House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "MCSE Windows 2000 Network Exam Cram (Exam: 70-216)",
        "Authors": "By Taylor, Richard, Melber, Derek, and Carbeck, Hank",
        "Description": "",
        "Category": " Computers , Certification Guides , General",
        "Publisher": "Coriolis Group",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The melting pot book of baby names",
        "Authors": "By Ellefson, Connie Lockhart",
        "Description": "Gathers personal names from fifty countries around the world, from Afghanistan to Zimbabwe, and lists each name's meaning and correct pronunciation",
        "Category": "",
        "Publisher": "Betterway Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Maya World",
        "Authors": "By Benson, Elizabeth P.",
        "Description": "",
        "Category": "",
        "Publisher": "Apollo Editions",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1977"
        }
    },
    {
        "Title": "Last Notes from Home",
        "Authors": "By Exley, Frederick",
        "Description": "The narrator journeys to visit his Army-officer brother, who is dying of cancer, and learns to deal with that brother's covert activities and his own convoluted life",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Lee Canter's Parent Conference Book",
        "Authors": "By Canter, Lee and Schadlow, Barbara",
        "Description": "",
        "Category": "",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "New Power to Love: Concentrated Virility Foods",
        "Authors": "By Lee, William H.",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Instant Improvement, Inc.",
        "Price Starting With ($)": "23.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Animal Alphabet",
        "Authors": "By Gill Davies",
        "Description": "",
        "Category": "",
        "Publisher": "Brimax Books Ltd",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Messies 2",
        "Authors": "By Felton, Sandra",
        "Description": "Argues that keeping a neat and clean house adds to one's feelings of dignity and self-confidence, explains how to organize and manage one's time, and tells how to reduce the clutter in one's life",
        "Category": " Humor , General",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Spiral (John Francis Cuddy Mystery)",
        "Authors": "By Healy, Jeremiah F.",
        "Description": "The creator of \"exciting, thoughtful, wily fiction\" (The Washington Post), Jeremiah Healy has won critical raves for his John Francis Cuddy novels, \"a superior series\" (The New York Times Book Review). Now Healy pushes the envelope of mystery writing with a soul-searching tale that plunges Cuddy into his own private nightmare.  Some mysteries have no answers -- like why an airplane falls out of the sky, and why the woman you love was onboard that flight. When unfathomable tragedy strikes Boston private investigator John Francis Cuddy, all he can do is begin to grieve. There's no revenge. No perp. And no cure except time.  But when Cuddy is jarred by a call for help from an old Vietnam-era comrade, time is a luxury he can't afford. Cuddy goes because he has to. And what he finds in Fort Lauderdale is a tragedy that rivals his own: a proud vet brought down by a stroke, searching for his granddaughter's killer.  The girl was found dead in Colonel Nicolas Helides' heavily guarded mansion on the Intracoastal Waterway. Thirteen years old and far from innocent, Veronica Helides was hardly protected by her family's wealth. Used by her own father to revive his music career and the fortunes of a band named Spiral, Veronica had been molded into a sexually provocative rock starlet. By the time someone drowned her at her grandfather's birthday party, murder was merely the last crime committed against her.  Now Cuddy is picking apart a cast of players in the life of Colonel Helides and the granddaughter everyone called \"Very.\" From Helides' younger, depressive son to former groupies; from a mysterious spiritual advisor to the woman who married the colonel for his money and the license it would buy her, Cuddy is seeing the worst of human nature at a time when his own heart is broken in two. If that were not enough, the killing of a precocious victim may not have been the isolated act it first appeared.  In a powerful and mesmerizing novel of uncontrollable love, rage, and loyalty among families and friends, John Francis Cuddy isn't just trying to catch a killer -- he's trying to stop himself from free-falling into the ultimate human darkness.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "A Hero in Every Heart: Champions from All Walks of Life Share Powerful Messages to Inspire The Hero in Each of Us",
        "Authors": "By Brown, H. Jackson and Spizman, Robyn",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "The Measure of Our Days: New Beginnings at Life's End",
        "Authors": "By Groopman, Jerome",
        "Description": "Why does the knowledge of having a life-threatening illness ennoble some people, yet defeat others? How can we apply to our own lives the lessons learned during this extraordinary time? In The Measure of Our Days, Jerome Groopman, an eminent physician, explores these central human questions through portraits of eight patients who have gazed into the face of death.The unforgettable individuals we meet here include Kirk, an aggressive venture capitalist who refuses to accept his fate and insists on the mega-gamble of risky kidney cancer treatments; Elizabeth, an imperious dowager with a rare blood disease, who is humbled by the fear of becoming helpless; Alex, an accomplished but emotionally unfulfilled architect, who begs for help in dying at the first icy touch of AIDS; and Elliott, who, in his triumph over leukemia, finally creates for himself a definition of success.Through the eyes of a generous and compassionate physician, each individual's experience is transformed from a medical case study into a spiritual journey of questioning and self-awareness.",
        "Category": " Self-help , Death, Grief, Bereavement",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Civilisation: A Personal View",
        "Authors": "By Clark, Kenneth",
        "Description": "A reprint of Clark's revered original published by Harper & Row in 1970. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Philosophy , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "A Beginner's Guide to Golf (Spanish Edition)",
        "Authors": "By Nick Lumb",
        "Description": "",
        "Category": "",
        "Publisher": "Shooting Star Press",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Enthusiasm Makes the Difference",
        "Authors": "By Peale, Norman Vincent",
        "Description": "",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Reaching for the Future (NA: New Architecture 1)",
        "Authors": "By Papadakis, Andreas",
        "Description": "\"Carries up-to-date information and critical comment\" on international architecture and urban design. This volume focuses on explanations and responses concerning innovative materials and futuristic designs.",
        "Category": " Architecture , Criticism",
        "Publisher": "Andreas Papadakis Publisher",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Priestess of Avalon",
        "Authors": "By Paxson, Diana L. and Bradley, Marion Zimmer",
        "Description": "Known to the Romans as Helena on the holy isle of Avalon, British princess Eilan fulfills her destiny to bridge the pagan world of the goddess and the new Christian empire founded by her own son, Constantine, and when she travels to the Holy Land she discovers a truth that transcends any religion. 125,000 first printing.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "A Christmas Carol",
        "Authors": "By Dickens, Charles",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Redpath Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Aerobleu Stationery Havana",
        "Authors": "By Chronicle Books LLC Staff",
        "Description": "",
        "Category": "",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "The Death and Life of Charlie St. Cloud: A Novel",
        "Authors": "By Sherwood, Ben",
        "Description": "The Death and Life of Charlie St. Cloud tells the haunting story of a young man who narrowly survives a terrible car wreck that kills his little brother.  Years later, the brothers’ bond remains so strong that it transcends the normal boundaries separating life and death. Charlie St. Cloud lives in a snug New England fishing village.  By day he tends the lawns and monuments of the ancient cemetery where his younger brother, Sam, is buried.  Graced with an extraordinary gift after surviving the accident, he can still see, talk, and even play catch with Sam’s spirit.  But townsfolk whisper that Charlie has never recovered from his loss.Into his carefully ordered life comes Tess Carroll, a captivating, adventuresome woman training for a solo sailing trip around the globe.  Fate steers her boat into a treacherous storm that blows her back to harbor, to a charged encounter with Charlie, and to a surprise more overwhelming than the violent sea itself. Charlie and Tess discover a beautiful and uncommon connection that leads to a race against time and a desperate choice between death and life, between the past and the future, between holding on and letting go.Luminous, soulful, and filled with unforgettable characters, The Death and Life of Charlie St. Cloud is one of those rare, wise books that reveal the mysteries of the unseen world around us, gently transforming the worst pain of loss into hope, healing, and even laughter.  Suspenseful and deeply moving, its startling climax reminds us that sometimes tragedies can bring about miracles if we simply open our hearts.",
        "Category": " Fiction , Coming of Age",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Air and Space Power in the New Millennium (Csis Significant Issues Series)",
        "Authors": "By Goure, Daniel (EDT), Szara, Christopher M. (EDT), and Fogleman, Ronald R. (INT)",
        "Description": "",
        "Category": " Technology & Engineering , Aeronautics & Astronautics",
        "Publisher": "Center for Strategic & Intl studies",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Kitchens and Bathrooms (Home Repair and Improvement)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Do What You Have the Power to Do: Studies of Six New Testament Women",
        "Authors": "By Pearson, Helen Bruch",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "Upper Room",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Hand Me Another Brick: Principles Of Effective Leadership: How to Motivate Yourself And Others",
        "Authors": "By Swindoll, Charles R.",
        "Description": "La mayoría de nosotros podría beneficiarse de un sabio consejo sobre cómo ser un líder más eficaz en el trabajo y en el hogar. En esta edición revisada, Charles Swindoll cava profundamente en la vida de Nehemías y nos demuestra cómo manejar las cuestiones de motivación, desaliento y adversidad con integridad.",
        "Category": " Social Science , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "Metafitness",
        "Authors": "By Prudden, Suzy and Laucella, Lin",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Hay House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Lillian Hellman: The Image, the Woman",
        "Authors": "By Wright, William",
        "Description": "This portrait traces the controversial life of the successful playwright, including her relationship with Dashiell Hammett and details her active role in ideological battles and her celebrated feuds with everyone from Tallulah Bankhead to Mary McCarthy",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Designing your Garden (The Time-Life Gardener's Guide)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": "",
        "Publisher": "Time-Life Books Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Fresh Cut Flowers",
        "Authors": "By Booher, Dianna",
        "Description": "A collection of thoughts lavishly illustrated with full-color art that says more than a greeting card ever could, while expressing the beauty of a shared friendship.",
        "Category": "",
        "Publisher": "J Countryman Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Better Homes and Gardens Step-By-Step Successful Gardening",
        "Authors": "By Jimerson, Douglas A. (EDT)",
        "Description": "Covers lawns, ground covers, vines, shrubs, trees, annuals, perennials, bulbs, vegetables, herbs, roses, fruits, berries, plant care, and indoor gardening techniques",
        "Category": " Gardening , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Bulbs (Burpee American gardening series)",
        "Authors": "By Bales, Suzanne Frutig",
        "Description": "Offers advice on planting, composting, mulching, fertilizing, dividing, and propagating bulbs, describes some of the most popular species, and answers common questions about bulb gardening",
        "Category": "",
        "Publisher": "Prentice Hall Gardening",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Life Is More Than Your To-Do List: Blending Business Success With Personal Satisfaction",
        "Authors": "By Bedrosian, Maggie McAuliffe",
        "Description": "",
        "Category": "",
        "Publisher": "Bedrosian Communication Inc",
        "Price Starting With ($)": "7.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Secrets of Angels & Demons: The Unauthorized Guide to the Bestselling Novel",
        "Authors": "By Burstein, Daniel (EDT), Shugarts, David A. (CON), and De Keijzer, Arne J. (EDT)",
        "Description": "Presents a series of essays which critique the bestselling novel \"Angels & Demons,\" examining various elements of the story to separate fictitious literary creations from historical facts of Christianity during the Baroque era.",
        "Category": " Literary Criticism , General",
        "Publisher": "Vanguard Pr",
        "Price Starting With ($)": "5.78",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "The Obvious Diet: Your Personal Way to Lose Weight Fast Without Changing Your Lifestyle",
        "Authors": "By Victor, Ed",
        "Description": "A revolutionary approach to dieting allows readers to structure an eating plan that avoids their particular food vices, with clear guidelines for setting up an individualized eating program, helpful motivational tips, delicious recipes, and more. 100,000 first printing.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Arcade Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Search for Significance",
        "Authors": "By McGee, Robert S.",
        "Description": "",
        "Category": " Religion , Christian Education , Children & Youth",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Zvi",
        "Authors": "By McQuaid, Elwood",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Friends of Israel Gospel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1978"
        }
    },
    {
        "Title": "Foods That Heal Companion Cookbook: Showing You the Light at the End of the Refrigerator",
        "Authors": "By Salaman, Maureen Kennedy",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Bay to Bay Distribution Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "The Battle of the Little Bighorn",
        "Authors": "By Sandoz, Mari",
        "Description": "Mari Sandoz's account of the battle in which General George Armstrong Custer staked his life—and lost—reveals on every page the author's intimate knowledge of her subject. The character of the Sioux, the personality of Custer, the mixed emotions of Custer's men, the Plains landscape—all emerge with such clarity that the reader is transported in time to that spring of 1876, when the Army of the Plains began its fateful march toward the Yellowstone. The background of the tragedy is here: the history of bad blood and broken treaties between the Sioux Nation and the United States, the underlying reason for Custer's expedition and for the convocation of Indians on the Little Bighorn that particular year. The author's analysis of Custer's motives and political ambitions sheds new light on an old mystery and will be hotly disputed by the general's admirers.",
        "Category": " History , United States , 19th Century",
        "Publisher": "Bison Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1978"
        }
    },
    {
        "Title": "Fathers & Sons: Stories of How Sport Builds Lifelong Bonds",
        "Authors": "By Beckett Publications",
        "Description": "\"Fathers and Sons\" celebrates the ties that bind by featuring the personal stories of relationships between many superstar athletes and their parents, some of whom are famous athletes as well. While the subjects have done uncommon things, their stories are as universal as the familiar scene of dad and son playing catch.Even in childhoods that don't have storybook plots, parents are the guiding forces. Take, for example, tales of perseverance, such as how Terrell Davis, with the help of his mother, survived his growing years, and how the Buffalo Bills' Doug Flutie and his son Doug, Jr. communicate despite separated by the wall of autism.",
        "Category": "",
        "Publisher": "Beckett Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Four Cornerstones of Winning Golf",
        "Authors": "By Andrisani, John and Harmon, Claude",
        "Description": "To build a complete game, start with a strong foundation.Pros like Tiger Woods, Davis Love III, and Grog Norman know there's more to a world-class golf game than striking a ball well. Now, just as author Butch Harmon taught these pros, he can teach you. The Four Cornerstones of Winning Golf will teach golfers how to strengthen their performance by concentrating and mastering the four elements of the game that matter most: -Ball Striking -Short Game -Mental Game or Course Management -Physical Conditioning Filled with clear line drawings and instructional photos, simple drills and expert tips, as well as a special chapter on how to cure golf's most common ailents, The Four Cornerstones of Winning Golf will give you the sound advice you need to play your best golf all the time.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The U-2 affair",
        "Authors": "By David Wise and Thomas Ross",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "Management control systems (The Robert N. Anthony/Willard J. Graham series in accounting)",
        "Authors": "By Anthony, Robert N., etc.",
        "Description": "",
        "Category": "",
        "Publisher": "R.D. Irwin",
        "Price Starting With ($)": "6.78",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Art: The Critics' Choice",
        "Authors": "By Russell, John (EDT) and Vaizey, Marina (EDT)",
        "Description": "This is a different kind of art history survey, more for individual interest than the classroom, in which 10 senior scholars in Britain and the U.S. write lengthy essays introducing the basic art history of major time periods from classical to contemporary and then, by way of illustration, choose 10 or 12 of their favorite works from that period. These follow the essay in full-page, high quality color plates with a full page of facing commentary, which has a strong focus on formal analysis. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Art , History , General",
        "Publisher": "Watson-Guptill Pubns",
        "Price Starting With ($)": "8.88",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Time Of Terror",
        "Authors": "By Bell, J. Bowyer",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "6.73",
        "Publish Date": {
            "Month": "May",
            "Year": "1978"
        }
    },
    {
        "Title": "Feline Felons: Caught in the Act",
        "Authors": "By Keller, Debbie and Hobbing, Diane",
        "Description": "\"One Adam Twelve, One Adam Twelve: We've got an APB on a young male, black coat with white highlights, flashing eyes that reflect light at night, and a long, sleek tail. Aliases include 'Kitty, Kitty, Kitty' and 'Stormy.' Armed with sharp claws and should be considered extremely dangerous . . .\"Officers Reed and Malloy would certainly be interested in some of the sneakiest beasts to ever roam the metropolis, aka the Feline Felons. Bad cats, after all, are the current rage, and this book has the rap sheet on all the unusual suspects. Author Debbie Keller knows a bad kitty when she sees one. Her uncompromisingly funny book pairs candid photos of cats caught in the act with clever descriptions of their crimes. Even the occasional, \"Is this the face of a cat who would toss a guinea pig out a window?\" protestation crops up, too. This cat patrol blotter of feline crimes includes reports such as:Prowler-A midnight prowler was reported in the vicinity of garbage cans on trash day. Police artists have released this composite silhouette: Suspect is a middle-aged male, brown hair, yellow eyes, stocky build, 91/2 inches tall. Answers to the name of \"Here Kitty\" or the sound of an opening can. Adorable kitty cats do more than sleep in the sun. They're resting up after a night of no good . . . and Feline Felons has \"Just the facts, ma'am.\"",
        "Category": " Humor , Topic , Animals",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Associated Press Stylebook And Libel Manual: Sixth Trade Edition",
        "Authors": "By Associated Press (COR) and Goldstein, Norm (EDT)",
        "Description": "In this style manual, more than 5,000 entries clarify the AP's rules on grammar, spelling, punctuation and usage, with extra sections about reporting business and sports. The AP Stylebook contains knowledge all journalists need to write about the world today: the correct names of countries and organizations, language to avoid, when to use brand names. This edition includes crucial advice on how writers can guard against libel and a guide to journalistic copyright and fair use.",
        "Category": " Language Arts & Disciplines , Journalism",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "The Cold Weather Catalog: Learning to love winter",
        "Authors": "By Tree Communications",
        "Description": "",
        "Category": "",
        "Publisher": "Dolphin Books/Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Warriors at Suez: Eisenhower Takes America into the Middle East",
        "Authors": "By Neff, Donald",
        "Description": "Drawing on numerous, previously unexplored sources, this account of the Suez Canal crisis draws vivid portraits of the leaders involved--Eisenhower, Eden, Ben-Gurion, Mollet, Khrushchev, and Nasser--and analyzes its background and causes",
        "Category": " History , General",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "Studies in Cognitive Development: Essays in Honor of Jean Piaget",
        "Authors": "By Elkind, David and Flawell, John H.",
        "Description": "",
        "Category": "",
        "Publisher": "Oxford University Press, USA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "People Yearbook 1998",
        "Authors": "By People Magazine (New York, N. Y.) (EDT)",
        "Description": "Looks at celebrities who have made news during 1997, including Princess Diana, Tara Lipinski, and the McCaughey septuplets",
        "Category": " Performing Arts , General",
        "Publisher": "People Weekly Books",
        "Price Starting With ($)": "5.63",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Practical Family Health (The AMA Home Medical Library)",
        "Authors": "By American Medical Association",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Amer Medical Assn",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Cancer: Science and Society",
        "Authors": "By Cairns, John",
        "Description": "",
        "Category": "",
        "Publisher": "W H Freeman & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "A Passion for Pasta (The Collector's series)",
        "Authors": "By Clingerman, Polly and Levine, Marian (EDT)",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Pasta",
        "Publisher": "American Cooking Guild",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    }
]