[
    {
        "Title": "The Virginia Hostess: An Entertainment Guide Featuring Traditional and Modern Recipes",
        "Authors": "By Junior Women's Club of Manassas",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Wimmer Cookbooks, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Again, Josefina! (American Girl Collection)",
        "Authors": "By Tripp, Valerie and Tibbles, Jean-Paul (ILT)",
        "Description": "Nineyearold Josefina wants to give up learning to play the piano until she sees how much joy her music gives to her baby nephew, in a new American Girls title which discusses the importance of music on the New Mexican frontier and describes how to dance La Vaquerita.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "God's Tender Promises for Mothers",
        "Authors": "By Countryman, Jack",
        "Description": "A mother's heart is uniquely and eternally bound to that of her child and God.God's Tender Promises for Mothers is the perfect tribute to Mom—to encourage and inspire, and provide wisdom, guidance, and support. This lovely booklet is filled with words of gratitude and blessing for all that Mom is and does, followed by scripture from the New King James Version to complete each entry with a promise from God. These verses serve as poignant reminders that mothers are not alone in raising their children—God is with them every step of the way. Mothers will rest in knowing they have a special role in God’s kingdom and in the lives of their children.Features & Benefits: Provides inspiration and encouragement for moms of any ageEquips mothers with God’s guidance and direction during the challenges they faceVariety of topics address the unique Spiritual yearnings and needs of a motherPerfect gift for Mother’s Day or for churches to give to moms in the churchNote: Must be ordered in multiples of 25.",
        "Category": " Religion , Christian Life , Women's Issues",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Samson's Secret: Judges 13 - 16 for Children (Arch Books)",
        "Authors": "By Kolbrek, Loval",
        "Description": "",
        "Category": "",
        "Publisher": "Concordia Pub House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1970"
        }
    },
    {
        "Title": "The Queen Who Saved Her People: Book of Esther for Children (Arch Book)",
        "Authors": "By Carol Greene",
        "Description": "",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "Concordia Pub House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "The Self-Publishing Manual: How to Write, Print and Sell Your Own Book (Self-Publishing Manual: How to Write, Print, & Sell Your Own Book)",
        "Authors": "By Poynter, Dan",
        "Description": "",
        "Category": " Reference , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Rocky Mountain Wildlife",
        "Authors": "By Dahms, David",
        "Description": "",
        "Category": " Nature , Animals , Wildlife",
        "Publisher": "Paragon Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "A Journey into Prayer: Devotional Selections from Evelyn Christenson",
        "Authors": "By Evelyn Christensen",
        "Description": "",
        "Category": "",
        "Publisher": "Billy Graham Evangelistic Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Communist World and Ours.",
        "Authors": "By Lippmann Walter",
        "Description": "",
        "Category": "",
        "Publisher": "Little Brown & Company",
        "Price Starting With ($)": "7.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "Billy & The Magic String - Pbk",
        "Authors": "By Demarest, Chris L. (ILT) and Karnovsky, Susan",
        "Description": "Billy finds a magic string and together they share some exciting fun",
        "Category": "",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Tweety! Seasons",
        "Authors": "By Bendon Publishing International, Inc. (COR)",
        "Description": "",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Bendon Pub Intl",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "The Book of Classic Trains",
        "Authors": "By Elizabeth Cameron",
        "Description": "",
        "Category": "",
        "Publisher": "Mud Puddle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Snowstorm Surprise",
        "Authors": "By Scarry, Richard and Golden Books Publishing Company",
        "Description": "",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Treasures of Fantasy",
        "Authors": "By Hickman, Tracy and Weis, Margaret (EDT)",
        "Description": "The beloved New York Times bestselling writing team of  Weis and Hickman have combined their talents once again in a one-of-a-kind anthology of the most popular and acclaimed fantasy sbacksies of the last two decades.Never before have so  many treasured and beloved fantasy stories been collected in one volume. A virtual \"Who&#39;s Who\" of  fantasy writers, Treasures of Fantasy showcases dozens of Weis and Hickman&#39;s favorite short stories and novellas by authors such as Anne McCaffrey, Mercedes Lackey, Ray Bradbury, Roger Zeiazny, Orson Scott Card, Marion Zimmer Bradley, Harlan Filison, Theodore Sturgeon, and Ursula K. Le Guin--to name a few. A collection that has been decades in the making and is sure to endure even longer, this unique collection will find its place in the libraries and hearts of fantasy enthusiasts everywhere.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Harper Voyager",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Better Homes and Gardens Cross-Stitch Samplers",
        "Authors": "By Knox, Gerald M. (EDT)",
        "Description": "Offers instructions and patterns for wall hangings, pillow cases, pinafores, rugs, cloth books, and dolls, and includes information about materials, needles, and stitching technique",
        "Category": " Art , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "The Celtic Book of Days : A Guide to Celtic Spirituality & Wisdom",
        "Authors": "By Matthews, Caitlin",
        "Description": "",
        "Category": "",
        "Publisher": "Destiny Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Damon Lee Fowler's New Southern Kitchen: Traditional Flavors for Contemporary Cooks",
        "Authors": "By Fowler, Damon Lee and Stratton, Ann (PHT)",
        "Description": "WHAT'S SO NEW ABOUT THE NEW SOUTHERN KITCHEN?  It's the way Damon Lee Fowler, author of Classical Southern Cooking, coaxes the timeless flavors of yesterday from the markets and kitchens of today. Rather than simply reproduce traditional Southern food, Fowler presents more than 160 mouthwatering, perfect-every-time recipes that take into account how we come by ingredients, the equipment we use to prepare them, and our more health-conscious way of living. The result is food that honors the spirit, the history, and especially the taste of the classic Southern table.  Southern cooking, as most people think of it, doesn't exist. After all, there are as many ways to make \"real\" corn bread, gumbo, or fried chicken as there are cooks. So instead of dwelling on hidebound notions of authenticity, Fowler focuses on the essence of great Southern food, combining traditional ingredients in fresh ways and finding nuances of flavor and texture that may have been overlooked before. This is an unapologetically opinionated and singular book, both colored by the tastes of the author's palate, upbringing, and experiences, and connected to every cook who has ever and will ever step into a kitchen with a Southern idea of flavor in mind. In these pages you won't find \"nouveau\" Southern dishes that simply add cilantro or jalapeño peppers. You will find Pecan-Crusted Goat Cheese with Warm Peach Chutney, combining the best of old and new Southern elements. Pan-Broiled Pork Tenderloins with Caramelized Onions honors the Southern passion for pig but uses a lean cut of meat. Asparagus Shortcake and Shrimp and Green Tomato Gumbo put a savory twist on old favorites. Pound Cake Sandwiches, made with Bourbon Pound Cake; Orange-Praline Trifle; and Sweet Potato Ice Cream are all soul-satisfying endings to any meal.  With suggested menus and resources for finding the best Southern ingredients, Damon Lee Fowler's New Southern Kitchen is sure to become a contemporary classic and an essential volume in every cookbook library, whether north or south of the Mason-Dixon line.",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Woman of God: Living in Grace",
        "Authors": "By Jane Fryar",
        "Description": "",
        "Category": "",
        "Publisher": "CTA, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Water Horse",
        "Authors": "By King-Smith, Dick and Parkins, David (ILT)",
        "Description": "Dick King-Smith’s classic story about a very unusual pet—a water horse!—returns with a charming new cover to win over a new generation of readers!  When eight-year-old Kirstie finds a strange egg near her home, she has no idea what will come out. Part horse, part toad, part turtle, and part crocodile? Only Kirstie’s grandfather knows what it is: a water horse! While it is certainly the oddest-looking creature Kirstie has ever seen, it is also the gentlest. But soon, the unusual pet gets bigger. And bigger. And BIGGER. Will Kirstie and her family be able to keep their new pet or will he have to make a splash in someone else’s home?   “A rich, mostly tender fairy tale that combines elements of such children’s classics as The Secret of Roan Inish, E.T.: The Extra-Terrestrial, and Born Free. . . . Combining the best of fantasy and somber reflection, The Water Horse is a lovely ride.” —The Washington Post on the film adaptation   “Well-written, fast-paced . . . with appealing, distinctive characters, humor, and drama. King-Smith’s imaginative spin on an old myth makes the outrageous possible.” —Booklist    “One of the most delightful children’s authors.” —The Guardian on Dick King-Smith",
        "Category": " Juvenile Fiction , Legends, Myths, Fables , General",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Saving Graces: Sojourns of a Backyard Biologist",
        "Authors": "By Rorer, Abigail (ILT) and Swain, Roger B.",
        "Description": "Essays celebrate the wonder and beauty of the natural world",
        "Category": " Mathematics , General",
        "Publisher": "Bulfinch Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "A Corpse in the Koryo (Inspector O Novels)",
        "Authors": "By Church, James",
        "Description": "\"On the surface, A Corpse in the Koryo is a crackling good mystery novel, filled with unusual characters involved in a complex plot that keeps you guessing to the end.\"---Glenn Kessler, The Washington Post   One of Publishers Weekly Top 100 Books of 2006One of Booklist's Best Genre Fiction of 2006One of the Chicago Tribune's best mystery/thrillers of 2006 Sit on a quiet hillside at dawn among the wildflowers; take a picture of a car coming up a deserted highway from the south.          Simple orders for Inspector O, until he realizes they have led him far, far off his department's turf and into a maelstrom of betrayal and death. North Korea's leaders are desperate to hunt down and eliminate anyone who knows too much about a series of decade's-old kidnappings and murders---and Inspector O discovers too late he has been sent into the chaos. This is a world where nothing works as it should, where the crimes of the past haunt the present, and where even the shadows are real.          Author James Church weaves a story with beautifully spare prose and layered descriptions of a country and a people he knows by heart after decades as an intelligence officer. \". . . an outstanding crime novel. . . . a not-to-be-missed reading experience. \" ---Library Journal (starred)\"Inspector O is completely believable and sympathetic . . . The writing is superb, too . . . richly layered and visually evocative.\"---Booklist (starred)\". . . an impressive debut that calls to mind such mystery thrillers as Martin Cruz Smith's Gorky Park. . . .\" ---Publishers Weekly (starred)",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "April 1865: The Month That Saved America (P.S.)",
        "Authors": "By Winik, Jay",
        "Description": "One month in 1865 witnessed the frenzied fall of Richmond, a daring last-ditch Southern plan for guerrilla warfare, Lee's harrowing retreat, and then, Appomattox. It saw Lincoln's assassination just five days later and a near-successful plot to decapitate the Union government, followed by chaos and coup fears in the North, collapsed negotiations and continued bloodshed in the South, and finally, the start of national reconciliation.In the end, April 1865 emerged as not just the tale of the war's denouement, but the story of the making of our nation.Jay Winik offers a brilliant new look at the Civil War's final days that will forever change the way we see the war's end and the nation's new beginning. Uniquely set within the larger sweep of history and filled with rich profiles of outsize figures, fresh iconoclastic scholarship, and a gripping narrative, this is a masterful account of the thirty most pivotal days in the life of the United States.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Soccer's Most Wanted™: The Top 10 Book of Clumsy Keepers, Clever Crosses, and Outlandish Oddities",
        "Authors": "By Snyder, John",
        "Description": "Ernie Brandts of the Netherlands scored a goal for each team and injured his own goalkeeper in a 1978 World Cup match against Italy. Liverpool’s Robbie Fowler was suspended for four games and fined for pretending to snort the white chalk endline while celebrating a goal. In 1970, after El Salvador defeated Honduras in a World Cup qualifying match, the two countries severed diplomatic relations, and a four-day “Soccer War” broke out, in which more than 10,000 people died. A 1995 match in South Africa between the host Moroka Swallows and the Qwa Qwa Stars was delayed after the visiting team accused the host of using magical powers against them. Soccer's Most Wanted™ features the most outrageous players, the oddest injuries, the strangest matches, the most fantastic finishes, the greatest champions, and the most inept teams. In short, it covers the best and worst moments in the history of world soccer. Die-hard fans as well as newcomers to the sport will enjoy this irreverent guide to soccer trivia.",
        "Category": " Sports & Recreation , Soccer",
        "Publisher": "Potomac Books Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Zlata's Diary: A Child's Life in Wartime Sarajevo, Revised Edition",
        "Authors": "By Filipovic, Zlata, Pribichevich-Zoric, Christina (TRN), and Giovanni, Janine Di (INT)",
        "Description": "The child's diary that awakened the conscience of the worldWhen Zlata’s Diary was first published at the height of the Bosnian conflict, it became an international bestseller and was compared to The Diary of Anne Frank, both for the freshness of its voice and the grimness of the world it describes. It begins as the day-to-day record of the life of a typical eleven-year-old girl, preoccupied by piano lessons and birthday parties. But as war engulfs Sarajevo, Zlata Filipovic becomes a witness to food shortages and the deaths of friends and learns to wait out bombardments in a neighbor’s cellar. Yet throughout she remains courageous and observant. The result is a book that has the power to move and instruct readers a world away.\"The only bright thing to come from [Sarajevo's] recent history.\" -USA Today\"Conveys the bewilderment and horror of modern-day conflict...One of Zlata's gifts lies in throwing a human light on intolerable events.\" -San Francisco Chronicle",
        "Category": " Young Adult Nonfiction , Biography & Autobiography , Women",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Touched By The Gods",
        "Authors": "By Watt-Evans, Lawrence",
        "Description": "When the baby Malledd is born to an ordinary smith in a small country town, a high priest comes to his mother's bedside to confirm what he has heard from the oracles: Malledd has the claw mark of the god Ba'el across his day-old face. He is the true chosen Champion of the Domdur. Should the Empire find itself at war, though the claw mark will have long since faded, Malledd will be the one to lead them to victory, by the gods' decree.The Empire has been more than four generations without an enemy, however, and many doubt the existence of a chosen Champion - including Malledd himself.But when the oracles stop speaking to the priests, everyone begins to wonder. In the dark hills of the Eastern lands, a centuries-old promise has come to its end, and an army of undead soldiers led by a dark magician gathers to challenge the empire. An Imperial Army is quickly gathered, and the Champion sought for. Will he answer his call? Or will the Empire fall because of one man's refusal to be anything other than normal?",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "C D C ?",
        "Authors": "By Steig, William",
        "Description": "To figure out William Steig's word puzzles you need merely read the letters, numbers, and symbols aloud. If at first the messages aren't clear, there are clever pictures accompanying each one to give you hints. Some are easy, some are hard, but all are a hilarious treat when the phrases are decoded.This is the original 1984 edition, with black-and-white drawings. Also included is an answer key at the end.",
        "Category": " Juvenile Nonfiction , Games & Activities , Word Games",
        "Publisher": "Farrar, Straus and Giroux (BYR)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "Unlocking the Meaning of Lost: An Unauthorized Guide",
        "Authors": "By Porter, Lynnette and Lavery, David",
        "Description": "Examines the mysteries, plotlines, and characters of the popular ABC network series, \"Lost,\" and explores the spiritual and philsophical concerns of the show.",
        "Category": " Performing Arts , Television , History & Criticism",
        "Publisher": "Sourcebooks Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Renaissance Lives: Portraits of an Age",
        "Authors": "By Rabb, Theodore K.",
        "Description": "A lavishly illustrated companion to the five-part PBS series describes, in detail, the lives of fifteen men and women of the Renaissance--including Catherine de'Medici, Titian, Galileo, Montaigne, and Gentileschi--to present a history of the era. 17,500 first printing. $20,000 ad/promo. TV tie-in.",
        "Category": " History , Europe , Renaissance",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Unpaid Professionals",
        "Authors": "By Zimbalist, Andrew",
        "Description": "Big-time college sports embodies the ideals of amateurism and provides an important complement to university education. Or so its apologists would have us believe. As Andrew Zimbalist shows in this unprecedented analysis, college sports is really a massively commercialized industry based on activities that are often irrelevant and even harmful to education. Zimbalist combines groundbreaking empirical research and a talent for storytelling to provide a firm, factual basis for the many arguments that currently rage about the goals, history, structure, incentive system, and legal architecture of college sports. He paints a picture of a system in desperate need of reform and presents bold recommendations to chart a more sensible future. Zimbalist begins by showing that today's problems are nothing new--that schools have been consumed for more than a century by debates about cheating, commercialism, and the erosion of academic standards. He then takes us into the world of the modern student athlete, explaining the incentives that, for example, encourage star athletes to abandon college for the pros, that create such useless courses as \"The Theory of Basketball,\" and that lead students to ignore classes despite the astronomical odds against becoming a professional athlete. Zimbalist discusses the economic and legal aspects of gender equity in college sports. He assesses the economic impact of television and radio contracts and the financial rewards that come from winning major championships. He examines the often harmful effects of corporate sponsorship and shows that, despite such sponsorship, most schools run their athletic programs at a loss. Zimbalist also considers the relevance of antitrust laws to college sports and asks whether student athletes are ultimately exploited by the system. Zimbalist's provocative recommendations include eliminating freshman eligibility for sports, restricting coaches' access to \"sneaker money\" from corporations, and ending the hypocrisy about professionalism by allowing teams to employ a quota of non-students as well as to receive funding from the pro leagues. A mixture of lively anecdotes, hard economic data, cogent arguments, and clear analysis, Unpaid Professionals will revitalize debate about a subject close to the hearts and minds of millions of Americans.",
        "Category": " Sports & Recreation , General",
        "Publisher": "Princeton University Press",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Specialty Shop Retailing: How to Run Your Own Store (National Retail Federation)",
        "Authors": "By Schroeder, Carol L.",
        "Description": "Provides advice on opening a shop, finance, design, purchasing, merchandising, personnel matters, customer services, advertising, promotion, community relations, handling problems, and preparing for change",
        "Category": " Business & Economics , Small Business",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Show World: A Novel",
        "Authors": "By Barnhardt, Wilton",
        "Description": "Samantha Flint, the figure at the book's center, flees from the Midwest to Smith College to shake her past, to invent a future she can live with. There she meets the redoubtable Mimi Mohr, who soon becomes her friend, confidante, and inspiration; together (and apart) they spend the next decade and a half in New York, Washington, and Los Angeles, each new city and job taking them to fresh heights of power and wealth. Yet everything Sam wants seems destined to elude her, even as it comes easily to Mimi; decisions soon slip beyond her control; and alter a series of moral lapses - some desperate, some careless - Samantha Flint finds that her dreams, through neglect, have turned violently against her.",
        "Category": " Fiction , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Mosby's Textbook for Long-Term Care Assistants",
        "Authors": "By Sorrentino, Sheila A. and Gorek, Bernie",
        "Description": "This popular text provides complete coverage of the knowledge and skills nursing assistants need to work in a long-term care facility. The concise, readable, highly visual format appeals to learners of all levels. The clear, logical presentation of procedures, with hundreds of large, full-color photos and drawings, makes it easy for students to learn and understand. This new edition addresses the expanding role of the nursing assistant in long-term care, providing additional coverage of assisted living, restraint alternatives, transfers, wound care, elderly abuse, and restorative nursing.Covers all of the knowledge and skills needed by the nursing assistant in long-term care.An attractive, full-color design engages students' interest.Over 100 procedures stressing the quality of life are divided into pre-, procedure, and post-procedure sections for easier learning.Hundreds of full-color photos and drawings add visual appeal and show students how to perform important tasks.What You Will Learn and Key Terms with definitions help students focus on essential information and better understand chapter content.Caring About Culture boxes provide insight and awareness about the practices of various cultures.NNAAPT Highlighted skills alert students to procedures that are part of the National Nurse Aide Assessment Program (NNAAPT)Residents with Dementia boxes detail special care considerations for residents with Alzheimer's disease and other dementias.Quality of Life boxes present actions and considerations that nursing assistants can use to provide care according to the OBRA mandate to enhance/protect residents' rights and improve their overall well-being.OBRA content is highlighted throughout to reinforce the importance of adhering to these federal standards.Focus on Rehabilitation and Subacute Care boxes provide students with information and insights to effectively care for these special residents.Chapter Review Questions help students evaluate learning.UNIQUE! Mosby's Nursing Assistant CD-ROM, bound in the text, includes 25 procedures with corresponding video clips & exercises, an audio glossary, and Body Spectrum - an electronic anatomy coloring book.Lower reading level (6.7) makes comprehension easy for all levels of learners.Delegation Guidelines detail what the student needs to know and understand before accepting delegated tasks. Charting examples demonstrate correct recording methods. Safety Alerts highlight actions that ensure the safety of both residents and staff. New chapter on Restraint Alternatives and Safe Restraint Use. New chapter on Assisted Living discusses caring for residents in these settings.",
        "Category": " Medical , Nursing , General",
        "Publisher": "Mosby",
        "Price Starting With ($)": "9.87",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Animal Kisses (A Touch and Feel Book)",
        "Authors": "By Saltzberg, Barney",
        "Description": "Do you like scratchy cat kisses? Or do you prefer squeaky pig kisses? How about a velvety cow kiss?  Kids will adore puckering up to Barney Saltzberg's irresistible menagerie of animals with fuzzy, sticky, and rubbery mouths just waiting for big smooches.",
        "Category": " Juvenile Fiction , Animals , General",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Chihuahuas For Dummies",
        "Authors": "By O'Neil, Jacqueline",
        "Description": "With their apple heads, big round eyes, large pointy ears, saucy expressions, and feisty dispositions, Chihuahuas are one of the most beloved breeds of toy dogs in the world. But these frisky little dogs aren’t for everyone. Consummate lap dogs, they thrive on attention and constant contact with their owners, and are miserable when left alone. As pups they’re extremely fragile, although they do outlive bigger breeds by many years. Housebreaking can be a problem with Chihuahuas, but on the other hand, they’re very smart, love performing tricks and they never forget what they learn. Some have a tendency to shyness, but a well-socialized Chihuahua can be every bit as bold as a pit bull.Is this plucky little pooch the right dog for you and your family? Chihuahuas For Dummies provides the answer to this and all your questions about getting, caring for and living with this loveable breed. Award-winning breeder, trainer, author and long-time Chihuahua lover, Jacqueline O’Neil Beauchamp gets you up and running with what you need to know to:Find and communicate with reputable breedersChoose the right Chihuahua for youHousebreak and socialize your new puppyEducate yourself and your dogHandle behavioral problemsParticipate in competitionsIn friendly, down-to-earth language, Jacqueline provides insights into the Chihuahua temperament and loads of sensible, easy-to-follow advice, along with fun facts and Chihuahua trivia. Discover how to:Decide on whether a male or female is right for youFind and choose your new friend and bring him or her homeUnderstand how to communicate with your ChihuahuaTrain your little peanutFind a good trainer and attend classesDeal with emotional conflictsFeed and exercise your little amigoRecognize, prevent and treat common health problemsHave loyal friend for lifeThe indispensable guide for you and your Chihuahua, Chihuahuas For Dummies is the only book you’ll need to help you have the best possible experience with this saucy and affectionate breed of dog.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Coming Home to Eat: The Pleasures and Politics of Local Foods",
        "Authors": "By Nabhan, Gary Paul",
        "Description": "We really are what we eat. Eating close to home is not just a matter of convenience it is an act of deep cultural, emotional, and environmental significance. Gary Nabhan's experience with food permeates his life as a third-generation Lebanese American (with Irish and Lithuanian mixed in), as an avid gardener and subsistence hunter, as an ethnobotanist preserving seed diversity, and as an activist devoted to recovering native food traditions to promote the health of Native Americans in the Southwest. To rediscover what it might mean to \"think globally, eat locally,\" he spent a year trying to eat only foods grown, fished, or caught within two hundred miles of his home with surprising results. In Coming Home to Eat, Nabhan draws these experiences together in a book that is a culmination of his life's work and a vibrant portrait of the essential human relation to the foods that truly nourish us, affirming our bonds to family, community, landscape, and season.",
        "Category": " Cooking , Essays & Narratives",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Responses to 101 Questions on the Mass",
        "Authors": "By Irwin, Kevin W.",
        "Description": "",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Paulist Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Stories For A Mom's Heart",
        "Authors": "By Gray, Alice (EDT)",
        "Description": "Compiled by the creator of the bestselling Stories for the Heart series, Stories for a Mom's Heart is a captivating collection of stories that will encourage and inspire the hearts and souls of moms. Featuring an attractive cover design, an ornate, two-color interior, and many of the best-loved selections in the Stories for the Heart series, mothers of all ages and backgrounds will come away from this tender treasure of stories feeling honored, appreciated, and uplifted. Ideal for both personal use and gift-giving, this is a treasure that mothers will cherish always.",
        "Category": " Religion , Inspirational",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Unbelievably Good Deals and Great Adventures That You Absolutely Can't Get Unless You're over 50, 2005-2006 (Unbelievably Good Deals and Great Adventures ... Absolutely Can't Get Unless You're over 50)",
        "Authors": "By Heilman, Joan Rattner",
        "Description": "\"The bargain hunter's bible.\" --Modern MaturityThe newest edition of this proven bestseller, which has sold more than 850,000 copies, is completely revised and updated with even more information about trips, discounts, clubs, programs, and special perks for anyone over 50. Unbelievably Good Deals and Great Adventures That You Absolutely Can't Get Unless You're Over 50 includes amazing bargains on:Airfares and hotels Car rentals and public transportation Vacations designed for grandparents and grandkids Adventure destinations Bike trips and walking tours Golf, tennis, and other sports Free or discounted educational opportunities And much more! In addition, you are offered an overview of organizations for those over 50, an especially useful feature for baby boomers who are just turning 50 and looking for action and excitement. The market is growing exponentially every year, and it's getting more and more active. This edition is ideal for those with a penchant for travel, exercise, fun, and big savings.",
        "Category": " Travel , Special Interest , Senior",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Kitchen Suppers: Good Food to Share with Good Friends",
        "Authors": "By Hurt, Alison Becker",
        "Description": "There are more than seventy-five recipes for delicious meals to prepare with love--meals that will satisfy the heart and soul as well as the palate.Kitchen suppers are meals that sometimes--but don't have to--take place in the kitchen. Always cooked with ease and love, they can be shared with family and friends--or sometimes eaten by yourself.Alison Becker Hurt owns and runs three of the most respected and popular restaurants in the New York area--Alison on Dominick Street in Manhattan, Alison by the Beach in Sagaponack, and Alison in the Inn at Quogue, Long Island--all bearing her name. But \"restaurant food\" is not what she cooks at home, and not what Kitchen Suppers is all about. As Alison puts it, kitchen suppers \"are never perfect--and yet they are perfect in their imperfection.\"In these pages, she shares not only the recipes for but also the stories behind meals that are uncomplicated in spirit, if not always in creation. Here you will find sizzling roasts--from chicken to lamb to duck to beef, cooked with everything from figs to fennel to baby artichokes; aromatic one-pot meals like Lamb Shepherd's Pie, Braised Short Ribs with Acorn Squash Purée, and Duck Stew with Prunes and Apricots; soups, salads, and starters for every season; and homey, yummy desserts such as Alison's favorite, Tarte Tatin, and Dark Chocolate Cake with Almonds and Orange, which, she says, she first made in junior high school.Along with providing the recipes for preparing your own kitchen suppers, Alison also explains the philosophy behind her style of cooking and entertaining: You should never have to run back to the market for a forgotten ingredient, because there is almost always a substitute in the cupboard; and you should never be afraid to use a clean but stained tablecloth, because the stains are memories of good meals shared with joy.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Broadway",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Game Loads and Practical Ballistics for the American Hunter",
        "Authors": "By Hagel, Robert",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1978"
        }
    },
    {
        "Title": "Pajama Time! (Boynton on Board)",
        "Authors": "By Boynton, Sandra",
        "Description": "Pajama Time! is a good-night book with the irrepressible language, the inimitable illustrations, the irresistible cast of characters only Sandra Boynton could create. A jump-roping chicken and a pig on a swing. A Scottie in plaid pajamas and an elephant in a fuzzy one-piece with feet. And in sing-along nuttiness reminiscent of Barnyard Dance!, it&#39;s time to head to bed-to the beat: Pajammy to the left. Pajammy to the right. Jamma jamma jamma jamma P!J! Everybody&#39;s wearing them for dancing tonight. Jamma jamma jamma jamma P!J! Oversized lap edition also available—perfect for reading aloud!",
        "Category": " Juvenile Fiction , Bedtime & Dreams",
        "Publisher": "Workman Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Asian laughter;: An anthology of oriental satire and humor",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Weatherhill",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Texas Brides: To Love Mercy/To Walk Humbly/To Do Justice (Heartsong Novella Collection)",
        "Authors": "By Hake, Cathy Marie",
        "Description": "Historical Romance: A father's last gifts to his sons accompany three young men from the hills of Scotland to the plains of Texas. The Gregor brothers-Robert, a doctor; Duncan, a cobbler; and Christopher, a lawman-set up shop in a small Texas town and quickly make the acquaintance of local women. Tragedy has struck Mercy Stein on the eve of her wedding, leaving her soul battered. Alone and crippled, Carmen Rodriguez wears a protective shell of bitterness. Harboring a secret, Kathryn Regent always seems to be getting in others way. Can their father's gifts help the brothers lead these women to healing faith?",
        "Category": " Fiction , Romance , Erotica",
        "Publisher": "Barbour Publishing, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Student Bible (New International Version)",
        "Authors": "By",
        "Description": "",
        "Category": " Bibles , New International Version , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Hundred Days (Aubrey/Maturin Vol. 19) (Book 19)",
        "Authors": "By O'Brian, Patrick",
        "Description": "Napoleon, escaped from Elba, pursues his enemies across Europe like a vengeful phoenix. If he can corner the British and Prussians before their Russian and Austrian allies arrive, his genius will lead the French armies to triumph at Waterloo.In the Balkans, preparing a thrust northwards into Central Europe to block the Russians and Austrians, a horde of Muslim mercenaries is gathering. They are inclined toward Napoleon because of his conversion to Islam during the Egyptian campaign, but they will not move without a shipment of gold ingots from Sheik Ibn Hazm which, according to British intelligence, is on its way via camel caravan to the coast of North Africa. It is this gold that Jack Aubrey and Stephen Maturin must at all costs intercept. The fate of Europe hinges on their desperate mission.",
        "Category": " Fiction , Historical",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "I'm Not Suffering from Insanity...: I'm Enjoying Every Minute of It!",
        "Authors": "By Linamen, Karen Scalf",
        "Description": "If there's anything Karen Linamen knows, it's that sometimes life can feel crazy. She also knows that hope, healing, and humor go hand in hand. This new book offers plenty of each. I'm Not Suffering from Insanity...I'm Enjoying Every Minute of It! follows on the heels of her best-selling Sometimes I Wake Up Grumpy...and Sometimes I Let Him Sleep and, like her other books, is crammed with laugh-out-loud observations, intimate confessions, sound advice, and heartfelt encouragement. With suggestions ranging from the side-splitting to the sublime, Linamen shows women who feel they're \"going crazy\" how to jumpstart stalled friendships, practice their passions, embrace God's unconditional love, and replace grudges with gratitude. In the process, she reveals how to get well-groomed eyebrows that will outlast a Maytag washer and even how to experience better living through crown molding-all without missing a punch line.  With her trademark transparency and wit intact, Linamen encourages women once again to embrace passion, wellness, and joy in every area of their lives. Sanity, as she points out, is optional.",
        "Category": " Humor , General",
        "Publisher": "Revell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Tackle Without a Team (Matt Christopher Sports Classics)",
        "Authors": "By Christopher, Matt and Sanfilippo, Margaret (ILT)",
        "Description": "When marijuana is found in Scott Kramer's duffel bag and he's thrown off the football team, the star player is determined to clear his name and sets out to discover who planted the drug",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The Adventures of Huckleberry Finn (Classic Starts)",
        "Authors": "By Twain, Mark and Andreasen, Dan (ILT)",
        "Description": "“We said there was no home like a raft. Other places do seem so cramped up and smothery…but you feel mighty free and easy and comfortable on a raft.” Sail down the Mississippi with Huck Finn and the runaway slave, Jim. Twain’s beloved tale, with its folksy language, creates an indelible image of antebellum America with its sleepy river towns, con men, family feuds, and a variety of colorful characters.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Union Square Kids",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Homemade Baby Food Pure and Simple: Your Complete Guide to Preparing Easy, Nutritious, and Delicious Meals for Your Baby and Toddler",
        "Authors": "By Linardakis, Connie",
        "Description": "You Can Prepare Wonderful Food for Your Baby—No Matter How Busy You Are!You want to provide your baby with the very best foods, right from the start. Homemade baby food is tastier and nutritionally superior to commercially processed foods—and making it is easier than you think! With simple ingredients and a few handy hints, you can begin serving your baby delicious meals that will provide the foundation for a lifetime of good health, energy, and vitality. Homemade Baby Food Pure & Simple shows you how. Inside you'll find:•Tasty, easy-to-make recipes that your baby will love •Pediatrician-approved nutritional guidelines and advice •Practical hints and tips to save time and money •Sample menus and food introduction charts •Special recipes for allergies and sleep difficulties •Simple ways to teach good eating habits for life\"This book is a valuable and unique resource for mothers who want to provide the very best for their babies.\" —Mary Cadieux, M.D., University of Washington, Department of Obstetrics and Gynecology",
        "Category": " Family & Relationships , Life Stages , Infants & Toddlers",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "What a Difference a Daddy Makes: The Indelible Imprint a Dad Leaves on His Daughter's Life",
        "Authors": "By Leman, Kevin",
        "Description": "Study after study shows that fathers set up their daughters for success. Involved fathers-whether or not they live in the same house as their daughters-boost their daughters' academic achievement, promote their emotional health, increase their compassion for others, and even bolster the status of women.In What a Difference a Daddy Makes, renowned psychologist and bestselling author Dr. Kevin Leman seamlessly weaves the latest research on fathering with funny, moving stories about his own parenting experiences. He gives practical ideas and inspiration for fathers and provides specific direction for helping daughters grow into loving, confident, caring adults.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Mermaid Chair",
        "Authors": "By Kidd, Sue Monk",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Audio",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Next Christendom: The Coming of Global Christianity",
        "Authors": "By Jenkins, Philip",
        "Description": "The explosive southward expansion of Christianity in Africa, Asia, and Latin American has barely registered on Western consciousness. Nor has the globalization of Christianity--and the enormous religious, political, and social consequences it portends--been properly understood.       Philip Jenkins' The Next Christendom: The Coming of Global Christianity is the first book to take the full measure of the changing face of the Christian faith. Jenkins asserts that by the year 2050 only one Christian in five will be a non-Latino white person and that the center of gravity of the Christian world will have shifted firmly to the Southern hemisphere. Within a few decades Kinshasa, Buenos Aires, Addis Ababa, and Manila will replace Rome, Athens, Paris, London, and New York as the focal points of the Church. Moreover, Jenkins shows that the churches that have grown most rapidly in the global south are far more traditional, morally conservative, evangelical, and apocalyptic than their northern counterparts. Mysticism, puritanism, belief in prophecy, faith-healing, exorcism, and dream-visions--concepts which more liberal western churches have traded in for progressive political and social concerns--are basic to the newer churches in the south. And the effects of such beliefs on global politics, Jenkins argues, will be enormous, as religious identification begins to take precedence over allegiance to secular nation-states. Indeed, as Christianity grows in regions where Islam is also expected to increase--as recent conflicts in Indonesia, Nigeria, and the Philippines reveal--we may see a return to the religious wars of the past, fought out with renewed intensity and high-tech weapons far surpassing the swords and spears of the middle ages.     Jenkins shows that Christianity is on the rise again, and to understand what that rise may mean requires a new awareness of what is happening in Africa, Asia, and Latin America. The Next Christendom takes the first large step towards that new awareness.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "The Handmade Candle",
        "Authors": "By Jenkins, Alison and Peios, Emma (PHT)",
        "Description": "The irresistible charm of a flickering flame makes the candle a universally popular choice for mood lighting. Handmade candles make stylish and beautiful accessories, and they are inexpensive and fun to create. The craft of making your own candles is enjoying a revival, and candlemakers now have access to a vast array of wax products, molds, and decorative materials with which to experiment. THE HANDMADE CANDLE includes clear and simple instructions for making designer candles at home for a fraction of the retail cost. Choose from a wealth of creative ideas from simple rolled beeswax candles to iced, frosted, and textured effects to fabulous embossing and embedding designs. With a useful section on basic techniques, special effects, equipment, and additions, crafters can either make the projects as they are or use them as a source of inspiration and adapt them as they desire. Whatever your level of candlemaking interest, experience, or expertise, THE HANDMADE CANDLE will fill you with enthusiasm and fill your home with candlelight.",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Living with Kilims",
        "Authors": "By Hull, Alastair",
        "Description": "",
        "Category": "",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Best Bread Machine Recipes: For 1 1/2- and 2-pound loaves (Better Homes and Gardens Test Kitchen)",
        "Authors": "By Better Homes and Gardens Books",
        "Description": "A total of 80 recipes featuring a variety of flavors—sweet and savory—that make use of a bread machine’s convenient and timesaving features.Recipes give ingredient amounts for both 1 1/2-pound and 2-pound loaves.Every recipe tested in the Better Homes and Gardens® Test Kitchen in machines from a variety of manufacturers to ensure success.Answers questions from consumers that are commonly asked of the Test Kitchen home economists to help readers solve specific bread machine baking problems.Shows how to convert conventional bread recipes into bread machine recipes.Machine settings specified for each recipe.Nutrition Facts with every recipe in new easy-to-read vertical column format, include the percent Daily Values for calories, total fat, saturated fat, sodium, cholesterol, carbohydrates, and fiber.Concealed wire-o binding allows book to lie flat for easy reading.",
        "Category": " Cooking , Courses & Dishes , Bread",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Best of America (The American Family Cooking Library)",
        "Authors": "By Capalbo, Carla and Washburn, Laura",
        "Description": "",
        "Category": "",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Amelia Bedelia, Bookworm (I Can Read Level 2)",
        "Authors": "By Sweat, Lynn (ILT) and Parish, Herman",
        "Description": "Amelia Bedelia is helping out at the library!  She may not know the difference between a stegosaurus and a thesaurus, but Amelia Bedelia will go to any lengths to make reading fun. Ages 4 – 8",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Greenwillow Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "How Science Works",
        "Authors": "By Hann, Judith",
        "Description": "Suggests simple experiments that demonstrate facts about chemical reactions, energy, motion, light, sound, air, water, magnetism, electricity, electronics, and computers",
        "Category": " Juvenile Nonfiction , Science & Nature , General",
        "Publisher": "Reader's Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The New Feminine Brain: How Women Can Develop Their Inner Strengths, Genius, and Intuition",
        "Authors": "By Schulz, Mona Lisa, M.D., Ph.D. and Northup, Christiane, M.D. (FRW)",
        "Description": "Ever wonder why most women can juggle the kids, the office, and the kitchen renovation all at once but most men prefer to concentrate on one thing at a time? This is because women naturally have more connections than men do between their right and left brains, allowing them to divide their attention and multitask. Yet this mental ability to deal with multiple pressures and demands can ultimately have both a physical and a mental cost. Stress changes the brain physically and triggers physical symptoms in the body.  Indeed, women today have markedly more problems with low moods and depression, anxiety and fears, attention and memory than women of just a few generations ago -- and markedly more than men. In this groundbreaking new book, the first to focus on the unique strengths and innate genius of women's brains, psychiatrist, brain scientist, and medical intuitive Dr. Mona Lisa Schulz shows you that your feminine brain today is not your grandmother's brain: it's dramatically different from the traditional female brain of your ancestors -- and also quite different from a traditional man's brain. The New Feminine Brain explains how women of all ages can protect their hormonally sensitive brains from stress; shore up their moods, self-confidence, focus, and memory; and heal a host of emotional and physical problems. It also provides important health information for using and improving your intuition -- a fast form of intelligence that traditionally has been considered more readily accessible to women than men -- to help balance mind and body for better health, better relationships, and an overall better life. Dr. Schulz makes brain science both engaging and accessible as she combines scientific research, patients' stories from her clinical practice, and personal stories of her work and life as a psychiatrist and a medical intuitive -- identities she learned to merge in order to better understand her own brain -- to help women more fully appreciate their own distinctive abilities. Questionnaires and quizzes throughout the book allow you to understand how your brain is wired, and guide you in rewiring and bolstering any connections that need it, with mental exercises, nutritional supplements, and the latest information on medications. As she helps you make your brain the best it can be, Dr. Schulz leads you on a fascinating, personalized journey of self-discovery and healing. From it you will gain a better appreciation of your innate genius, your intuition, and the amazing strengths of your new feminine brain.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Stedman's Medical Dictionary",
        "Authors": "By Williams, Richard H., Stedman, Thomas Lathrop",
        "Description": "",
        "Category": "",
        "Publisher": "Williams & Wilkins",
        "Price Starting With ($)": "9.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Portfolio of Fence and Gate Ideas (Portfolio of Ideas)",
        "Authors": "By Cy Decosse Inc",
        "Description": "-- Showcases today's fence and gate styles.-- A planning guide full of ideas.-- Reviews different types of gates and their functions.",
        "Category": " House & Home , Reference",
        "Publisher": "Creative Pub Intl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Ideals Old Fashioned",
        "Authors": "By Schaefer, Peggy (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Ideals Childrens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "American Home Cooking (The American Family Cooking Library)",
        "Authors": "By Cleary, Frances",
        "Description": "More than two hundred scrumptious, easy-to-prepare recipes and eight hundred full-color photographs celebrate the diversity and authenticity of classic American cooking.",
        "Category": " Cooking , General",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "7.56",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Create-A-Special Baby's Room  (Leisure Arts #1904)",
        "Authors": "By Finwall, Barbara and Javier, Nancy",
        "Description": "",
        "Category": " House & Home , Decorating",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The Bread Machine Book",
        "Authors": "By Lambert, Marjie",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Bread",
        "Publisher": "Chartwell Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "In Tuscany",
        "Authors": "By Mayes, Frances, Krist, Bob (PHT), Krist, Bob, and Mayes, Edward Kleinschmidt",
        "Description": "From the bestselling author whose memoirs Under the Sun and Bella Tuscany have captured the voluptuousness of Italian life comes a lavishly illustrated ode to the joys of Tuscany's people, food, landscapes, and art.  In Tuscany celebrates the abundant pleasures of life in Italy as it is lived at home, at festivals, feasts, restaurants and markets, in the kitchen and on the piazza, in the vineyards, fields, and olive groves.  Combining all-new essays by Frances Mayes and a chapter by her husband, poet Edward Mayes, with more than 200 full-color photos by photographer Bob Krist, each of this book's five sections highlights a signature aspect of Tuscan life:La Piazza--the locus of Italian village life.  With photgraphs of the shop signs, the outdoor markets, medieval streets, people, their pets and their cars, and snippets of conversations overheard, Mayes reveals the life of the Piazza in her town of Cortona as well as out-of-the-way places such as Volterra, Asciano, Monte San Savino, and Castelmuzio.La Festa--the celebration.  Essays and photos of feasts and celebrations, such as the Christmas dinner for twenty-seven at a neighbor's house and a donkey race around the church at Montepulciano Stazione, illustrate how the Tuscans celebrate the seasons--their open ways of friendship, their connection to nature, and most of all, their sense of abundance.Il Campo--the field.  Here Edward Mayes evokes the deep sense of the shift of seasons as he picks olives before he and Frances head off to the olive oil mill and enjoy the first bruscette with new oil.La Cucina--the kitchen.  An intimate view of the all-important role of the kitchen in Tuscan culture, including photographs of her own kitchen and gardens, menus from great local cooks, the elements of the Tuscan table, dishes with cultural and culinary notes on each, and, of course, delectable recipes.La Bellezza--the beauty.  From the quality of the light falling on sublime landscapes in different seasons and Tuscan faces in moments of laughter to a silhouette of cypress trees in the early evening and a wild bird perched on a neigbor's head, In Tuscany features views of beauty that reveal the singular splendor of one of the world's best-loved and most artistic regions.",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Crown",
        "Price Starting With ($)": "17.48",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "STITCH BY STITCH - VOLUME 4 (VOLUME 4)",
        "Authors": "By Torstar Books.",
        "Description": "",
        "Category": "",
        "Publisher": "Torstar Books, Inc.",
        "Price Starting With ($)": "10.08",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Mechanisms of Microbial Disease",
        "Authors": "By Schaechter, Moselio, Medoff, Gerald, and Eisenstein, Barry I. (EDT)",
        "Description": "New edition of a text presenting the material in a pathobiological framework in the context of clinical cases, a format that lends itself to an active form of studying and problem-based learning. Coverage has been expanded with more immunological, molecular, and genetic material; new chapters on microbial genetics, viruses, and AIDS; and a new feature called \"Paradigm\" in which general principles are highlighted. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Medical , General",
        "Publisher": "Williams & Wilkins",
        "Price Starting With ($)": "8.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Step-By-Step Yard Care (Better Homes & Gardens Step-By-Step)",
        "Authors": "By Better Homes and Gardens Books (EDT) and Ball, Liz",
        "Description": "Shows how to create and maintain attractive yards using walls, walks, and lighting, and how to choose plants, shurbs, and trees suitable to climate and surrounding wildlife.",
        "Category": " Gardening , Landscape",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Organizing Genius: The Secrets of Creative Collaboration",
        "Authors": "By Bennis, Warren G. and Biederman, Patricia Ward",
        "Description": "Uncovers the elements of creative collaboration by examining six of the century's most extraordinary groups and distill their successful practices into lessons that virtually any organization can learn and commit to in order to transform its own management into a collaborative and successful group of leaders. Paper. DLC: Organizational effectiveness - Case studies.",
        "Category": " Business & Economics , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Tips for Teams: A Ready Reference for Solving Common Team Problems",
        "Authors": "By Fisher, Kimball, Rayner, Steven R., and Belgard, William",
        "Description": "While teams work well on the whole, smooth and successful teamwork doesn't happen overnight. Whether you're a team leader or member, you can expect plenty of growing pains and rough spots. Resolving them together makes the team stronger, but where do you begin? This unique book is brimming with practical, proven ideas. It helps you address such crucial questions as: how do you make team decisions when people strongly disagree?, how do you deal with sticky personal issues with a fellow team member?, what do you do when team meetings seem like a waste of time?, how do you handle people who don't want to be part of the team?, what response do you make when some people won't implement the team decision?, and how can the leader help the team without dominating it?",
        "Category": " Business & Economics , Human Resources & Personnel Management",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Saving the World",
        "Authors": "By Alvarez, Julia",
        "Description": "Latina novelist Alma Huebner is suffering from writer's block and is years past the completion date for yet another of her bestselling family sagas. Her husband, Richard, works for a humanitarian organization dedicated to the health and prosperity of developing countries and wants her help on an extended AIDS assignment in the Dominican Republic. But Alma begs off joining him: the publisher is breathing down her neck. She promises to work hard and follow him a bit later.  The truth is that Alma is seriously sidetracked by a story she has stumbled across. It's the story of a much earlier medical do-gooder, Spaniard Francisco Xavier Balmis, who in 1803 undertook to vaccinate the populations of Spain's American colonies against smallpox. To do this, he required live \"carriers\" of the vaccine.  Of greater interest to Alma is Isabel Sendales y Gómez, director of La Casa de Expósitos, who was asked to select twenty-two orphan boys to be the vaccine carriers. She agreed— with the stipulation that she would accompany the boys on the proposed two-year voyage. Her strength and courage inspire Alma, who finds herself becoming obsessed with the details of Isabel's adventures. This resplendent novel-within-a-novel spins the disparate tales of two remarkable women, both of whom are swept along by machismo. In depicting their confrontation of the great scourges of their respective eras, Alvarez exposes the conflict between altruism and ambition.",
        "Category": " Fiction , Medical",
        "Publisher": "A Shannon Ravenel Book",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Killer Weekend (Walt Fleming)",
        "Authors": "By Pearson, Ridley",
        "Description": "The #1 New York Times bestseller returns with a completely new setting-the magnificent natural beauty of Sun Valley, Idaho-and a heart-stopping story in which a local sheriff struggles to protect a controversial politician from the elegant plan of a hired assassin.  Eight years ago, in Sun Valley-snowcapped playground for the wealthy and ambitious-all that stood between U.S. Attorney General Elizabeth Shaler and a knife-wielding killer was local patrolman Walt Fleming. Now Liz Shaler returns to Sun Valley as the keynote speaker of billionaire Patrick Cutter's world-famous media and communications conference, a convergence of the richest, most powerful business tycoons. The controversial attorney general is expected to announce her candidacy for president. It's a media coup for Cutter-but a security nightmare for Walt Fleming, now the county sheriff.  As the Cutter conference gets under way, authorities learn of a confirmed threat on Shaler's life, and various competing interests-the Secret Service, the FBI, Cutter's own security forces -begin jockeying for jurisdiction. Amid the conference's opulent extravagances, Walt is suddenly shaken by an apparent murder, his nephew's arrest, and a haunting legacy from his family's past. The clock ticks down toward Shaler's keynote address as we track the chilling precision of her assassin's preparations.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Eat Away Illness: How to Age-Proof Your Body With Antioxidant Foods",
        "Authors": "By Wade, Carlson",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Parker Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The Worst-Case Scenario Almanac: History",
        "Authors": "By Borgenicht, David, Piven, Joshua (EDT), and Marchant, Piers",
        "Description": "Best-seller history repeats itself with this dynamic new \"almanac\" format that broadens the scope and content of theWorst-Case Scenario handbooks. The Worst-Case Scenario Almanac: History offers step-by-step illustrated scenarios on how to win a joust, survive in a dungeon, and overcome other plights of yesteryear, but the volume also features hundreds of pages of additionaland hilariousinformation in the form of lists (the worst jobs to have during the Industrial Revolution), offbeat profiles (Attila the Hun, Idi Amin), Worst-Case Wisdom (bad advice), descriptions of disasters narrowly averted, and much more. Packed with charts, graphs, maps, and timelines, The Worst-Case Scenario Almanac: History is an invigorating look at all that's gone wrong in the past and the best way to prepare for the future.",
        "Category": " Humor , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Illumination Night",
        "Authors": "By Hoffman, Alice",
        "Description": "A modern chronicle of a marriage and a bittersweet exploration of an extraordinary passion from the New York Times bestselling author of The Rules of Magic.Beginning on the night of the Grand Illumination, a festival of lanterns held each summer on Martha’s Vineyard, Illumination Night follows the lives of a young blond giant who is as beautiful as he is frightening; an old woman at the end of her life whose last mission is to save her granddaughter’s soul; a family torn apart by a wife’s fears and a husband’s unrealized desires—and the high school girl who comes to Martha’s Vineyard against her will, who steals husbands and cars, and who will bring everyone together in a web of yearning, sin, and ultimate redemption. Both riveting and reflective, this is a story of  “parenthood and friendship, self-protection and generosity, dream and disillusionment” (Newsday) that brings to light the talent that has made Alice Hoffman an acclaimed bestselling author.",
        "Category": " Fiction , Sagas",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "On Becoming Childwise",
        "Authors": "By Ezzo, Gary and Bucknam, Robert",
        "Description": "Parents seek to raise moral and godly children, but many don't know how. Parents and prospective parents often feel ill-equipped for the task of raising righteous children. On Becoming Childwise responds to this need by offering sound, biblical instruction for parents with questions about discipline, parent roles, and other issues. Gary Ezzo, author, pastor, and father, and Robert Bucknam, pediatrition, draw from their professional and personal in-the-trenches experiences to offer practical instruction on raising morally responsible children.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Nicaragua: The Land Of Sandino, Third Edition (Westview Profiles/Nations of Contemporary Latin America)",
        "Authors": "By Walker, Thomas W.",
        "Description": "",
        "Category": " History , Latin America , General",
        "Publisher": "Westview Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "The Passionate Shopper: Secret Sources for You and Your Home",
        "Authors": "By Levine, Ann (EDT)",
        "Description": "A guide to effective and fascinating shopping from the experts at Victoria magazine discusses unique and very special stores and sources for the most elegant fashions, furnishings, foods, and more, and includes Web sites, e-mail addresses, and a geographical index.",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "MY VERY FIRST NUMBER BOOK",
        "Authors": "By Wilkes, Angela",
        "Description": "A bright and colorful introduction to the world of numbers for young children. Packed with photographs of children, animals, and everyday objects, each page is designed to make very first learning experiences fun. Counting games and puzzles encourage children to learn through play. Open-ended questions help children work out basic mathematical concepts.",
        "Category": " Juvenile Nonfiction , Concepts , Counting & Numbers",
        "Publisher": "DK Preschool",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Maryland Time Exposures, 1840-1940",
        "Authors": "By Warren, Marion E. and Warren, Mame",
        "Description": "Gathers photos of weddings, people at work, children at school and at play, floods, circuses, carnivals, picnics, railroads, farms, parks, steamers, soldiers, and towns",
        "Category": "",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "7.7",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "Madeline In America And Other Holiday Tales",
        "Authors": "By Bemelmans, Ludwig and Marciano, John",
        "Description": "Featuring a brand new story, two delightful holiday tales, family reminiscences, and artwork selected from the family archives, the first new Madeline book in fifteen years brings to life the beloved red-headed heroine as she embarks on an amazing adventure in America. 125,000 first printing.",
        "Category": " Juvenile Nonfiction , Literary Criticism & Collections",
        "Publisher": "Arthur A. Levine Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The Velveteen Rabbit (Creative Editions)",
        "Authors": "By Bianco, Margery Williams and Felix, Monique",
        "Description": "By the time the Velveteen Rabbit is dirty, worn out, and about to be burned, he has almost given up hope of ever finding the magic called Real.",
        "Category": " Juvenile Fiction , Toys, Dolls & Puppets",
        "Publisher": "Creative Co",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Creative Cardmaking: A Complete Guide",
        "Authors": "By McGraw, Mary Jo (CON), Jacobs, Judy (CON), Jacobs, Michael (CON), and Barker, Judith (CON)",
        "Description": "The Ultimate Guide to CardmakingYou can thrill your family and friends with personalized greeting cards that are overflowing with character and sentiments.With the Creative Cardmaking: A Complete Guide, you'll find over 80 gorgeous cards you can create using a wealth of basic techniques and the latest ideas. Each project features complete step-by-step directions, helpful tips and expert guidance using a variety of easy-to-find materials including rubber stamps, decorative papers, family photos, antique labels and more.Included are projects and examples for every occasion, event and style, from Mother's Day and Christmas, to vintage-style greetings and unique envelopes. Inspirational galleries ensure you'll never run out of ideas! Celebrate the special people in your life with spectacular greetings created specially from the heart.",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "7.89",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The BBQ Queens' Big Book of BBQ",
        "Authors": "By Adler, Karen and Fertig, Judith",
        "Description": "Don't let the tiaras fool you:  Adler and Fertig may advocate having fun while cooking, but they are serious about barbecue.  They just know that women approach barbecuing differently than men: thinking about the whole meal, how to prep efficiently, how to energize leftovers, how to get creative with their recipes. The authors present all the basics, from ingredients and equipment to technique and preparations. Then they expand the repertoire by offering a variety of marinades, sauces, sides, and more sophisticated recipes. Factor in their queenly charm and wit, and you'll have as great a time reading as you do barbecuing.",
        "Category": " Cooking , Methods , Barbecue & Grilling",
        "Publisher": "Harvard Common Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Saudi Arabia and Its Royal Family",
        "Authors": "By Powell, William",
        "Description": "Chronicles the House of Saud's rise to preeminence on the Arabian peninsula and unparalled influence on world affairs and analyzes the role of Islam and the consequences of immense national wealth on contemporary Saudi Arabian society",
        "Category": "",
        "Publisher": "Lyle Stuart",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Happy Haunting, Amelia Bedelia (I Can Read Level 2)",
        "Authors": "By Sweat, Lynn (ILT) and Parish, Herman",
        "Description": "Helping all of the neighborhood children with their Halloween costumes, Amelia Bedelia totally forgets about the Rogers's Halloween party and gets quite a shock when she shows up for work! Reprint.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Greenwillow Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Weight Watchers Slim Ways: Mexican",
        "Authors": "By Weight Watchers",
        "Description": "Weight Watchers Selection Information plus complete nutrition information for all recipes; 150 recipes showcasing the variety of Mexican cuisine; glossary explaining Mexican ingredients, including a section on chiles; and detailed description of cooking techniques.",
        "Category": " Cooking , Regional & Ethnic , Mexican",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "The Healthy Christian Life (Minirth-Meier Clinic Bible Study Ser)",
        "Authors": "By Minirth, Frank, Hawkins, Don, Meier, Paul, and Meier, Richard",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "This Is Now: A Girl-to-Girl Devotional for Teens",
        "Authors": "By Hummel, Patti M. (EDT)",
        "Description": "Finally: Someone Who Gets It Adults may mean well, but do they really get everything you’re facing as a teenager? The pressure to drink and party, cheat on that test, or give in to that guy? How about the devastation of losing a friend, parents divorcing, or low self-esteem? Who can better relate than your peers? This Is Now is a devotional written by your peers across the country who face the exact same things you do. God wants you to find encouragement and support through one another “that they might be called trees of righteousness” (Isaiah 61:3, KJV). Brief entrées and rich Scripture verses are packed with hope and wisdom to guide you through these challenging years. This Is Life—the Real Deal Nobody said these years would be easy. Or maybe someone did—but it was probably an adult who doesn’t get it. Now, in this 365-day devotional, teens just like you come together from around the world to offer guidance through your toughest questions and situations. The entries are genuine—solidly built on the Word of God.  “Why do we look at the girl next to us and wish we had her hair, nose, or thighs? Did God make a mistake when He made you or me? No way! We are expressions of His ingeniously creative mind.”“When I got older; I wasn’t so sure of myself anymore. I wanted to grow up, have a career, get married…but I still wanted to climb trees, run, and play.”“Satan tells me things like, 'You don’t look pretty' or 'Your friends don’t really care about you.' I think these are lies that most girls face. So what do we do with them?”“This wasn’t the first time I had vomited a meal. It was just that, well, I ate too much. I wanted to take it back. I didn’t think I was fat; I just wanted to be thinner than I was.”Story Behind the Book“The teen years make up one of the most challenging and exciting time periods in anyone’s life. Teens are faced with temptations most adults either don’t understand or have forgotten about. For the one committed to Christ, pressures are even greater. They look for encouragement, support, and belonging from their peers. Sadly, much of what is found is divisive and destructive. So I figured: If teens are intent on learning from their peers, why not give them incredible peer role models? A book written by teens for teens in devotional format will be an exciting tool for spurring spiritual growth among teens!”  —Patti M. Hummel",
        "Category": " Young Adult Nonfiction , Religion , Christianity",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Espresso!: Drinks, Desserts and More",
        "Authors": "By Sturdivant, Shea and Terracin, Steve",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Crossing Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Alternative Careers in Science: Leaving the Ivory Tower",
        "Authors": "By Robbins-Roth, Cynthia (EDT)",
        "Description": "Alternative Careers in Science describes the various career tracks available to scientists and gives the inside scoop on the skills and personality types suited to each profession. It also contains important information regarding career expectations and salary potential.This book will allow scientists to compare career opportunities. Each chapter covers a different career track and includes the basic job description, qualifications, responsibilities, and what career opportunities stem from each position.Key Features* Illustrates a typical day's scenario* Explains what career opportunities stem from a position* Describes the basic job, qualifications, responsibilities, and expectations * Covers how long to expect to be in a training phase* Shows existing steps in the promotion ladder and salary ranges* Presents a different career track in each chapter* Allows scientists to compare career opportunities",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Academic Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Asthma: The Complete Guide to Integrative Therapies",
        "Authors": "By Gamlin, Linda and Brostoff, Jonathan",
        "Description": "A comprehensive program to help asthma sufferers identify their triggers, make changes in their environment, diet, and lifestyle, and reduce their dependence on drugs.• Evaluates the full range of therapies, including acupuncture, herbalism, massage, yoga, and breathing exercises, as well as standard pharmaceuticals. • By the authors of the bestselling Food Allergies and Food Intolerance. • Provides special advice for parents with asthmatic children. Almost everyone with asthma could be feeling better and using fewer drugs; this book shows you how. Internationally recognized authorities on allergies and asthma, Dr. Jonathan Brostoff and Linda Gamlin provide a comprehensive step-by-step program to help you identify your personal asthma triggers and make changes in your environment, diet, and lifestyle that can reduce your exposure to allergens and your need for drugs. The authors have examined the most up-to-date research to offer a critical survey of the full range of asthma therapies, from alternatives such as acupuncture, herbalism, yoga, and breathing exercises to the commonly prescribed pharmaceuticals. Expectant mothers and fathers with asthma will appreciate the information on how to reduce the risk of their unborn child acquiring the disease, and parents will find advice that can help their asthmatic children lead happier, healthier lives.",
        "Category": " Health & Fitness , Diseases , Respiratory",
        "Publisher": "Healing Arts Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "On the Grind: A Shane Scully Novel (Shane Scully Novels)",
        "Authors": "By Cannell, Stephen J.",
        "Description": "On the heels of Three Shirt Deal, a New York Times bestseller, comes an electrifying new thriller from Stephen J. Cannell in which Lt. Shane Scully is accused of evidence tampering and his wife, Alexa, discovers Shane’s been having an affair with a beautiful movie star.Charged with felony misconduct in a high-profile solicitation of murder case, Lieutenant Scully is faced with an impossible decision: either quietly resign from his job as a detective for the LAPD, the work he loves, or face criminal prosecution. Rather than smear the department’s reputation and his own, Scully chooses to leave. His colleagues of years feel betrayed to learn that a dirty cop has been in their midst. His wife, Alexa, the chief of detectives, leaves him, seeking a divorce for his dalliance with the accused in the case, a beautiful, well-known Hollywood actress. His son, Chooch, horrified by these events, won’t even speak to him. Life as Scully knows it is over. Or so it seems . . . In order to make a living the only way he knows how, Shane seeks employment from a police department that has been known to hire rejects from other departments: the Haven Park PD. Haven Park is an incorporated city near downtown Los Angeles, just one square mile in size and populated almost entirely by Mexican immigrants, most of them illegal. The department is a hotbed of corruption, in effect the personal goon squad and collection agency of the town’s mayor, Cecil Bratano. Ushered into the department by his new partner, Alonzo Bell, Shane takes his lessons in policing from one of the dirtiest cops around.But things in L.A. are hardly ever what they seem. Relentlessly harassed by an over-zealous FBI agent, the alluring Ophelia Love, and under the constant, violent, and hyper-paranoid scrutiny of his new comrades-at-arms, Shane finds himself in snare a far greater than any he could have expected. His estranged wife may be the only one who can get Shane out of this mess alive. The question is: Is she willing to do so?",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Immaculate White Smoke",
        "Authors": "By Duffey, Lew",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "PublishAmerica",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Superwarriors: The Fantastic World of Pentagon Superweapons",
        "Authors": "By Canan James W.",
        "Description": "",
        "Category": "",
        "Publisher": "Weybright, 1975.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Villa Incognito: A Novel",
        "Authors": "By Robbins, Tom",
        "Description": "Imagine there are American MIAs who chose to remain missing after the Vietnam War. Imagine a family in which four generations of strong, alluring women share a mysterious connection to an outlandish figure from Japanese folklore. Imagine them part of a novel that only Tom Robbins could create—a magically crafted work as timeless as myth yet as topical as the latest international threat. But no matter how hard you try, you’ll never imagine what you’ll find inside the Villa Incognito: a tilt-a-whirl of identity, masquerade, and disguise that dares to pull off “the false mustache of the world” and reveal the even greater mystery underneath. For neither the mists of Laos nor the Bangkok smog, neither the overcast of Seattle nor the fog of San Francisco, neither the murk of the intelligence community nor the mummery of the circus can obscure the pure linguistic phosphor that illuminates every page of one of America’s most consistently surprising and inventive writers.",
        "Category": " Fiction , War & Military",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Stories for Around the Campfire",
        "Authors": "By Harriot, Ray",
        "Description": "",
        "Category": "",
        "Publisher": "Campfire Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "Modern Technical Writing",
        "Authors": "By Sherman, Theodore Allison and Johnson, Simon S.",
        "Description": "",
        "Category": " Education , General",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "True Escape Stories (True Adventure Stories)",
        "Authors": "By Dowswell, Paul",
        "Description": "Collects eight stories of escapes from jail, prison, and military prison from around the world, most from the Second World War.",
        "Category": " Juvenile Nonfiction , Readers , Chapter Books",
        "Publisher": "Usborne Pub Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    }
]