[
    {
        "Title": "The Older the Fiddle, the Better the Tune: The Joys of Reaching a Certain Age",
        "Authors": "By Scott, Willard",
        "Description": "A humorous and touching look at the joys of getting older,introduced by one of the Today show's beloved weathermen. Willard Scott is famous for celebrating the wit and wisdom of age. In The Older the Fiddle, the Better the Tune, he asks a wide range of people, \"What's the greatest thing about getting older\" From expressions of delight in senior citizen discounts to sage advice on life's challenges, the answers are always surprising, often moving, and sometimes very funny. The book's contributors include: -Ed Asner - Dr. Joyce Brothers - Helen Gurley Brown - Art Buchwald - George Bush, Sr. - Bill Cosby - Tony Curtis - Jimmy Dean - Phyllis Diller - Mamie Van Doren - Hugh Downs - Dominick Dunne - Betty Friedan - Peter Graves - Monty Hall - Don Hewitt - Bob Hope - Sybil Jason - Bil Keane - Kenny Kingston - Ed Koch - C. Evertt Koop - Jack LaLanne - Norman Lear - Dick Locher - Eugene McCarthy - Jayne Medows - Anne Meara - Robert Novak - Martin Perl - Jane Powell - Ned Rorem - Vidal Sassoon - Pete Seeger - William F. Sharpe - Liz Smith - Jerry Stiller - Dick Thornburgh - Stanfield Turner - Leaon uris - Jack Valenti - Mort Walker - Andy Williams Also included are pieces from regular folk, such as the former mayor of a small town in Pennsylvania and a retired English teacher from Texas. \"If you don't really want to do something, you don't have to. Unless your wife says it's real important.\" --Yogi Berra \"For me one of the joys of beding over 65 is that people have stopped trying to sell me life insurance.\" --John Updike \"You admit that money may be the root of all evil but there is one great soothing recommendation--it keeps your children in touch with you.\" --Art Linkletter \"Getting older means having shorter breath, but being long-winded.\" --Maya Angelou Whether you're turning 40, 60, or 85--there is something unique to discover about getting older.",
        "Category": " Family & Relationships , Life Stages , Later Years",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "The Ransom of Black Stealth One",
        "Authors": "By Ing, Dean",
        "Description": "Presenting the New York Times bestselling thriller from Dean Ing!  “Crisp and clever, with breathless moments . . . the book soars!”—Chicago TribuneThe Ransom of Black Stealth One is about a breakthrough in stealth technology—an ultralight, ultrasleek plane that is not only invisible to radar, but can vanish without a trace through the use of computer-controlled technology.  When a renegade engineer steals a plane, and takes the niece of a CIA chief hostage, the intelligence community mobilizes all its resources in a desperate race to keep Black Stealth One out of the hands of foreign agents.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Freedom's Challenge",
        "Authors": "By McCaffrey, Anne",
        "Description": "Kris Bjornson has come a long way since the day alien spaceships scooped her up in a slave raid. She has fallen in love with the gentle Zainal. Now Kris has a house of sorts, a child she adores, and a respected place in the community. But she still feels a soldier's duty to escape and rejoin the struggle.If human colonists can join forces with Catteni rebels, they might be able to strike a real blow at the Eosi who control them all. But the dangers of a raid on Catten are tremendous - especially for Zainal, the only Catteni among them, who must lead the attack on his own planet. His love for Kris and their child, and for the freedom he has tasted on Botany, make clear to him what he must do, but the fate of his home world can only break his heart.",
        "Category": " Fiction , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Night of the Hawk",
        "Authors": "By Brown, Dale",
        "Description": "The crew from the Flight of the Old Dog reunite in an effort to rescue their buddy, David Luger, from a vicious KGB plot, but they are distracted by a rebellious Soviet soldier who organizes Lithuania's first army. 150,000 first printing. $100,000 ad/promo.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Whales: Dolphins and Porpoises",
        "Authors": "By National Geographic Society (U. S.) (COR), Darling, James David (EDT), Nicklin, Flip (PHT), and Norris, Kenneth S. (EDT)",
        "Description": "Essays by five biologists discuss past and present relationships between humans and whales, cetacean biology and behavior, personal experiences with whales, current research, and prospects for the future. In the NGS tradition, the story is told visually by numerous two- and full-page color photos, as well as smaller photos on nearly every page. Life history data for each type of cetacean is presented in a separate section. Whale-watching sites are listed.  11x12\" Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Science , General",
        "Publisher": "Natl Geographic Society",
        "Price Starting With ($)": "7.61",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "The Hunt Club: A Novel",
        "Authors": "By Lescroart, John T.",
        "Description": "A federal judge is murdered, found shot to death in his home - together with the body of his mistress. The crime grips San Francisco. To homicide inspector Devin Juhle, it first looks like a simple case of a wife's jealousy and rage. But Juhle's investigation reveals that the judge had powerful enemies ... some of whom may have been willing to kill to prevent him from meddling in their affairs.Meanwhile, private investigator Wyatt Hunt, Juhle's best friend, finds himself smitten with the beautiful and enigmatic Andrea Parisi. A lawyer who recently has become a celebrity as a commentator on Trial TV, Andrea has star power in spades, and seems bound for a national anchor job in New York. Until Juhle discovers that Andrea, too, had a connection to the judge, along with a client that had everything to gain from the judge's death.And then she suddenly disappears ...Andrea becomes Juhle's prime suspect. Wyatt Hunt thinks she may be a kidnap victim, or worse .. another murder victim. And far more than that, she's someone with whom he believes he may have a future.As the search for Andrea intensifies, Hunt gathers a loose band of friends and associates willing to bend and even break the rules, leading them all to a chilling confrontation from which none of them might escape.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Dutton",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Players At the Game of People (Del Rey Book)",
        "Authors": "By Brunner, John",
        "Description": "Godwin Harpinshield decides to defy the mysterious alien powers that have provided him with every luxury in return for vicarious adventure",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1980"
        }
    },
    {
        "Title": "Death Dance: A Novel (Alexandra Cooper Mysteries)",
        "Authors": "By Fairstein, Linda A.",
        "Description": "New York Times bestselling author Linda Fairstein takes readers behind the scenes of New York City's theater world -- from Lincoln Center to the lights of Broadway -- in a riveting new novel, rich with her trademark blend of cutting-edge legal issues, skillful detective work, and heart-stopping suspense.Teaming up with longtime friends -- NYPD's Mike Chapman and Mercer Wallace -- Assistant DA Alex Cooper investigates the disappearance of world-famous dancer Natalya Galinova, who has suddenly vanished backstage at Lincoln Center's Metropolitan Opera House -- during a performance.The three colleagues are soon drawn into the machinations of New York City's secretive theatrical community, where ambition takes many forms, including those most deadly. Among Galinova's lovers is Joe Berk, the colorful, strong-willed boss of the Berk Organization, one of four family companies that own all the legitimate theaters on Broadway. The aging ballerina was using Berk to help revive her career at the time of her disappearance.Cooper, Chapman, and Wallace go underground and backstage at the Met, explore Berk's unusual apartment on top of the Belasco Theatre with its rumored ghostly resident, and then discover bizarre circumstances at City Center, which has a peculiar history not one of them knew about until now.Within the glamorous but sordid inner sanctums of the Broadway elite, the team confronts the ruthless power brokers who control both the stars and the stages where they appear. They meet Joe's niece Mona Berk, who is mounting a vicious campaign to extract her share of the family fortune, and stunning starlet Lucy DeVore, whose beauty may be her fatal undoing. Chet Dobbis is the artistic director of the Metropolitan Opera, and therefore privy to the most scandalous exploits among its famous inhabitants. He also knows every inch of the labyrinthine building into which the ballerina disappeared...Meanwhile, Alex is working on a very different case, using a creative technique to nab a physician who has been drugging women in order to assault them. As Dr. Selim Sengor eludes capture, Alex must navigate the new investigative world of DFSA -- drug-facilitated sexual assault -- intent on proving him guilty.Complicating her quest is the explosive legal and ethical dilemma of using the existing DNA databank to solve new cases. Can Alex convince a judge to let her prosecute a man for a violent crime using DNA that was collected for a prior case in which he was never charged? Or do the suspect's civil rights prevent law enforcement from keeping his DNA on file to be used against him at any future time?Death Dance is a spellbinding thriller combining a former prosecutor's fresh insight into hot-button legal issues with the unique history and spectacle of New York theater, and its shocking twists make this novel Linda Fairstein's most chilling adventure yet.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Broken",
        "Authors": "By Armstrong, Kelley",
        "Description": "In this thrilling new novel from the author of Industrial Magic, a pregnant werewolf may have unwittingly unleashed Jack the Ripper on twenty-first-century—and become his next target.Ever since she discovered she’s pregnant, Elena Michaels has been on edge. After all, she’s never heard of another living female werewolf, let alone one who’s given birth. But thankfully, her expertise is needed to retrieve a stolen letter allegedly written by Jack the Ripper. As a distraction, the job seems simple enough—only the letter contains a portal to Victorian London’s underworld, which Elena inadvertently triggers—unleashing a vicious killer and a pair of zombie thugs. Now Elena must find a way to seal the portal before the unwelcome visitors get what they’re looking for—which, for some unknown reason, is Elena.",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Chocolate & Baking",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Workman Publishing",
        "Price Starting With ($)": "8.19",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Cheat and Charmer: A Novel",
        "Authors": "By Frank, Elizabeth",
        "Description": "Twenty-five years in the making, a first novel that has already been compared to The Sun Also Rises and The Last Tycoon, Cheat and Charmer is certain to be one of the most admired literary debuts of the season. Written by Pulitzer Prize—winning biographer Elizabeth Frank, Cheat and Charmer is a masterful and richly detailed work of fiction–a Tolstoyan novel of marriage, sisterhood, art, politics, compromise, and betrayal set in Hollywood, New York, Paris, and London of the 1950s.Dinah Lasker grew up in the shadow of her sister, Veevi, a stunning beauty and emerging star who enchanted both the Hollywood set and its imported New York literati. But Veevi’s home was also a hotbed of political activity, owing to her marriage to Stefan Ventura, a Bulgarian filmmaker and high-profile Communist. At the end of the 1930s, when things go badly for him in Hollywood, Ventura and Veevi flee to Paris and into the lengthening shadows of Hitler and fascism.Cut to 1951, when Dinah is subpoenaed by the House Un-American Activities Committee, which threatens to ruin her husband, Jake, and derail his successful career as a Hollywood writer, producer, and director unless she cooperates. Can Dinah live with herself if she names Veevi–whom she both loves and loathes–in order to save her husband and preserve her idyllic married life? The choices Dinah makes set in motion an unforgettable chain of events. Like Anna Karenina, Dinah must face the consequences of her choices and her needs.Written with elegance and style, Cheat and Charmer grippingly dramatizes the interior lives of Dinah, Veevi, Jake, and their social circle. Spanning decades and following complex characters on their impassioned pursuits through America and Europe, this is a novel of grand scope, about love and deception, idealism and accommodation, the lies we live, and the truths we cannot avoid.",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Is There Life After Housework?",
        "Authors": "By Aslett, Don",
        "Description": "",
        "Category": "",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "Southern Living Annual Recipes",
        "Authors": "By Ed, Southern Living",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor House, Inc.",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "A Glorious Harvest: Robust Recipes from the Dairy, Pasture, Orchard and Sea",
        "Authors": "By Green, Henrietta",
        "Description": "Features recipes for dairy products, vegetables, fruit, beef, fish, and grains, plus tips for selecting ingredients, historical backgrounds of foods, methods of preparation, seasonal menus, and more",
        "Category": " Cooking , General",
        "Publisher": "Sedgewood Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Mrs. Fields I Love Chocolate! Cookbook: 100 Easy & Irresistible Recipes",
        "Authors": "By Fields, Debbi",
        "Description": "A new collection of delectable chocolate recipes from the author of Mrs. Fields Cookie Book features kitchen-tested recipes for chocolate cookies, cakes, pies, tarts, puddings and souffles, ice creams, candies, and desserts. Simultaneous. 500,000 first printing. Tour.",
        "Category": " Cooking , Courses & Dishes , Chocolate",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Ramona Forever",
        "Authors": "By Cleary, Beverly",
        "Description": "Newbery Medal winner Beverly Cleary continues to amuse readers with her wonderful, blunderful Ramona Quimby!Life can move pretty fast—especially when you're in the third grade, your teenage sister's moods drive you crazy, and your mom has a suspicious secret she just won't share. Plus, Mr. Quimby's new job offer could have the entire family relocating. It's a lot to handle for Ramona. But whatever trial comes her way, Ramona can count on one thing for sure—she'll always be Ramona…forever!",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Avon Camelot",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "2020"
        }
    },
    {
        "Title": "Stay!: Keeper's Story",
        "Authors": "By Kelley, True (ILT) and Lowry, Lois",
        "Description": "This is the story of a dog who tells his own tale. As a pup he is separated from his mother and siblings. This unusual dog learns about living on the dangerous streets and even makes up poetry. He finds human friends, has the chance to win fame and fortune, and is given the name Keeper. Through it all Keeper can’t forget his long lost-little sister. If only they could be together again, life would be perfect. But an old enemy is watching and waiting to make his move.   “Throughout this lighthearted saga of the narrator’s ‘dog days,’ the author proves she is as well versed in animal behavior as in human sensibilities.”—Publishers Weekly",
        "Category": " Juvenile Fiction , Animals , Dogs",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Cause Celeb",
        "Authors": "By Fielding, Helen",
        "Description": "Disillusioned with life as a literary publicist in London, as well as with her hotshot, unevolved TV presenter boyfriend, twenty-something Rosie Richardson chucks the glitz and escapes to run a refugee camp in the African desert.When famine strikes and a massive refugee influx threatens to overwhelm the camp, governments and agencies drag their heels. Calling her media savvy to the fore, and realizing that the only way to get food fast is to bring the celebrities first, Richardson returns to London to organize a star-studded and risky emergency appeal.",
        "Category": " Fiction , General",
        "Publisher": "Viking",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Baseball: More Than 150 Years",
        "Authors": "By Nemec, David",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "8.66",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Formal Country Entertaining",
        "Authors": "By Ross, Pat and Morton, Keith Scott (PHT)",
        "Description": "An in-depth look into eighteen homes that epitomize hospitality provides some essential entertaining advice for different events, from breakfast on the patio to a dessert buffet. 40,000 first printing. $40,000 ad/promo. Tour.",
        "Category": "",
        "Publisher": "Studio",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Illiterate America",
        "Authors": "By Kozol, Jonathan",
        "Description": "It is startling and it is shaming: in a country that prides itself on being among the most enlightened in the world, 25 million American adults cannot read the poison warnings on a can of pesticide, a letter from their child’s teacher, or the front page of a newspaper. An additional 35 million read below the level needed to function successfully in our society. The United States ranks forty-ninth among 158 member nations of the UN in literacy, and wastes over $100 billion annually as a result. The problem is not merely an embarrassment, it is a social and economic disaster.  In Illiterate America, Jonathan Kozol, author of National Book Award-winning Death at an Early Age, addresses this national disgrace. Combining hard statistics and heartrending stories, he describes the economic and the human costs of illiteracy. Kozol analyses and condemns previous government action—and inaction—and, in a passionate call for reform, he proposes a specific program to conquer illiteracy.  One out of every three American adults cannot read this book—which is why everyone else must.",
        "Category": "",
        "Publisher": "Anchor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Plagues and Politics",
        "Authors": "By Mullan, Fitzhugh",
        "Description": "The story of the Service's historic assault on dozens of infectious diseases including typhus, malaria, yellow fever, pellagra and hookworm, and the current battles against AIDS, cancer, drug abuse, product tampering, and homelessness. The foreword is by C. Everett Koop. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Political Science , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Countdown to Terror: The Top-Secret Information that Could Prevent the Next Terrorist Attack on America--and How the CIA Has Ignored It",
        "Authors": "By Weldon, Curt",
        "Description": "\"Congressman Curt Weldon provides a rare—indeed unique—insight on what is going on in the war on terrorism through his 'Ali' missives. The book is a case study of an intelligence failure in the process of happening, with potentially catastophic consequences for the United States. Moreover, Curt accurately diagnoses the larger problems in the intelligence community that can result in intelligence failures. He offers a blueprint for solving these problems, and for winning the war on terrorism, that deserves a wide hearing.\"—R. James Woolsey, former director of Central Intelligence",
        "Category": " Political Science , Security (National & International)",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Dominant Battlespace Knowledge",
        "Authors": "By libicki, martin",
        "Description": "",
        "Category": "",
        "Publisher": "National Defense University, Washington, DC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "I Want to be a Cowboy (Sesame Street I Want to Be Book)",
        "Authors": "By Ewers, Joe (ILT) and Alexander, Liza",
        "Description": "While attending a rodeo, Elmo learns how cowboys and cowgirls work on the range and even why their boots are pointy.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Q is for Quarry: A Kinsey Millhone Novel",
        "Authors": "By Grafton, Sue",
        "Description": "Quarry, n.  An open excavation.  Quarry, v.  Transitive: To dig or take from. Intransitive: To delve into.  Quarry, n.  An object pursued or hunted; prey.   She was a \"Jane Doe,\" an unidentified white female whose decomposed body was discovered near a quarry off California's Highway 1. The case fell to the Santa Teresa County Sheriff's Department, but the detectives had little to go on. The woman was young, her hands were bound with a length of wire, there were multiple stab wounds, and her throat had been slashed. After months of investigation, the murder remained unsolved.   That was eighteen years ago. Now the two men who found the body, both nearing the end of long careers in law enforcement, want one last shot at the case. Old and ill, they need someone to help with their legwork and they turn to Kinsey Millhone. They will, they tell her, find closure if they can just identify the victim. Kinsey is intrigued and agrees to the job.   But revisiting the past can be a dangerous business, and what begins with the pursuit of Jane Doe's real identity ends in a high-risk hunt for her killer.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Ashes to Ashes",
        "Authors": "By Hoag, Tami",
        "Description": "She writes the kind of thrillers that keep readers and critics awake all night.She grabs you with a story as frightening as your worst fears, as chilling as your unspoken secrets.She is New York Times bestselling writer Tami Hoag, today's most exciting master of suspense.  Ashes to Ashes is her most terrifying novel yet...read on...Some killers are born.Some are made.For him, the question is irrelevant.  The taste for murder has always been present, prowling the edge of his consciousness like a hungry wolf.  In a wooded Minneapolis park, he performs his profane ceremony.  He arranges the body to his satisfaction.  He pours the accelerant, anointing the dead.  Then he lights the match.\"Ashes to ashes.\"The newspapers have dubbed him the Cremator.  He has already claimed three lives.  And he won't stop there.  He has a plan for greatness.  Only this time there is a witness.  A teenage runaway with a dubious identity and a murky past, Angie DiMarco has seen the face of the killer in the flickering light of the funeral pyre.  Now the police have Angie, but Angie isn't talking.  Enter Kate Conlan.  She knows all too well the dark side of the human heart.  Once an up-and-coming FBI agent, she left the Bureau under a cloud of scandal.  Now, instead of catching criminals, she helps their victims and protects witnesses.  The job of advocate suits her just fine--until she's assigned to Angie.Not even Kate can tell if the troubled youth is a reluctant witness, a potential victim, or something more troubling still.  Her superiors are interested only in badgering Angie for a lead, because the Cremator's latest victim may be the daughter of Peter Bondurant--an enigmatic billionaire businessman with power to influence the way the case is handled.Bondurant pulls strings and gets Special Agent John Quinn brought to the case.  The FBI's ace profiler of serial killers, Quinn shares a painful past with Kate and hides a secret that is driving him toward madness.  He is a man on a ragged edge, and yet his insatiable need to do justice drives him to catch the Cremator--no matter what the cost to himself.Amid a frenzy of public hysteria, politics, and media attention, Kate is confronted with the most difficult role of her career--and her life.  For she is the one woman who has what it takes to stop the Cremator...and the one woman he wants next.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Ghost Stories from the American South (American Storytelling)",
        "Authors": "By McNeil, W. K. (EDT)",
        "Description": "More than 100 tales of the supernatural, drawn from Tidewater Virginia to the Lone Star State, are included in this collection. The author W.K. McNeil&#39;s introduction traces themes peculiar to the South, such as the screaming bridge and the levitating railroad light. Line drawings contribute to the mood of the stories and an index references various Southern localities by town and state.",
        "Category": " Juvenile Fiction , Horror",
        "Publisher": "August House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Country Living Gardener Window Gardens: For Windows, Walls, Decks and Balconies",
        "Authors": "By Wood, Shona, Forster, Jane, and Roberts, Stephen",
        "Description": "“The book explores the planting of window boxes in both traditional and modern designs, and shows how to plant more than 30 miniature garden projects with easy-to-follow instructions. A good reference to keep in your library.”—Chicago Sun-Times.",
        "Category": " Gardening , Garden Design",
        "Publisher": "Hearst",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Every Breath You Take",
        "Authors": "By McNaught, Judith",
        "Description": "Unforgettable characters, sizzling romance, and riveting suspense: These are the trademarks of beloved author Judith McNaught. With millions of devoted fans and ten New York Times bestsellers to date, McNaught is a writer whose work just gets better with each new novel–and Every Breath You Take is the book readers have been waiting for. Returning to the lavish Chicago setting of her popular novel Paradise, and revisiting some of that book’s characters as well, this story will captivate in inimitable Judith McNaught style.High atop a snow-covered hill, the stately old Wyatt mansion is perched like a crown, its stone spires pointing upward, its stained glass windows glowing like colorful jewels. Such opulence means success and, surely, happiness. But on the eve of wealthy philanthropist Cecil Wyatt’s eightieth birthday, all the money in the world won’t bring back his missing grandson, William Wyatt. The only thing for certain: Foul play was involved.The family, the police, the media–all have tried in vain to discover the young man’s fate. Now suspicion has turned shockingly toward William’s own half-brother, the rather distant and enigmatic Mitchell Wyatt.Kate Donovan never dreamed that a chance romantic encounter on a tropical island paradise would tag her as a suspect in a high-society murder case. But after Kate tangles with the darkly charismatic Mitchell Wyatt, she finds herself cast in a shadow of guilt and mistrust. As the Chicago police tighten their net, it will take all of Kate’s ingenuity to clear her name. With her calm, cool wit, and the help of a man who may or may not be a dangerous catch, Kate vows to claim the life and love she desires.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Two-Dollar Bill (Stone Barrington Novels)",
        "Authors": "By Woods, Stuart",
        "Description": "Stone Barrington is caught between a clever con man-who's just become his client-and a beautiful prosecutor in this stylish thriller in the bestselling series.  Two-Dollar Bill delivers all the storytelling twists and whip-smart banter readers have come to love in Stuart Woods's thrillers. In this latest, Stone Barrington, the suave Manhattan cop-turned-lawyer, is back on his home turf facing down a brilliant Southern flimflam man.  The fun-and action-begins with what Stone believes will be a quiet dinner with his ex-partner, Dino, but they are interrupted by Billy Bob, a filthy rich, smooth-talkin' Texan, who strolls in and parks himself at their table. He's in town \"to make money,\" he says, unwrapping his wad of rare two-dollar bills, and in need of an attorney-namely, Stone-though he won't say why or when such representation will be necessary. As they leave the restaurant, however, an unknown assailant shoots at Stone and his cohorts-and the wily Southerner has spread his two-dollar bills around to everyone like confetti.  Against his better judgment, Stone offers Billy Bob a safe haven for the night but almost immediately begins to suspect that he's made several precipitous misjudgments-for the slippery out-of-towner has gone missing and someone has been found dead-in Stone's town house no less. Stone is now caught between a beautiful federal prosecutor and a love from his past, a con man with more aliases than hairs on his head, and a murder investigation that could ruin them all.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Superstition",
        "Authors": "By Robards, Karen",
        "Description": "Sparks fly between a police chief and a reporter who are thrown together when a brutal killer comes out of hiding after fifteen years.  Pawleys Island, South Carolina. Sunny, idyllic, and picture perfect, until a tabloid news program airs a splashy segment about the community's only unsolved murder-the grisly stabbing of teenager Tara Mitchell and the subsequent disappearance of her two best friends, both thought to be long dead. In the years since the murders, several families have moved into the mansion where the crime occurred, each claiming that the dead girls still haunt the house. Beautiful redheaded reporter Nicole Sullivan, sensing the story that could be her big break, arranges for her mother, a renowned psychic, to contact the three victims via a live séance on the show Twenty-four Hours Investigates.  But something goes terribly wrong during the segment, and a young woman is murdered in the exact same manner as Tara Mitchell was fifteen years earlier. Pressured by her producers to get the inside story, Nicole is ordered to continue to investigate. As an attraction grows between Nicole and police chief Joe Franconi, another identical murder occurs, along with a menacing note warning that the original killer is back to claim three more lives. The body count rises, and so does the danger to Nicole, who is attacked, barely escaping with her life. She and Joe are forced to join forces as it becomes clear that the killer has set his sights on Nicole as his next victim.  Tightly plotted and deeply suspenseful, Superstition is Karen Robards's most captivating work yet.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "I Am Charlotte Simmons: A Novel",
        "Authors": "By Wolfe, Tom",
        "Description": "Dupont University--the Olympian halls of learning housing the cream of America's youth, the roseate Gothic spires and manicured lawns suffused with tradition . . . Or so it appears to beautiful, brilliant Charlotte Simmons, a sheltered freshman from North Carolina. But Charlotte soon learns, to her mounting dismay, that for the uppercrust coeds of Dupont, sex, Cool, and kegs trump academic achievement every time. As Charlotte encounters Dupont's privileged elite--her roommate, Beverly, a fleshy, Groton-educated Brahmin in lusty pursuit of lacrosse players; Jojo Johanssen, the only white starting player on Dupont's godlike basketball team, whose position is threatened by a hotshot black freshman from the projects; the Young Turk of Saint Ray fraternity, Hoyt Thorpe, whose heady sense of entitlement and social domination is clinched by his accidental brawl with a bodyguard for the governor of California; and Adam Geller, one of the Millennial Mutants who run the university's \"independent\" newspaper and who consider themselves the last bastion of intellectual endeavor on the sex-crazed, jock-obsessed campus--she gains a new, revelatory sense of her own power, that of her difference and of her very innocence, but little does she realize that she will act as a catalyst in all of their lives. With his signature eye for detail, Tom Wolfe draws on extensive observation of campuses across the country to immortalize college life in the '00s. I Am Charlotte Simmons is the much-anticipated triumph of America's master chronicler.",
        "Category": " Fiction , Literary",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "A Baker's Field Guide to Christmas Cookies",
        "Authors": "By Wilson, Dede",
        "Description": "More than 75 favorite Christmas cookies from around the world will keep you making memories through many happy holiday seasons. This special field guide format gives you quick reference to the details of each cookie “species,” including its Habitat (country of origin), Field Notes (helpful information), Lifespan (how long it will keep), and Related Species (recipe variations). You will also see at a glance which cookies are especially fun to make with kids and which are quick to prepare, which freeze well and ship well, and much more. And there are even creative tips on hosting a Christmas cookie decorating party or a cookie swap!",
        "Category": " Cooking , Courses & Dishes , Cookies",
        "Publisher": "Harvard Common Press",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Final Dawn over Jerusalem",
        "Authors": "By Hagee, John",
        "Description": "A best-selling author and beloved pastor predicts that the current debate between Jews and Palestinians over the future and possible splitting of the ancient city of Jerusalem will ultimately affect all Christians and the fate of the world as we approach the millennium. Reprint.",
        "Category": " Religion , Biblical Commentary , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Death du Jour",
        "Authors": "By Reichs, Kathy",
        "Description": "Rarely has a first-time novelist made such a spectacular international publishing debut as Kathy Reichs did with her acclaimed forensic thriller Déjà Dead. A New York Times bestseller, a number one bestseller in both Canada and Britain, and winner of the prestigious Ellis Award for Best First Novel of 1997, it was also a Main Selection of the Book-of-the-Month Club, with foreign rights sold to nineteen countries.  Now, in Death du Jour, the author who lives the life she writes about extends her reach while still building on the rich ensemble cast, page-turning suspense, and cutting-edge forensic detail that made Déjà Dead an international sensation.  Assaulted by the bitter cold of a Montreal winter, the American-born Dr. Temperance Brennan, Forensic Anthropologist for the Province of Quebec, digs for a corpse where Sister Élisabeth Nicolet, dead for over a century and now a candidate for sainthood, should be lying in her grave. A strange, small coffin, buried in the recesses of a decaying church, holds the first clue to the cloistered nun's fate.  The puzzle surrounding Sister Élisabeth Nicolet's life and death provides a welcome contrast to discoveries at a burning chalet, where scorched and twisted bodies await Tempe's professional expertise. Who were these people? What brought them to this gruesome fate? And where are the children?  Homicide Detective Andrew Ryan, with whom Tempe has a combustive history, joins her in the arson investigation. From the fire scene they are drawn into the worlds of an enigmatic and controversial sociologist, a mysterious commune, and a primate colony on a Carolina island. Tempe is overwhelmed by the case, confused by her mounting attraction to Ryan, and plagued by worries about her sister Harry's search for spiritual awakening.  Featuring the kind of forensic detail that only Kathy Reichs can provide -- from skeletal reconstruction to insect analysis -- Death du Jour takes the reader on a riveting journey from the morgue to the lab to the crime scene, from the warmth of a barrier island to the frigid cold of a deadly ice storm. With this poignant and powerful work, Kathy Reichs confirms her status as a brilliant new crime-writing star.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Moving Mars",
        "Authors": "By Bear, Greg",
        "Description": "The young may not remember Mars of old, under the yellow Sun, its cloud-streaked skies dusted pink, its soil rusty and fine, its inhabitants living in pressurized burrows and venturing Up only as rite of passage or to do maintenance or tend the ropy crops spread like nests of intensely green snakes over the wind-scoured farms. That Mars, an old and tired Mars filled with young lives, is gone forever.Now I am old and tired, and Mars is young again.Our lives are not our own, but by God, we must behave as if they are. When I was young, what I did seemed too small to be of any consequence; but the shiver of dust, we are told, expands in time to the planet-sweeping storm....Casseia Majumdar was a daughter of one of Mars' oldest, most conservative Binding Multiples - the extended family syndicates that had colonized the red planet. But her life was changed forever by the student protest of 2171. Those brief days of idealism forged bonds that would last a lifetime, and set the stage for a more dramatic act of revolution than anyone could have imagined.Charles Franklin, too, was caught up in those days of passionate youth. A brilliant young physicist with a deep love for his native planet, he was forced to leave his world behind to gain the training he needed. And in those years, the political distance between Earth and Mars was growing wider than the empty reaches of interplanetary space.Moving Mars is Greg Bear's brilliant conception of humanity's colonization of the red planet, with lovingly painted details and a grand historical sweep, embellishing an audacious scientific speculation.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.83",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Expendable",
        "Authors": "By Gardner, James Alan",
        "Description": "",
        "Category": "",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Gaia Websters",
        "Authors": "By Antieau, Kim",
        "Description": "In her quest to save her post-apocalyptic Arizona community from an epidemic, a woman with supernatural healing powers discovers that the only cure may lie in her shadowy past and the ghosts that prowl her dreams. Original.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Roc Trade",
        "Price Starting With ($)": "17.38",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Daughter of Persia: A Woman's Journey From Her Father's Harem Through the Islamic Revolution",
        "Authors": "By Farman-Farmaian, Sattareh and Munker, Dona",
        "Description": "The Remarkable story of the daughter of a once powerful and wealthy shazdeh, or prince, Farmaian  tells a fascinating tale of growing up in the 1930s in a Persian harem compound in Tehran. Breaking  with Muslim tradition, she became an independent woman and found  herself arrested as a counterrevolutionary. A dramtic window on  Iran's journey through the twentieth century.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Making Sense of Wine (Making Sense Series)",
        "Authors": "By Kramer, Matt",
        "Description": "",
        "Category": " Cooking , Beverages , Alcoholic , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Being Direct: Making Advertising Pay",
        "Authors": "By Wunderman, Lester",
        "Description": "The creator of direct marketing discusses his development of the successful marketing strategy and explains how the interactive techniques that he created will transform the world of business and sales in the future. 25,000 first printing. Tour.",
        "Category": " Business & Economics , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Riding the Snake",
        "Authors": "By Cannell, Stephen J.",
        "Description": "Sweeping from the exclusive golf clubs of Brentwood to the depths of Hong Kong's mysterious walled city, Riding the Snake is a thriller torn straight from the headlines. It's set in a deadly Asian underworld where terrorism, international influence peddling, and illegal immigration converge into a single sinister web with a heartless Chinese crime lord at its center.To prankster/L.A. playboy Wheeler Cassidy, things look a little bleak. His trust land is dwindling, his good looks are dissolving into the daiquiris, and his life has no direction -- until his golden-boy younger brother, a prominent lawyer and political power broker; is found mysteriously dead. Wheeler joins forces with the beautiful Tanisha Williams, an L.A. cop from South Central who's been parked on the Asian Crimes Task Force while Internal Affairs investigates her career. Together they embark on a dangerous quest for the truth -- against deadly odds.Tentatively at first, then with growing confidence and passion, the two follow their leads into a labyrinth of violent intrigue and a multibillion-dollar Chinese criminal conspiracy that teaches to the top of the U.S. government. Soon they find themselves up against the most ruthless Triad leader, the Washington Establishment, and violent L.A. gangsters. As Riding the Snake races to a riveting climax in the sewers beneath Los Angeles International Airport, you can almost hear it ominously ticking down -- like the suitcase nuke that's set to incinerate a big chunk of Southern California.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Snow Wolf",
        "Authors": "By Meade, Glenn",
        "Description": "January 1953. The Cold War is at its coldest. President Dwight D. Eisenhower is receiving increasingly alarming reports that Joseph Stalin's mental health is rapidly deteriorating. That he's about to recommence his horrifying purges. That his thermonuclear bomb program is almost complete and likely to precipitate another world war.Within hours of his inauguration, Eisenhower makes the most audacious decision ever taken by an American President: the sanctioning of Operation Snow Wolf. Two CIA agents, posing as man and wife, will travel across the icy wastes of Russia to Moscow to assassinate the world's most powerful despot.Quite by chance, however, from the moment they land on Soviet soil, the KGB gets wind of the plan. An expert manhunter is put in charge of finding the CIA agents and eliminating them. The two agents find themselves under fatal threat from two fronts. One they expected. And one they most certainly did not.",
        "Category": " Fiction , Historical",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Stop at nothing (Perennial library mystery series)",
        "Authors": "By Welcome, John",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "The Throat",
        "Authors": "By Straub, Peter (EDT)",
        "Description": "The continuing mystery of the Blue Rose Murders draws Tim Underhill back to his home town, where he will help a friend accused of murdering his wife clear his name. By the author of Koko. 150,000 first printing. Major ad/promo. Tour.",
        "Category": " Fiction , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "CliffsQuickReview Calculus",
        "Authors": "By Zandy, Bernard V.",
        "Description": "Cliffs Quick Reviews are Produced by The People Who Know Student Needs and Respond to Them. This logically presented, easy-to-grasp review gives you the reference you want to effectively organize your introductory-level course work. Each Review Gives Youa concise but comprehensive source of ready information on the fundamentals of the subjectclearly arranged and accessible basic course notes in manageable units and straightforward languagepractical help in checking your understanding of material presented in your classesthe expertise of an accomplished teacher as your private tutoran excellent way to review core concepts before quizzes, midterms, and finals",
        "Category": " Mathematics , Calculus",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Tee Off: America's Most Challenging Public Golf Courses",
        "Authors": "By Moriarty, Jim",
        "Description": "Surveys the best public golf courses in the United States, Canada, Mexico, the Virgin Islands, and the Dominican Republic, and offers an overview of each course",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Crescent",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Mysteries of the Human Body (Library of Curious and Unusual Facts)",
        "Authors": "By Time-Life Books",
        "Description": "Gathers little known facts about the human body, describes its surprising strength, and discusses Siamese twins, dwarfs, the senses, and diseases",
        "Category": " Young Adult Nonfiction , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Seasonal Kitchen: A Return to Fresh Foods",
        "Authors": "By Meyers, Perla",
        "Description": "International recipes adapted for American kitchens capitalize on the fresh produce and meats available during the different seasons",
        "Category": "",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "February",
            "Year": "1975"
        }
    },
    {
        "Title": "Life Extenders and Memory Boosters: Life Extension Innovations for a Healthier Longer Life",
        "Authors": "By Kugler, Hans J. (EDT), Braswell, A. Glenn, and Steinman, David (EDT)",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Health Quest Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Every Storm (Contemporary Romance)",
        "Authors": "By Wick, Lori",
        "Description": "",
        "Category": " Fiction , Romance , General",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Forever Friends: Amanda/Collette/Danielle/Belinda (Inspirational Romance Collection)",
        "Authors": "By Cox, Carol, Coble, Colleen, Billerbeck, Kristin (EDT), and Sattler, Gail",
        "Description": "",
        "Category": " Fiction , Romance , General",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "6.15",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "The Yokota Officers Club: A Novel (Ballantine Reader's Circle)",
        "Authors": "By Bird, Sarah",
        "Description": "“A GEM, POLISHED AND FACETED IN A WAY THAT PULLED ME INTO THE HEART OF IT WITH THE FIRST PARAGRAPH. . . . Important, touching, meaningful, and uplifting.”–JEANNE RAY   Chicago TribuneAfter a year away at college, military brat Bernadette Root has come “home” to Kadena Air Base in Okinawa, Japan, to spend the summer with her bizarre yet comforting clan. Ruled by a strict, regimented Air Force Major father, but grounded in their mother’s particular brand of humor, Bernie’s family was destined for military greatness during the glory days of the mid-’50s. But in Base life, where an unkempt lawn is cause for reassignment, one fateful misstep changed the Roots’ world forever. Yet the family’s silence cannot keep the wounds of the past from reemerging . . . nor can the memory fade of beloved Fumiko, the family’s former maid, whose name is now verboten. And the secrets long ago covered up in classic military style–through elimination and denial–are now forcing their way to the surface for a return engagement.",
        "Category": " Fiction , Literary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Just One Look",
        "Authors": "By Coben, Harlan",
        "Description": "An ordinary snapshot causes a suburban mother's world to unravel in an instant. When Grace Lawson picks up a newly developed set of family photographs, there is a picture that doesn't belong - a photo from at least twenty years ago. In the photo are five people: four Grace can't recognize and one that looks strikingly like her husband, Jack.When Jack sees the photo, he denies he's the man in it. But later that night, while Grace lies in bed waiting, he drives away in the family's minivan without an explanation, taking the photograph with him.Not knowing where he went or why he left, Grace struggles alone to shield her children from Jack's absence in the days that follow. Each passing day brings only doubts about herself and her marriage and yet more unanswered questions about Jack, along with the realization that there are others looking for Jack and the old photograph - including one fierce, silent killer who will not be stopped from finding his quarry, no matter who or what stands in his way.When the police won't help her, and neighbors and friends alike seem to have agendas of their own, she must confront the dark corners of her own tragic past to keep her children safe and learn the truth that might bring her husband home.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The Patron Saint of Plagues",
        "Authors": "By Anderson, Barth",
        "Description": "In this biological thriller of the near future, postinsurrection Mexico has undermined  the superpower of the United States. But while the rivals battle over borders, a  pestilence beyond politics threatens to explode into a worldwide epidemic. . . . Since the rise of the Holy Renaissance, Ascension—once known as Mexico City—has  become the most populous city in the world, its citizens linked to a central government  net through wetware implanted in their brains. But while their dictator grows fat  with success, the masses are captivated by Sister Domenica, an insurgent nun whose  weekly pirate broadcasts prophesy a wave of death. All too soon, Domenica’s nightmarish  prediction proves true, and Ascension’s hospitals are overrun with victims of a deadly  fever. As the rampant plague kills too quickly to be contained, Mexico smuggles its  last hope over the violently contested border. . . . Henry David Stark is a crack  virus hunter for the American Center for Disease Control and a veteran of global  humanitarian efforts. But this disease is unlike any he’s seen before—and there seems  to be no way to cure or control it. Racing against time, Stark battles corruption  to uncover a horrifying truth: this is no ordinary outbreak but a deliberately unleashed  man-made virus . . . and the killer is someone Stark knows.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Spectra",
        "Price Starting With ($)": "13.16",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Baseball's Greatest Quotations",
        "Authors": "By Dickson, Paul",
        "Description": "Containing more that five thousand quotations, this sourcebook of baseball lore includes the comments of Marilyn Monroe, Woody Allen, Jane Austen, Ralph Nader, and others on the history of baseball",
        "Category": " Reference , Quotations",
        "Publisher": "Perennial",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "The Arthritis Action Program: An Integrated Plan of Traditional and Complementary Therapies",
        "Authors": "By Weinblatt, Michael E.",
        "Description": "Examines the benefits of exercise, alternative medicine, diet, and traditional treatments to present an action plan for coping with arthritis.",
        "Category": " Health & Fitness , Diseases , Musculoskeletal",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.3",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "JavaScript: The Definitive Guide",
        "Authors": "By Flanagan, David",
        "Description": "JavaScript is a powerful scripting language that can be embedded directly in HTML. It allows you to create dynamic, interactive Web-based applications that run completely within a Web browser; you don't have to do any server-side programming, like writing CGI scripts.JavaScript is a simpler language than Java. It can be embedded directly in Web pages without compilation, so it is more flexible and easier to use for simple tasks like animation. However, although you can write reasonably robust and complete Web applications using JavaScript alone, JavaScript is not a substitute for Java. In fact, JavaScript is a good client-side complement to Java; using the two together allows you to create more complex applications than are possible with JavaScript alone.JavaScript: The Definitive Guide provides a thorough description of the core JavaScript language and its client-side framework, complete with sophisticated examples that show you how to handle common tasks, like validating form data and working with cookies. The book also contains a definitive, in-depth reference section that covers every core and client-side JavaScript function, object, method, property, constructor, and event handler. This book is an indispensable reference for all JavaScript programmers, regardless of experience level.This third edition of JavaScript: The Definitive Guide describes the latest version of the language, JavaScript 1.2, as supported by Netscape Navigator 4 and Internet Explorer 4. The book also covers JavaScript 1.1, which is the first industry-standard version known as ECMAScript. The new features of JavaScript 1.2, which are likely to be embodied in a later ECMAScript standard release, are clearly indicated, so that you can use them as appropriate in your scripts.",
        "Category": " Computers , Programming , Object Oriented",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Daisy Miller (Penguin Classics)",
        "Authors": "By James, Henry and Moore, Geoffrey",
        "Description": "Daisy Miller, a naive young American woman traveling in Europe with her family, finds it difficult to understand Europen society",
        "Category": " Fiction , Classics",
        "Publisher": "Penguin Group USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Julia's Last Hope (Women of the West Series)",
        "Authors": "By Oke, Janette",
        "Description": "",
        "Category": "",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "The Good Housekeeping Illustrated Microwave Cookbook",
        "Authors": "By Kenneally, Joyce A. (EDT)",
        "Description": "",
        "Category": " Cooking , Methods , Microwave",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "On the trail of blood: A participatory mystery",
        "Authors": "By Robbins, Alan",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "H. Holt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Bluest Blood (Amanda Pepper Mysteries)",
        "Authors": "By Roberts, Gillian",
        "Description": "In her Amanda Pepper mysteries, Gillian Roberts evokes the City of Brotherly Love in all its charm, mischief, and menace. Now she turns her wickedly perceptive eye to the residents of Philadelphia's posh Main Line district, the legendary land of the rich and well-to-do, where the wealthy live their very private lives--and occasionally commit very scandalous crimes. Aristocratic Philadelphia natives may think the bluest blood in America flows through their veins, but sometimes outsiders with large fortunes can buy their way into this privileged company--and glamorous newcomers Neddy and Tea Roederer have wealth aplenty.For English teacher Amanda Pepper, the champagne gala on behalf of Philly Prep's library is a night to remember. After all, it is her introduction to ultra-rich society--an evening so extravagant that nothing can tarnish the party . . . not even a group of protesters outside burning the host in effigy.But Amanda senses deeper trouble, and her intuition is right on target. The Moral Ecologists, who vehemently feel that \"reading pollutes the mind,\" will do anything to advance their agenda. And Amanda's new affluent acquaintances prove to be just as deceitful and violent--as she learns firsthand that the bluest blood bleeds just as red. Especially with murder.With her customary bons mots, elegant prose, and storytelling prowess, Gillian Roberts upholds her enviable reputation as \"the Dorothy Parker of mystery writers . . . giving more wit per page than most writers give per book.\" ** Nancy Pickard",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Yankee Magazine's Practical Problem Solver: 1,001 Ingenious Solutions to Everyday Dilemmas",
        "Authors": "By Proulx, Earl",
        "Description": "A comprehensive encyclopedia of household tips includes twenty-four chapters covering everything from soothing bee stings and fixing faulty roofs, to eliminating pet odors and car maintenance.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "The Murder of Lawrence of Arabia",
        "Authors": "By Eden, Matthew",
        "Description": "",
        "Category": "",
        "Publisher": "Crowell",
        "Price Starting With ($)": "8.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The Monk",
        "Authors": "By Matthew G. Lewis",
        "Description": "",
        "Category": "",
        "Publisher": "GROVE PRESS INC",
        "Price Starting With ($)": "11.55",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "Spy High Mission One",
        "Authors": "By A. J. Butcher",
        "Description": "",
        "Category": "",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Lost in the Forest: A Novel (Ballantine Reader's Circle)",
        "Authors": "By Miller, Sue",
        "Description": "For nearly two decades, since the publication of her iconic first novel, The Good Mother, Sue Miller has distinguished herself as one of our most elegant and widely celebrated chroniclers of family life, with a singular gift for laying bare the interior lives of her characters. In each of her novels, Miller has written with exquisite precision about the experience of grace in daily life–the sudden, epiphanic recognition of the extraordinary amid the ordinary–as well as the sharp and unexpected motions of the human heart away from it, toward an unruly netherworld of upheaval and desire. But never before have Miller’s powers been keener or more transfixing than they are in Lost in the Forest, a novel set in the vineyards of Northern California that tells the story of a young girl who, in the wake of a tragic accident, seeks solace in a damaging love affair with a much older man.Eva, a divorced and happily remarried mother of three, runs a small bookstore in a town north of San Francisco. When her second husband, John, is killed in a car accident, her family’s fragile peace is once again overtaken by loss. Emily, the eldest, must grapple with newfound independence and responsibility. Theo, the youngest, can only begin to fathom his father’s death. But for Daisy, the middle child, John’s absence opens up a world of bewilderment, exposing her at the onset of adolescence to the chaos and instability that hover just beyond the safety of parental love. In her sorrow, Daisy embarks on a harrowing sexual odyssey, a journey that will cast her even farther out onto the harsh promontory of adulthood and lost hope.With astonishing sensuality and immediacy, Lost in the Forest moves through the most intimate realms of domestic life, from grief and sex to adolescence and marriage. It is a stunning, kaleidoscopic evocation of a family in crisis, written with delicacy and masterful care. For her lifelong fans and those just discovering Sue Miller for the first time, here is a rich and gorgeously layered tale of a family breaking apart and coming back together again: Sue Miller at her inimitable best.From the Hardcover edition.",
        "Category": " Fiction , Sagas",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "The Country Music Almanac",
        "Authors": "By Biracree, Tom",
        "Description": "A country music reference covers famous songs and the stories behind them; fascinating trivia; and profiles of such superstars as Patsy Cline, k.d. lang, Johnny Cash, Billy Ray Cyrus, and others. Original.",
        "Category": " Music , General",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "The Complete Bartender: Everything You Need to Know for Mixing Perfect Drinks",
        "Authors": "By Feller, Robyn M.",
        "Description": "Featuring more than two thousand easy-to-follow recipes, a comprehensive guide to bartending and perfect party planning takes readers through the steps of preparing drinks of all kinds and features complete cross-references with index listings by liquor, entertaining tips, holiday specialities, and much more. Reissue.",
        "Category": " Cooking , Beverages , Bartending",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "History of the SS",
        "Authors": "By Graber, G. S.",
        "Description": "",
        "Category": "",
        "Publisher": "D. McKay",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Virginia Wildlife Viewing Guide (Wildlife Viewing Guides Series)",
        "Authors": "By Duda, Mark Damian",
        "Description": "",
        "Category": " Nature , Animals , Wildlife",
        "Publisher": "Falcon",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Improving your garden soil (Ortho library)",
        "Authors": "By Spieckerman, Roberta (PHT) and Lawton, Barbara Perry",
        "Description": "Provides guidelines for identifying and correcting soil problems and shows how to set up a garden maintenance program",
        "Category": "",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Jane Brody's Nutrition Book",
        "Authors": "By Jane Brody",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The Complete book of vitamins",
        "Authors": "By GERRAS, Charles (editor)",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The Declaration of Independence and Other Great Documents of American History 1775-1865 (Dover Thrift Editions)",
        "Authors": "By Grafton, John (EDT)",
        "Description": "The great documents in this important collection helped form the foundation of American democratic government. Compelling, influential, and often inspirational, they range from Patrick Henry's dramatic \"Give me liberty or give me death\" speech at the start of the American Revolution to Abraham Lincoln's Second Inaugural Address, issued in the closing weeks of the Civil War. Also included are the Declaration of Independence, Thomas Jefferson's classic rationale for rejecting allegiance to the government of King George III; the Monroe Doctrine, the cornerstone of American foreign policy; and these other landmark statements: The Constitution of the United States; James Madison's The Federalist, No. 10; George Washington's First Inaugural Address and Farewell Address; Thomas Jefferson's First Inaugural Address; William Lloyd Garrison's Prospectus for The Liberator; Andrew Jackson's Veto of the Bank Bill; and Abraham Lincoln's First Inaugural Address, Emancipation Proclamation, and Gettysburg Address.An introductory note precedes the text of each document, providing fascinating background history and information about the author. An indispensable reference for students, this handy compendium will also serve as an invaluable introduction for general readers to American political writing.",
        "Category": " History , United States , Revolutionary Period (1775-1800)",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Flags of Our Fathers",
        "Authors": "By Bradley, James and Powers, Ron",
        "Description": "In February 1945, American Marines plunged into the surf at Iwo Jima—and into history. Through a hail of machine-gun and mortar fire that left the beaches strewn with comrades, they battled to the island’s highest peak. And after climbing through a landscape of hell itself, they raised a flag.Now the son of one of the flag-raisers has written a powerful account of six very different young men who came together in a moment that will live forever.To his family, John Bradley never spoke of the photograph or the war. But after his death at age seventy, his family discovered closed boxes of letters and photos. In Flags of Our Fathers, James Bradley draws on those documents to retrace the lives of his father and the men of Easy Company.Following these men’s paths to Iwo Jima, James Bradley has written a classic story of the heroic battle for the Pacific’s most crucial island—an island riddled with Japanese tunnels and 22,000 fanatic defenders who would fight to the last man.Few books ever have captured the complexity and furor of war and its aftermath as well as Flags of Our Fathers. A penetrating, epic look at a generation at war, this is history told with keen insight, enormous honesty, and the passion of a son paying homage to his father. It is the story of the difference between truth and myth, the meaning of being a hero, and the essence of the human experience of war.",
        "Category": " History , Military , World War II",
        "Publisher": "Bantam",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "What's Left to Eat?",
        "Authors": "By Gebo, Sue",
        "Description": "Provides balanced information on the safety and nutritional value of common foods and recommends safe food-handling methods and a healthy eating plan",
        "Category": " Health & Fitness , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "7.0",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Trees: A Guide to Familiar American Trees (Golden Guides)",
        "Authors": "By Zim, Herbert Spencer, Barlowe, Dorothea (ILT), Barlowe, Sy (ILT), and Martin, Alexander C.",
        "Description": "A guide to identifying 143 varieties of North American conifers and broadleaved trees describes their appearance, range, and habitats",
        "Category": " Nature , Plants , Trees",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "The Random House Children's Encyclopedia",
        "Authors": "By Dorling Kindersley Ltd",
        "Description": "A highly illustrated one-volume encyclopedia containing 450 main entries ranging from Aboriginal Australians to Zoos.A highly illustrated one-volume encyclopedia containing 450 main entries ranging from Aboriginal Australians to Zoos",
        "Category": "",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "10.24",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "The Front Porch",
        "Authors": "By Heuer, Ann Rooney",
        "Description": "",
        "Category": "",
        "Publisher": "Metro Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Flower Garden",
        "Authors": "By Bisgrove, Richard and Heuff, Marijke (PHT)",
        "Description": "Offers advice on planning a flower garden, recommends a variety of flowering plants, and discusses their care requirements",
        "Category": " Gardening , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Cross",
        "Authors": "By Patterson, James",
        "Description": "Alex Cross was a rising star in the Washington, DC, Police Department when an unknown shooter gunned down his wife, Maria, in front of him. Alex's need for vengeance was placed on hold as he faced another huge challenge-raising his children without their mother.Years later Alex is making a bold move in his life. He has left the FBI and set up practice as a psychologist once again. His life with Nana Mama, Damon, Jannie, and little Alex finally feels like it's in order. He even has a chance at a new love.Then Cross's former partner, John Sampson, calls in a favor. He is tracking a serial rapist in Georgetown, one whose brutal modus operandi includes threatening his victims with terrifying photos. Cross and Sampson need the testimonies of these women to stop the predator, but the rape victims refuse to reveal anything about their attacker.When the case triggers a connection to Maria's death, Alex may have a chance to catch his wife's murderer after all these years. Is this a chance for justice at long last? Or the culminating scene in his own deadly obsession?",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Woman in Residence",
        "Authors": "By Harrison, Michelle",
        "Description": "The author describes her experiences during residency in obstetrics and gynecology in an American hospital and explains common surgery and medical procedures",
        "Category": " Health & Fitness , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "Art History (Volume 1)",
        "Authors": "By Stokstad, Marilyn, Addiss, Stephen, and Cateforis, David",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall College Div",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Folly's Bride (Brides of Montclair, Book 4)",
        "Authors": "By Peart, Jane",
        "Description": "\"Sara! You must come out! You're wanted downstairs right away,\" Lucie hissed through the keyhole on the locked bedroom door. \"Stepmama is furious and Father has sent word that he's coming home early from the Exchange. She says he's in a rage over what you've done!\" \"I haven't done anything! It's not my fault if those two hotheads decide to fight a duel!\" came her sister's indignant voice from the other side of the door. \"Oh, Sara, please!\" Lucie pleaded. \"Father will be here any minute. You must do as you're told!\" She shook her head and sighed ruefully, \"You're stubborn, Sara.\" \"No,\" denied Sara. \"I am strong.\" Thus begins the bittersweet story of beautiful Sara Leighton, the headstrong heroine of Folly's Bride, the fourth in the Brides of Montclair series. As with her predecessors, happiness does not come painlessly to this newest bride of Montclair. Her unusual beauty and her independent spirit places her on a collision course with romance, frustration, disappointment, and finally, true love.",
        "Category": " Fiction , Religious",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Indecent Dreams",
        "Authors": "By Lustig, Arnost",
        "Description": "In these three novellas, Arnost Lustig explores the existential interiors of those at the margin of disaster. A German prostitute assigned to Prague, a girl in a Nazi home for orphans, and a young woman working as a cashier in a movie theater lose themselves in a world of cruelty and collapsing social order--while their inner worlds teem with sexual fantasy, naïve idealism, vengefulness, and visions of justice. Yet these so-called indecent dreams cannot compare with the obscenity of cruelty and domination legitimated by the Nazi imagination.",
        "Category": " Fiction , Literary",
        "Publisher": "Northwestern University Press",
        "Price Starting With ($)": "5.54",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "The Starr Report: The Findings of Independent Counsel Kenneth W. Starr on President Clinton and the Lewinsky Affair",
        "Authors": "By Starr, Kenneth",
        "Description": "\"The Starr Report: The Findings of Independent Counsel Kenneth W. Starr on President Clinton and the Lewinsky Affair\"",
        "Category": " Political Science , Reference",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Storming Intrepid",
        "Authors": "By Harrison, Payne",
        "Description": "Desperate to acquire the latest American technology relating to the SDI program, the Soviets hijack the U.S. space shuttle Intrepid, triggering a costly and dangerous battle",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "366 Low-Fat Brand-Name Recipes in Minutes: More Than One Year of Healthy Cooking Using Your Family's Favorite Brand-Name Foods",
        "Authors": "By Smith, M. J.",
        "Description": "Gathers healthful recipes for beverages, appetizers, breads, bread-machine breads, salads, soups, stews, main-dish salads, casseroles, main dishes, vegetables, and desserts",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Chronimed Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "What Color Is Your Parachute? 2003: A Practical Manual for Job-Hunters and Career Changers",
        "Authors": "By Bolles, Richard Nelson",
        "Description": "Thoroughly revised for 2003, a handy job-hunter's guide explains how to identify one's personal goals and interests and explains how to apply that information toward obtaining satisfying employment, with tips on interviews, salary negotiation techniques, career searching online, and more. Original. 200,000 first printing.",
        "Category": " Business & Economics , Careers , Job Hunting",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Force",
        "Authors": "By Dorsey, David",
        "Description": "\"If you want to know how America's business wars are waged in the trenches, The Force is for you. A gripping book.\"--Newsday\"SKILLFULLY REPORTED, INSIGHTFUL...Dorsey lights up our vision of the American salesman with his own sharply reported eyewitness account.\"--PeopleIn this fascinating book, reporter David Dorsey turns a year on the Xerox sales force into an emotionally charged human drama. The Force tracks Fred Thomas and his sales team from the shiny glass office building where work starts at dawn to the rolling green country clubs where they woo customers, from the smoke-filled bars where they unwind to the plush suburban bedrooms where they try to forget the pressures of the day. And as the year unfolds, we get swept up in the burning question at the center of all of their lives: will they make their quota? \"Meet Fred Thomas. He's a real person, working in a real job in a real company. And he's the hero of The Force, David Dorsey's brilliant chronicle of life in the real world of contemporary business. Dorsey's book draws a picture that is as intimate as a great novel. It is a book that captures in the most essential details and the most sweeping prose the cross-wired paradoxes that lie at the heart of the New Economy. Fred is Us. He's the next-generation Willie Loman working in a world put into hyperdrive...Fred is the salesman as Everyman.\"--Harvard Business Review",
        "Category": " Business & Economics , Management",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The Foundations of U.S. Air Doctrine: The Problem of Friction in War",
        "Authors": "By Watts, Barry D., Lt. Col., USAF",
        "Description": "",
        "Category": "",
        "Publisher": "Air University Press",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Folk Art: Style & Design",
        "Authors": "By Walton, Stewart and Walton, Sally",
        "Description": "Introduces the techniques involved in various folk arts, including painted objects, quilts, cross stitch, rag rugs, wood crafts, paper crafts, pierced metalwork, toys, and games, and looks at traditional designs and motifs",
        "Category": " Art , General",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Death Quest (Mission Earth Series)",
        "Authors": "By Hubbard, L. Ron",
        "Description": "In order to stop the evil Countess Krak and Jettero Heller, Soltan Gris, also an extraterrestrial from Voltar, must deal with Torpedo Fiaccola, a Mafia hitman",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Bridge Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Jonathan Segal Chicken",
        "Authors": "By Sol Weinstein, Howard Albrecht",
        "Description": "",
        "Category": "",
        "Publisher": "Pinnacle Books",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "The Deluge and the Ark: A Journey into Primate Worlds",
        "Authors": "By Peterson, Dale",
        "Description": "The author describes his experiences traveling around the world visiting endangered species of primates, and discusses the need for conservation",
        "Category": " Science , General",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Reunion in Death",
        "Authors": "By Robb, J. D.",
        "Description": "A birthday bash sets the scene for a frightening reunion with a killer from Eve Dallas’s past in this novel in the #1 New York Times bestselling In Death series.At exactly 7:30 p.m., Walter Pettibone arrived home to over a hundred friends and family shouting, “surprise!” It was his birthday. Although he had known about the planned event for weeks, the real surprise was yet to come. At 8:45 p.m., a woman with emerald eyes and red hair handed him a glass of champagne. One sip of birthday bubbly, and he was dead.No one at the party knew who she was, but Detective Eve Dallas remembers her all too well. Eve was personally responsible for Julianna Dunne's incarceration nearly ten years ago. And now, let out on good behavior, she still has nothing but bad intentions. It appears she wants to meet Dallas again—in a reunion neither will forget...",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Things Not Seen: And Other Stories",
        "Authors": "By Williams, Lynna",
        "Description": "A collection of stories reflecting on the dependency that occurs in relationships between parent and child, or between men and women",
        "Category": " Fiction , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    }
]