[
    {
        "Title": "Storm on the Horizon: Khafji--The Battle that Changed the Course of the Gulf War",
        "Authors": "By Morris, David J",
        "Description": "Storm on the Horizon is the little-known story of the key land battle of Desert Storm: the Battle for Khafji -- and how that engagement has become part of military history. Combining some of the most powerful writing on war ever with a Marine's eyeview of combat, former Marine officer David J. Morris has brilliantly recreated this crucial battle that nearly changed the outcome of the Persian Gulf War. Storm on the Horizon is war writing at its finest.On January 29, 1991, Saddam Hussein launched his three best armored divisions across the Kuwaiti border and into the Islamic Holy Land of Saudi Arabia. Their mission: to disrupt the massive U.S.-led Coalition preparing to evict them from Kuwait, and to bloody the Americans on CNN. Caught without warning in the path of this juggernaut were scattered groups of lightly armed U.S. Marines and Special Forces soldiers. Storm on the Horizon is the gripping and compelling story of how these elite fighting men escaped the Iraqi onslaught and reversed the assault with an unprecedented combination of high-tech weaponry and American know-how. This is the story of the first battle of the smart-bomb age.Storm on the Horizon drops you in the middle of the most intense battle of the Persian Gulf War. The Marines are trapped and outnumbered, their weapons no match against the Iraqi tanks bearing down on them. Their only lifeline to the rear is a barely functioning radio. Drawing upon extensive veteran interviews and previously classified reports, David J. Morris's vivid minute-by-minute narrative takes you through the battle from its beginning as a scattered collection of skirmishes to its fiery final act in the streets of the abandoned Saudi Arabian town of Khafji. Morris captures this ordeal through the eyes of the men who were there, giving readers a rare front-row seat to an incredible sequence of events. Max Morton, the pilot of a Cobra attack helicopter is forced to make an emergency landing in the heart of Khafji as the Iraqis are attacking. He and his crew narrowly escape after locating a tank of mystery fuel at a local oil refinery. Medic Kevin Callahan, member of a team of Marines caught behind enemy lines, watches helplessly as a female U.S. Army soldier and her male comrade are captured by Iraqi soldiers and spirited to Baghdad. Ronald Tull, suffering untold wounds, wakes up next to his burning light-armored vehicle thinking that it has been struck by an enemy tank round. Only later does he learn the full horror of the events that led up to the death of his seven buddies who were on board.But Storm on the Horizon is far more than a battle saga. It is a thoughtful examination of a new generation of fighting men coming to terms with its own war, a journey into the minds of men under supreme stress, and a heartfelt account of the innocence lost in a heartbeat and mourned for a lifetime.At once an unflinching chronicle of men at war and an appalling tableau, Storm on the Horizon looks into the savage heart of modern combat and raises troubling questions about the era of conflict that lies ahead.",
        "Category": " History , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Containers (Garden Project Workbooks)",
        "Authors": "By Carter, George, Majerus, Marianne, and Marjerus, Marianne",
        "Description": "Containers represent the ultimate in garden versatility and portability. Imaginative containers bring interest to any garden, from a mid-sized courtyard to a tiny balcony, and a wealth of effects can be achieved simply by rearranging the pots. Containers: A Garden Project Workbook is organized by container material, and its 20 projects include a brickwork trough, painted terra-cotta, an ornamental wire hanging basket, and a wooden obelisk.",
        "Category": " Gardening , Regional , General",
        "Publisher": "Stewart Tabori & Chang",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "No More Dead Dogs",
        "Authors": "By Korman, Gordon",
        "Description": "Truthful Wallace gives a thumbs-down to a book much to the chagrin of his English teacher, who sentences him to help with a stage version of the book but is unaware that Wallace's plot-improvement suggestions will wind up changing the entire production. Reprint.",
        "Category": " Juvenile Fiction , Social Themes , Adolescence & Coming of Age",
        "Publisher": "Hyperion Book CH",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "You Know You're Fifty When",
        "Authors": "By Marino, Lauren (EDT), Smith, Richard, and Solomon, Debra (ILT)",
        "Description": "Richard Smith's wildly popular books have made America laugh about everything from wedding-night jitters to weight loss. Now he turns his comic talent to a subject he's about to experience himself: climbing the half-century hill.Over the next 15 years, 52 million Gen Xers will celebrate their 50th birthdays. With Smith as their guide, the Gen Xers will know exactly what lies ahead. Not only does turning 50 mean you survived your 40s, but you get to join the AARP, answer your front door in bedroom slippers, and spend your kid's inheritance on liposuction. You also know you're 50 when...Your main form of aerobic exercise is getting up to change the channel; An obscene phone call makes you chuckle; You think a mosh pit is something found at the center of an exotic fruit; You wonder who'll die first--you or your money; You wish the \"ol' ticker\" had a quartz movement\"Performance anxiety\" refers to your golf game.With 200 of these cleverly illustrated clues and quips as well as comparison charts, entertaining graphs, and hilarious lists, You Know You're 50 When... will be the must-have, must-give birthday present for every soon-to-be-50 American.",
        "Category": " Self-help , Aging",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Disney Princess: My Side of the Story - Cinderella/Lady Tremaine - Book #1",
        "Authors": "By Atelier Philippe Harchy (ILT), Skinner, Daphne, and Kurtz, John",
        "Description": "Cinderella tells the story of her life with her stepmother and stepsisters, while her stepmother, Lady Tremaine, paints a different picture.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "The Man Who Turned Back the Clock",
        "Authors": "By Allen, Steve",
        "Description": "Actor, comedian, song writer, and author, the versatile Steve Allen has shared his very special brand of entertainment with audiences the world over. His penetrating wit and widsom allows us to laugh at ourselves while thinking about some of the serious issues of our time.Drawn from life's raw materials and his own fertile imagination, The Man Who Turned Back the Clock is a delightful yet provocative collection of short stories as only Steve Allen could write them. This wide-ranging assemblage includes 31 tantalizing tales. In addition to the title story, readers will find \"The Humor Strike\"; \"It's Nice to See You Again\"; \"The Day the Jews Disappeared,\" addressing anti-Semitism; \"The Sunday Morning Shift,\" focusing on the scandals of money-grubbing evangelists; \"The Jensen Theory,\" which takes a look at racism; \"The Girls on the Tenth Floor;\" Allen's whimsical \"Point of View\"; and many more. Readers will find in some the surprising twists and turns of an \"O.Henry\" yarn.This collection is funny, it's thoughtful, it's vintage Steve Allen!",
        "Category": "",
        "Publisher": "Prometheus",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "All the Holy Days and Holidays: Or Sermons on All National and Religious Memorial Days (The \"All\" Series)",
        "Authors": "By Lockyer, Herbert",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1968"
        }
    },
    {
        "Title": "Handbook of Walkthroughs, Inspections, and Technical Reviews: Evaluating Programs, Projects, and Products",
        "Authors": "By Weinberg, Gerald M. and Freedman, Daniel P",
        "Description": "A reprint of the 3rd edition published in 1982 by Little, Brown. Shows how to implement reviews for a variety of product and software development. Gives procedures for conducting walkthroughs (peer group reviews), inspections, and technical reviews, with checklists for each type of material reviewed, including specification, design, and code reviews. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Computers , Data Processing",
        "Publisher": "Dorset House",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "National Defense",
        "Authors": "By Fallows, James M.",
        "Description": "Analyzes, with numerous specific examples, every important aspect of the nation's defense policy and outlines the priorities that must be established to develop a reliable, affordable defense",
        "Category": "",
        "Publisher": "RANDOM HOUSE",
        "Price Starting With ($)": "14.2",
        "Publish Date": {
            "Month": "May",
            "Year": "1981"
        }
    },
    {
        "Title": "The Glory of Angels (Suitable for Framing)",
        "Authors": "By Hale, Glorya (EDT)",
        "Description": "A richly illustrated collection of thirty-two full-color angel images--all created on fine perforated paper that detaches easily and all suitable for framing--also includes tips on matting, framing, and hanging.",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Cappuccino/Espresso: The Book of Beverages (Nitty Gritty Cookbooks)",
        "Authors": "By Katona, Christie and Katona, Thomas",
        "Description": "",
        "Category": " Cooking , Beverages , Coffee & Tea",
        "Publisher": "Bristol Pub Enterprises",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "How to Handle Conflict & Confrontation",
        "Authors": "By Pickering, Peg",
        "Description": "",
        "Category": "",
        "Publisher": "Natl Seminars Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "The Turtle: An Owner's Guide to a Happy Healthy Pet",
        "Authors": "By Flank, Lenny",
        "Description": "Written by a chelonian lover whose collection of reptiles and amphibians numbers close to 100 specimens. Advice on the 10 best and 10 worst turtles and tortoises for beginners.",
        "Category": " Pets , Reptiles, Amphibians & Terrariums",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "The Bible Code",
        "Authors": "By Drosnin, Michael",
        "Description": "0n September 1, 1994, I flew to Israel and met in Jerusalem with a close friend of Prime Minister Yitzhak Rabin, the poet Chaim Guri. I gave him a letter which he immediately gave to the Prime Minister. \"An Israeli mathematician has discovered a hidden code in the Bible that appears to reveal the details of events that took place thousands of years after the Bible was written,\" my letter to Rabin stated. \"The reason I'm telling you about this is that the only time your full name Yitzhak Rabin is encoded in the Bible, the words 'assassin that will assassinate' cross your name.\" On November 4, 1995, came the awful confirmation, a shot in the back from a man who believed he was on a mission from God, the murder that was encoded in the Bible three thousand years ago.",
        "Category": " Body, Mind & Spirit , Prophecy",
        "Publisher": "Atria",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "A Child's Christmas at St. Nicholas Circle",
        "Authors": "By Kinkade, Thomas (ILT) and McKelvey, Douglas Kaine",
        "Description": "A Child's Christmas at St. Nicholas Circle is a fictional story based on one of the Thomas Kinkade's most popular holiday painting, St. Nicholas Circle.  Young children and families will delight as the painting comes to life and they are immersed in the colors and lights of the holiday season.  They story concludes at the church on the circle on Christmas Eve with a warm, heart tugging ending.  This book will quickly become a holiday classic and a family tradition.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The View from Nowhere: The Only Bar Guide You'll Ever Want -- Or Need",
        "Authors": "By Atkinson, Jim",
        "Description": "Describes and rates bars and taverns across the United States, and discusses the prerequisites of a good bar",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "The Wines of America",
        "Authors": "By Adams, Leon D.",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill Companies",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Automobile Quarterly's Great Cars & Grand Marques",
        "Authors": "By Rh Value Publishing~Beverly Rae Kimes",
        "Description": "",
        "Category": "",
        "Publisher": "Bonanza Books",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "Embroidery",
        "Authors": "By Brown, Pauline",
        "Description": "Offers step-by-step instructions to basic stitches for needlepoint, drawn thread work, and applique, including a selection of original designs using a variety of embroidery techniques",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Bdd Promotional Book Co",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Compact History of the Civil War",
        "Authors": "By Dupuy, R. Ernest and Dupuy, Trevor Nevitt",
        "Description": "Two of America's most esteemed military historians present a concise, fascinating one-volume encyclopedia of the Civil War which covers all the important aspects of the War from the brilliant campaigns and strategies to the mistakes that cost the South the war. Includes portraits of the great leaders.",
        "Category": " History , Americas (North, Central, South, West Indies)",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Tofu Cookery",
        "Authors": "By Hagler, Louise",
        "Description": "",
        "Category": " Cooking , Methods , Cookery for One",
        "Publisher": "Book Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Just Labs",
        "Authors": "By Smith, Steve and Spartas, Dale C. (PHT)",
        "Description": "",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Willow Creek Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Warren Report: The Official Report on the Assassination of President John F. Kennedy",
        "Authors": "By Various",
        "Description": "",
        "Category": "",
        "Publisher": "Associated Press",
        "Price Starting With ($)": "8.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Making Your Own Gourmet Chocolate Drinks: Hot Drinks, Cold Drinks, Sodas, Floats, Shakes, and More!",
        "Authors": "By Tekulsky, Mathew and Moritz-Magnesio, Clair (ILT)",
        "Description": "Following on the enormous success of his best-selling books Making Your Own Gourmet Coffee Drinks and Making Your Own Gourmet Tea Drinks, Mathew Tekulsky now turns his talents to chocolate. He begins with a short discussion on the history of chocolate, how the different types are made (unsweetened and semisweet chocolate, unsweetened cocoa powder, white chocolate, chocolate syrup), and how to store and use chocolate. Making Your Own Gourmet Chocolate Drinks then offers more than 100 tasty chocolate drinks, including such delectable treats as Hot Chocolate Royale, Butterscotch Hot Chocolate, Hot Cocoa-Espresso Eggnog, Chocolate-Strawberry Ice Cream Soda, Chocolate-Marshmallow Blend, Chocolate Malted Shake, Rum Hot Chocolate, Brandy-Grand Marnier Hot Chocolate, Creme de Cacao-Frangelico Delight, and Strawberry-Amaretto Chocolate Shake.With this book, you will be able to bring the taste and spirit of your local chocolate bar into the comfort of your own home and be introduced to the most creative ways of serving both hot and cold chocolate drinks.",
        "Category": " Cooking , Beverages , Non-Alcoholic",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Rodale's Garden Problem Solver: Vegetables, Fruits, and Herbs",
        "Authors": "By Ball, Jeff",
        "Description": "Covers insect and animal pests, diseases, weeds, propagation, storage, and nutrient and environmental deficiences. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Gardening , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Discipline Without Shouting or Spanking: Practical Solutions to the Most Common Preschool Behavior Problems",
        "Authors": "By Unell, Barbara C. and Wyckoff, Jerry",
        "Description": "Discipline Without Shouting or Spanking offers effective, practical, nonviolent options for correcting the most common behavior problems of preschoolers. You will learn how to deal with misbehavior including temper tantrums, whining, negativity, sibling rivalry, possessiveness, aggressive behavior, resisting bedtime, playing with food, and many more problems -- without shouting or spanking.  The authors' advice will help you be a more effective parent and discipline your child in a loving yet firm way, without damaging self-esteem or natural curiosity about the world. This easy-to-use text has been formatted like a first-aid manual for handling misbehavior.  It has already helped over 700,000 parents.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Chuck Jones' Peter and the Wolf",
        "Authors": "By Daugherty, George and Diamond, Janis",
        "Description": "Prokofiev's classic story is recreated through the legendary animation of Chuck Jones, introducing a new cast of memorable animated characters brought to life for the CD-ROM version of conductor/director/writer George Daugherty, and featuring forty-eight four-color illustrations.",
        "Category": "",
        "Publisher": "Warner Juvenile Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Rodale's Flower Garden Problem Solver: Annuals, Perennials, Bulbs, and Roses",
        "Authors": "By Ball, Jeff, Ball, Liz, Carroll, Pamela, Carroll, Walter, and Brickman, Robin",
        "Description": "Offers a \"medicine cabinet\" of ideas for identifying and correcting common problems without using dangerous chemicals. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Gardening , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Whisky: The Water of Life - Uisge Beatha",
        "Authors": "By Arthur, Helen",
        "Description": "Arthur, a veteran of the whisky industry, provides a wealth of information for the connoisseur of this popular spirit. She discusses the distillation process, how the drink managed to survive periods of taxation and prohibition, how various countries adapted their own resources and climate conditions to produce whiskies made from a variety of grains, and the culture of whisky, particularly advertising. She also offers the names of whisky societies, distilleries with addresses and contact numbers, and an alphabetical directory of selected whiskies. Extensively illustrated with 40 color and b&w illustrations. Canadian card order number: C99-932188-9. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Cooking , Beverages , Alcoholic , General",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Fingerfood: Bite-sized Food for Cocktail Parties (Compacts)",
        "Authors": "By Petersen-Schepelern, Elsa",
        "Description": "",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Ryland Peters & Small",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "The Kennedy Wit (A Bantam Sixty H2992)",
        "Authors": "By Kennedy, John F., Adler, Bill",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Conceived in Liberty: Joshua Chamberlin, William Oates, and the American Civil War",
        "Authors": "By Perry, Mark",
        "Description": "An intriguing dual biography chronicles the parallel lives of Union Colonel Joshua Chamberlain and Confederate Colonel William Oates, whose troops clashed in an epochal contest at Little Round Top that determined the outcome of the Battle of Gettysburg. 12,500 first printing. Tour.",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "RACCOON (Animal Shape Board Books)",
        "Authors": "By Rizzatti, Lorella",
        "Description": "Raccoon discovers that all of his friends are busy, including salmon, mouse, bird, and beaver",
        "Category": "",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "What No One Tells the Bride: Surviving the Wedding, Sex After the Honeymoon, Second Thoughts, Wedding Cake Freezer Burn, Becoming Your Mother, Screaming about Money, Screaming about In-Laws, etc.",
        "Authors": "By Stark, Marg",
        "Description": "What No One Tells the Bride is the inside scoop--good and bad--on what it's really like being married. In these pages, journalist Marg Stark breaks the newlywed code of silence and exposes the profound adjustments brides often experience. Stark and 50 married women tell their stories--showing others how to handle turbulence on cloud nine--and reveal marital truths, such as:  You don't feel like a \"Mrs.\" Sometimes you even dream about old boyfriends.  You write all the wedding gift thank-you notes. So you are doomed to your mother's life--60 years of doing more than your share?  Making love is the last thing on your mind when you have the flu and haven't showered for days. But he still wants to.  You tell him you got these incredible bargains and quietly resent having to justify your spending.  You have shining moments when marriage feels absolutely right, but nevertheless you pine for something more.Humorous and compassionate--with advice from marriage counselors, ministers, financial advisors, and sex therapists--What No One Tells the Bride is not only a practical guide for every newly married woman, it also makes the perfect wedding shower gifts.",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "MY FIRST LOOK AT NOISES",
        "Authors": "By Rann, Toni, Yorke, Jane (EDT), and Oliver, Stephen",
        "Description": "Introduces the concept of noises through photographs of musical instruments, noisy toys, animals making noise, and other situations with sounds",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Robots, Androids, and Animatrons: 12 Incredible Projects You Can Build",
        "Authors": "By Iovine, John",
        "Description": "Offers twelve projects for building robots, including robotic hands, a telepresence robot, and a robotic insect",
        "Category": " Technology & Engineering , Mechanical",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Demonology",
        "Authors": "By Moody, Rick",
        "Description": "The author of Purple America and Ice Storm serves up a new collection of stories that seals his reputation as one of the best American writers under the age of forty. 25,000 first printing.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "What Color is a Conservative?",
        "Authors": "By Winston, Chriss and Watts, J. C.",
        "Description": "An inspiring autobiography by one of America’s emerging African-American leadersThis is the inspiring story of J. C. Watts’ journey from poverty to college football acclaim to the United States Congress. For the first time in print, Watts shares his hopes and plans for the future of America. Included is an account of his confrontation with the Rev. Jesse Jackson on race and victimization. He tells how he prepared his televised response to President Clinton’s State-of-the-Union address even as the world awaited the verdict of the O. J. Simpson trial. Watts forthrightly explains how his deep abiding personal relationship with Jesus Christ directs his role as a leader in America.",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Senator: My Ten Years With Ted Kennedy",
        "Authors": "By Burke, Richard E., Hoffer, William, and Hoffer, Marilyn",
        "Description": "In 1971 Richard Burke, a freshman at Georgetown University, volunteered his services to the offices of his political idol, Senator Edward M. Kennedy of Massachusetts. Through ability, hard work, and dedication, Burke rose in the next four years to become one of the Senator's closest staff members. In 1977 he was made Kennedy's personal assistant; after his appointment in 1978 as administrative assistant - the youngest in the Senate - he came to know Edward M. Kennedy perhaps more intimately than anyone outside the closed circle of the Senator's family. He was often the last to see the Senator at night and the first to see him in the morning.This book is the account of what Richard Burke witnessed and experienced during his decade at the Senator's right hand. It is neither a full biography nor an examination of Kennedy's long career in government. Rather, it is the history of a young man who shared the Senator's professional and personal lives during a time marked by exhilarating public achievements and tragic secret misconduct. His story is not only the chronicle of a shattered idol, but of Richard Burke's own fall from grace, and eventual recovery. Burke does not shrink from confronting his own faults, and he agrees with the Senator: It is time for him to confront his.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "French Food, American Accent: Debra Ponzek's Spirited Cuisine",
        "Authors": "By Ponzek, Debra and Schwartz, Joan",
        "Description": "A collection of more than 175 outstanding recipes provides an updated course in the techniques of classic French cookery, presenting a range of simply prepared, flavorful soups and stocks, salads, grains, vegetables, fish, meat and poultry, and flavored oils and vinegars. 15,000 first printing.",
        "Category": " Cooking , Regional & Ethnic , French",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "The Hip Girl's Handbook for Home, Car, Money & Stuff",
        "Authors": "By Musselman, Jennifer and Degregori, Patty",
        "Description": "A guide on managing an independent life for young women offers practical and anecdotal advice on living safely and competently, addressing everything from using a barbecue grill and changing flat tires to unclogging drains and managing credit. Original. 20,000 first printing.",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Wildcat Canyon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Dawn Song",
        "Authors": "By Gilbert, Margaret Christensen",
        "Description": "",
        "Category": "",
        "Publisher": "Gilbert",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "America's Yesterdays",
        "Authors": "By United States. Library of Congress. Prints and Photographs D",
        "Description": "",
        "Category": "",
        "Publisher": "American Heritage Publishing Co.",
        "Price Starting With ($)": "8.93",
        "Publish Date": {
            "Month": "August",
            "Year": "1979"
        }
    },
    {
        "Title": "The Last Full Measure: The Life and Death of the First Minnesota Volunteers",
        "Authors": "By Moe, Richard",
        "Description": "The First Minnesota Volunteers, the first regiment offered to Lincoln after the fall of Fort Sumter, served in virtually every major battle fought in the eastern theater during the first three years of the Civil War. This is the story of the Army of the Potomac during that period: the initial enthusiasm dashed by sudden defeat at Bull Run; the pride at being shaped into an army by George McClellan and the frustration with his - and his successors' - inability to defeat Robert E. Lee; and, finally, the costly victory at Gettysburg, the decisive battle in which the First Minnesota played a crucial, and tragic, role. Drawing on a wide array of letters, diaries, and personal reminiscences, many of them previously unpublished, Richard Moe tells the story anew through the experiences of the men who lived it. As James MacGregor Burns notes in his foreword, \"Like Tolstoy's War and Peace, this work sticks close to the men in battle, and hence, like Tolstoy, the author keeps close to the human side of war.\" In the words of Ken Burns, Moe has created \"a version of history told from the bottom up, not the top down, and we are all the richer.\"",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Frederic Remington (The Art for Children Series)",
        "Authors": "By Raboff, Ernest Lloyd",
        "Description": "A brief biography of the artist and sculptor accompanies fifteen color reproductions and critical interpretations of his works.",
        "Category": "",
        "Publisher": "Trophy Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "The Complete Step-By-Step Cookbook : More Than 800 Recipes in Full Colour",
        "Authors": "By Salamander",
        "Description": "",
        "Category": "",
        "Publisher": "Salamander Books",
        "Price Starting With ($)": "7.77",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Sanctuaries: The Complete United States: A Guide to Lodgings in Monasteries, Abbeys, and Retreats",
        "Authors": "By Jack Kelly, Marcia Kelly",
        "Description": "",
        "Category": "",
        "Publisher": "Bell Tower New York",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "High Blood Pressure Lowered Naturally: Your Arteries Can Clean Themselves",
        "Authors": "By The Editors of FC&A Medical Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "FC&A Medical Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Cut and Run",
        "Authors": "By Pearson, Ridley",
        "Description": "A spellbinding thriller pitting a U.S. federal marshal against the mob's most resourceful killer--in a race to save the woman he loves Six years ago, witness protection marshal Roland Larson did the unthinkable: He fell in love with a protected witness, Hope Stevens, whose testimony was to put away prominent members of the Romero crime family. When Hope's plan to \"cut and run\" is interrupted by both the government and the mob, she disappears into a new identity, taking with her not only her testimony but also a secret never shared with Larson. Larson, who has been looking for her ever since, is put back on her trail when the Romeros intercept the master WITSEC list from the Justice Department and Hope is believed to be among the first protected witnesses targeted for execution. In a series of terrifying encounters, Larson matches wits with a brutally ingenious killer whose sole target is Hope Stevens. For Larson, the stakes couldn't be higher--he must find Hope in order to protect her and simultaneously prevent the mob from auctioning off the master witness protection list--an act that will put seven thousand innocent, and not-so-innocent, lives in jeopardy. Taut and edge-of-the-seat compelling, Cut and Run is a unique thriller that skillfully blends romance and suspense--Ridley Pearson at his heart-pounding best.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Dare to Repair: A Do-it-Herself Guide to Fixing (Almost) Anything in the Home",
        "Authors": "By Sussman, Julie, Glakas-Tenet, Stephanie, and Lampathakis, Yeorgos (ILT)",
        "Description": "This is NOT your father's home repair book!And it's not your husband's, your brother's, your boyfriend's, or the guy's next door. Dare to Repair is a do-it-herself book for every woman who would rather be self-reliant than rely on a super or contractor.No matter the depth of your pockets or the size of your home, a toilet will get clogged, a circuit breaker will trip, and a smoke detector will stop working. It's up to you how you'll deal with them -- live in denial, pay the piper, or get real and do it yourself.Dare to Repair demystifies these home repairs by providing information that other books leave out.In Dare to Repair, you'll learn how to:Take the plunge -- from fixing a leaky faucet to cleaning the gutters.Lighten up -- from removing a broken light bulb to installing a dimmer switch.Keep your cool -- from maintaining a refrigerator's gasket to changing the rotation of a ceiling fan.Get a handle on it -- from replacing a doorknob to repairing a broken window.Play it safe -- from planning a fire escape route to installing a smoke detector.Filled with detailed illustrations, Dare to Repair provides even the most repair-challenged woman with the ability to successfully fix things around the home. Once you start, you won't want to stop.",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "God has a story too: Sermons in context",
        "Authors": "By Sanders, James A.",
        "Description": "",
        "Category": "",
        "Publisher": "Fortress Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Lullaby (An 87th Precinct Novel)",
        "Authors": "By McBain, Ed",
        "Description": "At the New Year, the men and women of the 87th precinct face the threat of gang warfare, a burned-out policewoman swears off sex and undercover work, and Detectives Meyer and Carilla search for the killer of an infant",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Voices of Strength And Hope for a Friend With AIDS",
        "Authors": "By Gallagher, Joseph",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Sheed & Ward",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Fighting for the Future: Will America Triumph?",
        "Authors": "By Peters, Ralph",
        "Description": "Describes the tactics, motivation, and psychology of a new \"warrior class\" that conventional armed forces are ill-prepared to engage",
        "Category": " Political Science , Security (National & International)",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Cardinal Nation",
        "Authors": "By Rains, Rob",
        "Description": "All of the great moments, the great performances, the great players in the history of St. Louis Cardinals baseball history comes together in this special commemorative book from The Sporting News.  From the Gashouse Gang to Big Mac, from Sportsman's Park to Busch Stadium, from Harry Caray to Jack Buck, Cardinal Nation celebrates everything that makes the Cardinals a special franchise. Includes a special foreword Mr. Cardinal himself, Stan Musial.",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Sporting News",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "The Politics of Truth: Inside the Lies that Led to War and Betrayed My Wife's CIA Identity: A Diplomat's Memoir",
        "Authors": "By Wilson, Joseph",
        "Description": "Through the last three presidential administrations and two wars with Iraq, no one has personally witnessed, influenced, or fueled news over more history-making events than Joseph Wilson. The last American diplomat to sit face-to-face with Saddam Hussein, he is a consummate insider who has the intelligence, principles, and independence to examine current American foreign policy and the inner workings of government and to form a candid assessment of the United States’ involvement in the world. In February 2002, Joseph Wilson was sent to Niger by the CIA to investigate claims that Iraq had sought to purchase uranium in that country. Wilson’s report, and two from other American officials, conclusively negated such rumors, yet all were brushed aside by the White House. Startled by the infamous words uttered by George W. Bush in his 2003 State of the Union Address: “The British Government has learned that Saddam Hussein recently sought significant quantities of uranium from Africa,” Wilson decided to reveal the truth behind the initiation of the Iraq war. The Politics of Truth is an explosive and revelatory book by a man who stands for the accurate recording of history against those forces bent on fabricating truth.",
        "Category": " Political Science , International Relations , Diplomacy",
        "Publisher": "Carroll & Graf",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Harry Potter and the Bible : The Menace Behind the Magick",
        "Authors": "By Abanes, Richard",
        "Description": "",
        "Category": " Religion , Cults",
        "Publisher": "Horizon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Raising a Happy, Unspoiled Child (How Parents Can Help Their Baby Develop Into a Secure and We)",
        "Authors": "By White, Burton L.",
        "Description": "REQUIRED READING FOR PARENTS WHO WANT TO GIVE THEIR CHILD THE BEST START IN LIFE  Must your charming five-month-old turn into a tiny terror? Are the \"terrible twos\" and public tantrums inevitable? Burton White, author of the classic The First Three Years of Life, doesn't think so. Basing his recommendations on thirty-seven years of research and observation, White shows how to bring up an independent, socially secure, and delightful child.  In his groundbreaking and easy-to-follow book, White takes parents through the normal development stages of their child's first thirty-six months, recommending the best ways to:  React to a child's intentional cry Cope with stranger anxiety, separation anxiety, and sibling rivalry Manage unacceptable behavior without causing emotional harm to a child or damaging the parent/child relationship Handle challenging sleep situations, calm a cranky newborn, and deal with the toddler's fine art of the whine  All parents who want a peaceful, loving relationship with their child instead of a constant emotional tug-of-war will find that Raising a Happy, Unspoiled Child is the one book that must have a place on their shelf.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Broken Drum (White Mane Kids)",
        "Authors": "By Hemingway, Edith Morris, Shields, Jacqueline Cosgrove, and Cosgrove, Kenneth L. (ILT)",
        "Description": "In 1861 Charley, a twelve-year-old drummer boy with the Army of the Potomac, is caught up in the excitement and horrors of the Civil War as he travels from Washington towards Antietam",
        "Category": " Juvenile Fiction , General",
        "Publisher": "White Mane Kids",
        "Price Starting With ($)": "12.11",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "4th of July",
        "Authors": "By Patterson, James and Paetro, Maxine",
        "Description": "Detective Lindsay Boxer and the Women's Murder Club make a courageous return for their fourth and most chilling case ever-one that could easily be their last. In a late-night showdown after a near-fatal car chase, San Francisco police lieutenant Lindsay Boxer has to make an instantaneous decision: in self-defense, she fires her weapon-and sets off a chain of events that leaves a police force disgraced, an entire city divided, and a family destroyed. Now everything she's worked her entire life for hinges on the decision of twelve jurors. To escape scrutiny during breaks from her trial, Lindsay retreats to the picturesque town of Half Moon Bay. But soon after her arrival, a string of grisly murders punches through the peaceful community. There are no witnesses and there is no discernible pattern. But a key detail recalls a case Lindsay worked on as a rookie years before-an unsolved murder that has haunted her ever since. As summer comes into full swing, Lindsay and her friends in the Women's Murder Club battle for her life on two fronts: before a judge and jury as her trial comes to a climax, and facing unknown adversaries who will do anything to keep her from the truth about the killings-including killing again. James Patterson fine-tunes the tension as never before in this breathtaking addition to the best-selling detective series to debut in a decade.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Knowing God Intimately: Being as Close to Him as You Want to Be",
        "Authors": "By Meyer, Joyce",
        "Description": "Identifies four levels of Christian intimacy, advising readers on how to pursue a self-motivated relationship with God and sharing biblical examples and the author's own personal experiences. 100,000 first printing.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "FaithWords",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Hey Nostradamus!: A Novel (Coupland, Douglas)",
        "Authors": "By Coupland, Douglas",
        "Description": "A powerful, surprising, and deeply moving book.In 1988, a catastrophic episode of teen violence changes a suburban community forever.  Hey Nostradamus! is Douglas Coupland's keenly observant exploration of this tragic landscape.With unflinching candor and black humor, Hey Nostradamus! follows various voices across two decades: the teenagers whose ordinary preoccupations with sex and spirituality will never evolve past that moment; the parents whose sudden exposure to their children's passionate underground world threatens their deepest convictions; and those who come to know the troubled survivors only later in life, who will only ever have an inkling of what really transpired.Utterly unexpected, Hey Nostradamus! wrestles with religion and with sorrow and its acceptance. It will take you to a place you didn't know existed.",
        "Category": " Fiction , Literary",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Understanding Bible Prophecy for Yourself (Tim LaHaye Prophecy Library)",
        "Authors": "By LaHaye, Tim F.",
        "Description": "",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Martin Luther;: The story of his life,",
        "Authors": "By Singmaster, Elsie",
        "Description": "",
        "Category": "",
        "Publisher": "The Board of publication of the United Lutheran church in America",
        "Price Starting With ($)": "36.61",
        "Publish Date": {
            "Month": "January",
            "Year": "1939"
        }
    },
    {
        "Title": "Mr. Food's Meals in Minutes",
        "Authors": "By Ginsburg, Art",
        "Description": "A cookbook to accommodate today's busy lifestyles features more than 130 easy-to-prepare recipes ready to serve in less than thirty minutes and that take no more than eight ingredients, including delicious concoctions for breakfast, lunch, and dinner.",
        "Category": " Cooking , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "SAM SHEPARD 7 PLAYS",
        "Authors": "By Shepard, Sam",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "Twilight of the Old Order, 1774-1778 (Age of the French Revolution)",
        "Authors": "By Manceron, Claude and Wolf, Patricia",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Touchstone Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Black Livingstone: A True Tale of Adventure in the Nineteenth-Century Congo",
        "Authors": "By Kennedy, Pagan",
        "Description": "Black Livingstone is the first book to chronicle the remarkable life of William Henry Sheppard. As a twenty-four-year-old African American missionary in 1890, Sheppard departed for what was then the Belgian Congo, accompanied by Samuel Lapsley, a white man who had grown up on a plantation and was the son of a prominent Alabama judge. Lapsley died of fever barely a year later, but Sheppard thrived in Africa for three more years before returning to America. Back home, Sheppard was billed as the \"Black Livingstone\" as he traveled the country, lecturing to packed auditoriums. Black and white, rich and poor alike came to hear his true tales of African adventure. One year later he returned to the Congo, where he witnessed and gathered testimony on the genocide being perpetrated by the Belgian government and the rubber companies, eventually helping to break their hold on the region.  Pagan Kennedy unfolds Sheppard's life and times with a novelist's narrative skill and penetrates the complexity of her subject-a man who found power in the Congo but not in the Church to which he dedicated his life, who fought the persecution of Africans but never of blacks in his own country. Beautifully illustrated with archival photographs, Black Livingstone will appeal widely to readers of books on African history such as King Leopold's Ghost and In the Footsteps of Mr. Kurtz, as well as readers of fiction set in Africa, like Barbara Kingsolver's bestseller, The Poisonwood Bible.",
        "Category": " Biography & Autobiography , Educators",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Our Brothers' War",
        "Authors": "By Morehead, Maureen and Carr, Pat",
        "Description": "",
        "Category": "",
        "Publisher": "Sulgrave Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Weight Training for Beginners (v. 1)",
        "Authors": "By Reynolds, Bill",
        "Description": "Discusses the fundamentals of weight lifting and recommends weight training exercises designed to increase muscle strength, condition the body, and improve physical fitness",
        "Category": " Sports & Recreation , Bodybuilding & Weight Training",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1982"
        }
    },
    {
        "Title": "Salukis",
        "Authors": "By Burch, Virginia M.",
        "Description": "Traces the history of salukis, describes breeding standards, and includes advice on grooming, training, and health care",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Alexis Bespaloff's Guide To Inexpensive Wines",
        "Authors": "By Alexis bespaloff",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1976"
        }
    },
    {
        "Title": "Tea With Patsy Clairmont",
        "Authors": "By Clairmont, Patsy",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Servant Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "My First Book of Animals",
        "Authors": "By Harris, Monica",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Carving Clowns & Circus Wagons",
        "Authors": "By Smith, Billy J.",
        "Description": "Tells how to select woods, patterns, paint, tools, and suggests methods to display the clowns and circus wagons",
        "Category": " Crafts & Hobbies , Carving",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "Daughter of Gascony",
        "Authors": "By Edwards, Samuel",
        "Description": "",
        "Category": "",
        "Publisher": "Macrae Smith",
        "Price Starting With ($)": "9.27",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Managerial communication: A finger on the pulse",
        "Authors": "By Timm, Paul R.",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Natural healing: remedies & therapies: Nature's way to health, relaxation and vitality: a complete practical guide",
        "Authors": "By Mark Evans",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Winter: Notes from Montana",
        "Authors": "By Bass, Rick",
        "Description": "The author describes the wild beauty as well as the physical and psychological hardships involved in spending a winter in a remote Montana valley of thirty inhabitants, the last valley in the state without electricity",
        "Category": " Nature , Natural Resources",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Censored 2003: The Top 25 Censored Stories",
        "Authors": "By Phillips, Peter",
        "Description": "The yearly volumes of Censored, in continuous publication since 1976 and since 1995 available through Seven Stories Press, is dedicated to the stories that ought to be top features on the nightly news, but that are missing because of media bias and self-censorship. The top stories are listed democratically in order of importance according to students, faculty, and a national panel of judges. Each of the top stories is presented at length, alongside updates from the investigative reporters who broke the stories.Beyond the Top 25 stories, additional chapters delve further into timely media topics: The Censored News and Media Analysis section provides annual updates on Junk Food News and News Abuse, Censored Déjà Vu, signs of hope in the alternative and news media, and the state of media bias and alternative coverage around the world. In the Truth Emergency section, scholars and journalists take a critical look at the US/NATO military-industrial-media empire. And in the Project Censored International section, the meaning of media democracy worldwide is explored in close association with Project Censored affiliates in universities and at media organizations all over the world.A perennial favorite of booksellers, teachers, and readers everywhere, Censored is one of the strongest life signs of our current collective desire to get the news we citizens need—despite what Big Media tells us.",
        "Category": " Reference , Yearbooks & Annuals",
        "Publisher": "Seven Stories Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Deer Hunter's Yearbook (Outdoor Life)",
        "Authors": "By Haas, George H.",
        "Description": "",
        "Category": "",
        "Publisher": "Outdoor Life",
        "Price Starting With ($)": "8.11",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "A Show of Hands: Needlepoint Designs by Janet McCafery",
        "Authors": "By McCaffery, Janet and Lindemeyer, Nancy",
        "Description": "Original, colorful designs of hands holding a variety of items are framed with vibrant borders, carry their own unique symbolism representing such themes as love, hospitality, friendship, or various occupations, and come with instructions and materials lists. 35,000 first printing.",
        "Category": " Crafts & Hobbies , Needlework , Needlepoint",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "The Wife Of Reilly",
        "Authors": "By Coburn, Jennifer",
        "Description": "When the narrator, who is married, attends her college reunion, she falls head over heels for an old flame, causing her to place a personal ad to find a new wife for her husband Reilly and, among the nymphos, gold diggers, and man-haters, finds her replacement. Original. 35,000 first printing.",
        "Category": " Fiction , Women",
        "Publisher": "Kensington",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Easter Story",
        "Authors": "By Pingry, Patricia A. and Utt, Mary Ann (ILT)",
        "Description": "A brief retelling of the events of the first Easter, from Jesus' ministry through the crucifixion and resurrection.",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Easter & Lent",
        "Publisher": "WorthyKids",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Pleasure of Herbs: A Month-by-Month Guide to Growing, Using, and Enjoying Herbs",
        "Authors": "By Shaudys, Phyllis V.",
        "Description": "Describes the characteristics of the most popular herbs, offers month-by-month suggestions on ways to use herbs, and includes recipes for foods, beverages, and potpurries",
        "Category": " Gardening , Herbs",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The Civil War in Art",
        "Authors": "By Jacobson, Doranne",
        "Description": "Devotes a chapter to each year of the Civil War, pairing sections on the great battles, leaders, weapons, and tragedies with the master works of such artists as Winslow Homer, James Walker, Edwin Forbes, Mathew Brady, and Alexander Gardner.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Smithmark Publishers",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Stamping With Style Inspired Effects Wit",
        "Authors": "By Walton, Stewart",
        "Description": "",
        "Category": "",
        "Publisher": "Anness Publishing/lorenz Books",
        "Price Starting With ($)": "5.01",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "So You Want to Be President? (CALDECOTT MEDAL BOOK)",
        "Authors": "By St. George, Judith and Small, David (ILT)",
        "Description": "Complete with full-color illustrations, this fun fact-filled book provides young readers with colorful profiles on many of the most popular presidents along with humorous tales, anedotes, behind-the-scenes stories, and more. 20,000 first printing.",
        "Category": " Juvenile Nonfiction , People & Places , United States , General",
        "Publisher": "Philomel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "If I Gave You God's Phone Number.... Searching for Spirituality in America",
        "Authors": "By Cromwell, Mare",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Pamoon Press",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Book Collecting 2000 (COLLECTED BOOKS)",
        "Authors": "By Ahearn, Allen and Ahearn, Patricia",
        "Description": "A reference source for book collectors features basic information about first printings and book values, as well as a century retrospective and primer on the influence of the Internet.",
        "Category": " Literary Criticism , Books & Reading",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "A Queen for All Seasons: A Year of Tips, Tricks, and Picks for a Cleaner House and a More Organized Life!",
        "Authors": "By Cobb, Linda",
        "Description": "The Queen of Clean  with her royal tips for every season,  an untidy home would almost be treason!  Winter  Make snow shoveling a breeze...store holiday decorations with no tangles...humidify dry indoor air...care for flannel sheets...make those Valentine's gems sparkle  Spring  Garden the natural way...allergy-proof your home...banish grass stains...color your Easter eggs  Summer  Prepare for family road trips...care for your camping equipment...keep bugs away without chemicals...clean your sports gear  Fall  Get organized for back to school...store your summer clothes properly...put away your air conditioner...prepare for stress-free holidays!",
        "Category": " House & Home , Cleaning, Caretaking & Organizing",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Jesus Man of Joy: Finding Meaning for Your Life through Knowing God",
        "Authors": "By Sherwood Eliot Wirt",
        "Description": "",
        "Category": "",
        "Publisher": "Word Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Wonder of Boys",
        "Authors": "By Gurian, Michael",
        "Description": "A parents' guide to raising boys offers practical steps for channeling boys' energy without accepting antisocial behavior, including advice on what parents, mentors, schools, and communities should do. Reprint. 25,000 first printing.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Gourmet's Best Desserts",
        "Authors": "By Gourmet",
        "Description": "This collection of six hundred dessert recipes includes an assortment of tortes, layer cakes, pies, and cookies, and features contributions by James Beard and Elizabeth Colchie",
        "Category": " Cooking , Methods , Gourmet",
        "Publisher": "RANDOM HOUSE",
        "Price Starting With ($)": "8.35",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "The Snake Who Was Afraid of People (Rainbow Morning Music Picture Books)",
        "Authors": "By Polisar, Barry Louis and Clark, David (ILT)",
        "Description": "This book reveals the deep-rooted feelings of a snake who is afraid of people. His fears prove well-founded when he is captured by a school-aged child and held captive in a jar with little air. The snake manages to escape and goes into hiding, aided by a group of beret-wearing reptiles who are really operating underground.",
        "Category": " Juvenile Fiction , Animals , Reptiles & Amphibians",
        "Publisher": "Rainbow Morning Music",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "The Light of the Home: An Intimate View of the Lives of Women in Victorian America",
        "Authors": "By Green, Harvey",
        "Description": "From the greatest collection of American Voctoriana comes a wonderful evocation of the lives of women 100 years ago. 125 black & white photos.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Brundibar",
        "Authors": "By Sendak, Maurice (ILT) and Kushner, Tony",
        "Description": "When Aninku and Pepicek discover one morning that their mother is sick, they rush to town for milk to make her better.  Their attempt to earn money by singing is thwarted by a bullying, bellowing hurdy-gurdy grinder, Brundibar, who tyrannizes the town square and chases all other street musicians away.   Befriended by three intelligent talking animals and three hundred helpful schoolkids, brother and sister sing for the money to buy the milk, defeat the bully, and triumphantly return home.  Brundibar is based on a Czech opera for children that was performed fifty-five times by the children of Terezin, the Nazi concentration camp",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Hyperion Book CH",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "The Meanest Doll In The World",
        "Authors": "By Martin, Ann M., Selznick, Brian (ILT), and Godwin, Laura",
        "Description": "Annabelle Doll and Tiffany Funcraft are two dolls who have been best friends since they met in Kate Palmer's house at 26 Wetherby Lane. In this sequel to The Doll People, they hitch a ride in Kate's backpack and find themselves in the biggest adventure of their lives, a day at school! But when an attempt to return home lands them in the wrong house, they're in far deeper trouble than they imagined. Along with a host of new doll friends, they also encounter Mean Mimi, the wickedest doll of all. Mean Mimi is mean-really mean-and she's determined to rule all of Dollkind or else destroy it. Will the world ever be safe for dolls again? In this masterfully plotted sequel, Ann M. Martin and Laura Godwin, with the help of Brian Selznick's ingenious black-and-white illustrations, take the reader on another nonstop adventure from a doll's eye view!",
        "Category": " Juvenile Fiction , Toys, Dolls & Puppets",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Home Improvement 1-2-3: Expert Advice from the Home Depot",
        "Authors": "By Allen, Benjamin W. (EDT)",
        "Description": "Featuring more than two thousand full-color instructions, a comprehensive manual from the experts at Home Depot offers guidance on all aspects of home remodeling, decorating, and repair, outlining clear, step-by-step instructions for do-it-yourself projects. 200,000 first printing.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "7.67",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Classics of Western Literature: Bloom County 1986-1989",
        "Authors": "By Breathed, Berke",
        "Description": "Spanning the entire run of the comic strip--from 1986 to 1989--this retrospective anthology brings together the best story lines of \"Bloom County\"",
        "Category": " Humor , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    }
]