[
    {
        "Title": "The Maintenance Man",
        "Authors": "By Michael Baisden",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Home Therapy: Fast, Easy, Affordable Makeovers",
        "Authors": "By Ward, Lauri",
        "Description": "The ultimate \"before and after\" decorating book that shows how real people found the solutions to their decorating problems using the space they have, the things they like, and the budget they can afford.  The pioneer of home \"redecorating,\" Lauri Ward has been the \"home therapist\" to thousands, through the services of her company, Use-What-You-Have(r), Inc., and her popular books. For more than two decades, her revolutionary approach to home decorating, which focuses on identifying and solving the ten most common decorating problems-using what you have-has earned her a large and loyal following. Now, Home Therapy takes readers inside the homes-and lives-of twenty-five of Lauri Ward's clients, to reveal a wide range of decorating challenges, and the solutions that she was able to offer.  From the couple with a new baby, to the Baby Boomers looking to downsize, to the twentysomethings making their first home together, to the newly self-employed trying to carve out home-office space, Home Therapy guides readers step-by-step through the diagnosis and remedy for each situation.  Illustrated with more than 150 full-color before-and-after photos, plus detailed floor plans, Home Therapy is an inspiring and practical book for anyone who wants to create a home that is comfortable, personal, stylish, and affordable.",
        "Category": " House & Home , Decorating",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.04",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Mad Dash: A Novel",
        "Authors": "By Gaffney, Patricia",
        "Description": "The poor thing was cold and trembling, abandoned on their front doorstep. Dash, impulsive as always, decides on the spot that they should keep it. But her husband, Andrew, thinks it’s the craziest thing he’s ever heard. A fight over a scruffy little dog doesn’t seem like much of a reason to walk out on your husband of twenty years—but the spat over the puppy is just the last of many straws. Dash is so tired of the faculty parties at Mason-Dixon College that Andrew insists they attend even though he won’t mingle with his colleagues, tired of his constant fretting over illnesses he doesn’t have, tired of the glass of warm milk he must have every night before bed. Why can’t he see that with her mother gone and their daughter off at college, Dash needs something more? Now, living on her own for the first time in years, Dash can do whatever she wants . . . if only she could figure out what that is. But every time she starts making plans for the future, she finds herself thinking about the past—remembering the mother she’s lost, her daughter’s childhood, and the husband she isn’t entirely sure she wants to leave behind. . . .By turns poignant and hilarious—often on the same page—Mad Dash is a novel about the funny ways love has of catching up to us despite our most irrational efforts to leave it behind.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Wooden Fences",
        "Authors": "By Nash, George and Blair, James P. (PHT)",
        "Description": "An experienced carpenter and talented writer, Nash traces the evolution of the American wooden fence from Colonial times to the present. He discusses the various types of fences, and explains how to design a fence to meet every conceivable need - including how to be a good neighbor.Everything you need to know to build a fence is here, from laying out the fence to digging postholes, anchoring the posts, and installing gates and fence boards. There's even a trouble-shooting guide for maintenance and repair.",
        "Category": " House & Home , Outdoor & Recreational Areas",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Wordplay: The Official Companion Book",
        "Authors": "By Shortz, Will (FRW)",
        "Description": "Think Inside the Box!Solve Puzzles from the Hit Movie, Learn to Construct Your Own Crosswords, and Much More\"Irresistible...punsters, linguists, and crossword puzzle fanatics everywhere couldn't ask for a more bracing tribute.... Buoyant and exhilaratingly brainy.\" ---Variety on the movie WordplayAre you a crossword fan? Or have you always wondered about the appeal of these puzzles but never tried them yourself? With the premiere of Wordplay, a documentary about crossword puzzles, legendary New York Times puzzle editor Will Shortz, and the legions of solvers who devour his creations, here's your chance to become a part of the puzzle craze!• Featuring some of the greatest puzzles from The New York Times and the American Crossword Puzzle Tournament• With an introduction by Will Shortz; the story of how he created the famous \"Wordplay\" crossword from constructor Merl Reagle; the inside crossword dope from Jon Stewart, Ken Burns, and others; and the inside story of the movie's creation from producer Christine O'Malley and director Patrick Creadon• Learn how to create your own crossword; read what Bill Clinton and Bob Dole thought of the famous 1996 \"Election Day\" crossword; try the only New York Times crossword that can't be solved completely with a regular pen or pencil (hint: it features the Indigo Girls), and much more!\"Wordplay [has] potential to capture the commercial audience that made hits out of documentaries such as Spellbound and Mad Hot Ballroom.\"---Associated Press",
        "Category": " Games & Activities , Crosswords , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Rider at the Gate",
        "Authors": "By Cherryh, C. J.",
        "Description": "On the surface, it is a paradise of fertile farmland and towering, ore-rich mountains - but its pleasures lie beyond humanity's reach. For here all animals, from tiny wally-boos and willy-wisps to fierce predatory goblin cats, survive by telepathy, projecting images that drive humans mad.Grouped in cramped walled towns, most humans can only hide. Only the Riders, the handful chosen by the native Nighthorses, have any kind of protection. Attracted by the complexity of human thought, the most powerful Nighthorses enter the dreams of individuals, choosing their Riders, bonding them into a telepathic community. While townsfolk cower behind a religion based on fear and ignorance, Riders and their Nighthorses shield the infrastructure of human settlements, challenging the Wild.But Nighthorses are alien, not wise, and human emotions can be destructive, requiring stern discipline. Young Danny Fisher and his high-strung, obstinate horse Cloud are still learning control when Danny's hometown explodes with violence. A Rider and her mare are killed and the anguished emotions of the girl's lover, Guil Stuart, spread like a contagion to the horses. Chaos erupts and Guil is forced from the town at gunpoint.Wounded, without supplies or weapons, Guil and his sardonic, bacon-loving stallion, Burn, ride into howling winter blizzards, seeking the killer. Danny and the girl's furtive kinsmen search for Guil, unaware of the dark enemy who tracks them.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "The Mystery of the Star Ruby (89) (The Boxcar Children Mysteries)",
        "Authors": "By Warner, Gertrude Chandler",
        "Description": "The Alden children are visiting a gem mine that is holding its annual gem-hunting competition. It's not long before Jessie makes a fabulous find. But just when she's about to win the contest for finding the biggest ruby, her gem disappears!",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Albert Whitman & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Karen's Snow Day (Baby-Sitters Little Sister, No. 34)",
        "Authors": "By Martin, Ann M. and Tang, Susan (ILT)",
        "Description": "Karen has been eagerly awaiting a snow day for weeks, but when one finally comes, she is frustrated when she, Hannie, and Nancy must help her brothers shovel snow. Original.",
        "Category": "",
        "Publisher": "Little Apple",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "World of Robert Bateman",
        "Authors": "By Derry, Ramsey",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Putnam~childrens Hc",
        "Price Starting With ($)": "7.67",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Ivy Chronicles",
        "Authors": "By Quinn, Karen",
        "Description": "Losing her job at the same time her divorce goes through, Park Avenue resident Ivy Ames starts up a new business helping upscale New Yorkers earn entry for their kindergarteners into the city's most exclusive schools, a career that lands her several colorful clients. 75,000 first printing.",
        "Category": " Fiction , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Cat Who Dropped a Bombshell",
        "Authors": "By Braun, Lilian Jackson",
        "Description": "The residents of Pickax eagerly await the start of Pickax Now, a festival celebrating the 150th anniversary of the town's founding. In the midst of preparations for parades and performances, newspaper columnist James Qwilleran must make time to entertain Harvey Ledfield, an aspiring architect visiting from out of town.Qwill welcomes Harvey into his home to sketch, but strange occurrences seem to follow Harvey around. Why, for example, did the extraordinary Siamese Koko leap from the balcony onto Harvey's head while he was drawing Qwill's barn? And why have Harvey's aunt and uncle - residents of nearby Purple Point - not been seen in public since Harvey's arrival?Soon, Koko's strange behavior is not the only sign of trouble in Pickax. A knitter with psychic powers predicts murder, and a woman makes a weekend trip to Pickax from California to leave a message for Qwill. It's up to Koko to help Qwill piece the clues together.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Putnam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Beginner's Bible",
        "Authors": "By Davis, Deanna",
        "Description": "95 Timeless Children's Stories -- Including These: - A Big Picnic (Jesus Feeds the Five Thousand) - Long and Strong (Samson) - Best Friends (David and Jonathan) - Trumpets and Torches (Gideon) - The Most Special Baby (Jesus is Born) - Fish for Breakfast (With the Risen Jesus) - A Secret Message (Joseph and Pharaoh's Dreams) - A Basket Boat (The Baby Moses) - Wind and Fire (The Day of Pentecost) - Money in a Fish (Peter and the Taxes) - The Chariot of Fire (Elijah and Elisha) - Spending the Night with Lions (Daniel's Faithfulness) -  Lost! (Jesus in the Temple) - Helpers and Friends (Jesus Calls His Disciples) - Inside a Fish (Jonah) - A Room on the Roof (Elisha and the Shunemite Woman) - The Angel's Secret (Gabriel Visits Mary) - Surprise (The Resurrection)",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "Zonderkidz",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Better Homes and Gardens New Cook Book: Celebrating the Promise, 14th Limited Edition \"Pink Plaid\"",
        "Authors": "By Better Homes and Gardens Books (EDT)",
        "Description": "In addition to the inspiring Pink Section—the Promise for the Cure chapter—this limited edition contains the all-new complete Better Homes and Gardens New Cook Book 14th edition, with more than 1,400 mouthwatering recipes and 800 beautiful photos.Celebrity cookbook authors including Paula Deen, Sandra Lee, Lidia Bastianich, Sara Moulton, Pam Anderson, Joanne Weir, Nathalie Dupree, Mary Sue Milliken, and Susan Feniger share a recipe and some special words about this important cause.The Pink Section includes more than 70 delicious, all-new recipes that feature fresh foods associated with reducing the risk of cancer, plus nearly 60 color photos.Warm, witty inspiring quotes pepper these pink pages to reveal the strength and humanity of women across the nation.A unique section focusing on the benefits of a strong mind, body, and spirit connection.The mission of the Komen for the Cure is to eradicate breast cancer as a life-threatening disease through research, education, screening, and treatment. For more information, please contact the Komen for the Cure at 1.800.I'M AWARE® or www.komen.org",
        "Category": " Cooking , Methods , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "29.95",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Boundless Love",
        "Authors": "By Clairmont, Patsy, Walsh, Sheila, Johnson, Barbara, Clairmont, Patsy (EDT), Mullins, Traci (EDT), Swindoll, Luci, Meberg, Marilyn, and Wells, Thelma",
        "Description": "Our faith begins and ends with the love of God. In the face of life’s struggles, how deeply we need to trust in a love greater than ourselves—a love we can count on to hold us, to never let us go, and to instill in us a worth that our best efforts can never earn and our worst failings can’t diminish.That’s the love God has for you. It’s a love that delights in you, cherishes the simple things that give you joy, meets you in the sorrows no one else can touch, and whispers your name in unguarded, unexpected moments. No one else knows you like your heavenly Father, and no one else loves you as wisely, powerfully, and completely.With sensitivity and insight, Women of Faith authors share devotional reflections on the character of God’s heart. Distilled from the Bible’s timeless truths and the experiences of everyday life, these meditations are like precious notes from your Father revealing the nature of his love for you. It’s a love that is . . . Boundless—overflowing toward you with no danger of ever running out Fearless—unafraid of the worst in you, confident of the best in you Stubborn—refusing to ever give up on you Lavish—holding back nothing of its best treasures from you Outlandish—proving its character in wild, impossible ways Intentional—devoting its every act to your highest goodIn the words of Sheila Walsh, “Our prayer as we sat down to write this book to you was that you would know you are loved--boundlessly, fearlessly, stubbornly, lavishly, outlandishly, intentionally--by the God of the universe, the One who created you and calls you by name.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "The Blessing of a Husband's Love",
        "Authors": "By Et Al and Schaefer, Peggy",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Ideals Pubns",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Stone Fox",
        "Authors": "By Sewall, Marcia and Gardiner, John Reynolds",
        "Description": "John Reynolds Gardiner's classic action-packed adventure story about a thrilling dogsled race has captivated readers for more than thirty years.Based on a Rocky Mountain legend, Stone Fox tells the story of Little Willy, who lives with his grandfather in Wyoming. When Grandfather falls ill, he is no longer able to work the farm, which is in danger of foreclosure. Little Willy is determined to win the National Dogsled Race—the prize money would save the farm and his grandfather. But he isn't the only one who desperately wants to win. Willy and his brave dog Searchlight must face off against experienced racers, including a Native American man named Stone Fox, who has never lost a race. Exciting and heartwarming, this novel has sold millions of copies and was named a New York Times Outstanding Children's Book.",
        "Category": " Juvenile Fiction , Family , Multigenerational",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Vanishing Act: Mystery at the U.S. Open",
        "Authors": "By Feinstein, John",
        "Description": "Stevie Thomas and Susan Carol Anderson return in another fast-paced, action-packed sports mystery from bestselling sports writer John Feinstein.The two hopeful sports reporters have kept in touch after their wild time at the Final Four, and when Susan Carol manages to score a press pass to cover the first week of the US Open Tennis Tournament in New York, Stevie works out a way to be there as well.The behind-the-scenes action in the world of professional tennis is overwhelming and occasionally bewildering, but it turns downright inconceivable when a young Russian phenom, Natalia Makarova, disappears right before her second-round match. Somewhere between the locker rooms and the Louis Armstrong Court, one of the most-watched players of the tournament simply vanishes.The media coverage is staggering. Everyone is looking for Natalia--including Stevie and Susan Carol. Was she kidnapped? Did she run? Is she even still alive? The rumors are growing wilder by the hour. But they don't even come close to the shocking truth...",
        "Category": " Young Adult Fiction , Mysteries & Detective Stories",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Feng Shui: Harmonizing Your Inner & Outer Space",
        "Authors": "By Shen, Zaihong",
        "Description": "Offers suggestions and instructions on implementing feng shui principles into home and office interior and exterior design, explaining how such changes can help create prosperity and inner peace.",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "DK",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Pottery Barn Bathrooms (Pottery Barn Design Library)",
        "Authors": "By Ide, Clay, Nasatir, Judith, and Eisma, Hotze (PHT)",
        "Description": "Offering a room-by-room tour of well-designed bathrooms, this practical and inspirational guide explains how to create a stylish, comfortable, and efficient bathroom that will suit one's individual taste and and needs, and includes advice on selecting fittings, fixtures, color schemes, materials, and furnishings, all complemented by 250 original, full-color photographs.",
        "Category": " House & Home , Decorating",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "The Big Book of Brain Games: 1,000 PlayThinks of Art, Mathematics & Science",
        "Authors": "By Moscovich, Ivan",
        "Description": "About the original 1000 PlayThinks,Will Shortz of The New York Times said it best: “The most wide-ranging, visually appealing, entertaining, gigantic collection of brainteasers since Sam Loyd’s Cyclopedia of Puzzles almost a century ago.”  Inside The Big Book of Brain Games, you will find an obsessive collection of 1,000 challenges, puzzles, riddles, illusions—originals as well as must-do classics—it’s like salted peanuts for the brain. With jampacked pages and a full-color illustration for each entry, the book, opened anywhere, is a call to action. (And it’s guaranteed to make you smarter.) Twelve basic categories include Geometry, Patterns, Numbers, Logic and Probability, and Perception. An easy-to-read key at the top of each game ranks its difficulty on a scale of 1 to 10, while indices in the back cross-reference the puzzles. (You’ll find the answers back there, too.)",
        "Category": " Games & Activities , Puzzles",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "6.31",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Hundred-Dollar Baby (Spenser Mystery)",
        "Authors": "By Parker, Robert B.",
        "Description": "A client from a decades-old case reaches out to Boston PI Spenser-but can he rescue troubled April Kyle once more?  Longtime Spenser fans will remember that once upon a time, though not so long ago, there was a girl named April Kyle-a beautiful teenage runaway who turned to prostitution to escape her terrible family life. The book was 1982's Ceremony, and, thanks to Spenser, April escaped Boston's \"Combat Zone\" for the relative safety of a high-class New York City bordello. April resurfaced in Taming a Sea-Horse, again in dire need of Spenser's rescue-this time from the clutches of a controlling lover. But April Kyle's return in Hundred-Dollar Baby is nothing short of shocking.  When a mature, beautiful, and composed April strides into Spenser's office, the Boston PI barely hesitates before recognizing his once and future client. Now a well-established madam herself, April oversees an upscale call-girl operation in Boston's Back Bay. Still looking for Spenser's approval, it takes her a moment before she can ask him, again, for his assistance. Her business is a success; what's more, it's an all-female enterprise. Now that some men are trying to take it away from her, she needs Spenser.  April claims to be in the dark about who it is that's trying to shake her down, but with a bit of legwork and a bit more muscle, Spenser and Hawk find ties to organized crime and local kingpin Tony Marcus, as well as a scheme to franchise the operation across the country. As Spenser again plays the gallant knight, it becomes clear that April's not as innocent as she seems. In fact, she may be her own worst enemy.",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The Q Document: A Novel",
        "Authors": "By Roberts, James Hall",
        "Description": "",
        "Category": "",
        "Publisher": "William Morrow and Company",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "The wonder book of trees (Wonder books)",
        "Authors": "By Koehler, Cynthia Iliff",
        "Description": "",
        "Category": "",
        "Publisher": "Wonder Books",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "The Kingfisher Children's Bible: Stories from the Old and New Testaments",
        "Authors": "By Pilling, Ann and Denton, Kady MacDonald (ILT)",
        "Description": "Nearly 100 stories from the Old and New Testaments",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Kingfisher Books",
        "Price Starting With ($)": "5.72",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "North American Atlas for Teens",
        "Authors": "By AAA (EDT)",
        "Description": "This colorful atlas is chockablock full of useful information about the United States, Canada, Greenland, Mexico, Central America, and the Caribbean Islands. Developed with teachers and designed by teens, it has just the right mix of maps, photographs, history, and geography to satisfy curious minds about places near and far. Special features include country and state facts, cool trivia, and a list of must-see points of interest selected by AAA experts. The North American Atlas for Teens is a great reference tool for school projects or for planning the next family vacation.",
        "Category": " Reference , Atlases, Gazetteers & Maps",
        "Publisher": "AAA",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "Cookie Book",
        "Authors": "By Atkinson, Catherine",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House,",
        "Price Starting With ($)": "7.07",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Ideas for Great Kitchens",
        "Authors": "By Horn, Jane (EDT)",
        "Description": "Written for the do-it-yourselfer or the homeowner working with a contractor, this updated guide to creating the perfect kitchen provides a stunning photo gallery of kitchens of every style and size, with information on cabinets, new materials, appliances, flooring, and countertop options, and includes planning suggestions and tips on working with outside contractors. Original.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Solar Dwelling Design Concepts",
        "Authors": "By U.S. Dept. Of Housing and Urban Development",
        "Description": "",
        "Category": "",
        "Publisher": "U. S. Department of Housing and Urban Development",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "No-Bake Desserts (Easy Home Cooking)",
        "Authors": "By Publications International Ltd",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Celebrate With Cool Whip",
        "Authors": "By Louis Weber",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Honor's Quest&Honor's Disguise (2 in 1 Volume) (Rocky Mountain Legacy)",
        "Authors": "By Heitzmann, Kristen",
        "Description": "",
        "Category": "",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Five-minute Beautiful Nails",
        "Authors": "By Boden, Tanya",
        "Description": "A five-minute program designed to promote healthy, well-groomed hands explains how to incorporate a basic manicure and pedicure into a regular beauty routine and offers tips on massage, polish, and other nail-care techniques. 20,000 first printing.",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Kiana's Iditarod (Last Wilderness Adventure)",
        "Authors": "By Gill, Shelley and Cartwright, Shannon (ILT)",
        "Description": "Kiana, the lead dog on one of the sleds, takes part in the Iditarod Trail Sled Dog Race",
        "Category": " Juvenile Fiction , Animals , Dogs",
        "Publisher": "Sasquatch Books/Paws IV Children's Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Royal Caribbean International Cookbook",
        "Authors": "By Sodamin, Rudi",
        "Description": "Under the direction of internationally renowned chef Rudi Sodamin, the Royal Caribbean Cruise Line has become one of the top destinations not only for vacation cruises-but for eating, as well. The line has consistently been recognized for its high caliber and diverse cuisine. This book is a mouth-watering collection of Sodamin's best-loved meals, created from his own experience and interaction with the cruise lines' one hundred and forty-five worldwide destinations and fifteen ships kitchens that he oversees.",
        "Category": " Cooking , General",
        "Publisher": "Rizzoli",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Chicken Soup Teenage Soul Real Deal School (Chicken Soup for the Soul)",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), and Reber, Deborah (COM)",
        "Description": "School: It's frustrating, it's boring, it's embarrassing. But it's also thought provoking, challenging and full of possible friends. And until you turn 18, like it or not, it's just about your whole life. So wha's the deal? Chicken Soup for the Soul knows that school is more than classes and tests. It's also a social scene, filled with cliques, clubs and life-changing decisions (or so it seems this week). It's where you meet your best friends…and run into your worst enemies. And it’s an opportunity to figure out what you want to do—whether it's kick a soccer ball, play the trombone or act in a play.  Sometimes it's overwhelming and confusing, but don't worry, it's like that for everyone. That's what the stories in this book are all about. They’re from real teens, and they're about the bizarre, embarrassing and sometimes triumphant things that really happened to them. And they’re here to give you some perspective on everything that goes down at your school...and outside of it, too. Put that together with weird facts, cool graphics, fun advice and quizzes designed to help you figure out who you are and what you're up to, and you've got the real deal on school—full of all the laughter, tears and daily drama that life is all about.New cool format!More great stories!",
        "Category": " Young Adult Nonfiction , School & Education",
        "Publisher": "HCI",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "America's Hangar: Steven F. Udvar-Hazy Center (National Air and Space Museum)",
        "Authors": "By Smithsonian National Air and Space Museu",
        "Description": "",
        "Category": "",
        "Publisher": "Smithsonian Institution",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "ELMO'S LIFT&PEEK ARO",
        "Authors": "By Ross, Anna and Mathieu, Joe (ILT)",
        "Description": "A large-sized lift-the-flap book invites young readers to join in an exploration of a neighborhood that is just around the corner from Sesame Street, from the hilarious Furry Arms Hotel to the cluttered Finders Keepers shop.",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Kiss (Fearless #5)",
        "Authors": "By Pascal, Francine",
        "Description": "Disoriented and on the run after a Thanksgiving Day confrontation with Ella, Gaia turns, first to Mary, and ultimately to Sam for help",
        "Category": " Young Adult Fiction , Action & Adventure , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Trout Unlimited's Guide to America's 100 Best Trout Streams (Falcon Guide)",
        "Authors": "By Ross, John",
        "Description": "The rivers profiled in this book offer fishing opportunites for every kind of angler: bait casting, fly and spinning.",
        "Category": " Sports & Recreation , Fishing",
        "Publisher": "Falcon/Globe Pequot Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Investing Online For Dummies",
        "Authors": "By Sindell, Kathleen",
        "Description": "An indispenable asset for both novice and veteran e-investors.In this bestselling guide, investors at all levels of investing expertise will find* New information on traditional and online-only brokerages, transaction security, and international investing* The lastest online portfolio management features* A CD-ROM containing free and shareware for online investment news, financial analysis, plus management demonstration programs",
        "Category": " Computers , Internet , General",
        "Publisher": "IDG Books",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Fearless (#27)",
        "Authors": "By Pascal, Francine and Rost, J. R.",
        "Description": "#3: RUN   Sam is gone. No, not just gone. Someone's taken him. Kidnapped him to get to me. And i have only three hours to find him, or Sam is going to die. All because of me.  It all began in a funky brownstone on Perry Street where Gaia Moore lived with her foster family. But Gaia's little Village was brimming with people hell-bent on her own destruction, and her efforts to stay safe took her from parkside chess tournaments to greasy spoons, from the posh Upper East Side to scuzzy college dorm rooms. Along the way she managed to pick up a skate rat, a beauty queen, a hottie reformed school nerd, a recovered punk-rocker, and even a Soviet junior detective. None of whom turned out to be what he or she originally seemed....  Now, in one volume, keep pace with Gaia's latest adventures and revisit the origins of her unique story!   #27: SHOCK  When Sam disappeared, I thought the pain would kill me. Now that he's back, I'm thinking I had it wrong. The pain's not going to kill me. He is.",
        "Category": " Young Adult Fiction , Action & Adventure , General",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "The Art of Painting Cats; The Grumbacher Library",
        "Authors": "By Stirnweis, Shannon",
        "Description": "",
        "Category": "",
        "Publisher": "The Grumbacher Library",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The continuing Reformation",
        "Authors": "By Gritsch, Eric W.",
        "Description": "",
        "Category": "",
        "Publisher": "Lutheran Church Press",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Gone Fishin' With Kids: How to Take Your Kid Fishing and Still Be Friends",
        "Authors": "By Luftglass, Manny and Perrone, Joe",
        "Description": "",
        "Category": " Sports & Recreation , Fishing",
        "Publisher": "Gone Fishin' Enterprises",
        "Price Starting With ($)": "5.04",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Kids Will Be Kids, the Wisdom of Parents and Children",
        "Authors": "By sean-keogh",
        "Description": "",
        "Category": "",
        "Publisher": "Axis Publishing Limited",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Lawns, Grasses and Groundcovers (Rodale's Successful Organic Gardening)",
        "Authors": "By Hill, Lewis and Hill, Nancy",
        "Description": "A gardener's guide to creating a beautiful lawn with easy-care plants describes fifteen lawn grasses, thirty-nine ornamental grasses, and ninety-two ground covers in encyclopedic sections with color photographs and offers advice on providing areas for perennials, shrubs, and trees. Simultaneous.",
        "Category": " Gardening , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Sharks! (Time For Kids)",
        "Authors": "By Betz, Adrienne (EDT)",
        "Description": "Sharks swam in the sea long before dinosaurs roamed the earth. Today there are more than five hundred kinds of sharks in the world. They range in size from the tiny dwarf shark to the huge whale shark. Some of them have thousands of teeth. And some sharks even glow in the dark!In SHARKS!, TIME For Kids® takes you under the seas to discover the exciting world of these super fish.",
        "Category": " Juvenile Nonfiction , Science & Nature , Zoology",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Washington, City on the Potomac",
        "Authors": "By Russell Baker",
        "Description": "",
        "Category": "",
        "Publisher": "Arts, inc",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1958"
        }
    },
    {
        "Title": "Mr. Sammler's Planet",
        "Authors": "By Bellow, Saul",
        "Description": "",
        "Category": "",
        "Publisher": "The Viking Press",
        "Price Starting With ($)": "83.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "The Portrait of Zelide",
        "Authors": "By SCOTT, Geoffrey",
        "Description": "",
        "Category": "",
        "Publisher": "Charles Scribner s Sons",
        "Price Starting With ($)": "6.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1925"
        }
    },
    {
        "Title": "The Fairest of the Fall (Pictureback(R))",
        "Authors": "By Lagonegro, Melissa, RH Disney (COR), and Emslie, Peter (ILT)",
        "Description": "Join two beloved Disney Princesses as they delight in the joy and beauty of the fall season. Dance with Ariel at her very own fall festival and help Sleeping Beauty enjoy the changing leaves in two original stories.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Size Wise",
        "Authors": "By Sullivan, Judy",
        "Description": "You are who you are--why wait until you lose weight to lead a healthy, happy life? Medical studies show that dieting seldom leads to the desired result, no matter how hard you try. In fact, 90% of all people who attempt to lose weight are back where they started within five years. The good news is that there are more resources available for large men, women, and children than ever before.SIZE WISE offers more than 1,000 up-to-date listings on where to find  absolutely everything you want or need to enjoy life fully right now, including:where to find clothing, from uniforms to formal wear-up to size 2X, through custom and supersizeswhere and how to buy sturdy, attractive furnituresporting goods, fitness gear and instructional videoscar models and airlines with the best-and worst comfort featureshow to locate comfortable hotels, restaurants, and movie theatershow to deal effectively with insensitive healthcare providers, weight prejudice, and size-discriminationAnd much, much moreDon't wait for a miracle start living today!",
        "Category": " Self-help , Eating Disorders & Body Image",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "6.77",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Irresistible Forces: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "Danielle Steel's forty-seventh bestselling novel is very much about the tides of our times, changes and responsibilities in the workplace pull two people in different directions, sweeping them into new lives and changed worlds----.Irresistible ForcesFor fourteen years, Steve and Meredith Whitman have sustained a marriage of passion and friendship - despite the demands of two all-consuming careers.  Meredith, an investment banker, has achieved partnership in one of Wall Street's top firms.  Steve A gifted physician, chose an urban trauma ward over the big money he could have earned elsewhere.  The only thing missing in their lives is children.  Steve longs for them.  But Meredith keeps putting off motherhood, saying she isn't ready and doesn't have time.  Not yet.  Especially now that she has been offered an extraordinary opportunity, a chance to reach for the brass ring - in San Francisco, three thousand miles away.  Meredith is thrilled and surprised when Steve urges her to accept a top position at an exciting young high-tech company.  Traditionally, men's careers forces families to move to new cities, compelling their wives to abandon friends, home, and lives to follow.  But Steve is more than willing to uproot himself. Saying he'll join her as he can find a new job himself, they can begin their family at last.Neither Steve nor Meredith had reckoned on the frustrations of a bi-coastal marriage, as Steve's job keeps him in New York for months longer than planned.  Weekends together, their lifeline, fall prey to their hectic schedules.  Alone in San Francisco, Meredith is spending long hours at the office with her boss, charismatic entrepreneur Callan Dow.  Steve working late shifts at the hospital, grabbing an occasional dinner with a new colleague, a doctor raising a daughter on her own.  Almost unnoticed, Steve and Meredith have begun living separate lives in increasingly separate worlds.  And despite the best of intentions, irresistible forces begin to tear their lives and hearts apart.With unerring insight, Danielle Steel explores what happens when lives that fit together like delicately balanced puzzles are shifted, changed, and drift apart.  Only time can tell who and what they will become as life sweeps them onward and deposits them on new, sometimes frightening, and often exciting shores.  Who survives, is at the core of Irresistible Forces.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Encourage Me",
        "Authors": "By Swindoll, Charles R.",
        "Description": "",
        "Category": "",
        "Publisher": "Multnomah Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Grief Is Not Forever",
        "Authors": "By Krumroy, Jeri",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Christian Growth Publishers, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "To Venture Further",
        "Authors": "By Jones, Tristan",
        "Description": "Recounts the first known water crossing of Thailand's Kra Peninsula, by the one-legged Welsh author, a German, and three disabled Thais in a small boat, as a means of showing that disabled people can do what Chinese legend and modern explorers were never able to do before",
        "Category": " Travel , General",
        "Publisher": "Hearst Marine Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Organizing Your Life (2nd Edition)",
        "Authors": "By Lockwood, Georgene Muller",
        "Description": "You're no idiot, of course.  You fold your laundry and put each article of clothing where it belongs, stack dishes in your dishwasher so they won't clank together, and keep all of your bills in a drawer by the microwave.  But when it comes to finding your beloved blue shirt, your favorite cereal bowl, and your electric bill when you need them, you feel like it would be easier to organize a posse than organize your stuff.  Don't call the cavalry yet!  The Complete Idiot's Guide to Organizing Your Life, Second Edition helps you build the skills you need to hold everything together and stay in control of your life--even in the cyber-dominated 21st century.  In this completely revised and updated Complete Idiot's Guide, you get:",
        "Category": " Self-help , General",
        "Publisher": "Alpha Books; MacMillan",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Jonah and the Pirates Who (Usually) Don't Do Anything",
        "Authors": "By Kenney, Cindy, Vann, Robert (ILT), Metaxas, Eric, and Eddy, Ron (ILT)",
        "Description": "An epic tale told in a fresh, new way—from a completely different perspective. Whoever thought a group of cheese-curl-eating Pirates Who Don’t Do Anything would pay that much attention? The one time they decided to do something—just once—boy, were they in for a surprise. They actually saw a man get eaten by a fish and live to tell about it! This hilarious adaptation of the story of Jonah teaches kids about the values of compassion, mercy, and second chances. Filled with bright, colorful illustrations and VeggieTales fun, Jonah & the Pirates Who (Usually) Don’t Do Anything is a delight for kids ages 4 to 8.",
        "Category": " Juvenile Nonfiction , Religion , Christianity",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Dumper (Little Movers Board Book)",
        "Authors": "By Wells, Tony and Blanchard, Arlene",
        "Description": "A dump truck dumps a load of soil on a rocky vacant lot in order to make it into a park for the local children",
        "Category": "",
        "Publisher": "Warner Juvenile Books",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "The Genesis Factor: The Amazing Mysteries of the Bible Codes",
        "Authors": "By Rambsel, Yacov",
        "Description": "",
        "Category": "",
        "Publisher": "Lion's Head Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "The Yeast Connection Handbook: This Easy-To-Follow Guide Brings Readers the Latest Information About Yeast-Related Disorders and How to Overcome Them",
        "Authors": "By Crook, William G. and Crook, Cynthia (ILT)",
        "Description": "Millions of people of all ages and both sexes are troubled by yeast-connected disorders. Complaints range from fatigue, headache and depression in adults to ear problems, hyperactivity, attention deficits and autism in children.Many other chronic health problems are also related to the common yeast, Candida albicans. These include PMS, asthma, digestive and urinary problems, sexual dysfunction, psoriasis, multiple sclerosis, and muscle pain.",
        "Category": "",
        "Publisher": "Professional Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "How Does Aspirin Find a Headache?: An Imponderables Book",
        "Authors": "By Feldman, David and Schwan, Kassie (ILT)",
        "Description": "The author of Do Penguins Have Knees? answers such questions as What does Barney Rubble do for a living? Why doesn't glue get stuck in the bottle? and Why do pharmacists work on raised platforms? among others. 75,000 first printing. $75,000 first printing. Tour.",
        "Category": " Reference , Questions & Answers",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Close to Home: 52 Devotions to Build Character in Your Children",
        "Authors": "By Bruno, Bonnie",
        "Description": "",
        "Category": "",
        "Publisher": "Chariot Family Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Wings of Friendship: Selected Letters, 1944-2003",
        "Authors": "By Rorem, Ned",
        "Description": "Other than the publication of his correspondence between himself and Paul Bowles, Ned Rorem has never published the vast correspondence he shared with a sublime mix of people - Leontyne Price, Virgil Thomson, Reynolds Price, Angela Lansbury, Claus Von Bulow, Lou Harrison, Edward Albee, Judy Collins, Frank O'Hara, Alfred Kinsey, Gore Vidal, Cynthia Ozick, and many more. Anyone interested in the arts in America for the last half of the twentieth century will find much to enjoy in this book.Ned Rorem is one of America's greatest composers. In the literary community, Rorem is most famous for his diaries, five volumes of which have been published so far. These diaries combine deep honesty with the often contradictory testimony of everyday life.But if the diaries are documents of self-examination, his letters may be read as texts of self-invention, as he traces the long arc of his creative life by allowing us to join his friends on his daily journey.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Counterpoint",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Trusting God : Power to Overcome in a Hostile World",
        "Authors": "By Robertson, Pat",
        "Description": "",
        "Category": "",
        "Publisher": "Christian Broadcasting Network",
        "Price Starting With ($)": "6.1",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Cornerstones: Families By The Book (Living By The Book)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "CBN Publishing",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Childhood Medical Guide (SUCCESSFUL PARENTING)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "The Life and Times of Grigorii Rasputin (BCE)",
        "Authors": "By De Jonge, Alex",
        "Description": "This chronicle penetrates the legend of the mad monk to present a factual account of the peasant faith healer whose influence extended to the Russian throne",
        "Category": "",
        "Publisher": "Coward, McCann and Geoghegan",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "More Things to Do with Toddlers and Twos",
        "Authors": "By Miller, Karen",
        "Description": "",
        "Category": "",
        "Publisher": "Telshare Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "How to Be Like Jesus: Lessons for Following in His Footsteps",
        "Authors": "By Williams, Pat, Denney, James D., and Jenkins, Jerry B. (FRW)",
        "Description": "No one can be like Jesus yet we can all be like Jesus. In all of history there   has never been--and never will be--anyone like Him. In this extraordinary book, devout Christian and internationally acclaimed   speaker, author and sports executive Pat Williams reveals the pure essence of   Jesus. Although Christianity teaches that Jesus is God, most people lose sight   of His humanity. Through the gospels of Matthew, Mark, Luke and John, Williams   helps us understand who Jesus really was--His mind, His wisdom, His love, His   humility, His courage and His goodness. The story of Jesus' life is told powerfully   and dramatically and the meaning of his teachings is compellingly brought home   through contemporary stories of people who exemplify what it means to be like   Jesus. The Jesus of this book is truly the Jesus who lived and identified with us and with whom we also can identify. Williams provides persuasive and provocative insight on how to truly be like Jesus through His teachings and this living example of genuine love, forgiveness, prayer, obedience, service, humility, integrity, leadership, and more. This uncomplicated and fascinating work will enable readers to learn from Jesus'   life, understand his words and build his traits and character qualities into   their lives. The quintessential book on how to live a better life and create   a positive and lasting effect on the lives of others, How to be Like Jesus may   be the discovery of a lifetime.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Faith Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Hidden Leaves",
        "Authors": "By Andrews, V. C.",
        "Description": "The truth could not be revealed -- until now....  A fter the tragic death of her adoptive father, Willow De Beers receives an unexpected gift: a family diary that unlocks all the secrets of her world -- and shatters the life she's known in glitzy Palm Beach, Florida. At last, Willow learns the identity of her real father, and unearths his secret love affair with her real mother. She discovers the reasons for her adoptive mother's cruelty...and the truth about the mysterious woman who couldn't keep her, but would love her forever.  Look inside for the original e-book prequel Dark Seed -- first time in print! Also inside...a preview of the thrilling Broken Wings series -- coming soon from Pocket Star Books",
        "Category": " Fiction , Literary",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Dinner at the Homesick Restaurant: A Novel",
        "Authors": "By Tyler, Anne",
        "Description": "NEW YORK TIMES BESTSELLER “Funny, heart-hammering, wise…An extremely beautiful book.” —The New York Times“A Book that should join those few that every literate person will have to read.” —The Boston Globe Abandoned by her wanderlusting husband, stoic Pearl raised her three children on her own. Now grown, the siblings are inextricably linked by their memories—some painful--which hold them together despite their differences. Hardened by life’s disappointments, wealthy, charismatic Cody has turned cruel and envious. Thrice-married Jenny is errant and passionate. And Ezra, the flawed saint of the family, who stayed at home to look after his mother, runs a restaurant where he cooks what other people are homesick for, stubbornly yearning for the perfect family he never had. Now gathered during a time of loss, they will reluctantly unlock the shared secrets of their past and discover if what binds them together is stronger than what tears them apart.  Soulful and redemptive—full of heartbreak and hope—this portrait of a family will remind you why Anne Tyler is one of the most beloved writers working today. “[In Dinner at the Homesick Restaurant Tyler] has arrived at a new level of power.” —John Updike, The New Yorker “Marvelous, astringent, hilarious, [and] strewn with the banana peels of love.” —Cosmopolitan",
        "Category": " Fiction , Literary",
        "Publisher": "Knopf Doubleday Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Baby Honu Saves The Day",
        "Authors": "By Tammy Yee",
        "Description": "",
        "Category": "",
        "Publisher": "Island Heritage Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Harcourt School Publishers Trophies: Below Level Individual Reader Grade 1 I Have A Robot",
        "Authors": "By Hsp (COR)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "HARCOURT SCHOOL PUBLISHERS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Honeymoon With My Brother",
        "Authors": "By Wisner, Franz",
        "Description": "This is the true story of Franz Wisner, a man who thought he had it all- a high profile career and the fiancée of his dreams- when suddenly, his life turned upside down.  Just days before they were to be married, his fiancée called off the wedding.  Luckily, his large support network of family and friends wouldn't let him succumb to his misery.  They decided Franz should have a wedding and a honeymoon anyway- there just wouldn't be a bride at the ceremony, and Franz' travel companion would be his brother, Kurt.During the \"honeymoon,\" Franz reconnected with his brother and began to look at his life with newfound perspective.  The brothers decided to leave their old lives behind them.  They quit their jobs, sold all their possessions, and traveled around the world, visiting fifty-three countries for the next two years.  In Honeymoon With My Brother, Franz recounts this remarkable journey, during which he turned his heartbreak into an opportunity to learn about himself, the world, and the brother he hardly knew.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "From Fear to Faith",
        "Authors": "By Carothers, Merlin",
        "Description": "From the author of the international bestseller 'Prison to Praise' comes this life changing powerful work on faith.  Choosing faith over fear can help you overcome feelings of inferiority, conquer bitterness and anger, build stronger personal relationships, and create a climate for experiencing success in life.  As you experience release from fear, you will have a new excitement over the endless achievements you can enjoy.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Playing Ball on Running Water: The Japanese Way to Building a Better Life",
        "Authors": "By Reynolds, David K.",
        "Description": "Suggests a Zen-influenced technique for reducing self-doubt, overcoming procrastination, and encouraging personal growth through a new aesthetic appreciation of life",
        "Category": " Psychology , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "Sarah's Incredible Idea (Here Come the Brownies)",
        "Authors": "By O'Connor, Jane and Long, Laurie Struck (ILT)",
        "Description": "Shy Sarah has a great idea for her Brownie Girl Scout troop but is not sure she is brave enough to speak up",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Oliver Twist (A Stepping Stone Book Classic)",
        "Authors": "By Dickens, Charles, Martin, Les, and Zallinger, Jean Day (ILT)",
        "Description": "<p align=\"left\">Oliver Twist is a desperate orphan. A gang of thieves takes him in and teaches him  to steal, but then he is caught. What will become of poor Oliver Twist? Kids can  find out in this easy-to-read chapter book adaptation of the Dickens classic.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "The Moor's Last Sigh",
        "Authors": "By Rushdie, Salman",
        "Description": "Time Magazine's Best Book of the YearBooker Prize-winning author Salman Rushdie combines a ferociously witty family saga with a surreally imagined and sometimes blasphemous chronicle of modern India and flavors the mixture with peppery soliloquies on art, ethnicity, religious fanaticism, and the terrifying power of love. Moraes \"Moor\" Zogoiby, the last surviving scion of a dynasty of Cochinese spice merchants and crime lords, is also a compulsive storyteller and an exile. As he travels a route that takes him from India to Spain, he leaves behind a tale of mad passions and volcanic family hatreds, of titanic matriarchs and their mesmerized offspring, of premature deaths and curses that strike beyond the grave.",
        "Category": " Fiction , Literary",
        "Publisher": "Knopf Doubleday Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Harcourt School Publishers Trophies: Below Level Individual Reader Grade 1 Apples",
        "Authors": "By Hsp (COR)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "HARCOURT SCHOOL PUBLISHERS",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Residential Carpentry",
        "Authors": "By Capotosto, John",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.97",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "Hardwood Floors: Laying, Sanding, and Finishing",
        "Authors": "By Bollinger, Don",
        "Description": "Using crisp photos and drawings, Bollinger goes step by step through the process. You will learn how to estimate materials, select the right kind of wood, prepare the subfloor and achieve a blemish-free finish for an old or new floor. Bollinger also provides numerous tips and tricks, and sources of supply. The book is indexed for easy reference.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Easy Car Care (Chilton Easy Car Care)",
        "Authors": "By The Chilton Editors",
        "Description": "Perfect for the novice mechanic, this manual covers basic, easy-to-do maintenance. Over 30 sections cover every operating system of the car and light truck, as well as information on major new technological changes in today's vehicles.",
        "Category": " Transportation , Automotive , Repair & Maintenance",
        "Publisher": "Haynes,Chilton",
        "Price Starting With ($)": "25.04",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Teaching Phonics Today: A Primer for Educators",
        "Authors": "By Strickland, Dorothy S.",
        "Description": "",
        "Category": " Language Arts & Disciplines , Linguistics , Phonetics & Phonology",
        "Publisher": "Intl Literacy Assn",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Exclusively Washington Trivia",
        "Authors": "By Pitch, Anthony S.",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Mino Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "Favorite Psalms for Children",
        "Authors": "By Stern, Marie (illustrator)",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset and Dunlap",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1942"
        }
    },
    {
        "Title": "Questions Christians Ask",
        "Authors": "By Swindoll, Charles R.",
        "Description": "",
        "Category": "",
        "Publisher": "W Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Five Little Monkeys Sitting in a Tree",
        "Authors": "By Christelow, Eileen and Christelow, Eileen (ILT)",
        "Description": "Drawn from the delightful rhyme, five mischievous little monkeys sitting in a tree discover, one by one, that it is unwise to tease Mr. Crocodile, in an adorable counting book that introduces the youngest of readers to numbers one through five. Reprint.",
        "Category": " Juvenile Fiction , Animals , Apes, Monkeys, etc.",
        "Publisher": "Harcourt Childrens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The Worn Out Woman: When Life is Full and Your Spirit is Empty",
        "Authors": "By Gray, Alice and Stephens, Steve",
        "Description": "For the growing number of women who want to drop out because they are stressed out, this easy read provides practical solutions. Women can immediately apply these tools and strategies for limiting commitments, identifying gifts, dealing with emotions, nurturing the spirit, burying anxieties, facing the past, celebrating accomplishments, developing a support network, and protecting dreams. The Worn-Out Woman will help the reader trade in a life of running on empty for a life that is meaningful and fulfilling. She will find and recapture her passion, finally realizing the great potential God gave her.You’ve come a long way...maybe.  “Most days I feel overwhelmed.”  “I want to run away and start over.”  “The joy and excitement are gone.”  There are more than 60 million worn-out women in the U.S. today. If you’re among them, this book will be like a retreat for your soul.  One short chapter at a time, you’ll find simple steps to bring back the joy and energy of a rich life. What’s more, you’ll finally understand and learn to manage the sources of your exhaustion—perfectionism, guilt, unrealistic expectations, and difficult people—in a healthy way.  Story Behind the BookWe have written this book because it will provide the worn out women of today’s society with practical solutions to those who want to drop out because they are stressed out. Although some of you will look for quick checklists… wanting to jump to the “just let me unclutter my life” sections… we know the value of uncluttering you heart first. For that reason, we’ve included chapters for all areas of your life—emotional, mental, social, physical and spiritual. Most other books focus on learning to say no, simplifying your lifestyle, organization, and nurturing your spirit. Our book is unique because it includes all of these but also covers solutions for the root causes of why women do too much.",
        "Category": " Religion , Christian Living , Women's Interests",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Pick of the Litter",
        "Authors": "By Wallace, Bill",
        "Description": "Tom's grandfather is recovering from heart surgery, so during summer vacation Tom is helping him with his hunting dog business. It's hard work, but Tom doesn't mind so much after he falls in love with one of the pups, a rare blue-eyed pointer Tom names Tad. It's almost as if Tad understands when Tom talks to him, especially about confusing things like how hard it is to write to Angie, a girl Tom met on vacation.   The trouble is, Grandpa promised the owner of the pup's sire the pick of the litter, and it's pretty clear that's Tad. Tom knows what he should do, but he can't help hoping there's a way to get around Grandpa's promise. How can he do the honorable thing when it will cost him what he wants most in the world?",
        "Category": " Juvenile Fiction , Social Themes , Values & Virtues",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Fred Jones Tools for Teaching",
        "Authors": "By Jones, Fredric H.",
        "Description": "",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Fredric H. Jones & Associates",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Chesi's Story: One Boy's Long Journey from War to Peace",
        "Authors": "By White, Link S.",
        "Description": "",
        "Category": "",
        "Publisher": "Father & Son Pub",
        "Price Starting With ($)": "8.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Henry Miller (Literature and Life)",
        "Authors": "By Brown, J. D. and Brown, John O.",
        "Description": "Traces Miller's life and career, examines his major and most controversial writings, and assesses his place in American literature",
        "Category": " Literary Criticism , General",
        "Publisher": "Ungar Pub Co",
        "Price Starting With ($)": "14.9",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "Fair Trade for All: How Trade Can Promote Development (Initiative for Policy Dialogue Series C)",
        "Authors": "By Stiglitz, Joseph E. and Charlton, Andrew",
        "Description": "Winner of the Nobel Prize in Economics and author of the New York Times bestselling book Globalization and Its Discontents, Joseph E. Stiglitz here joins with fellow economist Andrew Charlton to offer a challenging and controversial argument about how globalization can actually help Third World countries to develop and prosper.In Fair Trade For All, Stiglitz and Charlton address one of the key issues facing world leaders today--how can the poorer countries of the world be helped to help themselves through freer, fairer trade? To answer this question, the authors put forward a radical and realistic new model for managing trading relationships between the richest and the poorest countries. Their approach is designed to open up markets in the interests of all nations and not just the most powerful economies, to ensure that trade promotes development, and to minimize the costs of adjustments. The book illuminates the reforms and principles upon which a successful settlement must be based.Vividly written, highly topical, and packed with insightful analyses, Fair Trade For All offers a radical new solution to the problems of world trade. It is a must read for anyone interested in globalization and development in the Third World.",
        "Category": " Political Science , International Relations , Trade & Tariffs",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.55",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Elmo Gets Homesick",
        "Authors": "By Tish Sommers Rabe, Illustrated by Tom Br",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "A Million Fish...More or Less",
        "Authors": "By McKissack, Pat and Schutzer, Dena (ILT)",
        "Description": "Newbery honor author Patricia C. McKissack’s original yarn of the Louisiana bayou is \"told with verve and sly wit.\" (Publishers Weekly, Starred review)   Hugh Thomas knows that the Bayou Clapateaux is a mighty peculiar place. Why, back in 1903, Papa-Daddy and Elder Abbajon caught a turkey that weighed 500 pounds…more or less. 500 pounds?! Hugh Thomas isn’t so sure about that, until he’s left alone on the bayou with only his fishing pole for company. Soon he catches three fish, and then…a million more! But after meeting up with raccoon bandits, thieving crows, and a hungry cat named Chantilly, Hugh Thomas returns home with just enough fish for breakfast…and a fantastic story, of course!",
        "Category": " Juvenile Fiction , People & Places , United States , African American",
        "Publisher": "Dragonfly Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "The Nutcracker (Picture Tales)",
        "Authors": "By Graham Percy, Rh Value Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "7.88",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Handbook of Disruptive Behavior Disorders",
        "Authors": "By Quay, Herbert C. (EDT) and Hogan, Anne E. (EDT)",
        "Description": "Synthesizes the current understanding of the group of disorders currently labeled DSM-IV, and which comprise at least three quarters of all the psychopathological disorders of childhood and adolescence: the three types of attention-deficit/hyperactivity, the two types of conduct disorder, and oppositional defiant disorder. Reviews classification, epidemiology, and assessment; deals with each of the specific types; and discusses special problems and issues, including mentally retarded patients, ethical and legal issues in research, gender and ethnicity, and research problems. Researchers, clinicians, teachers, and students in all the mental health fields may find useful information. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Medical , Psychiatry , Child & Adolescent",
        "Publisher": "Springer",
        "Price Starting With ($)": "6.81",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Wild Iris Bloom",
        "Authors": "By Jukes, Mavis",
        "Description": "Independent-minded and angry at being left at home while her parents travel on business, twelve-year-old Iris gives her babysitter the slip; but a disturbing incident makes her realize that she does need her family and friends",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "6.69",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    }
]