[
    {
        "Title": "Mosaicos: Spanish as a World Language (2nd Edition)",
        "Authors": "By Guzman, Elizabeth, Garcia, Carmen Torres, Castells, Matilde Olivella De, and Rush, Patricia",
        "Description": "The 5th edition of Mosaicos: Spanish as a World Languageprovides a fresh, 2lst-century perspective on language teaching and learning in the context of a dynamic introduction to the Hispanic world and its people. Rich contextualization of vocabulary combined with contextualized, functional grammatical instruction gives students an authentic, communicative introduction to the Spanish language. Deeply integrated culture and detailed listening, speaking, reading and writing practice bring all the pieces together for today’s students.",
        "Category": " Foreign Language Study , Spanish",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Super Handyman's Encyclopedia of Home Repair Hints",
        "Authors": "By Carrell, Al",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Sociology",
        "Authors": "By Macionis, John J.",
        "Description": "An introductory text covering the foundations of sociology and research strategies, the ideas of key thinkers such as Karl Marx and Max Weber, social inequality and stratification, institutions, and global social change.  Features color photos, topic boxes, chapter-opening vignettes, sociological maps, questions, and summaries. This fifth edition includes new US maps, a chapter on the natural environment, and expanded discussion on topics such as suicide, Asian Americans, and feminist research methods. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "7.86",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Forces of Change: A New View of Nature",
        "Authors": "By Botkin, Daniel B. (EDT)",
        "Description": "Forces of Change takes readers on an unforgettable tour of truly global proportions. In this single volume, more than 20 of the world's most innovative and visionary scientists, writers, and scholars -- including Stephen Jay Gould, John McPhee, Lynn Margulis, Daniel Botkin, and David Quammen -- illuminate the forces that define and continue to profoundly transform our planet and all of its inhabitants. Taken together, these essays represent a dramatic range of new views and understandings about nature that have emerged over the last century. Developed by the Smithsonian Institution and the National Geographic Society, Forces of Change brings together for the first time the matchless resources of two world-renowned institutions in order to present a bold new vision of the world, which stresses the diversity, interrelatedness, and interdependence of all natural phenomena. In this vision the Earth can be viewed as a grand network of life-supporting forces operating within a single dynamic system.  Powerfully punctuated by epic photographs, eloquent illustrations, and a wonderfully dynamic design, Forces of Change is at once highly accessible and deeply thought-provoking. Full of sidebars that lucidly unpack the latest field research, the essays take readers around the world -- from the peaks of the Himalaya to the mysterious depths of the sea, and from the Ladakh cultures of northern India to the A'ani and Assiniboine tribes of Montana.  Published in conjunction with a new permanent exhibit program at the Smithsonian's National Museum of Natural History, Forces of Change is a timely and vitally important consideration of science and fate at the dawn of the 21st century.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Snow Lion",
        "Authors": "By McPhail, David",
        "Description": "Bothered by the heat, Lion journeys to the cool hills where he discovers snow, but when he decides to share some with his jungle friends, he learns a basic science lesson",
        "Category": "",
        "Publisher": "Parents Magazine Press",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "Where's Spot?",
        "Authors": "By Hill, Eric",
        "Description": "For more than three decades, children have been looking everywhere for Spot in this classic, first-ever lift-the-flap book. Is he in the piano? Is he under the stairs? After finding other familiar animals, there he is in his basket!",
        "Category": " Juvenile Fiction , Interactive Adventures",
        "Publisher": "Warne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1980"
        }
    },
    {
        "Title": "Murder at Midnight: An Eleanor Roosevelt Mystery",
        "Authors": "By Roosevelt, Elliott",
        "Description": "Fresh from an eventful vacation in a French chateau, the First Lady of Mystery is back on familiar ground, investigating murder and mayhem in Washington, D.C. The trouble begins when wealthy Judge Horace Blackwell is found murdered in his White House suite. The obvious suspect is black housekeeper Sara Carter - yet the young woman swears she is innocent. After police officials carry Sara off to jail, the ever-conscientious Eleanor is determined to seek justice. But can she catch the real killer without becoming a victim herself?As Eleanor crosses paths with everyone from William Faulkner to General Douglas MacArthur, readers will travel along a nostalgic timeline through our nation's history.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "The Ghost from the Grand Banks",
        "Authors": "By Clarke, Arthur C.",
        "Description": "In 2007, just five years before the centennial of the sinking of the \"Titanic,\" two corporations--one English, one Japanese--each using futuristic technology, contend with each other over the ship's retrieval",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Consequences: A Personal and Political Memoir",
        "Authors": "By Tower, John G.",
        "Description": "A controversial politician reminisces about his twenty-five year senatorial career and offers an account of his failed nomination in 1989 for Secretary of Defense",
        "Category": " Political Science , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "26.96",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Don't Count Yourself Out: Staying Fit After 35",
        "Authors": "By Gordon, Neil and Connors, Jimmy",
        "Description": "Over the years, Jimmy Connors has come to symbolize the indomitable spirit of the world-class athlete. Now forty years old, Connors continues to compete with players half his age in tournaments around the world and attributes his extraordinary endurance to his personal fitness program. Here, Jimmy Connors shares the program he and Neil Gordon, M.D., of the Kenneth Cooper Aerobics Center developed to keep him at the top of the tennis world.The Connors program is designed for people who have never exercised as well as for those who already have reached an advanced level of fitness. Unique in its sensible approach to exercise, here is a program that encourages you to create your own regimen to achieve your personal fitness or health goals. While you follow his program, Jimmy will help you stay on course by sharing the motivational techniques he uses to stay pumped up.One of the first things you'll learn is that it's not what you do - but how you do it; keeping track of how hard the exercise feels is key to getting the most benefit from it. At an early age, Jimmy learned to listen to his body, or, as Neil Gordon explains in more scientific terms, to monitor his perceived level of exertion. Now you'll find out why it's not beneficial to exercise too intensely, how to rate your perceived exertion, and what your target level should be.Two sixteen-week programs - one for the novice, one for the more advanced - offer a wide spectrum of activities that include aerobic, weight-resistance training, and stretching exercises. Each activity earns you a certain number of points determined by the number of calories burned. Comprehensive charts are provided of nearly a hundred different activities with their rating equivalencies. You'll learn how to use the Connors Count as your scorekeeper. Once you've embarked on the program of your choice, you'll find yourself echoing Jimmy's own proclamation, \"I may be forty, but I don't know when, if ever, I've felt more alive or more in control of my life.\"",
        "Category": " Medical , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Ultimate Cat Book: Lemmer's Fantastic Folio of Feline Funnies",
        "Authors": "By Lemmer, Bill",
        "Description": "",
        "Category": "",
        "Publisher": "Heavy Bro Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Chocolate Box",
        "Authors": "By Farrow, Joanna",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Chocolate",
        "Publisher": "Rizzoli",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Steve Mizerak's Pocket Billards",
        "Authors": "By Cohen, Joel H and Mizerak, Steve",
        "Description": "A guide for novice players or experts looking to brush up their skills presents tips on techniques, feature shots, practice drills, competing, equipment, and a special section on performing harmless hustles and avoiding hustlers.",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "War, Peace and Victory: Strategy and Statecraft for the Next Century",
        "Authors": "By Gray, Colin S.",
        "Description": "Shows how geography, technology, history and national culture shape government policy, and explains how nations pursue their strategic interests in peacetime",
        "Category": " Political Science , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Great Women Writers: The Lives and Works of 135 of the World's Most Important Women Writers, from Antiquity to the Present (A Henry Holt Reference B)",
        "Authors": "By Magill, Frank Northen (EDT)",
        "Description": "A single-volume reference guide providing a survey of female authors of poetry, drama, novels, and short stories. The entries, arranged alphabetically, include a list of works, biographical sketch, a critical analysis discussing the author's influences and obstacles, and a bibliography. A diverse cross section of writers from around the world is represented, including Jane Austen, Joan Didion, Toni Morrison, Christine de Pisan, Selma Lagerl÷f; and Anne Radcliffe. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "7.13",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Show and Tell Machine: How American Television Works and Works You over",
        "Authors": "By Goldsen, Rose Kohn",
        "Description": "A critical investigation of television programming and advertising, citing specific examples of the medium's stultifying effects on our intellectual capacities and cultural environment",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "November",
            "Year": "1977"
        }
    },
    {
        "Title": "Do You Remember TV?: The Book That Takes You Back",
        "Authors": "By Gitter, Michael, Anapol, Sylvie, and Glazer, Erika",
        "Description": "You will never forget the Brady Bunch double episode in Hawaii. But do you remember Dawn: Portrait of a Teenage Runaway? Can you recite the Oscar Mayer Wiener jingle or win at Name That Tune? Have you seen every Love Boat episode with Charo in it? Take a Technicolor journey back to the days when cable and satellite were science fiction and the boob tube had three channels that signed off at 1:00 am to the national anthem. Do You Remember TV? resuscitates the most vivid moments of our couch-potato youth with 144 pages crammed full of television tidbits from the late '50s, '60s, '70s, and early '80s. From Good morning, angels to Good night, John Boy, from the Oscar Night streaker to Oo! Oo! Mr. Kotter! this tiny tribute to the great days of TV brings back the favorite moments that are forever lodged in our collective TV unconscious.",
        "Category": " Performing Arts , Television , History & Criticism",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Hammerfall (The Gene Wars)",
        "Authors": "By Cherryh, C. J.",
        "Description": "One of the most renowned figures in science fiction, C. J. Cherryh has been enthralling audiences for nearly thirty years with rich and complex novels. Now at the peak of her career, this three-time Hugo Award Winner launches her most ambitious work in decades, Hammerfall, part of a far-ranging series, The Gene Wars, set in an entirely new universe scarred by the most vicious of future weaponry, nanotechnology. In this brilliant novel -- possibly Cherryh's masterwork -- the fate of billions has come down to a confrontation between two profoundly alien cultures on a single desert planet.\"The mad shall be searched out and given to the Ila's messengers. No man shall conceal madness in his wife, or his son, or his daughter, or his father. Every one must be delivered up.\"-- The Book of the Ila's Au'itMarak has suffered the madness his entire life. He is a prince and warrior, strong and shrewd and expert in the ways of the desert covering his planet. In the service of his father, he has dedicated his life to overthrowing the Ila, the mysterious eternal dictator of his world. For years he has successfully hidden the visions that plague him -- voices pulling him eastward, calling Marak, Marak, Marak, amid mind-twisting visions of a silver tower. But when his secret is discovered, Marak is betrayed by his own father and forced to march in an endless caravan with the rest of his world's madmen to the Ila's city of Oburan.Instead of death, Marak finds in Oburan his destiny, and the promise of life -- if he can survive what is surely a suicidal mission. The Ila wants him to discover the source of the voices and visions that afflict the mad. Despite the dangers of the hostile desert, tensions within the caravan, and his own excruciating doubts, Marak miraculously reaches his goal -- only to be given another, even more impossible mission by the strange people in the towers.According to these beings who look like him yet act differently than anyone he has ever known, Marak has a slim chance to save his world's people from the wrath of the Ilas enemies. But to do so, he must convince them all -- warring tribes, villagers, priests, young and old, as well as the Ila herself -- to follow him on an epic trek across the burning desert before the hammer of the Ila's foes falls from the heavens above.Written with deceptive simplicity and lyricism, this riveting, fast-paced epic of war, love, and survival in a brave new world marks a major achievement from the masterful C.J. Cherryh.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Harper Voyager",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Chilton's Auto Repair Manual 1982",
        "Authors": "By Chilton Automotive Editorial Staff (Editor)",
        "Description": "",
        "Category": "",
        "Publisher": "Chilton Book Company",
        "Price Starting With ($)": "9.08",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Country Fabric Scrap Crafts",
        "Authors": "By Michell, Marti",
        "Description": "Provides patterns and instructions for making pillows, ornaments, dolls, decorations, and holiday gifts using patchwork, trapunto, applique, and other fabric craft techniques",
        "Category": " Art , General",
        "Publisher": "Sedgewood Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "More Prime Time Activities With Kids",
        "Authors": "By Erickson, Donna",
        "Description": "Offers new ideas for craft, holiday, and cooking projects that parents and children can do together",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Augsburg Fortress Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "The Experiment",
        "Authors": "By Darnton, John",
        "Description": "New York, at century's end: A mutilated body has been found, its face and fingerprints removed, a coin-sized circle carved into its upper thigh. On a remote island off the Southeast coast, a young man is running from a place he cannot survive, toward a world he cannot comprehend. And in the echoing canyons of Manhattan, another young man - a journalist - is moving closer to the truth about his own past, and to an encounter that will alter everything he has ever believed about himself.For thirty years a colony with its own laws, values, and complex living systems has been growing. Covertly supplied with the latest technology and DNA materials, its leaders carefully monitor their human trials and conceal the inhabitants from the outside world. Now someone has escaped. When Jude finds him cowering in the shadows of his apartment hallway, he will understand why this ragged stranger who calls himself Skyler is so frightened.They share the same face.Now Jude and Skyler are running together - bound by a new, secret science - hunted by unknown pursuers as they search for the mystery of their birth.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Dutton : Penguin Group",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Pasta (Sunset Creative Cooking Library)",
        "Authors": "By Sunset Books",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Pasta",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "The Fit Body: Building Endurance (Time Life Series)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "Suspicion of Vengeance",
        "Authors": "By Parker, Barbara",
        "Description": "Twelve years ago, in the quiet coastal town of Stuart, Florida, a beautiful young wife and mother was savagely murdered, stabbed twenty-seven times in her own bed one sunny morning. Kenny Ray Clark, a local troublemaker with a felony record, was quickly arrested, tried, found guilty, and sentenced to death. When new evidence comes to light, Miami attorney Gail Connor agrees to take the case, although her fiance, Anthony Quintana, a top criminal defense lawyer, warns her not to get involved. But one look at the trial transcript convinces Gail that her client was wrongfully convicted, and she will do everything in her power to stop the execution. Gail turns to her cousin Jackie Bryce, a rookie cop with the Stuart Police Department, to help her navigate the local terrain. Jackie is smart enough to know that the conviction stinks, and idealistic enough to care - even if it means crossing her own father, the county sheriff; and even if it brings her closer to discovering the awful truth about her parents' marriage and her mother's tragic end. In a desperate race against time, Gail must overcome her pride to ask Anthony for help. Together, they push themselves and the law to the breaking point to find the real killer. But nothing can prepare them for the layers of greed, deception, and cruelty that lay hidden for so many years behind a brutal crime. And nothing can prevent them from becoming the targets of a terrible vengeance.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Dutton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Do It in the Dark (How-To-Do-It Books)",
        "Authors": "By Burk, Tom",
        "Description": "",
        "Category": "",
        "Publisher": "HPBooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1979"
        }
    },
    {
        "Title": "Remembering Sinatra: A Life in Pictures",
        "Authors": "By Sullivan, Robert",
        "Description": "A collection of photographs culled from the pages of Life magazine provides a glimpse into the life of Frank Sinatra",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Ambush (White Indian)",
        "Authors": "By Porter, Donald Clayton",
        "Description": "Ghonkaba, grandson of Renno, the white man raised as a Seneca, is furious when he learns that Beth Strong has turned down his marriage proposal for a British officer",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Erotic Interludes: Tales told by women",
        "Authors": "By Lonnie Garfield Barbach",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Mr. Gumpy's Outing",
        "Authors": "By Burningham, John",
        "Description": "Mr. Gumpy's Outing is a Boston Globe-Horn Book Award winner and an American Library Association Notable Children's Book. In England, illustrator John Burningham, with Mr. Gumpy's Outing, became the first artist ever to win England's Kate Greenaway Medal twice. Mr. Gumpy lives by a river. One sunny day he decides to take a ride in his small boat.It is such a perfect idea, for such a perfect summer day, that he soon has company: first the children, then the rabbit, the cat, the dog, the pig, the sheep, the chickens, and still others until-- Mr. Gumpy's outing comes to an inevitable but not unhappy, conclusion.\"Come for a ride another day,\" says Mr. Gumpy at the book's end. And young readers will return again and again to this sprightly story with its clever, captivating illustrations that reflect the sunlit quality of a lazy summer afternoon.An ALA Notable Children's BookA New York Times Book Review Best Illustrated Children's BookA Child Study Association Children's Book of the YearA Library of Congress Children's Book of the Year",
        "Category": " Juvenile Fiction , Social Themes , Manners & Etiquette",
        "Publisher": "Square Fish",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Chinese Vegetarian Cooking",
        "Authors": "By Lo, Kenneth H. C.",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , Chinese",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1974"
        }
    },
    {
        "Title": "More Joy of Photography",
        "Authors": "By Kodak",
        "Description": "",
        "Category": "",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Scarlet Women",
        "Authors": "By Christilian, J. D.",
        "Description": "In the tradition of Rebecca and the more recent The Alienist, Scarlet Women evokes the raffish depths beneath the prim Victorian facade of New York City in the 1870's, generating a powerful story of delicious sin and corruption and sudden death, told with impeccable authenticity of place and personage and ambience.Here are assorted rogues, ladies of convenience, a double-murder featuring a private investigator named Harp, himself on close terms with the likes of Jim Fisk, Jay Gould and Emma Wells, proprietress of a preeminent \"parlor house.\" Also on hand, and functional to the narrative, are such historical characters as the feminist Victoria Woodhall (\"I have an inalienable, constitutional and natural right to love whom I may\"), as well as her sister Tennessee (Tennie), a practitioner in spiritualism.Taken together, here is an assortment of late nineteenth century American guys and dolls who evoke a life at once entrancing and dangerous. They will not soon be forgotten.",
        "Category": "",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "DAY OF LIFE V216 (Aventura : the Vintage library of contemporary world literature)",
        "Authors": "By Argueta, Manlio",
        "Description": "The women of the Guardado family of peasants in El Salvador become caught up in the country's political turmoil",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Majoring in the Rest of Your Life: Career Secrets for College Students",
        "Authors": "By Carter, Carol",
        "Description": "Majoring in the Rest of Your Life is a practical strategy to get you from your first semester freshman year to your first job. Courses are not the only place to learn in college, and Majoring in the Rest of Your Life shows you how to make the most of your opportunities to discover what you enjoy doing, get practical experience, and meet people.",
        "Category": "",
        "Publisher": "Noonday Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "The Killing Man",
        "Authors": "By Spillane, Mickey",
        "Description": "Mike Hammer is back after a nineteen-year hiatus, and when he discovers a dead man sitting in his office chair, he is off on an adventure that involves a mysterious toolbox, a drug ring, two beautiful women, and the CIA",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "E P Dutton",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "The Scold's Bridle",
        "Authors": "By Walters, Minette",
        "Description": "The death of Mathilda Gillespie shocks the English village of Fontwell and sets local tongues wagging. The wealthy old woman is found dead in her bath, a bloody kitchen knife within reach, and a scold's bridle - a medieval instrument of torture used to silence nagging women - over her head. Was her death a cleverly constructed suicide? Or a vicious murder, orchestrated by one of the many people who found Mathilda's snobbism and intolerance too cruel to bear?Sarah Blakeney, Mathilda's doctor and one of the few people who actually liked the difficult but fascinating woman, takes an interest in the case; her interest becomes very personal when she is revealed to be the main beneficiary of the deceased's will. Suddenly Sarah is the center of local gossip, as she must face the accusations of Mathilda's bereft daughter and granddaughter - as well as a police investigation that points increasingly in her own direction and forces her to face some troubling questions: What does her husband know that he's not telling? And what really did happen during those tortured hours before Mathilda's death?Minette Walters is perhaps the most acclaimed new suspense novelist of the 1990s. Her debut, The Ice House, was called \"the most impressive first novel for years\" (The Daily Telegraph) and named one of the best mysteries of 1992 by the Rocky Mountain News. The St. Petersburg Times hailed The Ice House as \"a splendid first book by a British author who is bound to be compared with Ruth Rendell and P. D. James.\"Critics greeted Walters's second novel, The Sculptress, with even greater enthusiasm. Named a top crime novel of 1993 by the Los Angeles Times Book Review and the Kansas City Star, The Sculptress was called a \"creepy but compulsive tale of psychological suspense that is hard to put down\" by The New York Times Book Review. \"Intricate, intriguing, and tantalizingly ambiguous, [The Sculptress] ratifies Walters's emergence into the front ranks of today's mystery writers,\" declared the San Diego Union Tribune, while Kirkus Reviews said, \"Walters brings a shivery mastery to the old-fashioned British whodunit, with plotting as twisted as the characters' secrets.\" With The Scold's Bridle, her stunning third novel, Walters firmly establishes herself as the best of the new breed of suspense writers.",
        "Category": " Fiction , Mystery & Detective , Traditional British",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "A 6th Bowl of Chicken Soup for the Soul: More Stories to Open the Heart And Rekindle The Spirit",
        "Authors": "By Canfield, Jack (COM) and Hansen, Mark Victor (COM)",
        "Description": "Jack and Mark's latest batch of wisdom, love and inspiration will warm the hearts and nourish the souls of all readers, whether they are \"tasting\" Chicken Soup for the first time, or have dipped their \"spoons\" many times before. In the tradition of all the books in the original Chicken Soup series, this volume focuses on love; parents and parenting; teaching and learning; death and dying; perspective; overcoming obstacles; and eclectic wisdom. Contributors to A 6th Bowl of Chicken Soup for the Soul include: Erma Bombeck, Edgar Guest, Jay Leno, Rachel Naomi Remen, Robert A. Schuller, Dr. James Dobson, Dolly Parton and Cathy Rigby. A 6th Bowl is guaranteed to make anyone looking for inspiration and renewal an eternal \"soup lover.\" Readers will discover that there is only one \"recipe\" for compassion, wisdom, inspiration and love: Chicken Soup for the Soul.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Hci",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Poseidon's Shadow",
        "Authors": "By Kobryn, A. P.",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "July",
            "Year": "1979"
        }
    },
    {
        "Title": "Rich Christians in an Age of Hunger: A Biblical Study",
        "Authors": "By Ronald J. Sider",
        "Description": "Surveys current world hunger and the affluence of the Northern Hemisphere, details a biblical perspective on the causes, conditions, and consequences of poverty and hunger, and proposes actions for individual, church, and state",
        "Category": "",
        "Publisher": "INTER VARSITY PRESS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "What Was Mine",
        "Authors": "By Beattie, Ann",
        "Description": "A collection of short fiction, twelve works in all, including two never-before-published novellas. Here are disconnected marriages and uneasy reunions, nostalgic reminiscences and sudden epiphanies--a remarkable and moving collage of contemporary lives.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "The Doctors Book of Home Remedies II: Over 1,200 New Doctor-Tested Tips and Techniques Anyone Can Use to Heal Hundreds of Everyday Health Problems",
        "Authors": "By Kirchheimer, Sid (EDT)",
        "Description": "A fully researched, A-to-Z home-reference guide to health features more than one thousand bits of advice on 238 conditions and symptoms, including sleepwalking, TV addiction, passive smoking, driver fatigue, and heart palpitations.",
        "Category": " Health & Fitness , Reference",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "How to Develop a Professional Portfolio: A Manual for Teachers",
        "Authors": "By Campbell, Dorothy M. (EDT), Cignetti, Pamela Bondi, Melenyzer, Beverly J., Nettles, Diane H., Wyman, Richard M., and Campbell, Dorothy M.",
        "Description": "",
        "Category": "",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "The Last Train from Berlin",
        "Authors": "By Blagowidow, George",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "Champions of American Sport",
        "Authors": "By Marc Pachter",
        "Description": "",
        "Category": "",
        "Publisher": "H.N. Abrams",
        "Price Starting With ($)": "43.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The French cuisine I love",
        "Authors": "By Bond, Jules Jerome",
        "Description": "",
        "Category": "",
        "Publisher": "Leon Amiel",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "At Your Own Pace: Traveling Your Way in Your Motorhome",
        "Authors": "By Beard, Bernice",
        "Description": "",
        "Category": " Travel , General",
        "Publisher": "Arbor House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Living Chesapeake",
        "Authors": "By Schubel, J. R.",
        "Description": "A discussion of the history, biology, and geology of Chesapeake Bay is accompanied by vivid photographs of life on the Bay",
        "Category": " Science , General",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1981"
        }
    },
    {
        "Title": "A Spinal Specialist's Guide to Exercise, Fitness and Health",
        "Authors": "By Blair, Michael F.",
        "Description": "Discusses the fundamentals of biomechanics, recommends a program of exercises, and explains the principles of good nutrition",
        "Category": " Medical , General",
        "Publisher": "Olympic Marketing Corp",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "The Prentice-Hall Complete Secretarial Letter Book",
        "Authors": "By De Vries, Mary A.",
        "Description": "Scores of samples of business letters and interoffice memos, plus forms that reduce the time spent on routine office matters, assist secretaries in handling business correspondence",
        "Category": " Business & Economics , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "November",
            "Year": "1978"
        }
    },
    {
        "Title": "The white cliffs",
        "Authors": "By Miller, Alice Duer",
        "Description": "",
        "Category": "",
        "Publisher": "Coward-McCann Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1940"
        }
    },
    {
        "Title": "Van Gogh Museum Guide",
        "Authors": "By Van Gogh Museum",
        "Description": "",
        "Category": "",
        "Publisher": "Van Gogh Museum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Courage to Stand Alone: Letters from Prison and Other Writings",
        "Authors": "By Wei, Ching-Sheng, Jingsheng, Wei, Torgeson, Kristina M. (EDT), and Wei, Jingsheng",
        "Description": "The letters of a Chinese dissident who has been imprisoned for nearly twenty years are published here, along with essays that he has written about his political beliefs and what China's economic and human rights reforms should be.",
        "Category": " Political Science , Human Rights",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Parkinson's: A patient's view",
        "Authors": "By Sidney Dorros",
        "Description": "The author describes his experiences as a sufferer of Parkinson's disease, depicts his search for an effective teatment, and explains how he learned to cope with the illness",
        "Category": "",
        "Publisher": "Seven Locks Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Daniel Webster",
        "Authors": "By Benson, Allan L",
        "Description": "",
        "Category": "",
        "Publisher": "Cosmopolitan Book Corporation",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1929"
        }
    },
    {
        "Title": "Stephen Balkenhol: Sculptures and Drawings",
        "Authors": "By Benezra, Neal and Balkenhol, Stephan",
        "Description": "",
        "Category": " Art , Techniques , Drawing",
        "Publisher": "Smithsonian: Hirshhorn Museum & Sculpture Garden",
        "Price Starting With ($)": "6.35",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Government in America: Election Edition",
        "Authors": "By Edwards, George C., Wattenberg, Martin P., and Lineberry, Robert L.",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Longman Pub Group",
        "Price Starting With ($)": "7.67",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The survival factor: Israeli intelligence from World War I to the present",
        "Authors": "By Blumberg, Stanley A.",
        "Description": "Chronicles the daring, frequently spectacular feats of political and military espionage that have characterized Israeli intelligence and includes an account of the development of Israeli nuclear power",
        "Category": "",
        "Publisher": "Putnam",
        "Price Starting With ($)": "34.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Magical Labyrinths Journeys Through Time And Space",
        "Authors": "By Jeitner-Hartmann, Bertrun and Thiemeyer, Thomas",
        "Description": "Magic Labyrinths is already a sensation in Germany. It was published by arsEdition (the German publisher of our Magic Eye books, among others) in spring of 2001, and rights have been sold all over the world. The labyrinths in this book do not exist in reality; they are artistic creations that readers \"solve\" with their eyes or by tracing with their fingers.People have been fascinated by the magic of labyrinths and mazes for centuries; they exist in almost every part of the world. Cornfield labyrinths have been popping up all over the United States and Europe in the last several years, demonstrating a heightened fascination with the phenomena.",
        "Category": " Games , Role Playing & Fantasy",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "101 Questions and Answers on Islam",
        "Authors": "By Renard, John",
        "Description": "This informative, clear, and accessible guide offers information and knowledge about the Islamic religion.  Organized in a question and answer format, this book gives the reader a better understanding of Islam through education. Where and when did Islam come into being? What sort of book is the Koran? What basic views do Muslims hold on human rights?",
        "Category": " Religion , Islam , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "It Isn't Always Easy",
        "Authors": "By Schutz, Susan Polis",
        "Description": "Poets share their thoughts on love, friendship, caring, and the struggle and determination to succeed in life",
        "Category": " Poetry , General",
        "Publisher": "Blue Mountain Arts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "Communication, Language and Meaning: Psychological Perspectives",
        "Authors": "By George A Miller",
        "Description": "",
        "Category": "",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "16.21",
        "Publish Date": {
            "Month": "December",
            "Year": "1973"
        }
    },
    {
        "Title": "Better homes and gardens treasury of needlecrafts (Better homes and gardens books)",
        "Authors": "By Better Homes & Gardens",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Corp",
        "Price Starting With ($)": "7.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Mastering the Floral Design: A step by step guide",
        "Authors": "By De Palma, Roxanne",
        "Description": "",
        "Category": "",
        "Publisher": "Horticultural Institute of Southern California",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Weekend Garden Guide: Work Saving Ways to a Beautiful Backyard",
        "Authors": "By Roth, Susan A.",
        "Description": "Suggests helpful hints for low-maintenance flower and vegetable gardens, and provides information on easy-care plants",
        "Category": " Gardening , General",
        "Publisher": "Rodale Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Exploring Space",
        "Authors": "By Eugene, Toni",
        "Description": "Through spectacular photos and lively text, young readers can blast off with the astronauts and see how they eat, sleep, and exercise in zero gravity as well as discover the physical rigors and technological challenges of space travel. Original.",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "National Geographic Children's Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Jacob's Room",
        "Authors": "By Woolf, Virginia",
        "Description": "The story of a man’s life from a day in his childhood to the day of his death. “Jacob’s Room...comes as a tremendous surprise. The impossible has occurred. The style closely resembles that of Kew Gardens....The break with Night and Day and even with The Voyage Out is complete. A new type of fiction has swum into view” (E. M. Forster).",
        "Category": " Fiction , Literary",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1950"
        }
    },
    {
        "Title": "Alma Lynne's Country Cross-Stitch",
        "Authors": "By Lynne, Alma",
        "Description": "More than fifty patterns for country-style wall hangings, pillows, framed pieces, and other items feature the author's simple, time-saving techniques and clever combinations of color",
        "Category": " Art , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Religion on Capitol Hill: Myths and Realities",
        "Authors": "By Benson, Peter L. and Williams, Dorothy L.",
        "Description": "Extensive interviews with members of the 96th Congress reveal their religious outlook which cuts across denominational lines and is linked to voting patterns",
        "Category": " Political Science , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1982"
        }
    },
    {
        "Title": "Murder in the Napa Valley",
        "Authors": "By Osborn, David",
        "Description": "At a hot-air ballooning rally in northern California, free-lance journalist and amateur sleuth Margaret Barlow accepts a request from Elissa Seldridge to investigate a series of accidents at L'Abbaye Ste. Denise.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Health Care for the Other Americans",
        "Authors": "By Bullough, B.",
        "Description": "",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "10.42",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "The Great Controversy",
        "Authors": "By White, Ellen Gould Harmon",
        "Description": "",
        "Category": "",
        "Publisher": "Pacific Press Publishing Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Threading the Needle: The PAX NET Story",
        "Authors": "By Paxson, Lowell and Templeton, Gary",
        "Description": "In Threading the Needle, Paxson takes you behind-the-scenes and into the world of big business, big deals, and deep faith. In this moving personal story, Paxson, a natural-born storyteller, shares the sometimes hilarious and sometimes heart-wrenching struggles of trying to maintain balance in career, spiritual life, and family.The title Threading the Needle refers to the biblical story of the rich man who approached Jesus and asked how he could acquire eternal life. Jesus responded, \"It is easier for a camel to go through the eye of a needle, than for a rich man to enter the kingdom of God.\" (Luke 18:25) In clear prose, Paxson describes how this passage helped influence the most important decisions in his business - and in his life.In Threading the Needle, Paxson shares the business philosophy that got him where he is today - chairman of a huge television enterprise that is poised to grow even bigger. Part motivation and part business strategy, Threading the Needle contains a recipe for success that people can implement in their own businesses and spiritual lives.",
        "Category": " Performing Arts , Television , Direction & Production",
        "Publisher": "Harperbusiness",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "On the Go with Baby: A Stress-Free Guide to Getting across Town or around the World",
        "Authors": "By Lutz, Ericka",
        "Description": "A pack-up-and-go guide to get you and baby out of the house and on your wayFrom shopping at the grocery store to traveling Europe, parents will learn how to leave the house with their kids without having a panic attack. A reassuring book for parents who feared they'd never leave the house once they had kids.Parents of young children will enjoy practical advice on packing, babyproofing a hotel room, how to choose a vacation, how to handle public tantrums, and anything else that could possibly happen outside the home. Text is humorous and written in an approachable and helpful tone so you can leave the house with Junior, an organized baby bag and your sanity!",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Sourcebooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Mother Goose On the Loose",
        "Authors": "By Goldstein, Bobbye S. (EDT) and New Yorker (New York, N. Y.) (ILT)",
        "Description": "A collection of Mother Goose rhymes and original nursery rhymes based on familiar tales illustrated with cartoons from the New Yorker magazine.",
        "Category": " Juvenile Nonfiction , Humor , Comic Strips & Cartoons",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Picoverse",
        "Authors": "By Metzger, Robert A.",
        "Description": "Picoverse: a universe one million-millionth of our own, created by deliberately ripping apart the fabric of space-time.  A big-bang of an adventure, Robert Metzger's Picoverse boldly embraces the grand traditions of the genre, while exploding beyond the limits of knowledge, beyond the edges of the imagination, and beyond the boundaries of the universe as we know it.  \"Probably the most daring SF novel since Ringworld...mind-boggling.\" (F. Paul Wilson, author of All the Rage)  \"Bob Metzger knows his science. He proves it in Picoverse, a complex and intriguing story that ranges widely through time and space.\" (Charles Sheffield, author of The Spheres of Heaven)  \"Metzger has captured the essence of that good old time religion SF fans have worshiped since the genre began: a rousing hard SF tale with a true Sense of Wonder...This one is a winner.\" (David A. Truesdale, Editor, SFWA Bulletin)  \"A 21st century leap from the physics lab into the multiverse that only Gregory Benford, Philip Jos&eacute Farmer, and A.E. Van Vogt could have written-if they had ever collaborated.\" (Tom Easton, Reviewer, Analog)",
        "Category": " Fiction , Science Fiction , Hard Science Fiction",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Anatoly and Avital Shcharansky: The Journey Home",
        "Authors": "By Jerusalem Post (COR)",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Thomas Gray: Philosopher Cat",
        "Authors": "By Davis, Philip J.",
        "Description": "Thomas Gray, a cat that helps a Cambridge historian of mathematics with his reserch, purrs at the center of this light, philosophical tale wrapped around a mathematical problem",
        "Category": " Fiction , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "New Choices in Natural Healing for Women: Drug-Free Remedies from the World of Alternative Medicine",
        "Authors": "By Prevention Magazine Health Books (COR), Faelten, Sharon, Loecher, Barbara, O'Donnell, Sara Altshul, and Fugh-Berman, Adriane",
        "Description": "",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Teach Yourself Networking in 24 Hours",
        "Authors": "By Hayden, Matt and Newman, Greg",
        "Description": "",
        "Category": " Computers , Networking , Local Area Networks (LANs)",
        "Publisher": "Sams",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Clinic",
        "Authors": "By Kellerman, Jonathan",
        "Description": "In the realm of psychological suspense, Jonathan Kellerman is without peer. Now, following an extraordinary eleven successive New York Timesbestsellers, he has written an Alex Delaware novel to match his best--about the murder of a celebrity author and the truth behind her public facade.She was found stabbed to death on a quiet, shady street in one of L.A.'s safest neighborhoods. For three months the police have found no clues to the murder ofHope Devane, psychology professor and controversial author of a pop-psych bestseller, an angry indictment of men. Now Detective Milo Sturgis, newly assigned to the case, turns to his psychologist friend, Dr. Alex Delaware, looking for insights into Devane's life.To both men the cold stalking of Hope Devane suggests calculation fueled by hate--an execution. They discover why as they unlock, one by one, the veryprivate compartments of her life: her marriage, her shadowy work for a Beverly Hills clinic, the Conduct Committee she ran with an iron hand at theUniversity, and her baffling link to another murder victim. But it is when Alex delves into her childhood that he begins to understand the formidable woman she was--and the ties that entangled her life until the horrifying act of betrayal that ended it.  Building to a white-knuckle climax in which Alex sets a trapfor a killer, The Clinic is brilliantly plotted suspense as wrenchingly disturbing as today's headlines.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Lucy's Child: The Discovery of a Human Ancestor",
        "Authors": "By Johanson, Donald C. and Shreeve, James",
        "Description": "A famed paleontologist describes his latest find at Tanzania's Olduvai Gorge, a two million-year-old elbow bone, a discovery that raises questions about humankind's evolution",
        "Category": " Science , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "The Holiday Wreath Book: 80 Wreaths to Celebrate Birthdays, Anniversaries & Holidays Throughout the Year",
        "Authors": "By Carlson, Eric",
        "Description": "",
        "Category": " Crafts & Hobbies , Seasonal",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "The Athlete Within: A Personal Guide to Total Fitness",
        "Authors": "By Simon, Harvey B. and Levisohn, Steven R., M.D.",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.28",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Nontoxic, Natural and Earthwise: How to Protect Yourself and Your Family from Harmful Products and Live in Harmony With the Earth",
        "Authors": "By Collins, Judy, Dadd-Redalia, Debra, and Lett, Steve",
        "Description": "Subtitled  How to protect yourself and your family from harmful products and live in harmony with the earth.  Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Social Science , General",
        "Publisher": "J P Tarcher",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Chicken Soup for the Golden Soul: Heartwarming Stories for People 60 and Over (Chicken Soup for the Soul)",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), Chesser, Barbara Russell (COM), Meyer, Paul J. (COM), and Seeger, Amy (COM)",
        "Description": "Barbara Russell Chesser Ph.D., Amy Seeger and Paul J. Meyer join Jack Canfield and Mark Victor Hansen in compiling Chicken Soup for the Golden Soul. This collection offers readers loving insights and wisdom--all centering on the prime of life. Contributors to this volume include Erma Bombeck, Ruth Stafford Peale, Tom Landry, Florence Littauer, Roy Rogers and Max Lucado. Readers of all ages are sure to cherish this invaluable collection as a reminder that the soul of those young at heart is truly \"golden.\" Divided into chapters on letting go, giving, learning, the lighter side, across the generations, overcoming obstacles, perspective, believing, living your dream, reminiscing and ageless wisdom, this book celebrates the myriad joys of living and the wisdom that comes from having lived. Readers at every stage of life will turn to this book again and again for the timeless wisdom that will help them live their lives to the fullest.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Hci",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "When My Love Returns from the Ladies Room, Will I Be Too Old to Care?",
        "Authors": "By Grizzard, Lewis",
        "Description": "A collection of humorous columns discusses New York, actresses, shopping, and other subjects",
        "Category": " Humor , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Branson, MO: Las Vegas of the Ozarks",
        "Authors": "By Horenstein, Henry",
        "Description": "In the first book to capture the magic of the Branson experience, renowned photographer Henry Horenstein documents the stars, theaters, town, and fans (along with their buses!) in glorious color photographs and enlightening text and captions.  Branson, Missouri, a tiny town buried deep in the Ozark Mountains, has become the live entertainment capital of the United States. Last year alone, more than 5 million fans flocked to Branson's thirty huge celebrity theaters built by performers such as Andy Williams, Johnny Cash, and Conway Twitty.  Second only to Disney World in number of visitors annually, Branson happened because a couple of old guitar pickers like Box Car Willie and Roy Clark got tired of the grind of the road and set up shop in this beautiful but sleepy neck of the woods. Other acts, finding it too expensive to tour (even if the audience was there to support them), followed suit. Like magic, legions of fans in cars, RVs, and tour buses started to appear.  An expected 9 million people will pack up Grandma and the kiddies and head to Branson this year for some wholesome entertainment the way many Americans remember it.",
        "Category": " Music , Genres & Styles , Country & Bluegrass",
        "Publisher": "Artisan",
        "Price Starting With ($)": "5.71",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "A Royal Duty",
        "Authors": "By Burrell, Paul",
        "Description": "Paul Burrell, butler to Diana, Princess of Wales, and the man she called \"my rock\" presents for the first time the untold story behind one of the most sensational chapters in the history of the House of Windsor.The story of shocking secrets, absolute power, and unlikely alliances. The story behind previously unseen letters and photos and first-person insights. The story that will rewrite history and stand alone as the archive of Princess Diana's time as a Royal. The story of a faithful subject and his moving tribute to the Queen and Princess he served.",
        "Category": " Political Science , General",
        "Publisher": "Putnam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Bridge Across Forever",
        "Authors": "By Bach, Richard",
        "Description": "The author of \"Jonathan Livingston Seagull\" recounts his search for his dreamed-of soulmate, his detour into wealth and success, and his ultimate meeting with the woman with whom he has found new and intense love and enchantment",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "I'll Be There",
        "Authors": "By Dart, Iris Rainer",
        "Description": "Follows the outrageous singer-actress Cee Cee Bloom as she attempts to cope with her stardom and being a mother to Bertie's little girl, Nina",
        "Category": " Fiction , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Bondage",
        "Authors": "By Davis, Patti",
        "Description": "Sara never meant to lose control. In all her relationships before Anthony, she had always been the seducer. She had called the shots. Set the rules. Dominated.So when exactly did she let go? When did he become the conqueror, she the slave? Whenever it had happened, she knew it was too late now. Sex - the game she played best, the game at which she was master - suddenly had a whole new set of rules. It was, Sara thought, like having to start all over again....In Bondage, the new novel by Patti Davis, author of the bestsellers Home Front, A House of Secrets, and Dead Fall and the non-fiction book about her parents, Ronald and Nancy Reagan, The Way I See It, be prepared to meet a whole new cast of characters.Sara is a child of California, grown up and grown old at age thirty-five as only a woman could who has lived so much in so short a time. A costume designer for movies and television, it is through work that she meets her best friend, Belinda, a very vulnerable and needy young woman who envies Sara her ease with her own sexuality, her ability to dominate and control the men who want her.Sara has never questioned sex or her own sexuality. She likes it, is comfortable with it, and uses it whenever she wants. She begins and ends relationships with ease, taking what enjoyment she can before going on to the next. Then she meets Anthony, the hot new director of the moment. With him she begins a relationship that propels her into uncharted territories and that ultimately threatens to consume her....In Bondage, Patti Davis has written a novel for the '90s that is shocking and startling, yet speaks to the hidden desires of women and men. It is a novel about a new kind of sexuality, at once a thriller and a dark love story.",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "American Star",
        "Authors": "By Collins, Jackie",
        "Description": "Jackie Collins' American Star is the love story of the nineties. At its heart are two extraordinary lovers, separated by tragic circumstances, yearning for each other, yet seemingly never able to be together again.Nick Angel is a cult superstar - a brooding, talented, mesmerizing figure, handsome without being perfect - whose talent and looks - long black hair, hypnotic green eyes, a stubbly chin - have made him the idol of his generation. Nick can have any woman he wants...except the one he loves.Lauren Roberts is a beautiful and special top model - tall, slender, with thick chestnut hair falling below her shoulders. Lauren's features have made her an international symbol of beauty and her life is the envy of every woman. But for all her fame and wealth, she still yearns for the one man she has ever really loved.For Nick and Lauren can never forget each other. Teenage small-town lovers - he from the wrong side of the tracks, she the prettiest girl in town - their love was the town scandal, forbidden, sizzling and unforgettable, ending abruptly in a tragedy that sent them into separate orbits.Nick pursues his dream of acting, and after a series of wild adventures begins the slow rise that will make him one of Hollywood's biggest stars.Lauren goes to New York and enters the modeling world, surprising everyone with a career that takes off in a direction she never expected.American Star follows them both on their trips to fame, as Nick and Lauren, haunted by the secret they share, try to live without each other - only to find they can't.Full of the kind of characters that have made Ms. Collins' books international best-sellers with over one hundred seventy million copies in print in thirty languages, American Star is a compelling story of love, sex and murder, set against the glamorous backgrounds of New York and Hollywood, as only Jackie Collins can tell it.American Star is Jackie Collins' biggest, hottest book ever.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Come the Spring",
        "Authors": "By Garwood, Julie",
        "Description": "",
        "Category": "",
        "Publisher": "Atria",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Delusions of Grandma",
        "Authors": "By Fisher, Carrie",
        "Description": "Now that she's conquered rehab and romance, best-selling novelist Carrie Fisher boldly goes where no man has gone before: motherhood.Hollywood screenwriter Cora Sharpe has taken to writing letters to the unborn child she's tentatively dubbed Esme - even though it sounds like a noise your nose makes. But then, Cora has what one of the endless intimates she thinks of as her Committee calls \"a big loud life,\" and recent events have been no exception. Her confidant and writing partner, Bud, has been on a bipolar roller coaster. Her dear friend William, AIDS-ridden, has finally taken leave of his life, with the aplomb befitting \"a suburban show business sultan.\" And in the vacuum that follows his departure, Cora's romance with quiet, gentle Ray has suddenly flickered and expired.Then Cora finds out she's pregnant, and even the Committee can't steer her through this one. In a fight-or-flight confrontation with maturity, flight seems to have the upper hand. So when her mother, Viv, tries to rally support for her latest madcap scheme - to kidnap her Alzheimer's-stricken father from a nursing home and take him back to Whitewright, Texas, the place of his birth - Cora, for once, is game. With Bud in tow, she signs on for what turns out to be a cosmic (not to mention comic) exploration of the urges that drive us to feather our nests and fill them, to flee them and find our way home.With singular deftness, Fisher captures the ambivalence and absurdity of modern maternity, in her wittiest and wisest novel to date.",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "The complete book of beer drinking games (and other really important stuff)",
        "Authors": "By Griscom, Andy, etc.",
        "Description": "The rules for fifty games to be played while drinking beer are accompanied by humorous essays",
        "Category": "",
        "Publisher": "Distributed to the trade by Kampmann and Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Dragondrums",
        "Authors": "By McCaffrey, Anne",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Calamity & Belle (Cowgirl Correspondence)",
        "Authors": "By Wronsky, Calamity, Endall, Belle, and Schenck, Bill",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Gibbs Smith",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "It's a Girl Thing: How to Stay Healthy, Safe and in Charge",
        "Authors": "By Jukes, Mavis and Tilley, Debbie (ILT)",
        "Description": "The highly acclaimed girls' guide to adolescence by a Newbery Honor-winning author is now available in a rack-sized paperback edition. Reviewers were unanimous in their praise for this useful and important book.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Treasures of Tutankhamun",
        "Authors": "By I.E.S. Edwards",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Metropolitan Museum of Art",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1976"
        }
    }
]