[
    {
        "Title": "Down-Home Wholesome: 300 Low-Fat Recipes from a New Soul Kitchen",
        "Authors": "By Carter, Danella",
        "Description": "A stylish cookbook trims the fat, sugar, and salt from traditional soul food, using low-fat foods to create more than three hundred appealing dishes, such as Country Chicken with Cornmeal Waffles, A Mess o' Greens, and more.",
        "Category": " Cooking , Regional & Ethnic , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Give to Live: How Giving Can Change Your Life",
        "Authors": "By Lawson, Douglas M.",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Alti Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Country Mothers Cookbook: A Celebration of Motherhood and Old-Fashioned Cooking",
        "Authors": "By Hopping, Jane Watson",
        "Description": "A compendium of old-fashioned recipes and stories features recipes for soups, main dishes, vegetables, breads, and desserts",
        "Category": " Cooking , Reference",
        "Publisher": "Villard",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "The Best American Nonrequired Reading 2005",
        "Authors": "By Eggers, Dave (EDT)",
        "Description": "The Best American Series First, Best, and Best-SellingThe Best American series has been the premier annual showcase for the country's finest short fiction and nonfiction since 1915. For each volume, the very best pieces are selected by a leading writer in the field, making the Best American series the most respected--and most popular--of its kind. The Best American Nonrequired Reading 2005 includes Daniel Alarcón • Aimee Bender •  Dan Chaon •  Daniel Clowes •  Tish Durkin •  Stephen Elliott • Al Franken • Jhumpa Lahiri •  Rattawut Lapcharoensap • Anders Nilsen • Georges Saunders • William T. Vollmann • and othersDave Eggers, editor, is the author of A Heartbreaking Work of Staggering Genius, You Shall Know Our Velocity!, and How We Are Hungry, and the editor of McSweeney's. He is the founder of 826 Valencia, a San Francisco writing lab for young people.Beck, guest introducer, whose single \"Loser\" was instantly labeled an anthem for the slacker generation, is also known for his Grammy Award-winning albums Odelay and Mutations.",
        "Category": " Literary Collections , American , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Human Technology: A Toolkit For Authentic Living",
        "Authors": "By Lee, Ilchi",
        "Description": "Ilchi Lee, author of Healing Society, presents a toolkit for self-reliance management of the core issues of life: health, sexuality, and life purpose. Meditation, breath-work, and Oriental healing arts are offered as self-reliant health management skills. A distinctive perspective on sex and sex education and an inspirational guide to discover a passionate life purpose are featured. This book also includes a practical guide to optimize our life’s master controller—the brain.",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Healing Society, Inc.",
        "Price Starting With ($)": "12.95",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Riding Rockets: The Outrageous Tales of a Space Shuttle Astronaut",
        "Authors": "By Mullane, Mike",
        "Description": "In 1978, the first group of space shuttle astronauts was introduced to the world -- twenty-nine men and six women who would carry NASA through the most tumultuous years of the space shuttle program. Among them was USAF Colonel Mike Mullane, who, in his memoir Riding Rockets, strips the heroic veneer from the astronaut corps and paints them as they are -- human.   Mullane's tales of arrested development among military flyboys working with feminist pioneers and post-doc scientists are sometimes bawdy, often comical, and always entertaining. He vividly portrays every aspect of the astronaut experience, from telling a female technician which urine-collection condom size is a fit to hearing \"Taps\" played over a friend's grave. He is also brutally honest in his criticism of a NASA leadership whose bungling would precipitate the Challenger disaster -- killing four members of his group. A hilarious, heartfelt story of life in all its fateful uncertainty, Riding Rockets will resonate long after the call of \"Wheel stop.\"",
        "Category": " Science , Physics , Astrophysics",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Let's Elope: The Definitive Guide to Eloping, Destination Weddings, and Other Creative Wedding Options",
        "Authors": "By Shaw, Scott and Beahan, Lynn",
        "Description": "Can't cope? Elope!Admit it. You always thought eloping sounded kind of romantic, right? Too bad everyone expects you to have The Big Wedding -- the kind you always thought you wanted. So now that you're engaged and knee-deep in wedding planning, why are you secretly wishing you could just fly off to a tropical island and say your I do's in your bathing suit? Well, you can! There are many different ways to elope -- and not all of them involve running off in the middle of the night. These days, \"eloping\" is anything other than a traditional wedding -- from a steps-of-city-hall ceremony with just the two of you, to a fun-filled \"destination wedding\" with your family and closest friends. Let's Elope is filled with creative ideas for exchanging your vows in a memorable, personalized way that won't necessarily cost you a fortune -- or your sanity. Let's Elope includes:* A brief history of weddings -- and why people first began to elope* A quiz to help you decide if eloping is right for you* Inspiring anecdotes from real-life couples who chose to opt out of a traditional wedding* Elopement etiquette, including how to break the news to your family and friends* Information on how to plan destination weddings, country weekend weddings, and surprise weddings* Up-to-the-minute addresses, phone numbers, and Web sites for the world's top elopement spots* Tons of ideas about what to do with all the money you saved!",
        "Category": " Reference , Weddings",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Christian Fatherhood: The Eight Commitments of St. Joseph's Covenant Keepers",
        "Authors": "By Wood, Stephen",
        "Description": "",
        "Category": " Family & Relationships , General",
        "Publisher": "Family Life Center Intl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Indian Country",
        "Authors": "By Matthiessen, Peter",
        "Description": "An exploration of the encroachment of whites on the sacred grounds of the native Americans discusses such tribes as the Miccosukee, Hopi, Cherokee, Mohawk, Urok, Karuk, Lakota, Chumsah, Paiute, Shoshone, Ute, and Navajo. Reprint. NYT.",
        "Category": " Social Science , Ethnic Studies , Native American Studies",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "16.61",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Behind the blue and gray: The soldier's life in the Civil War (Young readers' history of the Civil War)",
        "Authors": "By Ray, Delia",
        "Description": "",
        "Category": "",
        "Publisher": "Scholastic",
        "Price Starting With ($)": "9.67",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Healing the Dying (Exploration Book)",
        "Authors": "By Linn, Mary Jane",
        "Description": "",
        "Category": " Family & Relationships , Death, Grief, Bereavement",
        "Publisher": "Paulist Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Embedded: The Media at War in Iraq",
        "Authors": "By Katovsky, William and Carlson, Timothy",
        "Description": "\"The interviews crackle with immediacy.\" -The New York Times \"It is my hope that this outstanding piece of work will reach the widest possible distribution and readership.\" -Dan Rather, CBS News, on the John Burns interview EMBEDDED is a collection of deeply emotional and highly personal accounts of covering the Iraq War. Many of the world's top war correspondents and photographers speak candidly about life on the battlefield. Here are articulate and heartfelt descriptions of fear and firefights, of bullets and banalities, of risking death and meeting deadlines. With over sixty interviews conducted in Kuwait and Iraq shortly after many returned home, Katovsky and Carlson allowed these journalists to step outside their professional role as journalists and examine the lethal allure of combat reporting. Here is CBS Evening News correspondent Jim Axelrod discussing the perils of racing to Baghdad while despondent over the death of a television colleague and being unexpectedly comforted by ABC News Nightline's Ted Koppel; Newsweek reporter Scott Johnson unwittingly driving into an ambush and then kicking out the windshield of his bullet-riddled car to escape the Iraqi gunmen; New York Times Baghdad Bureau Chief John Burns's brave refusal to be intimidated by his Iraqi information ministry minders; and many, many more. Each interview in EMBEDDED maps its own personal path and narrative arc, while presenting an emotional window to war and reporting. Taken individually, each offers a unique view of the most-covered war in history. Collectively, EMBEDDED is an eyewitness to history that will do for the war in Iraq what Michael Herr's Dispatches did for Vietnam.",
        "Category": " History , Middle East , General",
        "Publisher": "The Lyons Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Paradox of American Power: Why the World's Only Superpower Can't Go It Alone",
        "Authors": "By Nye, Joseph S.",
        "Description": "What role should America play in the world?  What key challenges face us in the century to come, and how should we define our national interests? These questions have been given electrifying new significance in the wake of the terrorist attack of September 11, 2001.      Not since Rome has any nation had so much economic, cultural, and military power, but that power is still not enough to solve global problems like terrorism, environmental degradation, and the proliferation of weapons of mass destruction without involving other nations. In The Paradox of American Power, Joseph S. Nye, Jr. focuses on the rise of these and other new challenges and explains clearly why America must adopt a more cooperative engagement with the rest of the world.      The threat of terrorism, Nye argues, is merely the most alarming example of why we must engage in constructive relations with other nations weak and strong. Now more than ever, as technology spreads and non-governmental organizations ranging from transnational corporations to terrorists increase their power, American leadership must reorient itself toward the global community. Further, for many key issues--from international financial stability to drug smuggling and global climate change to terrorism--military power alone cannot ensure success and at times may undermine rather than enhance our objectives.  Nye argues convincingly that in the coming century the U.S. will rely less on our military might and more on the power that derives from the appeal of our culture, values and institutions, what he calls our \"soft power.\"  But this soft power cannot flourish in a climate in which the U.S. is viewed as selfish and motivated only by self-interest.      The Paradox of American Power contains the essential roadmap for maintaining America's power and reducing its vulnerability in the years to come. Sure to be controversial, it's a must read for anyone wishing to understand the complicated world in which we suddenly find ourselves.",
        "Category": " Political Science , Reference",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Year of the Rat: How Bill Clinton Compromised U.S. Security for Chinese Cash",
        "Authors": "By Timperlake, Edward and Triplett, William C., II",
        "Description": "A somewhat emotional, personalized attack on Clinton and Gore in which the authors argue that the Clinton-Gore administration has compromised American security in exchange for millions of dollars in illegal campaign contributions from foreign businessmen linked to organized crime and Chinese military and intelligence agencies. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Cut to the Chase: and 99 Other Rules to Liberate Yourself and Gain Back the Gift of Time",
        "Authors": "By Levine, Stuart R.",
        "Description": "DECIDE WHAT NOT TO DO# 46 TEACH PEOPLE HOW TO USE YOUR TIME# 97 TAKE BACK THE WEEKENDIn Cut to the Chase, bestselling author Stuart R. Levine reveals 100 no-nonsense rules on how to be more effective at work and make the best use of your most precious resource:your time. Just before CEO and consultant Stuart Levine appeared on the Today showto discuss his book The Six Fundamentals of Success, co-host Matt Lauer said to him, \"You know what really drives me nuts? When people come into my office for a five-minute conversation and an hour later, they're still there! Why can't they cut to the chase?\"Lauer's question echoed the concerns Levine has heard from business people and top executives at every level: How can I get more done? How can I stay focused? How can I condense my workday so that I can become more successful and still spend more time with the people I love? Levine's answer? By cutting to the chase. Successful individuals are the ones who make the best use of their time and energy. They approach each task with clarity, focus, and purpose. They prioritize. They don't allow others to waste their time. They understand the importance of refueling their batteries outside of work. In Cut to the Chase, Levine distills the expertise of hundreds of CEOs, leaders, and professionals into 100 concise, invaluable lessons about how to get to the point, stay on track, and be more successful in everything you do.In an age where we spend more hours at work than ever before, Cut to the Chase is the indispensable guide for taking control over your time so that you can lead a happier, more balanced life.",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "Crown Business",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Heartwarmers",
        "Authors": "By Jaffe, Azriela (EDT)",
        "Description": "A collection of poignant, inspiring stories by members of the popular heartwarmers4u.com website provides readers with comfort and support. Original. 100,000 first printing. $150,000 ad/promo.",
        "Category": " Reference , General",
        "Publisher": "Adams Media Corp",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Julian, Secret Agent (Julian's World)",
        "Authors": "By Allison, Diane Worfolk (ILT) and Cameron, Ann",
        "Description": "Bestselling classic The Stories Julian Tells is just the beginning! Get ready for more of Julian's wonderful family and imagination in the Julian's World chapter book series!  Secret agents Julian, Huey, and Gloria are already heroes. They have rescued a dog  and saved a toddler from drowning. But what they really want is to nab a real-live  bank robber. Just when it looks like they might catch the crook, the police chief  steps in. The supersleuths find that they're the ones who are in trouble—with a capital  T!\"The humor is effective and the action nonstop.\" —The Bulletin\"A quick and interesting read . . . the plot is well developed, and the characters are aptly drawn.\" —School Library Journal",
        "Category": " Juvenile Fiction , People & Places , United States , African American",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Dickens' David Copperfield (Cliffs Notes)",
        "Authors": "By Lybyer, J. M.",
        "Description": "As a disguised autobiography, Dickens creates in David the story of a \"favorite child,\" who later encounters suffering and travails, but winds up with a sanguine life all the same.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "CliffsNotes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Canterbury Tales Notes",
        "Authors": "By Cliffs Notes, Inc.",
        "Description": "",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1964"
        }
    },
    {
        "Title": "Without A Trace (The O'hurleys)",
        "Authors": "By Roberts, Nora",
        "Description": "Willing to do anything in order to find her lost brother, including risking the safety of the man with whom she is falling in love, Gillian Fitzpatrick takes on the difficult task of convincing Trace O'Hurley to help her. Reissue.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Eat Well Live Well",
        "Authors": "By Smith, Pamela M.",
        "Description": "For Ingest Only - Data needs to be cleaned up for all products being loaded",
        "Category": " Health & Fitness , General",
        "Publisher": "Creation House",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "The Pattern Library: Patchwork and Applique",
        "Authors": "By Carroll, Amy",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1981"
        }
    },
    {
        "Title": "Expat: Women's True Tales of Life Abroad (Adventura Books)",
        "Authors": "By De Tessan, Christina Henry (EDT)",
        "Description": "For generations, literary figures from Ernest Hemingway to Frances Mayes have fueled our fantasies about the romance of expatriate life. But it’s one thing to dream about living abroad and quite another to actually do it. In Expat a diverse group of women explores in vivid detail how the reality of life abroad matches up to the fantasy. Tonya Ward Singer craves a roasted chicken in China and must buy it alive and kicking. Karen Rosenberg reevaluates both her family’s Judaism and her own when invited to a Passover seder in a remote Japanese village. Mandy Dowd tries to teach the French about Thanksgiving. Emily Miller admits that in Italy she craves the Hollywood entertainment she generally deplores when on U.S. soil. Tall and fair, Meg Wirth tries hard to blend in, in Borneo?to no avail. Expat taps into the bewilderment, joys, and surprises of life overseas, where challenges often take unexpected forms and overcoming obstacles (finding Drano in Ukraine, shrimp paste in Prague) feels all the more triumphant. Featuring an astonishing range of perspectives, destinations, and circumstances, Expat offers a beautiful portrait of life abroad.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Seal Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "A Horse Around the House: The Horse Lover's Guide to Selecting, Housing, Caring For, Educating, Enjoying and Getting Along with Every Kind of Horse Anywhere at Minimum Cost",
        "Authors": "By Jacobson, Patricia",
        "Description": "A practical guide to the selection, training, grooming, and care of horses that contains suggestions on riding equipment and techniques",
        "Category": " Pets , Horses",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "August",
            "Year": "1978"
        }
    },
    {
        "Title": "Stupid White Men: ...and Other Sorry Excuses for the State of the Nation",
        "Authors": "By Moore, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Wolf Pack: Tracking Wolves in the Wild (Discovery!)",
        "Authors": "By Johnson, Sylvia A. and Aamodt, Alice",
        "Description": "Wolves have a reputation for ferocity and cunning that is unique in the animal world. This book shows just how exaggerated the wolf's reputation really is. Drawing on the latest scientific research, this fascinating portrait of wolves in the wild describes the social lives of wolves and the strong family ties that bind together the members of a pack as they share the work of hunting, maintaining territory, and raising young.",
        "Category": " Young Adult Nonfiction , Animals , General",
        "Publisher": "First Avenue Editions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "The New Democracy",
        "Authors": "By Hart, Gary",
        "Description": "",
        "Category": "",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "A Deadly Shade of Gold",
        "Authors": "By MacDonald, John D.",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Gold Medal",
        "Price Starting With ($)": "6.1",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "The Courtesan's Daughter (The Courtesan Series)",
        "Authors": "By Dain, Claudia",
        "Description": "First in a sexy new series featuring the match-making schemes of an infamous courtesan.  Award-winning author Claudia Dain tells a tale of impropriety and independence, and a mother and daughter determined to bend the rules of society in their favor.  Young Lady Caroline's prospects for a suitable match are severely limited by her mother's infamous past. Before Lady Sophia Dalby entered London society, she was a highly desired courtesan. What man of title, position, and wealth would marry a courtesan's daughter?  Sophia's solution is to purchase a husband for Caroline-the Earl of Ashdon- agreeing to settle his gambling debts if he will take her daughter's hand. Insulted, Caroline refuses to have a husband who was bought for her.  But after meeting the fiery Lord Ashdon, she wonders if it wouldn't be satisfying to have him pay for her, perhaps with a priceless pearl necklace? With Sophia pulling the strings, Lord Ashdon may get more than he bargained for and Caroline may get just what she wants.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "The Courage to Be a Stepmom: Finding Your Place Without Losing Yourself",
        "Authors": "By Thoele, Sue Patton",
        "Description": "Steering stepmoms through the treacherous waters of life in the shadow of the \"real mother,\" the author uses stories to explore guilt, fear, frustration, boundary setting, and other aspects of parenting in a new household. Original. Tour. IP.",
        "Category": " Psychology , General",
        "Publisher": "Wildcat Canyon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Girl, Have I Got Good News For You <i>heart-to-heart Encouragement For Hurting Women</i>",
        "Authors": "By Wells, Thelma",
        "Description": "When life is a struggle, a woman needs the encouraging voice of wisdom to guide her through the difficult choices that lead to healing and wholeness.  Thelma Wells is that voice.  As an African-American woman born during the days of segregation, Thelma learned her early lessons through hardship, oppression, and personal loss.  Girl, Have I Got Good News for You is a helpful prescription for dealing with the trials and tribulations of life.",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Living Well with Migraine Disease and Headaches: What Your Doctor Doesn't Tell You...That You Need to Know (Living Well (Collins))",
        "Authors": "By Robert, Teri",
        "Description": "For millions of Americans, Migraine disease, tension headaches, and other headaches are a debilitating part of every day. Teri Robert has been there—in fact, she experienced her first Migraine at age six. Now, in this groundbreaking holistic guide to the diagnosis and treatment of headaches and Migraine disease, she brings a patient-empowering message to all headache sufferers: you don't have to live with daily pain. She provides you with all the information you need to know about getting the help you need, including:Understanding side effectsTreatments for long-term reliefRisks and symptomsIdentification of the various types of headachesTraditional and alternative therapiesInformation on finding health care practitioners and supportNumerous case studies and expert advice",
        "Category": " Health & Fitness , Diseases , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Tales from Q School: Inside Golf's Fifth Major",
        "Authors": "By Feinstein, John",
        "Description": "It is the tournament that separates champions from mortals. It is the starting point for the careers of future legends and can be the final stop on the down escalator for fading stars. The annual PGA Tour Qualifying Tournament is one of the most grueling competitions in any sport. Every fall, veterans and talented hopefuls sweat through six rounds of hell at Q school, as the tournament is universally known, to get a shot at the PGA Tour, vying for the 30 slots available. The grim reality: If you don't make it through Q school, you're not on the PGA tour. You're out. And those who make it to the sixday finals are the lucky ones: hundreds more players fail to get through the equally grueling first two stages of the event. John Feinstein tells the story of the players who compete for these coveted positions in the 2005 Q school as only he can. With arresting accounts from the players, established winners, rising stars, the defeated, and the endlessly hopeful, America's favorite sportswriter unearths the inside story behind the PGA Tour's brutal all-ornothing competition.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "As a Lady Would Say: Responses to Life's Important and Sometimes Awkward Situations (Gentlemanners)",
        "Authors": "By Shade, Sheryl",
        "Description": "Have you ever been in a situation in which you were caught off guard, left speechless, or, worse yet, put your foot in your mouth?This easily accessible book focuses on those moments when knowing exactly what to say is both a challenge and important. From the light-hearted \"how to react when your boyfriend gives you a blender as a gift\" or \"what to say when you run into another lady at a party wearing exactly the same dress\" to the more serious \"what to say to a friend who has had a miscarriage or to a friend who has suffered the sudden death of a parent.\"As A Lady Would Say differs from other etiquette books. It not only offers suggestions for the correct thing to say in more than 100 social situations, but it gives humorous examples of the wrong thing to say as well. Saying the right thing requires a little logic, a bit of forethought, and a great deal of consideration for others. With the advice provided in this book, a lady will never need to stumble or stutter again.",
        "Category": " Reference , Etiquette",
        "Publisher": "Rutledge Hill Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Jesus Incident",
        "Authors": "By Herbert, Frank, Ransom, B.",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1980"
        }
    },
    {
        "Title": "The Best of Ideals",
        "Authors": "By Ideals Publications Inc",
        "Description": "Collects poems, stories, artwork, photographs, and articles from eight seasonal editions of Ideals",
        "Category": " Literary Criticism , General",
        "Publisher": "Ideals Childrens Books",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Black Lightning: A Novel",
        "Authors": "By Saul, John and Grey, Linda (EDT)",
        "Description": "John Saul knows how to make the blood run cold and the heart race wild with fear. Now the author of the New York Times bestsellers Creature and The Homing delivers a chilling novel of a convicted serial killer sentenced to death—and hell-bent on revenge.For five years Seattle journalist Anne Jeffers has pursued the horrifying story of a sadistic serial killer’s bloody reign, capture, trial, and appeal—crusading to keep the wheels of justice churning toward the electric chair. Now the day of execution has come. A convicted killer will meet his end. Anne believes her long nightmare is over. But she’s dead wrong. . . . Within days, a similar murder stuns the city. As the butcher stalks his next victims, creeping ever closer to her, Anne is seized by an icy unease, a haunting sense of connection to these unspeakable crimes. And, relentlessly, she hears the eerie echo of the dead man’s last words to her: “Today won’t end it. How will you feel, Anne? When I’m dead, and it all starts again, how will you feel?” In Black Lightning, John Saul strikes with a novel as electrifying as a jagged bolt from a pitch-dark sky, proving once again his inimitable genius for suspense.Praise for Black Lightning“His most effective thriller to date . . . [a] compelling read.”—The Seattle Times“Electrifyingly scary.”—San Jose Mercury News“One of Saul’s best.”—Publishers Weekly",
        "Category": " Fiction , Horror",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "The Sandy Bottom Orchestra",
        "Authors": "By Keillor, Garrison and Nilsson, Jenny Lind",
        "Description": "Rachel, a twelve-year-old girl with the most eccentric parents in town, wonders if playing her violin in the orchestra will sustain her through the summer",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "The Dead Sea Cipher",
        "Authors": "By Peters, Elizabeth",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Healthy Family Cookbook (Better Homes & Gardens)",
        "Authors": "By Better Homes and Gardens Books (EDT)",
        "Description": "",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Kitchen Wisdom: Harrowsmith's Sourcebook for Cooks",
        "Authors": "By Cross, Pamela",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Camden House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Fish and shellfish (Grill by the book)",
        "Authors": "By Weber and Sunset",
        "Description": "",
        "Category": "",
        "Publisher": "Sunset Pub. Corp",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "A Room of Her Own: Women's Personal Spaces",
        "Authors": "By Madden, Chris Casson",
        "Description": "Full-color photography and a charming text capture the special places that women have created as retreats from busy daily routines and offer creative and inspirational decorating ideas to help transform one's dream room into reality. 35,000 first printing. Tour.",
        "Category": " House & Home , Decorating",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Getting Divorced Without Ruining Your Life: A Reasoned, Practical Guide to the Legal, Emotional and Financial Ins and Outs of Negotiating a Divorce Settlement",
        "Authors": "By Margulies, Sam",
        "Description": "As a leading divorce negotiator and mediator, Sam Margulies has helped thousands of couples reach fair and amicable settlements. In this compassionate guide, now updated with vital information on changes in divorce law and norms, Margulies covers the legal, financial, and emotional realities of divorce in a straightforward, reassuring style. He takes readers through every step, from making the initial decision to finalizing the agreement, including:   Why mediation is now the preferred way to divorce How to avoid the conflicts that often occur after the divorce is over How to negotiate successfully even when you are angry How to manage step-family conflict in the aftermath of divorce   With examples drawn from real-life cases, Getting Divorced Without Ruining Your Life explains how to protect one's own interests and negotiate a stress-free, enduring agreement that allows both partners to embark on a new life.",
        "Category": " Family & Relationships , Divorce & Separation",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Barefoot: A Novel",
        "Authors": "By Hilderbrand, Elin",
        "Description": "Visiting Nantucket for the summer, three women seek peace  and comfort as they cope with the challenges in their lives--from  marriage, infidelity, and the mayhem of motherhood to scandal, tragedy,  and illness. Three women--burdened with small children, unwieldy straw hats, and some obvious emotional issues--tumble onto the Nantucket airport tarmac one hot June day. Vicki is trying to sort through the news that she has a serious illness. Her sister, Brenda, has just left her job after being caught in an affair with a student. And their friend Melanie, after seven failed in vitro attempts, is pregnant at last--but only after learning that her husband is having an affair. They have come to escape, enjoy the sun, and relax in Nantucket's calming air. But into the house, into their world, steps twenty-two-year-old Josh Flynn.Barefoot weaves these four lives together in a story with enthralling sweep and scope--a novel that is as fun and memorable and bittersweet as that one perfect day of summer.",
        "Category": " Fiction , Women",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Since You Asked: Answers to Women's Toughest Questions on Relationships (Women of Faith (Publishing Group))",
        "Authors": "By Meberg, Marilyn",
        "Description": "Questions . . .Where does a woman go with the questions that haunt her heart, questions that fester, beg for honest answers, and yearn for solutions to set them free? When hundreds of these questions poured in to Women of Faith® as a thunderous cry for help, Marilyn Meberg?popular Women of Faith® speaker and respected counselor?took on the task of responding to that cry.& Answers . . .In Since You Asked, Marilyn equips readers with the most reliable relationship information available?scriptural truths from the all-knowing source who created the very first human relationship. But she doesn't stop there; she helps to apply the scripture, providing practical steps of action that can be taken today.Be refreshed and set free by the warm, straightforward style that is Marilyn Meberg.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Paint Your House With Powdered Milk, and Hundreds More Offbeat Uses for Brand-Name Products",
        "Authors": "By Green, Joey",
        "Description": "With all new brand-name products and their wacky, alternative uses, Paint Your House with Powdered Milk exposes the secret lives of more than 30 popular household items - from Canada Dry Club Soda to Wrigley's Spearmint Gum.As you roam the supermarket aisles with household wizard Joey Green, you'll also learn the histories behind the products, how they got their names, strange facts about them, and the bizarre was they can be used.Jam-packed with hundreds of unusual uses for your favorite products, this delightfully quirky book is a great gift and a practical guide to solving life's everyday problems with everyday products.",
        "Category": " Humor , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Low Fat, Low Calorie, Low Cholesterol Light Cooking",
        "Authors": "By Publications International",
        "Description": "",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Publications International",
        "Price Starting With ($)": "8.6",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Cooking Light Low-Fat, Low-Calorie Quick & Easy Cookbook",
        "Authors": "By Cooking Light Magazine",
        "Description": "",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "The American Cancer Society's Healthy Eating Cookbook: A Celebration of Food, Friends, and Healthy Living",
        "Authors": "By Anthony, Margaret, Ed., Society, American Cancer",
        "Description": "",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Amer Cancer Society",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Better Homes and Gardens Cookies Cookies Cookies Any-Day Treats/Christmastime Treats",
        "Authors": "By Better Homes & Gardens",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Cookies",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Cactus Tracks and Cowboy Philosophy: Commentary by NPR's Cowboy Poet and Former Large-Animal Veterinarian",
        "Authors": "By Black, Baxter",
        "Description": "Described by The Washington Post as being able \"to make a dead man sit up and laugh,\" Baxter Black—veterinarian/doctor turned poet/columnist/raconteur—has been making living people laugh with his novel (Hey Cowboy, Wanna Get Lucky?), syndicated columns, appearances on The Tonight Show, and regular pieces on National Public Radio. Now this complete illustrated collection of the commentaries that have aired on NPR's Morning Edition presents Black's latest dose of medicine for animal and human alike. Ranging from a riotous account of two cowboys chasing down a cow in the nude to a very touching piece about a rancher who loses his wife to cancer and finds out the true worth of his friends and neighbors, Cactus Tracks & Cowboy Philosophy brings together Black's best-known and most adored work.",
        "Category": " Humor , Form , Essays",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Solomon's Choice: A Guide to Custody for Ex-Husbands, Spurned Partners, and Forgotten Grandparents",
        "Authors": "By Steinbreder, John and Kent, Richard G.",
        "Description": "Solomon's Choice will help \"disenfranchised\" parents and grandparents who are facing a battle over the custody of their children. Specifically addressing the needs of fathers, separated gay parents and grandparents, the book contains anecdotes from those who have both failed and succeeded in gaining custody of their children or grandchildren, as well as a list of the dos and don'ts of successfully waging a custody battle.",
        "Category": " Law , Family Law , Divorce & Separation",
        "Publisher": "Taylor Trade Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "City Chic: An Urban Girl's Guide to Livin' Large on Less",
        "Authors": "By Willdorf, Nina",
        "Description": "Urban Girls work hard and play even harder. They have an eye for style that is only slowed by a budgetary bottom line. They live the lifestyles of the not-at-all-rich and the not-just-yet-famous. Soon enough, they will be superstars, oozing savoir-faire. But for now, before they assume the helm of the boardroom table, they still have their secret ways of living the good life. City Chic is a practical, insiders' primer on how to squeeze the most style out of a small salary, how to creatively cheat at looking chic for cheap. From food and drink to personal maintenance to clothes to home décor, City Chic covers everything an Urban Girl needs to know.--Big-idea decorating for small spaces--Financially sound fitness techniques--Cash-saving culinary tips--Shopping sales calendars-by day, month and season--and so much more!",
        "Category": " Self-help , General",
        "Publisher": "Sourcebooks Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "New History of Spanish Literature",
        "Authors": "By Chandler, Richard E. and Kessel Schwartz",
        "Description": "",
        "Category": "",
        "Publisher": "Louisiana State University Press",
        "Price Starting With ($)": "6.81",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Creme de la Femme: The Best of Contemporary Women's Humor",
        "Authors": "By Dalin, Anne Safran (EDT) and Davis, Nancy (EDT)",
        "Description": "This delightful anthology of the best of contemporary women's humor will entertain you, sustain you, and provide hours of reading pleasure. Inside you'll find witticisms in many flavors: essays, short stories, poetry, songs, and cartoons - all from the pens of some of America's most popular and engaging female writers, actresses, authors, and activists.Arranged thematically into topics like politics, equal rights, relationships, men, family, and aging, you'll find humor ranging from the ironic to the sublime. In addition, all this funny business is for a good cause - all royalties and a percentage of the proceeds will be donated to The American Foundation for AIDS Research (AmFAR), the National Coalition Against Domestic Violence, and the Susan G. Komen Breast Cancer Foundation.",
        "Category": " Humor , General",
        "Publisher": "Random House Reference",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "The Girlfriends' Guide to Baby Gear: What to Buy, What to Borrow, and What to Blow Off! (Girlfriends' Guides)",
        "Authors": "By Iovine, Vicki and Rosen, Peg",
        "Description": "WHO KNEW BABIES NEEDED SO MANY ACCESSORIES?  It’s official. You’re pregnant. Get used to the fact that life is never going to be the same. And break out the credit card, because that little bundle of joy is going to cost you. The list seems endless—from car seats to changing pads. But don’t despair. The Girlfriends are here to take some of the guesswork out of shopping for baby-to-be. We’ll tell you when to skimp and when to splurge, and which hand-me-downs are safe and which are sorry. You’ll get advice on… Where to get what you needCrib and car seat do’s and don’tsWardrobe musts and misses—for mother and childStocking the nursery and the rest of the houseWhat every new mom should have on hand for herselfThe Master Shopping List—don’t leave home without it!Plus the Top 10 Things to Do for Yourself Before the Baby Arrives, the Top 10 Baby Items You Won’t Find at a Baby Store, the Top 10 Best—and Worst—Things to Borrow, the Top 10 Signs of a First-Time Mom, and more…",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Raising America: Experts, Parents, and a Century of Advice About Children",
        "Authors": "By Hulbert, Ann",
        "Description": "In this inquiry into America's preoccupation with raising children, Ann Hulbert blends biography and critical analysis to probe the personal dramas, the scientific claims, and the social visions of a succession of experts who during the twentieth century aimed to make a science of child rearing. She describes how these pediatricians and psychologists came to be popular advisers, and explores the origins and outcome of their ambitious quest to predict and perfect children's futures, and to solve the dilemmas of modern mothers and of families in flux.Raising America is an account of how a hundred years of expert advice clearly failed to ease modern child-raising anxieties. It makes clear that the advisers, with their shifting formulas and dogmas, in fact proved to be unnerving. Yet as their stories reveal, they have also been enlightening, holding up an intimate mirror to the rising social and psychological expectations and tensions of an unsettled century.",
        "Category": " Social Science , Sociology , Marriage & Family",
        "Publisher": "Knopf",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Spider-Man 2: Spider-Man versus Doc Ock (Festival Readers)",
        "Authors": "By Figueroa, Acton, Redondo, Jesus (ILT), and Vasquez, Ivan (ILT)",
        "Description": "There is a new villain in town and his name is Doc Ock. With four long and scary tentacles, he is a force to be reckoned with, even for Spider-Man. Will our web-crawling hero be able to stop Doc Ock before it's too late?",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperColl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Vegetarian Cooking (Rd Home Handbooks)",
        "Authors": "By Brown, Sarah (EDT)",
        "Description": "A guide to vegetarian cooking features recipes from many different countries; information on main sources of protein, fiber, vitamins, minerals, fats, and carbohydrates in foods; and facts on recommended daily intakes for average adults. Original. 25,000 first printing.",
        "Category": " Cooking , Vegetarian",
        "Publisher": "Reader's Digest Association",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "The Moon Seems to Change (Let's-Read-and-Find-Out Science 2)",
        "Authors": "By Emberley, Ed (ILT), Branley, Franklyn Mansfield, and Emberley, Barbara (ILT)",
        "Description": "Can you see the moon?Does it look like a big round ball? Or is it just a sliver of light in the sky? The moon seems to change. But it doesn&#39;t really. The moon revolves around the Earth. It takes about four weeks to make the journey, and as it travels round we can only see certain parts of it. Try the simple experiment described inside using an orange, a pencil, and a flashlight, and you&#39;ll understand why the moon seems to change.",
        "Category": " Juvenile Nonfiction , Science & Nature , Astronomy",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Food Enzymes: Missing Link to Radiant Health",
        "Authors": "By Santillo, Humbart",
        "Description": "",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Lotus Press",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Mouvar's Magic (Kelvin of Rud)",
        "Authors": "By Anthony, Piers and Margroff, Robert E.",
        "Description": "The mysterious prophecy that has shaped the life of Kelvin Knight Hackleberry and his family seems nearly to have run its course. The Two Kingdoms that were joined by Kelvin to form Kelvinia have now been united with three others, to make a great confederation under the rule of the young twin kings, Kildom and Kildee. Kelvin has earned some time to rest with his family. Charles and Merlain are now twenty years old, and so is Dragon Horace, their brother who is the Great King of all the land.But the clouds of the last battle are gathering. The evil Professor DeVale and his witch servant Zady had been foiled in their attempt to destroy Kelvin by using his children--their evil plot has led to a stronger, more peaceful land under its rightful rulers. Now they will try one last time to pervert all that is good in the universe of the frames--and although the Prophecy of Mouvar has been accurate up to now, still there is a chance that evil will prevail.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Becoming a Treasured Teacher",
        "Authors": "By Capehart, Jody",
        "Description": "",
        "Category": " Education , General",
        "Publisher": "Victor Books",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "A Pony's Tale (My Little Pony)",
        "Authors": "By Huelin, Jodi and Edwards, Ken (ILT)",
        "Description": "It's time for this year's Pony Play! Cotton Candy is the director, and she might be working a little too hard to make the play perfect. Luckily, she realizes that a little help from her friends is just what it takes to put on the best show ever!",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Festival",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Virus of the Mind: The New Science of the Meme",
        "Authors": "By Brodie, Richard",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Integral Pr",
        "Price Starting With ($)": "5.22",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "A Man Rides Through",
        "Authors": "By Donaldson, Stephen R.",
        "Description": "",
        "Category": "",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "The DaVinci Code: A Quest for Answers",
        "Authors": "By McDowell, Josh",
        "Description": "",
        "Category": "",
        "Publisher": "Green Key Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Secrets, Lies, Betrayals: The Body/Mind Connection",
        "Authors": "By Scarf, Maggie",
        "Description": "Explains how the human body stores painful events in its neurobiological system, producing bodily symptoms such as headaches, fatigue, and mood swings, as well as unhealthy repetitive ways of relating, and offers a look at new power therapies that can reprocess these memories out of the body. 50,000 first printing.",
        "Category": " Psychology , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Soultypes: Finding the Spiritual Path That is Right for You",
        "Authors": "By Kise, Jane A. G. and Hirsh, Sandra Krebs",
        "Description": "A handbook on using the widely respected Myers-Briggs Type Indicator, usually used to aid in career choices and conflict resolution, shows how this psychological theory can be helpful in the quest for spiritual fulfillment as well. Original. 50,000 first printing.",
        "Category": " Religion , Spirituality",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Dove in the Window (Benni Harper Mystery)",
        "Authors": "By Fowler, Earlene",
        "Description": "Benni and her relatives and friends are gathered for the family's annual barbecue and cattle roundup. Among the guests is Shelby Johnson, a young photography student from a wealthy Chicago family. In Benni she finds a favorite subject and a new friend. But when the young woman's body is discovered on the ranch the next morning, Benni's closest relatives suddenly develop into prime murder suspects...",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Happy Alphabet! A Phonics Reader (Step-Into-Reading, Step 1)",
        "Authors": "By Mathieu, Joseph (ILT) and Hays, Anna Jane",
        "Description": "A string of wacky people, animals, and objects, each beginning with a different letter of the alphabet, gather to celebrate a birthday! Each page presents a letter of the alphabet, and every phrase rhymes with the next to help beginning readers anticipate words!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Junie B. Jones Is Captain Field Day (Junie B. Jones, No. 16)",
        "Authors": "By Brunkus, Denise (ILT) and Park, Barbara",
        "Description": "“Hilarious. Barbara Park makes reading fun.” —Dav Pilkey, author of Dog Man Barbara Park’s #1 New York Times bestselling chapter book series, Junie B. Jones, has been keeping kids laughing—and reading—for more than twenty-five years. Over 65 million copies sold!   Meet the World’s Funniest Kindergartner—Junie B. Jones! Afternoon kindergarten is having a field day, and Junie B. Jones is team captain! Only, here’s the problem. Room Eight keeps on winning too many events. And so how will Room Nine ever become the kindergarten champions? As Captain Field Day, will Junie B. find a way to lead her team to victory? Or will it be up to someone else to save the day?   USA Today: “Junie B. is the darling of the young-reader set.”   Publishers Weekly: “Park convinces beginning readers that Junie B.—and reading—are lots of fun.”    Kirkus Reviews: “Junie’s swarms of young fans will continue to delight in her unique take on the world. . . . A hilarious, first-rate read-aloud.”    Time: “Junie B. Jones is a feisty six-year-old with an endearing penchant for honesty.”",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Everyday Sacred: A Woman's Journey Home",
        "Authors": "By Bender, Sue",
        "Description": "Returning home from the Amish, Bender struggled to apply the peaceful wisdom and simplicity she learned from them to her hectic life. Then one day she heard the story of the begging bowl and instinctively knew it had much to teach her: each day a Zen monk goes out with an empty bowl in his hands; whatever is placed in the bowl will be his nourishment for the day. So, too, Bender discovered, if we approach each day afresh, with our bowls waiting to be filled, we will find at the end of that day that extraordinary things - some so small we may be tempted to overlook them - have come our way.Everyday Sacred is filled with the stories, the people, and the experiences that filled Bender's bowl - a \"connect-the-dots record of my search for the sacred in everyday life.\" From the simple act of clearing off her desk to enjoying a perfectly prepared cappuccino to realizing she can only do three of the thirteen things on her to-do list, Bender finds that each step along one's journey is a place to learn.",
        "Category": " Religion , Meditations",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Elmo Says Achoo! (Step-Into-Reading, Step 1)",
        "Authors": "By Albee, Sarah and Brannon, Tom (ILT)",
        "Description": "Elmo's bringing a present to Oscar. But the mysterious wrapped gift has a curious effect--it's making Elmo sneeze! And every time Elmo sneezes, something funny happens. Toddlers will love following along when Elmo's sneezes cause laundry to fall off its line and much more in this Early Step into Reading™ story.",
        "Category": " Juvenile Fiction , Health & Daily Living , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Bats at the Beach (A Bat Book)",
        "Authors": "By Lies, Brian (ILT) and Lies, Brian",
        "Description": "Quick, call out! Tell all you can reach: the night is just perfect for bats at the beach!    So pack your buckets, banjos, and blankets—don’t forget the moon-tan lotion—and wing with this bunch of fuzzy bats to where foamy sea and soft sand meet.     Brian Lies’s enchanting art and cheery beachside verse will inspire bedtime imaginations again and again. Come visit a bedazzling world of moonlight, firelight, and . . . bats!",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Robots and Empire (Starring R. Daneel Olivaw, No. 4)",
        "Authors": "By Asimov, Isaac",
        "Description": "Chronicles the final attempt of Spacer ringleader Kendrel Amadiro to destroy Earth",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Del Rey Books",
        "Price Starting With ($)": "27.83",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Overblown: How Politicians and the Terrorism Industry Inflate National Security Threats, and Why We Believe Them",
        "Authors": "By Mueller, John E.",
        "Description": "Why have there been no terrorist attacks in the United States since 9/11? It is ridiculously easy for a single person with a bomb-filled backpack, or a single explosives-laden automobile, to launch an attack. So why hasn't it happened? The answer is surely not the Department of Homeland Security, which cannot stop terrorists from entering the country, legally or otherwise. It is surely not the Iraq war, which has stoked the hatred of Muslim extremists around the world and wasted many thousands of lives. Terrorist attacks have been regular events for many years -- usually killing handfuls of people, occasionally more than that. Is it possible that there is a simple explanation for the peaceful American homefront? Is it possible that there are no al-Qaeda terrorists here? Is it possible that the war on terror has been a radical overreaction to a rare event? Consider: 80,000 Arab and Muslim immigrants have been subjected to fingerprinting and registration, and more than 5,000 foreign nationals have been imprisoned -- yet there has not been a single conviction for a terrorist crime in America. A handful of plots -- some deadly, some intercepted -- have plagued Europe and elsewhere, and even so, the death toll has been modest.We have gone to war in two countries and killed tens of thousands of people. We have launched a massive domestic wiretapping program and created vast databases of information once considered private. Politicians and pundits have berated us about national security and patriotic duty, while encroaching our freedoms and sending thousands of young men off to die.It is time to consider the hypothesis that dare not speak its name: we have wildly overreacted. Terrorism has been used by murderous groups for many decades, yet even including 9/11, the odds of an American being killed by international terrorism are microscopic. In general, international terrorism doesn't do much damage when considered in almost any reasonable context.The capacity of al-Qaeda or of any similar group to do damage in the United States pales in comparison to the capacity other dedicated enemies, particularly international Communism, have possessed in the past. Lashing out at the terrorist threat is frequently an exercise in self-flagellation because it is usually more expensive than the terrorist attack itself and because it gives the terrorists exactly what they are looking for. Much, probably most, of the money and effort expended on counterterrorism since 2001 (and before, for that matter) has been wasted.The terrorism industry and its allies in the White House and Congress have preyed on our fears and caused enormous damage. It is time to rethink the entire enterprise and spend much smaller amounts on only those things that do matter: intelligence, law enforcement, and disruption of radical groups overseas. Above all, it is time to stop playing into the terrorists' hands, by fear-mongering and helping spread terror itself.",
        "Category": " Political Science , Political Freedom & Security , International Security",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "New Jewish Wedding, Revised",
        "Authors": "By Diamant, Anita",
        "Description": "The Definitive, Completely Up-to-Date Guide to Planning a Jewish Wedding  Since its original publication in 1986, The New Jewish Wedding has become required reading, assigned to engaged couples by Conservative, Reform, and Reconstruc-tionist rabbis alike. In this new revision, Anita Diamant, one of the most respected writers of guides to Jewish life, continues to offer step-by-step guidance to planning the ceremony and the party that follows -- from hiring a rabbi and wording the invitation to organizing a processional and hiring a caterer. She also includes:   A new chapter focusing on converts, non-Jews, and same-sex couples Essential Web sites All new art, with examples of ketubot, invitations, and other wedding paraphernalia New poems and new translations of the seven wedding blessings   Complete, authoritative, and indispensable, The New Jewish Wedding is a must-have resource for anyone who wants a wedding that combines spiritual meaning and joyous celebration.",
        "Category": " Reference , Weddings",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "The Progress Paradox: How Life Gets Better While People Feel Worse",
        "Authors": "By Easterbrook, Gregg",
        "Description": "aIn The Progress Paradox, Gregg Easterbrook draws upon three decades of wide-ranging research and thinking to make the persuasive assertion that almost all aspects of Western life have vastly improved in the past century--and yet today, most men and women feel less happy than in previous generations. Why this is so and what we should do about it is the subject of this book.Between contemporary emphasis on grievances and the fears engendered by 9/11, today it is common to hear it said that life has started downhill, or that our parents had it better. But objectively, almost everyone in today’s United States or European Union lives better than his or her parents did.Still, studies show that the percentage of the population that is happy has not increased in fifty years, while depression and stress have become ever more prevalent. The Progress Paradox explores why ever-higher living standards don’t seem to make us any happier. Detailing the emerging science of “positive psychology,” which seeks to understand what causes a person’s sense of well-being, Easterbrook offers an alternative to our culture of crisis and complaint. He makes a Compelling case that optimism, gratitude, and acts of forgiveness not only make modern life more fulfilling but are actually in our self-interest. Seemingly insoluble problems of the past, such as crime in New York City and smog in Los Angeles, have proved more tractable than they were thought to be. Likewise, today’s “impossible” problems, such as global warming and Islamic terrorism, can be tackled too.Like The Tipping Point, this book offers an affirming and constructive way of seeing the world anew. The Progress Paradox will change the way you think about your place in the world, and about our collective ability to make it better.",
        "Category": " Social Science , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Fat Albert: Gonna Have a Good Time! (Festival Readers)",
        "Authors": "By Cosby, Bill, Figueroa, Acton, and Kipps, Charles",
        "Description": "Meet Fat Albert and his friends: Rudy, Old Weird Harold, Bucky, Mushmouth, Dumb Donald, and Bill. Fat Albert and the boys are going to a party with their new friend Doris! But Doris thinks a trip to the mall is in order first. An average afternoon turns into an adventure when the boys start exploring.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Amistad",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Ghost Canoe",
        "Authors": "By Hobbs, Will",
        "Description": "After a sailing ship breaks up on the rocks off Washington's storm-tossed Cape Flattery, Nathan McAllister, the fourteen-year-old son of the lighthouse keeper, refuses to believe the authorities, who say there were no survivors. Unexplained footprints on a desolate beach, a theft at the trading post, and glimpses of a wild \"hairy man\" convince Nathan that someone is hiding in the remote sea caves along the coast. With his new friend, Lighthouse George, a fisherman from the famed Makah whaling tribe, Nathan paddles the fierce waters of the Pacific--fishing, hunting seals, searching for clues. Alone in the forest, Nathan discovers a ghostly canoe and a skeleton that may unlock the mystery of ancient treasure, betrayal . . .and murder.   2000-2001 Georgia's Picture Storybook Award & Georgia's Children's Book Award Masterlist 01-02 Land of Enchantment Book Award Masterlist (Gr. 6-9)",
        "Category": " Young Adult Fiction , Historical , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "The Ultimate Guide to Good Clean Humor: Your Resource for Good Clean Fun (Ultimate Guide Series)",
        "Authors": "By Brunsting, Bernard",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "It's Called a Breakup Because It's Broken: The Smart Girl's Break-Up Buddy",
        "Authors": "By Behrendt, Greg and Ruotola-Behrendt, Amiira",
        "Description": "There’s no doubt about it—breakups suck. But in the first few hours or days or weeks that follow, there’s one important truth you need to recognize: Some things can’t and shouldn’t be fixed, especially that loser who dumped you or forced you to dump him. It’s over for a reason, and deep down inside you probably know what that reason is. It’s called a breakup because it’s broken, and starting today, you’re not the kind of woman who settles for broken, or hangs on to damaged goods, be it a radio, a pair of shoes, or a relationship. It’s time to get rid of all the broken stuff you’ve been lugging around for days, months, and maybe even years, and make the bold decision to start looking for stuff that works! Because the longer you stay stuck in a dead-end relationship, the less time you get on this planet to experience a great one. So open up this book, and let’s dive in—our goal is to help you turn your breakup into the event that changes your life for the better in ways you never dreamed possible.The co-author of the smash two-million copy bestseller He’s Just Not That Into You, Greg Behrendt knows that the one thing harder than realizing he’s not that into you is finding the courage to walk away from the relationship. But Greg and his co-author and wife, Amiira, also know that there’s a flip side to every breakup: As dark as everything seems right now, this could be the single best thing that’s ever happened to you.It’s Called a Breakup Because It’s Broken is the ultimate survival guide to getting over Mr. Wrong and reclaiming your inner Superfox. From how to put yourself through “he-tox,” to how to throw yourself a kick-ass pity party, Greg and Amiira share their hilarious and helpful roadmap for getting past the heartache and back into the game. They give advice on:•Why you shouldn’t call him—and what he’s thinking when you do•How to keep your friends and not lose your job•How to avoid breakup pitfalls: IMing, stalking, having sex with your ex•Reframing reality—seeing the relationship for what it was•How to transform yourself into a hot, happening Superfox and get a jump on the better, brighter future that awaitsIt’s Called a Breakup Because It’s Broken gives you everything you need to get over him and make the right decisions along the way. Complete with an essential workbook to help you put the crazy down on paper and not take it out into the world, this is a straight-talking, spot-on, must-have manual for finding your way back to an even more rocking you.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Broadway",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Love Potion (Abracadabra No. 2 / A Bantam-Skylark Book)",
        "Authors": "By Becker, Eve",
        "Description": "In order to improve Dawn's sister's love life, Dawn and her cousin Jennifer create a love potion, but problems ensue when the potion somehow gets into the faculty lounge and all the teachers become lovesick",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Girls Night In",
        "Authors": "By Mlynowski, Sarah (EDT), Manby, Chris (EDT), and Henderson, Lauren (EDT)",
        "Description": "Featuring contributions by Jennifer Weiner, Meg Cabot, Sophie Kinsella, Marian Keyes, and Sarah Mlynowski, this unrivaled collection of twenty-one short stories is filled with unforgettable characters that learn to grow up, move on, and get their lives back on track. Original. 100,000 first printing.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Red Dress Ink",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Men-of-War: Life in Nelson's Navy",
        "Authors": "By O'Brian, Patrick",
        "Description": "This book is a companion to Patrick O'Brian's sea novels, a straightforward exploration of what daily life in Nelson's navy was really like, for everyone from the captain down to the rawest recruit. What did they eat? What songs did they sing? What was the schedule of watches? How were the officers and crew paid, and what was the division of prize-money?These questions and many more are answered in Patrick O'Brian's elegant narrative, which includes wonderful anecdotal material on the battles and commanders that established Britain's naval supremacy. Line drawings and charts help us to understand the construction and rigging of the great ships, the types and disposition of the guns, and how they were operated in battle. A number of contemporary drawings and cartoons illustrate aspects of naval life from the press gang to the scullery. Finally, a generous selection of full-color paintings render the majesty and the excitement of fleet actions in the age of fighting sail.",
        "Category": " History , Military , Naval",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Dearest Debbie (In Ai Lee)",
        "Authors": "By Dale Evans Rogers",
        "Description": "",
        "Category": "",
        "Publisher": "Spire Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Big Bird and Little Bird's Book of Big and Little",
        "Authors": "By Kingsley, Emily P.",
        "Description": "",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Vocabulary Workshop: Level G Enhanced Edition",
        "Authors": "By Shostak, Jerome",
        "Description": "",
        "Category": " Young Adult Nonfiction , Language Arts , Vocabulary & Spelling",
        "Publisher": "William H Sadlier",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Sex and the Seasoned Woman: Pursuing the Passionate Life",
        "Authors": "By Sheehy, Gail",
        "Description": "A seasoned woman is spicy. She has been marinated in life experience. . . . She can be alternately sweet, tart, bubbly, mellow. She can be maternal and playful. Bossy and submissive. Strong and soft. . . . The seasoned woman knows who she is. She could be any one of us, as long as she is committed to living fully and passionately in the second half of life.In her most groundbreaking work since Passages and The Silent Passage, bestselling author Gail Sheehy reveals a hidden cultural phenomenon–increased vitality in women’s sex and love lives after fifty. Sex and the Seasoned Woman is the story of an intimate revolution taking place under our very noses. Boomer generation women in midlife are open to sex, love, dating, new dreams, exploring spirituality, and revitalizing their marriages as never before. This is a new universe of passionate, liberated women–married and single–who are unwilling to settle for the stereotypical roles of middle age and are now realizing they don’t have to. As life spans grow longer and as societal constraints continue to loosen, older women–once free of the exhausting demands of young children, needy husbands, and demanding careers–find themselves ready to pursue the passionate life. They embrace their “second adulthood” as a period of reawakening.Written in Sheehy’s singularly compelling style, combining interviews and research, this book gives voice to more than a hundred fascinating and colorful women. The inspiring stories tell of wives who reinvigorate their marriages after their children leave the nest as well as divorced, widowed, and long-single women who find new dreams and new loves. Sheehy delineates a crucial link between cultivating a new dream and reopening the pathway to intimacy and sexual pleasure. She also examines the latest medical breakthroughs addressing symptoms that have unnecessarily curtailed women’s sex lives.From women who find their sexuality reawakened by a younger lover, to couples whose marriages survive health crises and grow stronger, to women who finally find a soulmate in their sixties, to stories from seasoned sirens in their seventies, eighties, and even nineties, these portraits cover an enormous range of experience. In them, Sheehy locates the universal patterns that enable us all to recognize and understand our own lives.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Arab Mind",
        "Authors": "By Patai, Raphael",
        "Description": "An in-depth analysis of Arab society discusses the impact of Arab cultural and psychological characteristics on women's rights, literacy, economics, relations between Arab nations, and the ability to integrate western knowledge and skills",
        "Category": " Social Science , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1983"
        }
    },
    {
        "Title": "Betsy-Tacy and Tib (Betsy-Tacy, 2)",
        "Authors": "By Lovelace, Maud Hart, Lenski, Lois (ILT), and Lenski, Lois",
        "Description": "Three of a KindBetsy and Tacy are best friends. Then Tib moves into the neighborhood and the three of them start to play together. The grown-ups think they will quarrel, but they don't. Sometimes they quarrel with Betsy's and Tacy's bossy big sisters, but they never quarrel among themselves.They are not as good as they might be. They cook up awful messes in the kitchen, throw mud on each other and pretend to be beggars, and cut off each other's hair. But Betsy, Tacy, and Tib always manage to have a good time.Ever since their first publication in the 1940s, the Betsy-Tacy stories have been loved by each generation of young readers.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "MI",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "The Speech Chain: The Physics and Biology of Spoken Language",
        "Authors": "By Denes, Peter B.",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Armchair Economist: Economics & Everyday Life",
        "Authors": "By Landsburg, Steven E.",
        "Description": "Witty economists are about as easy to find as anorexic mezzo-sopranos, natty mujahedeen, and cheerful Philadelphians. But Steven E. Landsburg...is one economist who fits the bill. In a wide-ranging, easily digested, unbelievably contrarian survey of everything from why popcorn at movie houses costs so much to why recycling may actually reduce the number of trees on the planet, the University of Rochester professor valiantly turns the discussion of vexing economic questions into an activity that ordinary people might enjoy. -- Joe Queenan, The Wall Street Journal  The Armchair Economist is a wonderful little book, written by someone for whom English is a first (and beloved) language, and it contains not a single graph or equation...Landsburg presents fascinating concepts in a form easily accessible to noneconomists. -- Erik M. Jensen, The Cleveland Plain Dealer  ...enormous fun from its opening page...Landsburg has done something extraordinary: He has expounded basic economic principles with wit and verve. -- Dan Seligman, Fortune",
        "Category": " Business & Economics , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The Lamorna Wink",
        "Authors": "By Grimes, Martha",
        "Description": "After taking up residence in an old Cornish manor, Melrose Plant is quickly drawn into a mystery involving the disappearance of his beloved aunt, but when corpses begin surfacing all over the English countryside, Richard Jury will have to step in to sort out the mess. Reprint.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Slave Ship",
        "Authors": "By Pohl, Frederik",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine,",
        "Price Starting With ($)": "5.78",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Why the Resurrection?",
        "Authors": "By Laurie, Greg",
        "Description": "",
        "Category": "",
        "Publisher": "Tyndale",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The American sportsman treasury",
        "Authors": "By MASON, Jerry (editor)",
        "Description": "",
        "Category": "",
        "Publisher": "Alfred A Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The Atlantic campaign: World War II's great struggle at sea",
        "Authors": "By Van Der Vat, Dan",
        "Description": "The battle for the Atlantic was one the Allies could not afford to lose. Hence it was fought with a tenacity more common on a Pacific beach-head. This is a brilliantly written account of the Allies' most critical campaign. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    }
]