[
    {
        "Title": "Blueprint for Life (Journey Through the Mind and Body)",
        "Authors": "By Time-Life Books",
        "Description": "Discusses heredity, genetic traits, DNA, aging, viruses, genetic screening, the Human Genome Project, and identical twins separated at birth",
        "Category": " Science , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Exploring America's Historic Places",
        "Authors": "By National Geographic Society (U. S.) (COR), Kostyal, K. M., Thybony, Scott, and Allen, Leslie",
        "Description": "",
        "Category": " History , United States , State & Local , General",
        "Publisher": "Natl Geographic Society",
        "Price Starting With ($)": "5.65",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Grand Slam: Golf's Major Championships",
        "Authors": "By Michael Williams",
        "Description": "",
        "Category": "",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Guide to Economic Indicators",
        "Authors": "By Frumkin, Norman",
        "Description": "This is a reference book for economists and the general public on over sixty statistical indicators of the U.S. economy prepared by government and private organizations.It provides quick and reliable explanations of the attributes and analytical uses of the indicators for business and professional people, journalists, government officials, students, and citizens interested in economic developments.The indicators are arranged alphabetically, so that the reader can quickly search for a specific entry to find its meaning, content, methodology, accuracy, relevance, recent trends, and historical data.The Guide to Economic Indicators, Second Edition is a companion volume to the author's best-selling Tracking America's Economy, Second Edition, 1992.",
        "Category": " Business & Economics , Forecasting",
        "Publisher": "Routledge",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "The Little Mac Book",
        "Authors": "By Williams, Robin and Nelson, Kay Yarborough",
        "Description": "A thoroughly revised edition of the classic Macintosh reference offers readers quick, easy access to the Macintosh environment. Original.",
        "Category": "",
        "Publisher": "Peachpit Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Total Recall: How to Maximize Your Memory Power",
        "Authors": "By Minninger, Joan",
        "Description": "",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "MJF Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "The Woman Who Walked on Water",
        "Authors": "By Tuck, Lily",
        "Description": "The Woman Who Walked on Water is a beautifully crafted, dark fable, the story of a woman's search for meaning, from the author of The Double Life of Liliane.Adele leaves her comfortable life in Connecticut for India, to follow a guru she has met in Chartres Cathedral. Her departure confounds her family and neighbors: Adele is beautiful; she is lucky; she possesses charisma; she is a champion swimmer whose stamina and grace astound the patrons of the exclusive resort in the Caribbean that her family visits each year. Adele's husband cannot understand what the Indian guru - an elusive, ever-changing man who indeed seems privy to some of life's mysteries - can give Adele that he cannot. Her two children worry as she grows gaunt and begins to look older than her years, and as her letters arrive less and less frequently. As we watch Adele's deepening spirituality, The Woman Who Walked on Water compellingly gives life to the writings of Rumi, Laotzu, and the Upanishads, which infuse this work with their wisdom. Yet what also emerges is a troubling portrait of a woman alone in a foreign country, surrounded by a family and culture not her own, in a dry and dusty city. Lily Tuck portrays with acumen, pathos, and humor a woman who may have found enlightenment. She also leaves us questioning Adele's fate, and our own desires for transcendence.",
        "Category": " Fiction , Literary",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "The Dignity of Danger: A Novel of the Pacific War",
        "Authors": "By Meade, Everard",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Burning Gate Pr",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "The Case of the Glacier Park Swallow: Juliet Stone Mystery #2",
        "Authors": "By Anastasio, Dina",
        "Description": "When veterinary student Juliet Stone stumbles upon an injured sparrow that has been drugged and lacks the strength to continue its winter migration, she suddenly discovers that she holds the key to an international drug-smuggling scheme. Original.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Roberts Rinehart",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "The Golden Age of Sail (Golden Age of Transportation)",
        "Authors": "By Handy, Amy",
        "Description": "",
        "Category": " History , Reference",
        "Publisher": "Todtri Book Pub",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "The Cosby Wit: His Life and Humor/09896",
        "Authors": "By Adler, Bill",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "Carroll & Graf Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "The Final Days: The Last, Desperate Abuses of Power by the Clinton White House",
        "Authors": "By Olson, Barbara",
        "Description": "Olson turns her razor sharp vision on the Clintons' shocking excesses in their final days of office: the outrageous pardons to political cronies and friends, the looting of the White House, the executive orders that were sheer abuses of presidential power, the presidential library that is becoming a massive boondoogle of vanity more appropriate for a Third World dictator, and much more.",
        "Category": " Political Science , History & Theory",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "THREAD OF LIFE: The Smithsonian Looks at Evolution",
        "Authors": "By Lewin, Roger",
        "Description": "Traces the origin and development of plants and animals, recounts how Darwin worked out the theory of evolution, and reviews modern discoveries related to evolutionary theory",
        "Category": " Science , General",
        "Publisher": "Smithsonian Books",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "The melting pot: The variety of American ethnic cooking",
        "Authors": "By Maria Gitin",
        "Description": "",
        "Category": "",
        "Publisher": "Crossing Press",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Saving Work",
        "Authors": "By Chopp, Rebecca S.",
        "Description": "One of the most significant changes in theological education during the past two decades has been a dramatic rise in the enrollment of women in the seminaries. In this ground-breaking book, Rebecca Chopp explores the impact these new voices are having on theological education. She looks at how women and men are actually forming a new Christian praxis through their engagement with feminist practices and thought that often exist outside the sphere of official recognition. This important book will be a starting point for dialogue about the role theological education will play as this new Christian praxis emerges.",
        "Category": " Religion , Theology",
        "Publisher": "Westminster John Knox Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Presumed Dead",
        "Authors": "By Holton, Hugh",
        "Description": "A tough Chicago cop, Commander Larry Cole thinks he is prepared for anything, until a drug bust goes sour, he learns of a series of mysterious disappearances, and he falls for Edna, his new back-up. A first novel. Tour.",
        "Category": " Fiction , General",
        "Publisher": "Forge",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "The Two Duchesses:  The Sexual and Dynastic Intrigues of Two Bewitching English Aristocrats in a Time of Unbridled Extravagance and License",
        "Authors": "By Calder-Marshall, Arthur",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row Publishers",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "On the front burner: Issues in U.S. foreign policy",
        "Authors": "By Brown, Seyom",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "The Bread Machine Bakery Book",
        "Authors": "By Langer, Richard W. and McNeill, Susan (ILT)",
        "Description": "A guide to baking bread with the new electronic bread machines features sixty recipes for basic, multigrain, whole grain, herb, savory, fruit and vegetable, sweet, ethnic, and baking-powder breads",
        "Category": " Cooking , Courses & Dishes , Bread",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "If I'd Killed Him When I Met Him...",
        "Authors": "By McCrumb, Sharyn",
        "Description": "For forensic anthropologist Elizabeth MacPherson, solving mysteries hardly seems the fun it used to be - even if she is the official private investigator for her brother Bill's fledgling Virginia law firm. Then Bill and his feminist firebrand partner, A. P. Hill, take on two complex cases that will require Elizabeth's special participation.Eleanor Royden, a perfect lawyer's wife for twenty years, has shot her ex-husband and his beautiful late-model wife in cold blood. And Donna Jean Morgan finds herself married to a Bible-thumping bigamist who has the nerve to die in circumstances that implicate his wife. A. P. does her damnedest for Eleanor, an abused wife in denial, and Bill gallantly defends Donna Jean. Meanwhile, Elizabeth's forensic expertise, including her special knowledge of poisons, gives her the most challenging case of her career.As questions of wife abuse and abandonment emerge in the court of public opinion, Elizabeth becomes a war correspondent in the battle of the sexes - a battle as old as the hills and unlikely to reach a truce any time soon....",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Girls' Poker Night",
        "Authors": "By Davis, Jill",
        "Description": "Dissatisfied both with writing a \"Single Girl on the Edge/Ledge/Verge\" lifestyle column and with her boyfriend (who has a name for his car and compulsively collects plastic bread ties), Ruby Capote sends her best columns and a six-pack of beer to the editor of The New York News and lands herself a new job in a new city.In New York, Ruby undertakes the venerable tradition of Poker Night - a way (as men have always known) to eat, drink, smoke, analyze, interrupt one another, share stories, and, most of all, raise the stakes. There's Skorka, model by profession, homewrecker by vocation; Jenn, willing to cross county lines for true love; Danielle, recently divorced, seducer of at least one father/son combo in her quest to make up for perceived \"missed opportunities.\"When Ruby falls for her boss, Michael, all bets are off. He's a challenge. He's her editor. And he wants her to stop being quippy and clever and become the writer - and the woman - he knows she can be.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "The Random House Book of Scented Plants (Garden Plant)",
        "Authors": "By Phillips, Roger and Rix, Martyn",
        "Description": "Featuring easy-to-follow planting tips, full-color photography, and authoritative gardening advice, this helpful handbook explains how gardeners can select and grow more than two hundred of the best and most fragrant flowers. Original. 25,000 first printing.",
        "Category": " Gardening , Flowers , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Prize Stories 1994: The O. Henry Awards (The O. Henry Prize Collection)",
        "Authors": "By Abrahams, William Miller",
        "Description": "“Widely regarded as the nation’s most prestigious awards for short fiction.”—The Atlantic Monthly   The O. Henry Prize Stories 1994 gathers 21 of the best short stories of the year, selected from thousands published in literary magazines.    Stories include:Alison Baker “Better Be Ready ‘Bout Half Past Eight” (first prize) John Rolfe Gardiner “The Voyage Out” (second prize) Lorrie Moore “Terrific Mother” (third prize) Stuart Dybek “We Didn’t” Marlin Barton “Jeremiah’s Road” Kelly Cherry “Not the Phil Donahue Show” Elizabeth Cox “The Third of July” Terry Bain “Games” Amy Bloom “Semper Fidelis” Michael Fox “Rise and Shine” David McLean “Marine Corps Issue” Elizabeth Graver “The Boy Who Fell Forty Feet” Susan Starr Richards “The Hanging in the Foaling Barn” Janice Eidus “Pandora’s Box” Judith Ortiz Cofer “Nada” Mary Tannen “Elaine’s House” Dennis Trudell “Gook” Helen Fremont “Where She Was” Elizabeth Oness “The Oracle” Katherine L. Hester “Labor” Thomas E. Kennedy “Landing Zone X-Ray”",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "The Safety of Objects",
        "Authors": "By Homes, A. M.",
        "Description": "A collection of disturbing, surreal stories explores the murky underworld of the emotions, with tales of an abducted boy, a teenager who is seduced by his sister's doll, and a child kept alive by machines",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "W. W. Norton",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Dream Desserts: Luscious Low-Fat Recipes",
        "Authors": "By Jacobs, Martin (PHT) and Baggett, Nancy",
        "Description": "Features low-fat, low-cholesterol, and reduced calorie desserts that contain no artificial ingredients, including recipes for chocolate triple layer cake and deep-dish apple pie",
        "Category": " Cooking , General",
        "Publisher": "Stewart Tabori & Chang",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Guidebook of Free Cash & Benefits for 50 & Over",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Alpha Publishing, Incorporated",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Florence Fabricant's Pleasures of the Table: Innovative Menus for Entertaining, Easily Prepared Recipes, and the Wines to Serve With Them",
        "Authors": "By Fabricant, Florence",
        "Description": "Includes a variety of easily-prepared classic and international dishes and is supplemented by information on the best wines to accompany each selection",
        "Category": "",
        "Publisher": "Harry N Abrams Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Corporate Culture/Team Culture: Removing the Hidden Barriers to Team Success",
        "Authors": "By Sherriton, Jacalyn Carol and Stern, James L.",
        "Description": "Corporate Culture/Team Culture is the first book to address in depth the issue of changing the organizational culture to support team effectiveness. It also presents a practical, proven model for achieving such transformation, and illustrates the process with three extended case studies and numerous additional examples of the model in action.To create high-performing teams, the authors say, we must first acknowledge that teamwork doesn't come naturally. While individuals and organizations are trained to pay lip service to the value of working together, this approach actually clashes with cultures that reward \"looking out for number 1.\" Add in the turf battles that still smolder in most workplaces - especially in companies that have recently merged or downsized - and teams can become powder kegs.Yet, as the book's examples reveal, teaming is a vital way to structure work and meet today's business challenges. Whether your organization is fine-tuning its team efforts or just starting out, Corporate Culture/Team Culture shows you how to succeed by tackling cultural issues from the ground up.",
        "Category": " Business & Economics , General",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.97",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "The Defense Policies of Nations: A Comparative Study",
        "Authors": "By Murray, Douglas J. and Viotti, Paul R.",
        "Description": "",
        "Category": "",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "10.25",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Songs Of Chaos",
        "Authors": "By Lewitt, S. N.",
        "Description": "In the futuristic world in which he lives, Dante McCall, the only person not genetically identical to everyone else, is branded a freak, banished from Earth, and stranded among a strange starfaring culture. Original.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Fete Fatale",
        "Authors": "By Barnard, Robert",
        "Description": "The rigidly conservative town of Hexton-on-Weir, where twelve-year residents, such as veterinarian Marcus Kitterege and his wife Helen, are still regarded as newcomers, sponsors a church fair which becomes the background for murder",
        "Category": " Fiction , Mystery & Detective , Traditional",
        "Publisher": "Scribner",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "November",
            "Year": "1985"
        }
    },
    {
        "Title": "The database experts' guide to SQL (The database experts' series)",
        "Authors": "By Lusardi, Frank",
        "Description": "",
        "Category": "",
        "Publisher": "Intertext Publications/Multiscience Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "The Murder of a Shopping Bag Lady",
        "Authors": "By Kates, Brian",
        "Description": "Based on several years of painstaking research and interviews, this book explores the personal and bureaucratic circumstances that led a hard-working, family-oriented Italian woman to become a shopping-bag lady who was murdered at age sixty-seven",
        "Category": " Political Science , General",
        "Publisher": "Harcourt Brace Jovanovich",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "The Oxford Book of Legal Anecdotes (Oxford Paperbacks)",
        "Authors": "By Gilbert, Michael",
        "Description": "The law has captured the public's attention and imagination for centuries, with its servants demonstrating time and again their fallibility.  A former lawyer and celebrated crime writer, Michael Gilbert has compiled a vastly entertaining collection of over three hundred fifty anecdotes about legal goings-on over the past two hundred fifty years, and about the individuals who have won distinction in the legal profession. Drawn from the reminiscences of lawyers, criminals, witnesses, and clerks, these irresistibly readable stories present the foibles as well as the authority of judges and other legal practitioners.     We find many celebrated legal battles retold here, including Edward Carson's cross-examination of Oscar Wilde and Clarence Darrow's defense of J.T. Scopes for teaching the theory of evolution.  We also discover countless less-familiar treasures such as the story of the letter received by Judge Benjamin Cardozo which said: \"I read in the newspapers that you are a liberal judge. Will you send me ten dollars as I'm really very hard up.\"      Gilbert has arranged the entries alphabetically by the name of their principal subject.  He also includes headnotes which set the context and describe each subject's occupation (i.e. \"judge\", \"attorney general\") and a useful note which explains the differences between the British, European, and American legal systems.",
        "Category": " Medical , Hematology",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Free to Trade: A Novel of Suspense",
        "Authors": "By Ridpath, Michael",
        "Description": "Ex-Olympic runner Paul Murray has traded in his running shoes for a different, more exhilarating kind of speed. As a bond trader at a small but formidable London financial house, Paul is apprenticed to Hamilton McKenzie, a coldly brilliant trader who has made it his business to expand the international scope of the company. Paul feels as though he has found a professional home, and even begins to fall in love with his bold, irreverently funny colleague, Debbie Chater.On the night Debbie's body is dragged from the murky waters of the Thames, Paul begins a progressive and chaotic tumble into a darker world of trading . . . where there is more to lose than just market position. In sorting through Debbie's papers, Paul discovers suspicious details involving an investment in a shell company in the Netherlands Antilles. Setting out to discover more about this deal and Debbie's death, he turns up a rogues' gallery of nasties - a psychopathic bond trader, a shady international entrepreneur, and an unscrupulous salesman - none of whom would think twice about killing off a young, too inquisitive woman who is in over her head and in their way.The more Paul probes into Debbie's death and the ever more suspicious circumstances surrounding it, the more inexorably he becomes caught up in a web of international chicanery that could end up costing him more than just his career.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Growing Up With Language: How Children Learn To Talk",
        "Authors": "By Baron, Naomi S.",
        "Description": "\"It is a gift when an academic can take a difficult subject and make it not just accessible but actually enjoyable for the average reader. Anyone who is around young children will find useful information on how humans create speech and language.\"--The Bloomsbury ReviewChildren learn to make sense of the babble around them and become coherent speakers and incipient readers in just five or six years. In this remarkable book, linguist Naomi Baron takes us on a journey through language, showing the variety of ways in which children crack the language code and master the means of expression, and how parents play a vital role in the process. Every parent will see something of his or her child in the numerous and vivid examples; those whose kids don't fit preconceived norms will find reassurance and guidance in these pages. Spiced with enchanting examples of children putting their first words together, struggling to understand meaning, and coming to use language as a creative tool, Growing Up with Language reminds us that underneath all their efforts is the drive to make sense of the world.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Gardens for All Seasons: Public Gardens and Arboreta of Maryland",
        "Authors": "By Wine, Wauneta B.",
        "Description": "",
        "Category": " Architecture , General",
        "Publisher": "Vandamere Pr",
        "Price Starting With ($)": "6.84",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Betty Crocker's Microwave Cookbook",
        "Authors": "By Crocker, Betty",
        "Description": "Explains how to use the microwave oven to prepare over 250 delicious dishes--from appetizers and soups to main dishes and desserts--and advises how to choose foods and recipes to use the microwave to its fullest advantage",
        "Category": " Cooking , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1981"
        }
    },
    {
        "Title": "Betty Crocker Mexican",
        "Authors": "By Romero, Jose L.",
        "Description": "Presents one hundred and fifty easy, kitchen-tested recipes by chef Jose L. Romero, Jr. of Boston's outstanding Mexican restaurant, Casa Romero, as an introduction to Mexican cuisine",
        "Category": " Cooking , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1981"
        }
    },
    {
        "Title": "The Waterworks",
        "Authors": "By Doctorow, E. L.",
        "Description": "One rainy morning in 1871 young Martin Pemberton, walking down Broadway in lower Manhattan, sees in a passing horse-drawn omnibus several old men in black, one of whom he recognizes as his supposedly dead and buried father. So begins E. L. Doctorow's astounding new novel of post-Civil War New York, where maimed veterans beg in the streets, newsboys fight for their corners, the Tweed Ring operates the city for its own profit, and a conspicuously self-satisfied class of new wealth and weak intellect is all a glitter in a setting of mass misery.As Pemberton tries in vain to track the strange omnibus of old men, he leads us into a city we know and recognize and yet don't know, a ghost city that stands to contemporary New York like a panoramic negative print, reversed in its lights and shadows, its seasons turned round. The increasingly ominous tale is narrated by Pemberton's sometime employer, McIlvaine, the editor of the newspaper for which the young man writes occasional reviews. When Pemberton himself disappears, McIlvaine goes in pursuit of the truth of his freelance's bizarre fate. Layer by layer, he reveals to us a New York more deadly, more creative, more of a genius society than it is now. New technologies transport water to its reservoirs and gaslight to its streetlamps. Locomotives thunder down its streets. Telegraphy sings in its overhead wires, and its high-speed printing presses turn out tens of thousands of newspapers for a penny or two. It is a proudly, heedlessly modern city, and yet...the scene of ancient, primordial urges and transgressions, a companion city of our dreams...a moral hologram generated from this celebrated author's electrifying historical imagination.The Waterworks is a haunting tale of genius and madness in a metropolis that is itself a product of these qualities. Masterfully written and promising to be unforgettable, it is a triumphant addition to E. L. Doctorow's remarkable body of work.",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Cats Are Better Than Dogs: From a Cat's Eye View",
        "Authors": "By Lovka, Bob and Lipking, Ronald (ILT)",
        "Description": "",
        "Category": " Humor , Topic , Animals",
        "Publisher": "CompanionHouse Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Beanie Baby Stories: Heartwarming stories for Beanie Baby lovers of all ages",
        "Authors": "By Osborn, Susan Titus (EDT) and Jensen, Sandra (EDT)",
        "Description": "Presents stories of how Beanie Babies have helped to make a difference in people's lives.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Starburst Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Capricorn Games",
        "Authors": "By Silverberg, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "11.11",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The Best of Gourmet, 1986",
        "Authors": "By Gourmet Magazine Editors",
        "Description": "An anthology culled from issues of Gourmet magazine features menu plans for intimate and formal entertaining, and recipes for hors d'oeuvres, breads, soups, main dishes, side dishes, sauces, and desserts, as well as special presentations on the foods of specific areas",
        "Category": " Cooking , Methods , Gourmet",
        "Publisher": "Random House",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "The Missing Wedding Dress... featuring Barbie (Little Golden Book)",
        "Authors": "By Karen Krugman",
        "Description": "Barbie and Skipper help a frantic bride-to-be locate her missing wedding dress.",
        "Category": "",
        "Publisher": "Western Publishing Company, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The mountain world",
        "Authors": "By Casewit, Curtis W.",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The Curse of the Pharaohs (English and German Edition)",
        "Authors": "By Hartel, Klaus Dieter",
        "Description": "Examines several scientifically plausible explanations for the at least three dozen deaths of scientists, archaeologists, and scholars who have excavated and studied in Egypt since 1900",
        "Category": " History , General",
        "Publisher": "Lippincott Williams & Wilkins",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "July",
            "Year": "1975"
        }
    },
    {
        "Title": "The Grid",
        "Authors": "By Kerr, Philip",
        "Description": "Located in the heart of downtown Los Angeles, the sparkling new Yu Corporation Building is a monument to human genius. It can converse with its occupants. It can forecast the weather. It knows your body temperature, whether you've been drinking or using drugs. It darkens the windows in the noontime glare. It keeps the homeless away at night and lovingly tends the tree that reaches up through its beautiful atrium. Dubbed the Gridiron, the Yu Building is the culmination of art and function. It's also something else: a serial killer.Something has gone wrong inside the immensely powerful brain of this corporate dream palace. Before the building is opened to the public, one member of a team of brilliant computer programmers dies slumped against his VDT, his eyes burned black. Then a security guard is found with his skull shattered. Now the men and women who know the building best - including its egomaniacal architect and the one person who may actually be able to reason with the computer - know that the building itself is spinning wildly out of control.Built to survive power outages and the most massive earthquakes, the brain of the Gridiron cannot be unplugged and cannot be outsmarted. For the dozen people who are locked inside, the Gridiron is turning into a living, malevolent dungeon of terrors, where each death is more horrific than the one before, and human survival may be the ultimate achievement...",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Book That's Sweeping America!: Or Why I Love Business!",
        "Authors": "By Thomas, Stephen Michael Peter and Butman, John",
        "Description": "The world's greatest business consultant takes the business book down to a whole new level Not to take anything away from E.F. Hutton, but when Stephen Michael Peter Thomas(r) talks, people really listen. (Or at least they turn their heads in his general direction). And what they hear astounds them. The ideas are so simple. The wisdom so pure. And the concepts as familiar as they are obvious. Stephen Michael Peter Thomas is one of the rare thinkers who can make timeless half-truths sound refreshingly new. (Or maybe it's just that he charges so much that clients have deluded themselves to believe that he is really onto something!) Packed with knowledge, insight, and sometimes even a kernel of wisdom, The Book That's Sweeping America! gives readers what Fortune 100 companies have paid millions for. Stephen Michael Peter Thomas's every word mints a new batch of buzz phrases destined to be bandied about everywhere. \"Layered Niche Reengineering (LNR)\" \"Shaker Benchmarking\" \"Open-Book Reading\" We'd call it Stephen Michael Peter Thomas-ese if his name wasn't so impressively lengthy. In The Book That's Sweeping America!, Stephen Michael Peter Thomas taps into his visionary gift to provide a road map of all the latest concepts steering business around the world. Leadership. Competition. Strategy. Wardrobe. Stephen Michael Peter Thomas tackles each topic one by one. And The Book That's Sweeping America! comes with a bona fide guarantee--not a single idea is new or different enough to challenge or make you feel uncomfortable. Competing in business is tough enough these days without having to worry about tackling new material. * Fascinating case stories and interviews from the world's most successful organizations (like all business books there will most likely be cases from Xerox) * Eye-catching photos, charts, and graphics that make even the most obvious ideas easy to grasp * Learning summaries, Q&As, and exercises to implement in the odd chance that something new or original strikes you STEPHEN MICHAEL PETER THOMAS (The Sphere of Influence, USA) describes himself as \"the most talked about and influential business consultant the world has ever seen.\" The confidante of CEOs and the darling of the academic set, he is never referred to as \"Steve.\"",
        "Category": " Business & Economics , Reference",
        "Publisher": "Wiley",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Tender Death",
        "Authors": "By Meyers, Annette",
        "Description": "When a seventy-year-old wealthy woman is found on the sidewalk far below the window of her Park Avenue apartment, amateur sleuth Leslie Wetzon is certain her fall was no accident",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Scorpion Sanction",
        "Authors": "By Pape, Gordon",
        "Description": "After smuggling two small atomic bombs into Egypt, an extremist religious cult threatens the country with atomic destruction unless certain specific demands are met, including a return to the teachings of Allah",
        "Category": "",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "13.11",
        "Publish Date": {
            "Month": "October",
            "Year": "1980"
        }
    },
    {
        "Title": "Woman's Day Help",
        "Authors": "By Rhoads, Geraldine and Paradis, Edna",
        "Description": "Arranged into twelve mini-manuals and containing more than 650 entries, this homemaker's reference offers sound information on everything from arranging home work schedules to finding good professional services",
        "Category": "",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Forced Options: Social Decisions for the 21st Century",
        "Authors": "By Shinn, Roger Lincoln",
        "Description": "",
        "Category": "",
        "Publisher": "The Pilgrim Press",
        "Price Starting With ($)": "6.07",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Beers of North America",
        "Authors": "By Yenne, Bill",
        "Description": "Examines the beer brewing process, analyzes various beers, and surveys breweries in the U.S., Canada, and Mexico",
        "Category": "",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "6.78",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "California",
        "Authors": "By Thomas, Lee",
        "Description": "A picturesque display through the Golden State begins with San Diego and journeys north with side tours to Los Angeles, San Simeon, San Francisco, Yosemite National Park, Ubehebe Crater, and other areas",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "9.51",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "From Ashes to Glory: Conflicts and Victories on and Beyond the Football Field",
        "Authors": "By McCartney, Bill and Diles, David L.",
        "Description": "",
        "Category": " Sports & Recreation , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Southern Living Cookbook for Two",
        "Authors": "By Stehle, Audrey",
        "Description": "Offers guidelines for cooking for two people, featuring varied menus and recipes for all types of dishes from appetizers to main courses and desserts",
        "Category": " House & Home , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "November",
            "Year": "1981"
        }
    },
    {
        "Title": "Harvard Business Review on Management",
        "Authors": "By Drucker",
        "Description": "Thirty-nine articles from the nationally known journal offer analyses, reviews, and assessments of durable management functions, responsibilities, philosophies, strategies, procedures, and special problems",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1976"
        }
    },
    {
        "Title": "Understanding Society: An Introduction to Sociology/Student Edition",
        "Authors": "By Persell, Caroline Hodges",
        "Description": "",
        "Category": "",
        "Publisher": "Harpercollins College Div",
        "Price Starting With ($)": "7.51",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Marriages and Families: Changes, Choices, and Constraints",
        "Authors": "By Benokraitis, Nijole V.",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Some Everyday Folk and Dawn (Virago modern classics)",
        "Authors": "By Franklin, Miles",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "6.98",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "No",
        "Authors": "By Djerassi, Carl",
        "Description": "A compelling novel based on the high-stakes biotech industry and the science behind Viagra from the internationally known “Father of the Pill.”   The fourth installment of Carl Djerassi’s pioneering “science-in-fiction” tetralogy tells the story of a husband and wife team who devise new solutions to problems associated with sex and reproduction. Renu Krishnan is an Indian-born, American-educated scientist who discovers how NO (nitric oxide) can help men with erectile dysfunction—the scientific rationale behind Viagra. At the same time, her husband, Israeli scientist Jephtah Cohn, develops a new approach to ovulation prediction, which is also based on factual research. When Wall street gets wind of their discoveries, the couple catapults in the fast paced world of lawyers and IPOs, where scientists are now a hot commodity. Deftly exploring the demanding worlds of academia and high finance, Djerassi brings back many characters from his three earlier novels for a satisfying conclusion.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Dragon's Blood: The Pit Dragon Chronicles, Volume One",
        "Authors": "By Yolen, Jane",
        "Description": "Dragons are trained to fight to the death, and two determined teens help free them in this spellbinding saga.Training a dragon to be a fighting champion is the only way to freedom for fifteen-year-old Jakkin.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Rat Pack: Neon Nights with the Kings of Cool",
        "Authors": "By Quirk, Lawrence J. and Schoell, William",
        "Description": "The Rat Pack -- Frank Sinatra, Dean Martin, Sammy Davis, Jr., Peter Lawford, and Joey Bishop -- had talent, money, and power to burn. They also had something else even more important.They had fun.",
        "Category": " Music , General",
        "Publisher": "Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "The Magnificent West: Yosemite",
        "Authors": "By Milton Goldstein",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "7.56",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Trail of Secrets",
        "Authors": "By Goudge, Eileen",
        "Description": "",
        "Category": "",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "The Presidential campaign: An essay",
        "Authors": "By Hess, Stephen",
        "Description": "",
        "Category": "",
        "Publisher": "Brookings Institution",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The best book of-- WordPerfect",
        "Authors": "By Alfieri, Vincent",
        "Description": "",
        "Category": "",
        "Publisher": "Hayden Books",
        "Price Starting With ($)": "7.22",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Test Pattern: A Novel",
        "Authors": "By Klein, Marjorie and Klein, Majorie",
        "Description": "A dazzling and strikingly original fiction debut from an exciting new talentFrom the moment a new TV set arrives at the Palmer household in 1954 in Newport News, Virginia, change is in the wind. Eleven-year-old Cassie glimpses snapshots of the future in the hypnotic test pattern. Mesmerized, Cassie sees snippets from Kennedy's assassination, the Beatles' debut, man's landing on the Moon, and the O. J. Simpson trial. Her starstruck mother, Lorena, delights in the magical images flickering on the screen too, and finds the strength to pursue her dreams of becoming a professional dancer. Lorena soon plunges into an affair with an old flame, whose cousin turns out to be a talent scout for Arthur Godfrey, and risks her marriage to Cassie's dad, an accident-prone, depressed construction worker. As Lorena learns that the path to fame and fortune is strewn with obstacles, Cassie's own eyes are being opened to the world outside of provincial Newport News-and to the even richer world within herself.Brilliantly re-creating the innocence and energy of the '50s, Test Pattern is a tour de force of wit, spirit, and imagination. From the moment a new TV set arrives at the Palmer household in 1954 in Newport News, Virginia, change is in the wind. Eleven-year-old Cassie glimpses snapshots of the future in the hypnotic test pattern. Mesmerized, Cassie sees snippets from Kennedy's assassination, the Beatles' debut, man's landing on the Moon, and the O. J. Simpson trial. Her starstruck mother, Lorena, delights in the magical images flickering on the screen too, and finds the strength to pursue her dreams of becoming a professional dancer. Lorena soon plunges into an affair with an old flame, whose cousin turns out to be a talent scout for Arthur Godfrey, and risks her marriage to Cassie's dad, an accident-prone, depressed construction worker. As Lorena learns that the path to fame and fortune is strewn with obstacles, Cassie's own eyes are being opened to the world outside of provincial Newport News-and to the even richer world within herself.Brilliantly re-creating the innocence and energy of the '50s, Test Pattern is a tour de force of wit, spirit, and imagination.From the moment a new TV set arrives at the Palmer household in 1954 in Newport News, Virginia, change is in the wind. Eleven-year-old Cassie glimpses snapshots of the future in the hypnotic test pattern. Mesmerized, Cassie sees snippets from Kennedy's assassination, the Beatles' debut, man's landing on the Moon, and the O. J. Simpson trial. Her starstruck mother, Lorena, delights in the magical images flickering on the screen too, and finds the strength to pursue her dreams of becoming a professional dancer. Lorena soon plunges into an affair with an old flame, whose cousin turns out to be a talent scout for Arthur Godfrey, and risks her marriage to Cassie's dad, an accident-prone, depressed construction worker. As Lorena learns that the path to fame and fortune is strewn with obstacles, Cassie's own eyes are being opened to the world outside of provincial Newport News-and to the even richer world within herself.Brilliantly re-creating the innocence and energy of the '50s, Test Pattern is a tour de force of wit, spirit, and imagination.",
        "Category": " Fiction , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "10.55",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Till Death",
        "Authors": "By Kienzle, William X.",
        "Description": "Father Robert Koesler investigates when death follows from the complications that arise when Father Rick Casserly's secret affair with the principal of the parochial school becomes a triangle when a former nun falls for him.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Andrews McMeel Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Girls: A Novel",
        "Authors": "By Busch, Frederick",
        "Description": "In the unrelenting cold and bitter winter of Upstate New York, Jack and his wife, Fanny, are trying to come to terms with the desperate sorrow they feel over the death of their young daughter. A chasm has formed in their relationship and Jack is looking for a way to heal them both.Meanwhile, near the town where they live, a fourteen-year-old girl has gone missing between her parents' home and her father's church. She has become one of the hundreds of children who seemingly disappear into thin air every year in this country. Finding what has become of this child could be Jack's salvation, if he can just get to her in time.",
        "Category": " Fiction , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Why the Tree Loves the Ax",
        "Authors": "By Lewis, Jim",
        "Description": "Caroline Harrison is a young woman drifting across the country from a secret past to an uncertain future. Stranded by accident in a small Texas city, she decides to settle down and stay, only to have her peace destroyed by a moment of inspired fury. From there she's on the run, to New York City to confront her ex-husband, and then upstate, where she lands in a small house in the woods inhabited by three men and an eight-year-old boy - a tiny criminal community. But will they help her or hurt her? And what exactly are they scheming? This is a story of female violence, fear, and resourcefulness. It is a meditation on identity and memory.",
        "Category": " Fiction , Literary",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Mark Skousen's complete Guide to Financial Privacy",
        "Authors": "By Skousen, Mark",
        "Description": "",
        "Category": "",
        "Publisher": "Alexandria House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "MASQUERADE",
        "Authors": "By Dailey, Janet",
        "Description": "Remy Jardin, suffering from amnesia after an attack in Nice, risks losing the man she loves, Cole Buchanan, as well as her own life, as she searches for the truth about an accident involving her family's shipping company",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Have Some Sand: The Gritty Side Of Love: John Margolies, Emily Gwathmey",
        "Authors": "By Slesin, Suzanne, Margolies, John, and Gwathmey, Emily",
        "Description": "A flip and playful collection of postcards features accompanying thoughts on love and romance from such authorities as Cher, Dorothy Parker, George Bernard Shaw, Chico Marx, and Woody Allen. 20,000 first printing.",
        "Category": " Humor , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Homestead",
        "Authors": "By Lippi, Rosina",
        "Description": "Each life has its place, and every variation ripples the surface of the tiny alpine village called Rosenau. Be it a mysteriously misaddressed love letter or a girl's careless delivery of two helpless relatives into Nazi hands, the town's balance is ever tested, and ever tender. Here is a novel spanning eighty years -- years that bring factories and wars, store-bought cheese and city-trained teachers -- weaving the fates of the wives, mothers, and daughters in this remote corner of Austria. To quote Rosellen Brown, \"the women in this haunting book are deeply and uniquely of their place, yet they speak (often wordlessly) of women's longings and satisfactions everywhere.\"",
        "Category": " Fiction , Literary",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Visions of the Future: The Distant Past, Yesterday, Today, and Tomorrow",
        "Authors": "By Heilbroner, Robert",
        "Description": "\"This is an exceedingly long short book, stretching at least fifty thousand years into the past and who knows how many into the future...\" So begins Visions of the Future, the prophetic new book by eminent economist Robert Heilbroner. Heilbroner's basic premise is stunning in its elegant simplicity. He contends that throughout all of human history, despite the huge gulf in social organization, technological development and cultural achievement that divides us from the earliest known traces of homo sapiens, there have really only been three distinct ways of looking at the future. During a period Heilbroner refers to simply as the Distant Past, stretching from prehistory to the appearance of modern nation-states in seventeenth century Europe, there was no notion of a future measurably and materially different from the present or the past. From the Stone Age to the Bronze, Mesopotamia and Egypt to Greece and Rome, and throughout the Middle Ages, a continuum of cultures and civilizations shared one defining characteristic, and that was the absence of any expectation of material progress for the great masses of people. Heilbroner maintains that it was not until the first stirrings of the period he refers to as Yesterday, spanning from roughly 1700 to 1950, that the future entered into human consciousness as a great beckoning force. Capitalism, continually reinvigorated by the seemingly endless forward march of science and an evolving sense of democracy, appeared to promise all levels of society some expectation of a future at least somewhat better than the past. It was this unwavering faith in the superiority of the future that separated Yesterday from the age we have now entered. While we are still driven towards tomorrow by the same forces that determined the recent past, the lessons of Hiroshima and Chernobyl, the chaos in the former Soviet Union, the stagnation of the West, and the anarchic rage unleashed in our inner cities and in hot spots around the globe have brought on a palpable anxiety that is quite apart from both the resignation of the Distant Past or the bright optimism of Yesterday.   In a brilliant conclusion drawing together the threat of nuclear blackmail, global warning and the growing commodification of life represented by video games, voice mail, and VCRs, Visions of the Future issues a clarion call to face the challenges of the twenty-first century with a new awareness and resolve, a resolve strengthened by the inspiration of our collective past.",
        "Category": " History , Europe , Medieval",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Campaign: A Novel",
        "Authors": "By Quayle, Marilyn Tucker and Northcott, Nancy Tucker",
        "Description": "Campaign fever is in the air ... and Robert Hawkins Grant is a shoe-in for reelection to the Senate. Grant, a conservative from Georgia, is a strong favorite in the next presidential race, on track to being the first black president of the United States. But nine days before the senatorial election, a reporter who had been publicly dogging him is murdered. Evidence points to Grant, and too many people are quick to believe the worst.The ensuing investigation sets in motion a chain of events that threaten his personal and professional future. New accusations surface, each more damaging than the last. Racial tensions are swirling around Grant, corruption has spread to his own staff, and the media has made him a target.Grant must clear his name, solve a murder, exonerate his son of trumped-up drug charges, and expose the White House corruption while maintaining his integrity and keeping himself in the race ... and time is running out.",
        "Category": " Fiction , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Sunspacer: A novel",
        "Authors": "By Zebrowski, George",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "9.38",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "The Grand Tour: Individual Creations",
        "Authors": "By Conti, Flavio",
        "Description": "Looks at eight spectacular edifices, including the Chateau at Fontainebleau, the Taj Mahal, the Belvedere Palace in Vienna, and the Guggenheim Museum, which reflect their builders' distinctive visions",
        "Category": "",
        "Publisher": "HBJ Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Big Broccoli Book",
        "Authors": "By Downard, Georgia",
        "Description": "Despite the president's publicly stated aversion to broccoli, sales of this vegetable have been soaring. The reason? A recent study from researchers at the Johns Hopkins Medical Center has linked consumption of broccoli with an increase in cancer-fighting enzymes. Now comes a unique cookbook which offers 50 intriguing recipes for this remarkable vegetable. Line drawings.",
        "Category": " Cooking , Specific Ingredients , Vegetables",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "THING OF STATE: A Novel",
        "Authors": "By Drury, Allen",
        "Description": "In their conduct of foreign policy, modern American presidents must never utter threats they can't - or won't - enforce, make promises they can't - or won't - keep, or renege on their commitments to their allies. This is the underlying premise of the powerful new political novel by Allen Drury.The battle for strategic advantage, for the world's headlines and broadcasts, and for domestic political advantage, as the President prepares to run for a second term, forms the basis of this informed, sophisticated, and fascinating novel of present-day politics in all its tricky variations from Washington to Greater Lolome City, with the United Nations a major stop along the way.",
        "Category": " Fiction , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "MEGASKILLS",
        "Authors": "By Rich, Dorothy",
        "Description": "A guide to instilling confidence, motivation, responsibility, initiative, and other values in children offers feedback on the MegaSkills program from parents, children, teachers, and employers and discusses new themes for the nineties. Simultaneous.",
        "Category": "",
        "Publisher": "Houghton Mifflin (P)",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "How to Beat Housework",
        "Authors": "By Vacuum, Eureka",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Jeff Allen's Best: The Resume P",
        "Authors": "By Allen, Jeffrey G.",
        "Description": "Deals with how to write your resume. Based on his 25-plus years of helping people get hired, author Jeffrey Allen covers general rules, including developing the resume from the ground up, creating the style, major do's and don'ts, and marketing strategy (of yourself). Following this, it examines resumes for specific professions such as executive, professional, science, and engineering. Then discussions center on special or unique problems one may encounter. The area of video resumes is also covered. Finally, sample resumes are presented for numerous occupations, including accounting, advertising, computer science, law, management trainee, and office manager.",
        "Category": " Business & Economics , Careers , Job Hunting",
        "Publisher": "John Wiley & Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Halliwell's Film Guide",
        "Authors": "By Walker, James",
        "Description": "More than sixteen thousand entries, including silent and foreign films, list cast, credits, synopsis, and review excerpts",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "9.92",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Introduction to Pascal and Structured Design",
        "Authors": "By Dale, Nell B. and Weems, Chip",
        "Description": "",
        "Category": " Computers , General",
        "Publisher": "Houghton Mifflin College Div",
        "Price Starting With ($)": "7.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "LIFE with Father",
        "Authors": "By Life Magazine (EDT)",
        "Description": "Working and playing, guiding and caring: the joys and trials of fatherhood. Here in 82 photographs collected from the archives of LIFE magazine are classic images of LIFE with Father. Everything from bath time to bedtime, from bike rides to backyard baseball, is fondly recaptured in this album of fatherly love, from the editors of America's favorite picture magazine.",
        "Category": " Photography , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Garfield: Me Book",
        "Authors": "By Davis, Jim and Koth, Brett (ILT)",
        "Description": "",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "The Idiot Girls' Action-Adventure Club: True Tales from a Magnificent and Clumsy Life",
        "Authors": "By Notaro, Laurie",
        "Description": "NEW YORK TIMES BESTSELLER“I’ve changed a bit since high school. Back then I said no to using and selling drugs.  I washed on a normal basis and still had good credit.” Introducing Laurie Notaro,  the leader of the Idiot Girls’ Action-Adventure Club. Every day she fearlessly rises  from bed to defeat the evil machinations of dolts, dimwits, and creepy boyfriends—and  that’s before she even puts on a bra. For the past ten years, Notaro has been entertaining  Phoenix newspaper readers with her wildly amusing autobiographical exploits and unique  life experiences. She writes about a world of hourly-wage jobs that require absolutely  no skills, a mother who hands down judgments more forcefully than anyone seated on  the Supreme Court, horrific high school reunions, and hangovers that leave her surprised  that she woke up in the first place. The misadventures of Laurie and her fellow  Idiot Girls (“too cool to be in the Smart Group”) unfold in a world that everyone  will recognize but no one has ever described so hilariously. She delivers the goods:  life as we all know it.",
        "Category": " Humor , Form , Essays",
        "Publisher": "Villard",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "The Positive Family",
        "Authors": "By Schuller, Arvella",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Stone Virgin",
        "Authors": "By Unsworth, Barry",
        "Description": "A mysterious sculpture of a beautiful and erotic  Madonna holds the key to the Fornarini family's secrets. When Raikes, a conservation expert,  tries to restore her, he is swept under the  statue's spell and swept under the spell of the seductive Chiara Litsov, a member of the  Fornarini family now married to a famous  sculptor. Raikes finds himself losing all moral  grounding as his love for statue and woman  intertwine in lust and murder.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Futurespeak: A Fan's Guide to the Language of Science Fiction",
        "Authors": "By Rogow, Roberta",
        "Description": "Includes over one thousand entries defining scientific, literary, publishing, film, and printing terms associated with science fiction, plus lists of science fiction publications, organizations, and conventions",
        "Category": "",
        "Publisher": "Universal Sales Marketing",
        "Price Starting With ($)": "24.26",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Everyday Geography",
        "Authors": "By Kevin McKinney",
        "Description": "",
        "Category": "",
        "Publisher": "GuildAmerica Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "FREE $TUFF from America Online: Your Guide to Getting Hundreds of  Valuable Goodies from the Fastest-Growing Online Service",
        "Authors": "By O'Loughlin, Luanne",
        "Description": "",
        "Category": " Computers , General",
        "Publisher": "Coriolis Group",
        "Price Starting With ($)": "11.35",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Tar Heel Laughter",
        "Authors": "By Walser, Richard (EDT)",
        "Description": "One of the few books concerned solely with the humor of a single state, this volume includes samples of what North Carolinians have laughed at -- and with -- from 1709 to the present.  It is a rich anthology of Tar Heel anecdotes, homespun quips, hilarious stories, folklore, exaggerations, and observations.  In this wide range of humor, Walser has provided a valuable recording of American folklore and the social history of North Carolina.",
        "Category": " Humor , General",
        "Publisher": "University of North Carolina Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1983"
        }
    },
    {
        "Title": "The New York times gourmet shopper: A guide to the best foods",
        "Authors": "By Hodgson, Moira",
        "Description": "A consumer guide to gourmet foods offers practical tips on buying diverse types of produce, meats, and other ingredients and includes more than three hundred recipes",
        "Category": "",
        "Publisher": "Times Books",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "The Employee Rights Handbook: Answers to Legal Questions--From Interview to Pink Slip",
        "Authors": "By Sack, Steven Mitchell",
        "Description": "Offers practical guidance for people in all walks of work life, covering all the steps in the employment process, and describing all the legalities involved in clear language easily understood by the layperson. Includes sample documents and a glossary of legal terms. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Law , General",
        "Publisher": "Facts on File",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Sad Underwear and Other Complications: More Poems for Children and their Parents",
        "Authors": "By Viorst, Judith and Hull, Richard (ILT)",
        "Description": "Knock, knock Who's there? Someone with sad underwear. Sad underwear? How can that be? When my best friend's mad at me, Everything is sad. Even my underwear.   But sad underwear is just one of the many complications a person has to deal with. There's the first day of school (\"Will they let me go when I need to go to the bathroom?\") and pests like Wayne (\"a fellow who clogs up life's drain\") and bee stings and liver for supper -- and missing your dad.  This companion volume to the acclaimed If I Were in Charge of the World and Other Worries has poems for explorers and dreamers, for people who love unicorns, for people who'd rather have pets than baby sisters. Funny, poignant and always true, it examines and celebrates life with all of its perplexing complications.",
        "Category": " Juvenile Nonfiction , Poetry , Humorous",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Better Homes and Gardens Your Bedrooms (All About Your House)",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "Offers advice on color and decorating schemes, shows how to make bedroom furniture and furnishings, and looks at window treatments, beds, and remodeling projects",
        "Category": " Art , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    }
]