[
    {
        "Title": "Songs of Innocence and Songs of Experience (Dover Thrift Editions: Poetry)",
        "Authors": "By Blake, William",
        "Description": "As both painter and poet, William Blake (1757–1827) was a powerful and visionary artist whose two early collections of poetry, Songs of Innocence and Songs of Experience, contain memorable lyric verses embodying the emerging spirit of Romanticism. The two works were published together in 1794 with the subtitle, \"Shewing the Two Contrary States of the Human Soul.\"The poems of Songs of Innocence describe childhood states of naturalness and purity in delicately beautiful lyrics that reveal a child's unspoiled and beatific view of life and human nature. In Songs of Experience the mood and tone darken, the poems suggesting the bitter corruptions and disillusionment that await the innocent. The contrast between the two sets of lyrics is perhaps at its most acute in the poems \"The Lamb\" and \"The Tyger,\" the latter ultimately expressing wonderment at the seemingly paradoxical coexistence of good and evil. The full texts of all the poems in the 1794 edition of both collections are included in this volume. Includes a selection from the Common Core State Standards Initiative: \"The Echoing Green.\"",
        "Category": " Poetry , European , English, Irish, Scottish, Welsh",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Favorite Poems (Dover Thrift Editions: Poetry)",
        "Authors": "By Longfellow, Henry Wadsworth",
        "Description": "Henry Wadsworth Longfellow (1807–1882) was the most popular American poet of his time, and one of the most famous American poets of all time. It has been said that certain of his poems — the long narratives Evangeline and The Song of Hiawatha most notably — were once read in every literate home in America. A former teacher who fulfilled his dream to make a living as a poet, Longfellow taught at Bowdoin and Harvard, was eventually honored for his poetry with degrees from Oxford and Cambridge, and is one of the few Americans to have a monument dedicated to his memory in Westminster Abbey. This choice collection of his works, which reflects his mastery of a rich variety of poetic forms and meters, includes one of his best narrative poems, The Courtship of Miles Standish. Here, too, are such famous poems as \"The Village Blacksmith,\" \"The Wreck of the Hesperus,\" \"The Children's Hour,\" \"Paul Revere's Ride,\" and other poems on subjects ranging from lost youth and Giotto's Tower to slavery and the building of a ship. Includes a selection from the Common Core State Standards Initiative: \"Paul Revere's Ride.\"",
        "Category": " Poetry , American , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Early Poems (Dover Thrift Editions)",
        "Authors": "By Williams, William Carlos",
        "Description": "One of the most original and widely imitated poets of the twentieth century, William Carlos Williams (1883–1963) wrote verse firmly rooted in concrete experience and the particulars of everyday life. A practicing physician for more than 40 years, Williams worked in the idiom of modern American speech ― unlike his friend and mentor, Ezra Pound ― and his poems are redolent with a warmth and generosity of spirit. The Beat poets were particularly impressed with the accessibility of his language, and Williams's widely quoted dictum, \"No ideas but in things,\" influenced a generation of American poets.This fine selection offers readers the opportunity to study and enjoy the richness and variety of Williams's early work. More than 70 poems, published between 1917 and 1921, include \"Peace on Earth,\" \"Tract,\" \"El Hombre,\" \"Danse Russe,\" \"Keller Gegen Dom,\" \"Willow Poem,\" \"Queen-Anne's-Lace,\" \"Portrait of a Lady,\" \"The Widow's Lament in Springtime,\" and many others.",
        "Category": " Poetry , American , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2015"
        }
    },
    {
        "Title": "Through Blood & Fire",
        "Authors": "By Chamberlain, Joshua Lawrence and Nesbitt, Mark",
        "Description": "Includes all of Chamberlain's known wartime lettersShows his transformation from college professor to major generalOriginal writings placed into context by historian Mark NesbittIn July 1862 Joshua Chamberlain, a family man and respected professor at Bowdoin College in Maine, joined the fight to preserve the Union. His wartime service was exemplary; he is perhaps best remembered for his outstanding leadership at Gettysburg. At all times, however, he fought bravely and well, even at Petersburg in 1864 where he received the wound that was to torment him until his death in 1914.Throughout his time in the field, Chamberlain wrote letters of recommendation to his superiors, letters of condolence to the families of soldiers killed while under his command, and letters to his family at home. All are well written, revealing the professor's educated background and elegant prose. Nesbitt's notes set the scene, place Chamberlain's writings within the larger context of the war, and make clear the General's sterling character and his sacrifices for the country he loved.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Dinosaurs (Reader's Digest Pathfinders)",
        "Authors": "By Willis, Paul M. A., Chan, Jimmy (ILT), and Chan, Kimmy (ILT)",
        "Description": "Introduces dinosaurs, discussing the different categories, what they looked like, what they ate, how we know about them through the study of fossils, and why they may have become extinct. Reprint.",
        "Category": " Juvenile Nonfiction , Reference , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Bath & Beauty Splash!: 100 Recipes for a Decadent Home Spa",
        "Authors": "By Ayer, Harriet Hubbard",
        "Description": "",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "Main Street",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Hemi: A Mule (Weekly Reader Children's Book Club)",
        "Authors": "By Barbara Brenner~J. Winslow Higginbottom",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row/Weekly Reader Children's Book Club",
        "Price Starting With ($)": "6.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "U.S.A. Cookbook",
        "Authors": "By Vibbert, Carolyn (ILT) and Lukins, Sheila",
        "Description": "After traveling across the country for three years, Sheila Lukins, the co-author of The Silver Palate cookbooks and The New Basics Cookbook and author of All Around the World Cookbook, set to work tasting, interpreting, and making magic in over 600 recipes. Here are Mashed Yukon Golds, a Stovetop Clambake, Vegetable Jambalaya, Bing Cherry Chutney, Peachy Keen Pie. Quesadillas with duck and caramelized onions, a burger stuffed with Maytag blue cheese, gazpacho made with both fresh and roasted vegetables, crab cakes sumptuous with lobster meat, orange zest, and mace. It's a star-spangled celebration.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "101 Spanish Idioms",
        "Authors": "By Cassagne, Jean-Marie and Raidon, L. N. (ILT)",
        "Description": "This whimsical collection of colloquialisms entertains intermediate students while providing insight into Spanish-language idioms, customs, and humor. Grouped according to theme--from Nuestros amigos los animales to Hablando del cuerpo to Algo en que pensar--the idioms are illustrated with humorous cartoons that provide a key to understanding the literal and real meanings.",
        "Category": " Foreign Language Study , Spanish",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Adventures of a Psychic: A Fascinating and Inspiring True-Life Story of One of America's Most Successful Clairvoyants",
        "Authors": "By Browne, Sylvia and May, Antoinette",
        "Description": "In this uniquely fascinating book, world-renowned psychic Sylvia Browne recounts her captivating life as a clairvoyant, telling of her earliest \"readings\" as a young child in Kansas City, and of her first contact with \"Francine,\" her spirit guide. In engrossing detail, Sylvia tells how her \"gift\" has assisted police departments in their search for missing children and dangerous criminals—and how her predictions of deaths, plane crashes, and momentous world events were sometimes heeded—or tragically ignored. But more than anything else, this is the remarkable story of one woman’s psychic odyssey, for it offers illuminating insight into how we can better understand ourselves and our own psychic abilities. ADVENTURES OF A PSYCHIC may give you an entirely new outlook on life, death, psychic phenomena, and the \"other side!\"",
        "Category": " Body, Mind & Spirit , Parapsychology , ESP (Clairvoyance, Precognition, Telepathy)",
        "Publisher": "Hay House Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Random House Webster's Quotationary",
        "Authors": "By Frank, Leonard Roy (EDT)",
        "Description": "A user-friendly, comprehensive compilation of more than twenty thousand quotations is organized by subject area, with extensive cross-referencing, and includes the thoughts of Bill Gates, Emily Dickinson, the Dalai Lama, and others on topics ranging from Baseball to Money. 15,000 first printing.",
        "Category": " Reference , Questions & Answers",
        "Publisher": "Random House Reference",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "The New Age Cult",
        "Authors": "By Martin, Walter",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Confronting the Cults",
        "Authors": "By Lewis, Gordon R.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "P & R Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Washington Irving's Tales of the supernatural",
        "Authors": "By Irving, Washington",
        "Description": "",
        "Category": "",
        "Publisher": "Stemmer House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Annapolis: A Walk Through History",
        "Authors": "By Anderson, Elizabeth B.",
        "Description": "Briefly traces the history of Annapolis, Maryland, describes the historic homes, churches, and buildings in the three-hundred-year-old state capitol, and shares anecdotes about the city's past",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Cornell Maritime Pr/Tidewater Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Home for the Holidays: Stories and Art Created for the Benefit of Habitat for Humanity",
        "Authors": "By Stelten, Gene (EDT)",
        "Description": "Home for the Holidays gathers the holiday memories of more than sixty prominent Americans - celebrities, politicians, authors, athletes, and artists - who generously donated their stories or pieces of art to Habitat for Humanity for inclusion in this book. Each provides a glimpse into the life of the contributor, creating a scrapbook of memories that will sweeten the holiday season for you and your family. Your purchase of this book will help Habitat for Humanity build low-cost housing with families in need, and thus help bring others \"home for the holidays.\"",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Peachtree Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Love, Luck & Lessons For Life",
        "Authors": "By Binney, Ruth",
        "Description": "",
        "Category": " Social Science , Customs & Traditions",
        "Publisher": "David & Charles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "LOVE: Quotes and Passages from the Heart",
        "Authors": "By Aronson, B. C. (EDT)",
        "Description": "“True love is like ghosts, which everybody talks about and few have seen.”—Francois, Duc de La Rochefoucauld, Writer“To have a good friend is the purest of all God's gifts, for it is a love that has no exchange of payment.  It is not inherited, as with a family.  It is not compelling, as with a child.  And it has no means of physical pleasure, as with a mate.  It is, therefore, an indescribable bond that brings with it a far deeper devotion than all the others.”—Frances Farmer, ActressWhether it's the love we feel for parents, significant others, or even pets, this treasury of quotes and passages offers a wonderfully diverse way to discover the meaning of love.  Included are thoughts from talented minds such as George Bernard Shaw, Anna Quindlen, Woody Allen, and many more.  This beautiful hardcover gift book, affordably priced at $14.95, is perfect for readers of any age who are in the mood for love.",
        "Category": " Reference , Quotations",
        "Publisher": "Random House Reference",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "I Didn't Plan to Be a Witch and Other Surprises of a Joyful Mother",
        "Authors": "By Eyre, Linda",
        "Description": "Linda Eyre, who co-authored the New York Times bestseller Teaching Your Children Values, has nine children. She knows that although no mother plans to be a witch, there are times when every mother does a terrific job of playing the part.  In her reassuring and hilarious report on being a mother in today's hectic world, Linda honestly describes not only the vital importance and magnificent moments of motherhood, but also those days when mothers feel they are living in a Roadrunner cartoon that never ends. She shares her own experiences with managing unmanageable schedules, coping with mealtime chaos, trying to find time for herself, and the sometimes desperate measures and compromises that are necessary to get it all done (and even then, not always). Whether offering advice on streamlining your life, coping with the martyr syndrome, or ignoring the outrageous demands of toddlers and teens with serenity and grace (or not), Linda Eyre speaks with the voice of experience.",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "The Unorthodox Jewish Book of Records and Lists",
        "Authors": "By Siegel, Danny and Gould, Allan",
        "Description": "A humorous collection of Jewish world records, including the largest matzah ball in history, the shortest Jewish book, and the shortest time to kosher a stove for Passover, plus lists of famous Jewish people, inventions, and law firms",
        "Category": " Humor , General",
        "Publisher": "Samuel Wachtman's Sons",
        "Price Starting With ($)": "5.5",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Jewish Humor: What the Best Jewish Jokes Say About the Jews",
        "Authors": "By Telushkin, Joseph",
        "Description": "Here are more than 100 of the best Jewish jokes you'll ever hear, interspersed with perceptive and persuasive insight into what they can tell us about how Jews see themselves, their families, and their friends, and what they think about money, sex, and success. Rabbi Joseph Telushkin is as celebrated for his wit as for his scholarship, and in this immensely entertaining book, he displays both in equal measure. Stimulating, something stinging, and always very, very funny, Jewish Humor offers a classic portrait of the Jewish collective unconscious.",
        "Category": " Religion , Judaism , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "I Will Always Remember You",
        "Authors": "By Schutz, Susan Polis (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Blue Mountain Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "Grizzwold (I Can Read Level 1)",
        "Authors": "By Hoff, Syd",
        "Description": "Grizzwold the lovable bear is having a tough time finding somewhere to live. He's too big for most places, and too clumsy for others. He's not even any good as a live bearskin rug! Will Grizzwold ever find a home that's just right?",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "Bad Boy Brawly Brown (Easy Rawlins Mystery)",
        "Authors": "By Mosley, Walter",
        "Description": "Easy Rawlins's old friend John shows up at his door one morning, looking for the kind of help only Easy can provide. John's stepson, Brawly Brown, has left home, and John has reason to think this well-meaning boy is caught up in a situation that's more dangerous than he knows. It doesn't take Easy long to find Brawly and learn that John is right - but getting Brawly to see things that way is another matter.Brawly has joined a political group that he believes will make life better for the residents of Compton. With years of seeing how things really work, Easy recognizes that young Brawly is just a pawn in a battle between forces as old and hard as the city's streets.Through it all, Easy's old friend Mouse is there to help him - even though the last time Easy saw Mouse he was lying still and cold, and Easy is certain he's dead. Still, the memory and reputation of Mouse accompany Easy everywhere, earning him second looks from beautiful women and respect from hardened men. And in a world where logic is only a small element in life-or-death calculations, it is something Mouse once said to him that could help Easy save Brawly's life - without costing him his own.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "The Shadow Matrix (Darkover)",
        "Authors": "By Bradley, Marion Zimmer",
        "Description": "Another installment in the Darkover series, the sequel to Exile's Song continues the story of Margaret Alton's return to Darkover, where she tries to understand the pattern behind her unique powers and wield them for good.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "DAW Hardcover",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Outward Bound",
        "Authors": "By Hogan, James P.",
        "Description": "Fifteen-year-old Linc Marani is from the wrong side of twenty-second century L.A.'s tracks. Everyone he knows is addicted to dope, booze, and the violence that masquerades as bravado in life on the streets. When a chance at some cold hard cash is offered to him by a slick associate in a fancy Cadillac, Linc jumps at the bait - only to find himself sentenced to a juvenile labor camp when the heist goes sour.Labor camp: To Linc it means an aching, dawn-to-dusk grind - Marine bootcamp-style discipline with no hope of escape or parole. He is about to give up and accept this precisely regimented and miserable future when a mysterious psychologist offers him the chance of a life time. Can Linc overcome one of the worst neighborhoods on Earth by proving his worth on a mission beyond the stars?",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Damia's Children (Rowan, Book 3)",
        "Authors": "By McCaffrey, Anne",
        "Description": "Although Damia had used her inherited psychic Talent to deflect most of the alien invasion on the human worlds, she did not exterminate the enemies, leaving her children to confront the danger in an intense final battle of powers. 100,000 first printing. $80,000 ad/promo.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Newton's Cannon (The Age of Unreason, Book 1)",
        "Authors": "By J. Gregory Keyes",
        "Description": "",
        "Category": "",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Flowers of Evil",
        "Authors": "By Sherwood, John",
        "Description": "Wealthy businessman Richard Galliant's crude attempt to kiss the Princess of Wales leads horticulturalist/sleuth Celia Grant to the conclusion that he has been poisoned with a rare South American plant",
        "Category": " Fiction , General",
        "Publisher": "Charles Scribner's Sons",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Committed to Memory",
        "Authors": "By Hollander, John (EDT) and Boland, Eavan (EDT)",
        "Description": "\"The Road Less Traveled\", \"If\" and \"Casey at the Bat\" are a few of the classic poems found in this rich compilation of poetry from an array of celebrated writers, such as Whitman, Dickinson, Shakespeare, and Poe. Reprint.",
        "Category": " Poetry , Anthologies (multiple authors)",
        "Publisher": "Riverhead Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Poems That Touch the Heart: America's Most Popular Collection of Inspirational Verse",
        "Authors": "By Alexander, Adele Logan",
        "Description": "With over 650,000 copies in print, Poems That Touch The Heart is America's most popular collection of inspirational verse.",
        "Category": " Poetry , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "Gossip Girl No. 8: Nothing Can Keep Us Together",
        "Authors": "By Von Ziegesar, Cecily",
        "Description": "Welcome to New York City's Upper East Side, where my friends and I get everything -- and everyone -- we want. Snagging the latest Marc Jacobs bag or your best friend's boyfriend isn't pretty, but it's always hot...It's almost graduation and our lives are really heating up. Everybody's into college and it's obviously time to party -- as if we hadn't been doing that already! Will Blair and Nate's love affair continue? More importantly, will Blair finally get into Yale? Or will Nate and Serena hook up in New Haven and leave Blair alone in the city?And as for the juiciest scoop of all, what's this we hear about Jenny leaving Constance Billard to go to boarding school? Only time will tell how everyone will end up, but one thing's for sure: love is in the air, and it smells a lot like Gucci Envy.",
        "Category": " Young Adult Fiction , School & Education , Boarding School & Prep School",
        "Publisher": "Poppy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Dutch Oven Cooking",
        "Authors": "By Ragsdale, John G.",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , European",
        "Publisher": "Lone Star Books",
        "Price Starting With ($)": "9.48",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Treasury Of Favorite Poems",
        "Authors": "By Untermeyer, Louis (Editor)",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Favorite Russian Fairy Tales",
        "Authors": "By Ransome, Arthur and Galkin, Simon (ILT)",
        "Description": "Russian folk culture is filled with magical stories for children; tales of witches and wizardry, perilous journeys, wise animals, frightful giants, and beautiful princesses. This choice collection presents six of the most popular tales. Some bear a resemblance to the folktales of western Europe, while others introduce exotic creatures and situations unique to the Russian imagination. Among the fanciful characters young readers will encounter in these stories are the legendary Fire-bird; the dulcimer-playing Sadko, whose music could make the Tzar of the Sea dance; the iron-toothed witch Baba Yaga, and many more.British author Arthur Ransome (1884–1967) gathered these authentic tales from peasant storytellers on his journeys to Russia early in the twentieth century. He then retold them in English. This volume reproduces the English versions, reset in large, easy-to-read type, and illustrated with six handsome new drawings.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2011"
        }
    },
    {
        "Title": "The Book of J",
        "Authors": "By Bloom, Harold and Rosenberg, David (TRN)",
        "Description": "Translates and interprets the portions of the Pentateuch which derive from an ancient work known as the \"J\" document, the earliest known version of the Pentateuch",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Merry Christmas ABC (Christmas Remembered ; Bk. 6)",
        "Authors": "By Childs, Anne Van Wagner",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "The Wit & Wisdom of Harry Truman",
        "Authors": "By Truman, Harry S. and Keyes, Ralph (EDT)",
        "Description": "The words of a politician who knew his own mind and wasn't afraid to speak it, this volume truly captures the sprit of \"Give 'em Hell\" Harry, with the excerpts of letters, speeches, diary entries, even anecdotes that reveal this special man and his time.",
        "Category": " Reference , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Pictorial resources in the Washington, D.C., area",
        "Authors": "By Green, Shirley L",
        "Description": "",
        "Category": "",
        "Publisher": "Library of Congress",
        "Price Starting With ($)": "11.11",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "New England",
        "Authors": "By Smith, Clyde H. and Glickman, Anne",
        "Description": "Captures the familiar as well as lesser-known images of rural New England's splendid wildlife during the four seasons",
        "Category": " Photography , General",
        "Publisher": "Graphic Arts Center Pub Co",
        "Price Starting With ($)": "7.88",
        "Publish Date": {
            "Month": "June",
            "Year": "1975"
        }
    },
    {
        "Title": "Beauty and Bounty: 1 Day Nature Trips in and Around Washington, D.C.",
        "Authors": "By Smith, Jane Ockershausen",
        "Description": "",
        "Category": "",
        "Publisher": "Epm Pubns Inc",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Leaving Home: Survival of the Hippest",
        "Authors": "By Johnston, Lynn and Parton, Andie",
        "Description": "Never preachy, always informative, and full of laughs, Leaving Home is packed with tried and true nuggets, from tips on finding an apartment to tips on getting your eviction notice reversed, from someone with a sense of humor who's \"been there, done that.\" The reader is walked through essentials such as building a home-grown vacation, \"Too Broke to Break?\" handling depression, \"It Can Get You and You Can Fight Back,\" and dealing with school and job jitters. Eleven sections are crammed with advice on furnishing apartments, mastering the ancient art of bartering, living with \"the boss without a heart, the prof without a clue,\" and more. It includes such gems as: The Yard Sale -- Your \"Vintage Kitchenware Store\"; Rules for Roommates: Rent Is Not A Voluntary Contribution; Your Mother Is No Longer the Alarm Clock; The Mail Is Always For You! Leaving Home not only relays how to avoid common pitfalls, but also how to get out after you've landed in them face first! Pearls of wisdom and insightful cartoons make this a must-read for anyone starting life on their own.",
        "Category": " Self-help , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "The complete shellfisherman's guide",
        "Authors": "By Tedone, David",
        "Description": "",
        "Category": "",
        "Publisher": "Peregrine Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Light for the Path (Every Day Light Series) (Vol 3)",
        "Authors": "By Hughes, Selwyn",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "Broadman & Holman Publishers",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "WorkLaughs: A Jollytologist Book: Quips, Quotes, and Anecdotes about Making a Buck",
        "Authors": "By Klein, Allen (COM)",
        "Description": "WorkLaughs is full of hilarious and witty anecdotes about making a living. These selections from comedians and notable personalities including Milton Berle, Paula Poundstone, and Jerry Seinfeld as well as lesser-known colleagues of the daily grind explore the funny side of many aspects of the workplace– including going on a job interview, sitting through meetings, calling in sick, dealing with the boss, retiring, and much more.Award-winning professional speaker and therapeutic humor expert “Mr. Jollytologist” Allen Klein has carefully selected these lighthearted quips, quotes, and anecdotes to keep workers laughing even on the hardest days. From salespeople to construction workers to doctors to those climbing the corporate ladder, this hilarious volume is perfect for everyone who’s trying to make a buck.Donuts: the only non-negotiable element to a successful meeting.Joe HeuerAfter the ship has sunk, a consultant knows how it might have been saved.Newt HielscherI love working for myself; it's so empowering. Except when I call in sick. I always know when I'm lying.Rita RudnerThe trouble with unemployment is that the minute you wake up in the morning you’re on the job.Slappy White",
        "Category": " Humor , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The Gift of Teaching",
        "Authors": "By Kelly-Gangi, Carol and Patterson, Jude",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "American Characters: Selections from the National Portrait Galllery, Accompanied By Literary Portraits",
        "Authors": "By Lewis, R. W. B., Lewis, Nancy, and National Portrait Gallery (Smithsonian Institution) (COR)",
        "Description": "Presents a visual and literary review of famous Americans",
        "Category": " Art , Techniques , Painting",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "7.46",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Eros in Antiquity",
        "Authors": "By Mondadori (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "The Erotic Art Book Society",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1978"
        }
    },
    {
        "Title": "Mastering Serial Communications",
        "Authors": "By Gofton, Peter W.",
        "Description": "",
        "Category": "",
        "Publisher": "Sybex Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "How Networks Work (How It Works)",
        "Authors": "By Freed, Les and Derfler, Frank J.",
        "Description": "This Bestseller Edition includes expanded coverage of the world's largest network - the Internet. Whether you build and maintain networks or are simply curious about their inner workings, you'll love discovering How Networks Work.",
        "Category": " Computers , General",
        "Publisher": "Ziff Davis Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Markets: Who Plays, Who Risks, Who Gains, Who Loses",
        "Authors": "By Mayer, Martin",
        "Description": "",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Comparative Disadvantages?: Social Regulations and the Global Economy",
        "Authors": "By Nivola, Pietro S. (EDT)",
        "Description": "The American economy is in many ways uniquely unfettered. Nowhere else in the industrial world is it easier to set up a discount store, start a new airline, or shrink a payroll. But extensive economic deregulation has been matched by a burgeoning body of social law cracking down on business. From shareholder litigation and strict product liability to punitive environmental controls and workplace rules, entrepreneurs run a gauntlet of legal perils. The costs of this expanding and contentious agenda often exceed the value of its social benefits. The projected annual costs over benefits of the 1990 Clean Air Act, for instance, surpass the estimated value of U.S. exports blocked by all of Japan's known import restrictions. How sustainable is this situation amid the pressures of globalization? The contributors to this volume explore the question from a variety of perspectives.U.S. policymakers frequently criticize the rest of the world for policies and practices that are said to constrict American commerce. Yet some trade disputes have been ignited by questionable rules made in the United States. Indeed, legal strictures have posed barriers to imports and possibly discouraged foreign investors, as well as interfered with some U.S. exports. At times the social regulatory regime has also stirred abrasive efforts to extend U.S. sanctions to foreign soil. Even if those frictions have been of minor consequences so far, inefficient legal and regulatory conventions exact a toll on U.S. productivity growth.The book concludes that in a global economy the burdensome regulations of foreign countries deserve attention, but increasingly so do the burdens that American \"adversarial legalism\" imposes on itself and sometimes on others. Ideas and prospects for correcting the problem are discussed throughout.The contributors include Lee Axelrad, Thomas F. Burke, Loren Cass, Robert A. Kagan, Mark K. Landy, Roger G. Noll, and David Vogel.",
        "Category": " Law , Administrative Law & Regulatory Practice",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "7.56",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Motivating and Managing Computer Personnel (Business Data Processing)",
        "Authors": "By Couger, J. Daniel. and Zawacki, Robert A.",
        "Description": "Motivating and Managing Computer Personnel The first book that shows how to increase human productivity in the computer industry Based on the first rigorous national study of computer industry personnel, Motivating and Managing Computer Personnel is a truly groundbreaking book. It is the first book to examine in-depth the personnel problems unique to the computer industry and make specific recommendations on how managers can manage more effectively. Motivating and Managing Computer Personnel shows managers:how to identify the unique factors in their own work situations (based on national norms)how to match personnel needs to organizational goalshow to motivate employees effectively and realisticallyhow to identify potential trouble areas in personnelfour supervisory styles for the computer manager?what they are, how they work, and when to apply themhow to put meaning back into computer workFor every job category in the computer field?from data entry and computer operators to programmers and analysts to high-level management personnel, Motivating and Managing Computer Personnel is the first significant attempt to break the impersonal mystique of working in the computer industry. As such, it is an absolute must for managers (and would-be managers) who want to increase the productivity?and happiness?of their employees",
        "Category": " Computers , Data Processing",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1980"
        }
    },
    {
        "Title": "Shan",
        "Authors": "By Lustbader, Eric",
        "Description": "On a high plateau in the heart of Asia lies Shan, the holy site where men are tested and the deepest secrets of Eastern mysticism are revealed. Enter into the challenge of Jake Maroc, a man of almost supernatural gifts, who is commissioned to help China fulfill its ancient destiny--as the future of the world hangs in the balance.From the Paperback edition.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "American Folklore and Legend",
        "Authors": "By Reader's Digest Association",
        "Description": "Paintings, watercolors, lithographs, etchings, maps, and a guide to folk festivals supplement a survey of American customs, folkways, legends, romances, tall tales, folk songs, superstitions, heroes, and heroines",
        "Category": " Social Science , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1981"
        }
    },
    {
        "Title": "The Pocket Book of Patriotism",
        "Authors": "By Foreman, Jonathan",
        "Description": "What does it mean to be a patriot? This U.S companion to the runaway British blockbuster, The Pocket Book of Patriotism, will tap into our national pride. Written by distinguished journalist and historian Jonathan Foreman along with George Courtauld, the author of the original, this small but richly informative timeline highlights key moments in U.S history, and simultaneous happenings abroad.  More than just a list of important dates, it provides memorable quotes and speeches from major figures, excerpts from patriotic songs, and specific U.S. facts and trivia. From the Revolutionary War to Ground Zero, from \"Give me liberty or give me death\" to \"I have a dream,\" The Pocket Book of Patriotism is instructional and inspirational for every citizen.",
        "Category": " Reference , Quotations",
        "Publisher": "Sterling",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "La Folle De Chaillot (Ldp Litterature) (French Edition)",
        "Authors": "By Jean Giraudoux",
        "Description": "",
        "Category": "",
        "Publisher": "Livre De Poche French",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The Best American Sports Writing 1997",
        "Authors": "By Stout, Glenn (EDT) and Plimpton, George (EDT)",
        "Description": "Well established as the premier sports anthology, The Best American Sports Writing brings together the finest writing on sports to appear in the past year. Chosen from more than 350 national, regional, and specialty publications, the 25 pieces embrace the world of sports in all its drama, humanity, and excitement.",
        "Category": " Sports & Recreation , Essays",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Ready, Set, Sold!: The Insider Secrets to Sell Your House Fast--for Top Dollar!",
        "Authors": "By Corbett, Michael",
        "Description": "Michael Corbett appears regularly on national TV and print media and travels the country lecturing to crowds of 25,000 sharing his expertise, having made millions buying and selling houses during his twenty-plus years in the business. With personal tips, cost-effective techniques, and real estate insider secrets, Ready, Set, Sold! will teach readers how to: ? Add $10,000 to the value of their home in a single weekend ? Avoid the twelve costliest and most common mistakes ? Dress and stage their home to make buyers swoon and bid over the asking price ? Pay no taxes on the sale?without breaking the law ? Complete no-cost makeovers that supercharge their selling price ? Take advantage of the home-selling secrets that only real estate agents know ? Save thousands in commissions and closing costs With before and after photos, checklists, charts, and worksheets, Ready, Set, Sold! is the book that every home seller MUST read before putting their house up for sale!",
        "Category": " Business & Economics , Real Estate , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Best of the Best from Virginia Cookbook: Selected Recipes from Virginia's Favorite Cookbooks",
        "Authors": "By McKee, Gwen (EDT) and Moseley, Barbara",
        "Description": "An incredible collection of 296 recipes selected from 126 of Virginia's leading cookbooks captures the flavor of the Old Dominion.  The full-color photographs not only highlight Virginia's favorite dishes, but also display its beautiful landmarks.",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Quail Ridge Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Big Anthony and the Magic Ring",
        "Authors": "By dePaola, Tomie",
        "Description": "In this sequel to Caldecott Honor winner Strega Nona, “Big Anthony romps through a case of spring fever with an ill-gotten magic ring, against the architectural background and blue skies of la bella Italia.”--Booklist",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Sandpiper",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1979"
        }
    },
    {
        "Title": "Lewis Carroll's Games and Puzzles (Dover Recreational Math)",
        "Authors": "By Carroll, Lewis and Wakeling, Edward (COM)",
        "Description": "Forty-two tantalizing teasers — most by the creator of Alice in Wonderland and published here for the first time — Cakes in a Row, Alice's Multiplication Tables, Looking-Glass Time, Arithmetical Croquet, Four Brothers and a Monkey, Hidden Names, Diverse Doublets, Mischmasch, more. Many hints and solutions. Illustrations by John Tenniel.",
        "Category": " Games & Activities , Puzzles",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "The Hundred Dresses (Voyager Books)",
        "Authors": "By Estes, Eleanor and Slobodkin, Louis (ILT)",
        "Description": "Eleanor Estes’s The Hundred Dresses won a Newbery Honor in 1945 and has never been out of print since. At the heart of the story is Wanda Petronski, a Polish girl in a Connecticut school who is ridiculed by her classmates for wearing the same faded blue dress every day. Wanda claims she has one hundred dresses at home, but everyone knows she doesn’t and bullies her mercilessly. The class feels terrible when Wanda is pulled out of the school, but by that time it’s too late for apologies. Maddie, one of Wanda’s classmates, ultimately decides that she is \"never going to stand by and say nothing again.\"",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Sandpiper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1974"
        }
    },
    {
        "Title": "Raggedy Andy Stories: Introducing the Little Rag Brother of Raggedy Ann",
        "Authors": "By Gruelle, Johnny",
        "Description": "Since Raggedy Andy first appeared in print in 1920, he has delighted millions of readers with his adventurous spirit and compassionate nature. Now he returns to captivate a new generation in this carefully produced reissue, which restores the book to its original appearance.All the original stories are here, as Raggedy Andy arrives in the mail at Marcella's father's office, displays his cheery smile, and is eagerly reunited with his sister, Raggedy Ann. After a warm welcome from the other dolls, Raggedy Andy adds to their fun with a dance, a pillow fight, and a taffy pull. His merry escapades frequently show his generosity in helping others, as he bravely ventures into the gutter to find the penny dolls, \"cures\" the French doll, and encourages the wooden horse. Other stories also include Raggedy Andy and the other dolls' encounters with the Easter bunny, Santa Claus, and a beautiful seashell.Johnny Gruelle's delicate illustrations are the perfect companion to the well-loved stories in this American classic, the only edition authorized by the Gruelle family. A brief biography of the author-artist by his grandson, Kim Gruelle, makes this edition especially valuable.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Elmer and the Dragon (My Father's Dragon)",
        "Authors": "By Gannett, Ruth Stiles and Gannett, Ruth Stiles (ILT)",
        "Description": "A stand-alone sequel to My Father's Dragon, in which Elmer Elevator and the flying baby dragon help the king of the canaries find treasure.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Christmas in My Heart 3",
        "Authors": "By Wheeler, Joe L. (EDT)",
        "Description": "",
        "Category": " Fiction , Christian , Collections & Anthologies",
        "Publisher": "Review & Herald Pub Assn",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "The Three Musketeers: In Easy-To-Read-Type (Dover Children's Thrift Classics)",
        "Authors": "By Dumas, Alexandre, Green, John (ILT), and Weissman, Alan",
        "Description": "Set in seventeenth-century France, this swashbuckling novel relates the daring escapades of D'Artagnan, a Gascon adventurer, and his three friends — Athos, Porthos and Aramis, three Musketeers in the service of King Louis XIII.First published in 1844, Alexandre Dumas' exciting story teems with high adventure, royal intrigue, and romance as D'Artagnan and his friends confront the scheming Cardinal Richelieu and his beautiful but treacherous spy, Lady de Winter. Heroic patriotism also comes into play as the four friends hastily journey to the besieged French stronghold of La Rochelle.Specially adapted for young readers, the novel's stirring themes of reckless courage, love, and derring-do are distilled into a highly readable narrative. Enhanced with original illustrations by artist John Green and set in large, easy-to-read type, this new edition of an old favorite will delight adventure fans of all ages.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2011"
        }
    },
    {
        "Title": "The Story of Doctor Dolittle",
        "Authors": "By Lofting, Hugh",
        "Description": "The adventures of a kind-hearted doctor, who is fond of animals and understands their language, as he travels to Africa with some of his favorite pets to cure the monkeys of a terrible sickness.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "The Education of Mrs. Bemis: A Novel",
        "Authors": "By Sedgwick, John",
        "Description": "A dead body floating by a pier. An elderly woman curled up on a bed in a department store. A psychiatrist searching for her own identity. These are the pieces of the puzzle that, in John Sedgwick's masterful novel of psychological suspense, begin to come into focus when Madeline Bemis is referred to the treatment of Dr. Alice Matthews at Montrose Psychiatric Hospital.Mrs. Bemis's treatment gradually peels back the layers of a  disturbing past whose shameful secrets and hidden sorrows stem from the war years of the 1940s—and reveals an unexpected link to  the floating corpse. Mrs. Bemis's awakening sparks an intimacy between the two women that goes beyond an ordinary doctor/patient  relationship—but also makes it clear that Mrs. Bemis's recovery, and perhaps even her safety, depends on quickly coming to terms with her secret history.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Symptomatic",
        "Authors": "By Senna, Danzy",
        "Description": "Look out for Danzy Senna's latest book, New People, on sale nowA young woman moves to New York City for what promises to be a dream job. Displaced, she feels unsure of her fit in the world. Then comes a look of recognition, a gesture of friendship from an older woman named Greta who shares the same difficult-to-place color of skin. On common ground, a tenuous alliance grows between two women in racial limbo. So too, does the older woman's unnerving obsession, leading to a collision of two lives spiraling out of control. A beautifully written novel, at once suspenseful, erotic, and tantalizingly clever, Symptomatic is a groundbreaking contribution to the literature of racial identity.",
        "Category": " Fiction , Literary",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Bay Country",
        "Authors": "By Horton, Tom",
        "Description": "",
        "Category": "",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Quality assurance: A complete guide to effective programs",
        "Authors": "By Meisenheimer, Claire",
        "Description": "",
        "Category": "",
        "Publisher": "Aspen Systems Corp",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Cooking for Camp and Trail",
        "Authors": "By Bunnelle, Hasse and Sarvis, Shirley",
        "Description": "A guide to preparing delicious camp meals from nutritious, low-bulk foods",
        "Category": " Cooking , General",
        "Publisher": "Sierra Club Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1972"
        }
    },
    {
        "Title": "Go Away, Stay Away",
        "Authors": "By Haley, Gail E.",
        "Description": "After encountering demons, goblins, and spirits, a group of villagers join in a festival to free themselves of these bothersome pests",
        "Category": "",
        "Publisher": "Charles Scribner's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1977"
        }
    },
    {
        "Title": "Good Housekeeping Illustrated American Cookbook",
        "Authors": "By Leblanc, Beverly, Maisner, Heather, Lyford, Irene, and Grayson, D. (EDT)",
        "Description": "A celebration of down-home cooking basics includes 2000 illustrations and special holiday menus",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "Polar Star",
        "Authors": "By Smith, Martin Cruz",
        "Description": "Arkady Renko has made too many enemies and now he toils in obscurity on a Russian factory ship in the middle of the Bering Sea. But when a female crew member is picked up dead with the day's catch, Arkady becomes obsessed with the case and once again discovers more than he wants to know and certainly more than he bargained for....From the Paperback edition.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Mourning & Mitzvah: A Guided Journal for Walking the Mourner's Path Through Grief to Healing",
        "Authors": "By Brener, Anne",
        "Description": "“It is hard to work through                 one’s grief when there are so many cover-ups and so many                 different kinds of denial at work within the culture. And that                 is why this book is of so much importance. Anne Brener has                 crafted a walkway through the valley of the shadow of death.                 The walkway has thorns and bramble bushes on it but it leads to                 the other side, beyond grief, for those who are willing to stay                 the course. Keep this book for time of need and do the                 grief-work in which it instructs us and you will see that this                 long and wise heritage of ours still has the power to speak, to                 heal and to comfort—even in our time.”—from the Foreword by Rabbi Jack Riemer            For those who mourn a death, for those who                 would help them and for those who face a loss of any kind, Mourning & Mitzvah teaches you the power and strength available to                 you in the fully experienced mourning process.             When the temple stood in the ancient city                 of Jerusalem, mourners walked through the gates and into the                 courtyard along a specifically designated mourner’s path.                             As they walked, they came face to face                 with all the other members of the community, who greeted them                 with the ancestor of the blessing, “May God comfort you                 among the mourners of Zion and Jerusalem.” In this way,                 the community embraced those suffering bereavement, yet allowed                 for unique experiences of grief.             In this new and expanded edition of a                 modern classic, Anne Brener brings us an innovative integration                 of Jewish tradition and modern professional resources. It gives                 spiritual insight and healing wisdom to those in our own time                 who mourn a death, to those who would help them and to those                 who face a loss of any kind.",
        "Category": " Religion , Judaism , Rituals & Practice",
        "Publisher": "Jewish Lights Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "War Footing: 10 Steps America Must Take to Prevail in the War for the Free World",
        "Authors": "By Gaffney, Frank J. (EDT)",
        "Description": "America has been at war for years, but until now, it's not been clear with whom. We have been fighting without being clear for what. We have been waging war without using the full resources we need to win. With the publication of War Footing, Frank Gaffney and his colleagues make it clear not only whom the enemy is and how high the stakes are, but also how we can prevail. Their book explains that we are engaged in nothing less than a War for the Free World - a fight to the death with Islamofascists who adhere to a political ideology bent on our destruction. It then offers ten specific steps that Americans, as individuals and as communities, can take to ensure our way of life and the safety and well-being of our children. These steps include specific recommendations about how to know the enemy, support our troops, provide for our energy security, stop investing in terror, equip the country for war at home, counter an EMP attack, secure our borders and interior against illegal immigration, wage political warfare, launch regional initiatives, and wield effective diplomacy. This definitive, highly readable \"owner's manual\" for the War for the Free World has been written by one of the most prominent national security experts of our time, Frank J. Gaffney, and his extraordinary team of respected experts. Among them are R. James Woolsey, Victor Davis Hanson, Generals Tom McInerney, USAF (Ret.) and Paul Vallely, USA (Ret.); Alex Alexiev, Andrew McCarthy, Claudia Rosett, Michael Rubin, Daniel Goure, Caroline Glick, Michael Waller, and many others.",
        "Category": " Political Science , Security (National & International)",
        "Publisher": "Naval Institute Press",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Blue Like Jazz: Nonreligious Thoughts on Christian Spirituality",
        "Authors": "By Miller, Donald",
        "Description": "\"I never liked jazz music because jazz music doesn't resolve. I used to not like God because God didn't resolve. But that was before any of this happened.\" ?Donald MillerIn Donald Miller's early years, he was vaguely familiar with a distant God. But when he came to know Jesus Christ, he pursued the Christian life with great zeal. Within a few years he had a successful ministry that ultimately left him feeling empty, burned out, and, once again, far away from God. In this intimate, soul-searching account, Miller describes his remarkable journey back to a culturally relevant, infinitely loving God.For anyone wondering if the Christian faith is still relevant in a postmodern culture.For anyone thirsting for a genuine encounter with a God who is real.For anyone yearning for a renewed sense of passion in  life.Blue Like Jazz is a fresh and original perspective on life, love, and redemption.",
        "Category": " Religion , Spirituality",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Managing Quality in America's Most Admired Companies",
        "Authors": "By Spechler, Jay W.",
        "Description": "Copublished with Industrial Engineering and Management Press What are america&apos;s leading companies doing to excel in quality? This new book provides the answer. Jay W. Spechler, senior examiner for the Malcolm Baldrige National Quality Award Committee, has brought together case studies of how over 30 leading companies put quality management into practice in their organizations. The case studies focus on how the Baldrige Award criteria are actually being applied in the companies and how the companies are achieving quality results. The cases cover all aspects of quality management-from values and philosophies to actual implementation, training, measurement, and employee involvement. They include many practical examples to illustrate successful strategies, programs, and action steps. In addition, the book&apos;s seven opening chapters provide general guidelines for implementing quality management in any organization.",
        "Category": " Business & Economics , Total Quality Management",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Biology, 7th Edition (Book & CD-ROM)",
        "Authors": "By Campbell, Neil A. and Reece, Jane B.",
        "Description": "Key Message: The best-selling biology textbook in the world just got better!  Neil Campbell and Jane Reece’s BIOLOGY is the unsurpassed leader in introductory biology. The book's hallmark values—accuracy, currency, and passion for teaching and learning—have made Campbell/Reece the most successful book for readers for seven consecutive editions. More than 6 million readers have benefited from BIOLOGY’s clear explanations, carefully crafted artwork, and student-friendly narrative style.   Key Topics: Introduction: Themes in the Study of Life, The Chemical Context of Life, Water and the Fitness of the Environment,    Carbon and the Molecular Diversity of Life, The Structure and Function of Large Biological Molecules, A Tour of the Cell,  Membrane Structure and Function, An Introduction to Metabolism, Cellular Respiration: Harvesting Chemical Energy,  Photosynthesis, Cell Communication, The Cell Cycle, Meiosis and Sexual Life Cycles, Mendel and the Gene Idea, The Chromosomal Basis of Inheritance, The Molecular Basis of Inheritance, From Gene to Protein, Control of Gene Expression,  Viruses, Biotechnology, Genomes and Their Evolution, Descent with Modification: A Darwinian View of Life, The Evolution of Populations, The Origin of Species, The History of Life on Earth, Phylogeny and the Tree of Life, Bacteria and Archaea,  Protists, Plant Diversity I: How Plants Colonized Land, Plant Diversity II: The Evolution of Seed Plants, Fungi, An Introduction to Animal Diversity, Invertebrates, Vertebrates,  Plant Structure, Growth, and Development, Transport in Vascular Plants,  Soil and Plant Nutrition, Angiosperm Reproduction and Biotechnology, Plant Responses to Internal and External Signals,  Basic Principles of Animal Form and Function, Animal Nutrition, Circulation and Gas Exchange, The Immune System,  Osmoregulation and Excretion, Hormones and the Endocrine System, Animal Reproduction, Animal Development,  Neurons, Synapses, and Signaling, Nervous Systems, Sensory and Motor Mechanisms, Animal Behavior, An Introduction to Ecology and the Biosphere, Population Ecology, Community Ecology, Ecosystems, Conservation Biology and Restoration Ecology.   Market Description: For readers interested in learning the basics of Biology.",
        "Category": " Science , Life Sciences , Biology",
        "Publisher": "Benjamin Cummings",
        "Price Starting With ($)": "8.97",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Wonderful Life: The Burgess Shale and the Nature of History",
        "Authors": "By Gould, Stephen Jay",
        "Description": "High in the Canadian Rockies is a small limestone quarry formed 530 million years ago called the Burgess Shale. It hold the remains of an ancient sea where dozens of strange creatures lived—a forgotten corner of evolution preserved in awesome detail. In this book Stephen Jay Gould explores what the Burgess Shale tells us about evolution and the nature of history.",
        "Category": " Science , Life Sciences , Evolution",
        "Publisher": "W. W. Norton & Co",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Betrayal of Science and Reason: How Anti-Environmental Rhetoric Threatens Our Future",
        "Authors": "By Ehrlich, Paul R. and Ehrlich, Anne H.",
        "Description": "Despite widespread public support for environmental protection, a backlash against environmental policies is developing. Fueled by outright distortions of fact and disregard for the methodology of science, this backlash appears as an outpouring of seemingly authoritative opinions by so-called experts in books, articles, and appearances on television and radio that greatly distort what is or is not known by environmental scientists. Through relentless repetition, the flood of anti-environmental sentiment has acquired an unfortunate aura of credibility, and is now threatening to undermine thirty years of progress in defining, understanding, and seeking solutions to global environmental problems.In this hard-hitting and timely book, world-renowned scientists and writers Paul R. Ehrlich and Anne H. Ehrlich speak out against what they call the \"brownlash.\" Brownlash rhetoric, created by public relations spokespersons and a few dissident scientists, is a deliberate misstatement of scientific findings designed to support an anti-environmental world view and political agenda. As such, it is deeply disturbing to environmental scientists across the country. The agenda of brownlash proponents is rarely revealed, and the confusion and distraction its rhetoric creates among policymakers and the public prolong an already difficult search for realistic and equitable solutions to global environmental problems.In Betrayal of Science and Reason, the Ehrlichs explain clearly and with scientific objectivity the empirical findings behind environmental issues including population growth, desertification, food production, global warming, ozone depletion, acid rain, and biodiversity loss. They systematically debunk revisionist \"truths\" such as:  population growth does not cause environmental damage, and may even be beneficial humanity is on the verge of abolishing hunger; food scarcity is a local or regional problem and is not indicative of overpopulation there is no extinction crisis natural resources are superabundant, if not infinite global warming and acid rain are not serious threats to humanity stratospheric ozone depletion is a hoax risks posed by toxic substances are vastly exaggerated  The Ehrlichs counter the erroneous information and misrepresentation put forth by the brownlash, presenting accurate scientific information about current environmental threats that can be used to evaluate critically and respond to the commentary of the brownlash. They include important background material on how science works and provide extensive references to pertinent scientific literature. In addition, they discuss how scientists can speak out on matters of societal urgency yet retain scientific integrity and the support of the scientific community.Betrayal of Science and Reason is an eye-opening look at current environmental problems and the fundamental importance of the scientific process in solving them. It presents unique insight into the sources and implications of anti-environmental rhetoric, and provides readers with a valuable means of understanding and refuting the feel-good fables that constitute the brownlash.",
        "Category": " Science , Environmental Science",
        "Publisher": "Island Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Essentials of Nursing Leadership & Management",
        "Authors": "By Whitehead, Diane K., Weiss, Sally A., and Tappen, Ruth M.",
        "Description": "Successfully make the transition to professional nursing practice.Two books in one, for the price of one—all the issues and trends coverage you need,plus leadership and management content.The completely revised and updated 6th Edition of this popular resource prepares you to meet the challenges you’ll face as a professional in today’s changing health care environment. You’ll explore your future responsibilities as a leader and a manager and the workplace issues and trends that you’ll encounter in practice.A wealth of resources online at DavisPlus provides tools to hone your skills and prepare for the future, including interactive case studies, review questions, bonus chapters, a resume template, sample letters and emails, and much more.",
        "Category": " Medical , Nursing , Management & Leadership",
        "Publisher": "F.A. Davis Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Space (Reader's Digest Pathfinders)",
        "Authors": "By Dyer, Alan and Watt, Cliff (ILT)",
        "Description": "Examines the nature of outer space, our solar system, and our universe, including descriptions of the sun, moon, and planets, as well as constellations, nebulas and black holes.",
        "Category": " Juvenile Nonfiction , Science & Nature , Astronomy",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "7.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Best Easy Day Hikes Grand Teton (Best Easy Day Hikes Series)",
        "Authors": "By Schneider, Bill",
        "Description": "",
        "Category": " Travel , United States , West , Mountain (AZ, CO, ID, MT, NM, NV, UT, WY)",
        "Publisher": "FalconGuides",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Selling To VITO (The Very Important Top Officer)",
        "Authors": "By Parinello, Anthony",
        "Description": "Selling to Vito contains all the tactics you need to get appointments with impossible-to-reach top decision-makers. They in fact are the Very Important Top Officers (VITOs), the people with the ultimate veto power who hold the key to bigger commission checks, every sales award you could possibly win, and VITO to VITO referrals that you can take to the bank!You'll quickly learn how to:Get into new accounts at the topKeep out of time-consuming log-jams-and into VITO's officePromote loyalty at the top with existing customers and capture add-on businessIncrease the size of every saleSelling To VITO offers innovative new ideas and street-smart tactics for reaching the very top person in any organization. It's based on the seminars that have helped thousands of sales professionals from top corporations like Canon, 3M, Hewlett-Packard, and MCI bust quotas and increase commissions. It can help you, too, by getting you to the right person so you can do what you do best: SELL!Anthony Parinello is without question the country's foremost expert on getting appointments with, and selling to, top decision makers. This book is the product of his twenty-three years of award-winning sales performance.",
        "Category": " Business & Economics , Sales & Selling , General",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Where Is God When It Hurts?",
        "Authors": "By Yancey, Philip",
        "Description": "Discusses the pain that is experienced in life and in relationships, and asks the questions, what can we do to help those who hurt, and who can help us when we suffer?",
        "Category": " Religion , Spirituality",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "JFK: Reckless Youth",
        "Authors": "By Hamilton, Nigel",
        "Description": "JFK: Reckless Youth is the first volume of a monumental new biography of John F. Kennedy - a book that will astonish, entertain, and inform all those interested in the life of America's thirty-sixth president.Who was the real JFK? Reckless Youth is filled with intriguing new material on virtually every aspect of JFK's early years: his Boston-Irish background; his beloved grandfather Honey Fitz; his draft-dodging, swindling father, Joseph P. Kennedy; his parents' disastrous and dysfunctional marriage; his loveless upbringing; his expulsion from boarding school; his false starts at college in London and Princeton, followed by his triumphant career at Harvard; his protracted struggle against his father's defeatism and isolationism before Pearl Harbor; his ceaseless career as a playboy; his lifelong battle with illness, and the origins of the deadly disease that would plague him in later days.In retelling JFK's extraordinary life story, Nigel Hamilton has finally succeeded in getting beyond the many accretions and distortions of recent years. Here at last - often in JFK's own inimitable words - is the real John F. Kennedy, at once roguish and intelligent, reckless and yet possessing fine judgment. Based on a wealth of never previously published letters and documents, and access to more than two thousand interviews, Hamilton's portrait of the tormented, fun-loving, deeply amorous, and yet ambitious youth who was John F. Kennedy is profoundly touching. JFK's courage, despite debilitating ill health, in joining the Navy and insisting on service in PT boats comes to a dramatic climax with the saga of PT 109 in the Solomons - the only American vessel ever rammed and sunk by a Japanese destroyer. Against this legendary backdrop Hamilton reveals for the first time the intimate story of the greatest love of JFK's early life: his passionate romance with a suspected enemy spy, Inga Arvad.The Kennedy that emerges from this volume is, behind his playboy facade, vastly more driven and more serious than historians have ever before portrayed him. As Hamilton shows us, though Joseph Kennedy reluctantly transferred the family's political mantle to his second son in 1944 and \"bought out\" the sitting congressman for Massachusetts' 11th District, the presidential dream that the ambassador had reserved for his eldest son was in fact JFK's own secret ambition, confessed to his mistress many years before his brother Joe's tragic death.In this absorbing, riveting family saga, we see the true Jack Kennedy, warts and all; a symbolic, relentlessly honest, yet sympathetic story of the struggles of youth and early manhood that will not only entrance its readers but will also forever alter our understanding of this century's most popular and charismatic American president.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Random House",
        "Price Starting With ($)": "7.26",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Country Roads of Virginia",
        "Authors": "By Seldon, W. Lynn and Tatgenhorst, Anne (ILT)",
        "Description": "",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Country Roads Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Virginia Handbook",
        "Authors": "By Howard, Blair",
        "Description": "",
        "Category": "",
        "Publisher": "Hunter Pub Inc",
        "Price Starting With ($)": "6.68",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Window Treatment Decorating Ideas (Better Homes & Gardens)",
        "Authors": "By Better Homes and Gardens Books, Hallam, Linda (EDT), and Kramer, Brian (EDT)",
        "Description": "In their efforts to bring the outdoors in, people are indulging in more windows than ever before. This book answers their questions about how to create window treatments that work with the way they live. Explores casual, traditional, eclectic, and cottage-style window treatments:Emphasize favorite motifsCamouflage imperfectionsAdd subtle textureConsiders important practicalities:PrivacyLight controlAir flowTraffic patternsElevates window treatment design to a new level: Room-by-room strategiesDecor-driven designsCreating illusions",
        "Category": " House & Home , Decorating",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Naked Empire: Sword of Truth (Sword of Truth, 8)",
        "Authors": "By Goodkind, Terry",
        "Description": "Beginning with Wizard's First Rule and continuing with six subsequent fantasy masterpieces, Terry Goodkind has thrilled and awed millions of readers worldwide. Now, in Naked Empire, Goodkind returns with a broad-canvas adventure of epic intrigue, violent conflict, and terrifying peril for the beautiful Kahlan Amnell and her husband, the heroic Richard Rahl, the Sword of Truth.Richard Rahl has been poisoned. Saving an empire from annihilation is the price of the antidote. With the shadow of death looming near, the empire crumbling before the invading hordes, and time running out, Richard is offered not only his own life but the salvation of a people, in exchange for delivering his wife, Kahlan, into bondage to the enemy.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Tor Fantasy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Fatal Equilibrium: A Novel",
        "Authors": "By Jevons, Marshall",
        "Description": "At Harvard, tenure decisions are a matter of life -- or death.For Dennis Gossen, the economics department whiz kid currently being considered for tenure, it's definitely death. When he's turned down by the high-and-mighty Promotion and Tenure Committee, Gossen commits suicide.A Question of Cost Accounting...Or does he? It's hard to imagine why a young man with a brilliant scholarly future -- at Harvard or not -- would come up with an equation in which the opportunity cost of killing himself (a high price, considering his potential earnings) would be outweighed by the emotional cost of failing to receive tenure.... Or Utility?Then two members of the P and T Committee are murdered, and it becomes clear to Professor Henry Spearman of the Economics Department that the killer must be on the committee. But which of his illustrious colleagues would have significantly increased his -- or her -- utility (i.e., happiness) by murdering a faculty member or two? Or three?",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "July",
            "Year": "1986"
        }
    },
    {
        "Title": "The Sun Over Breda",
        "Authors": "By Perez-Reverte, Arturo",
        "Description": "Arturo Pérez-Reverte has enthralled readers and critics around the globe with his Captain Alatriste series. Having sold four and a half million copies to date in the Spanish-speaking world, the series has made Pérez-Reverte a literary superstar and his fictional seventeenth-century mercenary a national icon. And the appeal of Pérez-Reverte's adventurer and his exploits continues to grow, as evidenced by the extraordinary reception for the first two translated volumes in the series-Captain Alatriste and Purity of Blood.  And now, in The Sun over Breda, Pérez-Reverte continues his thrilling chronicle of the swordsman-for-hire, as Captain Alatriste takes up his blade and rejoins his elite Cartagena regiment as they take part in the battles and siege of Breda. Fifteen-year-old Íñigo Balboa enlists to serve as his master's aide, and narrates their further adventures of swordplay and skirmishes, of mutiny and wartime honor. And, back in Spain, Alatriste's nemesis Luis de Alquézar grows more powerful, as Íñigo's mysterious friend Angélica hints at some plans upon his return",
        "Category": " Fiction , Literary",
        "Publisher": "G.P Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Bugialli's Italy: Traditional Recipes From The Regions Of Italy",
        "Authors": "By Bugialli, Giuliano",
        "Description": "Emilia-Romagna, Friuli, Sicily, Liguria, Piedmont, Apulia -- the names trip off the tongue and conjure seductive images of deeply satisfying food. In Bugialli's Italy, companion cookbook to the new twenty-six-part public television series, cooking teacher and food historian Giuliano Bugialli presents the reader with an irresistible banquet of all Italy has to offer.The more than 150 recipes collected here span the boot from north to south east to west. You can take your grand tour from antipasto to dessert (how about Pizza with Tomato Pockets from Apulia, Pureed Chick-Pea Soup with Mushrooms from Umbria, Lamb in Peppery Wine Sauce from Abruzzi, String Beans in Caper Walnut Sauce from Lombardy, and, to finish, Peach Cake with Almonds from Piedmont?). Or why not plan a regional tasting of pastas -- Stewed Sardinian Pasta, Pasta Stuffed with Eggplant from Tuscany, Tagliatelle and Zucchini Blossoms from Lazio, and Pasta with Sicilian Winter Pesto? Even gnocchi flies the regional flag-Red Beet Gnocchi from Piedmont and Potato Gnocchi with Ligurian Pesto and Tomatoes.As always, Giuliano serves up something new -- a wonderful collection of unusual and engaging regional recipes filled with the history tradition, and techniques that make his books so special.",
        "Category": " Cooking , Regional & Ethnic , Italian",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "6.47",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The Nanny Diaries",
        "Authors": "By McLaughlin, Emma and Kraus, Nicola",
        "Description": "WANTED:One young woman to take care of four-year-old boy.  Must be cheerful, enthusiastic, and selfless--bordering on masochistic.  Must relish sixteen-hour shifts with a deliberately nap-deprived preschooler.  Must love geting thrown up on, literally and figuratively, by everyone in his family.  Must enjoy the delicious anticipation of ridiculously erratic pay.  Mostly, must love being treated like fungus found growing out of employer's Hermes bag.  Those who take it personally need not apply. Who wouldn't want this job?  Struggling to graduate from NYU and afford her microscopic studio apartment, Nanny takes a position caring for the only son of the wealthy X family.  She rapidly learns the insane amount of juggling involved to ensure that a Park Avenue wife, who doesn't work, cook, clean, or raise her own child, has a smooth day.When the X's marriage begins to disintegrate, Nanny ends up involved way beyond the bounds of human decency or good taste.  Her tenure with the X family becomes a nearly impossible mission to maintain the mental health of their four-year-old, her own integrity, and, most important, her sense of humor.  Over nine tense months, Mrs. X and Nanny perform the age-old dance of decorum and power as they test the limits of modern-day servitude.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Teacher Man: A Memoir",
        "Authors": "By McCourt, Frank",
        "Description": "From the Pulitzer Prize-winning, mega-bestselling author who wore his celebrity with extraordinary grace comes a magnificently appealing book about teaching and about how one great storyteller found his voice.Frank McCourt became an unlikely star when, at the age of sixty-six, he burst onto the literary scene with Angela's Ashes, the Pulitzer Prize-winning memoir of his childhood in Limerick, Ireland. Then came 'Tis, his glorious account of his early years in New York.  Now, here at last is McCourt's long-awaited book about how his thirty-year teaching career shaped his second act as a writer. Teacher Man is also an urgent tribute to teachers everywhere. In bold and spirited prose featuring his irreverent wit and compelling honesty, McCourt records the trials, triumphs and surprises he faced in the classroom. Teacher Man shows McCourt developing his unparalleled ability to tell a great story as, five days a week, five periods per day, he worked to gain the attention and respect of unruly, hormonally charged or indifferent adolescents.  For McCourt, storytelling itself is the source of salvation, and in Teacher Man the journey to redemption -- and literary fame -- is an exhilarating adventure.",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Consider Lily",
        "Authors": "By Dayton, Anne and Vanderbilt, May",
        "Description": "A tale of love, trials, and faith set against a wonderfully drawn portrait of San Francisco,Consider Lily is chick lit with a heart.Lily Traywick thinks she must have been adopted. It’s easier than believing she’s actually related to Jane and Roland Traywick, her power-couple parents who own Traywick’s of San Francisco, the most chichi department store on the West Coast. While her parents party with Muccia in Milan and Gabbana in Paris, Lily hangs out at home in ratty jeans and an old T-shirt. She loves softball, guys, and Jesus, and she’s eager to make her own way in the world. Feeling that her life is on hold, she turns to her best friend Reagan Axness. Reagan, a fashionista who has it all, offers just the solution: a major life makeover.Lily is soon dressing in the latest must-have fashions and pursuing a writing career. She’s even dating the “perfect” guy. But does he love her for who she really is? And will he be able to resist the tempting seductress who has her eye on him? As Lily’s old friends question her new way of life, and public scandal, family drama, and technological disasters add to her confusion, Lily is forced to consider whether her quest to have it all will cause her to lose everything that matters.Hot off their debut success, Emily Ever After, “good-girl” chick-lit trailblazers Dayton and Vanderbilt return with a witty, refreshingly real story of a young woman’s adventures in the high-powered world of San Francisco high fashion.",
        "Category": " Fiction , Women",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Belinda",
        "Authors": "By Rice, Anne and Rampling, Anne",
        "Description": "Obsessed with the mystery surrounding Belinda, his precocious sixteen-year-old lover, Jeremy Walker, a middle-aged illustrator of children's books, is swept into Belinda's world of Hollywood money, lust, and dark family secrets",
        "Category": " Fiction , Romance , General",
        "Publisher": "Jove",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    }
]