[
    {
        "Title": "The Omega Point",
        "Authors": "By Strieber, Whitley",
        "Description": "2012 came and went.  The world prepared itself for impending disaster--and nothing happened.  Or so it seemed.  But by 2020, energy from a supernova is disrupting the sun. Solar storms ravage the globe with unprecedented ferocity, and debris in the form of comets and asteroids threaten to end life on earth.  The wealthy of the world hide in vast underground bunkers, but even they know that they cannot survive without a miracle.  It all comes down to one man—a young psychiatrist named David Ford—who may hold the power to save the world.  Newly employed at the extravagant Acton Clinic, Ford encounters people who seem to understand what's happening… some may even possess an extraordinary knowledge of what’s to come.  One of them is the beautiful and enigmatic Caroline Light, who demands more from Ford than he could possibly give… another is cunning ex-CIA operative Mack Graham, a skilled killer with questionable loyalties…December 21, 2012 was not the end.  The end is The Omega Point: where time stops.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "The Maverick Queen",
        "Authors": "By Zane Grey",
        "Description": "",
        "Category": "",
        "Publisher": "Walter J. Black",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1950"
        }
    },
    {
        "Title": "The Hash Knife Outfit",
        "Authors": "By Grey, Zane",
        "Description": "",
        "Category": "",
        "Publisher": "Walter J. Black",
        "Price Starting With ($)": "10.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "St. Rita of Cascia",
        "Authors": "By Sicardo, Joseph",
        "Description": "One of the most popular Saints in the Church for centuries, St. Rita is known as the \\\"Saint of the Impossible\\\" because of her amazing answers to prayers, as well as the remarkable events of her own life. Desirous of being a nun, she instead obeyed her parents and married. Her husband was cruel, and caused her much suffering, to which she responded with love and prayers and eventually converted him. After the death of her husband and two sons, Rita was able to enter a convent, where she devoted herself to prayer and penance. She abandoned herself totally to God, diminishing herself as He increased in her. An inspiring story of a soul completely resigned to God\\'s will. 132 pgs, PB",
        "Category": " Religion , Christian Living , Inspirational",
        "Publisher": "TAN Books",
        "Price Starting With ($)": "11.05",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Garden styles",
        "Authors": "By Dickason, Kathleen S",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "In the owner's chair: Proven techniques for taking your business from zero to $10 million",
        "Authors": "By Torrence, Ronald W",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Creative Ideas for Lent, vol. 1",
        "Authors": "By Davidson, Robert G.",
        "Description": "",
        "Category": " Religion , Christianity , Literature & the Arts",
        "Publisher": "Educational Ministries",
        "Price Starting With ($)": "7.35",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Dynamics: Numerical Explorations (Applied Mathematical Sciences)",
        "Authors": "By Nusse, Helena Engelina and Yorke, James A.",
        "Description": "",
        "Category": " Mathematics , Number Theory",
        "Publisher": "Springer-Verlag",
        "Price Starting With ($)": "5.75",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Southwest Indian Craft Arts",
        "Authors": "By Tanner, Clara Lee",
        "Description": "Traces the origins and development of the baskets, textiles, pottery, silver, kachina dolls, and minor crafts of such people as the Pueblos, Navahos, Apaches, and Hopis",
        "Category": " Art , General",
        "Publisher": "University of Arizona Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1968"
        }
    },
    {
        "Title": "Promised Land Discovery Guide: 5 Faith Lessons",
        "Authors": "By Sorenson, Stephen, Vander Laan, Ray, and Sorenson, Amanda",
        "Description": "This five-session small group Bible study, Promised Land, by noted teacher and historian, Ray Vander Laan, is volume one of the 12-part Faith Lessons series.In Promised Land, Vander Laan illustrates how God guided his people to a specific place – the Promised Land – to impact the world both in ancient times and today. Just like the time and place of our birth shapes our journey, so the land and culture of the Hebrew people shaped their story. Promised Land provides wonderful context to the stories of that time. Filmed on location in Israel, Faith Lessons is a unique video series that brings God's Word to life with astounding relevance. By weaving together the Bible's fascinating historical, cultural, religious, and geographical contexts, teacher and historian Ray Vander Laan reveals unique insights into the Scriptures' significance for modern believers.This Discovery Guide includes five sessions. Each lesson…- Focuses on passages of Scripture explored in the DVD - Includes sidebars, maps, photos and other study tools- Features questions that facilitate discussion and inspire personal reflection- Include 30 personal Bible studies to help you deepen your learning experience between sessions, and turn lessons from the past into applications that impact how you live out your faith today.These illuminating \"faith lessons\" afford a new understanding of the Bible that will ground your convictions and transform your life. The Faith Lessons video series is ideal for use in small groups, personal and family Bible studies, and adult Sunday school. Individual believers and families will gain vital insights from long-ago times and cultures through this innovative approach to Bible study.This Discovery Guide is designed for use with the Faith Lessons Promised Land DVD (sold separately).Lessons include:1. Standing at the Crossroads –Tel Gezer2. Wet Feet – Jordan River 3. First Fruits – Tel Jericho4. Confronting Evil – Tel Beth Shemesh5. Iron of Culture – Tel Azekah",
        "Category": " Religion , Biblical Studies , Bible Study Guides",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "The Silent Gift",
        "Authors": "By Landon, Michael, Jr. and Kelley, Cindy",
        "Description": "The 1930s were a decade of enormous uncertainty--for the world, for America, and in particular for one lonely, struggling mother and her disabled son.  Their story is one of love and enormous sacrifices in the face of circumstances horrendous beyond belief.  When her husband leaves her for someone whose time isn't wrapped up in a silent, handicapped kid, Mary and little Luke are out on their own in a world that has no room for the poor and disabled.  Especially not at a time when most Americans are simply trying to survive their economic woes and job losses.But then arrives The Gift...Where has it come from, and why?  How can a young boy who can neither hear nor speak provide comfort, direction, and sometimes challenges to seekers who learn of the special ability?  Whatever the source, its presence brings a single shaft of light and hope to Mary and her beloved Luke.  Will it be enough?",
        "Category": " Fiction , Christian , Historical",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Thoreau's Legacy: American Stories about Global Warming",
        "Authors": "By Hayes, Richard, ed.",
        "Description": "",
        "Category": "",
        "Publisher": "Union of Concerned Scientists",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Jesus by the Sea of Galilee",
        "Authors": "By Diamond, Lucy",
        "Description": "",
        "Category": "",
        "Publisher": "Ladybird Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Dinosaurs (Hot Topics)",
        "Authors": "By Traditional",
        "Description": "",
        "Category": "",
        "Publisher": "Son Schein",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "His Name Is Jesus",
        "Authors": "By Syswerda, Jean (COM)",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Sex and Real Estate: Why We Love Houses",
        "Authors": "By Garber, Marjorie",
        "Description": "A witty and insightful collection of cultural analyses explores the complex relationship that exists between ourselves and our homes, in essays that address such topics as \"The House as Mother,\" \"The House as Body,\" \"The Dream House,\" and \"The Trophy House.\" 12,500 first printing.",
        "Category": " Social Science , Popular Culture",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Momology: A Mom's Guide to Shaping Great Kids",
        "Authors": "By Radic, Shelly and Overton, Naomi Cramer (FRW)",
        "Description": "Mothering is part art, part science, and always a work in progress! Backed by more than thirty years of research-based ministry at MOPS International, Momology is designed to help you be the unique mother God created you to be---because better moms make a better world.\"No mom should mother alone---you need all the support you can get. Momology brings kitchen-table wisdom and recent research together so you'll have just what you need to raise great kids.\"---Dr. Kevin Leman, author of Have a New Kid by Friday and The Birth Order Book\"An entertaining and informative collection of stories, strategies, statistics, and sound advice. From the finesse of day-to-day parenting to the big picture of what it means to be called God's child, Momology is filled with great insights presented in a way even a dad can enjoy!\"---Mike Nawrocki, co-creator of Veggie Tales and voice of Larry the Cucumber\"A treasure book filled with practical, informative, inspiring, and creative ideas to help guide moms in raising happy, productive, God-loving children.\"---Fern Nichols, president, Moms in Touch Intl.\"Momology offers research, stories, and real-life applications from other moms, and then reminds you that you are a resilient, resourceful woman who brings unique qualities to your mothering. So you are capable of examining your options---mixing and matching, trying and tweaking--- to find the creative combination that works for you. That's why I believe Momology is the most user-friendly, relevant, and complete resource for moms today.\"---Carol Kuykendall, author of five-Star Families\"The ideas and solutions from real moms in Momology ooze with authenticity and demonstrate how other moms not only survive, but thrive.\"---Dr. Mary Manz Simon, practical parenting specialist",
        "Category": " Religion , Christian Life , Family",
        "Publisher": "Revell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "FROM THE TEETH OF ANGELS",
        "Authors": "By Carroll, Jonathan",
        "Description": "Jonathan Carroll is no longer just a cult author. His previous novel, After Silence, placed this gifted and award-winning writer squarely in the mainstream. The San Francisco Chronicle raved, \"After Silence is filled with people who feel as real as one's closest friends, observed with a penetrating, and sometimes brutally chilling, clarity...a taut, original work whose excellence fulfills the promises made by this remarkable author over the last dozen years.\" In From the Teeth of Angels, Jonathan Carroll returns to that unique literary landscape that he paves with magic and wonder.While vacationing in Sardinia, Ian McGann meets Death in a dream. Death promises to answer any of McGann's questions, but if he fails to understand the answers, he will have to pay with his life.In Los Angeles, successful film actress Arlen Ford is no longer happy living in the Hollywood fast lane. She gives up everything - her career, her house, her glamorous lifestyle - and moves to Austria, where she meets a passionate war correspondent. From the start, their relationship is all-consuming. Arlen realizes she has been waiting for this man all her life.And in Vienna, the terminally ill Wyatt Leonard suddenly discovers that he has the ability to raise the dead.How all three of these extraordinary fates converge is at the heart of Jonathan Carroll's most daring and provocative novel, in which he dares to ask - and answer - the ultimate question: What is Death?",
        "Category": " Fiction , Literary",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "15.64",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Secret Daughter: A Novel",
        "Authors": "By Gowda, Shilpi Somaya",
        "Description": "“Moving and thought-provoking and informative and imaginative and beautifully executed.  What a wonderful story!”—Mary Jane Clark “This book is a must for anyone touched by adoption, or India, or the delicate dynamic between adolescent girls and their mothers.”—Sujata Massey, author of Shimura Trouble Secret Daughter, a first novel by Shilpi Somaya Gowda, explores powerfully and poignantly the emotional terrain of motherhood, loss, identity, and love through the experiences of two families—one Indian, one American—and the child that binds them together. A masterful work set partially in the Mumbai slums so vividly portrayed in the hit film Slumdog Millionaire, Secret Daughter recalls the acclaimed novels of Kim Edwards and Thrity Umrigar, yet sparkles with the freshness of a truly exciting new literary voice.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2011"
        }
    },
    {
        "Title": "Constant Forward Motion: The Running of the Lymphoma Ultra Series",
        "Authors": "By Burns, C. Craig",
        "Description": "",
        "Category": "",
        "Publisher": "C. Craig Burns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Anna Elizabeth: A Girl of the Plain People",
        "Authors": "By Long, Lucile, Brandt, Lucile, and Goughnour, Inez",
        "Description": "Relates a young girl's struggle for an education in a Brethren community in eighteenth-century Pennsylvania.",
        "Category": "",
        "Publisher": "Brethren Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1970"
        }
    },
    {
        "Title": "Letters from Pemberley, the First Year: A Continuation of Jane Austen's Pride and Prejudice",
        "Authors": "By Dawkins, Jane",
        "Description": "",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Chicken Soup Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "One Home at a Time (Focus on the Family)",
        "Authors": "By Rainey, Dennis",
        "Description": "Few would disagree that this country needs a revival. But how does such change come about?One Home at a Time. Page after insightful page, Dennis Rainey combines biblical principles with practical guidelines to help readers revitalize their families and ignite a family reformation in our society. They'll learn how to integrate into their home the Family Manifesto-a dynamic, Scripture-based model of how the family should function-and see how keeping God's standards in their everyday lives can be a catalyst for widespread cultural change. It's a definitive guide for parents and couples who want to create godly homes and impact their communities.",
        "Category": " Family & Relationships , General",
        "Publisher": "Focus on the Family",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Die Happy",
        "Authors": "By Burke, Tim and Burke, Michael",
        "Description": "Attention, guys of America: It's time to get off the couch, turn off the PlayStation, and set down your beer (just kidding—never set down your beer). Your days of freedom are numbered. Every guy owes it to himself to do something audacious, ostentatious, hilarious, or just plain fun before it's too late. The time is now for the kinds of things that will be decidedly against the rules after you \"settle down.\" Die Happy is here to help you create the kind of stories you'll be telling for the rest of your life. Stories about things like: · How you spent your graduation cash: You start at Oktoberfest in Munich and wake up on a Thai beach (which is totally what your Aunt Edith had in mind). From Fantasy Fest to La Tomatina, here's a breakdown of the wildest parties and the craziest worldwide destinations.· The best places to, ahem, explore other cultures (or whatever): Corfu's Pink Palace. Ireland's pubs. Amsterdam's Red Light District. Ibiza. Plus plenty of other fascinating events and locales, many of which also happen to serve booze.· Getting a job (don't worry, not a real job): Jet Ski guy. Cruise ship bartender. Casino dealer. Lifeguard. Roadie. Where and how to earn the money to subsidize your fun, usually in some exotic location full of very friendly women.At once a \"How To,\" a \"To Do,\" and a \"We Did,\" Die Happy contains all the ideas, checklists, and insanely funny true stories you'll need to help you have as much fun as possible—while you still can.",
        "Category": " Travel , Special Interest , Adventure",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Planet Earth: Questions and Answers (Explore Our World)",
        "Authors": "By Capella",
        "Description": "",
        "Category": " Juvenile Nonfiction , Science & Nature , General",
        "Publisher": "Arcturus Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "From Tadpole to Frog (Let's-Read-and-Find-Out Science 1)",
        "Authors": "By Pfeffer, Wendy and Keller, Holly (ILT)",
        "Description": "Winner of the American Association for the Advancement of Science/Subaru Science Books & Films Prize for Outstanding Science SeriesA tadpole is a baby frog!Female frogs lay masses of jelly-coated eggs in the water, but what hatches from each egg isn&#39;t a frog yet—it&#39;s a tadpole. Tadpoles are likely tiny fish that breathe underwater through gills. As the tadpole gets older, it loses its fishy tail and its gills and grows legs and develops lungs. The tadpole has become a frog. From Tadpole to Frog is a lovely first look at this amazing metamorphosis.",
        "Category": " Juvenile Nonfiction , Science & Nature , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "To Avoid Catastrophe: A Study in Future Nuclear Weapons Policy",
        "Authors": "By Hamilton, Michael Pollock (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "W. B. Eerdmans Pub. Co",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Smiles to Go",
        "Authors": "By Spinelli, Jerry",
        "Description": "Ninth grader Will Tuppence is in control.He plans everything obsessively, from the perfect stargazing night with his crush, Mi-Su, to the regular Saturday-night games of Monopoly with his friends. He&#39;s even planned his entire adulthood: career as an astronomer; mint condition, black 1985 Jaguar XJS/12; two kids. . . .But everything changes the day Will learns one startling fact: protons—those tiny atomic particles, the building blocks to the building blocks of life—can die. The one thing that was so certain in this world to Will has an expiration date.And Will&#39;s carefully planned-out life?Not so certain, either.",
        "Category": " Juvenile Fiction , Social Themes , Adolescence & Coming of Age",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "The Complete Vegetarian Cuisine: Revised and updated with 70 new recipes",
        "Authors": "By Elliot, Rose",
        "Description": "Rose Elliot has assembled in this revised and updated edition everything you need to know about vegetarian cooking and health. The more than three hundred recipes - seventy of them new to this edition - are illustrated with stunning color photographs and instructional drawings. There are everyday favorites, unusual but easy-to-prepare dishes, and established classics, all presented with great knowledge and flair.Inside you'll find: A uniquely comprehensive and detailed look at ingredients from around the world - pasta, grains, fruit, cheeses, nuts, beans and vegetables of every variety. Each has been photographed in full color, and is accompanied by instructions on how to select and prepare them and which recipes suit them best. Ten special seasonal menus - including a spring picnic, an autumn barbecue, and a Christmas feast. Full information on menu planning and nutrition for the vegetarian and sound advice on kitchen equipment, microwaving, freezing, and entertaining.",
        "Category": " Cooking , Vegetarian",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Portfolio Keeping: A Guide for Students",
        "Authors": "By Reynolds, Nedra",
        "Description": "Brief and inexpensive, Portfolio Keeping, Third Edition provides all the information students need to create successful portfolios either in print or online. With expanded coverage of e-portfolios, portfolios across the curriculum and outside the academy, and reflective thinking and writing, the new third edition will help students and instructors using portfolios in any situation. This book is also available as an e-book within the Bedford e-Portfolio.",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Bedford/st Martins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Foundations and Clinical Applications of Nutrition: A Nursing Approach",
        "Authors": "By Grodner, Michele, Deyoung, Sandra, and Long, Sara",
        "Description": "Foundations and Clinical Applications of Nutrition: A Nursing Approach approaches the study of nutrition and diet therapy from the personal and professional perspective of nursing students. It emphasizes the role of nursing in health promotion and primary prevention, as well as in medical nutrition therapy. Skills essential for nursing professionals are emphasized for implementation and education of patients and clients about prescribed dietary patterns. A special feature entitled The Nursing Approach ends each chapter, demonstrating the continual application of the nursing process to each content area, and nursing-related content is integrated throughout the text.Margin definitions and margin notes provide further understanding of chapter content, as well as practical teaching tips for use with clients/patients.Life Span Approach icons highlight age-related variations that require modification of assessment and teaching.Teaching Tool boxes provide practical approaches to teaching clients about nutrient and medical nutrition therapy. When appropriate, specific issues of literacy such as strategies for enhancing patient education for those with low literacy skills are also presented in these boxes.Myth boxes provide a basis for eliminating misconceptions about nutrition and health by clarifying the facts.Health Debate boxes encourage students to develop their own opinions on controversial health issues.Social Issue boxes explore ethical, social, and community concerns on local, national, and international levels to emphasize the various influences on health and wellness.Cultural Considerations boxes and a cultural sensitivity approach include ethnic food pyramids and highlight multicultural issues to help students approach, interview, and assess patients from diverse cultural backgrounds.Toward a Positive Nutrition Lifestyle sections in numerous chapters feature psychosocial strategies to support behavioral changes related to health for students and their clients/patients.The Nursing Approach feature demonstrates the continual application of the nursing process to each content area.Critical Thinking/Clinical Applications offer case study scenarios in the medical nutrition therapy chapters, allowing students to apply knowledge to actual clinical situations.Applying Content Knowledge sections provide review questions for students to ensure chapter content comprehension.Web Sites of Interest allow for further study of chapter concepts.The chapter on Management of Body Composition takes a contemporary approach to weight and acknowledges that total fitness and wellness can be experienced by persons of all sizes and equips nurses to educate and support this approach.Healthy People 2010 nutrition goals and objectives are incorporated where applicable, integrating personal nutrition goals with national objectives for communities.This framework clarifies how the nutritional status of our communities reflects individual nutritional health.Features a new chapter on Complementary and Alternative Therapies. Traditional medicine is being challenged by complementary and alternative perspectives; the authors have written this new chapter to provide students with an introduction to these perspectives.Includes the latest Dietary Reference Intakes (DRIs) information and guidelines (including the newest publication, Dietary Reference Intakes for Energy, Carbohydrates, Fiber, Fat, Fatty Acids, Cholesterol, Protein, and Amino Acids), providing students with the tools to interpret ever-changing nutrition information, as well as the skills to make well-informed personal and professional decisions.A new Web Activities icon directs students online for answers to text activities, plus additional activities and answers, to enhance comprehension of chapter content.",
        "Category": " Medical , Nursing , Nutrition",
        "Publisher": "Mosby",
        "Price Starting With ($)": "7.4",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Complete Idiot's Guide to Gardening, 2E (The Complete Idiot's Guide)",
        "Authors": "By O'Connor, Jane and Sweeney, Emma",
        "Description": "What plants are right for my garden?  What exactly is a hardiness zone?  Do I need to go back to school to figure out those scary-looking Latin names?  For those intimated by pH scales, potting soil, and perennials, this revised bestseller comes to the rescue with answers to scores of gardening questions.  The Complete Idiot's Guide to Gardening is a concise, user-friendly guide for beginners that covers all the basics-from choosing a site, testing the soil, and picking appropriate plants to simple gardening techniques, design concepts, and weed/pest control.  Included as well are extensive lists of all types of easy-to-grow plants, tips on how to save money on tools, and much more.  New features include full-color photographs, an expanded appendix, and dozens of new illustrations.",
        "Category": " Gardening , Reference",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Little Northwest Cookbook",
        "Authors": "By Stang, Kathleen and Lavin, John (ILT)",
        "Description": "Presents recipes for dishes from the Pacific Northwest, including cranberry-lemon scones, Basque sheepherder's bread, oyster stew, grilled salmon, sauteed wild mushrooms, and Northwest blackberry cobbler",
        "Category": " Cooking , Regional & Ethnic , American , Northwestern States",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "101 Essential Tips: Cat Care",
        "Authors": "By James Harrison",
        "Description": "",
        "Category": "",
        "Publisher": "DK Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Ultimate Container Gardener: Over 150 Glorious Designs for Planters, Pots, Boxes, Baskets and Tu",
        "Authors": "By Donaldson, Stephanie",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "6.39",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Re-churching the Unchurched",
        "Authors": "By Barna, George",
        "Description": "",
        "Category": "",
        "Publisher": "Issachar Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Bright Baby Touch & Feel At the Zoo (Bright Baby Touch and Feel)",
        "Authors": "By Priddy, Roger",
        "Description": "Roger Priddy’s Bright Baby Touch and Feel At the Zoo is an interactive board book you can use to help your baby engage their senses through looking, touching, and listening. Cute pictures of animals, rhyming text to read aloud, and touch and feel textures make this book perfect for you and your bright baby.",
        "Category": " Juvenile Nonfiction , Animals , Zoos",
        "Publisher": "Priddy Books US",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Adrenaline",
        "Authors": "By Benedict, John",
        "Description": "",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Sterlinghouse Publisher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Over the Next Hill And Still Rolling: Jolly Jokes for (Not So) Older Folks",
        "Authors": "By Phillips, Bob",
        "Description": "",
        "Category": " Humor , Topic , Religion",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "52 Tips for Texas Hold 'em Poker",
        "Authors": "By Shulman, Barry, Gregorich, Mark, and Wiesenberg, Michael (EDT)",
        "Description": "One of the fascinating aspects about hold’em is its dual nature. The game is both incredibly simple and incredibly complex. If you’ve watched any World Poker Tour (WPT) broadcast, you’ve heard hold’em described as a game that “takes a minute to learn and a lifetime to master.” That is really true, and a large part of the appeal of the game is that you can sit down and learn how to play almost immediately. However, after playing a bit, you become aware that hold’em has many layers, each more complex than the previous one. The deeper you develop your understanding of the game, the better your results should be. The best thing for you is this: most players never work to develop their games. What they know about the game is strictly what they draw from their personal experience at the table, much of which they don’t properly interpret. In fact they often misinterpret their experience in counterproductive ways. So there is great opportunity for those who wish to invest a bit of time and effort in improving their game.  Currently, a huge number of books on limit hold’em are available, with many more being written. However, very little exists for the brand new player, whose only exposure to hold’em may be what he has seen on television and perhaps a few hands played at a casino or in a home game.This book provides someone who has played little or no limit hold’em with a sound basic strategy that will add to both his enjoyment of the game and his bottom line. You must walk before you can run, and this book teaches those first steps.",
        "Category": " Games , Card Games , Poker",
        "Publisher": "Card Player Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "God's Little Book of Promises for Mothers (Gods Little Book of Promises Book)",
        "Authors": "By Honor Books",
        "Description": "",
        "Category": "",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Barbie and the Diamond Castle (Barbie) (Little Golden Book)",
        "Authors": "By Man-Kong, Mary",
        "Description": "BARBIE® AND TERESA star as best friends whose loyalty is put to the test when the evil muse Lydia tempts them with gems and jewels to reveal the secret of the Diamond Castle! The soon-to-be-classic Barbie™ & the Diamond Castle DVD movie is retold in this beloved Little Golden Book.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Animal Hide-And-Seek (Touchy Feely Flap Book)",
        "Authors": "By Cartwright, Stephen (ILT) and Tyler, Jenny",
        "Description": "While one cow, two pigs, three sheep, and increasing numbers of other animals can be found in their usual spots on the farm, one of each kind of farm animal is hiding behind the flaps.",
        "Category": " Juvenile Fiction , Concepts , Senses & Sensation",
        "Publisher": "Usborne Pub Ltd",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Animals, Animals, Animals! Mad Libs Junior",
        "Authors": "By Price, Roger and Stern, Leonard",
        "Description": "What could be more appropriate than a book devoted to all the animals, what they eat, and their habitats. With everything from your favorite pets to wild animals to farm animals?Animals, Animals, Animals! Mad Libs Junior is perfect for the animal lover in all of us!",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "Mad Libs",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "50 Years of Dissent",
        "Authors": "By Mills, Nicolaus (EDT), Walzer, Michael (EDT), and Cohen, Mitchell (INT)",
        "Description": "A selection of influential articles from a prestigious magazine celebrating its fiftieth anniversaryDissent was founded in 1954 by intellectuals angered by the rightward drift of the country but uneasy with the dogmatism they saw on the American left, and it has provoked debates about political ideas and about American and global issues ever since. This provocative book—a collection of articles published in Dissent over the past fifty years—presents essays from each decade of Dissent’s life that reveal how the magazine viewed that era, along with a new foreword to each section written by a contemporary Dissenter that provides perspective on the period. Articles include:* Norman Mailer on “Surplus Values and Mass Media”* Irving Howe on “New Styles in Leftism”* Theodore Draper on “Ghosts of Vietnam”* Sean Wilentz on “Bankruptcy and Zeal”* Michael Kazin on “A Patriotic Left”* Dwight MacDonald on “America, America”* and much more",
        "Category": " Political Science , Reference",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "This Gospel Shall Be Preached",
        "Authors": "By McGee, Gary B.",
        "Description": "Reviews the development of the Division of Foregin Missions of the General Council of the Assemblies of God, and analyzes the factors tha tled to its growth between 1914 and 1959.",
        "Category": " Religion , Christian Ministry , Missions",
        "Publisher": "Gospel Publishing House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Santa Claus Has a Busy Night (Series S808)",
        "Authors": "By Bradbury, Lynne",
        "Description": "",
        "Category": "",
        "Publisher": "Ladybird Books",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "The Best American Crime Writing 2005",
        "Authors": "By Penzler, Otto (EDT) and Cook, Thomas H. (EDT)",
        "Description": "The 2005 edition of The Best American Crime Writing offers the year's most shocking, compelling, and gripping writing about real-life crime, including Peter Landesman's article about female sex slaves (the most requested and widely read New York Times story of 2004), a piece from The New Yorker by Stephen J. Dubner (the coauthor of Freakanomics) about a high-society silver thief, and an extraordinarily memorable \"ode to bar fights\" written by Jonathan Miles for Men's Journal after he punched an editor at a staff party. But this year's edition includes a bonus -- an original essay by James Ellroy detailing his fascination with Joseph Wambaugh and how it fed his obsession with crime -- even to the point of selling his own blood to buy Wambaugh's books. Smart, entertaining, and controversial, The Best American Crime Writing is an essential edition to any crime enthusiast's bookshelf.",
        "Category": " True Crime , General",
        "Publisher": "Ecco",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Ballet Student's Primer",
        "Authors": "By Kay Ambrose, Celia Franca",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1954"
        }
    },
    {
        "Title": "Snakes (Zoobooks Series)",
        "Authors": "By Wexo, John Bonnett",
        "Description": "",
        "Category": " Juvenile Nonfiction , Animals , Reptiles & Amphibians",
        "Publisher": "Zoobooks/Wildlife Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "No Perfect People Allowed: Creating A Come As You Are Culture in the Church",
        "Authors": "By Burke, John",
        "Description": "How do we live out the message of Jesus in today's ever-changing culture? The church is facing its greatest challenge---and its greatest opportunity---in our postmodern, post-Christian world. God is drawing thousands of spiritually curious 'imperfect people' to become his church---but how are we doing at welcoming them?No Perfect People Allowed shows you how to deconstruct the five main barriers standing between emerging generations and your church by creating the right culture. From inspiring stories of real people once far from God, to practical ideas that can be applied by any local church, this book offers a refreshing vision of the potential and power of the Body of Christ to transform lives today.'We now are living in a post-Christian America---and that means we must be rethinking ministry through a missionary mindset. What makes this book both unique and extremely helpful is that it is filled with real-life stories of post-Christian people becoming followers of Jesus---not just statistics or data about them.' Dan Kimball, Author, The Emerging Church'. . . John's 'get it' factor with people, lost or found, is something to behold!   Reading this book filled me with optimism regarding the next generation of pastors and faith communities . . .'  Bill Hybels, Senior Pastor, Willow Creek Community ChurchNo Perfect People Allowed is a timely and necessary word for church leaders in a post Christian culture. John Burke serves up quite a tasty meal full of the rich nutrients that will strengthen the Body of Christ. Randy Frazee, Senior Pastor, Pantego Bible Church; Author, The Connecting Church and Making Room for Life",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Dead Hollywood Mom's Society: A Novel",
        "Authors": "By Maracotta, Lindsay",
        "Description": "In a town once described as the Sodom of the New World, the family craze is in full swing - movie stars posing pregnant on the cover of Vanity Fair, powerhouse agents breast-feeding at Spago - giving rise to the latest show-biz phenomenon - the Hollywood mom.Lucy Freers, an animation filmmaker, is one of this new breed. Her marriage to the well-known Hollywood producer Kit Freers is developing widening rifts and her daughter, Chloe, seems to be learning her values from MTV. And when glamorous neighbor Julia Prentice is found naked and dead in Lucy's pool, the facade of her perfect life is irrevocably shattered. Desperate to restore some normalcy to her life and to unlock the puzzle behind wild Julia's demise, Lucy submerges herself beneath the veneer of family values in Hollywood. In the course of her investigation, she has a brush with an affair with a sexy young screenwriter and an even closer brush with death as she delves into a world where there lurk as many unexpected plot twists as in any movie.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Don't Take Your Dreams to the Grave",
        "Authors": "By Jimmie Bratcher",
        "Description": "",
        "Category": "",
        "Publisher": "MileStones International Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Getting Started in Options, Fifth Edition",
        "Authors": "By Thomsett, Michael C.",
        "Description": "Everything you need to know to understand and profit from investing in options  Getting Started in Options  Puts and calls? Striking prices? Time values? If you feel unsure about investing in options, you’re not alone. Options have only been traded since the 1970s–so even the most seasoned investor may feel intimated by them. But don’t let the seeming complexity of this unique investment vehicle frighten you away from the potentially lucrative opportunities to be found in options investing. This straightforward guide thoroughly demystifies the options markets, helping you understand how they work, where they can fit into your personal financial picture, and how you can reap healthy returns from them. In nontechnical, easy-to-follow terms, Getting Started in Options, Fifth Edition arms you with the knowledge you need to make informed decisions about choosing stocks, tracking options, selling calls, and much more–including how to utilize the many new online resources.  You’ll learn how to  Master options terminology and concept Set up a plan based on your specific investment goal Read the mark et and spot specific risks associated with each type of optio Understand time values, striking price, and expiration–and use them effectivel Hedge and speculate like a seasoned pr Use options as insurance against losses in stock investment Pick the brokerage firm that’s right for yo Profit in these exciting markets and enhance your portfoli   Filled with new examples, updated charts, and timely additions to reflect important changes in this market, Getting Started in Options, Fifth Edition is a perfect primer to the world of options",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "How to Talk to Moms",
        "Authors": "By Greven, Alec and Acedera, Kei (ILT)",
        "Description": "Sometimes your mom seems like the most wonderful woman in the world. Sometimes you think she is mean and wants to ruin your life. Really, it is both. No matter how well you know your mom, chances are she's got a few tricks up her sleeve. Alec Greven may only be ten, but he will set you straight when it comes to figuring out the most important woman in your life. Tips: Don't use your shirt as a napkin or a Kleenex. Don't bring loose wildlife into the house—ever! Your mom will always love you no matter what.",
        "Category": " Juvenile Nonfiction , Humor , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Dreams Alive: Prayers by Teenagers",
        "Authors": "By Kock, Carl (EDT)",
        "Description": "Teens love to peek inside the inner thoughts of other teens. Over 140 prayers and reflections by teenagers from all over the United States have been collected in Dreams Alive. Their reflections touch on themes and feelings at the heart of young peoples' experiences--the future of the environment, the importance of friends and families, the challenges of making important decisions. Honest and articulate, optimistic or doubtful, these prayers reflect the insight and humor with which teenagers keep their dreams alive.",
        "Category": " Young Adult Nonfiction , Religion , General",
        "Publisher": "Saint Mary's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Smithson's Island: The Necessity of Solitude",
        "Authors": "By Smithson, Judith A.",
        "Description": "",
        "Category": "",
        "Publisher": "Lone Oak Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Whales, Dolphins and Porpoises (See & Explore Library)",
        "Authors": "By Carwardine, Mark and Camm, Martin (ILT)",
        "Description": "Explores the physical characteristics, behavior, habitat, and feeding habits of these underwater mammals.",
        "Category": " Juvenile Nonfiction , Animals , Marine Life",
        "Publisher": "Dk Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Flowering Shrubs (Burpee American Gardening Series)",
        "Authors": "By Druse, Kenneth",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Sandcastles: A Novel",
        "Authors": "By Rice, Luanne",
        "Description": "Luanne Rice is that rarest of all novelists who indelibly captures the defining moments in our lives. In this acclaimed bestseller, she takes readers on an unforgettable exploration of the most elusive miracle of all: how a broken family might be made whole again.Painter Honor Sullivan had the perfect love and the perfect life with her husband, a renowned photographer and sculptor—until the day John’s passions led him to disaster, shattering their family and her heart. Since then, Honor has struggled to make a safe haven for herself and their three daughters at Star of the Sea Academy on the magical Connecticut shore.Now, years later, a mysterious letter in a familiar hand hints at John’s return to the family he’s always loved more than anything on earth. It will take nothing short of a miracle to heal the rift between father and daughters, husband and wife, the past and the present—but a miracle is exactly what is in the making at Star of the Sea Academy. The only question is: Do you believe?",
        "Category": " Fiction , Romance , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "The Tavernier Stones: A Novel",
        "Authors": "By Parrish, Stephen",
        "Description": "When the body of seventeenth-century mapmaker Johannes Cellarius floats to the surface of a bog in northern Germany with a 57-carat ruby clutched in his fist, the grisly discovery ignites a deadly twenty-first-century international treasure hunt to unearth the fabled Tavernier stones.  The hoard reputedly contains some of the world's most notorious missing jewels, including the 280-carat Great Mogul diamond and the 242-carat Great Table diamond.Scrupulously honest Amish-born cartographer John Graf teams up with outlaw prospector and gemologist David Freeman in a ferocious race to find the treasure and break a secret code that will unravel the centuries-old Tavernier stones mystery. But other fortune hunters, opportunists and criminals alike, are in hot pursuit of the mismatched partners--and they'll stop at nothing to possess the legendary jewels.\"Relentlessly fascinating, Stephen Parrish's Tavernier Stones is reminiscent of Dan Brown's Lost Symbol . . . It's one hell of a good time.\"--Mark Terry, author of The Fallen",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Midnight Ink",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Golden Years of Baseball",
        "Authors": "By Kaplan, Jim",
        "Description": "Brings to life each distinct period of baseball history the way the fans of the time experienced it, through a survey of the game's greatest players, teams, and personalities and hundreds of illustrations.",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Interior Transformations",
        "Authors": "By Grafton, Ann, Chislett, Helen (PHT), and Chislett, Helen",
        "Description": "The creative director for interior design firm Colefax & Fowler offers advice on how to make key redesign decisions, in a guide that is complemented by hundreds of color photographs. 30,000 first printing.",
        "Category": " House & Home , Decorating",
        "Publisher": "Bulfinch",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Heian: Compositions by Seiju Toda",
        "Authors": "By Goldberg, Vicki",
        "Description": "Inspired by performance art and by the power of \"subtraction\" to find absolute beauty, Seiju Toda created a series of 33 compositions called \"Heian,\" a term meaning peace and serenity. In a meticulous process that took several years, Toda both assembled the pieces using plain wood and living creatures - birds, fish, insects, reptiles - and directed the photography with careful consideration for the natural elements. The result is a work of art unto itself; designed by the artist, printed on beautiful paper, intriguing, amusing, tranquil, pure. Seiju Toda, a leading art director and graphic designer in Japan, is a recognized artist with more than 20 solo exhibitions in the U.S. and Japan.",
        "Category": " Art , Asian , General",
        "Publisher": "Hudson Hills",
        "Price Starting With ($)": "7.1",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Century 21 Accounting: First Year Course",
        "Authors": "By Swanson, Robert M., Ross, Kenton E., and Hanson, Robert D.",
        "Description": "",
        "Category": " Education , General",
        "Publisher": "South-Western Pub",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Teachings of Gordon B. Hinckley",
        "Authors": "By Hinckley, Gordon B.",
        "Description": "",
        "Category": " Religion , Christianity , Church of Jesus Christ of Latter-day Saints (Mormon)",
        "Publisher": "Deseret Book Co",
        "Price Starting With ($)": "6.71",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Passport to Japanese (Signet) (English and Japanese Edition)",
        "Authors": "By Berlitz, Charles",
        "Description": "",
        "Category": " Foreign Language Study , Japanese",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Chinese Cooking",
        "Authors": "By Favorite Recipes",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Italian Cookbook: The Practical Guide to Preparing and Cooking Delicious Italian Meals",
        "Authors": "By Biggs, Fiona (EDT)",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , Italian",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "6.83",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Daily Wisdom to Satisfy the Soul",
        "Authors": "By McQuade, Pamela",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Totline Small World Celebrations ~ Around-The-World Holidays to Celebrate with Young Children",
        "Authors": "By Warren, Jean and McKinnon, Elizabeth S.",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Warren Publishing House, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Visual Basic.NET How to Program, Second Edition",
        "Authors": "By Deitel, Paul J., Deitel, Harvey M., and Neito, Tem",
        "Description": "",
        "Category": " Computers , Hardware , Personal Computers , General",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "7.63",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Fated",
        "Authors": "By Browne, S. G.",
        "Description": "From the acclaimed author of Breathers--an irreverent novel about fate, destiny, and the karmic consequences of getting involved with humans.   Over the past few thousand years, Fabio has come to hate his job. As Fate, he's in charge of assigning the fortunes and misfortunes that befall most of the human race-the 83% who keep screwing things up.  Frustrated with his endless parade of drug addicts and career politicians, Fate has to watch Destiny guide her people to Nobel Peace Prizes and Super Bowl MVPs. To make matters worse, he has a five- hundred-year-old feud with Death, and his best friends are Sloth and Gluttony. And worst of all? He's fallen in love with a human.  Getting involved with a human breaks Rule #1, and about ten others, setting off some cosmic-sized repercussions that could strip him of his immortality-or lead to a fate worse than death.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2010"
        }
    },
    {
        "Title": "Ethical & Legal Issues in School Counseling, Second Edition",
        "Authors": "By Theodore, Remley, Jr. (EDT), Hermann, Mary A., Ph.D. (EDT), and Huey, Wayne C., Ph.D. (EDT)",
        "Description": "",
        "Category": " Education , Reference",
        "Publisher": "Amer School Counseling Assn",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "The Elephant Keeper: A Novel",
        "Authors": "By Nicholson, Christopher",
        "Description": "“Intensely moving. [An] exceptional novel.”—Boston Globe A poignant and magical story set in eighteenth-century England, The Elephant Keeper by Christopher Nicholson is the tale of two baby elephants and the young man who accidentally finds himself their guardian. Every reader who was enchanted by Sara Gruen’s Water for Elephants or enthralled by When Elephants Weep will adore Nicholson’s The Elephant Keeper—a masterful blending of historical novel, coming-of-age tale, animal adventure, and love story.",
        "Category": " Fiction , Historical , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Lowes Complete Tile And Flooring",
        "Authors": "By Finwall, Barbara and Javier, Nancy",
        "Description": "An informative guide to selecting the right flooring for every room in the home describes the various materials available for home improvement projects and furnishes step-by-step instructions on installation, finishing details, and care, accompanied by full color photographs that reveal a variety of tile and flooring design options and tips on stain removal, new products, upkeep, and repairs.  Reissue.",
        "Category": " House & Home , Design & Construction",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "How Do I Feel? / ¿Cómo me siento? (Good Beginnings) (Spanish Edition)",
        "Authors": "By Zagarenski, Pamela (ILT) and Cote, Pamela (ILT)",
        "Description": "Esta serie de libros de cartón a todo color, con inglés y español en cada página, intrigará a los pequeños mientras los ayuda a desarrollar su vocabulario y su conciencia sobre el mundo que los rodea. Los libros incluyen ilustraciones encantadoras y palabras cuidadosamente elegidas, ofreciendo una introducción fascinante al vocabulario. This series of full-color board books, with both English and Spanish on each page, will intrigue youngsters while helping them build vocabulary and an awareness of the world around them. The books feature charming illustrations and thoughtfully chosen words, offering an enchanting introduction to vocabulary.",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Passport to World Band Radio, 1999",
        "Authors": "By Magne, Lawrence",
        "Description": "Passport to World Band Radio zeros in on news, music, sports and entertainment in English and other languages from hundreds of stations--ranging from Radio Australia to the BBC, Radio Yugoslavia to Radio Zambia.  It's Passport Reports chapter includes award-winning ratings of world band radios, plus there are helpful how-to articles by leading experts. Authoritative and entertaining, Passport is richly illustrated with strong graphics and cover artwork to entice browsers.",
        "Category": " Technology & Engineering , Radio",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Prey: A Novel",
        "Authors": "By Howard, Linda",
        "Description": "In this captivating novel of romantic suspense, New York Times bestselling author Linda Howard brings us deep into the wild, where a smart and sexy outdoor guide and her ruggedly handsome competitor must join forces to survive—and avoid becoming what they never expected to be: PREY Thirty-two-year-old Angie Powell has always spoken her mind, but in the presence of Dare Callahan she nurses a simmering rage. After all, why give Dare the satisfaction of knowing he can push her buttons and push her to the edge?Three years ago, Dare returned home to rural western Montana and opened a hunting business to rival Angie’s. Complicating matters is the fact that Dare has asked Angie out (not once but twice) and has given her a gift of butterflies in the process. Angie has no patience for butterflies. They only lead to foolish decisions. And now the infuriatingly handsome Iraq war vet has siphoned away Angie’s livelihood, forcing her to close up shop. Before Angie is to leave town, she organizes one last trip into the wilderness with a client and his guest, who wants to bag a black bear. But the adrenaline-fueled adventure turns deadly when Angie witnesses a cold-blooded murder and finds herself on the wrong side of a loaded gun. Before the killer can tie up this attractive loose end, a bear comes crashing through the woods—changing the dark game completely.Luckily, Dare is camping nearby and hears the shots. Forced together for their very survival, Angie and Dare must confront hard feelings, a blinding storm, and a growing attraction—while being stalked by a desperate killer and a ferocious five-hundred-pound beast. And neither will stop until they reach their prey.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2011"
        }
    },
    {
        "Title": "Don't Sweat the Small Stuff With Your Family",
        "Authors": "By Carlson, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Little Brown & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Introduction to Biostatistics (A Series of books in biology)",
        "Authors": "By Sokal, Robert R., Rohlf, F. James",
        "Description": "",
        "Category": "",
        "Publisher": "W.H.Freeman & Co Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1973"
        }
    },
    {
        "Title": "As the Romans Do: The Delights, Dramas, And Daily Diversions Of Life In The Eternal City",
        "Authors": "By Epstein, Alan",
        "Description": "A celebration of the character and style of one of the world's most spectacular cities! This vibrant insider's view of the most mature city on earth is the perfect companion for anyone who loves anything Italian. In 1995, after a twenty-year love affair with Italy, Alan Epstein fulfilled his dream to live in Rome. In As the Romans Do, he celebrates the spirit of this stylish, dramatic, ancient city that formed the hub of a far-flung empire and introduced the Mediterranean culture to the rest of the world. He also reveals today's Roman men and women in all their appealing contradictions: their gregarious caffe culture; inborn artistic flair; passionate appreciation of good food; instinctive mistrust of technology; showy sex appeal; ingrained charm and expressiveness; surprisingly unusual attitudes toward marriage and religion; and much, much more.  A celebration of the character and style of one of the world's most spectacular citiesThis vibrant insider's view of the most mature city on earth is the perfect companion for anyone who loves anything Italian. In 1995, after a twenty-year love affair with Italy, Alan Epstein fulfilled his dream to live in Rome. In As the Romans Do, he celebrates the spirit of this stylish, dramatic, ancient city that formed the hub of a far-flung empire and introduced the Mediterranean culture to the rest of the world. He also reveals today's Roman men and women in all their appealing contradictions: their gregarious caffe culture; inborn artistic flair; passionate appreciation of good food; instinctive mistrust of technology; showy sex appeal; ingrained charm and expressiveness; surprisingly unusual attitudes toward marriage and religion; and much, much more.",
        "Category": " History , Europe , Italy",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Amazing Reptiles and Amphibians (Amazing Life Cycles)",
        "Authors": "By Brian Williams",
        "Description": "",
        "Category": "",
        "Publisher": "Weekly Reader",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Happy Feet Flip Flops",
        "Authors": "By Jennine Korejko",
        "Description": "",
        "Category": "",
        "Publisher": "ASN Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Brain Boosters-Puzzles and Thinking Games",
        "Authors": "By Brainboosters, Kubota, Carole, Holland, Penny",
        "Description": "",
        "Category": "",
        "Publisher": "Educational Insights, Inc",
        "Price Starting With ($)": "9.24",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "The Traveler's Phrase Book: A Compendium of Commonly Used Phrases in French, German, Italian and Spanish",
        "Authors": "By Costantino, Mario",
        "Description": "",
        "Category": "",
        "Publisher": "Barron's Educational Series, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "50/50 Fifty Fun Things to Do in Your Fifties",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Hallmark",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Yoga at Work : 10-Minute Yoga Workouts for Busy People",
        "Authors": "By Freedman, Miriam and Hankes, Janice",
        "Description": "The modern work environment imposes many pressures both physical and mental on its workers. Yet we often pay little attention to our wellbeing and unnecessarily suffer from a variety of work-related problems. This easy-to-use yoga handbook is ideal for relieving stress and improving wellbeing in the workplace, and promoting good health. It covers potential causes of stress, both physical and mental; how to improve the work environment; a 'quick-fix' section - look up a problem and find a solution; advice on what to eat and drink at work; a fully illustrated easy-to-follow guide of specially adapted yoga exercises; and a series of 10-15 minutes of daily workout programmes.",
        "Category": " Medical , General",
        "Publisher": "Element Books Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Have to Have It: A Nannies Novel",
        "Authors": "By Mayer, Melody",
        "Description": "Slather on the sunblock and welcome to The Nannies, where toddlers have stylists and a lost Sidekick can be the social kiss of death, cerulean blue swimming pools stretch to infinity and paparazzi camp out behind Starbucks, and a good nanny--like a celebrity without Botox--is hard to find.",
        "Category": " Young Adult Fiction , Careers, Occupations, Internships",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Sammy Keyes and the Search for Snake Eyes",
        "Authors": "By Van Draanen, Wendelin",
        "Description": "\"The most winning junior detective ever in teen lit. (Take that, Nancy Drew!)\" —Midwest Children's Book Review  Sammy's softball team is in contention for the Junior Slugger's Cup,  and all she wants to do is hunker down behind the home plate and catch  strikes. But Heather Acosta brings new meaning to the term \"foul ball\"  as she schemes to get Sammy kicked off the team.Then Sammy is  thrown a wild pitch by a frantic girl at the mall. The girl asks Sammy  to watch her bag and dashes off before Sammy discovers that the bag  she's left holding contains a baby! When the girl doesn't return, Sammy  decides to go find her. A heart-pounding search ensues, and leads to  some situations that are definitely not covered in the softball  playbook.  The Sammy Keyes mysteries are fast-paced,  funny,  thoroughly modern, and true whodunits. Each    mystery is  exciting and  dramatic, but it's the drama in Sammy's personal    life  that keeps  readers coming back to see what happens next with her     love interest  Casey, her soap-star mother, and her mysterious father.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Dr. J",
        "Authors": "By Gutman, Bill",
        "Description": "",
        "Category": "",
        "Publisher": "Tempo 1977/77",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Lonely Planet Moscow (Moscow, 1st Ed)",
        "Authors": "By Ver Berkmoes, Ryan",
        "Description": "",
        "Category": " Travel , Russia",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Abraham Lincoln fact book & teacher's guide",
        "Authors": "By Sanders, Gerald",
        "Description": "Presents the life, times, and death of the 16th President.",
        "Category": "",
        "Publisher": "Eastern National Park & Monuments Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Living God's Politics: A Guide to Putting Your Faith into Action",
        "Authors": "By Wallis, Jim and Gutenson, Charles E.",
        "Description": "After fifteen weeks on the New York Times Bestseller list, God's Politics not only changed the conversation about faith and politics in this country, it began a movement. All across the country, wherever Jim Wallis spoke, people were frustrated by tax cuts and budgets that widened the gap between rich and poor, aggravated by the government's lack of response to natural disasters, wearied of misinformation and the ongoing war in the Middle East, and exasperated by the impractical political rhetoric about sexual abstinence in lieu of policies that would strengthen more broadly family values and community health. Folks began asking what they could do to promote peace, economic justice, racial equality, and the sanctity of life. They wanted to know how they could influence government policies to better reflect their moral values. In response, Wallis and the editors of Sojourners magazine offer Living God's Politics, a reader's guide for putting the lessons of God's Politics into action. Who will change our government's policies to better integrate our values? We're the ones we've been waiting for, and this book offers us the tools and techniques to change the political landscape for the better.",
        "Category": " Religion , Religion, Politics & State",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Macromedia Dreamweaver MX for Windows & Macintosh",
        "Authors": "By Towers, J. Tarin",
        "Description": "A comprehensive introduction to the latest version of Dreamweaver for both Windows and Macintosh environments combines task-based step-by-step instructions with screen shots to explain how to use the cross-program visual tool to design a sophisticated Web site using text, links, graphics, tables, frames, forms, and plugins. Original.",
        "Category": " Computers , Electronic Publishing",
        "Publisher": "Peachpit Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "When Jeremiah Learned a Secret (Purple Puzzle Tree Books)",
        "Authors": "By Norman C. Habel",
        "Description": "",
        "Category": "",
        "Publisher": "Concordia Publishing House",
        "Price Starting With ($)": "6.57",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Cross My Heart and Hope to Spy (B&N custom pub)",
        "Authors": "By Carter, Ally",
        "Description": "",
        "Category": "",
        "Publisher": "Hyperion Book CH",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Party Time, All the Time! (Disney Club Penguin)",
        "Authors": "By Gonzalez, Sue",
        "Description": "Club Penguin throws at least one themed virtual bash each month, and kids can log on to get free items for their penguins, play special limited-time-only games, and celebrate with other penguins. This book recaps Club Penguin's amazing parties, which are themed for holidays, seasons, and many other special events - like the annual St. Patrick's Day party, the Summer Kick off party, or the Music Jam party. This book also features interviews with Club Penguin's popular characters and tips for making the most out of Club Penguin's parties.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "In the Kitchen With Family & Friends: An Anniversary Collection of Yummy Recipes & Fond Memories for Sharing With Those You Love!",
        "Authors": "By Gooseberry Patch (EDT)",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Gooseberry Patch",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Blackrobe (Canadians)",
        "Authors": "By Robert E. Wall",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1981"
        }
    }
]