[
    {
        "Title": "Get Your Buns in Here",
        "Authors": "By Wicks, Laurel A.",
        "Description": "Provides recipes for coffeecake, cookies, pastries, desserts, sweet breads, rolls, cakes, muffins, pies, tarts, frostings, glazes, and icings",
        "Category": " Cooking , Reference",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "Out of the Girls' Room and Into the Night: Stories",
        "Authors": "By Nissen, Thisbe",
        "Description": "In Thisbe Nissen's award-winning debut story collection, characters teeter on the verge of love, of life, of oncoming cataclysms after which Things Will Never Be the Same. Against the varied backdrops of Grateful Dead shows, anniversary parties, sickrooms, and bright Manhattan vestibules, Nissen traces the joy, terror, and electric surprise that flash between people as they suddenly connect.  A fifteen-year-old girl whose mother is slowly dying finds solace in the bed of her best friend's older brother.  A wife remembers the early romance in her marriage as she watches her husband's hand, shaky with Parkinson's, lift a bite of food to his mouth. Longtime friends are jolted by their unforeseen attraction to each other; new lovers feel their way by instinct in vans, on futons, an during risky, late-night conversation.  Knowing, often hilarious, and always pitch-perfect, Nissen's tales hang inside those moments when the heart is acting and the head is watching, hopeful that the heart is doing the right thing.",
        "Category": " Fiction , Literary",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Fish With Flair",
        "Authors": "By Green, Delores and White, Connie",
        "Description": "",
        "Category": "",
        "Publisher": "Green & White Pub",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Be a Clown!: The Complete Guide to Instant Clowning",
        "Authors": "By Pipkin, Turk, Reed, Chris, and Chrynwski, Walt",
        "Description": "Written by the towering Turk Pipkin, a 6' 7\" professional clown, BE A CLOWN! The Complete Guide To Instant Clowning provides the know-how, techniques, encouragement--and official red plastic nose--needed to put kids of all ages in the center ring. This lively, humorous handbook covers all aspects of clownmanship, including makeup, funny faces, costume (how to make big clown shoes at home), and props like the Bouncing Hankie. Fully illustrated throughout, it reveals step-by-step the secrets of Slapstick, Timing & Takes, and Juggling. Develop your own oddball walk, swallow chair legs--you'll always have a stunt up your sleeve. 72,000 copies in print.",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Chocolate Indulgences",
        "Authors": "By 'KOREN TRYGG, LUCY POSHEK'",
        "Description": "",
        "Category": "",
        "Publisher": "Antioch Publisher",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Practical Chocolate",
        "Authors": "By Author Unknown",
        "Description": "",
        "Category": "",
        "Publisher": "P3",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "365 Great Cookies and Brownies",
        "Authors": "By Hayes, Joanne Lamb and Leblang, Bonnie Tandy",
        "Description": "A cookbook featuring 365 scrumptious recipes for cookies and brownies includes inventive variations on the chocolate-chip cookie, old favorites, interesting new ideas, low-fat suggestions, and other delectable treats.",
        "Category": " Cooking , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "A New Owner's Guide to Dachshunds (JG Dog)",
        "Authors": "By Ladd, Kaye",
        "Description": "",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Rush Limbaugh and the Bible",
        "Authors": "By Evearitt, Daniel J.",
        "Description": "",
        "Category": "",
        "Publisher": "Horizon House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Fire-Breathing Liberal: How I Learned to Survive (and Thrive) in the Contact Sport of Congress",
        "Authors": "By Fisher, David and Wexler, Robert",
        "Description": "There’s a reason The Nation, America’s leading progressive magazine, named Robert Wexler the country’s “Most Valuable Congressman.” It's the same reason right-wing radio host Rush Limbaugh refers to him as “disgusting.” It's because for the last twelve years Wexler has been Congress’s most outspoken liberal -- taking on George W. Bush, Dick Cheney, Condoleezza Rice, Alberto Gonzales, General David Petraeus, and, when necessary, even his own party.In Fire-Breathing Liberal, Wexler brings readers onto the floor of the House and puts them at the center of some of the last decade’s biggest controversies. He passionately describes how he defended Bill Clinton from impeachment and how he stood up against the Bush brothers when the “butterfly” ballots in his Florida district wrongly decided the 2000 presidential election. He also offers an honest and brutal assessment of the Iraq war and explains why he has become a leader in the movement to impeach Vice President Cheney. And, with warmth and wit, Wexler shares some of the funniest stories from the corridors of Congress, including how he became The Colbert Report’s most talked-about guest.This is a remarkably candid first-person account of recent political history that shows government as it has rarely been seen -- by a Democrat in the middle of the storms.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Ernie Pyle's War; America's Eyewitness to World War II",
        "Authors": "By Tobin, James",
        "Description": "When a machine-gun bullet ended the life of war correspondent Ernie Pyle in the final days of World War II, Americans mourned him in the same breath as they mourned Franklin Roosevelt. To millions, the loss of this American folk hero seemed nearly as great as the loss of the wartime president.  If the hidden horrors and valor of combat persist at all in the public mind, it is because of those writers who watched it and recorded it in the faith that war is too important to be confined to the private memories of the warriors. Above all these writers, Ernie Pyle towered as a giant. Through his words and his compassion, Americans everywhere gleaned their understanding of what they came to call \"The Good War.\"  Pyle walked a troubled path to fame. Though insecure and anxious, he created a carefree and kindly public image in his popular prewar column -- all the while struggling with inner demons and a tortured marriage. War, in fact, offered Pyle an escape hatch from his own personal hell.  It also offered him a subject precisely suited to his talent -- a shrewd understanding of human nature, an unmatched eye for detail, a profound capacity to identify with the suffering soldiers whom he adopted as his own, and a plain yet poetic style reminiscent of Mark Twain and Will Rogers. These he brought to bear on the Battle of Britain and all the great American campaigns of the war -- North Africa, Sicily, Italy, D-Day and Normandy, the liberation of Paris, and finally Okinawa, where he felt compelled to go because of his enormous public stature despite premonitions of death.  In this immensely engrossing biography, affectionate yet critical, journalist and historian James Tobin does an Ernie Pyle job on Ernie Pyle, evoking perfectly the life and labors of this strange, frail, bald little man whose love/hate relationship to war mirrors our own. Based on dozens of interviews and copious research in little-known archives, Ernie Pyle's War is a self-effacing tour de force. To read it is to know Ernie Pyle, and most of all, to know his war.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "The Free Press",
        "Price Starting With ($)": "5.9",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Galactic Empires Vol. Two",
        "Authors": "By Aldiss, Brian Wilson",
        "Description": "Arranges in interlocking series twenty-six stories by Clarke, Asimov, Anderson, Simak, and others which together chronicle man's conquest of the galaxy, the wars of empire, and the dissolution of the great endeavor",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1979"
        }
    },
    {
        "Title": "The Secret Life of Cats",
        "Authors": "By Laroche, Robert De, Labat, Jean-Michel, and De Laroche, Robert",
        "Description": "Recounts nearly nine thousand years of human interaction with cats, with examples of cats in art throughout history and photographs of contemporary cats",
        "Category": "",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Florence of Arabia: A Novel",
        "Authors": "By Buckley, Christopher",
        "Description": "The bestselling author who made mincemeat of political correctness in Thank You for Smoking, conspiracy theories in Little Green Men, and Presidential indiscretions No Way to Treat a First Lady now takes on the hottest topic in the entire world–Arab-American relations–in a blistering comic novel sure to offend the few it doesn’t delight.Appalled by the punishment of her rebellious friend Nazrah, youngest and most petulant wife of Prince Bawad of Wasabia, Florence Farfarletti decides to draw a line in the sand. As Deputy to the deputy assistant secretary for Near East Affairs, Florence invents a far-reaching, wide-ranging plan for female emancipation in that part of the world.The U.S. government, of course, tells her to forget it. Publicly, that is. Privately, she’s enlisted in a top-secret mission to impose equal rights for the sexes on the small emirate of Matar (pronounced “Mutter”), the “Switzerland of the Persian Gulf.” Her crack team: a CIA killer, a snappy PR man, and a brilliant but frustrated gay bureaucrat. Her weapon: TV shows.The lineup on TV Matar includes A Thousand and One Mornings, a daytime talk show that features self-defense tips to be used against boyfriends during Ramadan; an addictive soap opera featuring strangely familiar members of the Matar royal family; and a sitcom about an inept but ruthless squad of religious police, pitched as “Friends from Hell.”The result: the first deadly car bombs in the country since 1936, a fatwa against the station’s entire staff, a struggle for control of the kingdom, and, of course, interference from the French. And that’s only the beginning.A merciless dismantling of both American ineptitude and Arabic intolerance, Florence of Arabia is Christopher Buckley’s funniest and most serious novel yet, a biting satire of how U.S. good intentions can cause the Shiite to hit the fan.",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Feisty Woman's Breast Cancer Book",
        "Authors": "By Ratner, Elaine",
        "Description": "Breaking down the taboos associated with breast cancer and its treatment, Elaine Ratner shows that this illness does not have to be a nightmare, and that most women who contract it can take charge of their experience and come out whole. She begins her book with a list of 18 insights learned from her experience with breast cancer, including:*Surround yourself with people who make you feel good*The human body is a miraculous healing machine*Nobody really knows much about breast cancer*A breast is completely expendableIn addition to offering down-to-earth advice, Ratner discusses the paternalistic attitudes of the medical establishment toward women, the exaggeration of breast cancer statistics, and the way our culture shapes women's attitudes toward their bodies.",
        "Category": " Health & Fitness , Diseases , Cancer",
        "Publisher": "Hunter House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Knights of the Blood (Knights of Blood)",
        "Authors": "By Kurtz, Katherine and Macmillan, Scott",
        "Description": "Captain John Drummond of the LAPD is investigating an unsolved murder from more than thirty years ago-six unidentified men, bearing Nazi SS tattoos, drained of blood-that echoes a series of unexplained deaths around the world.  But these murders go back further than he expected-to World War II, to the time of the Crusades, and to a group of Knights Templar who have lived for centuries...",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Roc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "The Search (Star Trek Deep Space Nine)",
        "Authors": "By Carey, Diane",
        "Description": "The Dominion: The mysterious rulers of the worlds on the other side of the wormhole. The Dominion: a ruthless planet-conquering race unknown even to those they rule. The Dominion: the most dangerous foe the Federation may ever face.  At the edge of the wormhole, the space station Deep Space Nine&#153; and the planet Bajor sit on what will be the front line in any Dominion attack. To try and prevent the conflict, Commander Benjamin Sisko ant his crew take a never-tested Federation warship through the wormhole to track down and confront the Dominion. If Commander Sisko fails, not only the Federation, but the Klingons, Romluans, Cardassians, and all the worlds of the Alpha Quadrant will face an interstellar war they cannot win.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Black-Jack's Winning Formula: Money Making Techniques for Atlantic City, Nevada and the Caribbean",
        "Authors": "By Patterson, Jerry L.",
        "Description": "Explains the basics of blackjack and describes methods of card-counting for successful gambling in the styles of blackjack played in the casinos",
        "Category": " Games & Activities , Card Games , Blackjack",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1982"
        }
    },
    {
        "Title": "Days of Infamy",
        "Authors": "By Gingrich, Newt, Forstchen, William R., and Hanser, Albert S. (EDT)",
        "Description": "“Absolutely brilliant! Fast paced and filled with tension and suspense. Every page resonates with the momentous events and great personalities of World War II – and scenes so carefully crafted you feel like you’re there. This is a ‘must read’ for all who look at history and wonder: “What if…” -- Oliver North, Lt. Col., USMC (Ret.), host of War Stories on the Fox News ChannelIn 2007, bestselling authors Newt Gingrich and William R. Forstchen launched a new epic adventure series about World War II in the Pacific, with their book Pearl Harbor: A Novel of December 8th, 1941, which instantly rocketed to the New York Times bestseller list.Gingrich and Forstchen’s now critically acclaimed approach, which they term “active history,” examines how a change in but one decision might have profoundly altered American history. In Pearl Harbor they explored how history might have been changed if Admiral Yamamoto had directly led the attack on that fateful day, instead of remaining in Japan. Building on that promise, Days of Infamy starts minutes after the close of Pearl Harbor, as both sides react to the monumental events triggered by the presence of Admiral Yamamoto. In direct command of the six carriers of the attacking fleet, Yamamoto decides to launch a fateful “third-wave attack” on the island of Oahu, and then keeps his fleet in the area to hunt down the surviving American aircraft carriers, which by luck and fate were not anchored in the harbor on that day.Historians have often speculated about what might have transpired from legendary “matchups” of great generals and admirals. In this story of the aftermath of Pearl Harbor, the notorious gambler Yamamoto is pitted against the equally legendary American admiral Bill Halsey in a battle of wits, nerve, and skill.Days of Infamy recounts this alternative history from a multitude of viewpoints---from President Roosevelt, Prime Minister Churchill, and the two great admirals, on down to American pilots flying antiquated aircraft, bravely facing the vastly superior Imperial Japanese Navy aircraft. Gingrich and Forstchen have written a sequel that’s as much a homage to the survivors of the real Pearl Harbor attack as it is an imaginative and thrilling take on America’s entry into World War II. Praise for the first book in the Pacific War Series, Pearl Harbor:\"A thrilling tale of American's darkest day.\" --W.E.B. Griffin\"Masterful storytelling that not only captures the heroic highs and hellish lows of that horrific day which lives on in infamy--it resonates with today's conflicts and challeneges.\" --William E. Butterworth IV, New York Times bestselling author of The Saboteurs\"A politician and a novelist, each an accomplished historian in his own right, are emerging as  master authors of alternative history.  In this “what if” treatment of the attack on Pearl Harbor, Newt Gingrich and William Forstchen combine their talents to make the diplomacy as suspenseful as the combat, even for readers who know what happens next–or think they know.\" --Dennis Showalter, former president of the Society of Military Historians\"This book is not only a great read, it is a fascinating historical story that applies today in Iraq as it did in the Western Pacific in the late 30s and 40s.\" --Captain Alex Fraser, USN (Ret.)",
        "Category": " Fiction , Historical",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Two Front War (Star Trek: New Frontier)",
        "Authors": "By David, Peter",
        "Description": "Captain Calhoun and the crew of the U.S.S. Excalibur are on Thallon when their sensors detect strange vibrations coming from beneath the surface of the planet. Original.",
        "Category": " Fiction , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Confessor: Chainfire Trilogy, Part 3 (Sword Of Truth, Book 11)",
        "Authors": "By Goodkind, Terry",
        "Description": "Terry Goodkind's bestselling, epic fantasy series Sword of Truth continues with Confessor:Descending into darkness, about to be overwhelmed by evil, those people still free are powerless to stop the coming dawn of a savage new world, while Richard faces the guilt of knowing that he must let it happen. Alone, he must bear the weight of a sin he dare not confess to the one person he loves…and has lost. Join Richard and Kahlan in the concluding novel of one of the most remarkable and memorable journeys ever written. It started with one rule, and will end with the rule of all rules, the rule unwritten, the rule unspoken since the dawn of history. When next the sun rises, the world will be forever changed.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Show and Tell (Classic Munsch)",
        "Authors": "By Munsch, Robert N. and Martchenko, Michael (ILT)",
        "Description": "When Ben decides to take his baby sister for show and tell, she simply won't stop crying. Soon the whole school is in chaos as teachers, the principal and even a doctor try to cheer her up.",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Annick Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Healthy Hometown Favorites: America's Best-Loved Recipes from Cummunity Cookbooks-Made Light by the Food Editors of Prevention Magazine",
        "Authors": "By Plutt, Mary Jo (COM)",
        "Description": "A collection of time-honored recipes updated for today's healthier lifestyle features contributions from America's community cookbooks--Potato Salad, Chicken Pie, Apple Squares--trimmed of excess fat, calories, and sodium by the food editors of Prevention magazine.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.62",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Mr. Food's Pizza 1-2-3",
        "Authors": "By Ginsburg, Art",
        "Description": "Presents recipes and tips for making more than 125 scrumptious homemade pizzas, calzones, stuffed pizzas, and Italian breads--ranging from simple, to deep-dish, to exotic--with tips on appropriate cheeses and a pizza-cutting guide.",
        "Category": " Cooking , Courses & Dishes , Pizza",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Curries Without Worries: An Introduction to Indian Cuisine",
        "Authors": "By Koul, Sudha",
        "Description": "",
        "Category": "",
        "Publisher": "Cashmir Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Firehouse Cookbook",
        "Authors": "By Kite, Dorothy Jackson",
        "Description": "A collection of 150 recipes from firehouses across the United States, accompanied by stories about the firehouse.  All the recipes have been tested by Better Homes and Gardens magazine test kitchens, and include such American favorites as New England clam chowder, Carolina coconut pie, Fire Alarm Chili, and many others.  Firemen are known to be great cooks as well as wonderful heroes, and this book lets them show off their culinary talent.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Viking Press",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1975"
        }
    },
    {
        "Title": "Fresh Pasta Cookbook: International Recipes For All Seasons",
        "Authors": "By Bridget Jones",
        "Description": "",
        "Category": "",
        "Publisher": "Chartwell Books, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Dining Out: Secrets from America's Leading Critics, Chefs, and Restaurateurs",
        "Authors": "By Dornenburg, Andrew and Page, Karen",
        "Description": "This book is the first of its kind to examine what defines fine food in America and it introduces us to many individuals who shape our views about food. Using other successful Dornenburg/Page books as a model, the authors once again base their analysis on interviews with chefs, restaurateurs and critics. This insider's guide to the process of restaurant reviewing will excite anyone with a serious interest in food. It also features top sites on the Internet that provide restaurant reviews. 'If I were a restaurateur, I would expect all my staff to read this book. As a restaurant critic, I found it a fascinating insight into the minds of other critics and more especially the minds of some of the people who are serious about running a restaurant.'",
        "Category": " Cooking , Courses & Dishes , Appetizers",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Cooking Light: Slow Cooker",
        "Authors": "By Laschober, Terri (EDT)",
        "Description": "Combines full-color photography with easy-to-follow instructions in a collection of delicious and healthful recipes for dozens of meals that use the slow cooker.  30,000 first printing.",
        "Category": " Cooking , Methods , Special Appliances",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Gather 'Round The Grill: A Year of Celebrations",
        "Authors": "By Bianco, Marie and Hirsch, George",
        "Description": "A year's worth of grilling ideas target holidays and such family events as birthdays, anniversaries, and graduations, and includes such recipes as Pumpkin Stuffed with Chicken and Rice. 35,000 first printing. $25,000 ad/promo. Tour.",
        "Category": " Cooking , Methods , Barbecue & Grilling",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Prove It! Jesus",
        "Authors": "By Welborn, Amy",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Our Sunday Visitor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Mexican (Cookshelf)",
        "Authors": "By Spieler, Marlena",
        "Description": "",
        "Category": "",
        "Publisher": "Paragon Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Betty Crocker's Shortcut Cooking for the Smartcook",
        "Authors": "By Crocker, Betty",
        "Description": "Features over three hundred time-saving recipes for salads, soups, eggs, cheese, pasta, meat, poultry, fish, and grains",
        "Category": " Cooking , General",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "The Creative Pasta Cookbook (Creative Cooking",
        "Authors": "By Courage Books",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Pasta",
        "Publisher": "Courage Press",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Burning Heart of Night",
        "Authors": "By Cat, Ivan",
        "Description": "On the beautiful world of New Ascension, a human colony desperately struggles to survive the fatal pathogen that affects all life-forms, human and alien, while Jenette Tesla, the daughter of the colony's ruthless leader, dedicates herself to finding a cure for the dying colonists, preserving the planet's native species, and quieting the unrest that could ignite a civil war. Original.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Daw Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Mickey's Magic bottle (Mickey's Young Readers Library, 6) (Mickey's Young Readers Library, 6)",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "No-Man's Lands: One Man's Odyssey Through The Odyssey",
        "Authors": "By Huler, Scott",
        "Description": "When NPR contributor Scott Huler made one more attempt to get through James Joyce’s Ulysses, he had no idea it would launch an obsession with the book’s inspiration: the ancient Greek epic The Odyssey and the lonely homebound journey of its Everyman hero, Odysseus.No-Man’s Lands is Huler’s funny and touching exploration of the life lessons embedded within The Odyssey, a legendary tale of wandering and longing that could be read as a veritable guidebook for middle-aged men everywhere. At age forty-four, with his first child on the way, Huler felt an instant bond with Odysseus, who fought for some twenty years against formidable difficulties to return home to his beloved wife and son. In reading The Odyssey, Huler saw the chance to experience a great vicarious adventure as well as the opportunity to assess the man he had become and embrace the imminent arrival of both middle age and parenthood.But Huler realized that it wasn’t enough to simply read the words on the page—he needed to live Odysseus’s odyssey, to visit the exotic destinations that make Homer’s story so timeless. And so an ambitious pilgrimage was born . . . traveling the entire length of Odysseus’s two-decade journey. In six months.Huler doggedly retraced Odysseus’s every step, from the ancient ruins of Troy to his ultimate destination in Ithaca. On the way, he discovers the Cyclops’s Sicilian cave, visits the land of the dead in Italy, ponders the lotus from a Tunisian resort, and paddles a rented kayak between Scylla and Charybdis and lives to tell the tale. He writes of how and why the lessons of The Odyssey—the perils of ambition, the emptiness of glory, the value of love and family—continue to resonate so deeply with readers thousands of years later. And as he finally closes in on Odysseus’s final destination, he learns to fully appreciate what Homer has been saying all along: the greatest adventures of all are the ones that bring us home to those we love. Part travelogue, part memoir, and part critical reading of the greatest adventure epic ever written, No-Man’s Lands is an extraordinary description of two journeys—one ancient, one contemporary—and reveals what The Odyssey can teach us about being better bosses, better teachers, better parents, and better people.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "The Born Queen (Kingdoms of Thorn and Bone, Book 4)",
        "Authors": "By Keyes, J. Gregory",
        "Description": "In The Kingdoms of Thorn and Bone, Greg Keyes has crafted a brilliant saga of magic, adventure, and love set against a backdrop of clashing empires and an ancient, reawakened evil. Now, with The Born Queen, Keyes brings his epic to a masterly close, gathering the strands of plot and character into a stunning climax that both completes and transcends all that has gone before.The Briar King is dead, and the world itself follows him to ruin. Aspar White, wounded and tired, must embark on one last quest to save the forest and the people he loves, but he has little hope of success.Anne Dare at last sits on the throne of Crotheny, but for how long? The Church, now led by the corrupt and powerful Marché Hespero, has declared a holy war against her, giving the king of Hansa the pretext he needs to unleash his vast might on the young queen and her unready army.But Hansa is the least of Anne’s worries. The Hellrune, war seer of Hansa, strikes at her through vision and prophecy. The Kept–last of the elder Skasloi lords–weaves his own dark webs. Anne’s teacher and ally in the sedos world might also be her worst enemy, and Anne’s own mounting strength compels her toward madness.Surviving these dangers and mastering her eldritch abilities are merely prelude to the real struggle. There are many–some with power matching or even exceeding Anne’s own–who are willing to kill in order to seize control. For whoever sits upon the throne will have the ultimate command to bring about the world’s salvation–or its apocalypse.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "The Word Detective",
        "Authors": "By Morris, Evan",
        "Description": "Comic, skeptic, cyber-sleuth, syndicated columnist, and inspired wordsmith, Evan Morris is the Word Detective. He's an etymologist with a sense of humor, a lexicographer with an attitude. Morris's unique approach to language and his distinctive brand of absurdity have found a loyal following of readers curious about everything from soup to nuts--and that means the origins of the phrase soup to nuts, and thousands more words and phrases. This book is a collection of 150 of Morris's language columns, which appear in newspapers throughout the country and on his popular Web site.  A clueless husband writes the WORD DETECTIVE to ask if his wife has insulted him by calling him gormless. Coworkers write to settle a watercooler dispute about the logic of feed a cold, starve a fever. The Word Detective snoops around, follows the leads, and uncovers the answers. The book is chock-full of fascinating lore about the origins and uses of the English language and includes special sections exploring groups of words such as euphemisms, eponyms, and onomatopoeic forms. Funny and offbeat, clever and curmudgeonly, irreverent and irritable, this detective is for all of us who appreciate a dash of wit with our words.",
        "Category": " Language Arts & Disciplines , Etymology",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Carol Cutlers Great Fast Breads",
        "Authors": "By Carol Cutler",
        "Description": "",
        "Category": "",
        "Publisher": "Rawson Associates",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Ben & Jerry's Homemade Ice Cream & Dessert Book",
        "Authors": "By Cohen, Ben, Greenfield, Jerry, Stevens, Nancy J., and Severance, Lyn",
        "Description": "With little skill, surprisingly few ingredients, and even the most unsophisticated of ice-cream makers, you can make the scrumptious ice creams that have made Ben & Jerry&#39;s an American legend.Ben & Jerry&#39;s Homemade Ice Cream & Dessert Book tells fans the story behind the company and the two men who built it-from their first meeting in 7th-grade gym class (they were already the two widest kids on the field) to their \"graduation\" from a $5.00 ice-cream-making correspondence course to their first ice-cream shop in a renovated gas station. But the best part comes next. Dastardly Mash, featuring nuts, raisins, and hunks of chocolate. The celebrated Heath Bar Crunch. New York Super Fudge Chunk. Oreo Mint. In addition to Ben & Jerry&#39;s 11 greatest hits, here are recipes for ice creams made with fresh fruit, with chocolate, with candies and cookies, and recipes for sorbets, sundaes, and baked goods.",
        "Category": " Cooking , Courses & Dishes , Desserts",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "One Bowl",
        "Authors": "By McCune, Kelly and Pool, Joyce Oudkerk (PHT)",
        "Description": "Offers a variety of one-pot dishes, includes beans, beef, chicken, duck, pork, vegetables and pasta",
        "Category": " Cooking , Regional & Ethnic , International",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Sitting Practice: A Novel",
        "Authors": "By Adderson, Caroline",
        "Description": "It only takes a moment for your life to be changed forever—as the characters of this darkly comic novel discover early on. The fateful moment for the newlyweds Ross and Iliana comes with the freak automobile accident that leaves Iliana paralyzed, Ross grief-stricken, and both of them struggling to come to terms with a married life nothing like they originally had in mind. As the usually affable Ross struggles with guilt and with finding ways to cope with his newly fractured life, Iliana gets used to her unwelcome existence as a wheelchair-bound wife, to her husband’s growing sense of alienation, and to their awkward new lack of intimacy. What ultimately happens with Ross and Iliana is as unexpected and surprising as the fateful mishap that sets the events in motion in the first place. Sitting Practice is a clever and insightful study of love’s collision with harsh reality, told by an author with a remarkable instinct for the workings of human nature, a nimble gift for language, and the ability to find humor in the oddest places.",
        "Category": " Fiction , Sagas",
        "Publisher": "Trumpeter",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Old-Time Brand-Name Desserts: Recipes, Illustrations, and Advice from the Recipe Pamphlets of America's Most Trusted Food Makers",
        "Authors": "By Crumpacker, Bunny",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Desserts",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Stews: 200 Earthy, Delicious Recipes",
        "Authors": "By Holst, Jenna",
        "Description": "A collection of healthy, simple and delicious stew recipes also features marvelous accompaniment recipes for breads, salads, and dessert fruit stews, as well as easy-to-follow menu suggestions. 15,000 first printing.",
        "Category": " Cooking , Courses & Dishes , Soups & Stews",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Isolated Elders",
        "Authors": "By Rathbone-McCuan, Eloise",
        "Description": "",
        "Category": "",
        "Publisher": "Lippincott Williams and Wilkins",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "The Fleet, Book 2: Counter Attack",
        "Authors": "By David Drake",
        "Description": "",
        "Category": "",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Battlestation, Book 1",
        "Authors": "By Drake, David and Fawcett, Bill (EDT)",
        "Description": "When the Fleet is challenged by an alien armada from the other side of the galaxy, the Fleet constructs the Stephen Hawking, an enormous mobile base for thousands of soldiers and warships. Original.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "The Irish American Family Album (American Family Albums)",
        "Authors": "By Hoobler, Dorothy and Hoobler, Thomas",
        "Description": "Erin go bragh. Ireland forever. The popular Celtic saying is heard in the United States from New York to San Francisco because there are more than 39 million Americans who list their ancestry as Irish. Nearly 800,000 Irish arrived here between 1841 and 1850, and 900,000 followed over the next decade. In other words, more than one out of every five people in Ireland left for the United States in that 20-year period. The Irish American Family Album is a remarkable history and memoir. In their own words--from diary entries, letters, interviews, and personal reflections--and with photographs and clippings pulled from family archives and the press of the day, the rich and colorful history of the Irish immigration to this country is told with a passion and wit that is uniquely Irish. Life on the \"ould sod\" and the hardships of the great potato famine and British rule, the decision to leave, the arduous Atlantic journey, first impressions of their new home, settling in and building a new life--all are made immediate and real through the words and snapshots of the participants. But not all are happy memories. Most of the immigrants were young people and left Ireland with a heavy heart, believing that they would never again see those they left behind. They faced prejudice in this country--\"No Irish Need Apply\" was a familiar sign in shop windows and in newspaper advertisements--and living conditions in the tenements they could afford were a far cry from life on the farm back home. Many immigrants found their first jobs here as laborers. They were among the workers who built the Erie Canal, the transcontinental railroad, and the Statue of Liberty.  In the west, Irish laborers found work as miners during the gold rush. Irish women often worked as servants in the houses of the upper class, or worked in the cloth mills of New England.  Though prejudice tried to keep the majority at the bottom of society, the very size of the Irish American community made them a powerful political force, and in cities such as Boston, New York, and Chicago, the Irish took control of local political organizations and were soon a force to be reckoned with. There are many success stories in The Irish American Family Album. The Kennedy family, film actor John Wayne, artist Georgia O'Keeffe, novelist F. Scott Fitzgerald, and Sandra Day O'Connor, the first woman justice of the Supreme Court--all bear witness to the strength and endurance of the Irish spirit. These and other famous Irish Americans are profiled throughout the book. But the real joy comes in seeing the multitude of faces in the rare and fascinating photographs, and reading memories of Irish grandmothers, of boys who grew up in \"Hell's Kitchen\" at the turn of the century, of an early union organizer, and the thousand of other voices that make up the proud and diverse Irish American community. Their stories add an important chapter to the multicultural portrait of America.",
        "Category": " Young Adult Nonfiction , History , United States , 20th Century",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "A Life In School: What The Teacher Learned",
        "Authors": "By Tompkins, Jane",
        "Description": "Here one of our leading literary scholars looks back on her own life in the classroom, and discovers how much of what she learned there needs to be unlearned. Jane Tompkins&#39; memoir shows how her education shaped her in the mold of a high achiever who could read five languages but had little knowledge of herself. As she slowly awakens to the needs of her body, heart, and spirit, she discards the conventions of classroom teaching and learns what her students&#39; lives are like. A painful and exhilarating story of spiritual awakening, Tompkins&#39; book critiques our educational system while also paying tribute to it.",
        "Category": " Biography & Autobiography , Educators",
        "Publisher": "Perseus Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Fathering Words: The Making of an African American Writer",
        "Authors": "By Miller, E. Ethelbert",
        "Description": "With ample insight, candor, and lyricism, poet, scholar, editor, and anthologist E. Ethelbert Miller reflects in these pages on his childhood in the South Bronx, his college days at Howard University, and his ongoing development as a husband, father, poet, and African American author. Fathering Words explores how Miller's family and friends shaped his life—in particular, his father Egberto, who came to the U.S. from Panama, and his older brother Richard, who became a monk and died young. With straightforward honesty punctuated by humor and warmth, the quietly pensive Miller offers a memoir of individual as well as universal truth—an original yet familiar story of fathers and sons, families and responsibilities, artistry and awareness.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Websters New World Dictionary of Quotable Defi",
        "Authors": "By Brussell, Eugene E",
        "Description": "",
        "Category": "",
        "Publisher": "Pearson Ptr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "The Origins of Things, Or, How the Hour Got Its Minutes",
        "Authors": "By Meinhardt, Jack (EDT)",
        "Description": "",
        "Category": " Religion , Antiquities & Archaeology",
        "Publisher": "Biblical Archaeology Society",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Sons on Fathers: A Book of Men's Writing",
        "Authors": "By Keyes, Ralph (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "HarperPerennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Charlie Brown's 'Cyclopedia, Vol. 5: Featuring Boats and Other Things that Float",
        "Authors": "By Schulz, Charles M.",
        "Description": "",
        "Category": "",
        "Publisher": "Funk & Wagnalls, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "America's Favorite Fish Recipes: More Than 180 Mouthwatering Recipes from Fishing Guides and Professional Chefs (The Freshwater Angler)",
        "Authors": "By Sternberg, Dick and Ramette, Peggy",
        "Description": "We gathered hundreds of delicious recipes from our readers, staff, lodges, restaurants and outdoor guides to create this mouthwatering collection. Dishes range from Country Pan-fried Catfish to Salmon Chowder.What sets this fantastic book apart is the mouthwatering photography and the easy-to-follow recipes. Whether you're frying, steaming, stewing, baking, grilling, smoking, pickling or cooking over a campfire, you'll find new and delicious ways to prepare your catch. This includes special techniques for each method in addition to the recipes themselves.If a recipe looks good, but calls for a species of fish you don't have, there's a substitution chart that will give you an alternate choice. Plus, you'll find handy fish-cleaning tips that can help reduce contaminants and improve the flavor.",
        "Category": " Cooking , Specific Ingredients , Seafood",
        "Publisher": "Cool Springs Press",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Low Fat: 100 Best Recipes",
        "Authors": "By Linda Doeser",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble, Inc.",
        "Price Starting With ($)": "6.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Sunset international vegetarian cook book",
        "Authors": "By Sunset Books, Sunset Magazine & Book",
        "Description": "",
        "Category": "",
        "Publisher": "Lane Pub. Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Sin Boldly! Dr. Dave's Guide to Writing the College Paper",
        "Authors": "By Williams, David R.",
        "Description": "Tired of correcting the same mistakes year after year, hoarse from endless repetition of the same rules, at long last frustrated by the inability of students to grasp his words of wisdom, Professor David Williams has put it all down in a book: the dirty truth about what college professors and other teachers are really looking for as they grade student papers. Outrageous and wise, Sin Boldly! goes where no other how-to-write handbook has dared go before. Personal, perceptive, and purposefully provocative, this book offers students crucial advice on the entire writing process. From choosing a paper topic to adopting a persuasive voice, shaping an argument, and organizing an essay; from political correctness (or lack thereof) to matters of style, punctuation, and usage, Sin Boldly! is crammed with information, ideas, and examples that will entertain and instruct even the most confident students in their quest for the A+ they all think they deserve.",
        "Category": " Reference , Writing Skills",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The New Pasta Cookbook",
        "Authors": "By Glynn, Joanne",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Joshua Morris Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Decoupage Old And New",
        "Authors": "By Sommer, Elyse",
        "Description": "",
        "Category": "",
        "Publisher": "Lancer Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "German Shephard Dogs",
        "Authors": "By Kern,Francis G",
        "Description": "",
        "Category": "",
        "Publisher": "Thomasson Grant & Howell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1979"
        }
    },
    {
        "Title": "The Illustrated Encyclopedia of the Kings and Queens of Britain",
        "Authors": "By Charles Phillips",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Chains of Command (Star Trek The Next Generation, No 21)",
        "Authors": "By Flood, E. L. and McCay, W. A.",
        "Description": "While exploring a group of devastated class-M planets in a remote sector of space, the crew of the U.S.S. Enterprise ? is shocked to discover a group of human slaves on a forbidding, glacial world. When the slaves revolt against their human overseers, Captain Picard and his crew sympathize with the slaves plight but cannot interfere in the conflict.  After the revolt is a success, Captain Picard learns that both the slaves and the overseers were controlled by a mysterious bird-like race called the Tseetsk, who are coming to reclaim their property. With the time running out, the rebels kidnap Captain Picard and Counsellor Troi -- drawing the U.S.S. Enterprise into the middle of their deadly plan of vengeance.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Here There Be Dragons (Star Trek The Next Generation, No 28)",
        "Authors": "By Peel, John",
        "Description": "When captain Jean-Luc Picard and the crew of the U.S.S. Enterprise? receive news of a human planet hidden in the center of an immense stellar cloud, they immediately investigate.  Penetrating the cloud, the Starship crew is shocked to discover a world of knights and serfs lifted right out of Earth's Middle Ages. Ruthlessly exploiting the planet is a ring of intersellar trophy hunters preying on the immense, native dragon-lizards twentey-feet tall and armored like tanks.  Beaming down, an away team soon becomes embroiled in a web of intrigue and murder. Taken prisoner, Picard, Riker, Data and Ro must somehow escape and stop the hunters or face destruction from the hunters' weapon, based on an advanced technoloy capable of utterly annihilating the Starship Enterprise?.",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "American Pit Bull Terrier Handbook (Barron's Pet Handbooks)",
        "Authors": "By Stahlkuppe, Joe",
        "Description": "Owners of this assertive breed are advised on the importance of rigorous but humane obedience training. All other aspects of purchase, health care, feeding, and housing are discussed in detail. Titles in Barron's popular Pet Handbooks series instruct pet owners on health care, proper feeding and housing, and other facts important to owners and their pets.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Hunters Bible",
        "Authors": "By Merrill, William",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1968"
        }
    },
    {
        "Title": "The Cocker Spaniel: An Owner's Guide to a Happy Healthy Pet",
        "Authors": "By Iby, Judith P.",
        "Description": "An Owner's Guide to a Happy Healthy Pet is the series to turn to when you want a basic reference that's reliable, up-to-date, and complete. These guides feature:* Expert authors, plus renowned guest contributors on specialized topics* Full-color photos throughout* Basic information on the breed, species, or topic* Complete coverage of care, health, grooming, training, and more* Tips and techniques to make life with a pet more rewarding",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Pomeranian: An Owner's Guide to a Happy Healthy Pet (Your Happy Healthy Pet, 120)",
        "Authors": "By Jones, Happeth A.",
        "Description": "\"\"An Owner's Guide to a Happy Healthy Pet\"\" is the series to turn to when you want a basic reference that's reliable, up-to-date, and complete. These guides feature: Expert authors, plus renowned guest contributors on specialized topicsFull-color photos throughoutBasic information on the breed, species, or topicComplete coverage of care, health, grooming, training, and moreTips and techniques to make life with a pet more rewarding",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Why Horses Do That: A Collection of Curious Equine Behavior",
        "Authors": "By Dines, Lisa",
        "Description": "Lighthearted explanations of horse behaviors are paired with original pencil drawings of horses in action.",
        "Category": " Pets , Horses",
        "Publisher": "Willow Creek Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Shared Splendor",
        "Authors": "By Miley, Jeanie",
        "Description": "",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "The Courageous: Rebels Trilogy, Book 2 (Star Trek: Deep Space Nine, No. 25)",
        "Authors": "By Ab Hugh, Dafydd",
        "Description": "Kai Winn, the supreme spiritual leader of the Bajoran people, has never divulged what she personally did during the harsh and perilous days of the Occupation. But now, as alien warships fight to reclaim Deep Space Nine, she cannot help recalling those bygone days -- and her own private war against the alien oppressors.  Meanwhile, on the other side of the wormhole, Captain Sisko and the crew of the Defiant are stranded on an alien world overrun by ruthless invaders....",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Star Trek",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Lent Begins at Home",
        "Authors": "By Ryan, P.",
        "Description": "",
        "Category": " Religion , Prayer",
        "Publisher": "Liguori Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1979"
        }
    },
    {
        "Title": "The Heart of the Warrior (Star Trek: Deep Space Nine, No 17)",
        "Authors": "By Betancourt, John",
        "Description": "While a crucial peace conference fills Deep Space NineTM with rumors of intrigue and conspiracy, Major Kira and Lt. Commander Worf embark on a dangerous undercover mission deep into the heart of the Gamma Quadrant. Their mission: to find the secret of the addictive substance that the Changelings use to control their Jem'Hadar warriors. But how long can Worf and Kira remain undetected in the midst of the Dominion? Odo may be their only hope; but to save them, he'll have to stand against his own people.",
        "Category": " Fiction , Science Fiction , Space Opera",
        "Publisher": "Pocket Books/Star Trek",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Star Trek 10",
        "Authors": "By Blish, James",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1974"
        }
    },
    {
        "Title": "Sleeping with Cats: A Memoir",
        "Authors": "By Piercy, Marge",
        "Description": "A stirring memoir from the acclaimed writer praised by Thomas Pynchon for having \"the guts to go into the deepest core of herself, her time, her history, and risk more than anybody else has so far, just out of a love for the truth and a need to tell it.\"Called \"breathtakingly ambitious\" by the New York Times for her novels' forays into war, history, the lives of the homeless, and the minds of cyborgs, Marge Piercy, one of the few writers of our time to be highly praised as both a poet and a novelist, turns her lens inward for the first time as she shares her thoughts on life and explores her development as a woman and writer. She revisits the people and places that have shaped her experiences and inspired her work. And she pays tribute to the one loving constant that has offered her comfort and meaning even as the faces and events in her life have changed: her beloved cats.With searing honesty Piercy tells of her strained childhood growing up in a religiously split working-class family in Detroit. She examines her myriad friendships and relationships, including two painful early marriages, and reveals their effects on her creativity and career. More than a reminiscence of things past, however, Sleeping with Cats is also a celebration of the present and the future, as Piercy shares her views on aging, creativity, and finding a lasting and improbable love with a man fourteen years younger than herself. A chronicle of the turbulent and exciting journey of one artist's life, Sleeping with Cats is a deeply intimate, unforgettable story.",
        "Category": " Pets , Cats , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "24.95",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Sacraments Today",
        "Authors": "By Farrell, Christopher",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Liguori Publications,U.S.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "How To Get Into Harvard Law School",
        "Authors": "By Epps, Willie J.",
        "Description": "Offers surefire advice as well as 50 successful application essays from current students and recent graduates.",
        "Category": " Law , Legal Education",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Plays of Oscar Wilde (Vintage Classics)",
        "Authors": "By Wilde, Oscar",
        "Description": "This Vintage edition of The Plays_of Oscar Wilde contains the plays that made Wilde one of the most important dramatists of his time, including The Importance of Being Earnest, one of the great works of modern literature.Oscar Wilde's plays demonstrate once again why their author must be seen as both an inaugurator and a master of modernism. In his best work, the subversive insights embedded in his wit continue to challenge our common assumptions. Wilde's ability to unsettle and startle us anew with his radical vision of the artifice inherent in the self's construction makes him our contemporary.This edition is introduced by John Lahr, author of Prick Up Your Ears: The Biography of Joe Orton. The plays included are Lady Windermere's Fan, Salome, A Woman of No Importance, An Ideal Husband, and The Importance of Being Earnest.",
        "Category": " Drama , European , English, Irish, Scottish, Welsh",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Restaurant Confidential",
        "Authors": "By Jacobson and Hurley",
        "Description": "",
        "Category": "",
        "Publisher": "Workman Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Escape North! The Story of Harriet Tubman (Step-Into-Reading, Step 4)",
        "Authors": "By Kulling, Monica and Flavin, Teresa (ILT)",
        "Description": "An easy-to-read, page-turning account of Harriet Tubman's life--from her childhood in slavery to her years as a conductor on the Underground Railroad to her later work as a suffragette and as a spy in the Civil War. This remarkable true story brings to life one of America's greatest female role models.",
        "Category": " Juvenile Nonfiction , People & Places , United States , African American",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "This Is Not Chick Lit: Original Stories by America's Best Women Writers",
        "Authors": "By Merrick, Elizabeth (EDT)",
        "Description": "Chick lit: A genre of fiction that often recycles the following plot: Girl  in big city desperately searches for Mr. Right in between dieting and shopping for  shoes. Girl gets dumped (sometimes repeatedly). Girl finds Prince Charming.  This  Is Not Chick Lit is a celebration of America’s most dynamic literary voices, as well  as a much needed reminder that, for every stock protagonist with a designer handbag  and three boyfriends, there is a woman writer pushing the envelope of literary fiction  with imagination, humor, and depth.  The original short stories in this collection  touch on some of the same themes as chick lit–the search for love and identity–but  they do so with extraordinary power, creativity, and range; they are also political,  provocative, and, at turns, utterly surprising. Featuring marquee names as well as  burgeoning talents, This Is Not Chick Lit will nourish your heart, and your mind.  Including these original stories:“The Thing Around Your Neck” by Chimamanda Ngozi Adichie “Two Days” by Aimee Bender “An Open Letter to Doctor X” by Francine Prose “Gabe” by Holiday Reinhorn “Documents of Passion Love” by Carolyn Ferrell “Volunteers Are Shining Stars” by Curtis Sittenfeld “Selling the General” by Jennifer Egan “The Seventy-two-Ounce Steak Challenge” by Dika Lam “Love Machine” by Samantha Hunt “Ava Bean” by Jennifer S. Davis “Embrace” by Roxana Robinson “The Epiphany Branch” by Mary Gordon “Joan, Jeanne, La Pucelle, Maid of Orléans” by Judy Budnitz “Gabriella, My Heart” by Cristina Henríquez “The Red Coat” by Caitlin Macy “The Matthew Effect” by Binnie Kirshenbaum “The Recipe” by Lynne Tillman “Meaning of Ends” by Martha WittPraise for This Is Not Chick Lit “This Is Not Chick Lit is important not only for its content, but for its title.  I’ll know we’re getting somewhere when equally talented male writers feel they have  to separate themselves from the endless stream of fiction glorifying war, hunting  and sports by naming an anthology This Is Not a Guy Thing.”—Gloria Steinem “These  voices, diverse and almost eerily resonant, offer us a refreshing breath of womanhood-untamed,  ungroomed, and unglossed.”—Elle",
        "Category": " Fiction , Literary",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "On Deadline: Managing Media Relations, Third Edition",
        "Authors": "By Howard, Carole M. and Mathews, Wilma K.",
        "Description": "Advice on managing media relations from the authors' combined six decades of experience as public relations practitioners in the corporate and nonprofit worlds. This third edition includes expanded coverage of international public relations, new information on how the Internet has affected the practice of media relations and thoughts on effective use of the media to change opinions and behaviors. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": "",
        "Publisher": "Waveland Pr Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Major Problems in American Women's History: Documents and Essays (Major Problems in American History Series)",
        "Authors": "By Norton, Mary Beth (EDT) and Alexander, Ruth M. (EDT)",
        "Description": "This text, appropriate for courses in U.S. women's history, presents a carefully selected group of readings that allow students to evaluate primary sources, test the interpretations of distinguished historians, and draw their own conclusions. Designed to encourage critical thinking about history, the Major Problems in American History series introduces students to both primary sources and analytical essays.",
        "Category": " History , General",
        "Publisher": "D C Heath & Co",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "The Love Between Grandmothers & Grandchildren",
        "Authors": "By Exley, Helen (EDT)",
        "Description": "Inspirational quotations",
        "Category": " Family & Relationships , Parenting , Grandparenting",
        "Publisher": "Helen Exley Gift Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Lovers: Stories by Women",
        "Authors": "By Sumrall, Amber Coverdale (EDT)",
        "Description": "",
        "Category": " Literary Criticism , General",
        "Publisher": "Crossing Pr",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Running Scared: The Life and Treacherous Times of Las Vegas Casino King Steve Wynn",
        "Authors": "By Smith, John L.",
        "Description": "Steve Wynn is the former owner of the Bellagio ? Las Vegas's latest monument to conspicuous consumption whose hotel and casino contain over 300 million in fine art and 1.5 billion in Wall Street money. He's a mogul whose empire at one point included the Mirage, the Golden Nugget, and Treasure Island. But how did he gain and wield his tremendous power in Nevada? And why did a confidential Scotland Yard report prevent him from opening a casino in London? When this biography, written by a local reporter, was first released in 1995, Steve Wynn brought suit against its original publisher and forced him into bankruptcy. Now available in paperback, the inside story of the biggest phenomenon to roil Las Vegas since Hoover Dam gives readers an intimate glimpse at the real business that's conducted beyond the gaming tables.",
        "Category": " Biography & Autobiography , Business",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Effective Public Relations",
        "Authors": "By Center, Allen H., Cutlip, Scott M., and Broom, Glen M., Ph.D.",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice-Hall",
        "Price Starting With ($)": "5.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Moscow 1900 - 1930",
        "Authors": "By Serge Fauchereau, Andre Lischke, Elena Rakitina",
        "Description": "",
        "Category": "",
        "Publisher": "Kluwer Academic Publishers",
        "Price Starting With ($)": "7.01",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "America in So Many Words: Words That Have Shaped America",
        "Authors": "By Barnhart, David K. and Metcalf, Allan A.",
        "Description": "America in So Many Words presents a unique and fascinating historical view of this country's language. It chronicles, year by year, the contributions we have made to the vocabulary of English and the words we have embraced as the nation has evolved. From canoe (1555), and corn (1608), to newbie (1993), and Ebonics (1997), a prominent word for nearly every year in the history of our nation is analyzed and discussed in its historical context. The result is an engaging survey of American linguistic culture through the centuries. The authors - both lifelong students of American English - bring a great depth of understanding to the words that have made the nation and the language what they are today.",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Good Cats, Bad Habits by Alice Rhea (2007-05-04)",
        "Authors": "By Alice Rhea",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes and Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Complete Will Kit",
        "Authors": "By Appel, Jens C.",
        "Description": "An easy-to-follow guide to creating a will that may be used at any stage of estate planning. Presents all the information you'll ever need to write your will—quickly and accurately. Enhanced by a variety of illustrations, it includes a lifetime set of detachable will forms and related documents, along with completed samples in a special section. Step-by-step instructions are provided for organizing your estate assets, and key information regarding each state's laws are summarized in a handy guide. In addition, full descriptions are included of Executors' duties and responsibilities.",
        "Category": " Law , Wills",
        "Publisher": "Wiley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Guide to Owning a Maine Coon Cat",
        "Authors": "By Greene, Abigail",
        "Description": "",
        "Category": " Pets , Cats , Breeds",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Broken Things: Why We Suffer",
        "Authors": "By DeHaan, M. R",
        "Description": "Dr. De Haan writes compassionately to broken Christians and shows how their suffering can usher in a treasure of maturity and wholeness. He applies the healing principles of God’s Word to encourage those who have been scarred by loss of employment, health, or by the death of a loved one.",
        "Category": " Religion , Psychology of Religion",
        "Publisher": "Discovery House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "The 14 Day Stress Cure: A New Approach for Dealing With Stress That Can Change Your Life",
        "Authors": "By Orman, Morton C.",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Breakthru Pub",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Dictionary of Saints",
        "Authors": "By Delaney, John J",
        "Description": "The preeminent resource guide for more than twenty years, this one-of-a-kind book has been updated to include those recently canonized and beatified.Since its original publication in 1980, John J. Delaney’s DICTIONARY OF SAINTS (more than 200,000 copies sold) has become the leading reference book for the scholar and general reader alike. With more than five thousand biographies of the saints—from the well known to the obscure—this new edition brings to life the inspiring accomplishments of these men and women of God.  The martyrs and the monks, the mystics and the virgins, the doctors and the peasants are all contained in this essential volume. To know the saints, how they thrived in their achievements, how they lived in destitution, is to meet a fascinating company of people whose actions have influenced and enriched the history of the world.Reset in an easy-to use-format, it contains substantial listings for the more popular saints, and thumbnail sketches for those less well known. From Aaron to Zosimus, this modern dictionary has been updated with the entries for the newly canonized,  including Italian mystic Padre Pio, Mexican Nahuatl Juan Diego, Polish Franciscan Maximilian Kolbe, and Americans Katharine Drexel and Rose Philippine Duchesne. It also contains a complete listing of feast days, an index of patron saints, and several other useful appendixes.",
        "Category": " Religion , Reference",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1980"
        }
    },
    {
        "Title": "The Spirit to Serve: Marriott's Way",
        "Authors": "By Brown, Kathi Ann and Marriott, J. Willard",
        "Description": "The Chief Executive Officer of Marriott International explains how he built his corporation into a ten-billion-dollar enterprise, offering elementary yet effective principles for motivating employees, cultivating customer loyalty, and more. National ad/promo. Tour.",
        "Category": " Business & Economics , Management",
        "Publisher": "HarperBusiness",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Richard Scarry's Cars and Trucks from A to Z (A Chunky Book(R))",
        "Authors": "By Scarry, Richard",
        "Description": "Illustrated in full color. This car-and- truck-filled alphabet extravaganza that starts with an ambulance and ends with a zippercar, is shaped like Lowly Worm's applemobile.",
        "Category": " Juvenile Fiction , Transportation , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Diaries, 1918-1939",
        "Authors": "By Kesten, Hermann.",
        "Description": "",
        "Category": "",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "7.66",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Garden Magic",
        "Authors": "By Jerry Baker",
        "Description": "",
        "Category": "",
        "Publisher": "The YardenCare Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    }
]