[
    {
        "Title": "God's Word for Growing in Prayer: Devotional Thoughts on Talking With God",
        "Authors": "By Murray, Andrew",
        "Description": "",
        "Category": "",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Pasta (Little Guides)",
        "Authors": "By Fog City Press (Manufactured by)",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Weldon Owen",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "The Crooked Banister (Nancy Drew Mystery Stories, No. 48)",
        "Authors": "By Keene, Carolyn",
        "Description": "Nancy and her friends Bess and George spend an exciting week exploring a mysterious zigzag house with its fantastically crooked staircase, its bizarre serpent picture, and an unpredictable robot that nearly causes the young detective to lose her life. But despite the threat of danger from the robot, Nancy is determined to solve the mystery of the weird house and to locate the missing owner who is wanted by the police. It takes keen logic and quick thinking for the young detective to plow through the tangled thicket of clues and find the key to this complex puzzle. With the help of her friends, Nancy captures an elusive swindler and uncovers the secret of the crooked banister, but not before they have several hair-raising adventures – one on a broken bridge over flaming water, another in a hidden room with poisoned portraits!",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The Clue of the Dancing Puppet",
        "Authors": "By Keene, Carolyn",
        "Description": "When the eerie performances of a life-size puppet begin to haunt the old Van Pelt estate, where an amateur acting group – The Footlighters – have their theater, Nancy Drew is called upon to unravel the baffling mystery. From the moment the detective and her friends Bess and George arrive at the mansion, the dancing puppet puzzle is further complicated by Tammi Whitlock, the Footlighters’ temperamental leading lady, and Emmet Calhoun, a Shakespearean actor.Nancy’s search of the mansion’s dark, musty attic for clues to the weird mystery starts a frightening chain reaction. A phone call from a stranger with a witchlike, cackling voice warns her to “Get out!” Next an encounter with two jewel theft suspects adds another perplexing angle to the puzzle. When Nancy finally sees the life-size puppet flitting across the moonlit lawn and chases it, she learns that someone with a sinister motive is determined to keep her form solving the case. Is it one of the Footlighters? Or is it an outsider?",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1962"
        }
    },
    {
        "Title": "Bridges Not Walls: A Book About Interpersonal Communication",
        "Authors": "By Stewart, John Robert (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Mcgraw-Hill College",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Secrets of Entertaining From America's Best Innkeepers",
        "Authors": "By Greco, Gail",
        "Description": "Offers practical suggestions on decorating, cooking, gardening, flower arranging, housekeeping, and party planning",
        "Category": "",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Slow Cooker Recipe Collection (3 Cookbooks in 1)",
        "Authors": "By Publications International",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Henry Adams: An Introduction and Interpretation (American Authors and Critics Series)",
        "Authors": "By Hochfield, George",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "Trattoria : The Best of Casual Italian Cooking (Casual Cuisines of the World)",
        "Authors": "By Johnson, Peter and Clark, Mary Beth",
        "Description": "Gathers recipes with diverse regional origins from Italy's simple, family-style cooking tradition, including seafood risotto, baked fennel, and swordfish rolls stuffed with shrimp",
        "Category": " Cooking , Regional & Ethnic , Italian",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Turn of the Tide: A History of the War Years Based on the Diaries of Field-Marshal Lord Alanbrooke, Chief of the Imperial General Staff",
        "Authors": "By Bryant, Arthur",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "Slow Cooker Ready & Waiting: 160 Sumptuous Meals That Cook Themselves",
        "Authors": "By Rodgers, Rick",
        "Description": "Hearty stews. Rib-sticking chilis. Tender pot roasts. The real secret is a long, slow simmer at a constant temperature, and no appliance does this better than the slow cooker. If your old slow cooker recipes disappointed you, throw them away! The Slow Cooker Ready and Waiting Cookbook is for people who love good food!Rick Rodgers has adapted an eclectic array of American and ethnic dishes for the slow cooker. They're all here: fancy fare (Farmer's Market Lobster and Corn Chowder, Sweet and Sour Brisket, Erna's Sauerbraten), everyday favorites (Ground Beef Chili with Cornmeal Dumplings and Herbed Tomato Sauce with Parmesan Meatballs), side dishes (Potatoes Euphoria, Smothered Green Beans, Sugarbush Beans) -- even desserts (Strawberry-Strawberry Cheesecake, Bourbon Bread Pudding, and Lemon-Raspberry Pudding Cake). Ideal for entertaining, the slow cooker keeps crowd-pleasing dips and holiday punches warm from the beginning of the party to when the last guest leaves.A special section explains how to choose the right-size slow cooker for your needs, how to adapt a favorite recipe, and what can (and can't) be prepared in a slow cooker.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Disciplined Mind: Beyond Facts and Standardized Tests, the K-12 Education that Every Child Deserves",
        "Authors": "By Gardner, Howard",
        "Description": "In The Disciplined Mind, Howard Gardner argues that K-12 education should strive for a deep understanding of three classical principles: truth, beauty, and goodness. Such an understanding requires mastery of the major disciplines that human beings have created over the centuries. As powerful examples of his approach, Gardner describes an education that illuminates the theory of evolution, the music of Mozart, and the lessons of the Holocaust. Far from the standardized test mentality that has gripped both policy makers and the public, Gardner envisions an education that preserves the strengths of a traditional humane education while preparing younger generations for the challenges of the future.",
        "Category": " Education , Educational Policy & Reform , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The War Against America's Public Schools: Privatizing Schools, Commercializing Education",
        "Authors": "By Bracey, Gerald W.",
        "Description": "This book provides a comprehensive view of forces such as charters, vouchers, educational management organizations (EMO's), and private schools that are altering the future of public education.    Gerald Bracey describes why Americans are nervous about their public schools and examines whether their anxieties are justified. In the first section, the book looks at education reform efforts such as privatization. It then concludes with an overview and analysis of how American schools actually perform on achievement tests and international measures. In the second half of the book, Bracey explores the alternatives to public schools that have sprung up in recent years.    For educational administrators, policy makers, and others interested in the changing face of education.",
        "Category": " Education , Educational Psychology",
        "Publisher": "Pearson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Photocraft: Cool Things to Do with the Pictures You Love",
        "Authors": "By Herter, Caroline, Frankel, Laurie, and Lovett, Laura",
        "Description": "Introduces more than forty simple, stylish, affordable, and ingenious ways to use and display one's photographs, explaining how transform photographs into vellum lampshades, quilts, folding screens, or tote bags in a guide that features detailed step-by-step instructions, full-color photographs, and line illustrations. 30,000 first printing.",
        "Category": " Photography , General",
        "Publisher": "Bulfinch",
        "Price Starting With ($)": "6.21",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Mama Zooms",
        "Authors": "By Cowen-Fletcher, Jane",
        "Description": "A small boy, with the aid of his energetic mother, her wheelchair \"zooming machine,\" and a bit of imagination, pretends that he is on a train, a spaceship, and more. Reprint.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Scholastic",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "The Parent's Guide to Raising Twins: From Pre-Birth To First School Days-The Essential Book For All Those Expecting Two Or More",
        "Authors": "By Mueser, Anne Marie, Friedrich, Elizabeth, and Rowland, Cherry",
        "Description": "For anyone expecting twins-and for those already raising them-The Parents' Guide to Raising Twins is a practical and comprehensive resource. Cherry Rowland and Elizabeth Friedrich, both mothers of twins, have tapped into a wealth of guidelines and advice from doctors and nurses, as well as the personal experiences of thirty-five other parents of twins and triplets.They map out the special problems and pleasures of:-Being pregnant with twins: how to obtain an accurate diagnosis; prenatal care; complications to watch for-Managing the early months: how to adjust to sleeping patterns; breast-feeding for two or more; the question of dressing twins-Treating young twins as individuals: how to cope with the competitiveness (and closeness) between twins, and common misconceptions about \"twinness.\" The authors list clubs and organizations specially devoted to issues of rearing twins. With their help, no parent will feel alone in caring for more than one baby at a time.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Dark Tide (Ty Hauck)",
        "Authors": "By Gross, Andrew",
        "Description": "An explosion rips through New York City's Grand Central Station one morning, destroying the train Karen Friedman's husband, a successful hedge fund manager, is riding in to work. Days later, with many bodies still unidentifiable, Karen resigns herself to the awful truth: her husband of eighteen years is dead.On that same day, a suspicious hit-and-run accident leaves a young man dead in Karen's hometown of Greenwich, Connecticut. Ty Hauck, a detective, becomes emotionally caught up in the case and finds a clue that shockingly connects the two seemingly unrelated events.Months later, two men show up at Karen's home digging into Charles's business dealings. Hundreds of millions of dollars are missing—and the trail points squarely to Charles. With doubt suddenly cast on everything she has ever known, Karen, with Hauck, steps into a widening storm of hedge fund losses, international scams, and murder. And as the investigations converge, these two strangers touched by tragedy are pulled into a deepening relationship and unwittingly open the door to a twisted—and deadly—conspiracy.With its breakneck pacing, plentiful twists, compelling characters, and abundant heart, The Dark Tide confirms Andrew Gross's place as a master storyteller at the top of his game.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Christmas A to Z",
        "Authors": "By Augustine, Peg and Vargas, Emmanuel",
        "Description": "Words in alphabetical order help tell the traditional Christmas story in both English and Spanish. Suitable for all ages, younger children can recite simple words following the alphabetical order and older children can refer to Scripture listed on each page.",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Easter & Lent",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Mtiv: Process, Inspiration and Practice for the New Media Designer",
        "Authors": "By Curtis, Hillman",
        "Description": "MTIV (Making the Invisible Visible) is an indispensable guide for the new age of media design. This book is about HOW to achieve the results that bring in profits and make you a better designer. This beautifully written and designed book unveils the methods behind Hillman Curtis' phenomenal success as a new media designer. In well-crafted narrative and instructional form, Hillman outlines his systematic approach for working with clients to develop clear, cogent, and creative communication - three \"musts\" for successful design.     Through trial and error, Hillman and his company honed a seven-step process for creating concepts, and developing and designing new media. Often overlooked or unknown by designers, the methods in this book are distilled from years of experience and enhanced by Hillman's years as a leader in the design field. Divided into three parts - \"Process,\" \"Inspiration,\" and \"Practice\" - the book offers a practical methodology for successful artistic and professional work and also offers technical advice for translating this to the web (color, XML, streaming media, and other topics are discussed). Written with a subtle sense of humor and narration that really flows, this book is a joy to read, with great advice that helps designers with their own design work.",
        "Category": " Computers , Interactive & Multimedia",
        "Publisher": "New Riders",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Attacks On The Press In 2004",
        "Authors": "By Sweeney, Billy J. (EDT) and Cooper, Ann (EDT)",
        "Description": "",
        "Category": " Business & Economics , Industries , Media & Communications",
        "Publisher": "Committee to Protect",
        "Price Starting With ($)": "11.4",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "People Styles at Work: Making Bad Relationships Good and Good Relationships Better",
        "Authors": "By Bolton, Robert and Bolton, Dorothy Grover",
        "Description": "Why is it so hard to work well with some people? People Styles at Work...and Beyond presents a comprehensive, practical, and proven method readers can use to: • recognize how they come across to other coworkers • read others’ body language and behavior to identify the best ways to work with them • make small adjustments that will dramatically increase the quality and productivity of their interactions • find common ground with different people while retaining their individuality • relate less defensively and more effectively—no matter how others act The book reveals the strengths and weaknesses of four different people styles, providing practical techniques that work both on the job and off. Now including all new material on personal relationships, parenting, and more, this is the ultimate guide anyone can use to enhance even the most difficult relationships.",
        "Category": " Business & Economics , Management",
        "Publisher": "Amacom Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Chicken Soup for the Military Wife's Soul: Stories to Touch the Heart and Rekindle the Spirit (Chicken Soup for the Soul)",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), Preston, Charles (COM), and Pedersen, Cindy (COM)",
        "Description": "A tribute to the women who uphold the written and unwritten oaths of service and of marriage.All military personnel swear an oath to uphold the constitution and protect our country, while their spouses takes the unwritten oath to live a life of frequent moving, lengthy separations and endless anxieties. Their commitment requires a unique blend of patriotism, dedication, hard work and, most of all, flexibility.The stories in Chicken Soup for the Military Wife's Soul are written by military family members and the courageous women who themselves serve in the military. They celebrate the women who unite with kindred spirits to raise families, maintain homes and uphold the most positive attitudes when facing the fears of losing a loved one. Each page in this special volume celebrates the unique bond between military wives and spouses and their dedication to home and country.",
        "Category": " Self-help , Spiritual",
        "Publisher": "HCI",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Adolescent Portraits",
        "Authors": "By Garrod, Andrew, etc., Smulyan, Lisa, Powers, Sally, Kilkenny, Robert",
        "Description": "Brings together representative cases (written and revised by undergraduates or recent graduates) that reflect the experience of today's adolescents their social and historical context, their diversity, their concerns and some key theories and approaches used in the study of adolescence. For use as a primary or a supplemental text in a course on adolescent development. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "The Snow Fox: A Novel",
        "Authors": "By Schaeffer, Susan Fromberg",
        "Description": "One thousand years ago, chaos loosed itself upon Japan, upending an era in which the arts flourished. At the dawn of 250 years of civil war, in the opulent court of Lord Norimasa, the beautiful but cruel poet Lady Utsu wages war with men's hearts and holds the fearsome lord and his devoted samurai Matsuhito in her thrall. As the two men raze Japan's landscape in futile battles for unity, Utsu falls for Matsuhito even as Lord Norimasa continues to love her. The epic romance of Utsu and Matsuhito resumes itself decades later, when they meet as vagrants so transformed by time that they no longer recognize each other; they are reunited through their mystical connection to a pair of snow foxes that are their only company in the Japanese wilderness. The heartbreaking story of their renewed love is fraught by the Japanese concept of mono no aware—life's ephemeral nature—that weighs on the lovers. Reading group guide included.",
        "Category": " Fiction , Romance , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Conscience in Conflict: How to Make Moral Choices",
        "Authors": "By Overberg, Kenneth R.",
        "Description": "",
        "Category": "",
        "Publisher": "St Anthony Messenger Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "The Fortune of War (Aubrey / Maturin)",
        "Authors": "By O'Brian, Patrick",
        "Description": "Captain Jack Aubrey, R. N., arrives in the Dutch East Indies to find himself appointed to the command of the fastest and best-armed frigate in the Navy. He and his friend Stephen Maturin take passage for England in a dispatch vessel. But the War of 1812 breaks out while they are en route. Bloody actions precipitate them both into new and unexpected scenes where Stephen's past activities as a secret agent return on him with a vengeance.",
        "Category": " Fiction , Sea Stories",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "The Mauritius Command (Aubrey/Maturin)",
        "Authors": "By O'Brian, Patrick",
        "Description": "Captain Jack Aubrey is ashore on half pay without a command—until Stephen Maturin arrives with secret orders for Aubrey to take a frigate to the Cape of Good Hope under a commodore's pennant, there to mount an expedition against the French-held islands of Mauritius and La Réunion. But the difficulties of carrying out his orders are compounded by two of his own captains—Lord Clonfert, a pleasure-seeking dilettante, and Captain Corbett, whose severity pushes his crew to the verge of mutiny.",
        "Category": " Fiction , Sea Stories",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "10.95",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "H. M. S. Surprise (Aubrey / Maturin)",
        "Authors": "By O'Brian, Patrick",
        "Description": "Third in the series of Aubrey-Maturin adventures, this book is set among the strange sights and smells of the Indian subcontinent, and in the distant waters ploughed by the ships of the East India Company. Aubrey is on the defensive, pitting wits and seamanship against an enemy enjoying overwhelming local superiority. But somewhere in the Indian Ocean lies the prize that could make him rich beyond his wildest dreams: the ships sent by Napoleon to attack the China Fleet.",
        "Category": " Fiction , Sea Stories",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Lonely Planet Thailand",
        "Authors": "By Cummings, Joe, Williams, China, Blond, Becca, Warren, Matt, and Konn, Morgan",
        "Description": "Complemented by easy-to use, reliable maps, helpful recommendations, authoritative background information, and up-to-date coverage of things to see and do, these popular travel guides cover in detail countries, regions, and cities around the world for travelers of every budget, along with extensive itineraries, maps with cross-referencing to the text, \"Top 10\" and \"Top 5\" lists, and other practical features.",
        "Category": " Travel , Asia , Southeast",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Schaum's Easy Outline of Writing and Grammar",
        "Authors": "By Spruiell, William C. and Zemach, Dorothy E.",
        "Description": "Boiled-down essentials of the top-selling Schaum's Outline series for the student with limited timeWhat could be better than the bestselling Schaum's Outline series? For students looking for a quick nuts-and-bolts overview, it would have to be Schaum's Easy Outline series. Every book in this series is a pared-down, simplified, and tightly focused version of its predecessor. With an emphasis on clarity and brevity, each new title features a streamlined and updated format and the absolute essence of the subject, presented in a concise and readily understandable form.Graphic elements such as sidebars, reader-alert icons, and boxed highlights stress selected points from the text, illuminate keys to learning, and give students quick pointers to the essentials.Designed to appeal to underprepared students and readers turned off by dense text Cartoons, sidebars, icons, and other graphic pointers get the material across fast Concise text focuses on the essence of the subject Delivers expert help from teachers who are authorities in their fields Perfect for last-minute test preparation So small and light that they fit in a backpack!",
        "Category": " Language Arts & Disciplines , Grammar & Punctuation",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The Forest and The Sea: A Look at the Economy of Nature and the Ecology of Man (Time Reading Program Special Edition)",
        "Authors": "By Bates, Marston",
        "Description": "",
        "Category": "",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Surrounded By Geniuses: Unlocking the Brilliance in Yourself, Your Colleagues and Your Organization",
        "Authors": "By Gregerman, Alan S.",
        "Description": "How many times have you arrived at work, exchanged greetings with your colleagues, attended a meeting or two, and then sat down at your desk overcome by the incredible feeling that you were surrounded by geniuses? And how many times have you headed home from work, looked around, and been struck with an awesome sense that you were surrounded by a world of geniuses and brilliant ideas? If you're like most people, caught up in the stress of work and everyday life, the answer is a resounding \"never!\" But that's all about to change.In Surrounded by Geniuses Alan Gregerman presents a revolutionary guide to personal, professional and organizational success based on two powerfully simple ideas:First, that there is genius hidden in all of us. And second, that we are surrounded by a world filled with genius that can be used to transform any company or organization in order to deliver compelling customer value.He then shows us in clear and practical ways how to unlock the genius in ourselves and our organizations by discovering and applying insight from the worlds of business, history, popular culture, nature, science and even science fiction. He does this by taking us on ten remarkable journeys to learn essential lessons from a world-class shock trauma unit, eight-year-old \"salespeople,\" rocket scientists, aerobics instructors, cheetahs, Seinfeld re-runs, and more. By the end, you will be astounded to find yourself surrounded by so many brilliant people and ideas. So grab your curiosity and your most comfortable shoes. It's time for a remarkable trip to your future success!",
        "Category": " Business & Economics , Organizational Behavior",
        "Publisher": "Sourcebooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Friend or Foe? (Outernet #1)",
        "Authors": "By Barlow, Steve and Skidmore, Steve",
        "Description": "A wild ride through strange galaxies and unexpected adventures. But watch your step -- and don't step in anything gross or smelly along the way!The Outernet is a web of intergalactic computer networks linked through Servers on different planets.As the series opens, we discover that the evil Tyrant and his henchmen (the FOES) are trying to take over the Outernet and use its powers to control the galaxy.Our heroes, including several not-so-lucky Earth kids, accidentally connect to the Outernet via a lost Server. They must work with the Friends of the Outernet to keep freedom and liberty in the Galaxy. They are assisted (and often hindered) by a hilarious dog and cat team who are disguised agents of the Friends and the FOES.",
        "Category": " Juvenile Fiction , Science Fiction",
        "Publisher": "Chicken House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Clean & Green",
        "Authors": "By Berthold, B.",
        "Description": "",
        "Category": " Reference , General",
        "Publisher": "Ceres Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "The Winter's Tale (The Pelican Shakespeare)",
        "Authors": "By Shakespeare, William and Dolan, Frances E. (EDT)",
        "Description": "The acclaimed Pelican Shakespeare series edited by A. R. Braunmuller and Stephen Orgel   The legendary Pelican Shakespeare series features authoritative and meticulously researched texts paired with scholarship by renowned Shakespeareans. Each book includes an essay on the theatrical world of Shakespeare’s time, an introduction to the individual play, and a detailed note on the text used. Updated by general editors Stephen Orgel and A. R. Braunmuller, these easy-to-read editions incorporate over thirty years of Shakespeare scholarship undertaken since the original series, edited by Alfred Harbage, appeared between 1956 and 1967. With definitive texts and illuminating essays, the Pelican Shakespeare will remain a valued resource for students, teachers, and theater professionals for many years to come.   For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "Category": " Drama , Shakespeare",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "PASO A PASO 2000 STUDENT EDITION LEVEL 3 STUDENT EDITION",
        "Authors": "By Sayers, Met, and Wargin",
        "Description": "",
        "Category": " Young Adult Nonfiction , Foreign Language Study , General",
        "Publisher": "Addison-Wesley",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Pocket Atlas of Pharmacology (Thieme Flexibook)",
        "Authors": "By Lullmann, Heinz (EDT), Mohr, Klaus, M.D., Ziegler, Albrecht, and Bieger, Detlef, M.D.",
        "Description": "",
        "Category": " Medical , Pharmacology",
        "Publisher": "Thieme Medical Pub",
        "Price Starting With ($)": "12.19",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Having of Wonderful Ideas and Other Essays on Teaching and Learning",
        "Authors": "By Duckworth, Eleanor",
        "Description": "",
        "Category": "",
        "Publisher": "Teachers College Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "Duct Shui",
        "Authors": "By Duct Tape Guys",
        "Description": "East meets West meets Duct Tape. Stumbling headfirst into the ancient Chinese philosophy of feng shui, The Duct Tape Guys emerge totally bewildered--but not before creating their own breathtakingly crazy philosophy. Duct Shui, as they call it, reveals secrets of achieving harmony and happiness, all through the use of you-know-what.With its terrific die-cut package (just to hold it feels peaceful, like a perfectly balanced roll of duct tape), Duct Shui is the newest work of inspired nuttiness from the guys who created the 365 Days of Duct Tape Calendar, The Jumbo Duct Tape Book, and other books.In feng shui, wind chimes and bird feeders stimulate the flow of chi (energy) in a yard. In Duct Shui, attract birds by duct taping plastic decoys to a birdbath. In feng shui, placing a wind chime in the front area of a home or office will summon people to help you. Duct Shui teaches that if you really want help, get some duct tape stuck in your hair and then pull hard--the screams will draw plenty of attention. In feng shui, a wind chime over the stove will cure binge eating. Duct Shui says enough with the wind chimes already!-you can cure binge eating by placing duct tape firmly across your mouth. Includes a Da Ktap compass (instead of the Pa Kua compass used by feng shui consultants), its very own mantra (Duct Tape, Duct Tape, Duct Tape, whispered until tranquility or sleep is achieved), and a paean to that essential influence-the couch. Just take a roll, tear off a piece, and hear the energy crackle.",
        "Category": " Humor , Form , Parodies",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Health Series: Strength Training for Muscle Development (Health)",
        "Authors": "By Hatfield, Mark",
        "Description": "It's like having a personal trainer who's there all the time: here are precise muscle- and strength-building exercises that will work beautifully for both men and women, and inspire anyone trying to increase endurance and improve mobility and posture. From push-ups to squats, from flies with free weights to crunches, these are simply the best routines to get quick results. And there's information on safety, equipment, and strength training principles, too.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Main Street",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Cooking Light Light & Easy Cookbook",
        "Authors": "By Leisure Arts",
        "Description": "Provides 330 healthful recipes for appetizers, breads, desserts, main dishes, meatless main dishes, salads, soups, sandwiches, and side dishes",
        "Category": " Cooking , Health & Healing , Weight Control",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Ortho's All About Roses (Ortho's All About Gardening)",
        "Authors": "By Ortho (EDT) and Cairns, Thomas",
        "Description": "The most compact, accessible and easy-to-use rose book in its price category.Endorsed by the American Rose Society.Selection and growing guide presents complete cultural and pruning information about more than 300 recommended varieties.At-a-glance design and organization help readers quickly find the information they need.Discusses every major rose group—with complete growing instructions for each variety.Author Thomas Cairns is one of the top rosarians in the United States, incoming president of the American Rose Society, and editor of the latest edition of its official reference publication, Modern Roses.",
        "Category": " Gardening , Flowers , Roses",
        "Publisher": "Ortho",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Cooking Light Low-Fat Low-Calorie: Quick & Easy Cookbook",
        "Authors": "By Leisure Arts",
        "Description": "Offers time-saving tips, and includes such recipes as French bread pizza, turkey-mushroom strata, jambalaya, crunchy chicken and cucumber salad, and cheddar potato soup",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Best Recipes: Desserts Cookbook",
        "Authors": "By W H Smith Publishers",
        "Description": "Presents award-winning dessert recipes from cooking contests across the United States, including pies, chocolate and fruit dishes, and other treats",
        "Category": " Cooking , Courses & Dishes , Desserts",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Embattled Confederates: An Illustrated History of Southerners at War",
        "Authors": "By Wiley",
        "Description": "",
        "Category": "",
        "Publisher": "Outlet",
        "Price Starting With ($)": "6.72",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Easy Everyday Low Carb Cookbook",
        "Authors": "By Better Homes and Gardens Books and Thomas, Kristi (EDT)",
        "Description": "200 total recipes plus daily meal plans (for 30 days) with carbohydrate counts of 45, 60, 80, and 100 grams.Recipes include beef, pork, lamb, seafood, side dishes, snacks, and desserts.Caters to the busy cook with a variety of low-carb recipes.Carb levels consistent with the Atkins plan.",
        "Category": " Cooking , Health & Healing , Weight Control",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Pig Plantagenet",
        "Authors": "By Andrews, Allen",
        "Description": "The pig Plantagenet cannot decide whether he likes the free but frightening life of his cousin, the boar Grondin, better than his own simple farmyard existence until a plan emerges to destroy the forest and its inhabitants",
        "Category": "",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "American Law: An Introduction",
        "Authors": "By Friedman, Lawrence Meir",
        "Description": "An updated and revised, comprehensive introduction, for students and general readers alike, to the American legal system includes historical notes and explanations of how laws are made and administered, and the differing varieties of law.",
        "Category": " Law , General",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Honestly",
        "Authors": "By Miller, Sheila Walsh",
        "Description": "How a Passage of Pain Became a Journey to JoyTalented and beautiful, Sheila Walsh seemed to be on top of the world. But behind her public success as a performing artist and talk show host, a private story was unfolding. Unable to cope with the inner turmoil that plagued her, Sheila stepped down as cohost of television’s 700 Club to deal with a pain too pressing to ignore.Honestly takes you on a journey past the walls that most of us put up and into the recesses of one woman’s heart. With rare grace, Sheila shares the story of her pilgrimage—the journey of a soul as it moved from hopelessness to honesty to freedom, and, ultimately, to a deepened faith and joy. With unrelenting candor, Sheila probes beyond the surface of her troubles to find a truth strong and real enough to set her free.Honestly shows how facing the things about ourselves that we try hardest to hide—fearful specters of loss, shame, and doubt—puts us on the high road to God’s liberating love and grace. Though the details may vary, Sheila’s story is in many ways the story of us all as we seek to deepen our ability to love and be loved and to learn the lessons that only adversity can teach.",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Fresh from the Word: Devotions for the 300th Anniversary of the Brethren",
        "Authors": "By Brethren Press",
        "Description": "",
        "Category": "",
        "Publisher": "Brethren Pr",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "After Diana: William, Harry, Charles, and the Royal House of Windsor",
        "Authors": "By Andersen, Christopher",
        "Description": "\"This family did not have a drop of humanity in it before. I think Ive changed that.\" --DianaFor all the millions of words that have been written about the People's Princess, no one has yet penetrated palace walls to reveal what has really happened to the Royal Family she left behind ten years ago. Until now. In the manner of his No. 1 New York Times bestsellers The Day Diana Died and The Day John Died, as well as such other bestsellers as his Jack and Jackie, Jackie After Jack, and Diana's Boys, Christopher Andersen (who was consulted by Operation Paget, Scotland Yard's official inquiry into Diana's Death) draws on important new sources to paint the first full portrait of a Royal Family still haunted by the ghost of Diana.All the compelling elements of a true dynastic saga are here: power, sex, wealth, intrigue, betrayal, tragedy, and scandal. But so, too, is the Princess's legacy of love and compassionalive in the sons who have grown to manhood and are now forging a legacy of their own.Among After Diana's many stunning revelations:The many times Diana predicted with uncanny accuracy how she would die, why she feared for Camilla's life as well as her own -- and the surprising, never-before-revealed identity of the woman Diana really felt might one day be Queen.New details about the hours and days after Diana's death: Charles's reaction the moment he saw Diana's body, how Camilla dealt with suddenly becoming the most hated woman in the world, and her secret eight-year campaign to replace Diana.How William and Harry have dealt with the public and private pressures -- the troubling influence of their substance-abusing aristocrat friends; from drugs to Nazi uniforms to lap dances and barroom brawls, fresh details about the Princes wild behavior and the demons that still haunt them.How Charles cheated on Camilla as well as Diana, and the intriguing other women in the Prince of Wales's life.Despite Charles's heated denials, the behind-the-scenes maneuvering to make Camilla Queen -- and the Palace power struggle that rages today.Inside Operation Paget, Scotland Yard's ongoing probe into Diana's death -- why, ten years after, investigators were still shocked by what they found.The day Charles was asked point-blank by Scotland Yard if he killed his wife -- and what he said.The many beautiful young women in the lives of William and Harry over the past ten years -- including Will's longtime love Kate Middleton, her chances of one day becoming Queen, and why he fears she may meet the same fate as his mother.William's obsession with speed, Harry's hunger for risk-taking, and a shared thirst for battle that could lead both Princes to combat in Iraq.New information on whether the Queen plans to step aside and who she really wants to see succeed her on the throne.Sometimes heartbreaking, often inspiring, always riveting, After Diana is more than just the first comprehensive, compelling biography of the House of Windsor as it is today. It is a bittersweet tale of love, loss, duty, and destiny. It is the story of a family.",
        "Category": " Biography & Autobiography , Royalty",
        "Publisher": "HYPERION",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "The ACLU vs. America: Exposing the Agenda to Redefine Moral Values",
        "Authors": "By Sears, Alan and Osten, Craig",
        "Description": "As a result of the work of the American Civil Liberties Union and their war on America, we now live in a country where the church has been progressively silenced, parental authority has been undermined, children are less safe, and human life continues to be cheapened-both at birth and death. While the ACLU and its allies in the media have positioned themselves as the great defenders of freedom, they are in reality eliminating the freedoms of millions of Americans. Sadly, most Americans are unaware of the extreme positions of the ACLU.But there is hope. Many Americans are waking up to the dangerous agenda of the ACLU. The ACLUvs. America will clue readers in to the culture wars afoot and will equip them to become effective agents for liberty and freedom against the ACLU's onslaught.",
        "Category": " Religion , Christian Theology , Liberation",
        "Publisher": "B&H Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Ghost at the Table: A Novel",
        "Authors": "By Berne, Suzanne",
        "Description": "Strikingly different since childhood and leading very dissimilar lives now, sisters Frances and Cynthia have nevertheless managed to remain \"devoted\" - so long as they stay on opposite coasts. But with the reappearance of their elderly, long-estranged father they find themselves reunited for a cold, snowy Thanksgiving week - a reunion that awakens sleeping tensions and old sorrows.Frances envisions a happy family holiday with her husband and daughters in her lovely old New England farmhouse. Cynthia, a writer of historical fiction, doesn't understand how Frances can ignore the past their father's presence revives, a past that includes suspicions about their mother's death twenty-five years earlier. Adding to her uneasiness is her research for a book on Mark Twain's daughters, whose lives she thinks eerily mirror her own and Frances's.As Thanksgiving day arrives, with a houseful of guests looking forward to dinner, the sisters continue to struggle with different versions of their shared past, until a warning issued by Cynthia's friend Carita, that \"families are toxic\" and \"blood is bloody,\" proves prophetically true.The Ghost at the Table reveals what happens when one person tries to rewrite another's history, and explores the mystery of why families try to stay together even when it may be in their best interests to stay apart.",
        "Category": " Fiction , Literary",
        "Publisher": "A Shannon Ravenel Book",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Savvy in the City: New York City: A \"See Jane Go\" Guide to City Living",
        "Authors": "By Becker, Sheridan and Young, Jayne",
        "Description": "Do you clip restaurant reviews out of the newspaper  Ask your girlfriends for salon and spa recommendations?  Keep those \"best of\" magazine issues in your coffee table for months?  Pass on to your officemates your secret \"in\" to top designer sample sales?  Wish you could find a dry cleaner that could rescue your chiffon dress from that red-wine encounter?  Wonder what off-the-beaten-path site you should visit on your oly free Saturday in the fall?If you've ever wished you had the answers to these and other vital questions at your fingertips, then Savvy in the City is here to change your life.Whether you're on a business trip or a shopping trip, here is just about everything a woman-about-town needs to know.  This user-friendly book is organized by neighborhood and category--Eats, Treats, Traumas, Treasures, Twilight, and Tripping.  Not intending to be encyclopedic, Savvy in the City selects and delivers the inside scoop on the jewels of the Big Apple in each particular category: the best unique boutiques and bargain-hunters' dream thrift stores, and the fastest solution to every possible city-girl \"trauma\", from spike heels that need fixing to a dinner party that needs catering to a delivery man who needs someone to meet him when you seddenly have to be at the doctor's office.Every woman living in or visiting New York City will love this handy reference.  Don't leave home without it.",
        "Category": " Travel , Reference",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Hole in the Wall Gang Cookbook: Kid-Friendly Recipes for Families to Make Together",
        "Authors": "By Hotchner, A. E., Newman, Paul, Wright, Carol, and Stalvey, Lisa",
        "Description": "An actor who established a camp for children with life- threatening diseases presents a cookbook in the same spirit of sharing and good times, including anecdotes from campers and their families in addition to more than seventy savory recipes. Original. 100,000 first printing.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Great Letters for Every Occasion",
        "Authors": "By Maggio, Rosalie",
        "Description": "Why devote valuable time and effort to writing correspondence from scratch when you can have all your letters and memos written for you?   Compiled by Rosalie Maggio, a best-selling author and lifelong collector of finely worded communications, Great Letters for Every Occasion gives you hundreds of model letters that you can use “as is” or easily adapt to your needs. The letters in this book cover every conceivable situation—from sensitive issues to business correspondence to holiday and special events. You’ll even find love letters and pen-pal letters. Each is clearly and concisely written, and guaranteed to convey your thoughts in a direct and engaging manner. And each and every one of them is a letter you’ll be proud to sign your name to.   Want to write your own letter . . . but need help getting started? Great Letters for Every Occasion provides easy-to-follow writing formulas for 50 different kinds of messages. In addition, the “Getting Started” sections give you a wide variety of opening sentences perfect for getting your thoughts flowing. Scores of inspiring quotations, drawn from great thinkers and writers, are perfect for adding a touch of wisdom or fun to your letters.   Keep this guide handy, and you’ll never struggle to put your thoughts into writing again!",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Prentice Hall Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "American Building: Materials and Techniques from the Beginning of the Colonial Settlement to the Present (History of American Civilization)",
        "Authors": "By Condit, Carl W.",
        "Description": "",
        "Category": "",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "November",
            "Year": "1969"
        }
    },
    {
        "Title": "Ageless: Take Control of Your Age and Stay Youthful for Life",
        "Authors": "By Miles, Elizabeth and Schneider, Edward L.",
        "Description": "Are you aging too fast? Edward Schneider, M.D., Dean of the Leonard Davis School of Gerontology and one of the field's leading gerontologists, refutes the myth that age equals loss-- of our health and our physical and mental vigor. You can't live forever. (If people tell you otherwise, says Dr. Schneider, don't believe them!) But you can control your aging to significantly reduce your risk of disability and illness and to feel vital and productive throughout your lifespan. By adopting the simple lifestyle measures outlined here, every one of us can live longer by living well.In AgeLess, Dr. Schneider has taken the latest and best research findings in each of the key areas known to affect your healthspan-- nutrition, exercise, weight, sleep, social engagement, and hormones-- and developed his easy-to-follow, science-based New Rules of Aging Less. Some of these New Rules may surprise you.Worried about your weight? Read the science behind New Weight Rule #1-- those few extra pounds may save your life. Or save money with this New Nutrition Rule: Toss out your multivitamins and most of your other supplements-- they may be doing you more harm than good. Do you think a good night's sleep is a relic of lost youth? Read the Dean's AgeLess tips for getting your nightly seven to nine hours-- it's essential to your healthspan.And if you're determined to look as young as you feel, Dr. Schneider also rates cosmetic interventions-- alpha hydroxy acid skin creams, laser peels, Botox injections, and more-- to reveal which ones really work and those that don't.To get started, take Dr. Schneider's Longevity Quotient Quizzes. These comprehensive questionnaires will help you rate your current lifestyle habits-- you'll learn the areas in which you're doing okay and where you need to improve. An AgeLess future is within reach-- start living yours today!",
        "Category": " Self-help , Aging",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "How to Make the World a Better Place: 116 Ways You Can Make a Difference",
        "Authors": "By Hollender, Jeffrey and Catling, Linda",
        "Description": "You don't need to be a high-profile social activist to effect positive social change. How to Make the World a Better Place, in this updated and expanded edition, shows how just one person can make a difference in solving global, national, and local problems. Whether you're interested in feeding the hungry, protecting the environment, helping the homeless, or making your community a safer place to live, you'll find the means to get started in this book. Each chapter alerts you to problems that require attention, explains the issues and what has to be done about them, tells you specifically what you can do to help, and lists the addresses and phone numbers of organizations that you can contact.The twenty-fifth anniversary of Earth Day finds us all more socially and environmentally conscious than ever before. All it takes for you to make a difference is one first step—this book gives you the advice, the encouragement, the information, and the resources you need to take it. Then, instead of simply thinking about the world's problems, you'll be solving them.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The Haj",
        "Authors": "By Uris, Leon",
        "Description": "Narrates the tragic history of the Middle East in an epic tale which recreates the turbulent era from World War I to the early decades of the existence of Israel",
        "Category": " Fiction , Sagas",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "20.85",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "Triathloning for Ordinary Mortals",
        "Authors": "By Jonas, Steven",
        "Description": "",
        "Category": " Sports & Recreation , Triathlon",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Raise the Roof: The Inspiring Inside Story of the Tennessee Lady Vols' Historic 1997-1998 Threepeat Season",
        "Authors": "By Jenkins, Sally and Summitt, Pat Head",
        "Description": "\"It wasn't a team.  It was a tent revival.\"So says Pat Summitt, the legendary coach whose Tennessee Lady Vols entered the 1997-98 season aiming for an almost unprecedented \"three-peat\" of NCAA championships.  Raise the Roof takes you right inside the locker room of her amazing team, whose inspired mixture of gifted freshmen and seasoned stars produced a standard of play that would change the game of women's basketball forever.The 1997-98 season started innocently enough.  One Saturday in August, four young freshmen--Semeka Randall, Tamika Catchings, Ace Clement and Teresa Geter--arrived on the Tennessee campus to begin their college careers.  Welcoming them were a number of players from the previous year, including Chamique Holdsclaw and Kellie Jolly.  But that night, in a sign of things to come, a simple pickup game turned into an amazing display of basketball brilliance--freshmen against established players, and with barely a shot missed by either side.  Suddenly Pat Summitt glimpsed the future: fast, aggressive and hugely talented.  This might be the team she'd worked her whole career to coach.As the season got under way, other dramas unfolded.  After one emotional team meeting, Summitt realized that many on the team were playing for something more than just the glory of the game: all four freshmen, for example, came from single-parent homes, and the tough circumstances of the majority of the other players seemed to add an extra edge to their desire to win it all.  Further, Chamique Holdsclaw, widely regarded as the greatest female player ever, was being dogged by questions about turning pro--and she seemed reluctant to rule it out.  Meanwhile, another member of the team began to notice the unwelcome attentions of a fan, who soon turned out to be a full-fledged stalker.All this was behind the scenes; out on the court, the win column was swelling with every game: 8-0, 15-0, 21-0.  As 1997 turned into 1998, Pat Summitt began privately to admit that this team had changed her: these kids were so lovable, funny and eager to please that she simply had to let them into her heart.  Along the way, the Lady Vols were redefining what women were capable of, trading in old definitions of femininity for new ones--in short, they were keeping score.  And by the time they entered the NCAA Final Four tournament in Kansas City, Summitt found herself believing the impossible: despite all the distractions, the 1997-98 Lady Vols could go undefeated, and, in doing so, raise the roof off the sport of women's basketball.Packed with the excitement of a season on the brink of perfection and filled with the comedy and tragedy of one year in the life of a basketball team, Raise the Roof will have readers cheering from the bench for a team of all-conquering players and their astonishing coach.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Redemption (Redemption Series-Baxter 1, Book 1)",
        "Authors": "By Kingsbury, Karen and Smalley, Gary",
        "Description": "The Redemption series won Christian Retailing’s 2005 Retailer’s Choice Award for Best Series!When Kari Baxter Jacobs finds out that her husband is involved in an adulterous relationship and wants a divorce, she decides she will love him and remain faithful to her marriage at all costs. This book shows how God can redeem seemingly hopeless relationships, and it illustrates one of Gary Smalley’s key messages: Love is a decision. Redemption is the first book in the five-book Redemption series that Gary and Karen will write about the Baxter family—their fears and desires, their strengths and weaknesses, their losses and victories. Each book will explore key relationship themes as well as the larger theme of redemption, both in characters’ spiritual lives and in their relationships. Each book includes study questions for individual and small-group use as well as a “teaser” chapter of the next book in the series.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Poems of Friendship: New Poetry",
        "Authors": "By Harvey, Gail",
        "Description": "A collection of poems about friendship features works by Emerson, Longfellow, Christina Rossetti, and others",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Silver's Edge (Through the Shadowlands)",
        "Authors": "By Kelleher, Anne",
        "Description": "When the silver that protects the borders between the Otherworld, a Sidhe realm, and the Shadowlands, a mortal realm, is stolen, three powerful women--Nessa, Delphinea, and Cecily--battle the forces of evil determined to destroy their kingdoms. Original.",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Luna",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Where Two Seas Met:           ",
        "Authors": "By Morris, Gilbert and Morris, Lynn",
        "Description": "",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "The Ultimate Insider's Guide to Adoption: Everything You Need to Know About Domestic and International Adoption",
        "Authors": "By Falker, Elizabeth Swire",
        "Description": "So you've made the decision to adopt. What's next? For starters, how do you know whether domestic or international adoption is right for you? (And what are the real differences between the two?) Adoption insider Elizabeth Swire Falker answers these questions and many more. As an attorney who practices in the area of adoption and has worked with hundreds of families, and as an adoptive parent herself, she offers expert advice on each stage of the process. This comprehensive, accessible guide leads you with confidence through every decision you'll have to make-including the ones that you'd never know to expect. Complete with checklists, tips, sidebars, and plenty of counterintuitive advice, it shows you how to: Identify which adoption experts you do and don't need  Find the right birth mother or choose the right country for your family-and how to spot red flags in potential situations Select an attorney or agency and prepare for your home visit Finance an adoption on a budget, manage the red tape, and get around the roadblocks Navigate all of the complex emotions that surface along the way. .. With Elizabeth Swire Falker's warm yet been-there-done-that voice, THE ULTIMATE INSIDER'S GUIDE TO ADOPTION is sure to become a tried-and-true resource for adoptive parents everywhere.",
        "Category": " Family & Relationships , Adoption & Fostering",
        "Publisher": "Grand Central Life & Style",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Ordinary Resurrections: Children in the Years of Hope",
        "Authors": "By Kozol, Jonathan",
        "Description": "Jonathan Kozol's books have become touchstones of the American conscience.  In his most personal and optimistic book to date, Jonathan returns to the South Bronx to spend another four years with the children who have come to be his friends at P.S. 30 and St. Ann's.  A fascinating narrative of daily urban life seem through the eyes of children, Ordinary Resurrections gives the human face to Northern segregation and provides a stirring testimony to the courage and resilience of the young.Yet another classic of unblinking social observation from one of the finest writers ever to work in the genre, Ordinary Resurrections is a piercing discernment of right and wrong, of hope and despair -- from our nations's corridors of power to its poorest city streets.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Walking Off Weight:  The Workbook:  The 14-Day, 14-Step Program for Lasting Weight Loss",
        "Authors": "By Sweetgall, Robert, Roba Whiteley, Robert Neeves",
        "Description": "",
        "Category": "",
        "Publisher": "Creative Walking Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Things I've Learned from Women Who've Dumped Me",
        "Authors": "By Karlin, Ben",
        "Description": "The Emmy award-winning former executive producer of The Daily Show and The Colbert Report has assembled a stellar lineup of men who have one thing in common:  all have been dumped...and are willing to share their pain and the lessons learned.  Relationships end.  And in almost all of them, even the most callow among us take something away.   This is a book about that something, whether it be major life lessons, like \"If you lie, you will get caught,\" simple truths like, \"Flowers work,\" or something wholly unique like, \"Watch out for the high strung brother in the military.\"This anthology will be comprised of longer and shorter pieces, drawn from an array of impressive celebrities, writers and public figures.  Some pieces may be a paragraph in length while others will be full-blown essays.  All of them will be about that salient something men take away from a failed relationship. Yes, men learn.This is not a touchy-feely book.  This is not a self-help book.   This is a book packed with smart, funny and insightful stories from men you probably thought never got dumped, or if they did, would never admit it.",
        "Category": " Humor , Form , Essays",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Doing work you love: Discovering your purpose and realizing your dreams",
        "Authors": "By Gilman, Cheryl",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Jefferson and Religion (Monticello Monograph Series)",
        "Authors": "By Sheridan, Eugene R.",
        "Description": "Thomas Jefferson's faith was of an eclectic sort; as he said, \"I am of a sect by myself, as far as I know.\" He had a general interest in Christianity, seen through the lens of his Enlightenment philosophical views. He greatly admired the gospels and their central figure Jesus, but gave them a particularly Jeffersonian treatment in his own editing and reordering of them. This essay by Eugene R. Sheridan, is regarded by scholars as an authoritative treatment of a complex topic. The essay in this book originally appeared as the introduction to Jefferson's Extracts from the Gospels, a volume in the second series of The Papers of Thomas Jefferson, published by Princeton University Press in 1983.",
        "Category": " Philosophy , Religious",
        "Publisher": "The University of North Carolina Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Thomas Jefferson: A Brief Biography",
        "Authors": "By MALONE, DUMAS",
        "Description": "Dumas Malone wrote his first 15,000 word essay about Jefferson for the scholarly Dictionary of American Biography. This reprint is Malone's own revision of that essay, made after his decades of study of a remarkable American.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "University of Virginia Press",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "December",
            "Year": "2011"
        }
    },
    {
        "Title": "The Girl in the Glass: A Novel",
        "Authors": "By Ford, Jeffrey",
        "Description": "The Great Depression has bound a nation in despair -- and only a privileged few have risen above it: the exorbitantly wealthy ... and the hucksters who feed upon them. Diego, a seventeen-year-old illegal Mexican immigrant, owes his salvation to master grifter Thomas Schell. Together with Schell's gruff and powerful partner, they sail comfortably through hard times, scamming New York's grieving rich with elaborate, ingeniously staged séances -- until an impossible occurrence changes everything.While \"communing with spirits,\" Schell sees an image of a young girl in a pane of glass, silently entreating the con man for help. Though well aware that his otherworldly \"powers\" are a sham, Schell inexplicably offers his services to help find the lost child -- drawing Diego along with him into a tangled maze of deadly secrets and terrible experimentation.At once a hypnotically compelling mystery and a stunningly evocative portrait of Depression-era New York, The Girl in the Glass is a masterly literary adventure from a writer of exemplary vision and skill.",
        "Category": " Fiction , Historical , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Under Cover",
        "Authors": "By Davidson, MaryJanice",
        "Description": "A new voice in erotic romance presents a trio of deliciously sensual stories that includes Sweet Strangers, in which Renee Jardin, accused of a crime she didn't commit, finds herself on the run from the law and in the bedroom of sexy N.S.A. agent James Axelrod. Original. 45,000 first printing.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Egyptologist: A Novel",
        "Authors": "By Phillips, Arthur",
        "Description": "From the bestselling author of Prague comes a witty, inventive, brilliantly constructed  novel about an Egyptologist obsessed with finding the tomb of an apocryphal king.  This darkly comic labyrinth of a story opens on the desert plains of Egypt in 1922,  then winds its way from the slums of Australia to the ballrooms of Boston by way  of Oxford, the battlefields of the First World War, and a royal court in turmoil. Just as Howard Carter unveils the tomb of Tutankhamun, making the most dazzling find  in the history of archaeology, Oxford-educated Egyptologist Ralph Trilipush is digging  himself into trouble, having staked his professional reputation and his fiancée’s  fortune on a scrap of hieroglyphic pornography. Meanwhile, a relentless Australian  detective sets off on the case of his career, spanning the globe in search of a murderer.  And another murderer. And possibly another murderer. The confluence of these seemingly  separate stories results in an explosive ending, at once inevitable and utterly unpredictable. Arthur Phillips leads this expedition to its unforgettable climax with all the wit  and narrative bravado that made Prague one of the most critically acclaimed novels  of 2002. Exploring issues of class, greed, ambition, and the very human hunger for  eternal life, this staggering second novel gives us a glimpse of Phillips’s range  and maturity–and is sure to earn him further acclaim as one of the most exciting  authors of his generation.",
        "Category": " Fiction , Literary",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Lies of George W. Bush",
        "Authors": "By Corn, David",
        "Description": "“Get ready to get mad. Corn has cut through the spin and crafted an important and powerful challenge to Bush and his crew.” —Molly Ivins“David Corn’s The Lies of George W. Bush is as hard-hitting an attack as has been leveled against the current president.” —Los Angeles Times“George W. Bush is a liar. He has lied large and small, directly and by omission. He has mugged the truth–not merely in honest error, but deliberately, consistently, and repeatedly.”In this scathing indictment of the president and his inner circle, David Corn reveals the deceptions at the heart of the Bush presidency. With wit and style, Corn details how the Bush administration has consistently lied to the American public to advance its own interests, from mischaracterizing intelligence to whip up support for war with Iraq to misrepresenting the possible consequences of his supersized tax cut and offering false claims to push a radical agenda on crucial issues across the board. In this unflinching work of hard-hitting journalism, Corn explains how Bush has managed to get away with it and explores the danger of presidential deceit in a perilous age. This paperback edition also includes an up-to-date analysis of the aftermath of the war with Iraq.",
        "Category": " History , United States , General",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Take This Job and Ship It: How Corporate Greed and Brain-Dead Politics Are Selling Out America",
        "Authors": "By Dorgan, Byron L.",
        "Description": "Our trade deficit increases by $2 billion a day. Pharmaceutical companies and their lobbyists have such influence in Washington that Medicare, by current law, is not allowed to negotiate lower drug prices. We import oil on an ever-increasing scale, putting ourselves into dept with the Saudis, the Kuwaitis, and other Middle Eastern nations. With their windfall profits, they continue to buy American assets. China’s booming economy and abundance of cheap labor are threatening our economic survival. We have mortgaged our fortunes, our principles, and our way of life.             In this comprehensive look at the real, human toll of America’s unsound trade policy, Senator Byron Dorgan exposes the myth of “free trade.” Indeed, free trade is not free; it is something that is slowly but surely draining away American prosperity. Sure, Chinese labor can drive down prices at Wal-Mart; at the same time, however, those saved wages—dollars that would have gone to buy these cheaper goods—are gone. Too soon, it will all come crashing down.            Major U.S. corporations continue to ship jobs overseas by the millions and, because of their influence in Washington, avoid paying a king’s ransom in taxes. Many billions of dollars that these companies fleece from the government and the American people go overwhelmingly to investments in expanding production capabilities overseas. In short, our government is in the grip of corporate and foreign interests, and the American worker has born the brunt of this culture of corruption. How can we stem the tide of outsourcing? Why has the White House done nothing? Will the middle class survive?            From describing corporate profiteering to calling to action a lethargic, inactive government, Byron Dorgan exposes the truth about the destructive relationship between corporations and Congress and proposes strategies for what can really be done to preserve America’s preeminence in the world. “Written with poignant stories, persuasive logic and superb factual support, this book is a wake up call for every American who cares about U.S. policy on trade and jobs.  One doesn’t have to agree with all that Senator Dorgan writes in this book to find it remarkably compelling.”  --Senator Tom Daschle “If you’re tired of seeing good American jobs shipped overseas in search of cheap labor, you’re going to appreciate this book.  Senator Dorgan and I have joined forces in the Senate to fight the trade policies of a weakening America.  His book offers real solutions that can strengthen our country.”  --Senator Lindsay Graham :If you think that no one in Washington gives a damn about about corporate greed and the decimation of America’s middle class, you haven’t met Senator Byron Dorgan.  In TAKE THIS JOB AND SHIP IT,” this modern day Prairie Populist pops the greedhead right in their snouts, using both facts and a stinging sense of humor.  Byron’s book is both a rallying cry and a blueprint for action.  If you believe America is headed in the wrong direction and you want to do something about it read this book, then help us elect more Byron Dorgans.”  --Jim Hightower “Senator Byron Dorgan is one of the few elected official of either party who ahs consistently and unwaveringly defended the interests of American working men and women and their families.  His commitment to our country and the truth is inspiring.  His book is a trenchant and timely examination of America’s so-called free trade policies and the exorbitant cost to our middle class and our nation.”  --Lou Dobbs “I watched Senator Dorgan take on the powerful interests in the U.S. Senate, and this book shows that he is still at it.  Our country’s trade policies are a scandal, and Dorgan has the guts to expose it and name names.  He also tells us how to put our country back on track.  This is an important book that might finally call our country to action to protect good jobs and our way of life.” –Senator Fritz Hollings",
        "Category": " Business & Economics , Commercial Policy",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "The Warlock Insane",
        "Authors": "By Stasheff, Christopher",
        "Description": "Armed with his superior technological knowledge, Rod Gallowglass has proved to be equal to the challenges of the planet Gramarye, until an evil sorcerer sets out to destroy him on the battlefield of the mind. Reissue.",
        "Category": "",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Chase the Dawn",
        "Authors": "By Feather, Jane",
        "Description": "Fleeing a fiery inferno, beautiful, artisocratic Bryony Paget falls unconscious into the arms of a handsome stranger. She awakens with no memory of her proud aristocratic past--only the stirrings of desire kindled by her mysterious rescuer.  American patriot Ben Clare has no time for romance--or for the dark-haired beauty who interfered with his midnight raids for liberty. But he cannot resist Bryony's innocent passion -- and together they steal joy amid the strife of bitter war. Too soon the cruel discovery of Bryony's true identity forces her to choose between the Loyalist father she adores and the rebellious man she could never live without.  Publication of Chase The Dawn debuts our program to reissue select backlist favorites of Jane Feather's classic historical romances as we continue to publish her new novels.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Eden Burning",
        "Authors": "By Lowell, Elizabeth",
        "Description": "Paradise calls to Chase Wilcox. A man of science, escaping the destruction of his own personal world, he is drawn to the lush beauty of the island of Hawaii and the secrets it holds. Here he intends to immerse himself in his work . . . and somehow heal and forget.A research assistant, an artist, and a dancer, Nicole Ballard also hides a secret pain. Together on an important scientific project in the moist, verdant heart of a tropical wonderland, both she and Chase will be forced to confront their own lingering inner darkness. But in the shadows of Mount Kilauea, a passion that burns like fire will erupt, as unpredictable and dangerous as the living volcano, transforming the very landscape of their lives.A classic story of desire, hope, and dangerous destiny from the incomparable New York Times and USA Today bestselling author Elizabeth Lowell",
        "Category": " Fiction , Romance , Erotica",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2011"
        }
    },
    {
        "Title": "The Secret Language of Men",
        "Authors": "By Weaver, Sherrie",
        "Description": "",
        "Category": "",
        "Publisher": "Great Quotations",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Skintight",
        "Authors": "By Andersen, Susan",
        "Description": "Professional poker player Jax Gallagher must retrieve a rare baseball collectible from the possession of his late father's wife, a captivating Las Vegas showgirl named Treena, but all bets are off when he takes a gamble on love. Original.",
        "Category": " Fiction , Romance , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Red Diamond",
        "Authors": "By Dimick, Linda R.",
        "Description": "",
        "Category": "",
        "Publisher": "Dimick Publishing",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Chicken Soup for the Teenage Soul IV",
        "Authors": "By Hansen, Mark Victor, and Kirberger, Ki Jack",
        "Description": "",
        "Category": "",
        "Publisher": "SCOLASTIC INC.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Fix-It and Forget-It Diabetic Cookbook: Slow-Cooker Favorites to Include Everyone!",
        "Authors": "By Good, Phyllis Pellman and American Diabetes Association",
        "Description": "Provides recipes for diabetic-friendly meals to be prepared in the slow cooker, and includes such dishes as green chili stew, beef dumpling soup, and apple cobbler.",
        "Category": " Cooking , Health & Healing , Diabetic & Sugar-Free",
        "Publisher": "Good Books",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Lee Bailey's Country Desserts",
        "Authors": "By Bailey, Lee, Regan, Mardee Haidin, and Greene, Joshua",
        "Description": "Provides traditional recipes for cakes, cheesecakes, icings, muffins, breads, puddings, sauces, custards, mousse, cobblers, tarts, brownies, and fudge",
        "Category": " Cooking , Courses & Dishes , Cakes",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "The Quick and Easy Fat Gram & Calorie Counter",
        "Authors": "By Sonberg, Lynn",
        "Description": "Fats: The \"Bad Guys\" in Your DietFats pack more than twice the calories into every gram than either protein or carbohydrates. Recent studies show that it's the amount of fat you eat that will determine your weight. In addition, a high fat diet increases your risk of heart disease and cancer. The American Heart Association and the National Cancer Institute recommend you get no more than 30 percent of your daily calories from fat. The Quick and Easy Fat Gram & Calorie Counter will show you how. Count Fat Grams for Healthy Weight LossIt's easy! Tired of balancing calories, cholesterol, fat, and fiber intake? Just count fat grams and everything else will fall into place.  The Quick and Easy Fat Gram & Calorie Counter does all the work for you. It provides fat gram counts for 2,500 basic, brand-name, and fast foods and gives you the calorie count and percentage of calories that come from fat.Try The New, Easier, More Effective Way to Stay Slim and Healthy",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "News of the Spirit (Ballantine Reader's Circle)",
        "Authors": "By Smith, Lee",
        "Description": "1. What themes do you think tie these stories together? 2. Which story or stories were the most powerful and had the greatest impact on you? Why? 3. One reviewer has written, 'What Smith doesn't write, what she leaves in the tiny spaces between sentences, between narrative moments, is as important as what she insists our attention be turned to.' What do you think the reviewer is trying to say? Do you agree with this statement? Are there instances in any of these stories that illustrate this point? 4. In each of these stories, you are offered glimpses of an array of remarkable, secondary characters. What minor characters intrigued you and made you want to hear more from them? For instance, what do you think happened to Carroll Byrd, the scandalous other woman in 'Live Bottomless'? 5. Just as Charlene made up Bubba, have you ever made up a story to create the self you thought you wanted to be? Did you find Charlene's dishonesty to be troubling? How do people separate fact from fiction in the telling of their own stories? 6. Why do you think Charlene was initially so resistant to telling stories based on her own experiences? Why did she think her own life was not worth talking about and what changed her mind? How do you deal with these issues in your own life? Are there stories you would not tell? Why is this so? 7. How did Sarah in 'Blue Wedding' become so isolated? How would the story change if Gladiola were telling it? Discuss how any of the stories might change if told by a different character; for example, if Jenny's father told the story of his affair and the subsequent trip to Key West with his family or if Alice's nurse was the narrator in 'The Happy Memories Club.' 8. A reoccurring theme here is the complicated nature of familial relationships. Discuss the nature of these relationships and how they do or do not change in these stories. Even as adults, we still often view our families through the eyes of a child as does Jenny in 'Live Bottomless.' How does this blind us? How do we heal the old wounds? Can we? 9. All of these stories explore the brother-sister relationship in some manner. Why do the siblings in many of these stories become estranged? Does that make the bond less important? 10. Why do you think Jenny's father had the affair? Do you think he made the right decision to stay with his wife and daughter? How do you think the adult Jenny who narrates the story really feels about her father's decision? 11. What sets Carroll Byrd apart from the other women in town? Why does Jenny find her so fascinating? 12. Do you think Jenny ended up with the life she envisioned as a precocious thirteen-year-old? Do any of these characters end up with the lives they planned on? Do any of us? 13. What price has Chanel paid for her upward mobility? What do you think she will do with her newfound perspective on her life? 14. Where do you think Chanel will end up? Or Sarah? How do you feel about the form of the short story that often leaves the reader guessing about the remainder of a life? 15. Why were Alice's stories about her life met with such hostility in 'The Happy Memories Club'? What does this story tell you about life in a retirement community? Do you think Alice feels trapped by the role she is supposed to play as a senior citizen? 16. The members of the Happy Memories Club are appalled that Alice does not talk about her long-time marriage in her stories. Why do you think she does not write about this part of her life at any length? Does it mean she didn't love her husband? 17. In 'News of the Spirit,' were you surprised that Drew stayed at the party? Do you think Paula underestimated her fiancé? Do you think Paula has learned to value her eccentric family? 18. Paula and Johnny lived in their own private world as children. Paula is still trying to figure out what changed and why. How would you answer her questions? 19. Did these fictional worlds resonate with your own experiences and your own stories? Or prompt you to think about the stories of your own life? What news of your own spirit would you most want to tell others? If you had to tell just one story about your own life, what story would it be and why? 20. Why did your group choose to read this particular book? Do you think you will go on to read other works by Lee Smith if you have not done so already? 21. How does this collection compare with other works that your group has read?",
        "Category": " Fiction , Literary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "500 Low-carb Recipes - 500 Recipes, From Snacks To Dessert, That The Whole Family Will Love (500 Recipes, from Snacks to Dessert)",
        "Authors": "By Carpender, Dana",
        "Description": "",
        "Category": "",
        "Publisher": "Fair Winds Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Heartland: The Best of the Old and the New from Midwest Kitchens",
        "Authors": "By Adams, Marcia",
        "Description": "Celebrates the food and folks of the American Midwest, featuring recipes that reflect the many ethnic groups that have settled there",
        "Category": " Cooking , Reference",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "13.98",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "New York Cookbook: From Pelham Bay to Park Avenue, Firehouses to Four-Star Restaurants",
        "Authors": "By O'Neill, Molly",
        "Description": "Nibbles and noshes from New York City, America&#39;s kitchen.  New York is pierogi, pasta fagiole, and chicken soup: Avgolemono, Brazilian Canja, Kreplach, Soo Chow, and Ajiaco. New York is Sylvia&#39;s Ribs, plus Edna Lewis&#39;s Greens and Mrs. Kornick&#39;s Polish Corn Bread. And the New York Cookbook is all of this, and much, much more. Collected from all five boroughs by New York Times food writer Molly O&#39;Neill, here are over 500 recipes--and over 700 photographs--that celebrate one thing: a passion for food and eating. Deborah Markow&#39;s Braised Lamb Shanks and Mrs. Urscilla O&#39;Connor&#39;s Codfish Puffs. Four-star chef Andre Soltner&#39;s Roast Chicken and Vernon Jordan&#39;s Jerk Style Jamaican Chicken. Robert Motherwell&#39;s Brandade de Morue and the Abyssinian Baptist Church&#39;s Long-Cooked Green Beans. Plus Katharine Hepburn&#39;s Brownies, Lisa&#39;s Mexican Flan, and Sally Darr&#39;s Golden Delicious Tart. Includes shopping guides, cooking tips, and walking tours.Winner of a 1992 IACP/Julia Child Cookbook Award. Winner of the 1992 James Beard Food and Beverage Book Award.  A percentage of the royalties goes to Citymeals-on-Wheels.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Firestorm (Anna Pigeon)",
        "Authors": "By Barr, Nevada",
        "Description": "An insatiable, unstoppable beast, the wildfire called Jackknife has already devoured 17,000 acres of California's Lassen Volcanic National Park. A devastating force of nature, it has brought out the very best -- and worst -- in those sworn to defeat it. Ranger Anna Pigeon is among the exhausted firefighters, serving as medic and spike camp security, when an abrupt weather shift sends Jackknife racing relentlessly in their direction. And when the monstrous blaze has passed, Anna emerges from her protective shelter to discover two men are dead: one a victim of the hungry flames, the other stabbed through the heart. Now, trapped in a nightmarish landscape of snow and ash, cut off from rescue by a rampaging winter storm, Anna must investigate an inexplicable homicide -- as she and nine others struggle to survive the terrible rage if nature. . . and the murderer in their midst.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "The Tudors (A Royal History of England)",
        "Authors": "By Fraser, Antonia (EDT) and Williams, Neville",
        "Description": "This volume provides the essential history of the Tudors up to the death of Elizabeth I, who kept power with a rare skill and subtlety, and whose death led to the union of the crowns of England and Scotland and the end of the Tudor line.About the series A Royal History of England:From the beginning of monarchical power in Norman times to the present queen, the British royal family has experienced many scandals, triumphs, and changes in public image, but few of their reigns can be described as uneventful. With contributions by specialist authors and contemporary illustrations of royal heraldry and coats of arms, Antonia Fraser has edited a definitive and entertaining history of one of the most powerful monarchies in the world.",
        "Category": " History , Europe , General",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "The Diversity Toolkit : How You Can Build and Benefit from a Diverse Workforce",
        "Authors": "By Sonnenschein, William",
        "Description": "The diverse workforce is not only the future; it is here and now.  And, with the help of The Diversity Toolkit, managers of all levels can learn easily to adapt and be sensitive to the new workforce realities.  The \"diversity toolkit\" features easy-to-use tips for improving communications skills, practical guidance for perfecting team relationships, and helpful suggestions for attaining leadership skills.  This practical guide will ensure that readers will achieve tangible results effectively and efficiently.",
        "Category": " Business & Economics , Management",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Lonely Planet Mexico, 9th Edition",
        "Authors": "By Grosberg, Michael, Noble, John, Bao, Sandra, Yanagihara, Wendy, Forsyth, Susan, Greenfield, Beth, Konn, Morgan, Nystrom, Andrew Dean, Plank, Suzanne, Read, Michael, Schechter, Daniel C., and Stewart, Iain",
        "Description": "",
        "Category": " Travel , Mexico",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.85",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "96 Great Interview Questions to Ask Before You Hire",
        "Authors": "By Falcone, Paul",
        "Description": "Every harried interviewer knows the result of throwing out vague questions to potential employees: vague answers and potentially disastrous hiring decisions. Presented in a handy question-and-answer format, 96 Great Interview Questions to Ask Before You Hire provides readers with the tools they need to elicit honest and complete information from job candidates, plus helpful hints on interpreting the responses. The book gives interviewers everything they need to: identify high-performance job candidates • probe beyond superficial answers • spot “red flags” indicating evasions or untruths • get references to provide real information • negotiate job offers to attract winners Included in this revised and updated edition are new material on background checks, specific challenges posed by the up-and-coming millennial generation, and ideas for reinventing the employment application to gather more in-depth information than ever before. Packed with insightful questions, this book serves as a ready reference for both managers and human resources professionals alike.",
        "Category": " Business & Economics , Human Resources & Personnel Management",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Jack London Reader (Courage Classics)",
        "Authors": "By London, Jack",
        "Description": "A collection of short fiction by the author of Call of the Wild features that classic tale as well as Son of Wolf and \"To Build a Fire.\"",
        "Category": " Fiction , General",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "The Wall Street MBA: Your Personal Crash Course in Corporate Finance (CLS.EDUCATION)",
        "Authors": "By Advani, Reuben",
        "Description": "A streetwise MBA that offers you a degree in successWhether you're a novice or an experienced professional, The Wall Street MBA explains the underpinnings of financial valuation, financial analysis, and corporate accounting and describes how each drives corporate America and Wall Street.Peppered with true stories and amusing anecdotes, this concise, easy-to-read, interactive resource teaches MBA concepts by applying theory to real-life examples. You'll learn how to review financial statements, analyze earnings, detect fraud, assess stock prices, value companies, and structure mergers and acquisitions, among other exercises.",
        "Category": " Business & Economics , Corporate Finance",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "See the Sea!: See the Sea! (Googly Eyes)",
        "Authors": "By Zobel-Nolan, Allia and Terry, Michael (ILT)",
        "Description": "Kids can learn about colors and various underwater sea creatures as they make friends with such whimsical characters at Clark T. Shark, Winona Whale, Wally Fuss and others, in this entertaining board book. What&#39;s more, they&#39;ll laugh out loud at the faces staring back at them when they shake these characters&#39; rolling \"googly eyes.\"",
        "Category": " Juvenile Fiction , Concepts , Colors",
        "Publisher": "Studio Fun International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    }
]