[
    {
        "Title": "AMERICAN PROFILE COOKBOOK",
        "Authors": "By Floyd, Candace (EDT), Carter, Mary (EDT), and Fisher, Susan (EDT)",
        "Description": "Over 400 of the best hometown recipes from America's Hometown Magazine.American Profile magazine celebrates hometown life in America. Over the years, American Profile has invited readers to send in their favorite recipes for publication, including the stories behind them?tales of recipes passed from generation to generation, traded among dear friends, or created to meet the needs of a family on a budget.In this extraordinary cookbook, you'll find traditional American favorites with a unique twist alongside ethnic creations from around the world, such as:Apple-Sausage PancakesPrairie-Fire Chicken StripsHoliday Spiced TeaAunt Lillian's Pumpkin BreadTamale SoupPistachio and Pasta SaladGrandma's Swiss SteakChicken DumplingsSnapper TropicalLazy PierogiApple CakeTiramisu TorteAlso included are helpful tips from American Profile's test kitchen as well as 30 articles on hometown festivals and fairs across the nation that give you a sneak peek into the lives of the ordinary citizens that make up hometown America.Whether it's a simple soup for the family or a full meal for visitors, the American Profile Hometown Cookbook has just the right recipe to make any gathering a special occasion.",
        "Category": " Cooking , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "The Same Sea",
        "Authors": "By Oz, Amos and De Lange, Nicholas (TRN)",
        "Description": "From the internationally acclaimed Israeli author, a unique novel in verse that will take its place among the great books of our time. The Same Sea is Amos Oz's most adventurous and inventive novel, the book by which he would like to be remembered. This is Oz free of convention--literary and otherwise. Prose leads to poetry, poetry to prose. The cast of characters ranges from a prodigal son to a widowed father who has taken in his son's enticing young girlfriend, who in turn sleeps with her boyfriend's close friend. The author himself receives phone calls from his characters, criticizing the way he portrays them in his novel. In this human profusion there is chaos and order, love and eroticism, loyalty and betrayal, and ultimately an extraordinary energy.Reminiscent of Under Milk Wood for the range of its voices, its earthy humor, and its poignancy, The Same Sea is heartbreaking and sensuous, filled with classical echoes and Biblical allusions. Oz at his very best.\"I wrote this book with everything I have. Language music, structure everything that I have. . . . This is the closest book I've written. Close to me, close to what I always wanted. . . . I went as far as I could. --Amos Oz",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Twelve Ways to Build a Vocabulary (Everyday Handbooks)",
        "Authors": "By Archibald Hart",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & N",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Simon and Schuster Quick Access Reference for Writers",
        "Authors": "By Troyka, Lynn Quitman",
        "Description": "This brief spiral-bound reference handbook takes a user-friendly, reader-oriented approach?with additional features that give readersaccess to information quickly. The author covers grammar, punctuation, thinking and reading critically, writing argument essays, writing research papers and documenting them, writing for the Web, designing documents, writing about literature, writing for business, and creating oral presentations.  Offers a Premium Companion Website at www.prenhall.com/troyka that facilitates the research process and offers three exclusive databases full of relevant and reliable source material. Expands discussion of the research process from five to seven chapters. Offers a new chapter on writing arguments. Features a new chapter on Oral Presentation that explains how to plan, create, and present. Features a striking new four color design that highlights each key concept. Provides URL addresses throughout that helps readers access useful websites.  The ideal reference for professionals of all kinds who want to improve their writing in both business and personal contexts.",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Prentice Hall Ptr",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Enough room for joy : Jean Vanier's L'Arche: A message for our time",
        "Authors": "By Clarke, Bill",
        "Description": "",
        "Category": "",
        "Publisher": "Paulist Press",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "The Roots of the Self: Unraveling the Mystery of Who We Are",
        "Authors": "By Ornstein, Robert E.",
        "Description": "An exploration of why individuals are the way they are illuminates the complex forces that shape humans from womb to grave, arming readers with facts about genetics, environment, psychology, creativity, and higher consciousness. $25,000 ad/promo.",
        "Category": " Psychology , General",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "The Complete Text of American History & Science ASAP",
        "Authors": "By Alan Axelrod PhD",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Prentice Hall Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "So Far from God",
        "Authors": "By Castillo, Ana",
        "Description": "",
        "Category": " Fiction , Historical",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Gammage Cup (Odyssey Classic)",
        "Authors": "By Kendall, Carol and Blegvad, Erik (ILT)",
        "Description": "A handful of Minnipins, a sober and sedate people, rise up against the Periods, the leading family of an isolated mountain valley, and are exiled to a mountain where they discover that the ancient enemies of their people are preparing to attack",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Harcourt Childrens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Righteous Men",
        "Authors": "By Bourne, Sam",
        "Description": "The righteous shall never be removed: but the wicked shall not inhabit the earth. . . .   A teenage computer prodigy is mortally strangled in Mumbai. A far-right extremist is killed in a remote cabin in the Pacific Northwest. A wealthy businessman is murdered in Thailand. A pimp in Brooklyn is found stabbed to death and mysteriously covered by a brown shroud. What connects the victims is an ancient prophecy that leads to the end of the world, and it's up to Will Monroe, a fledgling reporter at the New York Times, to stop it.   But Monroe's investigation quickly makes him some shadowy enemies, who kidnap his wife and hold her hostage in Crown Heights. Desperate to find the link between the killings and to save his wife, he enlists his college sweetheart, TC, an eccentric artist and Kabbalah expert. As the death toll rises, they follow a trail of clues that seems to lead inexorably to a set of ancient texts containing a prophecy that promises to save the world—or to destroy it.   What will happen when the one secret that has kept the world safe for thousands of years is revealed to all? In The Righteous Men, a blistering thriller filled with mystery, romance, and suspense, Sam Bourne takes readers deep into the hidden worlds of fundamentalist religion, mysticism, and biblical prophecies. This is a visionary tale that is as frightening as it is entertaining. Readers won't stop turning the pages until the very end.",
        "Category": " Fiction , Religious",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.71",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The 37th Hour",
        "Authors": "By Compton, Jodi",
        "Description": "In a suspense novel of astounding power and depth, Jodi Compton unleashes a haunting tale of secrets and betrayal...and of one woman's search for her missing husband that spirals into a dark journey strewn with bitter truths and damged lives.  Here debut novelist Compton introduces an extraordinary character: Detective Sarah Pribek, a woman of strength, complexity, and instinct, a woman caught in an unimaginable nightmare...The 37th HourOn a chilly Minnesota morning, Sarah comes home to the house she shares with her husband and fellow cop, Michael Shiloh.  Shiloh was supposed to be in Virginia, starting his training with the FBI.  A seasoned missing-persons investigator, Sarah is used to anxious calls from wives and parents.  She's used to the innocent explanations that resolve so many of her cases.  But from the moment she learns that he never arrived at Quantico, she feels a terrible foreboding.  Now, beneath the bed in which they make love, Sarah finds Shiloh's neatly packed bag.  And in that instant the cop in her knows: Her husband has disappeared.Suddenly Sarah finds herself at the beginning of the kind of investigation she has made so often.  The kind that she and her ex-partner, Genevieve, solved routinely -- until a brutal crime stole Genevieve's daughter and ended her career.  The kind that pries open family secrets and hidden lives.  For Sarah this investigation will mean going back to the beginning, to Shiloh's religion-steeped childhood in Utah, the rift that separated him from his family -- and the one horrifying case that struck them both too close to home.  As Sarah turns over more and more unknown ground in her husband's past, she sees her lover and friend change into a stranger before her eyes.  And as she moves further down a trail of shocking surprises and bitter revelations, Sarah is about to discover that her worst fear -- that Shiloh is dead -- may be less painful than what she will learn next...In a novel of runaway tension, Jodi Compton masterfully weaves together the quiet details of everyday life with the moments that can shatter them forever.  At once a beguiling mystery and a powerful rumination on family, friendship, and loss, The 37th Hour is a thriller that will catch you off guard at every turn -- instantly compelling and utterly impossible to put down.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "The Silver Palate Cookbook: Delicious recipes, menus, tips, love Manhattan's celebrated gourmet food shop",
        "Authors": "By Rosso, Julee, Lukins, Sheila, and McLaughlin, Michael",
        "Description": "The tenth anniversary edition of this classic cookbook presents recipes, menus, and tips from Manhattan's celebrated gourmet food shop. 100,000 first printing. $100,000 ad/promo. Original.",
        "Category": " Cooking , Methods , Professional",
        "Publisher": "Workman Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "Anatomy of a Miracle: The End of Apartheid and the Birth of the New South Africa",
        "Authors": "By Waldmeir, Patti",
        "Description": "One of the most extraordinary political tales of the twentieth century, in which a nation stepped through the looking glass and emerged as the mirror image of its former self. The peaceful birth of black majority rule in South Africa was a transcendent moment. Many South Africans believe this negotiated revolution to be a miracle; at the very least it was a feat of political magic. One false step along the way could have ignited the race war that had been widely predicted as South Africa's destiny. Patti Waldmeir's colorful and incisive narrative begins in 1985, with Nelson Mandela in a prison hospital receiving clandestine visits from a white government minister. It ends nearly ten years later with the inauguration of the world's most famous prisoner as president of a new country. The author was present at nearly every critical event in this decade, and we see all the principal actorsMandela, F. W. de Klerk, Chief Buthelezi, and the militants of the extreme rightthrough the eyes of a journalist who knows them all personally. She captures the good sense and the violence of these times, and she illuminates the forces of history, economics, demographics, and morality that shaped the human drama. Few journalists have known South Africa so long or so well as Patti Waldmeir. This book draws on her eyewitness accounts of township violence, of conversations with presidents past and present, of guerrilla actions, and of brutal \"necklaces.\" She reports from inside a political process without precedent, in which blacks and whites achieved their mutual liberation.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "The Hands of Esau",
        "Authors": "By Haydn, Hiram",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Brothers",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "Russian, Polish & German Cooking",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "O'Brien's Collecting Toys: Identification and Value Guide (9th Ed)",
        "Authors": "By O'Brien, Richard, Stephan, Elizabeth (EDT), and O'Brien, Richard (EDT)",
        "Description": "Offers current prices for more than sixteen thousand toys in various grades of condition, ranging from tin cars and action figures to Fisher-Price toys and plastic doll house furniture. Original.",
        "Category": " Antiques & Collectibles , Toys",
        "Publisher": "Krause Publications",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Motley Fool Personal Finance Workbook: A Foolproof Guide to Organizing Your Cash and Building Wealth",
        "Authors": "By Gardner, David, Gardner, Tom, Motley Fool, Inc. (COR), Brokamp, Robert (CON), and Yochim, Dayana (CON)",
        "Description": "With easy-to-follow, quick-witted exercises, you'll discover all the ways that money touches your life -- from saving and spending to insurance to retirement.Pencil your way to financial security!  What would it be like to know that you were making the very best decision for every dollar you spent or saved? Can you imagine balancing your budget by the beginning of next month? Wouldn't it be great to know whether a pro's advice is right for your situation? How valuable would it be to have a customized financial plan that would serve you for life?  What you hold in your hands is the first step to achieving all of the above. Whatever your income, lifestyle, or financial concerns may be, The Motley Fool Personal Finance Workbook will help you put more power into every dollar. Like a financial global positioning system, The Motley Fool Personal Finance Workbook will show you exactly where you stand right now and the most direct path to where you want to be.  The Motley Fool's legendary smarts and math-made-easy will show you:  -How to create a workable budget that gives you money and a life -The smartest (and fastest) way out of debt -How to set priorities to guide your financial decisions -The savviest ways to finance big purchases like a home or an education -Tactics for eliminating stress when saving for retirement -And much more... Hip, funny, and immediately useful, The Motley Fool Personal Finance Workbook is an indispensable hands-on guide for anyone looking to make the most of his or her money.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Arms and Equipment of The Union",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": "",
        "Publisher": "Time Life Medical",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "China Through The Ages: History Of A Civilization",
        "Authors": "By Michael, Franz",
        "Description": "Past studies of China have concentrated on specific events or have related a chronological history of the dynastic periods. Although they have included aspects of cultural history, these works have underemphasized the country’s great social, political, and intellectual movements and their ultimate expression in the art and literature of the time. By focusing on these themes, Professor Michael provides a new framework for understanding the Chinese cultural tradition.The author describes the evolving history of ideas in China, from ancient faith in powerful magic to more modern concepts of a logical moral order of the universe and mankind’s place in it. He also explores the intellectual ferment following the dawn of the age of reason, the integration of Buddhism into the Confucian social order, and the social transformations accompanying the rise and fall of the centralized state. Throughout, he illustrates how the changing society’s beliefs, values, and aesthetic sense were embodied in its art and literature. This portrayal of the Chinese cultural tradition not only puts Chinese history in a new perspective, it illuminates the process through which China constructed a modern society from a non-Western foundation and serves as an essential tool for understanding modern-day China and its prospects for the future.",
        "Category": " History , Asia , China",
        "Publisher": "Routledge",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Ron Hazelton's House Calls: America's Most Requested Home Improvement Projects",
        "Authors": "By Hazelton, Ron and Peters, Rick",
        "Description": "Presents sixty do-it-yourself projects for kitchens, bathrooms, walls, floors, ceilings, and exteriors",
        "Category": " House & Home , Repair",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Irish Whiskey (Nuala Anne McGrail Novels)",
        "Authors": "By Greeley, Andrew M.",
        "Description": "Nuala Anne McGrail is almost more than any poor mortal man can handle without losing his sanity: her beauty causes shortness of breath in men of all ages, she's strong, she's smart, she's witty, she sings like an angel, and--to top it all off--she's psychic, or fey as they say in the Old Country.But our man Dermot Michael Coyne, \"accidental millionaire,\" part-time writer, and full-time worshiper of Nuala, seems to be bearing up pretty well in as much as Herself has consented to marry him.Before that blissful day arrives, another one of Nuala's \"spells\" sends the pair on a hunt to find out what really happened to Al Capone's famous rival, Jimmy \"Sweet Rolls\" Sullivan. And as they've found in previous adventures, historic mysteries can often be too current for safety, and the dead should be left buried--wherever they are.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "The Witness (Badge Of Honor)",
        "Authors": "By Griffin, W. E. B.",
        "Description": "The robbery ended in murder, the killers claimed to be terrorists, and the only cooperative witness feared for his life. Police officer Matt Payne knew the dangers of his profession--but never thought that he himself would be the one who needed protection...In BADGE OF HONOR, W.E.B. Griffin reveals the explosive world of law enforcement with the same power and authenticity that made his BROTHERHOOD OF WAR and THE CORPS series nationwide bestsellers.",
        "Category": " Fiction , War & Military",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Celebrant: A Novel",
        "Authors": "By Greenberg, Eric Rolfe",
        "Description": "The first two decades of the twentieth century were a time of promise and innocence in America. Hardworking immigrants could achieve the American dream; heroes were truly heroic. Eric Rolfe Greenberg brilliantly and authentically chronicles the real-life saga of the first national baseball hero, Christy Mathewson, and the fictional story of a Jewish immigrant family of jewelers. In these pages Mathewson and other great players like John McGraw, Honus Wagner, and Connie Mack discover the realities behind the shining illusions: the burdens of being a hero and the temptations that taint success.",
        "Category": " Sports & Recreation , Essays",
        "Publisher": "Bison Books",
        "Price Starting With ($)": "12.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Quiches, Pies and Tarts",
        "Authors": "By Family Circle",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Murdoch Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Devil's Waltz (Alex Delaware)",
        "Authors": "By Kellerman, Jonathan",
        "Description": "The doctors call it Munchausen by proxy, the  terrifying disease that causes parents to induce  illness in their own children. Now, in his most  frightening case, Dr. Alex Delaware may have to prove  that a child's own mother or father is making her  sick. Twenty-one-month-old Cassie Jones  is bright, energetic, the picture of health. Yet  her parents rush her to the emergency room night  after night with medical symptoms no doctor can  explain. Cassie's parents seem sympathetic and  deeply concerned. Her favorite nurse is a model of  devotion. Yet when child psychologist Alex  Delaware is called in to investigate, instinct tells him  that one of them may be a monster. Then  a physician at the hospital is brutally murdered.  A shadowy death is revealed. And Alex and his  friend LAPD detective Milo Sturgis have only hours  to uncover the link between these shocking events  and the fate of an innocent child.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Dead Run",
        "Authors": "By Spindler, Erica",
        "Description": "When her sister Rachel, a pastor in Key West, mysteriously vanishes, and two murders occur, Liz is forced to team up with former Miami cop Rick Wells to unearth the dark secrets that lurk beneath the surface of this seemingly perfect community. Reprint.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Angel Fire East (The Word and the Void Trilogy, Book 3)",
        "Authors": "By Brooks, Terry",
        "Description": "“That is Brooks’ way of casting spells—transporting his readers into plausible realms where sorcery is alive, whether those places are in other ages or right in the middle of our own. As a result, he's reaped more than a few magical moments . . .”—Seattle TimesAs a Knight of the Word, John Ross has struggled against the dark forces of the Void and his minions for twenty-five years.  The grim future he dreams each night—a world reduced to blood and ashes—will come true, unless he can stop them now, in the present.   The birth of a gypsy morph, a rare and dangerous creature that could be an invaluable weapon in his fight against the Void, brings John Ross and Nest Freemark together again. Twice before, with the fate of the world hanging in the balance, the lives of Ross and Nest have intersected. Together, they have prevailed.  But now they will face an ancient evil beyond anything they have ever encountered, a demon of ruthless intelligence and feral cunning.  As a firestorm of evil erupts, threatening to consume lives and shatter dreams, they have but a single chance to solve the mystery of the Gypsy morph—and their own profound connection.“Superior to most of the fantasy fiction being published today.”—Rocky Mountain News",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Hamlet ( Folger Library Shakespeare)",
        "Authors": "By Shakespeare, William",
        "Description": "Hamlet is Shakespeare’s most popular, and most puzzling, play. It follows the form of a “revenge tragedy,” in which the hero, Hamlet, seeks vengeance against his father’s murderer, his uncle Claudius, now the king of Denmark. Much of its fascination, however, lies in its uncertainties.  Among them: What is the Ghost—Hamlet’s father demanding justice, a tempting demon, an angelic messenger? Does Hamlet go mad, or merely pretend to? Once he is sure that Claudius is a murderer, why does he not act? Was his mother, Gertrude, unfaithful to her husband or complicit in his murder?  The authoritative edition of Hamlet from The Folger Shakespeare Library, the trusted and widely used Shakespeare series for students and general readers, includes:  -Freshly edited text based on the best early printed version of the play -Newly revised explanatory notes conveniently placed on pages facing the text of the play -Scene-by-scene plot summaries -A key to the play’s famous lines and phrases -An introduction to reading Shakespeare’s language -An essay by a leading Shakespeare scholar providing a modern perspective on the play -Fresh images from the Folger Shakespeare Library’s vast holdings of rare books -An up-to-date annotated guide to further reading  Essay by Michael Neill  The Folger Shakespeare Library in Washington, DC, is home to the world’s largest collection of Shakespeare’s printed works, and a magnet for Shakespeare scholars from around the globe. In addition to exhibitions open to the public throughout the year, the Folger offers a full calendar of performances and programs. For more information, visit Folger.edu.",
        "Category": " Fiction , Classics",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Hawaii: The Islands of Life : The Nature Conservancy of Hawaii",
        "Authors": "By Daws, Gavan and Gon, Samuel M., III",
        "Description": "",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "Signature Pub",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Spy Dance",
        "Authors": "By Topol, Allan",
        "Description": "Desperate to escape the shadowy and dangerous secrets of his past and to build a new life for himself under a new identity, former CIA agent Greg Nielsen finds himself blackmailed into undertaking a perilous new mission against his own country after his stepdaughter is taken hostage. Original.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Onyx",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "The Kidspace Idea Book: Creative Playrooms, Clever Storage Ideas, Retreats for Teens, Toddler-Friendly Bedrooms (Taunton Home Idea Books)",
        "Authors": "By Jordan, Wendy Adler",
        "Description": "This planning book provides practical design ideas for creating family spaces that function for both kids and adults -- from lofts and secret hideaways to high-tech homework centers and colorful bathrooms. Through comprehensive color photos, floor plans, and instructions, this inspiring manual is suitable for do-it-yourselfers, remodelers, and parents looking for ideas to present to architects and contractors.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Still Waters (DCI Mark Lapslie, Bk 1)",
        "Authors": "By McCrery, Nigel",
        "Description": "When the badly decayed body of an elderly woman is unearthed, Detective Chief Inspector Mark Lapslie and his sergeant, Emma Bradbury, are called in on the case.  The body provides only two mysterious clues to the identity of the murderer: someone with a deadly knowledge of household plants used shears to clip the fingertips off the corpse's right hand.  But this dearth of evidence is not Lapslie's only problem.  He's just returned to the force after a year of relative isolation, trying to avoid the worst symptoms of his synasethsia, a neurological condition that causes him to \"taste\" sound and that makes his life as complicated as any crime he's been charged with solving.  Now he's flooded again--not only with the convolution of senses that can drive him nearly mad but also with the increasing convolutions of the case.  The murder appears to be the work of a serial killer, and the investigation is leading in a direction that could be extremely detrimental to Lapslie's career--if not to his very life.Razor-sharp, viscerally descriptive, mesmerizingly eerie and entertaining--and with one of the most clever, ruthless, and sympathetic villains to appear in ages--Still Waters is a stunning start to an exciting new series.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "The Body in Blackwater Bay: A Jack Stryker Mystery",
        "Authors": "By Gosling, Paula",
        "Description": "Convalescing after suffering a gunshot wound, Detective Lieutenant Jack Stryker and his girlfriend are spending two weeks in the Blackwater Bay area of the Great Lakes. But when a body washes ashore, Jack is obliged to get out of his hammock and help the local sheriff find the killer.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mysterious Press",
        "Price Starting With ($)": "5.3",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Rise the Euphrates",
        "Authors": "By Edgarian, Carol",
        "Description": "This stunning tapestry of world history and intimate family truths marks the debut of a supremely gifted novelist. Carol Edgarian has written a story remarkable for its psychological insight and the unique perfection of its lyric prose. \"These are the things that were not lost. My name is Seta Loon,\" begins the womanly wise narrator of Rise the Euphrates. From birth, Seta is impelled on a perilous journey to unravel the secret she inherits from her grandmother Casard.At the heart of the story is a moment of survival when a young girl narrowly escapes a holocaust - the 1915 Turkish massacre of over one million Armenian men, women and children. In the diaspora that follows, the girl comes to America bearing a legacy of trauma that her granddaughter Seta will be left to explain. Seta is the chosen one, the one upon whom the generations pin their hope and despair.Rise the Euphrates vividly brings to life a historic tragedy - the world's first modern genocide - and illuminates the archetypal pattern in which the first generation denies, the second generation forgets and the third generation rediscovers the event.When Casard emigrates to America she puts the atrocities behind her, yet, as the years pass, she infuses her only daughter, Araxie, with a legacy of anger and shame. Willfully, Araxie marries outside the clan, making her husband and their children odar - outsiders. It falls to Seta to heal the family.\"The daughter assumes what is unfinished in her mother's life,\" Seta tells us. \"The unanswered questions become her work.\"Caught between the generations, between American and Armenian cultures in her Connecticut town, Seta confronts an even fiercer division, the one within herself. Haunted by survivor's guilt, silence and isolation, Seta longs to love, to speak, to be free. Her song and the wisdom and beauty of life are Carol Edgarian's triumph in Rise the Euphrates. Widely recognized and acclaimed before publication, this profoundly moving and richly accomplished novel establishes Carol Edgarian among the foremost American writers.",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Cold Truth: A Novel",
        "Authors": "By Stewart, Mariah",
        "Description": "From New York Times bestselling author Mariah Stewart comes a novel of sexy romantic suspense for fans of Nora Roberts, Catherine Coulter, and Karen Robards.TRUTH HAS DEADLY CONSEQUENCES  Twenty-six years ago, even before a series of brutal  murders rocked the idyllic town of Bowers Inlet, Cassie Burke lost her parents, her  sister, and nearly her own life to a transient befriended by her father. Back then,  Cassie was a scared kid–now she’s a homicide cop. Back then, the suspect was caught  and convicted–he died in prison. But now the killing has started again. And all signs  indicate that the Bayside Strangler has come back for more.  With too many victims  and too few suspects, Cassie has her hands full investigating the case, while working  through the old trauma it has brought to the surface. Luckily, FBI agent Rick Cisco  is dispatched to lend support. Together, Cassie and Rick must uncover the link between  the dark past and the dangerous present to bring this small town’s long nightmare  to an end. If they fail, an elusive fiend will slip back into the shadows . . . to  watch and wait–and kill another day.  In matters of crime, there are many versions  of the truth.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Finding Nemo Look & Find (Look and Find (Publications International))",
        "Authors": "By Mawhinney, Art (ILT)",
        "Description": "Readers follow the adventures of Nemo, who is captured by divers and winds up in a dentist's acquarium, and his father Marlin and his friend Dory, who attempt to find him, through a series of picture puzzles.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Phoenix Intl Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Todays Sound",
        "Authors": "By Coleman, Ray",
        "Description": "",
        "Category": "",
        "Publisher": "Hamlyn Publ Group Ltd",
        "Price Starting With ($)": "31.54",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "The Gentle Axe: A Novel",
        "Authors": "By Morris, R. N.",
        "Description": "Just before Christmas, in St. Petersburg, Russia, in 1866, police investigator Porfiry Petrovich faces his most challenging murder case since the events made famous by F. Dostoevsky in the novel Crime and Punishment-a case with disturbing parallels and even darker implications  Stumbling through Petvosky Park one cold morning in search of firewood, an elderly woman makes a horrifying discovery. A burly peasant twirls in the wind, hanging from a bowed tree by a rope about his neck, a bloody axe tucked into his belt. Nearby, packed neatly into a suitcase, is the body of a dwarf, a deep axe wound splitting his skull in two.  It does not take long for the noted police investigator Porfiry Petrovich, still drained from his work on the case involving the deranged student Raskolnikov, to suspect that the truth of the matter is more complex than the crime scene might suggest. Why do so many roads lead to the same house of prostitution and the same ring of pornographers? Why do so many powerful interests seem intent on blocking his efforts? His investigation leads him from the squalid tenements, brothels, and drinking dens of the city's Haymarket district to an altogether more genteel stratum of society. As he gets deeper and deeper in, and the connections between the two spheres begin to multiply, both his anger and his terror mount.  Atmospheric and tense from its dramatic opening to its shocking climax, The Gentle Axe is a spellbinding historical crime novel, a book that explores the darkest places of the human heart with tremendous energy, empathy, and wit. As lucky as St. Petersburg residents are to have Porfiry Petrovich in public service, we are equally fortunate to have R. N. Morris on hand to chronicle his most challenging case to date.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Penguin Press HC, The",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Liszt's Kiss: A Novel",
        "Authors": "By Dunlap, Susanne",
        "Description": "The romantic story of a young female pianist in cholera-ravaged Paris of 1832, whose own tragedy leaves her susceptible to the passions and scandals of the composer Franz Liszt   At the height of the Romantic era in Paris, there was no bigger celebrity than the composer and pianist Franz Liszt. A fiery and gorgeous Hungarian, he made women swoon at soirees and left a trail of broken hearts behind him. Anne, a countess and talented young pianist whose mother has just died of cholera, hears Franz Liszt in concert and is swept up in his allure. The enigmatic Marie d'Agoult, a friend of Anne's late mother, takes her under her wing and introduces her to the artistic world -- despite the objections of Anne's sullen and sorrowful father.   Anne soon finds herself in the midst of dangerous intrigues, discovering a family secret so shocking that her father will go to any lengths to protect it.   With the ominous presence of Paris's most deadly epidemic looming over every turbulent event, Liszt's Kiss is a rich evocation of a remarkable period as seen through the eyes of a sensitive young artist.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Biblical Affirmations of Woman",
        "Authors": "By Swidler, Leonard J.",
        "Description": "Explores more than three hundred topics and presents biblical passages to examine the Bible's view of women, feminine imagery of God, and woman in Hebrew-Jewish and Christian tradition",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Westminster John Knox Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1979"
        }
    },
    {
        "Title": "The Book of Leaders: The Story of Moses and the Judges",
        "Authors": "By Stephens, Steve",
        "Description": "",
        "Category": " Fiction , Religious",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The New Anti-Catholicism: The Last Acceptable Prejudice",
        "Authors": "By Jenkins, Philip",
        "Description": "Anti-Catholicism has a long history in America. And as Philip Jenkins argues in The New Anti-Catholicism, this virulent strain of hatred--once thought dead--is alive and well in our nation, but few people seem to notice, or care.        A statement that is seen as racist, misogynistic, anti-Semitic, or homophobic can haunt a speaker for years, writes Jenkins, but it is still possible to make hostile and vituperative public statements about Roman Catholicism without fear of serious repercussions. Jenkins shines a light on anti-Catholic sentiment in American society and illuminates its causes, looking closely at gay and feminist anti-Catholicism, anti-Catholic rhetoric and imagery in the media, and the anti-Catholicism of the academic world. For newspapers and newsmagazines, for television news and in movies, for major book publishers, the Catholic Church has come to provide a grossly stereotyped public villain. Catholic opinions, doctrines, and individual leaders are frequently the butt of harsh satire. Indeed, the notion that the church is a deadly enemy of women, the idea of Catholic misogyny, is commonly accepted in the news media and in popular culture, says Jenkins. And the recent pedophile priest scandal, he shows, has revived many ancient anti-Catholic stereotypes.      It was said that with the election of John F. Kennedy, anti-Catholicism in America was dead. This provocative new book corrects that illusion, drawing attention to this important issue.",
        "Category": " Biography & Autobiography , Educators",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Sushi for Beginners",
        "Authors": "By Keyes, Marian",
        "Description": "Hard-nosed, bitch-goddess London fashion editor Lisa Edwards was certain her \"fabulous\" promotion would mean more A-list parties, society page photos, and jet-setting jaunts to the fall collections.Instead, she's being deported, Prada wardrobe and all, to supremely un-chic Dublin to launch Colleen magazine. Her assistant editor, over-organized world-class worrier Ashling Kennedy, however, is thrilled with her new job . . .until she discovers it comes with a very high price tag: Lisa Edwards. And then there's Ashling's oldest, dearest chum, Clodagh \"Princess\" Kelly, who seems to have achieved true happily-ever-after suburban fairy tale bliss -- but lately has this irresistible urge to kiss a frog. The chances of three such diverse, equally unsatisfied women bonding would be remote anywhere except in staid Dublin town, \"the magazine version of Siberia.\" And once they do, they're going to start shaking things up -- in print and out of it -- especially when Colleen's rumpled, moody, wickedly attractive head honcho Jack Devine is tossed into the mix.",
        "Category": " Fiction , Women",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Buddhist Scriptures",
        "Authors": "By Conze, Edward",
        "Description": "A volume of key writings on the Buddha, collected from a variety of languages and traditionsWhile Buddhism has no central text comparable to the Bible or Koran, there is a powerful body of scripture from across Asia that encompasses the dharma, or the teachings of the Buddha. In this rich anthology, eminent scholar Donald S. Lopez, Jr. brings together works from a broad historical and geographical range, and from such languages as Pali, Sanskrit, Tibetan, Chinese, and Japanese. There are tales of the Buddha's past lives, a discussion of qualities and qualifications for a monk, and an exploration of the many meanings of enlightenment. Together they provide a vivid picture of the Buddha and of the vast and profound nature of the Buddhist tradition.For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "Category": " Religion , Buddhism , Sacred Writings",
        "Publisher": "Penguin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1959"
        }
    },
    {
        "Title": "The Message: The Old Testament Books of Moses",
        "Authors": "By Peterson, Eugene H. (EDT)",
        "Description": "",
        "Category": " Bibles , The Message , General",
        "Publisher": "Navpress Pub Group",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "The Knitting Directory",
        "Authors": "By Jenkins, Alison",
        "Description": "",
        "Category": " Crafts & Hobbies , Needlework , Knitting",
        "Publisher": "Chartwell Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Sing Down The Moon",
        "Authors": "By O'Dell, Scott",
        "Description": "Fourteen-year-old Bright Morning has an eerie feeling that her happy life in the red buttes of the Canyon de Chelly will be changed forever as Black Dog barks and she sees Spanish slavers riding straight toward her.  Reprint.",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Lil Mamas Rules: A Novel",
        "Authors": "By Jackson, Sheneska",
        "Description": "I believe there is a proper way to do everything, including dating. I've found over the years that men are ornery, dangerous creatures, and unless you have precise methods for dealing with them, they can turn your life upside down. Now I just gotta tell it like it is. It takes an intelligent woman with an equally intelligent plan of action to navigate through the swamp of the male species and stay above water. And when done properly, dating can be pleasant, harmless experience.In this fresh, outspoken novel about contemporary relationships, Sheneska Jackson, author of the blackboard bestseller Caught Up in the Rapture, gives us an unforgettable heroine whose wisdom - and mistakes - will have us laughing, crying, and, most importantly, thinking.",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Rascal",
        "Authors": "By Sterling North",
        "Description": "",
        "Category": "",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "The Weekend Was Murder",
        "Authors": "By Nixon, Joan Lowery",
        "Description": "For fans of Gillian Flynn, Caroline Cooney, and R.L. Stine comes The Weekend was Murder! from four-time Edgar Allen Poe Young Adult Mystery Award winner Joan Lowery Nixon.          Mary Elizabeth can’t wait for the weekend to begin at the Ridley Hotel, where a famous mystery writer and a troupe of actors are coming to enact a murder mystery for 150 amateur sleuths. Mary Elizabeth’s role is to discover the “body” in Room 1927, which is supposed to be haunted. But nothing prepares her for the real body she finds in Room 1927…   “A masterfully constructed, engaging read that…[is] ingeniously plotted, fast-paced and lighthearted.” –Publishers Weekly   “Fans will love wading through the myriad details and placing bets on the outcome.” –Kirkus Reviews   “Mystery fans will…enjoy trying to solve the various crimes.” –School Library JournalFrom the Trade Paperback edition.",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "The Kidnapping of Christina Lattimore (Laurel Leaf Books)",
        "Authors": "By Nixon, Joan Lowery",
        "Description": "A teenage girl is kidnapped, but when freed, is accused of masterminding the scheme to extort money from her wealthy grandmother",
        "Category": "",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "The Art of Keeping Secrets",
        "Authors": "By Henry, Patti Callahan",
        "Description": "New York Times bestselling author Patti Callahan Henry transports readers to the Lowcountry of South Carolina, where a tragedy unites two women—and forces them to face the dark secrets of their past…    Since a solo plane crash killed her husband two years ago, Annabelle Murphy has found solace in raising her two children. Just when she thinks the grief is behind her, she receives the news that the wreckage of the plane has been discovered—and that her husband did not die alone. He was with another woman. Suddenly Annabelle is forced to question everything she once held true.   Sofie Milstead knows the woman who was on that plane. A dolphin researcher who has lived a quiet life, Sofie has never let anyone get too close. But when Annabelle shows up on Sofie’s doorstep full of painful questions, both women must confront their intertwining pasts—and find the courage they need to face the truth...",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Gone with the Windsors: A Novel",
        "Authors": "By Graham, Laurie",
        "Description": "When Maybell Brumby, frisky, wealthy, and recently widowed, quits Baltimore and arrives in London, she finds that her old school chum, Bessie Wallis Warfield, is there ahead of her. Impoverished and ambitious as ever, Wallis is on the make. Hampered by plodding husband number two, but armed with terrific bone structure and a few erotic tricks picked up in China, Wallis sets her sights on the most eligible bachelor in the world: the Prince of Wales, heir to the throne. Maybell, with her deep pockets, makes the perfect ally, and her disarming dimness makes her the most delicious chronicler of the scandal that rocked a monarchy and changed the course of history.",
        "Category": " Fiction , Literary",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "One Nation Divisible: Class, Race, and Ethnicity in the United States Since 1930 (Hist of the USA)",
        "Authors": "By Polenberg, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1980"
        }
    },
    {
        "Title": "Let Us Now Praise Famous Men",
        "Authors": "By Agee, James",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "88 evangelistic sermons",
        "Authors": "By Wallis, Charles, Editor",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Soul Food: Stories to Nourish the Spirit and the Heart",
        "Authors": "By Kornfield, Jack (EDT) and Feldman, Christina (EDT)",
        "Description": "Jack Kornfield and Christina Feldman serve up a delicious banquet of wise tales from the world's greatest spiritual traditions in the pages of this delightful collection. A feast filled with timeless moral and spiritual lessons, these lively tales and",
        "Category": " Religion , Spirituality",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Cats A Book To Make Your Own (Helen Exley Giftbooks)",
        "Authors": "By Exley, Helen and Clarke, Juliette (ILT)",
        "Description": "Provides lots of space for poems, lists, life goals, romantic thoughts, photographs, mementoes, and whatever you choose. This book, laced with amusing cat quotations, is illustrated with Juliette Clarke's characterful cat pictures.",
        "Category": " Pets , Cats , General",
        "Publisher": "Helen Exley Giftbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Changing",
        "Authors": "By Ullmann, Liv",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Doubleday Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The Eco-Spasm Report",
        "Authors": "By Toffler, Alvin",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Prayers For The Age Of Technology",
        "Authors": "By Miller, Haskell M.",
        "Description": "",
        "Category": " Religion , Prayerbooks , Christian",
        "Publisher": "CSS Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "New Look at Prayer: Searching for Bliss (C-45)",
        "Authors": "By Huebsch, Bill",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Twenty Third Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "One Moose, Twenty Mice (A Barefoot Board Book)",
        "Authors": "By Beaton, Clare",
        "Description": "While counting from one to twenty animals. young readers are asked to find the orange cat hiding in the felt applique illustrations.",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "Barefoot Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Little Red Riding Hood: Picture Tales",
        "Authors": "By Rh Value Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "14.07",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Tess and Tim",
        "Authors": "By Gave, Marc",
        "Description": "An older brother describes what it is like to live with his younger sister, Tess the pest.",
        "Category": "",
        "Publisher": "Parents' Magazine Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Big Bratty Book of Bart Simpson (Bart Simpson, 3)",
        "Authors": "By Groening, Matt (EDT), Delegeane, Terry (EDT), Bates, Karen (EDT), Constanza, John (CON), DeCarlo, Dan (CON), Decarlo, Mike (CON), Dinglasan, Francis (CON), Ho, Chia-hsien Jason (CON), Huang, James (CON), Latour, Jason (CON), Le, Kim (CON), Lloyd, James (CON), and Loyo, Oscar Gonzalez (CON)",
        "Description": "Bart Simpson is back with another big book dedicated exclusively to that rabble–rousing, misbehaving menace – Springfield's favourite son, Homer's only son, and TV's favourite son – Bart Simpson!  Following the great success of Big Book of Bart Simpson, Big Bratty Book of Bart Simpson – the third comic book compilation in a series dedicated exclusively to Bart Simpson. Join Bart Simpson and the Springfield kids in the newest collection of comics and stories filled with mistaken identities, alien abduction recipes, cereal package prizes, unrequited love, lima beans, facial hair, karaoke, cafeteria shenanigans, talk shows, mail–order brides, sidekicks gone mad, hideous monsters, balloon animals, girl scout cookies, circus popcorn, martial arts, and history gone very, very wrong. It's all here in one ࡲatty' book – all the chaos, commotion, and confusion that can only be caused by one uncontrollable force: Bart Simpson.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "New Spa Food",
        "Authors": "By Safdie, Edward J.",
        "Description": "",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "How to Live in High Victory",
        "Authors": "By Harold Hill, Burk Harrell",
        "Description": "",
        "Category": "",
        "Publisher": "Logos International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The Red Leather Diary: Reclaiming a Life Through the Pages of a Lost Journal (P.S.)",
        "Authors": "By Koppel, Lily and Howitt, Florence (FRW)",
        "Description": "For more than half a century, the red leather diary languished inside a steamer trunk. Rescued from a Dumpster on Manhattan's Upper West Side, it found its way to Lily Koppel, a young writer, who opened its tarnished brass lock and journeyed into an enthralling past. The diary painted a breathtaking portrait of a bygone New York—of glamorous nights at El Morocco and elegant teas at Schrafft's during the 1920s and '30s—and of the headstrong, endearing teenager who filled its pages with her hopes, heartaches, and vivid recollections. Intrigued, Koppel followed her only clue, a frontispiece inscription, to its now ninety-year-old owner, Florence Wolfson, and was enchanted as Florence, reunited with her diary, rediscovered a lost younger self burning with artistic fervor.Joining intimate interviews with original diary entries, The Red Leather Diary re-creates the romance and promise of a remarkable era and brings to life the true story of a daring, precocious young dreamer.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Real World Scanning and Halftones: The Definitive Guide to Scanning and Halftones from the Desktop",
        "Authors": "By Blatner, David and Roth, Stephen F.",
        "Description": "",
        "Category": "",
        "Publisher": "Peachpit Pr",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Nantucket in the Nineteenth Century",
        "Authors": "By Lancaster, Clay",
        "Description": "180 rare photographs, stereographs, maps, drawings and floor plans recreate unique American island society. Authentic scenes of shipwreck, lighthouses, streets, homes are arranged in geographic sequence to provide walking-tour guide to old Nantucket existing today. Introduction, captions.",
        "Category": " History , United States , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1979"
        }
    },
    {
        "Title": "Beyond Church Growth",
        "Authors": "By Logan, Robert E.",
        "Description": "",
        "Category": " Religion , Leadership",
        "Publisher": "Revell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Inside Monster Garage: The Builds, the Skills, the Thrills",
        "Authors": "By Vose, Kenneth E.",
        "Description": "Offers a behind-the-scenes look at the extraordinary vehicles of Monster Garage and the talented customizers who build them.Before, during, and after photos of vehicles.Candid photos and interviews with host Jesse James.Profiles and photos of fascinating guests, designers, and customizers.Auto-based “transformers” of past, present, and future.",
        "Category": " Performing Arts , Television , General",
        "Publisher": "Discovery Channel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Celine Dion: For Keeps",
        "Authors": "By Glatzer, Jenna",
        "Description": "Drawing on the personal archives of Celine and her family, this collector's edition compiles beautiful and elegant photographs of the performer with some of her favorite mementos.* Includes more than 20 facsimiles of Celine Dion memorabilia stored in vellum envelopesMore About Celine DionCeline Dion has long been one of the world's most admired performers. Her unique blend of brilliant talent and an unstinting willingness to share her life has defined her career in the public eye. With new interviews and special memorabilia, Celine Dion: For Keeps will invite her fans to get to know the professional and personal parts of her life as never before. Celine Dion is a very special collection: a combination of memoir, personal scrapbook, and looking glass into one of the world's most admired lives. Drawing heavily from Celine's personal archives and those of her husband and longtime manager, Rene Angelil, this book focuses on the key elements of her life, including her family, career, inspirations, courtship and marriage to Rene, show business hiatus, son Rene-Charles, and plans for the future-everything that makes her who she is.  Produced in the successful and stylish format of last year's The Sinatra Treasures, each of Celine Dion's chapters will include removable facsimiles of favorite mementos, stored in vellum envelopes. Everything from Celine and Rene's love notes and family photos to special letters and her wedding program can be examined and admired in detail. This is a remarkable opportunity to share in the unique and vital life and career of Celine Dion.",
        "Category": " Music , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "7.56",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "The Music Pack",
        "Authors": "By Van Der Meer, Ron and Berkeley, Michael",
        "Description": "A stimulating, interactive introduction to music history uses three-dimensional, pop-up illustrations, paper instruments, and a CD to present information on performers, composers, musical style, music theory, and more. 100,000 first printing. $200,000 ad/promo.",
        "Category": " Music , History & Criticism",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.6",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "National Geographic Expeditions Atlas",
        "Authors": "By National Geographic Society",
        "Description": "Founded more than 112 years ago \"for the increase and diffusion of geographic knowledge,\" the National Geographic Society has chronicled the exploits of some of the most famous explorers of the 20th century, and often helped fund those efforts. Roald Amundsen and Robert Byrd. Hiram Bingham and Howard Carter. Charles Lindbergh and Alan Shepard. Jacques Cousteau. Edmund Hillary. Will Steger. Bob Ballard. John Glenn.  In addition, the Society has reported on a different sort of explorer: anthropologists Louis and Mary Leakey, for example, primatologists Dian Fossey and Jane Goodall, and archaeologists such as Matthew Stirling and Kent Weeks.  National Geographic Expeditions Atlas, illustrated with hundreds of historic and contemporary photographs and more than 60 maps (both vintage and new), celebrates the achievements of Society luminaries. Some, like mountaineer Barry Bishop and diver Luis Marden, have been staff members. Many have contributed to the Society's official journal, National Geographic magazine: Amazonian explorer Loren McIntyre, for example; divers Sylvia Earle and David Doubilet; adventurer-scientists Joseph Rock and Roy Chapman Andrews; cartographer Bradford Washburn; mariners Amos Burg and Robin Lee Graham. Also part of Geographic's family: winners of the Hubbard and Grosvenor Medals, and recipients of the nearly 7,000 grants awarded by the Society over the past century to support scientific and geographic explorations.  National Geographic Expeditions Atlas is dedicated not only to all Geographic explorers past and present, but also to the enduring spirit that makes such expeditions possible: an insatiable thirst for knowledge about our planet and everything in it.",
        "Category": " Reference , Atlases, Gazetteers & Maps",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "5.86",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "A Rose for Pinkerton",
        "Authors": "By Kellogg, Steven",
        "Description": "Pinkerton, the Great Dane, intimidated by Rose, the kitten, who wants to be a Great Dane herself, goes to the International Pet Show for expert advice",
        "Category": " Juvenile Fiction , Animals , Dogs",
        "Publisher": "Dial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Same Kind of Different As Me",
        "Authors": "By Vincent, Lynn, Hall, Ron, and Moore, Denver",
        "Description": "Read the critically acclaimed #1 New York Times best-seller with more than one million copies in print. Same Kind of Different as Me was a major motion picture by Paramount in fall 2017.Gritty with pain and betrayal and brutality, this true story also shines with an unexpected, life-changing love.Meet Denver, raised under plantation-style slavery in Louisiana until he escaped the “Man” – in the 1960’s – by hopping a train. Non-trusting, uneducated, and violent, he spent another 18 years on the streets of Dallas and Fort Worth.Meet Ron Hall, a self-made millionaire in the world of high priced art deals -- concerned with fast cars, beautiful women, and fancy clothes.And the woman who changed their lives -- Miss Debbie: “The skinniest, nosiest, pushiest, woman I ever met, black or white.” She helped the homeless and gave of herself to all of “God’s People,” and had a way of knowing how to listen and helping others talk and be found – until cancer strikes.Same Kind of Different as Me is a tale told in two unique voices – Ron Hall & Denver Moore – weaving two completely different life experiences into one common journey where both men learn “whether we is rich or poor or something in between this earth ain’t no final restin’ place. So in a way, we is all homeless-just workin’ our way toward home.The story takes a devastating twist when Deborah discovers she has cancer. Will Deborah live or die? Will Denver learn to trust a white man? Will Ron embrace his dying wife's vision to rescue Denver? Or will Denver be the one rescuing Ron? There's pain and laughter, doubt and tears, and in the end a triumphal story that readers will never forget.Continue this story of friendship in What Difference Do It Make?: Stories of Hope and Healing, available now. Same Kind of Different as Me also is available in Spanish.",
        "Category": " Religion , Spirituality",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Entertaining with Longaberger: Celebrating the Seasons",
        "Authors": "By Mary  Douglas",
        "Description": "",
        "Category": "",
        "Publisher": "Longaberger Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Getting the Right Things Right",
        "Authors": "By Hedges, Charlie",
        "Description": "",
        "Category": " Religion , Faith",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Tara Lipinski: Triumph on Ice",
        "Authors": "By Costello, Emily and Lipinski, Tara",
        "Description": "An autobiography by skating sensation Tara Lipinski, the youngest skater ever to win United States and World Figure Skating Championships",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Sports & Recreation",
        "Publisher": "Starfire",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The Obnoxious Jerks",
        "Authors": "By Manes, Stephen",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Photoshop CS2 Book For Digital Photographers",
        "Authors": "By Kelby, Scott",
        "Description": "Scott Kelby, the  best-selling Photoshop author in the world today, once again takes this  book to a whole new level as he uncovers the latest, most important and  most exciting new Adobe Photoshop CS2 techniques for digital  photographers.   This  major update to this award-winning, record-breaking book does something  for digital photographers that's never been done before--it  cuts  through the bull and shows you exactly \"how to do it.\" It's not  a bunch of theory; it doesn't challenge you to come up with your  own  settings or figure it out on your own. Instead, Scott shows  you step-by-step the exact techniques used by today's cutting-edge  digital  photographers and, best of all, he shows you, flat-out,  exactly which settings to use, when to use them, and why. That's  why the previous  version of this book took the digital  photography world by storm.   But  now, his new CS2, version is even bigger, even better, and  exposes even more of the pros most closely guarded secrets,  including a special chapter which shows, for the first time ever,  step-by-step how to how to set-up Photoshop's color management. He  does it by throwing out all the theory, all the techno-babble, and  all the confusing charts and graphs and instead just shows you  exactly what you need to do (and   nothing more).   LEARN HOW THE PROS DO IT  Each year Scott trains thousands of professional photographers how  to use Photoshop, and almost without exception they have the same  questions, the same problems, and the same challenges--and that's  exactly what he covers in this book. You'll learn:    The sharpening techniques the pros really use (there's an entire chapter on, just this!) The pros tricks for fixing the most common digital photo problems fast! The step-by-step set-up for getting what comes out of your printer to match exactly what you saw on screen The retouching secrets of how the pros retouch portraits How to process raw digital camera images (plus how to take advantage of all the new Camera Raw features of CS2!) How to color correct any photo without breaking a sweat (you'll be amazed at how easy it is–once you know the secret) A whole chapter on the latest, most requested Photoshop special effects  How to reduce noise, deal with lens problems, avoid halos, and more How to show your work like a pro!  Plus a host of shortcuts, workarounds, and slick \"insider\" tricks to send your productivity through the roof!    If  you're a digital photographer and you're ready to learn the  \"tricks of the trade\"--the same ones that today's leading pros use  to correct,  edit, sharpen, retouch, and present their work; then  this is the book for you.   \"The  Professional Photographer magazine Hot1 Awards represent a must-have  list of this year's hottest, most sought-after new products. Selected  by a panel of working professional photographers, the awards are chosen  based on innovation, overall quality and value for price. In its  seventh year, the Professional Photographer Hot1 Awards are one of the  biggest product competitions in the industry, representing 60  categories of gear from a couple hundred different companies.\" --Jeff Kent, Special Hot1 Awards Editor / Editor at Large Professional Photographer magazine",
        "Category": " Photography , Techniques , Digital",
        "Publisher": "Peachpit Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "I'll Love You When You're More Like Me",
        "Authors": "By Kerr, M. E",
        "Description": "",
        "Category": "",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "December",
            "Year": "1978"
        }
    },
    {
        "Title": "The greatest possibility thinker that ever lived",
        "Authors": "By Schuller, Robert Harold",
        "Description": "",
        "Category": "",
        "Publisher": "F. H. Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "How to Heal a Broken Heart in 30 Days: A Day-by-Day Guide to Saying Good-bye and Getting On With Your Life",
        "Authors": "By Bronson, Howard and Riley, Mike",
        "Description": "“It’s over.  Now what?”Suffering from a broken heart?  Afraid you’ll never get over this feeling of emptiness and loss?  You can, and with the help of this easy-to-follow program of action, you will.Follow Howard Bronson and Mike Riley as they lead you through their thirty-day plan for recovering from your broken heart.  They will guide you through a brief period of mourning for your loss, and then the process of rebuilding yourself and your life.  You are encouraged to enjoy good memories of the relationship that’s just ended, while remembering the reasons for the breakup.  You will learn to take responsibility for your own emotions, face your fears, and ultimately to seek new people and new experiences.  Find out:·How and why to cry ’til dry·Good ways to beat loneliness·Why it pays to forgive your ex·How to \"let go\" of old memories and resentmentsHow to Heal a Broken Heart in 30 Days prescribes a wide array of tested and proven insights and exercises.  After thirty days of active self-restoration, your heart will be healed and whole again–and you’ll be ready for anything.  Of course, your feelings of grief, hurt, or shame may come and go. But in less than a month, you can be ready to deal with life's new challenges with a positive sense of emotional balance you may never have had before.",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Dancer Upstairs: A Novel",
        "Authors": "By Shakespeare, Nicholas",
        "Description": "The Peruvian guerilla leader Ezequiel is responsible for tens of thousands of fiendishly cruel murders, yet he consistently eludes capture.  But in Agustn Rejas he has an indefatigable pursuer.  From secluded city streets to the paths of a mountain village the policeman persists, tracking and anticipating Ezequiel's every move.  Rejas' only reprieve is his love for his daughter's beautiful dance teacher--until he begins to pick up unmistakable signals that her circles--and Ezequiel's--intersect.Based on the extraordinary manhunt for the leader of Peru's notorious guerilla organization, The Shining Path, The Dancer Upstairs is a story reminiscent of Graham Greene and John LeCarr--tense, intricate, and heartbreaking.",
        "Category": " Fiction , Literary",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Creative Crepe Cooking",
        "Authors": "By Rh Value Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Plainsong for Caitlin (American Dreams)",
        "Authors": "By Rees, Elizabeth M.",
        "Description": "Orphaned in 1872 Nebraska, fifteen-year-old Caitlin and her older sister, Rebecca, start their lives over on the wild prairie, where Caitlin learns to love and respect the land with the help of a handsome young man. Original.",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Flare",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "The Scroll of Seduction: A Novel of Power, Madness, and Royalty",
        "Authors": "By Belli, Gioconda",
        "Description": "On an outing from her boarding school, young Lucía meets Manuel—art historian and exquisite storyteller—who shares with her the tale of one of history's most tumultuous loves: Queen Juana of Castile's legendary devotion to her husband, Prince Philippe the Handsome. Embracing a union thrust upon her by political necessity, Juana responds with all the passionate abandon inherent in her fiery nature—and is forced to pay a high price for her honest sensuality. For there are those at the Renaissance court who will not allow such unabashed independence in the heir to one of the world's most powerful empires—and they declare Juana mad, denying her ascension to the throne. But is she truly insane, or is she merely a victim of her own impetuosity and unbridled desire? Or is Juana a pawn in a fierce power struggle for control of the throne? Lucía attends raptly to the tale Manuel relates—and their own story begins to miraculously, dangerously mirror that of Juana the Mad and her beloved prince.",
        "Category": " Fiction , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Shizuko's Daughter",
        "Authors": "By Mori, Kyoko",
        "Description": "\"Lyrical...A beautifully written book about a bitterly painful coming of age.\"THE KIRKUS REVIEWSYuki Okuda knows her mother would be proud of her grades and her achievements in sports if she were alive. But she committed suicide. And Yuki has to learn how to live with a father who doesn't seem to love her and a stepmother who treats her badly. Most important, she has to learn how to live with herself: a twelve-year-old Japanese girl growing up alone, trying to make sense of a tragedy that makes no sense at all....",
        "Category": " Young Adult Fiction , Family , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Redbook Flavor Rules!: More Than 250 Recipes Plus Hints, Tips & Tricks for Really Great Food",
        "Authors": "By Redbook (EDT)",
        "Description": "This food is so good you almost won't believe you made it yourself--but you did, and it's not even hard! Packed with 250 recipes for both everyday and holidays; clever shortcuts (including ones that make good use of convenience foods); and know-how tips on everything from shopping to preparation, this is a cookbook that everyone will embrace. Basic recipes have multiple variations, so you can play around and create your dish. With cooking charts and dazzling photos.",
        "Category": " Cooking , Reference",
        "Publisher": "Hearst",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "LAST TRUE COWBOY",
        "Authors": "By Eagle, Kathleen",
        "Description": "The sudden death of her brother brings Julia Weslin home to the High Horse, the family's sprawling yet cash-strapped Wyoming cattle ranch. A burnt-out member of the urban jungle, Julia is spiritually rejuvenated by the wild, still untamed land and reconnects to her home, family and heritage. Her sister wants to sell the property to a neighbor whose lucrative offer she finds irresistible, but Julia along with her irrepressible grandmother is fiercely determined to keep the High Horse in the family and to realize her brother's dream of saving a herd of wild mustangs that neighboring ranchers want destroyed.Blowing into her life on a south wind from Texas comes a charming drifter of a cowboy, a skilled horseman who can touch the wildest places in a horse's nature. K.C. Houston is a bright beacon of hope for Julia - and the only person capable of helping her rescue the mustangs.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "The Mystery of the Hairy Tomatoes",
        "Authors": "By Murdocca, Sal (ILT) and Stanley, George Edward",
        "Description": "Hair, Hair, Everywhere  Someone's been digging up Mrs. Ruston's tomatoes. She thinks it's Noelle's dog, Rover, and unless Noelle can find the real thief, Rover's in big trouble.  It's the hairiest case yet for Mr. Merlin's Third-Grade Detectives. Hair in Mrs. Ruston's tomato patch, hair in Amber Lee's hamburger -- can Noelle and Todd comb through the evidence and solve the mystery?",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Cattle Killing",
        "Authors": "By Wideman, John Edgar",
        "Description": "In plague-ridden eighteenth-century Philadelphia, a young itinerant black preacher searches for a mysterious, endangered African woman. His struggle to find her and save them both plummets them both into the nightmare of a society violently splitting itself into white and black. Spiraling outward from the core image of a cattle killing--the Xhosa people's ritual destruction of their herd in a vain attempt to resist European domination--the novel expands its narrator's search for meaning and love into the America, Europe and South Africa of yesterday and today.",
        "Category": " Fiction , Literary",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Behind-the-Scenes Secrets: Clued In! #1 (Bratz)",
        "Authors": "By Goldman, Leslie",
        "Description": "The girls offer to help out backstage at a fashion-show fundraiser, but when strange accidents threaten to sabotage the event, they have to save the show.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "6.38",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Longstreet Highroad Guide to the Chesapeake Bay (Longstreet Highroad Coastal Series)",
        "Authors": "By Winegar, Garvey and Winegar, Deane",
        "Description": "",
        "Category": " Travel , United States , Northeast , General",
        "Publisher": "Taylor Trade Publishing",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Martin Luther: The Christian between God and Death",
        "Authors": "By Marius, Richard",
        "Description": "Few figures in history have defined their time as dramatically as Martin Luther. And few books have captured the spirit of such a figure as truly as this robust and eloquent life of Luther. A    highly regarded historian and biographer and a gifted novelist and playwright, Richard Marius gives us a dazzling portrait of the German reformer--his inner compulsions, his struggle with himself and his God, the gestation of his    theology, his relations with contemporaries, and his responses to opponents. Focusing in particular on the productive years 1516-1525, Marius' detailed account of Luther's writings yields a rich picture of the development of Luther's    thought on the great questions that came to define the Reformation.  Marius follows Luther from his birth in Saxony in 1483, during the reign of Frederick III, through his schooling in Erfurt, his    flight to an Augustinian monastery and ordination to the outbreak of his revolt against Rome in 1517, the Wittenberg years, his progress to Worms, his exile in the Wartburg, and his triumphant return to Wittenberg. Throughout, Marius    pauses to acquaint us with pertinent issues: the question of authority in the church, the theology of penance, the timing of Luther's \"Reformation breakthrough,\" the German peasantry in 1525, Müntzer's revolutionaries, the    whys and hows of Luther's attack on Erasmus.  In this personal, occasionally irreverent, always humane reconstruction, Luther emerges as a skeptic who hated skepticism and whose titanic wrestling with    the dilemma of the desire for faith and the omnipresence of doubt and fear became an augury for the development of the modern religious consciousness of the West. In all of this, he also represents tragedy, with the goodness of his    works overmatched by their calamitous effects on religion and society.",
        "Category": " Religion , Christianity , Lutheran",
        "Publisher": "Belknap Press",
        "Price Starting With ($)": "6.21",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "A Divine Blessing: A Well-Kept Secret of Life's Second Half",
        "Authors": "By Skoglund, Elizabeth",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Grason",
        "Price Starting With ($)": "12.11",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Overcoming Perfectionism: The Key to a Balanced Recovery",
        "Authors": "By Smith, Ann W.",
        "Description": "Offers helpful advice on how to avoid the pitfalls of perfectionism and how to achieve intimacy, enhance self-esteem, and live a full, satisfying life",
        "Category": " Self-help , Codependency",
        "Publisher": "Hci",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    }
]