[
    {
        "Title": "The Case for Christ: A Journalist's Personal Investigation of the Evidence for Jesus",
        "Authors": "By Strobel, Lee",
        "Description": "A Seasoned Journalist Chases Down the Biggest Story in HistoryIs there credible evidence that Jesus of Nazareth really is the Son of God?Retracing his own spiritual journey from atheism to faith, Lee Strobel, former legal editor of the Chicago Tribune, cross-examines a dozen experts with doctorates from schools like Cambridge, Princeton, and Brandeis who are recognized authorities in their own fields.Strobel challenges them with questions like How reliable is the New Testament? Does evidence for Jesus exist outside the Bible? Is there any reason to believe the resurrection was an actual event?Strobel's tough, point-blank questions make this Gold Medallion-winning book read like a captivating, fast-paced novel. But it's not fiction. It's a riveting quest for the truth about history's most compelling figure.What will your verdict be in The Case for Christ?'Lee Strobel probes with bulldog-like tenacity the evidence for the truth of biblical Christianity.'Bruce M. Metzger, Ph.D., Professor of New Testament, Emeritus, Princeton Theological Seminary'Lee Strobel asks the questions a tough-minded skeptic would ask. His book is so good I read it out loud to my wife evenings after dinner. Every inquirer should have it.' Phillip E. Johnson, Law Professor, University of California at Berkeley",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The story of Dartmouth",
        "Authors": "By Wilder Dwight Quint",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "30.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1914"
        }
    },
    {
        "Title": "A Life of Wholeness: Reflections on Abundant Living",
        "Authors": "By Raber, Ann",
        "Description": "",
        "Category": " Social Science , Sociology of Religion",
        "Publisher": "Herald Pr",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Green Mansions: A Romance of the Tropical Forest (Dover Books on Literature and Drama)",
        "Authors": "By Hudson, W. H.",
        "Description": "The curious call of an unseen bird lures a young European explorer deeper and deeper into the jungle, where he encounters the source of the siren song — a lovely, half-wild girl with mysterious powers. Thus begins the romance between Abel, a revolutionary hiding among an Indian tribe in the Venezuelan rainforest, and Rima, who speaks the languages of birds and longs to return to the land of her birth to be reunited with others of her kind.Written by a British naturalist with a deep love and knowledge of wilderness areas, the richly colored tale transports readers to the lush atmosphere of the Amazonian outback. Originally published in 1904, this haunting classic offers a narrative of lyric beauty as well as a fascinating link between nineteenth-century Romanticism and modern environmentalism.",
        "Category": " Literary Criticism , Drama",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2014"
        }
    },
    {
        "Title": "The Hormone of Desire: The Truth About Testosterone, Sexuality, and Menopause",
        "Authors": "By Rako, Susan",
        "Description": "This is the book you've been hearing about! Dr. Susan Rako has brought her groundbreaking message about the miraculous benefits of testosterone--the female hormone--to women and physicians around the world via Oprah!, Dateline NBC, the New York Times, the Congress on Women's Health, and the Today show, among others.         Dr. Rako is at the forefront of the research into testosterone replacement therapy, educating women and their doctors about the essential role testosterone plays in a woman's sexual and physical well-being.         Millions of women experience a traumatic loss of sexual desire during menopause. Dr. Rako's breakthrough research has brought to light the fact that the female body produces significant amounts of testosterone that are crucial to the healthy functioning of every woman's libido--linking decreased testosterone levels at the onset of menopause to diminished sex drive--as well as to the health of her bones and heart.        In this revised and updated edition, Dr. Rako introduces crucial new information that points to the need for adequate levels of testosterone as a key factor in protecting women from heart attack and stroke. The Hormone of Desire has become the standard-bearer for a new age of women's health, giving women and their doctors the opportunity to make informed decisions.",
        "Category": " Family & Relationships , Life Stages , Later Years",
        "Publisher": "Harmony",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "The Consultants' Survival Guide",
        "Authors": "By Lewin, Marsha D.",
        "Description": "Practical advice from Marsha D. Lewin  On success as a consultant  \"Over these decades of consulting, the most successful consultantsI've known were self-starters whose enthusiasm, individualism, anddrive did not blend with big business norms. They saw a problem,identified what needed to be done, and went on to solve it. Theydidn't wait for committees to pass on the idea and to run it up thecorporate ladder for serial approval.\"  On surviving in a cyclical economy  \"Plan ahead for the inevitable downturn in the economy. That'sclearly the way to be in the best position to be able to endure thehard times. . . . The down cycle may not be accommodating enough,however, to hit us after we've put away all the money we hadplanned on and will need for the future. That's why advanceplanning strategies must be supplemented by strategies to cope withan existing economic peril. And, once you've made it through thedangerous times, you'll want to evaluate your situation to ensurethat you adjust your strategies from survival mode to those thatenable you to plan ahead until the next threat.\"  On strategy  \"Strategies are fundamental mental and emotional underclothesvisible only to you and yours. . . . Our strategic plan is themooring, the underpinning that we use as our target for the tacticswith which we deal in our daily lives.\"  On controlling expenses  \"I emphasize reviewing your expenses periodically becausesituations change, and pricing of various options changes as well.If you make decisions on a never-again basis, you might find youare paying way too much for the basic services and you are merelycausing yourself to work harder to stay in the same place.\" -- fromThe Consultant's Survival Guide  When businesses, government agencies, and other organizations arefaced with problems they can't solve on their own, they turn toyou, the management consultant, for expertise, perspective, andrational solutions. But what happens when your business isthreatened by forces you can't control? Who helps you put yourproblems in perspective, analyze your situation, and find a remedy?Is there a consultant's consultant? There is now!  In her thirty years as a management consultant, Marsha D. Lewin hasseen it all--the booms, the busts, the endless uncertainties. Sheknows that some consultants ride out the tough times with relativeease, while others, equally talented, are quickly overwhelmed. InThe Consultant's Survival Guide she reveals 14 strategies that willkeep your consulting practice going through good times and bad, andshe offers specific tactics you can use to make sure yourstrategies succeed. You'll learn how to: * Cut expenses in hard times without undercutting the quality ofyour services * Keep your fees up and your clients smiling * Avoid giving away the store when writing a proposal * Ensure that your work produces a tangible result for clients * Use downtime to build up your business * Expand the geographical perimeters of your client base * Market your services without spending a dime * Develop and maintain a reputation as a competent, conscientious,reliable consultant  Many of the strategies and tactics you'll discover in this bookwill help boost your profits in any business climate. Others arerules to live by that should influence every action of yourprofessional life. All are practical steps that you can implementeasily to make your practice stronger, more profitable, and morefit for survival--starting today!",
        "Category": " Business & Economics , Consulting",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Where Angels Fear to Tread (Vintage Classics)",
        "Authors": "By Forster, E. M.",
        "Description": "\"Let her go to Italy!\" he cried. \"Let her meddle with what she doesn't understand! Look at this letter! The man who wrote it will marry her, or murder her, or do for her somehow. He's a bounder, but he's not an English bounder. He's mysterious and terrible. He's got a country behind him that's upset people from the beginning of the world.\"When a young English widow takes off on the grand tour and along the way marries a penniless Italian, her in-laws are not amused. That the marriage should fail and poor Lilia die tragically are only to be expected. But that Lilia should have had a baby -- and that the baby should be raised as an Italian! -- are matters requiring immediate correction by Philip Herriton, his dour sister Harriet, and their well-meaning friend Miss Abbott.In his first novel, E. M. Forster anticipated the themes of cultural collision and the sterility of the English middle class that he would develop in A Room with a View and A Passage to India. Where Angels Fear to Tread is an accomplished, harrowing, and malevolently funny book, in which familiar notions of vice and virtue collapse underfoot and the best intentions go mortally awry.",
        "Category": " Fiction , Classics",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Hinds' Feet on High Places",
        "Authors": "By Hurnard, Hannah",
        "Description": "With over 2 million copies sold, Hinds’ Feet on High Places remains Hannah Hurnard’s best known and most beloved book: a timeless allegory dramatizing the yearning of God’s children to be led to new heights of love, joy, and victory. In this moving tale, follow Much-Afraid on her spiritual journey as she overcomes many dangers and mounts at last to the High Places. There she gains a new name and is transformed by her union with the loving Shepherd. Included in this special edition (February 2009 release) is Hannah Hurnard’s own account of the circumstances that led her to write Hinds’ Feet, and a brief autobiography. Special edition also features a new cover design.",
        "Category": " Fiction , Christian , Classic & Allegory",
        "Publisher": "Tyndale Momentum",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1979"
        }
    },
    {
        "Title": "Yellowstone on Fire!",
        "Authors": "By Ekey, Robert, Bellinghausen, Pat, Mayer, Larry (PHT), Zellar, Bob (PHT), and Woodcock, James (PHT)",
        "Description": "",
        "Category": " Photography , Subjects & Themes , Regional",
        "Publisher": "Billings Gazette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "It's a Small World (Disney's Fun to Learn Series)",
        "Authors": "By Disney",
        "Description": "",
        "Category": "",
        "Publisher": "Advance Pub Llc",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "The Last Time I Saw Mother",
        "Authors": "By Chai, Arlene J.",
        "Description": "\"My mother never writes. So when the mail arrived that day, I was not expecting to find a letter from her. There was no warning.\"Between generations of women, there are always secrets--relationships kept hidden, past events obscured, true feelings not spoken. But sometimes the truth is so primal it must be told. Now, with haunting lyricism and emotional clarity, Arlene Chai has written an exquisite novel about a family of women who break their silence. At the center of The Last Time I Saw Mother is the singular story of a woman who suddenly learns she is not who she thinks she is.Caridad is a wife and mother, a native of the Philippines living in Sydney, Australia. Out of the blue Caridad's mother summons her home. Although she is not ill, Thelma needs to talk to her daughter -- to  reveal a secret that has been weighing heavily on her for years.It is a tale that Caridad in no way suspects. She stopped asking questions about the past long ago; her mother's constant reluctance to answer finally subdued her curiosity. Now, it is through the words of Thelma, her aunt Emma, and her cousin Ligaya, that Caridad will learn the startling truth and attempt to recapture what has been lost to her. Arlene Chai tells their versions of the story in their own voices, each one distinct, moving, and magical. As each woman tells her part of their family's hidden history, Caridad hears at last the unspoken stories--the joys and sorrows that her parents kept to themselves, and the never forgotten tragedy of the war years, when Japan's brutal occupation and civilian deprivations helped destroy a country and its history. The Last Time I Saw Mother is about mothers and daughters. It is about a cultural identity born of Spanish, Chinese, and Filipino influence. And it is about the healing power of truth. Arlene Chai is one of the most stunning new novelists in years. She takes us to a place we have never been before.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Liability: The Legal Revolution and Its Consequences",
        "Authors": "By Huber, Peter W.",
        "Description": "This controversial book describes the transformation of modern tort law since the 1960s, and shows how the dramatic increase in liability lawsuits has had an adverse effect on the safety, health, the cost of insurance, and individual rights.",
        "Category": " Law , Liability",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "Where Do Kisses Come From? (Little Golden Book)",
        "Authors": "By Fleming, Maria and Kinnealy, Janice (ILT)",
        "Description": "This adorable and delightful picture book is an ode to the strongest of bonds—the love from a parent. The winner of the 2001 Golden Books Golden Award, Where Do Kisses Come From is illustrated with family scenes of cuter-than-cute animals expressing their affection for their little ones.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "The Three Little Javelinas (Reading Rainbow Book)",
        "Authors": "By Harris, Jim (ILT) and Lowell, Susan",
        "Description": "Everyone knows the story of the three little pigs, but now you're going to meet the three little javelinas (pronounced ha-ve-LEE-nas)-loveable, wild, southwestern cousins of pigs. Living in homes built out of tumbleweeds and saguaro ribs (from the fallen giant cacti), the first two javelinas are soon running from the hungry coyote, who had hoped to eat them with red chile sauce. And where do they go for shelter? Why, to their wise sister's house, made strong with adobe bricks. This clever and humorous tale is sure to delight children of all ages, especially those familiar with the Southwest. Dressed in cowboy duds and prepared for life in the rugged desert, these characters are more than any coyote bargained for.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Adaptations",
        "Publisher": "Cooper Square Publishing Llc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Little Beauties: A Novel",
        "Authors": "By Addonizio, Kim",
        "Description": "The lives of three characters -- an obsessive-compulsive, a pregnant teenager, and the teen's unborn child -- come together in National Book Award finalist and Pushcart Prize winner Kim Addonizio's unsparingly funny and transcendent debut novel.   Diana McBride, a thirty-four-year-old former child pageant contender, now works in a baby store in Long Beach. Between dealing with a catastrophic haircut, the failure of her marriage, and phone calls from her alcoholic mother, Diana has gone off her OCD medication and is trying to cope via washing and cleaning rituals. When pregnant teenager Jamie Ramirez enters the store, Diana's already chaotic world is sent spinning.   Jamie can't stand being pregnant. She can't wait to get on with her normal life and give the baby up for adoption. But her yet-to-be-born daughter, Stella, has a fierce will and a destiny to fulfill. And as the magical plot of Little Beauties unfolds, these three characters' lives become linked in ever more surprising ways.   With a poet's ear for fresh, evocative language and a deft humor that exposes her characters' foibles, Addonizio perfectly captures the messiness and unexpected beauty of life.",
        "Category": " Fiction , Medical",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "This House Is Made of Mud/Esta Casa Esta hecha de lodo (Rise and Shine) (English, Multilingual and Spanish Edition)",
        "Authors": "By Buchanan, Ken and Tracy, Libba (ILT)",
        "Description": "Chosen by Arizona Governor Janet Napolitano as a gift to every first grader in the state, this story describes the beauty of the Sonoran Desert and a family whose lives are intertwined with the environment and the home they make from adobe.",
        "Category": " Juvenile Nonfiction , Foreign Language Study , Spanish",
        "Publisher": "Cooper Square Publishing Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "The Mayo Clinic Williams-Sonoma Cookbook",
        "Authors": "By Carroll, John Phillip",
        "Description": "",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Respectful rehabilitation: Answers to your questions about old buildings",
        "Authors": "By National Park Service",
        "Description": "",
        "Category": "",
        "Publisher": "Preservation Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Now That You Know: A Parents' Guide to Understanding Their Gay and Lesbian Children, Updated Edition",
        "Authors": "By Fairchild, Betty and Hayward, Nancy",
        "Description": "Now updated with new material on AIDS and support groups, this “completely non-judgmental, very informative, and extremely effective book” (Library Journal)is a standard reference for parents of gays and lesbians.",
        "Category": " Social Science , LGBT Studies , Gay Studies",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Buddhist Women on the Edge: Contemporary Perspectives from the Western Frontier (Io Series)",
        "Authors": "By Dresser, Marianne (EDT)",
        "Description": "As Buddhism is assimilated into the West, it is imperative that women reshape its patriarchal structures and carve out a fully legitimate, empowering position for themselves. Marianne Dresser brings together the likes of Pema Chodron, Tsultrim Allione, and bell hooks, 30 women in all, who are doing just that. Writers, nuns, scholars, priests--even a martial arts master and a private investigator--discuss women in Buddhism in a range of essays. Several pieces question the suppression of emotion required for selflessness, appealing to the undeniable reality of day-to-day living. Others discuss their experiences as women in Buddhism, whether as nuns or as lay practitioners. Still others address the history of women in Buddhism, racial questions, meditation, poetry, compassion, social activism, and sexual orientation. Most of these writers have been in Buddhism for two or three decades and offer a wealth of experience and insights, targeted at women readers but no less valuable to men.",
        "Category": " Religion , Buddhism , General",
        "Publisher": "North Atlantic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Terrorism and the Media",
        "Authors": "By Nacos, Brigitte Lebens",
        "Description": "Over the last fifteen years, incidents of anti-American terrorism have become increasingly common. Until recently, however, Americans believed that such violent acts would not occur on American soil. The 1993 bombing of the World Trade Center in New York City, the epicenter of American finance, was a rude awakening.Terrorism and the Media comes to readers at a crossroad in American history, when U.S. national security experts anticipate more acts of international terrorism at home and abroad.The author contends that terrorists are very successful in exploiting the vital link between the news media, public opinion, and decision-making - a pattern which might be called a calculus of violence. Terrorism works because media coverage of such incidents influence the American public to support government responses that protect the victims of terrorism, most of all hostages, at the expense of the national interest. Moreover, presidents and other high-level officials tend to follow public opinion.Written in a lively, journalistic style, the book is based on scholarly research of such shocking incidents as the Iranian hostage crisis, the hijackings of the Achille Lauro and TWA Flight 847, and the bombings at Rome airport and on Pan Am Flight 103. In the process, the author casts a critical eye on the practices of such media giants as The CBS Evening News and The New York Times.Terrorism and the Media includes an assessment of the World Trade Center bombing and considers the similarities and differences between terrorism inside and outside a targeted country.This first book to focus exclusively on the consequences of terrorism against the United States will be essential reading for politicians, journalists, and other professionals who confront these issues directly. It will be equally informative for the general reader interested in terrorist groups and the immense problems they cause even for the most powerful nation in the world.",
        "Category": " Political Science , Terrorism",
        "Publisher": "Columbia University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Old Turtle",
        "Authors": "By Wood, Douglas and Chee, Cheng-Khee (ILT)",
        "Description": "All of nature argues about the forms of God, so people are sent as a reminder of all that God is, although they do not seem to understand the message themselves.",
        "Category": " Juvenile Fiction , Religious , General",
        "Publisher": "Pfeifer - Hamilton",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "My Body, My Self for Boys: The \"What's Happening to My Body?\" Workbook for Boys",
        "Authors": "By Madaras, Lynda and Madaras, Area",
        "Description": "A fact-filled and fun workbook created especially for 8- to 15-year-old boys as the companion to The \"What's Happening To My Body?\" Book for Boys. Packed with drawings, cartoons, games, checklists, quizzes, and innovative exercises, this helpful workbook includes special sections on the body, body image, height, weight, growing size and shape, hair, voice changes, perspiration, pimples, reproductive organs, sexuality, emotional problems of puberty, diet, and health.",
        "Category": "",
        "Publisher": "Newmarket Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "What to Listen for in Music",
        "Authors": "By Copland, Aaron",
        "Description": "",
        "Category": "",
        "Publisher": "New American Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "Wrinkles in Time",
        "Authors": "By Davidson, Keay and Smoot, George",
        "Description": "In April 1992, a discovery was made that changed the way we view the world. Dr. George Smoot, distinguished cosmologist and adventurer, whose quest for cosmic knowledge had taken him from the Brazilian rain forest to the South Pole unveiled his momentous discovery, bringing to light the very nature of the universe. For anyone who has ever looked up at the night sky and wondered, for anyone who has ever longed to pull aside the fabric of the universe for a glimpse of what lies behind it. Wrinkles in Time is the story of Smoot's search to uncover the cosmic seeds of the universe.Wrinkles in Time is the Double Helix of cosmology, an intimate look at the inner world of men and women who ask. \"Why are we here?\" It tells the story of George Smoot's dogged pursuit of the cosmic wrinkles in the frozen wastes of Antarctica, on mountaintops, in experiments borne aloft aboard high-altitude balloons, U-2 spy planes, and finally a space satellite.Wrinkles in Time presents the hard science behind the structured violence of the big bang theory through breathtakingly clear, lucid images and meaningful comparisons. Scientists and nonscientists alike can follow with rapt attention the story of how, in a fiery creation, wrinkles formed in space ultimately to become stars, galaxies, and even greater delicate structures. Anyone can appreciate the implications of a universe whose end is written in its beginnings - whose course developed according to a kind of cosmic DNA, which guided the universe from simplicity and symmetry to ever-greater complexity and structure.As controversial as it may seem today, Wrinkles in Time reveals truths that, in an earlier century, would have doomed its proclaimers to the fiery stake. For four thousand years some people have accepted the Genesis account of cosmic origin; for most of this century, scientists debated two rival scientific explanations known as the steady state and big bang theories. And now, Wrinkles in Time tells what really happened.",
        "Category": " Science , Physics , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Science Through The Microscope",
        "Authors": "By Shooting Star Press",
        "Description": "",
        "Category": "",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Spirit of Writing: Classic and Contemporary Essays Celebrating the Writing Life (New Consciousness Reader)",
        "Authors": "By Waldman, Mark Robert (EDT)",
        "Description": "A collection of essays by such notable authors as Joseph Campbell, Gail Godlwin, Janet Fitch, Anne Lamott, and Octavio Paz shares their thoughts on what it means to be a writer, from the difficulty of creating a first draft to the mystery and language of words. Original.",
        "Category": " Literary Collections , General",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "The Golden Calves",
        "Authors": "By Auchincloss, Louis",
        "Description": "The New York art world provides the setting for public and private ranges of commitment and greed, idealism and venality, selfishness and yearning, and dedication and ambition",
        "Category": " Fiction , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Mayo Clinic on Arthritis: Conquering the Pain and Leading an Active Life",
        "Authors": "By Mayo Clinic (COR) and Hunder, Gene G. (EDT)",
        "Description": "",
        "Category": " Medical , Clinical Medicine",
        "Publisher": "Mayo Clinic Foundation",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Education Myths: What Special Interest Groups Want You to Believe About Our Schools--And Why It Isn't So",
        "Authors": "By Greene, Jay P., Forster, Greg, and Winters, Marcus A.",
        "Description": "In Education Myths, Jay Greene takes on the conventional wisdom and closely examines eighteen myths advanced by the special interest groups dominating public education. In addition to the money myth, the class size myth, and the teacher pay myth, Greene debunks the special education myth (special ed programs burden public schools), the certification myth (certified or more experienced teachers are more effective in the classroom), the graduation myth (nearly all students graduate from high school), the draining myth (choice harms public schools), the segregation myth (private schools are more racially segregated), and several more.",
        "Category": " Education , Educational Policy & Reform , General",
        "Publisher": "Rowman & Littlefield Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Battles:: A Concise Dictionary",
        "Authors": "By Hogg, Ian V.",
        "Description": "Over 500 crucial battles from earliest times to contemporary guerrilla struggles are described in detail. Based on new research, each entry contains all relevant facts and figures. Not only are events and their participants provided, but the importance of the battle is also explained. Well organized and providing a rich mixture of chronologies, quotes, and biographies, Battles is both a supremely useful reference and an engrossing introduction to the details of military history. Historians, military buffs, writers, editors, and students will appreciate this handy, affordable resource.",
        "Category": " Young Adult Nonfiction , History , Military & Wars",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "The Galapagos Islands: The Essential Handbook for Exploring, Enjoying & Understanding Darwin's Enchanted Islands",
        "Authors": "By Stephenson, Marylee",
        "Description": "Briefly describes each island, and offers advice on observing the native wildlife",
        "Category": " Travel , Europe , Greece",
        "Publisher": "Mountaineers Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Middle of Everywhere: The World's Refugees Come to Our Town",
        "Authors": "By Pipher, Mary Bray",
        "Description": "Over the past decade, Mary Pipher has helped us understand our family members. Reviving Ophelia did for our teenage daughters what Another Country did for our aging parents. Now, Pipher connects us with our greater family--the human family.In cities and towns all over the country, refugees arrive daily. Lost Boys from Sudan, survivors from Kosovo, families fleeing Afghanistan and Vietnam: they come with nothing but the desire to experience the American dream. Their endurance in the face of tragedy and their ability to hold on to the essential  virtues of family, love, and joy are a tonic for Americans who are now facing crises at home. Their stories will make you laugh and weep--and give you a deeper understanding of the wider world in which we live.The Middle of Everywhere moves beyond the headlines, into the hearts and homes of refugees from around the world. Her stories bring to us the complexity of cultures we must come to understand in these times.Harcourt is donating a portion of the proceeds from this book to the Pipher Refugee Relief Fund of the Lincoln Action Project.",
        "Category": " Social Science , Emigration & Immigration",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Books That Made the Difference:  What People Told Us",
        "Authors": "By Gordon Sabine, Patricia Sabine",
        "Description": "",
        "Category": "",
        "Publisher": "Library Professional Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Eaglebait",
        "Authors": "By Coryell, Susan",
        "Description": "A shy, unpopular fourteen-year-old, taunted and bullied by his classmates for years, is excited and grateful when an exchange teacher from Germany takes an interest in his scientific abilities and he begins to blossom for the first time in his life, although he begins to feel increasingly uneasy when his teacher expects total dedication to science to the exclusion of family and friends.A shy, unpopular fourteen-year-old, taunted and bullied by his classmates for years, is excited and grateful when an exchange teacher from Germany takes an interest in his scientific abilities",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Harcourt Childrens Books",
        "Price Starting With ($)": "9.38",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Kittens: Why They Do What They Do",
        "Authors": "By Jones, Buck (ILT) and Milne, Penelope A.",
        "Description": "Explores the life of kittens and why they engage in certain behaviors, including climbing drapes, kneading, eating bugs, hiding in little spaces, and eating houseplants.",
        "Category": " Pets , Cats , General",
        "Publisher": "Lumina Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Setting Up a Freshwater Aquarium: An Owner's Guide to a Happy Healthy Pet",
        "Authors": "By Skomal, Gregory",
        "Description": "Greg Skomal is a fish expert who works on Martha's Vineyard. Co-author of the goldfish book in this series, here he tells readers how to set up, maintain and raise beautiful freshwater fish.",
        "Category": " Pets , Fish & Aquariums",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Needleplay",
        "Authors": "By Moffat, Gwen",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Charles Scribner's",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1975"
        }
    },
    {
        "Title": "If I Lived Alone: Featuring Jim Henson's Sesame Street Muppets",
        "Authors": "By Michaela Muntean",
        "Description": "A young family member ponders the pros and cons of living alone.",
        "Category": "",
        "Publisher": "Western Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Attacks on the Press in 1997: A Worldwide Survey (Attacks on the Press Series)",
        "Authors": "By Roberts, Gene (FRW), Orme, William A., Jr. (INT), Chasan, Alice (EDT), and Simon, Joel (CON)",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Committee to Protect",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The View from Saturday",
        "Authors": "By Konigsburg, E. L.",
        "Description": "HOW HAD MRS. OLINSKI CHOSEN her sixth-grade Academic Bowl team? She had a number of answers. But were any of them true? How had she really chosen Noah and Nadia and Ethan and Julian? And why did they make such a good team? It was a surprise to a lot of people when Mrs. Olinski's team won the sixth-grade Academic Bowl contest at Epiphany Middle School. It was an even bigger surprise when they beat the seventh grade and the eighth grade, too. And when they went on to even greater victories, everyone began to ask: How did it happen? It happened at least partly because Noah had been the best man (quite by accident) at the wedding of Ethan's grandmother and Nadia's grandfather. It happened because Nadia discovered that she could not let a lot of baby turtles die. It happened when Ethan could not let Julian face disaster alone. And it happened because Julian valued something important in himself and saw in the other three something he also valued. Mrs. Olinski, returning to teaching after having been injured in an automobile accident, found that her Academic Bowl team became her answer to finding confidence and success. What she did not know, at least at first, was that her team knew more than she did the answer to why they had been chosen. This is a tale about a team, a class, a school, a series of contests and, set in the midst of this, four jewel-like short stories -- one for each of the team members -- that ask questions and demonstrate surprising answers.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "The kitten's secret (Wonder books)",
        "Authors": "By Gossett, Margaret",
        "Description": "",
        "Category": "",
        "Publisher": "wonder books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1950"
        }
    },
    {
        "Title": "Hansel & Gretel: (A Derrydale Classic Fairy Tale)",
        "Authors": "By Brown, Kay and Embleton, G. A.",
        "Description": "A retelling of the tale of two children, lost in the woods, who came upon a gingerbread house inhabited by a wicked witch.",
        "Category": " Social Science , General",
        "Publisher": "Derrydale Books/Crown Publishers",
        "Price Starting With ($)": "16.17",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "Midnight Oil",
        "Authors": "By Pritchett, V. S.",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Interpreting Jesus (Introducing Catholic theology)",
        "Authors": "By OCollins, Gerald",
        "Description": "",
        "Category": " Religion , Christian Theology , Christology",
        "Publisher": "Paulist Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Mother Wit, a Feminist Guide to Psychic Development (Crossing Press Feminist Series,)",
        "Authors": "By Mariechild, Diane",
        "Description": "",
        "Category": "",
        "Publisher": "The Crossing Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Parker's Wine Buyer's Guide 6th Edition: The Complete, Easy-to-Use Reference on Recent Vintages, Prices, and Ratings for More Than 8,000 Wines from All the Major Wine Regions",
        "Authors": "By Parker, Robert M., Jr. and Rovani, Pierre-Antoine",
        "Description": "Thoroughly revised and updated, this sixth edition of the Parker's Wine Buyer's Guide has been eagerly awaited by seasoned collectors and occasional drinkers alike. No one wants to waste his or her precious dollars on an unenjoyable bottle, and with Parker's advice in hand, no one ever will.Employing his famous 100-point rating system and copious tasting notes, Parker evaluates more than 8,000 wines of recent vintage from all the major wine-producing regions of the world. More than 3,000 specific growers and producers from the world's leading viticultural areas are evaluated separately, and Parker's independence from the trade allows him to be completely honest in his opinions.This latest edition has been revised, updated, and expanded to offer increased coverage of Italy and Australia, while continuing to provide the most extensive and authoritative reviews in the world of the wines of all regions covered previouslyIn addition to the valuable ratings information, Parker's Wine Buyer's Guide includes all the information today's consumer needs in order to select the perfect bottle, store it, spot a badly stored and abused bottle, and find the best wine values. Quite simply, Parker's Wine Buyer's Guide is the indispensable resource on wine from America's most knowledgeable and influential authority on the subject.",
        "Category": " Cooking , Reference",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.46",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Toward a 21st Century Health System: The Contributions and Promise of Prepaid Group Practice",
        "Authors": "By Enthoven, Alain C. (EDT), Tollen, Laura A. (EDT), and Roper, William L. (FRW)",
        "Description": "Toward a 21st Century Health System is a collection of thoughtful analyses that explore a key element of the health care delivery system¾physician group practices. Edited by policy experts Alain Enthoven and Laura Tollen, and written by a blue ribbon panel of health policy scholars and leaders including Stephen Shortell, Hal Luft, Donald Berwick, James Robinson, and Helen Darling, this resource addresses a variety of topics, including Organized delivery systemsQuality of care in prepaid group practice versus other types of managed careThe role of physician leadership and culture in group practicePrepaid group practice and the formation of national health policyThis comprehensive resource also covers such topics as pharmacy benefit management, technology assessment, health services research, and employer purchasing of benefits– all as they relate to prepaid group practice.",
        "Category": " Medical , Public Health",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Chasing After Annie",
        "Authors": "By Sharmat, Marjorie Weinman and Simont, Marc",
        "Description": "When Annie Alpert's dog, Fritz, disappears, Richie Carr, who has been trying to gain Annie's attention, replaces him with a look-alike dog",
        "Category": " Juvenile Fiction , General",
        "Publisher": "HarperCollins Children's Books",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1981"
        }
    },
    {
        "Title": "The Deadly Embrace: A Novel of World War II",
        "Authors": "By Mrazek, Robert J.",
        "Description": "A richly woven page-turner follows a young American woman to war-torn England as she struggles to safeguard the Allies' most important intelligence secrets  When Second Lieutenant Elizabeth \"Liza\" Marantz's train pulls into London's Victoria Station, the city's fabled streets are aflame in the aftermath of a massive Luftwaffe bombing attack. In London to join the staff of SHAEF (Supreme Headquarters Allied Expeditionary Force), Liza is ready to keep D-Day plans away from the German forces-even if it means her life.  Paired with former New York homicide detective Major Sam Taggart distractions begin to pile up almost immediately when two of Liza's co-workers, both mistresses of high- ranking generals, suspiciously turn up dead. As Liza and Taggart trek from the blitzkrieg-ravaged London to vast, elegant country estates, it becomes clear that more than one conspiracy is afoot-and that the very success of the war may rest in their hands. Crackling with rich dialogue and white-knuckle suspense, The Deadly Embrace showcases Robert J. Mrazek's remarkable gift for storytelling and transports readers to a fascinating time in world history.",
        "Category": " Fiction , Historical",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Editing your newsletter: A guide to writing, design, and production",
        "Authors": "By Beach, Mark",
        "Description": "",
        "Category": "",
        "Publisher": "Coast to Coast Books",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Divorce Handbook",
        "Authors": "By Friedman, James T.",
        "Description": "Provides practical information regarding the dissolution of a marriage, lawyer selection, legal fees, child custody, alimony and monetary settlements, and court and discovery procedures",
        "Category": " Family & Relationships , Divorce & Separation",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Wisdom of the Millennium (Special Occasions Book)",
        "Authors": "By Exley, Helen",
        "Description": "",
        "Category": " Social Science , Sociology , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "An Army Wife's Cookbook",
        "Authors": "By Grierson, Alice Kirk",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Western Natl Parks Assoc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1972"
        }
    },
    {
        "Title": "What Your Sixth Grader Needs to Know: Fundamentals of a Good Sixth-Grade Education (Core Knowledge Series : Resource Books for Grades One Through Six,)",
        "Authors": "By Hirsch, E. D. (EDT)",
        "Description": "A supplementary educational guide for parents, children, and teachers, the sixth volume in the popular series inspired by the best-seller Cultural Literacy includes thought-provoking sections on American Civilization and Life Science. Original.",
        "Category": " Education , Home Schooling",
        "Publisher": "Delta",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Success in School: Building on Biblical Principles",
        "Authors": "By Caruana, Vicki",
        "Description": "",
        "Category": "",
        "Publisher": "Focus Pub",
        "Price Starting With ($)": "6.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "How Do You Go to the Bathroom in Space?",
        "Authors": "By Pogue, William R.",
        "Description": "Introducing young readers to the fascinating technologies of the space program, a book by a USAF Thunderbirds astronaut answers such questions as \"What does it feel like to be weightless?\" and \"How do you scratch your nose?\" Original.",
        "Category": "",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "New Father Book: What Every New Father Needs to Know to Be a Good Dad",
        "Authors": "By Better Homes and Gardens Books (COR), Feinstein, Alice (EDT), Horn, Wade F., and Rosenberg, Jeffrey",
        "Description": "The perfect companion to the Better Homes and Gardens New Baby Book.A man's guide for the most important role he'll ever take on—being a dad.Tells how children need their fathers for a type of nurturing and education that only a father can give.Practical tips for fathers on everything from how to show love and provide discipline to how to help children with health and emotional problems.Special sections for single dads and stepdads.A man's step-by-step guide to his partner's pregnancy.How to find time to spend with kids and tips on how to get the most out of this time.Explains and encourages the different parenting styles for fathers and mothers.Written by Wade F. Horn, Ph.D., director of the National Fatherhood Initiative and former U.S. Commissioner of Children, Youth, and Families and Jeffrey Rosenberg, M.S.W., media relations director of the National Fatherhood Initiative.Black and white photos of fathers and their children.",
        "Category": " Family & Relationships , Parenting , Fatherhood",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The Dictionary of Cultural Literacy",
        "Authors": "By Hirsch, E. D., Kett, Joseph F., and Trefil, James",
        "Description": "A national bestseller, The Dictionary of Cultural Literacy has been widely acclaimed for identifying and defining the core body of knowledge that no literate American should be without.Now in this newly revised and updated edition, the authors provide a comprehensive look at cultural literacy for the nineties. New entries reflect suggestions from hundreds of readers. The dictionary takes into account the growing consensus over the specifics of multiculturalism, the political and geographic changes in the world, and the new ideas and terms that flow constantly from scientific research and technological development.Twenty-three sections, each alphabetically arranged, cover every major area of knowledge. Within each section, hundreds of individual entries identify ideas, events, and individuals, explaining their significance in our culture and placing them in context. More than 250 maps, charts, and illustrations provide information that cannot be conveyed by words alone. A complete index enables quick reference to any topic.The Dictionary of Cultural Literacy challenges us to find out more about what we know and helps us make sense of what we read, hear, and learn. It is a \"must have\" book for every home.",
        "Category": "",
        "Publisher": "Houghton, 1993.",
        "Price Starting With ($)": "7.61",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Investments: An Introduction (The Dryden Press Series in Finance)",
        "Authors": "By Mayo, Herbert B.",
        "Description": "",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Dryden Pr",
        "Price Starting With ($)": "7.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "World's End (Contemporary American fiction)",
        "Authors": "By Boyle, T.C.",
        "Description": "The loss of a leg in a motorcycle accident takes Walter Van Brunt on an exploratory journey to discover his family's legacy, beginning with his father and stretching back to his seventeenth-century ancestors",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "The Norton Sampler: Short Essays for Composition",
        "Authors": "By Cooley, Thomas",
        "Description": "",
        "Category": "",
        "Publisher": "w.w. norton",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Enough: Staying Human in an Engineered Age",
        "Authors": "By McKibben, Bill",
        "Description": "\"Passionate, succinct, chilling, closely argued, sometimes hilarious, touchingly well-intentioned, and essential.\" —Margaret Atwood, The New York Review of BooksNearly fifteen years ago, in The End of Nature, Bill McKibben demonstrated that humanity had begun to irrevocably alter and endanger our environment on a global scale. Now he turns his eye to an array of technologies that could change our relationship not with the rest of nature but with ourselves. He explores the frontiers of genetic engineering, robotics, and nanotechnology—all of which we are approaching with astonishing speed—and shows that each threatens to take us past a point of no return. We now stand, in Michael Pollan's words, \"on a moral and existential threshold,\" poised between the human past and a post-human future. McKibben offers a celebration of what it means to be human, and a warning that we risk the loss of all meaning if we step across the threshold. Instantly acclaimed for its passion and insight, this wise and eloquent book argues that we cannot forever grow in reach and power—that we must at last learn how to say, \"Enough.\"",
        "Category": " Science , Life Sciences , Genetics & Genomics",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "God and George W. Bush: A Spiritual Life",
        "Authors": "By Kengor, Paul",
        "Description": "George W. Bush has brought the question of religion back into American political life in a way that it has not been for decades. From the 2000 election through the challenges America has faced in the wake of September 11, Bush's personal faith -- and his conviction about the importance of religion in our national life -- have won him lasting admiration from the right, while attracting fury and scorn from the left.Now presidential scholar Paul Kengor, the author of the acclaimed God and Ronald Reagan, reconstructs the spiritual journey that carried George W. Bush to the White House -- from the death of his sister, which helped to shape his character, to the conversion experience that changed his life. Matching detailed new research with thoughtful analysis, God and George W. Bush is the definitive look at the spiritual life of this American president.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Dancing at the Rascal Fair",
        "Authors": "By Doig, Ivan",
        "Description": "The central volume in Ivan Doig's acclaimed Montana trilogy, Dancing at the Rascal Fair is an authentic saga of the American experience at the turn of this century and a passionate, portrayal of the immigrants who dared to try new lives in the imposing Rocky Mountains.  Ivan Doig's supple tale of landseekers unfolds into a fateful contest of the heart between Anna Ramsay and Angus McCaskill, walled apart by their obligations as they and their stormy kith and kin vie to tame the brutal, beautiful Two Medicine country.",
        "Category": " Fiction , Literary",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "N is for Noose",
        "Authors": "By Grafton, Sue",
        "Description": "\"SMART AND SASSY\" (New York Times) P.I. Kinsey Millhone is at it again in \"N\" is for Noose—another thrilling adventure from the #1 New York Times bestselling author Sue GraftonKinsey Millhone should have done something else--she should have turned the car in the direction of home. Instead, she was about to put herself in the gravest jeopardy of her career.Tom Newquist had been a detective in the Nota Lake sheriff's office--a tough, honest cop respected by everyone. When he died suddenly, the townsfolk were saddened but not surprised: Just shy of sixty-five, Newquist worked too hard, smoked too much, and exercised too little. That plus an appetite for junk food made him a poster boy for an American Heart Association campaign. Newquist's widow didn't doubt the coroner's report. But what Selma couldn't accept was not knowing what had so bothered Tom in the last six weeks of his life. What was it that had made him prowl restlessly at night, that had him brooding constantly? Selma Newquist wanted closure, and the only way she'd get it was if she found out what it was that had so bedeviled her husband. Kinsey should have dumped the case. It was vague and hopeless, like looking for a needle in a haystack. Instead, she set up shop in Nota Lake, where she found that looking for a needle in a haystack can draw blood. Very likely, her own.\"N\" Is for Noose: a novel in which Kinsey Millhone becomes the target and an entire town seems in for the kill.\"A\" Is for Alibi\"B\" Is for Burglar\"C\" Is for Corpse\"D\" Is for Deadbeat\"E\" Is for Evidence\"F\" Is for Fugitive\"G\" Is for Gumshoe\"H\" Is for Homicide\"I\" Is for Innocent\"J\" Is for Judgment\"K\" Is for Killer\"L\" is for Lawless\"M\" Is for Malice\"N\" Is for Noose\"O\" Is for Outlaw\"P\" Is for Peril \"Q\" Is for Quarry\"R\" Is for Ricochet \"S\" Is for Silence \"T\" Is for Trespass\"U\" Is for Undertow \"V\" Is for Vengeance \"W\" Is for Wasted \"X\"",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Henry Holt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "J is for Judgement (A Kinsey Millhone Mystery, Book 10)",
        "Authors": "By Grafton, Sue",
        "Description": "The next in the Kinsey Millhone Alphabet mystery series from bestselling author Sue Grafton.\"J\" is for Jaffe: Wendell Jaffe, dead these past five years. Or so it seemed until his former insurance agent spotted him in the bar of a dusty little resort halfway between Cabo San Lucas and La Paz.\"In truth, the facts about Wendell Jaffe had nothing to do with my family history, but murder is seldom tidy and no one ever said revelations operate in a straight line. It was my investigation into the dead man's past that triggered the inquiry into my own, and in the end the two stories became difficult to separate.\"Five years ago, when Jaffe's thirty-five-foot Fuji ketch was found drifting off the Baja coast, it seemed a sure thing he'd gone overboard. The note he left behind admitted he was flat broke, his business bankrupt, his real estate gambit nothing but a huge Ponzi scheme about to collapse, with criminal indictment certain to follow. When the authorities soon after descended on his banks and his books, there was nothing left: Jaffe had stripped the lot.\"Given my insatiable curiosity and my natural inclination to poke my nose in where it doesn't belong, it was odd to realize how little attention I'd paid to my own past. I'd simply accepted what I was told, constructing my personal mythology on the flimsiest of facts.\"But Jaffe wasn't quite without assets. There was the $500,000 life insurance policy made out to his wife and underwritten by California Fidelity. With no corpse to prove death, however, the insurance company was in no hurry to pay the claim. Dana Jaffe had to wait out the statutory five years until her missing husband could be declared legally dead. Just two months before Wendell Jaffe was sighted in that dusty resort bar, California Fidelity finally paid in full. Now they wanted the truth. And they were willing to hire Kinsey Millhone to dig it up.As Kinsey pushes deeper into the mystery surrounding Wendell Jaffe's pseudocide, she explores her own past, discovering that in family matters as in crime, sometimes it's better to reserve judgment.\"J\" is for judgment: the kind we're quick to make and often quicker to regret.\"J\" Is for Judgment: Kinsey Millhone's tenth excursion into the dark places of the heart where duplicity is the governing rule and murder the too-frequent result.\"A\" Is for Alibi\"B\" Is for Burglar\"C\" Is for Corpse\"D\" Is for Deadbeat\"E\" Is for Evidence\"F\" Is for Fugitive\"G\" Is for Gumshoe\"H\" Is for Homicide\"I\" Is for Innocent\"J\" Is for Judgment\"K\" Is for Killer\"L\" is for Lawless\"M\" Is for Malice\"N\" Is for Noose\"O\" Is for Outlaw\"P\" Is for Peril \"Q\" Is for Quarry\"R\" Is for Ricochet \"S\" Is for Silence \"T\" Is for Trespass\"U\" Is for Undertow \"V\" Is for Vengeance \"W\" Is for Wasted \"X\"",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Henry Holt and Co.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Herbs (RD Home Handbooks)",
        "Authors": "By Bremness, Lesley (EDT)",
        "Description": "Describes the characteristics and uses of more than ninety herbs, offers advice on their cultivation and harvesting, and includes recipes featuring herbs",
        "Category": " Gardening , Herbs",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Management",
        "Authors": "By Daft, Richard L.",
        "Description": "",
        "Category": "",
        "Publisher": "Dryden Pr",
        "Price Starting With ($)": "8.25",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The Love Song of J. Edgar Hoover",
        "Authors": "By Friedman, Kinky",
        "Description": "Filled with adventure, passion, excitement, and a fair amount of talk about cats and puppet heads, this latest installment in the on-going saga of man's inhumanity to the English language finds New York's most cosmic private detective launched once again on an investigation that leads him far afield of both the law and the lower Manhattan loft he calls home.In The Love Song of J. Edgar Hoover, Kinky Friedman, the author, has Kinky Friedman, the detective (in real life, the two are not related), rush to the aid of a lovely young woman, only to find that he is up to his shin splints in trouble of a disconcerting kind.Soon after Polly Price hires him to find her missing husband, Kinky smells a rat. But it's not until he's been shot by the D.C. police and locked in a burning limousine by a Chicago chauffeur that he realizes he may be the one with his tail in a trap. Then, when Michael McGovern, longtime friend and loyal member of the Village Irregulars, complains first of being watched by mysterious men, then of getting threatening phone calls from a dead gangster named Leaning Jesus, and finally disappears - and along with him, the lovely Polly - Kinky comes to the only conclusion that conceivably could link these disparate events: the FBI is after him!",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Cohen Comes First and Other Cases: Stories of Controversies Before the New York Jewish Court of Arbitration",
        "Authors": "By Buchler, Samuel",
        "Description": "",
        "Category": "",
        "Publisher": "The Vanguard Press",
        "Price Starting With ($)": "47.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1933"
        }
    },
    {
        "Title": "Still Married After All These Years",
        "Authors": "By Shoebox Greeting",
        "Description": "",
        "Category": "",
        "Publisher": "Independent Publishers+group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Celebration of Hearts: A Sampler of Heart Motifs for Quilting, Patchwork and Applique",
        "Authors": "By Wells, Jean and Anderson, Marina",
        "Description": "",
        "Category": "",
        "Publisher": "C&T Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Chameleon",
        "Authors": "By Hains, Richard",
        "Description": "Jon Phillips is head bond trader at one of Wall Street's largest investment banks and lives the American dream in the heart of New York's decadent banking community. But, after years of selfishness and extravagance, he plans his exit through an unprecedented and ultimately fraudulent deal in the US government bond market. A high-ranking colleague, who sits on the bank's main board, has teamed up with a Russian financier in order to provide Jon with one of the key elements vital to the success of his ingenious scheme. The deal goes spectacularly wrong and Jon's world collapses. As the Russians desperately attempt to recover their lost millions, Jon is thrown into a deadly game of cat and mouse. From the seedy nightspots of downtown NYC to the plush yacht clubs of the Hamptons, pastoral aristocratic England, and Southern Australia's endless beaches, past lovers, new menaces, and numerous apparently accidental deaths line his trail. Jon's survival now depends on putting the past behind him and becoming a calculated predator instead of the vulnerable prey.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Beaufort Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "The Coelura",
        "Authors": "By McCaffrey, Anne",
        "Description": "",
        "Category": "",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "The Best American Mystery Stories 1999",
        "Authors": "By Penzler, Otto (EDT) and McBain, Ed (EDT)",
        "Description": "In its brief existence, THE BEST AMERICAN MYSTERY STORIES has established itself as a peerless suspense anthology. Compiled by the best-selling mystery novelist Ed McBain, this year's edition boasts nineteen outstanding tales by such masters as John Updike, Lawrence Block, Jeffery Deaver, and Joyce Carol Oates as well as stories by rising stars such as Edgar Award winners Tom Franklin and Thomas H. Cook. The 1999 volume is a spectacular showcase for the high quality and broad diversity of the year’s finest suspense, crime, and mystery writing. \"Keller's Last Refuge\" by Lawrence Block, \"Safe\" by Gary A. Braunbeck, \"Fatherhood\" by Thomas H. Cook, \"Wrong Time, Wrong Place\" by Jeffery Deaver, \"Netmail\" by Brendan DuBois, \"Redneck\" by Loren D. Estleman, \"And Maybe the Horse Will Learn to Sing\" by Gregory Fallis, \"Poachers\" by Tom Franklin, \"Hitting Rufus\" by Victor Gischler, \"Out There in the Darkness\" by Ed Gorman, \"Survival\" by Joseph Hansen, \"A Death on the Ho Chi Minh Trail\" by David K. Harford, \"An Innocent Bystander\" by Gary Krist, \"The Jailhouse Lawyer\" by Phillip M. Margolin, \"Secret, Silent\" by Joyce Carol Oates, \"In Flanders Fields\" by Peter Robinson, \"Dry Whiskey\" by David B. Silva, \"Sacrifice\" by L. L. Thrasher, \"Bech Noir\" by John Updike",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The Magic School Bus: Butterfly And The Bog Beast, The",
        "Authors": "By Cole, Joanna, Krulik, Nancy E., Thompson, Dana (ILT), Thompson, Del (ILT), and Scholastic Productions (COR)",
        "Description": "Suggesting the name of Walkersville Elementary Butterflies for the soccer team, Phoebe is teased by her classmates, who believe butterflies are far from exciting until Ms. Frizzle takes them on another wild Magic School Bus ride. Original.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Scholastic Paperbacks",
        "Price Starting With ($)": "142.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Window Treatments (Better Homes & Gardens)",
        "Authors": "By Hallam, Linda (EDT)",
        "Description": "For the do-it-yourself decorator, a basic handbook with the latest designer styles from formal to casual that allows the reader to work confidently with a seamstress or make the treatments herself.Organized in six chapters with an easy-to-understand, two-page glossary, according to type of treatment style, with a how-to technique chapter for extra help.160 full-color photographs from real homes show true-life applications with close-ups of the latest trims and detailing. Combines classic treatments with new looks for the full range of tastes and budgets. Provides solutions to common window problems.Includes budget-stretching tips on fabrics and lining, extra tips on dressing ready-made treatments for designer-looks at retail, and measuring and calculating materials.",
        "Category": " House & Home , Decorating",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Adventures of Buster Bear (Dover Children's Thrift Classics)",
        "Authors": "By Burgess, Thornton W., Kliros, Thea (ILT), Cady, Harrison, Kliros, Thea, and Cady, Harrison (ILT)",
        "Description": "When Buster Bear comes to live in the Green Forest, the amiable bully stirs up quite a commotion, for bears haven't lived in the forest for years. And sure enough, before long Buster has a series of run-ins with Little Joe Otter, Chatterer the Red Squirrel, Farmer Brown's Boy, and even a stubborn metal pail!These and other entertaining escapades are delightfully recounted in this engaging tale. Set in a timeless world of bubbling brooks, blue skies, and green groves, the story also teaches valuable lessons on the dangers of greed, pride, and insensitivity. The text, printed in large, easy-to-read type, is enhanced by six charming illustrations, based on the originals by Harrison Cady.",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Jerusalem's Heart (Zion Legacy, Bk 3)",
        "Authors": "By Thoene, Bodie and Thoene, Brock",
        "Description": "The third volume in the historical epic of modern Jerusalem continues the dramatic story of the holy city with the Israeli War for Independence in 1948. 40,000 first printing.",
        "Category": " Fiction , Religious",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Riviera puzzle",
        "Authors": "By McConnor, Vincent",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The Echo",
        "Authors": "By Walters, Minette",
        "Description": "When Billy Blake, a homeless alcoholic, turns up dead of starvation in the garage of wealthy Amanda Powell, Amanda, obsessed with her dead visitor, joins forces with cynical reporter Michael Deacon to uncover the truth. 175,000 first printing. $200,000 ad/promo.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Eating by design: The individualized food personality type nutrition plan",
        "Authors": "By Wiatt, Carrie Latt",
        "Description": "A personalized diet plan by a Hollywood nutritionist profiles twelve distinct food personality types and provides extensive meal and snack plans, shopping lists, eating-out guidelines, and several simple, low-fat recipes. 25,000 first printing. Tour.",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Discovering Your Soul's Purpose",
        "Authors": "By Thurston, Mark",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "ARE Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Rome and the Vatican",
        "Authors": "By n/a",
        "Description": "",
        "Category": " Social Science , Archaeology",
        "Publisher": "Lozzi Roma",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Final Quest",
        "Authors": "By Joyner, Rick",
        "Description": "",
        "Category": " Body, Mind & Spirit , Prophecy",
        "Publisher": "Whitaker House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Thimble Summer",
        "Authors": "By Enright, Elizabeth",
        "Description": "When Garnet finds a silver thimble in the sand by the river, she is sure it’s magical. But is it magical enough to help her pig, Timmy, win a blue ribbon on Fair Day?",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "Object Solutions: Managing the Object-Oriented Project",
        "Authors": "By Booch, Grady",
        "Description": "",
        "Category": " Computers , Programming , Object Oriented",
        "Publisher": "Addison-Wesley Professional",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Our Country: The Shaping of America from Roosevelt to Reagan",
        "Authors": "By Barone, Michael",
        "Description": "A broad account of how Americans shaped their politics through the decades since the Depression. In contrast to most contemporary political historians, Barone (senior writer,  US news and world report ) argues that Americans have more often charted their political fortunes by cultural allegiances regional, ethnic, religious, rural, and urban than by economic struggles. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " History , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Roman Epistle",
        "Authors": "By Brooks, Robert Angus",
        "Description": "",
        "Category": " Poetry , General",
        "Publisher": "Bauhan Pub",
        "Price Starting With ($)": "6.82",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Someone Going Home Late",
        "Authors": "By Jones, Daryl",
        "Description": "This poetry moves us by its simple strength and honesty, its clear-eyed vision of the world it describes. Daryl Jones could be speaking of his own poems when he says of beach agates: \"no two alike; each one / particular and isolate, a picture of something / we imagine or remember?a bird in glass, a face, / a landscape from childhood?something / the mind turns over and over / then flings up, wet and shining.\" ?Linda Pastan  Daryl Jones grew up in Rockville, Maryland, and holds degrees in English from Michigan State University. He has taught creative writing and American literature at Michigan State University and Texas Tech University where he served as chair of the Department of English. Since 1986, he has been Professor of English and Dean of the College of Arts and Sciences at Boise State University in Idaho. He is the author of The Dime Novel Western, a critical study of the popular Western novel, and numerous essays and reviews. His poems have appeared in Black Warrior Review, Carolina Quarterly, New Orleans Review, Sewanee Review, TriQuarterly, and many other journals and anthologies. In 1985, he received a Creative Writing Fellowship Grant from the National Endowment for the Arts. An earlier version of Someone Going Home Late was a finalist in the 1987 National Poetry Series Open Competition.",
        "Category": " Poetry , American , General",
        "Publisher": "Texas Tech University Press",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Karen Kepplewhite Is the World's Best Kisser",
        "Authors": "By Bunting, Eve",
        "Description": "In preparation for her thirteenth birthday party, Karen and her best friend Janet secretly study a best-selling adult book on the art of kissing.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Fat Free, Flavor Full: Dr. Gabe Mirkin's Guide to Losing Weight & Living Longer",
        "Authors": "By Mirkin, Gabe and Rich, Diana",
        "Description": "No fat with a tasty new twist! Dr. Gabe Mirkin has helped thousands of Americans lose weight and lower their cholesterol through his nationally syndicated radio talk shows and fitness newsletter. Here he presents 250 deliciously simple, meatless recipes plus a medically tested health-and-fitness plan--a must for anyone who wants to lost weight and feel better. Line drawings.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Opening Your Own Retail Store",
        "Authors": "By Taetzsch, Lyn",
        "Description": "Explains everything one needs to know about beginning and operating a small business, discussing all phases and factors of retail sales and store management",
        "Category": " Business & Economics , General",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1977"
        }
    },
    {
        "Title": "The Chosen",
        "Authors": "By Chaim Potok",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Kenya Journal",
        "Authors": "By Caputo, Robert",
        "Description": "A renowned photographer and long-time student and observer of  Africa presents his work in 116 fine color plates showing Kenya, its people, and wildlife, and writes of their lives and prospects. A charming, inviting book. Published by Elliott & Clark, 1638 R Street, NW, Suite 21, Washington, DC 20009. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Travel , Africa , General",
        "Publisher": "Elliott & Clark Pub",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "The Ultimate Maze Book",
        "Authors": "By Russo, David Anson",
        "Description": "",
        "Category": " Games , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "The Polar Express: The Journey Begins (An Early Reader)",
        "Authors": "By Van Allsburg, Chris, Richards, Kitty, Zemeckis, Robert, and Broyles, William",
        "Description": "In an easy-to-read adaptation of the movie screenplay, a magical train ride on Christmas Eve takes a boy to the North Pole to receive a special gift from Santa Claus. Original.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "SIMPLIFIED CHINESE CHARACTERS (AMERICAN) (Peng's Chinese Treasury)",
        "Authors": "By Peng, Tan Huay",
        "Description": "",
        "Category": " Foreign Language Study , Chinese",
        "Publisher": "Stone Bridge Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Cats Around the World",
        "Authors": "By Meyer, Ted",
        "Description": "\"This hilarious and irreverent book identifies the quirks and cultural nuances of dozens of countries around the world—all from the point of view of the cat. Each entry features a wonderfully illustrated cat clad in the traditional dress of the country. On the facing page, fascinating facts about the nation are offered, including the official language of the country, its location, delightful tidbits about the role of cats in their culture, an illustration of their flag, and the translation of the word cat in their native language.\"",
        "Category": " Pets , Cats , General",
        "Publisher": "Santa Monica Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    }
]