[
    {
        "Title": "Come Play with Me: Games and Toys for Creative Lovers",
        "Authors": "By Lloyd, Joan Elizabeth",
        "Description": "Author of the reader-friendly manuals Nice Couple Do and If It Feels Good now offers an exciting new look at sex--one that uses games and toys to put the fun back into the boudoir. From lace to leather, from bathtub games to bedsheet dramas, from strip poker to advanced role-playing, this groundbreaking guide shows how to use communication, temptation, and exotic props.",
        "Category": " Games , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "The Short History of a Prince: A Novel",
        "Authors": "By Hamilton, Jane",
        "Description": "Walter McCloud is a boy with dreams unlike most. Introduced as a child to the genius of Balanchine and the lyricism of Tchaikovsky, Walter has always aspired to be a dancer. As he grows older, it becomes clear that despite his desire, he lacks the talent, and he faces the painful knowledge that his more gifted friends have already surpassed him.Soon, however, that pain is overshadowed when his older brother, Daniel, finds a strange lump on his neck and Walter realizes that a happy family can change overnight. The year that follows transforms the McClouds, as they try to hold together in the face of the fearful consequences of Daniel's illness, and Walter makes discoveries about himself and his friendships that will change him forever.Decades later, after Walter has left home and returned, he must come to terms with the memories of that year, and grapple once and for all with the challenge of carving out a place for himself in this all-too-familiar world.A moving story of the torments of sexuality and the redemptive power of family and friendship, The Short History of a Prince confirms Jane Hamilton's place as a preeminent novelist of our time.",
        "Category": " Fiction , Literary",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "For Yourself: The Fulfillment of Female Sexuality (Signet)",
        "Authors": "By Barbach, Lonnie Garfield",
        "Description": "",
        "Category": " Family & Relationships , General",
        "Publisher": "New Amer Library (Mm)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Help Your Child With a Foreign Language",
        "Authors": "By Dunn, Opal",
        "Description": "Tells how to help children learn a foreign language by re-using and developing some of the techniques used to teach them their own language, and includes sample phrases for beginning French, Spanish, German, and Italian",
        "Category": " Foreign Language Study , General",
        "Publisher": "Berlitz",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Fabric Magic",
        "Authors": "By Paine, Melanie",
        "Description": "Tells how to select and use fabrics, describes different styles of shades, curtains, bedding, pillows, and furniture coverings, and shows how to make curtains and pillowcases",
        "Category": "",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "In Confidence: Moscow's Ambassador to America's Six Cold War Presidents (1962-1986)",
        "Authors": "By Dobrynin, Anatoly",
        "Description": "Anatoly Dobrynin arrived in Washington in 1962. He was only forty-three, the youngest man ever to serve as Soviet ambassador to the United States. Amazingly he remained in Washington through the presidencies of Kennedy, Johnson, Nixon, Ford, Carter, and Reagan. Dobrynin became the main back channel for the White House and the Kremlin to exchange ideas, negotiate in secret, and set up summit meetings. This arrangement became known as the confidential channel. Through this channel and his more public duties as ambassador he came to know the presidents, their most senior officials, and many members of the American establishment intimately. In Confidence is the story of those relationships.In Confidence is full of revelations that give us new insight into our own history, as well as into the saga of Soviet-American relations. To write it, Dobrynin spent months reviewing his own contemporary notes and official dispatches, as well as extensive material in the Foreign Ministry archives in Moscow. His memoir is an eyewitness document no student of the twentieth century can afford to miss.",
        "Category": " Political Science , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Girls Rule: A very special book created especially for girls (Teens & Young Adults)",
        "Authors": "By Rice, Ashley",
        "Description": "This is a book for girls. For girls who are thinkers and believers. For girls who are readers and changers and dreamers. For girls who look for rainbows and friendship. For girls who are not afraid to be different.Join one such girl, Penelope J. Miller, as she narrates this book, becomes your friend, and takes you on a journey through all the fun, craziness, and challenges of being a girl in the world. She's here with words of experience, support, advice, and a whole lot of laughs. And she's even left some space for you to write down your own thoughts, memories, wishes, and ideas.Along the path through these special pages, you'll find a shout of encouragement and a sharing of dreams for girls who know deep down that they have what it takes to achieve anything they want. You'll discover a celebration of the lives of girls -- the smiley days, the dreamy days, the giggly days, the teary days, the victorious days, and even everything in between. Because every day, in a million different ways: GIRLS RULE.",
        "Category": " Juvenile Nonfiction , Poetry , General",
        "Publisher": "Blue Mountain Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Success: One Day At A Time",
        "Authors": "By Maxwell, John C.",
        "Description": "Success One Day At A Time is the kind of book you will want to carry in your car or place at the side of your bed. Each page contains a snapshot of the daily road of an overcomer. It is the perfect gift for the new graduate as well as anyone else who wants to become all that God intended! Owning a book by John Maxwell is like having your own personal trainer cheerleader. Drawing on over twenty years of experience in training leaders, John shares not only how to succeed but the biblical reason for doing so. \"Success is knowing your purpose in life, sowing seeds that benefit others, and growing to your maximum potential,\" he says. He asserts that success is for everyone. The secret of success is found in your daily routine, springing from your dreams, vision and consistent self-discipline.",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Garden Lovers Quotations",
        "Authors": "By Exley, Helen (EDT)",
        "Description": "",
        "Category": " Reference , Quotations",
        "Publisher": "Exley Giftbooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Joys Of The Garden",
        "Authors": "By Eisen, Armand",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "When Sophie Gets Angry - Really, Really Angry… (Scholastic Bookshelf)",
        "Authors": "By Bang, Molly",
        "Description": "Category: Feelings\"Oh is Sophie ever angry now!\"Everybody gets angry sometimes. For children, anger can be very upsetting. Parents, teachers, and children can talk about it. People do lots of different things when they get angry. In this Caldecott-honor book, kids will see what Sophie does when she gets angry. What do you do?\"...Bang's double-page illustrations, vibrating with saturated colors, that reveal the drama of the child's emotions.\"-SLJ, starred review\"...an elegant and thought-provoking book for...children learning how to deal with emotions.\" -NY Times Book Review",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Scholastic Paperbacks",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Angry All the Time: An Emergency Guide to Anger Control",
        "Authors": "By Potter-Efron",
        "Description": "",
        "Category": " Self-help , Anger Management",
        "Publisher": "Fine Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Test Your Baseball Literacy",
        "Authors": "By Schmittberger, Wayne",
        "Description": "Test Your Baseball Literacy Entertaining quizzes on every facet of the Great American Game--from Shoeless Joe to Sadaharu Oh \"The questions in Test Your Baseball Literacy really test your knowledge, not just your memory. And Wayne Schmittberger's answers are even more fun than the questions!\" --Mike Shatzkin Author, The Ballplayers Packed with quizzes on baseball's history, colorful characters, statistics, legend, and lore, Test Your Baseball Literacy is a trivia treasury that will challenge the devotee and enlighten the novice. It features 500 multiple-choice questions, complete with answers that include detailed explanations and entertaining related facts. More than just the \"mosts,\" \"firsts,\" \"bests,\" and \"worsts,\" each of the 20 quizzes focuses on a particular theme, including:* Going to Extremes: streaks, both good and bad* You Be the Umpire: tricky rules questions similar to those on an umpires' school exam* Baseball Fantasies: baseball characterized in the movies and literature* Other Leagues: the minors, college, Japanese, little league, and organized \"fantasy\" leagues",
        "Category": " Sports & Recreation , Baseball , Essays & Writings",
        "Publisher": "John Wiley & Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Fatal Illusions",
        "Authors": "By Lucas, James R",
        "Description": "",
        "Category": "",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Fat Cat Sat on the Mat (I Can Read Level 1)",
        "Authors": "By Karlin, Nurit and Karlin, Nurit (ILT)",
        "Description": "Learn to read with this funny rhyming story starring a big orange tabby cat!The fat cat sat on the mat. \"Get off!\" said the rat. But the fat cat just sat. Will the rat get the fat cat off the mat?This funny, phonetic Level One I Can Read is perfect for kids learning to sound out words and sentences.",
        "Category": " Juvenile Fiction , Readers , Intermediate",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "On Bended Knee: The Press and the Reagan Presidency",
        "Authors": "By Hertsgaard, Mark",
        "Description": "Argues that Reagan's blunders and shirking of responsiblity on the part of the news media has seriously impaired the nation's ability to recognize and react to presidential faults",
        "Category": "",
        "Publisher": "Schocken",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "The Power and Passion of M. Carey Thomas",
        "Authors": "By Horowitz, Helen Lefkowitz",
        "Description": "M. Carey Thomas (1857-1935) was an extraordinary woman whose career spanned the Victorian and modern worlds.Her story is superbly told in a biography that resonates with the complicated interplay between her necessarily hidden private life and her eminently visible and successful public life as president of Bryn Mawr College, as a founder of the Johns Hopkins medical school and the Bryn Mawr School in Baltimore, as a leader in the women's suffrage movement, and as the preeminent spokeswoman for education around the turn of the century. Behind closed doors, however, Carey Thomas was by no means the \"proper Quaker daughter\" many of her contemporaries assumed her to be. She was a freethinker. She was an ardent admirer of Swinburne, Rossetti, and the Pre-Raphaelites. She was a passionate woman whose lovers were women.In rich detail and with insight and balance, Helen Lefkowitz Horowitz recounts a life lived outside the bounds of nineteenth-century convention. She shows us the child overcoming a life-threatening and disfiguring burn; the schoolgirl deciding to devote her life to scholarship - and ultimately becoming one of the first American women to study for a doctorate in Germany. We see the Cornell woman - in an age when marriage eliminated the possibility of a serious career - promising her parents to avoid all encounters with men students; the young educator outwitting college trustees to develop her dreams of a rigorous education for women. Throughout, as the book reconstructs Thomas' consciousness and her understanding of herself as a woman of passion, Horowitz provides fresh insights into emotional and sexual life in the late nineteenth and early twentieth centuries.Carey Thomas was complexity itself. She was at once visionary and narrow, warm and hard, spontaneous and calculating. She demanded everything of the world and of herself. She brought equal intensity to her professional responsibilities and her personal relations. She lived at fever pitch.Helen Horowitz has given us a brilliant portrait of the vivid and sui generis woman who - in a world that held no models for her - created herself, full scale, in the grand manner.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Knopf",
        "Price Starting With ($)": "9.88",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Thorn in My Heart (Lowlands of Scotland Series #1)",
        "Authors": "By Higgs, Liz Curtis",
        "Description": "Two brothers fight to claim one father’s blessing. Two sisters long to claim one  man’s heart.  In the autumn of 1788, amid the moors and glens of the Scottish Lowlands,  two brothers and two sisters each embark on a painful journey of discovery. Jamie  and Evan McKie both want their father Alec’s flocks and lands, yet only one brother  will inherit Glentrool. Leana and Rose McBride both yearn to catch the eye of the  same handsome lad, yet only one sister will be his bride. A thorny love triangle  emerges, plagued by lies and deception, jealousy and desire, hidden secrets and broken  promises. Brimming with passion and drama, Thorn in My Heart brings the past to vibrant  life, revealing spiritual truths that transcend time and penetrate the deepest places  of the heart.",
        "Category": " Fiction , Religious",
        "Publisher": "WaterBrook",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Diabetes Meal Planning Made Easy : How to Put the Food Pyramid to Work for You",
        "Authors": "By Warshaw, Hope S.",
        "Description": "The new Food Guide Pyramid helps make nutritious meal planning easier than ever for the person with diabetes. But it can be complicated. Diabetes Meal Planning Made Easy simplifies the concept by translating diabetes food guidelines into today's food choices.Simple, easy-to-follow chapters will help readers:understand the new food pyramidlearn all about the six food groups and how to incorporate them into a healthy dietmake smart choices when it comes to sweets, fats, and dairy productsshow smart in the grocery storemake all their meals easier by planning aheadand more Readers can't climb the pyramid without the right tools. Diabetes Meal Planning Made Easy puts all the tools anyone needs to plan a healthier diet into their hands.",
        "Category": " Cooking , Health & Healing , Diabetic & Sugar-Free",
        "Publisher": "American Diabetes Association",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Poet and the Donkey",
        "Authors": "By Sarton, May",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Sweet and Low",
        "Authors": "By Emma Lathen",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "June",
            "Year": "1975"
        }
    },
    {
        "Title": "All I Want Is Everything (Gossip Girl, 3)",
        "Authors": "By Von Ziegesar, Cecily",
        "Description": "It's Chrismastime and Blair and Serena are best friends again and up to their old tricks--partying hard and breaking hearts from Park Avenue to the Caribbean. Blair's mom and Cyrus are having their honeymoon in Salt Key. And when school lets out for the holiday, Blair, Serena, Aaron, and company head down there to blow off steam after their midterm exams. In between Pina Coladas and topless sunbathing, Blair and Serena plot revenge on super-jerk Chuck Bass. Everyone jets back to NYC for Serena's New Year's party, during which Nate and Blair may or may not finally go all the way, and Serena may or may not be discovered to be the secret fling of Hollywood's hottest young leading man.",
        "Category": " Young Adult Fiction , School & Education , Boarding School & Prep School",
        "Publisher": "Poppy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Minnie Saves the Day : The Adventures of Minnie",
        "Authors": "By Rosales, Melodye",
        "Description": "Hester Merriweather's grandmother gives her a handmade rag doll that proves to be very special indeed, in the first book of a series which includes historical background on Chicago's African-American community during the 1930s. 50,000 first printing.",
        "Category": " Juvenile Fiction , Readers , Intermediate",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Sexy Years: Discover the Hormone Connection: The Secret to Fabulous Sex, Great Health, and Vitality, for Women and Men",
        "Authors": "By Somers, Suzanne and Greene, Robert A. (FRW)",
        "Description": "Getting older can be brutal—women gain weight, lose their sex drive, experience hot  flashes, suffer memory loss, become short-tempered, find it difficult to sleep, and  on and on. It’s not so easy for men, either—they start to lose energy and stamina  as they age, too (and they have to live with women going through menopause). After  years of being thin and fit and full of energy, Suzanne herself encountered the “Seven  Dwarfs of Menopause”—Itchy, Bitchy, Sweaty, Sleepy, Bloated, Forgetful, and All-Dried-Up.  Instead of living out the rest of her life cranky, sleep-deprived, and libido-less,  Suzanne set out to discover how she could get her mind, body, and life back and banish  those pesky dwarfs for good. The result is The Sexy Years: Discover the Hormone  Connection—The Secret to Fabulous Sex, Great Health,   and Vitality, for Women and  Men. In this passionately argued and enormously practical book, Suzanne supports  her own research and experiences with the expertise of leading doctors in the field  of women’s and men’s health and sexuality to create an inspiring, accessible call-to-arms  to women to radically rethink how they approach life after fifty, and give them the  tools to turn their lives around.  Suzanne has discovered that the second half of  life has been more rewarding, fun, and purposeful than her younger years. The key  to her happiness? Taking natural bioidentical hormones. Natural hormones, which mimic  the hormones produced in our own bodies that are almost completely lost with aging,  are the answer to the symptoms of menopause that plague women. Recent findings from  the medical community show that synthetic hormone replacement therapy (HRT) may  be harmful to women—thus, thousands of women are looking for what else they can do  to alleviate their symptoms. In The Sexy Years, Suzanne comes to the rescue with  a step-by-step plan and detailed information about how women can take control of  their health, for themselves and for their men, including: • What the differences  are between synthetic and bioidentical hormones, and why bioidentical hormones help  women lose weight, reinvigorate their sex lives, and fight the symptoms of aging • How doctors do not receive adequate training about hormones and are slaves to the  pharmaceutical industry, and what questions every woman must ask her physician about  hormone replacement therapy and her health • How Suzanne turned her life around,  with information about how often she visits her doctor, blood work, what hormones  she takes, how to get these hormones, and more • What male menopause, or andropause,  is and how men can also take bioidentical hormones and regain the energy they had  in their youth • What a variety of specialists think about natural hormones, health,  and sexuality—Suzanne shares the best advice from these doctors and provides a resource  list of physicians and pharmacies With bioidentical hormone replacement therapy,  Suzanne has found the fountain of youth, the elixir that has made her feel thirty  years old again. In combination with her Somersize diet and fitness plan, which she  also writes about here, Suzanne has never felt better. The beauty of growing older,  she maintains, is that you can combine the wisdom of age with the vitality of youth.  Suzanne makes it perfectly clear how women and men can regain their zest for life  at any age. These really are the sexy years!",
        "Category": " Self-help , Aging",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Bird life",
        "Authors": "By Nicolai, Jurgen",
        "Description": "",
        "Category": "",
        "Publisher": "Putnam",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Old Age Is Always 15 Years Older Than I Am",
        "Authors": "By Voorhees, Randy",
        "Description": "Everyone has a choice about how he or she defines \"old,\" and now readers can find some of the best things ever said about the subject in Old Age is Always 15 Years Older Than I Am. This quotation collection is wise and warm, witty and wild. It includes everything from President James A. Garfield's thoughts on the spirit--and wrinkles--to Bill Cosby's musings on senility. Everyone has something to say about aging, and this book delivers the wisdom of the ages with the energizing spirit of youth!",
        "Category": " Family & Relationships , Life Stages , Later Years",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Angels Among Us",
        "Authors": "By Fearheiley, Don",
        "Description": "Gale was a strong swimmer -- but halfway across thelake she realized she couldn't make it to the other side ...Annabel and her three-year-old daughter turnedsuddenly -- and saw a car hurtling straight toward them ...Ken fell and his hunting rifle accidentally wentoff -- leaving him wounded, bleeding and alone inthe frozen woods...AND THEN THEY APPEARED!Angels do exist -- as illustrated in these moving,compelling and true contemporary accounts of ordinarypeople whose lives were touched, saved and forever afteredby the extraordinary ... by",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Etiquette- Self Confidence in the Making",
        "Authors": "By Patricia Weber Wolford",
        "Description": "",
        "Category": "",
        "Publisher": "A.B. Professionals Inc.",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Middle Ages (Cambridge Introduction to World History)",
        "Authors": "By Cairns, Trevor",
        "Description": "Considers the most important aspects of European history between 1000 and 1450 including the power of the guilds, the Church, the feudal lords, and the Crusades.",
        "Category": " Young Adult Nonfiction , Social Science , General",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1973"
        }
    },
    {
        "Title": "History and Conquests of Ancient Rome",
        "Authors": "By Rodgers, Nigel",
        "Description": "",
        "Category": "",
        "Publisher": "Anness Publishing",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Castles: A History And Guide",
        "Authors": "By Hackett, John",
        "Description": "The development of the castle in Europe and the Middle East is examined, with more than two hundred photographs and a gazeteer which includes maps, visiting times, and histories",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "The Irreducible Needs of Children: What Every Child Must Have to Grow, Learn, and Flourish",
        "Authors": "By Greenspan, Stanley I. and Brazelton, T. Berry",
        "Description": "What do babies and young children really need? This impassioned dialogue cuts through all the theories, platitudes, and controversies that surround parenting advice to define what every child must have in the first years of life. The authors, both famed advocates for children, lay out the seven irreducible needs of any child, in any society, and confront such thorny questions as: How much time do children need one-on-one with a parent? What is the effect of shifting caregivers, of custody arrangements? Why are we knowingly letting children fail in school? Nothing is off limits, even such an issue as whether every child needs or deserves to be a wanted child. This short, hard-hitting book, the fruit of decades of experience and caring, sounds a wake-up call for parents, teachers, judges, social workers, policy makers-anyone who cares about the welfare of children.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Perseus Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Furry Logic: A Guide to Life's Little Challenges",
        "Authors": "By Seabrook, Jane",
        "Description": "Guaranteed to coax a smile from the grumpiest of grumps, FURRY LOGIC is a charming little book with a big heart and sly humor. Exquisitely detailed watercolor paintings depicting animals caught up in the joy and drudgery of life are paired with old adages given a new spin for our times. Tender thoughts such as “Smile first thing in the morning—get it over with,” “If you don't agree with me—it means you haven't been listening,” and “You'll always be my best friend—you know too much” go a long way toward banishing the blahs and shaking off the blues. Designer and illustrator Jane Seabrook's 40 universally appealing paintings of birds, bears, penguins, chipmunks, frogs, baboons, and more are rendered in delicate and biologically accurate detail using a tiny sable brush with a single hair at its tip. In the spirit of international best-seller The Blue Day Book, FURRY LOGIC speaks to the human condition in a way we can all relate to and feel good about.A humorous collection of quotes and drawings that turns life's little challenges into opportunities for laughter.An ideal gift for Mother's or Father's Day, birthdays, graduations, anniversaries, or for no reason at all.",
        "Category": " Reference , Quotations",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Breaking Free From Anger & Unforgiveness: A biblical strategy to conquer destructive reactions",
        "Authors": "By Mintle, Linda",
        "Description": "Anger happens; it's part of being human. But it does not need to control our ruin your life! Learn to express anger in a healthy way that brings positive results. Whether you are seriously out of control, hot-tempered or easily annoyed, now you can break free from the grip of anger.    •Learn life-changing strategies for healthy anger expression.    •Identify anger triggers and explore ways to deal with them.    •Examine biblical guidelines for expressing anger.God has important things to say about anger! Let these encouraging words speak to your heart as you begin making positive choices and changes.",
        "Category": " Self-help , Self-Management , Anger Management",
        "Publisher": "Charisma House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Letting go of anger: The 10 most common anger styles and what to do about them",
        "Authors": "By Potter-Efron, Ronald T.",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Celts: A Lucid and Fascinating History",
        "Authors": "By Chadwick, Nora",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Running Past 50 (Ageless Athlete)",
        "Authors": "By Benyo, Richard",
        "Description": "Offers information on training for speed and indurance, proper hydration and fueling, mindset, and preventing injuries in people over fifty years of age",
        "Category": " Sports & Recreation , Running & Jogging",
        "Publisher": "Human Kinetics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Rebirth, Book 7",
        "Authors": "By Na, Lauren, Woo, Jaffe, Taliesin, Yi, Kang-u, Coleman, Bryce P., and Ryu, Youngju (TRN)",
        "Description": "The vampire Deshwitat, imprisoned for centuries by a sorcerer, is released upon the world and seeks revenge against the one that imprisoned him, and also helps fight against evil as he tries to find his place in the modern world.",
        "Category": " Young Adult Fiction , Comics & Graphic Novels , Manga",
        "Publisher": "TokyoPop",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The Five Biggest Lies Bush Told Us About Iraq",
        "Authors": "By Scheer, Robert, Scheer, Christopher, and Chaudhry, Lakshmi",
        "Description": "A Copublication of Seven Stories Press and Akashic BooksThe Five Biggest Lies Bush Told Us About Iraq is the first book to hold the president and his team accountable for the government’s campaign of disinformation leading up to the war in Iraq. The administration repeatedly attested that Saddam Hussein had developed weapons of mass destruction and was close to using them; downplayed the cost and risk of the proposed invasion and occupation; shamelessly evoked the atrocious abuse of power of Hussein and his family while brooking no commitment to rebuild the country after the terrifying \"shock and awe\" campaign, or to do anything to improve the lot of the Iraqi people; and, most outrageously, provided substanceless theory linking Saddam Hussein to the attacks of September 11, thereby cynically manipulating the anger and sorrow of the American citizenry. The charade has culminated in the slow bloodletting of U.S. forces still stationed in Iraq, held there because it would not be politically expedient to admit the failure of \"democratization.\"While Bush II appears intent on conducting an unending global war against \"evildoers,\" little public debate has gone into assessing the aims and strategies of such a broad campaign. In The Five Biggest Lies Bush Told Us About Iraq, coauthors Christopher and Robert Scheer and Lakshmi Chaudhry of the influential web magazine AlterNet.org have aggregated the hard questions that the purported leadership of the U.S. must answer.Christopher Scheer is managing editor of AlterNet.org, the popular news and commentary website. Scheer has written screenplays for Oliver Stone and previously worked for the San Francisco Examiner. Robert Scheer is the author of six books, the host of NPR affiliate KCRW’s \"Left, Right, and Center,\" and a contributing editor to both the Los Angeles Times and The Nation. Lakshmi Chaudhry is an editor at Alternet.org.",
        "Category": " History , United States , 20th Century",
        "Publisher": "Seven Stories Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Everything in Its Path: Destruction of Community in the Buffalo Creek Flood",
        "Authors": "By Erikson, Kai T.",
        "Description": "The 1977 Sorokin Award–winning story of Buffalo Creek in the aftermath of a devastating flood.On February 26, 1972, 132-million gallons of debris-filled muddy water burst through a makeshift mining-company dam and roared through Buffalo Creek, a narrow mountain hollow in West Virginia. Following the flood, survivors from a previously tightly knit community were crowded into trailer homes with no concern for former neighborhoods. The result was a collective trauma that lasted longer than the individual traumas caused by the original disaster. Making extensive use of the words of the people themselves, Erikson details the conflicting tensions of mountain life in general—the tensions between individualism and dependency, self-assertion and resignation, self-centeredness and group orientation—and examines the loss of connection, disorientation, declining morality, rise in crime, rise in out-migration, etc., that resulted from the sudden loss of neighborhood.",
        "Category": " Nature , Natural Disasters",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1978"
        }
    },
    {
        "Title": "The Summer They Came",
        "Authors": "By Storandt, William",
        "Description": "There was a time when the seaside town of Long Spit was known only to a few wealthy families and a straggle of New England beachgoers. But when gay developers from Man-hattan, searching for a new place for summer shares and tea dances, get a look at its gently curving beaches, they hatch an ingenious plan to transform the sleepy Rhode Island hideaway into the next gay hotspot. If only someone would tell the townsfolk.As a contingent of gym-buffed and cell-phone-toting vacationers descends on the village, some locals are outraged, others strangely titillated. Hollis Wynbourne, a reclusive antiques dealer and longtime subject of gossip, is drawn from his cocoon by the sight of sunbathing beauties; wealthy Wesley Herndon suddenly finds the town overrun with his two favorite attractions, frisky hunks and yachts of pedigree; and Anthony, a callow eighteen-year-old, embarks on a sentimental education he never expected to get in his own backyard. An uproarious send-up of both small-town provincialism and the absurdities of contemporary gay life, The Summer They Came will capture you with its portrait of a town you thought you knew, run amuck.",
        "Category": " Fiction , LGBT , Gay",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Cool Names for Babies",
        "Authors": "By Rosenkrantz, Linda and Satran, Pamela Redmond",
        "Description": "The up-to-the minute word on what's hot and what's not from \"the arbiters of hip baby names.\"-The Wall Street JournalAs America's leading baby-name experts, Pamela Redmond Satran and Linda Rosenkrantz hear the same question again and again: \"What are the cool names?\" Here are the fun, fresh answers, delivered with the authors' trademark wit and authority, including:*HOT COOL--From the top 100 of cool to why Ivy is cooler than Ivana.*COOL COOL--Famous names: movie characters, artists, athletes, musicians, and writers, even nanny diary names*NEW COOL--Spiritual names like Pax or Eden; color names (Indigo, Lavender); music names (Jazz, Cadence, Madrigal); foreign word names (Luna, from the Spanish formoon; or Vero, Italian for truth).*TOO COOL--Why not to name a child Kool or Tiger.plus superlatives you won't find anywhere else: Coolest Cowboy Name, Coolest Southern Belle Name, Coolest Palindrome Name, Coolest Spice Name, Coolest Hero Name...Cool Names is the definitive guide to the hottest names.The up-to-the minute word on what's hot and what's not from \"the arbiters of hip baby names.\"-The Wall Street JournalAs America's leading baby-name experts, Pamela Redmond Satran and Linda Rosenkrantz hear the same question again and again: \"What are the cool names?\" Here are the fun, fresh answers, delivered with the authors' trademark wit and authority, including:*HOT COOL--From the top 100 of cool to why Ivy is cooler than Ivana.*COOL COOL--Famous names: movie characters, artists, athletes, musicians, and writers, even nanny diary names*NEW COOL--Spiritual names like Pax or Eden; color names (Indigo, Lavender); music names (Jazz, Cadence, Madrigal); foreign word names (Luna, from the Spanish formoon; or Vero, Italian for truth).*TOO COOL--Why not to name a child Kool or Tiger.plus superlatives you won't find anywhere else: Coolest Cowboy Name, Coolest Southern Belle Name, Coolest Palindrome Name, Coolest Spice Name, Coolest Hero Name...Cool Names is the definitive guide to the hottest names.",
        "Category": " Family & Relationships , Baby Names",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Safe Food: Eating Wisely in a Risky World",
        "Authors": "By Jacobson, Michael F., Lefferts, Lisa Y., and Garland, Anne Witte",
        "Description": "Describes food hazards and how to avoid them",
        "Category": "",
        "Publisher": "Living Planet Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "The Information Revolution and National Security: Dimensions and Directions (Significant Issues Series)",
        "Authors": "By Schwartzstein, Stuart J. D. (EDT)",
        "Description": "Contributors address the impact of information and communications technologies on how national security is maintained and how war is waged. Part I deals with broad implications of the information revolution for society, with chapters on the information infrastructure, financial systems, and information warfare and national security. Part II discusses information warfare and coming changes in the conduct of war, discussing the impact of the information revolution on strategy and doctrine. No index. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Political Science , Security (National & International)",
        "Publisher": "Center for Strategic & International Studies",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Better Homes and Gardens America's Heritage Quilts",
        "Authors": "By Martha Jahns",
        "Description": "Looks at the history of American quilts, shows and describes traditional patterns, and offers advice on planning and making a quilt",
        "Category": " Art , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "The Best American Nonrequired Reading 2003 (The Best American Series)",
        "Authors": "By Eggers, Dave (EDT) and Smith, Zadie (INT)",
        "Description": "Since its inception in 1915, the Best American series has become the premier annual showcase for the country's finest short fiction and nonfiction. For each volume, the very best pieces are selected by an editor who is widely recognized as a leading writer in his or her field, making the Best American series the most respected -- and most popular -- of its kind.   Dave Eggers, who will be editing The Best American Nonrequired Reading annually, has once again chosen the best and least-expected fiction, nonfiction, satire, investigative reporting, alternative comics, and more from publications large, small, and on-line -- The Onion, The New Yorker, Shout, Time, Zoetrope, Tin House, Nerve.com,and McSweeney's, to name just a few. Read on for \"Some of the best literature you haven't been reading . . . And it's fantastic. All of it.\" (St. Petersburg Times).Lynda Barry Jonathan Safran Foer Lisa Gabriele Andrea Lee J. T. Leroy Nasdijj ZZ Packer David Sedaris",
        "Category": " Literary Collections , American , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Woman: An Intimate Geography",
        "Authors": "By Angier, Natalie",
        "Description": "Angier, a Pulitzer-prize winning writer for the  New York Times,  brings sharp wit,  linguistic prowess, and copious research to bear on her topic, which is, well...it's not entirely clear. In her words: \"My book sets out to tackle the question `What makes a woman?' But I can only sidle up to the subject of femaleness clumsily, idosyncratically, with my biases, impressions, and desires flapping out like the tongue of an untucked blouse. I hope simply to show how the body is part of the answer....\" Chapters are labeled with amusing titles such as \"The Well-Tempered Clavier On the Evolution of the Clitoris,\" \"A Gray and Yellow Basket The Bounteous Ovary,\" \"Venus in Furs Estrogen and Desire,\" \"Greasing the Wheels A Brief History of Hormones,\" and \"A Skeptic in Paradise A Call for Revolutionary Psychology.\" Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Science , Life Sciences , Human Anatomy & Physiology",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Scary Stories 3 (Scary Stories Scary Stories)",
        "Authors": "By Schwartz, Alvin and Gammell, Stephen (ILT)",
        "Description": "Storytellers know -- just as they have for hundreds and hundreds of years -- that everyone enjoys a good, scary story!Alvin Schwartz's Scary Stories 3 joins his other popular collections of scary folklore, Scary Stories To Tell In The Dark and More Scary Stories To Tell In The Dark, to give readers spooky, funny and fantastic tales guaranteed to raise goose bumps.Who is the Wolf girl? Why is a hearse filled with men with yellow glowing eyes? Can a nightmare become reality? How do you avoid an appointment with Death?Stephen Gammell's splendidly creepy drawings perfectly capture the mood of more than two dozens scary stories -- and even a scary song -- all just right for reading along or for telling aloud in the dark..",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "HarperColl",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Willie: Raising and Loving a Child with Attention Deficit Disorder",
        "Authors": "By Colin, Ann and Herbst, Ann Colin",
        "Description": "ADD - Attention Deficit Disorder, now diagnosed in up to ten percent of school-age children - has vaulted into public awareness and into a succession of self-help books. But this is the first to take the reader, through a mother's eyes, into the day-to-day life of a child with ADD and its dynamics in the home and beyond.Ann Colin's compelling journal recounts her son Willie's first five years of life. Willie is intelligent, creative, affectionate, and amusing. He is also overly excitable and belligerent. We follow Colin and her husband from school to school, doctor to doctor, seeking a correct diagnosis - from an insensitive preschool staff, to the psychologist who pronounces Willie brain-damaged when he walks on tiptoe, to the seesaw of medical opinion on treatment and drugs.It is a marathon that takes them from bewilderment and exhaustion, through coping, to triumph. For a family facing ADD or any other crisis, and for educators and therapists, Willie is an inspiration and a lifesaver.",
        "Category": " Psychology , Psychotherapy , Child & Adolescent",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "The Silver Chair (Chronicles of Narnia, Book 4)",
        "Authors": "By C. S. Lewis",
        "Description": "Two English children undergo hair-raising adventures as they go on a search and rescue mission for the missing Prince Rillian, who is held captive in the underground kingdom of the Emerald Witch.Narrates Prince Rilian's daring escape from the underground kingdom of the Emerald Witch",
        "Category": "",
        "Publisher": "Collier Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "The Wild Duck (Norton Critical Edition)",
        "Authors": "By Ibsen, Henrik",
        "Description": "",
        "Category": " Fiction , Sagas",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1969"
        }
    },
    {
        "Title": "Random Acts of Kindness",
        "Authors": "By Conari Press (EDT)",
        "Description": "A tribute to the small individual expressions of kindness that motivate and inspire others includes quotes, anecdotes, and suggestions to promote compassionate living and a gentler world. Original.",
        "Category": "",
        "Publisher": "Conari Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "And to Every Beast... (Treasures of the Vatican Library)",
        "Authors": "By Rawls, Walton",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Turner Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Age Happens (Retired Edition): The Best Quotes & Cartoons About Growing Older",
        "Authors": "By Lansky, Bruce (EDT)",
        "Description": "A Gift of Laughter for Your Aging Friends and Relatives  Here are the most witty and outrageous things ever said or written about growing older by Ellen DeGeneris, Bill Cosby, Erma Bombeck, Lucille Ball, Woody Allen, George Burns, Milton Berle, Phyllis Diller, Rodney Dangerfield, and other humorists. You'll also find clever cartoons bu Lynn Johnston, Chon Day, Stephen Carpenter, Ed Fisher and others. There's a laugh on every page.",
        "Category": " Humor , General",
        "Publisher": "Running Press Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "In the Wake of the Plague: The Black Death and the World It Made",
        "Authors": "By Cantor, Norman F.",
        "Description": "The Black Death was the fourteenth century's equivalent of a nuclear war. It wiped out one-third of Europe's population, takingmillion lives. And yet, most of what we know about it is wrong. The details of the Plague etched in the minds of terrified schoolchildren -- the hideous black welts, the high fever, and the awful end by respiratory failure -- are more or less accurate. But what the Plague really was and how it made history remain shrouded in a haze of myths.Now, Norman Cantor, the premier historian of the Middle Ages, draws together the most recent scientific discoveries and groundbreaking historical research to pierce the mist and tell the story of the Black Death as a gripping, intimate narrative.",
        "Category": " Medical , History",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "When Anger Hurts",
        "Authors": "By McKay, Matthew",
        "Description": "",
        "Category": " Self-help , Anger Management",
        "Publisher": "Fine Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Angels Everywhere",
        "Authors": "By Valentine, Lynn",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Premium Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Celtic Fairy Tales (Dover Children's Classics)",
        "Authors": "By Jacobs, Joseph (EDT)",
        "Description": "The two volumes of Celtic folk tales collected by the leading British folklorist Joseph Jacobs (1854–1916) introduced the children of the world to the special vision and color, the unique magic of the Celtic folk imagination. The 26 stories of \"Guleesh,\" \"The Horned Women,\" \"King O'Toole and His Goose,\" \"The Sea-Maiden,\" \"The Shee An Gannon and the Gruagach Gaire,\" \"The Lad with the Goat-Skin,\" the legendary \"Dierdre,\" \"Beth Gellert,\" and the other wonderful characters, the curses and hexes, the broken promises and granted wishes are accompanied by eight full-page plates, 37 drawings, and decorated capitals and endpieces that help make this book the charming one that generations of youngsters have proclaimed it to be.",
        "Category": " Young Adult Fiction , Fairy Tales & Folklore , Adaptations",
        "Publisher": "Dover",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1968"
        }
    },
    {
        "Title": "The Reign of Chivalry",
        "Authors": "By Barber, Richard W.",
        "Description": "An illustrated history of medieval knighthood traces the origins of chivalry and its development into a romantic tradition and the effect of chivalric ideas on society, religion, and literature",
        "Category": " History , Medieval",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1980"
        }
    },
    {
        "Title": "Private Washington",
        "Authors": "By Cigliano, Jan, Smalling, Walter, and Smalling, Walter (PHT)",
        "Description": "Washington's inhabitants have, over the years, included the elite, the powerful, and the well known figures that dominate the country's vaunted inner circles of politics, press, and diplomacy.This unprecedented volume presents the first true insider's look at Washington, ushering readers through the doorways of 26 of the city's most celebrated private homes and official residences.  Newly commissioned photographs offer fabulous views, exterior and interior, of Washington's most prestigious addresses dating from 1790 to the present.  Lively text places each home in its historical context, showing how its current residents have adapted it for contemporary life.  The result is a rare, privileged look at life inside the Beltway.",
        "Category": " Architecture , History , General",
        "Publisher": "Rizzoli",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "A Day No Pigs Would Die",
        "Authors": "By Peck, Robert Newton",
        "Description": "Originally published in hardcover in 1972, A Day No Pigs Would Die was one of the first young adult books, along with titles like The Outsiders and The Chocolate War. In it, author Robert Newton Peck weaves a story ofa Vermont boyhood that is part fiction, part memoir. The result is a moving coming-of-age story that still resonates with teens today.",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "The Berenstain Bears' Trouble with Pets",
        "Authors": "By Berenstain, Stan and Berenstain, Jan",
        "Description": "This classic Berenstain Bears story is a perfect way to teach children about the responsibilities of caring for a pet!Come for a visit in Bear Country with this classic First Time Book® from Stan and Jan Berenstain. Brother and Sister are getting a dog, but will the cubs help take care of the new puppy like they promised? Includes over 50 bonus stickers!",
        "Category": " Juvenile Fiction , Animals , Bears",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "How Did it Really Happen?",
        "Authors": "By Editors of Reader's Digest",
        "Description": "Offers accounts of events and people in history, from the Big Bang on, including origins and major discoveries, legendary individuals, and historical mysteries, and suggests the most likely factual explanations.",
        "Category": " History , Reference",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "7.35",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The American Woman 2003-2004: Daughters of a Revolution - Young Women Today",
        "Authors": "By Stone, Anne J. (EDT), Costello, Cynthia B. (EDT), and Wight, Vanessa R. (EDT)",
        "Description": "The American Woman is an established, widely respected series on the status of American women, prepared biannually by the Women's Research and Education Institute (WREI). The purpose of the series is to provide an important, convenient, and timely source of accessible and 'user-friendly' information on American women to the media, students and scholars, advocates for women's equity, and policymakers. Each edition of the series focuses on a particular theme, and the ninth edition will address young women between the ages of 25 and 35. Contributors - all experts in the field of women's issues - will explore the opportunities and challenges confronting the young women who are the daughters of the baby boomer generation. A focus on young women will bring into sharp relief how much has changed in the decades since 1960 and how much remains the same. A statistical portrait will accompany the volume, including user-friendly charts and graphs that provide readers with the hard numbers that underlie the trends shaping women's experiences.",
        "Category": " Social Science , Feminism & Feminist Theory",
        "Publisher": "Palgrave Macmillan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Glorafilia needlepoint collection: With complete projects and stitch cards",
        "Authors": "By Berman, Jennifer, Lazarus, Carole",
        "Description": "Includes designs and color charts for projects ranging from samplers and cushions to stuffed animals and rugs",
        "Category": "",
        "Publisher": "Distributed in the U.S. by Sterling Pub. Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Superfoods: Cook Your Way to Health",
        "Authors": "By Steinback, Jyl",
        "Description": "",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Qvc Pub",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Champagne: The Spirit of Celebration",
        "Authors": "By Slavin, Sara and Petzke, Karl",
        "Description": "Champagne commemorates this golden nectar with a host of fascinating facts, literary reflections, innovative recipes, and evocative full-color and black-and-white photographs. From the romantic Champagne region of northern France to the verdant valleys of California; from vast, sunny vineyards to dark, chilly caves, this lavish volume describes the various types of champagne and sparkling wines, their intricate fermentation processes, and their history, offering advice about such issues as proper storage and the correct way to open a bottle.Recipes include delectable appetizers, rich entrees, and luscious desserts that can be prepared with champagne or sparkling wine - including oysters with Champagne Mignonette, Champagne Risotto with Wild Mushrooms, and Champagne Poached Chocolate Cream Pears - as well as hors d'oeuvres that go well with champagne, such as Grapes with Herbed Chevre and Toasted Almonds. The book also features recipes for creating (or mixing) traditional champagne drinks, including the Bellini and Kir Royale.",
        "Category": " Cooking , Beverages , Wine & Spirits",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Hey, Peanuts! (Selected Cartoons from More Peanuts, Vol. 2)",
        "Authors": "By Schulz, Charles M.",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Publications",
        "Price Starting With ($)": "14.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1954"
        }
    },
    {
        "Title": "White House Collection of American Crafts",
        "Authors": "By Diamonstein, Barbaralee, National Museum of American Art (U. S.) (COR), Taylor, John Bigelow (PHT), Taylor, John Bigelow, and Monroe, Michael W.",
        "Description": "Michael W. Monroe, Curator-in-Charge of the Renwick Gallery of the Smithsonian Institution's National Museum of American Art, selected this collection of fine contemporary crafts specifically for the interiors of the White House, to be viewed and admired alongside the works of the past.Prepared in conjunction with an exhibition at the National Museum of American Art, this volume features ninety-two full-color photographs - some showcasing the pieces in the private quarters and public spaces of the White House - taken expressly for this book by John Bigelow Taylor. In addition to an introduction to the collection and commentaries on each piece by Michael Monroe, the book includes an essay on the significance and cultural value of crafts by Barbaralee Diamonstein, a foreword by Elizabeth Broun, Director of the National Museum of American Art, and brief biographies of each artist.",
        "Category": " Art , Collections, Catalogs, Exhibitions , General",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Glory of Holy Land",
        "Authors": "By Gafni, S.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "Touchpoints : God's Answers for Your Daily Needs",
        "Authors": "By Beers, Ron, Beers, Gilbert",
        "Description": "Value priced! A collection of promises from God's Word organized to specific needs.",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Sex: Even More Fun You Can Have Without Laughing: Sex Quotations Witty, Racy & Surprisingly Instructive",
        "Authors": "By Phillips, Louis and Cole, William",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "The Calm Technique: Meditation without Magic or Mysticism",
        "Authors": "By Wilson, Paul",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Angels: An endangered species",
        "Authors": "By Godwin, Malcolm",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.04",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Book of The Medieval Knight",
        "Authors": "By Turnbull, Stephen R.",
        "Description": "Fearless in battle, gracious in victory, knights lived their lives on a heroic scale, during the fourteenth and fifteenth centuries. Vividly retold with superb color and black-and-white photographs and illustrations. \"...fantastic...recommend this book most highly....Excellent....\"--Midwest Wargamer's Assoc. .... \"Superbly illustrated...outstanding....Glorious full-color photographs...exquisite and informative study.\"--BRAVO.",
        "Category": " History , General",
        "Publisher": "Cassell",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Rodale's Visual Encyclopedia of Needlecrafts: Unique Look-And-Stitch Lessons and Projects",
        "Authors": "By Christmas, Carolyn",
        "Description": "Unique illustrations and detailed photographs show the stitch-by-stitch basics of today's most popular needlecrafts. From learning to choose the right threads to making a first project, this book has all the information and instructions needed to explore a new craft or advance existing skills. Applique a quilt or kitchen curtains. Cross-stitch an elegant carousel horse. Crochet an heirloom for a newborn.",
        "Category": " Crafts & Hobbies , Needlework , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Exit to Eden",
        "Authors": "By Rice, Anne and Rampling, Anne",
        "Description": "\"The same kind of skillful writing that brought respectability to the erotic works of Henry Miller, Anaís Nin, and D. H. Lawrence.\"--UPIThere is Lisa: They call her the Perfectionist. A stunning, mysterious, and fearless sexual adventurer, she is founder and supreme mistress of The Club--an expensive, exclusive island resort where forbidden fantasy meets willing flesh. There is Elliott: A thrill-seeking photographer who has risked his life in war zones around the world. Now he is committed to the ultimate plunge into personal risk--exploring his darkest sexual self.Join them on a journey to the limits of erotic pleasure and beyond. Surrender to the tantalizing wonders of the imagination behind the spellbinding sensuality of The Vampire Chronicles. Take leave of the world you know--and step into Eden. . . . \"To read Anne Rice is to become giddy as if spinning through the mind of time.\"--San Francisco Chronicle\"Anne Rice seems to be at home everywhere. . . .She makes us believe everything she sees.\"--The New York Times\"No one writing today matches her deftness with the erotic.\"--Atlanta Journal & ConstitutionFrom the Trade Paperback edition.",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Coffee: The Bean of My Existence",
        "Authors": "By Thomas, R. D.",
        "Description": "Celebrating the joys and dangers of loving coffee, a journey through words and pictures traverses the seven rings of coffee addiction with a desperate coffee and cartoon addict who tells the story of his consuming passion. Original. 50,000 first printing.",
        "Category": "",
        "Publisher": "Henry Holt and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Lord Byron's Novel: The Evening Land",
        "Authors": "By Crowley, John",
        "Description": "One of the most accomplished literary artists of our time, John Crowley has given us fiction that illuminates and astounds -- from the wonder and whimsy of Little, Big to the poignancy and lyrical beauty of The Translator. Now he turns his unique genius in a different direction to imagine the novel the great, haunted, and enigmatic Romanticpoet Lord Byron never penned ... but very well might have.Documents discovered in a rotting old trunk in an English storage room prove that the manuscript of a novel by Byron once existed, and that it was saved from destruction, read, and annotated by Ada, Countess of Lovelace, a brilliant mathematician and Byron's abandoned daughter, during the final, agonizing months of her young life. While the curious mystery of what became of the manuscript itself is explored, we are permitted to read it -- the whole of Byron's only novel -- beginning to end.And what a novel it is -- a thrilling romance chock-full of treacheries and deceits, loves and fortunes gloriously gained and tragically lost; a tale of blood, vengeance, and mystery, of thrilling escapes and ruthless murder. Yet in the story of Ali -- the bastard son of the demonic Lord Sane, torn from his life in high Albania to be raised a proper, if penniless, English gentleman -- Ada finds gripping revelations of its author's hidden character, and glimpses into the secrets of his soul.John Crowley's masterly creation is, in itself, a stunning and unprecedented act of literary impersonation. But Lord Byron's Novel is much more, weaving strands from different centuries into an extraordinary tapestry of loss and discovery, and the powerful, invisible threads that eternally bind parent to child. It is the story of a dying daughter's poignant attempt to understand the famous absent father she longed for to her last day, and the contemporary tale of the determined young woman who, by learning the secret of Byron's manuscript and Ada's devotion, reconnects with her own father, who was driven from her life by a crime as terrible as any Byron was accused of.  John Crowley's novel is a wonder -- a modern masterwork that moves, enlightens, and satisfies on every  level.",
        "Category": " Fiction , Historical , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "14.58",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "A Working of Stars (Mageworlds)",
        "Authors": "By Doyle, Debra and MacDonald, James D.",
        "Description": "Ten years ago, Arekhon sus-Khalgath sus-Peledaen abandoned his native planet for a new life on the far side of the Gap Between - the starless rift separating the Eraasian worlds from the rest of the galaxy. On the planet Entibor, he found shelter and domestic tranquillity with his old love, Elaeli Inadi, at the price of what he had left behind: a dispersed and shattered Mage-Circle, an estranged brother who had tried to kill him, and a homeworld on the cusp of massive cultural upheaval.Now the bill is coming due, and Arekhon finds himself impelled homeward by strange dreams and prophetic visions. The Great Working - the effort to do the unthinkable and reunite a galaxy long sundered by the Gap Between - remains incomplete, left unfinished in the aftermath of the dissolution of Arekhon's Mage-Circle. But too much energy and too many lives have been poured into the Working already, and it cannot end so long as any of the Circle members remain alive and bound into it.Home, unfortunately, isn't a safe place for Arekhon to be at the moment. For Eraasi has changed - and the great fleet-families at the center of Eraasian culture are girding for war.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "The Russian Revolution,",
        "Authors": "By Daniels, Robert Vincent",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1972"
        }
    },
    {
        "Title": "Abide With Me: A Novel (Invisible Life Trilogy)",
        "Authors": "By Harris, E. Lynn",
        "Description": "The Invisible Life Trilogy In three linked novels— Invisible Life , Just As I Am , and Abide With Me —E. Lynn Harris opens the door to a world rarely depicted in popular literature, the gay and bisexual black community. Written with sensitivity and sass, the novels have all appeared on the Blackboard bestseller list and have won enthusiastic acclaim from critics and a broad range of readers. The questions, discussion topics, and suggested reading list that follow are designed to enhance your reading group's discussion of the books and the insights they offer into the lives of men and women, gay and straight, as they face such universal problems as finding and keeping love, making the right career choices, and dealing with sometimes difficult parents, co-workers, and friends. At the center of the Invisible Life trilogy is Raymond Tyler, a man struggling to do the right thing without betraying his past or sacrificing his dreams. The son of a successful lawyer in Birmingham, Alabama, Raymond always assumed he would follow in his father's footsteps. His life takes an unexpected turn, however, when he finds himself attracted to a handsome fraternity brother at college. Their carefully cloaked relationship—at once confusing, exhilarating, and frightening—marks the first step in Raymond's journey toward self-discovery and self-acceptance. It is a journey that takes him from the tradition-bound South to the uninhibited world of gay Manhattan, to a thriving Seattle, where his legal career and his love-life seem destined for lasting success. Along the way, Raymond encounters a rich and diverse array of people, including the flamboyant, openly gay Kyle; the beautiful, loving Nicole, an aspiring actress; and Basil, a dashing and dangerous football player. Their stories join with Raymond's in a fast-paced chronicle that proves that love, friendship, and sexual desire frequently defy conventional expectations and explanations. Harris's novels not only recount the changes and choices the individual characters confront, they evoke in telling detail the society in which those choices are made. From the importance of church and family to the consequences of biases based on skin color, sexual orientation, and gender, Harris uncovers the ties that bind and the issues that divide the African American community today.",
        "Category": " Fiction , African American , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Barbecue & Smoke Cookery",
        "Authors": "By Maggie Waldron",
        "Description": "",
        "Category": "",
        "Publisher": "101 Productions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1983"
        }
    },
    {
        "Title": "Jihad vs. McWorld: Terrorism's Challenge to Democracy",
        "Authors": "By Barber, Benjamin R and Schulz, Andrea (EDT)",
        "Description": "Jihad vs. McWorld is a groundbreaking work, an elegant and illuminating analysis of the central conflict of our times: consumerist capitalism versus religious and tribal fundamentalism. These diametrically opposed but strangely intertwined forces are tearing apart--and bringing together--the world as we know it, undermining democracy and the nation-state on which it depends. On the one hand, consumer capitalism on the global level is rapidly dissolving the social and economic barriers between nations, transforming the world's diverse populations into a blandly uniform market. On the other hand, ethnic, religious, and racial hatreds are fragmenting the political landscape into smaller and smaller tribal units. Jihad vs. McWorld is the term that distinguished writer and political scientist Benjamin R. Barber has coined to describe the powerful and paradoxical interdependence of these forces. In this important new book, he explores the alarming repercussions of this potent dialectic for democracy.A work of persuasive originality and penetrating insight, Jihad vs. McWorld holds up a sharp, clear lens to the dangerous chaos of the post-Cold War world. Critics and political leaders have already heralded Benjamin R. Barber's work for its bold vision and moral courage. Jihad vs. McWorld is an essential text for anyone who wants to understand our troubled present and the crisis threatening our future.",
        "Category": " Religion , Religion, Politics & State",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Super Sunday",
        "Authors": "By Didinger, Ray",
        "Description": "",
        "Category": " Sports & Recreation , Football",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Exploring Heaven: What Great Christian Thinkers Tell Us About Our Afterlife with God",
        "Authors": "By Roberts, Arthur O.",
        "Description": "\"If you have ever wondered whether the idea of heaven is merely a theoretical human construct, then this book is for you. If you have ever entertained doubts or questions about a future existence after this life, then this book is for you. If you have ever thought of heaven's residents as rather dull, ethereal beings perched on billowing clouds strumming golden harps, then this book is for you. If you have ever imagined heaven to be simply one never-ending worship service, then this book is for you.\" -- from the Introduction by Richard J. FosterAs long as people have lived, they have dreamed and wondered about the life that comes after this one. In Exploring Heaven, Arthur O. Roberts distills the best of Christian thought and speculation to answer the age-old questions about eternal life. Drawing from a wealth of timeless wisdom, Roberts not only sketches out the overwhelming evidence that eternal life is a reality, he also describes everything from heaven's location and its inhabitants to the nature and rhythm of eternal life.Speculating about heaven can be a risky business, but Roberts is firmly grounded in Christian tra-dition and classical scholarship. Part philosopher and part pastor, he employs biblical evidence, scientific proofs, personal anecdotes, and philo-sophical musings to create a complete and prag-matic picture of life after death. While the heaven he depicts is a place filled with joy and worship, it is hardly a fairyland of clouds and harps where the saved lounge about for eternity. Instead, he believes humans will work, play, socialize, and learn, continuing the process of discipleship started on earth. And unlike philosophers who dismiss physi-cal bodies as so much excess baggage, Roberts be-lieves that we will continue to inhabit our (greatly enhanced) bodies after death. Indeed, we will live much as we do now, with one key exception: heaven will be free of sin.Both pragmatic and celebratory, equal parts wise and inspiring, Exploring Heaven will appeal to everyone who has ever wondered about the nature of eternal life.",
        "Category": " Religion , Christianity , General",
        "Publisher": "HarperSanFrancisco",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Discover Your Genius: How to Think Like History's Ten Most Revolutionary Minds",
        "Authors": "By Gelb, Michael J.",
        "Description": "Imagine unleashing your creativity by letting your imagination enjoy the benefits of the type of mental play that helped inspire the theory of relativity. Or evaluating your business climate with the combination of keen observation and an open mind that yielded the theory of evolution. Or navigating your life path with the same love of knowledge and truth that spawned all of Western philosophy. The individuals behind these revolutions of thought live on in our collective memory as models for tackling the challenges that lie ahead. The difference between your mind and theirs is smaller than you think, and is determined less by inborn capacity than by passion, focus, and strategy -- all of which are yours to develop.Everyone has the potential for genius. The full expression of your unique genius awaits you in these pages! In Discover Your Genius, Michael J. Gelb draws upon the wellspring of history's most revolutionary minds to guide you to unleash your own creativity through mental play. Searching for the most world- shaking ideas, discoveries, and innovations, Gelb assembled a \"genius dream team\" comprising ten individuals, each of whom embodies a special \"genius\" characteristic that you are invited to integrate into daily life. They are:  Plato-Deepening your love of wisdom Filippo Brunelleschi-Expanding your perspective Christopher Columbus-Going perpendicular: strengthening your vision, optimism, and courage Nicholas Copernicus-Reorganizing your vision of the world Queen Elizabeth I-Wielding your power with balance and effectiveness William Shakespeare-Cultivating your emotional intelligence Thomas Jefferson-Celebrating your freedom in the pursuit of happiness Charles Darwin-Developing your power of observation and cultivating an open mind Mahatma Gandhi-Applying the principles of spiritual genius to harmonize spirit, mind, and body Albert Einstein-Unleashing your imagination and \"combinatory play\"Through fascinating, accessible biographies, you'll develop a personal relationship with each genius and learn how to use his or her guiding principle to enrich the quality of your life. Personal self-assessments will help you gauge how each principle is working in your own life, followed by a series of practical and vibrant exercises to help you develop each principle fully.In How to Think Like Leonardo da Vinci, Gelb taught us how to unlock the \"da Vincian\" genius inside us. Now he provides an enlightening plan for personal and professional development by encouraging us to apply the wisdom of ten of history's greatest minds. Engaging and practical, Discover Your Genius gives us the tools to improve our own mental abilities by making \"genius thinking\" accessible and fun!",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Harper",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Strange Affair: A Novel of Suspense (Inspector Banks Mysteries)",
        "Authors": "By Robinson, Peter",
        "Description": "Chief Inspector Alan Banks faces his most personal case from New York Times bestselling author Peter Robinson.A bullet to the brain abruptly halted a terrified young woman's desperate flight. In her pocket is the name of a policeman whose own life was brutally invaded, mercilessly shaken, and very nearly erased—a policeman who has since gone missing.The dead woman in the car had been running from something—but she didn't run far or fast enough. Detective Inspector Annie Cabbot would like to question the man the victim was apparently racing to meet: Annie's superior—and former lover—Detective Chief Inspector Alan Banks. But Banks has vanished into the anonymous chaos of the city, drawn into a mad whirl of greed, inhumanity, and death, by a frantic phone call from the brother he no longer knows. Banks is unaware that the threads connecting a sinister kidnapping with a savage slaying are as thick as rope . . . and long enough for a haunted and broken rogue cop to hang himself.One of his most, clever, twisting thrillers, Strange Affair attests once again why readers love and can’t get enough of Peter Robinson’s novels of suspense.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Ten Days That Shook the World",
        "Authors": "By Reed, John",
        "Description": "Ten Days That Shook the World is the classic account of the Russian Revolution of November 1917 by a western journalist and has been admired worldwide since its first publication in 1919. Lenin endorsed it as \"a truthful and most vivid exposition of the events so significant to the comprehension of what really is the Proletarian Revolution.\"",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "May",
            "Year": "1979"
        }
    },
    {
        "Title": "Being A Teen: Words of advice from someone who's been there (Teens & Young Adults)",
        "Authors": "By Mastromarino, Diane",
        "Description": "Millions have been here before. Millions will be here after you. Everyone has their own experiences, but we eventually share one common bond -- we all make it through these restless teenage years, and somehow, we all survive. We all walk that thin line between adult and child trying to steady ourselves on our own two feet. We all have bad-hair days and broken-heart days and I-wish-I-were-somebody-else days. We all stress out over school and work and learning to drive and looking good and fitting in. We all learn the hard way that people and moments don't last forever and that pimples are just a part of life. We all struggle with friends who get in way over their heads, and we all struggle with parents who constantly bug us about being in way over their heads, and we all struggle with parents who constantly bug us about being in way over our own. We al want to be the most popular, the prettiest, the smartest, the most athletic, and the best and most perfect at everything we do. And somehow, we all make it out alive with great memories, great friendships, and great stories.BEING A TEEN is one girl's account of her teen years that will help make your own experience a little bit easier. Young enough to remember all the gruesome and hilarious details, but old enough  to reflect on those years with a bit of insight, author Diane Mastromarino has filled the pages of this book with her own teen tales, as well as poetry and quotations written by teens and famous authors. It is a book you will learn from, laugh at, and, without a doubt, relate to. BEING A TEEN is the perfect companion, offering the advice you need to hear, the laughter to keep you going, and the reassurance that you are not going through this alone.",
        "Category": " Family & Relationships , Life Stages , Teenagers",
        "Publisher": "Blue Mountain Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "New Poetry Series: Poems of Nature",
        "Authors": "By Harvey, Gail",
        "Description": "A collection of poems about nature and the seasons features works by Shakespeare, Thoreau, Christina Rossetti, and others",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Classic Hundred: All-Time Favorite Poems (A Columbia Anthology)",
        "Authors": "By Harmon, William (EDT)",
        "Description": "Gathers the most frequently anthologized English and American poems, including those by Keats, Shakespeare, Frost, Wordsworth, Dickinson, Shelley, Yeats, Blake, Tennyson, Emerson, and Browning",
        "Category": " Poetry , General",
        "Publisher": "Columbia Univ Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Great Expectations: The Troubled Lives of Political Families",
        "Authors": "By Emery, Noemie",
        "Description": "From John Adams’s sons two hundred years ago to the Bush brothers today, America has witnessed a long line of dynastic sons who have been forced into political roles by their ambitious relatives. Great Expectations examines the burden of being born into one of America’s royal families, where the choice is between achieving the pinnacle of political power—or failing miserably trying.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Garden Color Book",
        "Authors": "By Williams, Paul",
        "Description": "Flippable, flexible, and comprehensive, this garden's version of The Color Book (over 100,000 copies sold!) is a must-have for gardeners with an eye for the big picture. Presented in the same interactive format as its popular predecessor, The Garden Color Book includes over 600 photographs of individual plants displayed horizontally in swatches by colorthat let you flip back and forth, mixing and matching until you find the perfect color scheme. By showing what color blossoms a bulb or shrub will have when in bloom, this indispensable gardening reference allows you to imagine how a summer plot might look planted with a sea of flame red penstemon accented by some sky blue salvias or a spring border of lime green euphorbia. With concise plant profiles covering propagation and bloom, as well as season and zone information, and more than 340,000 combinations, gardener's will be sure to find their ideal garden color palettebefore putting trowel to earth.",
        "Category": " Gardening , Garden Design",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "The New Classics: Fresh Ideas for Rooms that Endure",
        "Authors": "By Trocme, Suzanne, Hayden, Ken (PHT), and Hayden, Ken",
        "Description": "",
        "Category": " Design , Decorative Arts",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Zinger",
        "Authors": "By Azinger, Paul",
        "Description": "Zinger is the story of a man who has proved his grit on the golf course and who overcame the odds to become one of the best players on the PGA Tour. But it's more than just a sports story. It's about Paul Azinger's struggle with cancer and the source of inner strength that helped him beat the disease and play golf again.",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Funny Dogs",
        "Authors": "By Martin, Jane and Suares, Jean-Claude (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Stewart Tabori & Chang",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "101 Patchwork Patterns (Dover Quilting)",
        "Authors": "By McKim, R. S.",
        "Description": "This is one of the finest of all the available books on the making of patchwork quilts. The author is recognized as having been one of our country's leading authorities on this venerable art, and in this book she divulges many a secret that will assist you in making quilts of the highest quality.The book contains over 100 patchwork patterns, with complete instructions for cutting and sewing. All conceivable sorts of designs are diagrammed and carefully described: flower designs, rainbows designs, Irish chains, fish and bird and leaf designs. The book shows you, step by step, all the details of making each kind of quilt: it covers choice of pattern, piece vs. patch quilting, simple and complex quilts, choice of quilt materials, interlining materials, lining and thread materials, cutting and piecing, the applique process, various methods of setting together, quilt sizes, borders, scallops, flounces, valances, straight line and close shell quilting, methods of stamping, perforated quilting patterns, quilting the quilt, putting into frames, quilting in a small space, embroidery quilts, and many other topics.The book is written in an entertaining manner. The author weaves a great deal of rosy humor into the lining of her instructions, as well as some interesting facts about the history of quilting, quilt materials, patterns, and some really choice folklore about the origin of the highly ingenious names of the patterns: \"Monkey Wrench,\" \"Road to California,\" \"Lafayette Orange Peel,\" \"Drunkard's Path,\" and \"Crossed Canoes,\" to name a few.The book is not technical in any sense of the word. You can use it to make beautiful quilts provided only that you know the fundamentals of sewing.",
        "Category": " Crafts & Hobbies , Patchwork",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1962"
        }
    },
    {
        "Title": "Cooking With Love, Italian Style",
        "Authors": "By Anthony, Francis",
        "Description": "A collection of old country Italian dishes from the family of the \"Love Chef\" includes Aunt Ida's Meatballs with Capers, Uncle Tony's Lentil Soup, and Mother Anthony's Soul-Satisfying Polenta with Sauce, as well as chapters on pasta and desserts. Tour.",
        "Category": " Cooking , Regional & Ethnic , Italian",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "The Cybernetic Theory of Decision: New Dimensions of Political Analysis",
        "Authors": "By Steinbruner, John D.",
        "Description": "In this classic work, John Steinbruner argues that the time is ripe for exploration of a new theoretical perspective on the decision-making process in government. He suggests that the cybernetic theory of decision as developed in such diverse fields as information theory, mathematical logic, and behavioral psychology generates a systematic but non-rational analysis that seems to explain quite naturally decisions that are puzzling when viewed from the rational perspective. When combined with the basic understanding of human mental operations developed in cognitive psychology, the cybernetic theory of decision presents a striking picture of how decision makers deal with the intense uncertainty and fundamental value conflicts that arise in bureaucratic politics. To illustrate the advantages of using cybernetic theory, Steinbruner analyzes the issue of sharing nuclear weapons among the NATO allies.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Princeton University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1977"
        }
    }
]