[
    {
        "Title": "Part of the Bargain & To Wed and Protect: A 2-in-1 Collection (Bestselling Author Collection)",
        "Authors": "By Miller, Linda Lael",
        "Description": "To heal the wounds left by a broken marriage and the death of her beloved stepson, Libby Kincaid returned to the ranch where she grew up. But instead of the solace she craved, she found Jess Barlowe—sexy, alluring…and mad as hell.For years Jess had been her constant opponent, and now malicious rumors tarnishing her reputation seemed only to enrage him further. But soon these adversarial sparks ignited into a fire of passion, and Jess wouldn't stop until he made her his bride. Unfortunately, Libby knew all too well that being married to a man was no guarantee of his trust…or his love.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin Bestselling Author Collection",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "The Haunted Halloween Party, Level 2 (Scooby-Doo Readers, No. 20)",
        "Authors": "By Herman, Gail and Duendes del Sur (ILT)",
        "Description": "Scooby-Dooby-Boo! Celebrate Halloween with the Mystery, Inc. gang.It's Halloween in Coolsville and Scooby and Shaggy are off to meet  the gang at a groovy costume party! But when Scooby and Shaggy show up at the party, it's YIKES! in a haunted house!  Turns out it's not really haunted, just for sale, and that Scooby and Shaggy have gotten the address wrong!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Scholastic Inc.",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "The Dog of My Nightmare",
        "Authors": "By Lieber, Dave",
        "Description": "",
        "Category": "",
        "Publisher": "Yankee Cowboy Press",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Nixon",
        "Authors": "By De Toledano, Ralph",
        "Description": "",
        "Category": "",
        "Publisher": "Holt",
        "Price Starting With ($)": "6.86",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "Bringing Out the Best in Others!: 3 Keys for Business Leaders, Educators, Coaches and Parents",
        "Authors": "By Connellan, Thomas K.",
        "Description": "Did you know that two-thirds of all entrepreneurs are first borns? That 21 of the first 23 astronauts were first borns? That 45 percent of female world leaders between 1960 and 1999 were first borns? Using these three factors, business leaders increased productivity and improved profits, parents boosted their children's grade point averages, educators improved the performances of entires classes. Include Leader's Guide.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Peak Performance",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "YOGA FOR COMMON AILMENTS",
        "Authors": "By Monro, Robin, Nagarathna, R., Nagendra, H. R., and Ford-Kohne, Nancy",
        "Description": "Outlines a yoga program designed to maintain health and fitness",
        "Category": " Health & Fitness , Yoga",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "A Guide to 150 Years of Chicago Architecture",
        "Authors": "By Museum of Science and Industry (Chicago, Ill.)",
        "Description": "",
        "Category": " Architecture , General",
        "Publisher": "Chicago Review Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Princesses Don't Sweat",
        "Authors": "By Delaney, Kaz",
        "Description": "Fifteen-year-old Madeline hates the idea of spending Christmas vacation in Australia with her mom's new Internet boyfriend, but when handsome Aussie hunk Mitch rescues them from the Outback, it's love at first sight for Madeline.",
        "Category": " Young Adult Fiction , Humorous , General",
        "Publisher": "Dorchester Pub Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "The Clinton Tapes: Wrestling History with the President",
        "Authors": "By Branch, Taylor",
        "Description": "A GROUNDBREAKING BOOK about the modern presidency, The Clinton Tapes invites readers into private dialogue with a gifted, tormented, resilient President of the United States. Here is what President Clinton thought and felt but could not say in public.   This book rests upon a secret project, initiated by Clinton, to preserve for future historians an unfiltered record of presidential experience. During his eight years in office, between 1993 and 2001, Clinton answered questions and told stories in the White House, usually late at night. His friend Pulitzer Prize-winning author Taylor Branch recorded seventy-nine of these dialogues to compile a trove of raw information about a presidency as it happened. Clinton drew upon the diary transcripts for his memoir in 2004.   Branch recorded his own detailed recollections immediately after each session, covering not only the subjects discussed but also the look and feel of each evening with the president. The text engages Clinton from many angles. Readers hear candid stories, feel buffeting pressures, and weigh vivid descriptions of the White House settings.   Branch's firsthand narrative is confessional, unsparing, and personal. The author admits straying at times from his primary role -- to collect raw material for future historians -- because his discussions with Clinton were unpredictable and intense. What should an objective prompter say when the President of the United States seeks advice, argues facts, or lodges complaints against the press? The dynamic relationship that emerges from these interviews is both affectionate and charged, with flashes of anger and humor. President Clinton drives the history, but this story is also about friends.   The Clinton Tapes highlights major events of Clinton's two terms, including wars in Bosnia and Kosovo, the failure of health care reform, peace initiatives on three continents, the anti-deficit crusade, and titanic political struggles from Whitewater to American history's second presidential impeachment trial. Along the way, Clinton delivers colorful portraits of countless political figures and world leaders from Nelson Mandela to Pope John Paul II.   These unprecedented White House dialogues will become a staple of presidential scholarship. Branch's masterly account opens a new window on a controversial era and Bill Clinton's eventual place among our chief executives.",
        "Category": " History , United States , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Decorating Made Easy: Winning Windows",
        "Authors": "By Judy Sheridan",
        "Description": "",
        "Category": "",
        "Publisher": "Park Lane Press",
        "Price Starting With ($)": "10.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Season of Fire: The Confederate Strike on Washington",
        "Authors": "By Judge, Joseph",
        "Description": "",
        "Category": " History , Military , Strategy",
        "Publisher": "Howell Pr",
        "Price Starting With ($)": "6.14",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Woman Who Wouldn't",
        "Authors": "By Wilder, Gene",
        "Description": "The beloved actor and screenwriter’s second novel, set in 1903, stars a young concert violinist named Jeremy Webb, who one day goes from accomplished adagios with the Cleveland Orchestra to having a complete breakdown on stage.  If he hadn’t poured a glass of water down the throat of a tuba, maybe he wouldn’t have been sent to a health resort in Badenweiler, Germany.  But it’s in that serene place that Jeremy meets Clara Mulpas, whom he tries his hardest to seduce.  Clara is so beautiful that Jeremy finds it impossible to keep from trying to find a chink in her extraordinary reserve and elegance.  He finds himself reflexively flirting to get a reaction—after all, a tease and a wink have always worked before, with women back home.  But flirting probably isn’t the best way to appeal to a woman who was married to a dumb brute and doesn’t want to have anything more to do with men. Jeremy isn’t sure how to press his case—but he won’t give up. Wilder’s prose is elegant, spare and affecting.  But it’s his romantic’s eye for the intense emotions that animate a real love story that makes The Woman Who Wouldn’t an unforgettable book.",
        "Category": " Fiction , Literary",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "All About the Weather (Early Birds)",
        "Authors": "By Lawrie, Robin (ILT), Wells, Tony (ILT), De Saulles, Janet (EDT), and Songhurst, Hazel (EDT)",
        "Description": "A colorful and entertaining look at the questions young children commonly ask about the weather offers a clear text and charming illustrations to better clarify dozens of simple experiments and projects.",
        "Category": " Science , General",
        "Publisher": "Smithmark Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "India Unbound, From Independence to the Global Information Age",
        "Authors": "By Gucharan Das",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to New Product Development",
        "Authors": "By Bobrow, Edwin E.",
        "Description": "You're no idiot, of course.  You know a good idea when you hear one, appreciate the value of market research, and recognize the importance of innovation in today's competitive marketplace.  But when it comes to the nuts and bolts of new product delvelopment, you feel like you need to go back to school.  Get out of the classroom!  The Complete Idiot's Guide to New Product Development helps you make your creative ideas work for you.  Feel confident about researching the market building your business case, and distributing your product.  In this Complete Idiot's Guide you get:",
        "Category": " Business & Economics , Management",
        "Publisher": "Alpha",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "German Shepherds (Complete Pet Owner's Manuals)",
        "Authors": "By Hegewald-Kawich, Horst and Vriends, Matthew M. (EDT)",
        "Description": "Big, handsome, hardy, high-spirited, and good-natured, the German shepherd has been a favorite since the 1890s when it first became a registered breed. This manual advises on how to purchase a German shepherd dog, give it a place in your household, accustom the dog to children and other dogs, manage proper feeding and health care, grooming, training, exercising, and more.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Better Business Writing: Third Edition (Fifty-Minute Series Book)",
        "Authors": "By Brock, Susan L.",
        "Description": "",
        "Category": " Business & Economics , Business Writing",
        "Publisher": "Crisp Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Praise the Lord Anyway:",
        "Authors": "By Hunter, Frances",
        "Description": "",
        "Category": "",
        "Publisher": "Hunter Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Remember the Ladies: 100 Great American Women",
        "Authors": "By Cott, Nancy F. and Harness, Cheryl",
        "Description": "In a letter cautioning her husband to \"Remember the Ladies,\" Abigail Adams makes a plea for women's rights. She realized that women had the potential for greatness if only their brethren would, as Sarah Grimke wrote in 1838, \"take their feet from off our necks.\"Cheryl Harness introduces readers to 100 illustrious American women. From colonial poet Phillis Wheatley and Civil War nurse Clara Barton to comic actress Lucille Ball and Vietnam Memorial architect Maya Ying Lin, she highlights ladies of all talents, races, and eras.Cheering the advancements of recognizable leaders, the author also introduces readers to less familiar but equally important women. Her passion and humor reflect the attitudes of pioneers who pushed the boundaries of the feminine sphere to the limits--and then pushed a little further.",
        "Category": " Juvenile Nonfiction , Girls & Women",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "The 5 in 10 Chicken Breast Cookbook: 5 Ingredients in 10 Minutes or Less",
        "Authors": "By Barnard, Melanie and Dojny, Brooke",
        "Description": "Chicken Tortilla Soup is but one of the 150 delicious recipes in this cookbook, each requiring five or fewer ingredients and ten minutes or less to make. By the authors of Cheap Eats. 50,000 first printing. $25,000 ad/promo.",
        "Category": " Cooking , General",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Dictionary of Medical Terms (Barron's Medical Guides)",
        "Authors": "By Rothenberg, Mikel A.",
        "Description": "Revised edition of  Medical dictionary for the nonprofessional , 1984.  Includes thorough descriptions of diseases, symptoms, anatomy, dentistry, drugs, etc.  Many line drawings.  For 490 pages, $9.00 is cheap. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Manage Your Time (Ron Fry's How to Study Program)",
        "Authors": "By Fry, Ronald W.",
        "Description": "Includes hints, advice, and techniques for planning ahead, motivating oneself, and other skills of time management designed for students",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Career Pr Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Guys & Dogs",
        "Authors": "By Fox, Elaine",
        "Description": "A GUY VS. A DOG One of them is affectionate, loving, and eternally loyal –– a companion for life who lives only to make you happy... Small–town veterinarian Megan Rose doesn't usually wake up next to strangers. But this morning she finds one sleeping in her bed. Unfortunately, \"Baywatch\" a stray puppy, doesn't belong at the address on her tags, either: the mansion of Sutter Foley, millionaire software mogul and six fabulous feet of gorgeous, eligible male.  Sutter doesn't even like dogs. He does, however, like the sexy, spunky vet who's trying to saddle him with a pooch. The animal magnetism they share is intense, but so is the spotlight in which Sutter lives. Can Megan stand the heat? Though her outspoken ways make a lot of waves in Sutter's goldfish–bowl world, he's never enjoyed life so much. Could she be the trustworthy companion he's been looking for . . . or should he stick with the dog?  It's the old story: girl meets dog . . . girl and dog meet guy . . . guy loses girl, gets dog . . . Or will there be a frisky new twist to this puppy's tale?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Sweet Honesty (Volume 2) (Carmen Browne)",
        "Authors": "By Moore, Stephanie Perry",
        "Description": "Ten-year-old Carmen settles into her new home in Ettrick, Virginia.  It’s Christmas and Carmen has a problem: she’s bored and conspires against  her parents to have a “free day” at the mall without them. A subplot  in the story involves adopted brother, Clay, as he continues to wonder about his  real parents, and Carmen decides to help him dig into his past. Will her parents  find out about their schemes?",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "Lift Every Voice",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The History Boys: The Film",
        "Authors": "By Bennett, Alan and Hytner, Nicholas",
        "Description": "Now a major motion picture from Fox Searchlight Pictures, The History Boys: The Film contains Alan Bennett's diary of the filming, the shooting script, and an introduction by director Nicholas Hytner, as well as an extensive plate section that includes a look behind the scenes and stills from the film. An unruly bunch of bright, funny sixth-form (or senior) boys in a British boys' school are, as such boys will be, in pursuit of sex, sport, and a place at a good university, generally in that order. In all their efforts, they are helped and hindered, enlightened and bemused, by a maverick English teacher who seeks to broaden their horizons in sometimes undefined ways, and a young history teacher who questions the methods, as well as the aim, of their schooling. In The History Boys, Alan Bennett evokes the special period and place that the sixth form represents in an English boy's life. In doing so, he raises not only universal questions about the nature of history and how it is taught but also questions about the purpose of education today.",
        "Category": " Performing Arts , Screenplays",
        "Publisher": "Faber & Faber",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "The Corset Diaries",
        "Authors": "By MacAlister, Katie",
        "Description": "“Reality TV has never been more entertaining than here as the wickedly funny MacAlister has her heroine record her hilarious experiences with a quirky cast of characters and her passionate encounters with Max in a laughter-laced diary that is a saucy, sexy delight.”—BooklistNo woman in her right mind would consent to wearing a corset for a month. Especially a “skinny-challenged” woman like Tessa. But dreams of being debt-free dance in her head when she gets an offer to appear in a reality TV show. A Month in the Life of a Victorian Duke is about real people pretending to live on an English estate, circa 1879. And Tessa's leading man—a real-life Duke—is so handsome she can barely breathe, with or without the corset...",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "CURE FOR THE COMMON LIFE",
        "Authors": "By Lucado, Max",
        "Description": "\"Sweet Spot.\"Ever swung a baseball bat or paddled a Ping-Pong ball? If so, you know the oh-so-nice feel of the sweet spot. Life in the sweet spot rolls like the downhill side of a downwind bike ride. But you don't have to swing a bat or a club to know this. What engineers give sports equipment, God gave you. A zone, a region, a life precinct in which you were made to dwell. He tailored the curves of your life to fit an empty space in his jigsaw puzzle. And life makes sweet sense when you find your spot.But if you're like 70 percent of working adults, you haven't found it. You don't find meaning in your work, or you don't believe your talents are used. What can you do? You're suffering from the common life, and you desperately need a cure.Best-selling author Max Lucado has found it. In Cure for the Common Life, he offers practical tools for exploring and identifying your own uniqueness, motivation to put your strengths to work, and the perfect prescription for finding and living in your sweet spot for the rest of your life.",
        "Category": " Religion , Christian Life , Inspirational",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2010"
        }
    },
    {
        "Title": "Blow Me Down (Signet Eclipse)",
        "Authors": "By MacAlister, Katie",
        "Description": "Two sworn enemies in the Internet virtual reality game \"Buckling Swashes\"--Amy, a financial analyst, and Corbin, the game's creator--must come together to expose a dastardly plot concocted by a gaming rival, discovering that love can conquer all in both fantasy and reality. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Philippians: Maturing in the Christian Life (Back to the Bible Study Guides)",
        "Authors": "By Kroll, Woodrow",
        "Description": "Take your relationship with God to the next step!Just as there are certain things we expect will change in a person’s life as he grows up, there are certain things that should change in a person’s spiritual life as he walks with God. Paul’s letter to the Philippians is all about how we, both individually and corporately in the church, can grow into mature Christians.In each of these ten lessons, we’ll go verse-by-verse through the book of Philippians and find out exactly what it means to be a mature Christian. Through thought-provoking questions and challenging application points, you’ll be encouraged to take your relationship with God to the next step.",
        "Category": " Religion , Biblical Studies , New Testament , Paul's Letters",
        "Publisher": "Crossway Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Gripped by the Greatness of God",
        "Authors": "By MacDonald, James",
        "Description": "When was the last time you were truly gripped by God's greatness?Most Christians recall heartfelt resolutions around a fire at bible camp  as children or a revival meeting. But what causes the fervor of those experiences  to translate into a consistent life pattern? Pastor and author James MacDonald  believes that the better we understand God, the better we understand ourselves,  and the less likely we are to favor our own will over God's. He writes, \"God  is not safe and He will not be squeezed into some neat, respectable Sunday discussion...  No. To know God at all is to watch Him explode any box we put Him in with His terror,  majesty, and indescribable wonder.'\"Expounding upon Isaiah's encounters  with God, MacDonald prods snoozing saints to rediscover the wonder of God's attributes.  He also shares candidly from his experiences in life and ministry where God proved  Himself to be the Great I AM. This book will spur new and seasoned believers  alike to detest mediocrity in their spiritual walks. Ideal for individual or small  group study.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Moody Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Outside the Ordinary World",
        "Authors": "By Ostermiller, Dori",
        "Description": "Sylvia Sandon always swore she wouldn't become her mother. But one August morning she finds herself walking the same path as the fervently religious yet faithless Elaine…into an affair she feels powerless to resist.Against the backdrop of California brush fires in the 1970s, twelve-year-old Sylvia had agreed to hold a secret that would devour her family's dream of happiness. Now struggling to create a better life in small-town New England, Sylvia nonetheless feels caught in the coils of history: she confronts the embers of her dying marriage, the all-consuming needs of her two daughters and her faltering artistic career. Then Tai Rosen—the father of a student—ignites an unexpected passion and a familiar betrayal that could illuminate the past, even as it jeopardizes everything dear.Outside the Ordinary World reveals what lies beneath the surface of infidelity. But at its heart, it is the story of the powerful, sometimes disturbing bond between mothers and daughters, and the shimmering line between self-revelation and self-destruction….",
        "Category": " Fiction , Family Life , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Ian Fleming's Seven Deadlier Sins and 007's Moral Compass",
        "Authors": "By Pratt, Benjamin",
        "Description": "",
        "Category": " Religion , Biblical Studies , Bible Study Guides",
        "Publisher": "Front Edge Publishing, LLC",
        "Price Starting With ($)": "7.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "In defense of democracy; (Lawrenceville Forum lectures)",
        "Authors": "By Thomas Herbert Johnson",
        "Description": "",
        "Category": "",
        "Publisher": "Putnam",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1949"
        }
    },
    {
        "Title": "Holiday Magic",
        "Authors": "By Michaels, Fern, Carter, Mary, Lamb, Cathy, and DuLong, Terri",
        "Description": "Mistletoe, magic, twinkling lights, and stolen kisses.  .  . Experience all the wonders of the holiday season with these four irresistible stories.  .  . \"Holiday Magic\" by Fern MichaelsSki shop manager Stephanie Marshall is counting on a holiday bonus so she can put a down payment on a home for herself and her daughters. But her handsome boss, Eddie O'Brien, has his own Christmas wish--one that could lead to a lifetime of loving.  .  .   \"A Very Merry Christmas\" by Cathy LambMeredith Ghirlandaio's to-do list is already overflowing, between keeping her B&B afloat, directing the town's holiday concert, and trying to avoid rancher Logan Taylor. Doesn't he know Meredith's through with men--even rugged, alpha, drop-dead-gorgeous men? Then again, some vows were meant to be broken.  .  .   \"A Very Maui Christmas\" by Mary CarterTara Lane has the perfect plan to avoid another hellish family holiday--fly to Maui. Too bad her family decided to follow suit. But a laid-back handyman is about to prove you don't need snow to have a sparkling, sexy Christmas.  .  .   \"A Cedar Key Christmas\" by Terri DuLong  Single mom Josie Sullivan is proud of her young daughter, Orli, for helping local fisherman Mr. Al restore his crumbling home. And when Mr. Al's nephew, Ben, pays a visit, Josie realizes just how much Christmas magic one good deed can bring.  .  .",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Zebra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2013"
        }
    },
    {
        "Title": "Mimmetta Lo Monte's Classic Sicilian Cooking",
        "Authors": "By Lo Monte, Mimmetta",
        "Description": "In a collection of more than two hundred authentic Sicilian favorites, a restaurateur provides recipes for meat, poultry, fish, vegetables, and desserts, and accompanies them with historical vignettes and anecdotes",
        "Category": " Cooking , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Five Minutes' Peace",
        "Authors": "By Murphy, Jill",
        "Description": "Seeking five minutes of peace away from her noisy children, Mrs. Large sneaks off to take a hot bath, only to be joined by Lester and his flute, Laura and her book, and the baby with all his toys. Reprint.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "macaulay: the history of england",
        "Authors": "By macaulay & trevor-roper, h. r.",
        "Description": "",
        "Category": "",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Le Cordon Bleu Home Collection: Chicken",
        "Authors": "By Le Cordon Bleu Chefs",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Poultry",
        "Publisher": "Periplus Editions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Dr Faustus (New Mermaid Series)",
        "Authors": "By Marlowe, Christopher and Gill, Roma",
        "Description": "New Mermaids are modernized and fully-annotated editions of classic English plays. Each volume includes: The playtext, in modern spelling, edited to the highest bibliographical and textual standards Textual notes recording significant changes to the copytext and variant readings Glossing notes explaining obscure words and word-play Critical, contextual and staging notes Photographs of productions where applicable A full introduction which provides a critical account of the play, the staging conventions of the time and recent stage history; discusses authorship, date, sources and the text; and gives guidance for further reading.Edited and updated by leading scholars and printed in a clear, easy-to-use format, New Mermaids offer invaluable guidance for actor, student, and theatre-goer alike.",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Sixty Things to Do When You Turn Sixty: 60 Experts on the Subject of Turning 60",
        "Authors": "By Sellers, Ronnie (EDT)",
        "Description": "Compiling essays by doctors, celebrities, financial experts, and others, seeks to provide information for those about to turn sixty on topics ranging from health and fitness to sex and investments.",
        "Category": " Self-help , Aging",
        "Publisher": "Ronnie Sellers Productions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The terminal generation",
        "Authors": "By Lindsey, Hal, Carlson, Carole C.",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Complete Idiot's Guide to Weight Loss (The Complete Idiot's Guide)",
        "Authors": "By Beale, Lucy, Couvillon, Sandy G., Hutcheson, Katherine A., Donnelley, Beverly, and Beale, Sandy",
        "Description": "",
        "Category": " Cooking , Health & Healing , Weight Control",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Henderson the Rain King",
        "Authors": "By Saul Bellow",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Crest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "Love is a Verb: Stories of What Happens When Love Comes Alive",
        "Authors": "By Chapman, Gary D.",
        "Description": "Dr. Gary Chapman has spent his life helping people communicate love more effectively and in turn build more satisfying and lasting relationships. His book The Five Love Languages is a regular on the New York Times Best Sellers list--even after being in print for fifteen years--and has made the term \"love language\" a part of everyday speech.Love Is a Verb takes his teaching to the next level. Rather than a typical marriage self-help book filled with lengthy explanations of principles and techniques, it is a compilation of true stories displaying love in action. These stories--written by everyday people--go straight to the hearts of readers, who often say that illustrations are the most effective parts of a book. Gary Chapman adds a \"Love Lesson\" to each story, showing readers how they can apply the same principles to their own relationships.",
        "Category": " Religion , Christian Life , Love & Marriage",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Willing Spirits",
        "Authors": "By Schieber, Phyllis",
        "Description": "A novel Jodi Picoult calls \"beautifully written, full of wit...and heart,\" from the author ofThe Sinner's Guide to Confession.Both teachers in their forties, Jane Hoffman and Gwen Baker have a friendship that has helped them endure. It was Jane who looked after Gwen when her husband left her with two young sons to raise. And when Jane comes home one day unexpectedly and finds her husband in a shameless act of betrayal, she turns to Gwen for support.Now, tested by additional personal crises, Jane and Gwen face new challenges-as mothers, as daughters, as women. And in the process, they will learn unexpected truths about their friendship-and themselves.",
        "Category": " Fiction , Women",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Pillsbury Annual Recipes 2010 (Annual Recipes including Pillsbury Bake Off Contest Winners, 2010)",
        "Authors": "By Pillsbury",
        "Description": "",
        "Category": "",
        "Publisher": "Pilsbury",
        "Price Starting With ($)": "6.78",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Decorative Painting 1-2-3 (HOME DEPOT Expert Advice From The Home Depot)",
        "Authors": "By The Home Depot",
        "Description": "",
        "Category": " House & Home , Decorating",
        "Publisher": "The Home Depot",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Aquarium Fish",
        "Authors": "By Schliewen, Ulrich",
        "Description": "Praised by life scientists for its accuracy, this valuable text is fascinating and very useful to new or experienced hobbyists. Practical advice is coupled with detailed profiles of virtually every freshwater fish. 300 outstanding, high-quality photos and informative, accurate line drawings complete this indispensable guide.",
        "Category": " Pets , Fish & Aquariums",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Before We Were Free (Laurel-Leaf Books Readers Circle)",
        "Authors": "By Alvarez, Julia",
        "Description": "Anita de la Torre never questioned her freedom living in the Dominican Republic. But by her 12th birthday in 1960, most of her relatives have emigrated to the United States, her Tío Toni has disappeared without a trace, and the government’s secret police terrorize her remaining family because of their suspected opposition of el Trujillo’s dictatorship.Using the strength and courage of her family, Anita must overcome her fears and fly to freedom, leaving all that she once knew behind.From renowned author Julia Alvarez comes an unforgettable story about adolescence, perseverance, and one girl’s struggle to be free.",
        "Category": " Young Adult Fiction , Social Themes , General",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Boom, Bust & Echo: How to Profit from the Coming Demographic Shift",
        "Authors": "By Foot, David K. and Stoffman, Daniel",
        "Description": "",
        "Category": "",
        "Publisher": "Saint Anthony Messenger Press and Franciscan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Praying Through Life's Problems (Extraordinary Women)",
        "Authors": "By Omartian, Stormie (EDT)",
        "Description": "In this book, Stormie Omartian shows women how to pray through life's most difficult times.",
        "Category": " Religion , Christian Life , Prayer",
        "Publisher": "Integrity Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "My Very First Book (School Days Board Books)",
        "Authors": "By Michi Fujimoto",
        "Description": "",
        "Category": "",
        "Publisher": "Paradise Press, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The joy of caring",
        "Authors": "By Collins, Gary",
        "Description": "",
        "Category": "",
        "Publisher": "Word Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Nine Crazy Ideas in Science (Few Might Even Be True)",
        "Authors": "By Ehrlich, Robert",
        "Description": "AIDS is not caused by HIV. Coal and oil are not fossil fuels. Radiation exposure is good for you. Distributing more guns reduces crime. These ideas make headlines, but most educated people scoff at them. Yet some of science's most important concepts-from gravity to evolution-have surfaced from the pool of crazy ideas. In fact, a good part of science is distinguishing between useful crazy ideas and those that are just plain nutty. In this book, a well-known physicist with an affinity for odd ideas applies his open mind to nine controversial propositions on topical subjects. Some, it turns out, are considerably lower on the cuckoo scale than others.  Robert Ehrlich evaluates, for the general reader or student, nine seemingly far-out propositions culled from physics, biology, and social science. In the process, he demonstrates in easy-to-understand terms how to weigh an argument, judge someone's use of statistics, identify underlying assumptions, and ferret out secret agendas. His conclusions are sometimes surprising. For instance, he finds that while HIV does cause AIDS and the universe almost certainly started with a big bang, our solar system could have two suns, faster-than-light particles might exist, and time travel can't be ruled out as mere science fiction.  Anyone interested in unorthodox ideas will get a kick out of this book. And, as a fun way of learning how to think like a scientist, it has enormous educational value. Of course, only time will tell whether any of these nine ideas will be the next continental drift--the now orthodox account of the Earth's geology that was for years just a crazy idea.",
        "Category": " Science , General",
        "Publisher": "Princeton University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Fair Blows the Wind",
        "Authors": "By Louis L'Amour",
        "Description": "When his family's castle is pillaged and his parents killed, young Tattom Chantry flees Ireland for England, where he learns swordsmanship, hobnobs with Shakespeare's cronies, and sets sail for America, love, and fortune",
        "Category": "",
        "Publisher": "Bantam Doubleday Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1900"
        }
    },
    {
        "Title": "Metamorphosis and Other Stories (Barnes & Noble Classics Series)",
        "Authors": "By Kafka, Franz, Baker, Jason (INT), and Freed, Donna",
        "Description": "&&LDIV&&R&&LDIV&&R&&LI&&RThe Metamorphosis and Other Stories&&L/I&&R, by &&LB&&RFranz Kafka&&L/B&&R, is part of the &&LI&&R&&LI&&RBarnes & Noble Classics&&L/I&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriate&&LP style=\"MARGIN: 0in 0in 0pt\"&&RAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/P&&R&&L/DIV&&R&&L/DIV&&R&&L/DIV&&R&&LDIV&&R &&L/DIV&&R&&LDIV&&RVirtually unknown during his lifetime, &&LB&&RFranz Kafka&&L/B&&R is now one of the world’s most widely read and discussed authors. His nightmarish novels and short stories have come to symbolize modern man’s anxiety and alienation in a bizarre, hostile, and dehumanized world. This vision is most fully realized in Kafka’s masterpiece, “&&LI&&RThe Metamorphosis&&L/I&&R,” a story that is both harrowing and amusing, and a landmark of modern literature. &&LP&&RBringing together some of Kafka’s finest work, this collection demonstrates the richness and variety of the author’s artistry. “&&LI&&RThe Judgment&&L/I&&R,” which Kafka considered to be his decisive breakthrough, and “&&LI&&RThe Stoker&&L/I&&R,” which became the first chapter of his novel &&LI&&RAmerika&&L/I&&R, are here included. These two, along with “&&LI&&RThe Metamorphosis&&L/I&&R,” form a suite of stories Kafka referred to as “The Sons,” and they collectively present a devastating portrait of the modern family. &&L/P&&R&&LP&&RAlso included are “&&LI&&RIn the Penal Colony&&L/I&&R,” a story of a torture machine and its operators and victims, and “&&LI&&RA Hunger Artist&&L/I&&R,” about the absurdity of an artist trying to communicate with a misunderstanding public. Kafka’s lucid, succinct writing chronicles the labyrinthine complexities, the futility-laden horror, and the stifling oppressiveness that permeate his vision of modern life. &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R&&LSTRONG&&RJason Baker&&L/B&&R&&L/B&&R is a writer of short stories living in Brooklyn, New York.&&L/P&&R&&L/DIV&&R",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Barnes & Noble Classics",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Just Enough Dutch (Just Enough Phrasebook Series)",
        "Authors": "By Ellis, D. L. and Luit, D. Van Der",
        "Description": "",
        "Category": " Foreign Language Study , Dutch",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "The Archer Method of Winning at 21",
        "Authors": "By Archer, John",
        "Description": "",
        "Category": " Games & Activities , Gambling , General",
        "Publisher": "Wilshire Book Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "Financial Accounting in an Economic Context",
        "Authors": "By Pratt, Jamie",
        "Description": "\"Financial Accounting in an Economic Context has become an important part of the curriculum in many MBA programs. Grounded in financial statements, Pratt's Financial Accountinghelps students see the impact of transactions on overall business decisions. The text enables MBA students to become effective managers and decision-makers by encouraging them to develop a conceptual understanding of the impact that economic events have on a business. The newest edition on this popular text addresses topics that today's accountants and managers must consider: increased impacts of IFRS, fair value reporting, segment reporting and an earnings management framework. While addressing recent developments and maintaining the perspective of the previous editions, FinancialAccounting in an Economic Context 8th Editionoffers new elements designed to sharpen the text's economic decisions-making foundation. The text highlights the differences between IFRS and GAAP throughout each chapter. Each chapter closes with a \"Issue forDiscussion\" feature, allowing students to apply data found in the financial statements of an international company. New boxed-in features illustrate the effects of accounting transitions on cash flow of statements and new end of chapter items address thecash flow effects of accounting transactions\"--",
        "Category": " Business & Economics , Economics , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "7.83",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The Pup Speaks Up (Step into Reading, Step 1)",
        "Authors": "By Hays, Anna Jane and Petrone, Valeria (ILT)",
        "Description": "Pal is a pup who’s a bit on the quiet side. But after some gentle prodding and encouragement from a few “talkative” friends, the pup finds the courage to speak up and take his final bow-wow!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Home Again (The Chesapeake Diaries)",
        "Authors": "By Stewart, Mariah",
        "Description": "New York Times bestselling author Mariah Stewart presents a captivating contemporary romance novel in the tradition of Robyn Carr, Susan Mallery, and Barbara Freethy.Dallas MacGregor is living the Hollywood dream. At thirtysomething, she’s an award-winning actress beloved by the public and bound for even bigger success. But when her soon-to-be-ex-husband, producer Emilio Baird, is caught in a sex scandal, Dallas’s charmed life turns tabloid nightmare. Determined to shield her young son, Cody, from the ugly uproar, Dallas seeks refuge in sleepy St. Dennis, Maryland—the Chesapeake Bay town where her happiest childhood days were spent. Reunited with her boisterous great-aunt, Dallas wants nothing more than to leave her Hollywood days behind. And when she crosses paths with local veterinarian Grant Wyler, her high school summer love, she finds he’s everything she remembers, and more—and that the spark is still there. But Dallas’s promising new life takes a troubling turn when the unimaginable happens and she finds herself living a mother’s worst nightmare—and Emilio storms into St. Dennis to save the day, along with his damaged career. Trapped in the unwanted glare of the limelight once again, Dallas discovers that it’s coolheaded Grant who is willing to risk everything to protect her and her son, and to secure the future they were always meant to share.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Help Me Live: 20 Things People with Cancer Want You to Know",
        "Authors": "By Hope, Lori",
        "Description": "When we hear that someone close to us has been diagnosed with cancer, we want nothing more than to comfort them with words of hope, support, and love. But sometimes we don't know what to say or do and don't feel comfortable asking. With sensitive insights and thoughtful anecdotes, Help Me Live provides a personal yet thoroughly researched account of words and actions that are most helpful.",
        "Category": " Health & Fitness , Diseases , Cancer",
        "Publisher": "Celestial Arts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Captain and Matey Set Sail (I Can Read Level 2)",
        "Authors": "By Munoz, Claudio (ILT) and Laurence, Daniel",
        "Description": "A rollicking high seas adventure for beginning readers about two feisty and funny pirates. Sail the seven seas in this swashbuckling adventure! Together with their faithful parrot, Squawk, Captain and Matey sing and dance, rescue a stranded pirate, and hunt for buried treasure. Though these two feisty pirates rarely agree on anything, in their quest for riches they discover their friendship is worth more than gold. Beginning readers are sure to enjoy the comic interplay between these two silly pirates brought to life by Claudio Muñoz's exceptional art. Ages 6-8",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Fifteen Animals! (Boynton on Board)",
        "Authors": "By Boynton, Sandra",
        "Description": "The amazing Bob! The amazing Boynton! Because who else but Sandra Boynton could imagine 15 Bobs in one book? Actually, that&#39;s 14 Bobs, and one Simon James Alexander Ragsdale the Third (he&#39;s a turtle), which gives Fifteen Animals! the added dimension of being a unique counting book—count the Bobs, count the pets, count the bunnies, count the fish. Fifteen Animals! also comes with a free song available via download. It&#39;s all the energy and appeal of Boynton: the lively language, distinctive illustrations, and inimitable characters. And music. And counting. And, for the first time, a person character, an earnest little boy who loves animals and happily sings: I really like animals, I like them a lot. Fifteen animals is what I’ve got. I’ve got fifteen animals. They&#39;re friendly and tame, and I’ve given each one a special name. Make that Bob.",
        "Category": " Juvenile Nonfiction , Poetry , Humorous",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Spirit Matters",
        "Authors": "By Lerner, Michael",
        "Description": "",
        "Category": " Philosophy , Metaphysics",
        "Publisher": "Hampton Roads Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Cyrano De Bergerac: An Heroic Comedy in Five Acts: A New Version in English Verse By Brian Hooker",
        "Authors": "By Rostand, Edmond and Hooker, Brian",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Ivory Hollyhock",
        "Authors": "By Frisk, Dreama Wyant",
        "Description": "",
        "Category": "",
        "Publisher": "Six July Press",
        "Price Starting With ($)": "10.0",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Daddies and Daughters: Tender Moments Lasting Joys",
        "Authors": "By Berry, Carmen Renee and Barrington, Lynne",
        "Description": "The coauthor of the New York Times best-seller, Girlfriends, celebrates the father-daughter relationship in stories that capture its many dimensions and periods, united by the themes of love, separation, and reconciliation. 100,000 first printing. Tour.",
        "Category": " Family & Relationships , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Winterpast",
        "Authors": "By La Fleur, Claire Genevieve, Illustrated by:",
        "Description": "",
        "Category": "",
        "Publisher": "TLF Publications",
        "Price Starting With ($)": "7.34",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Anticipation: Waiting on Tiptoes for the Lord",
        "Authors": "By Williams, Hyveth",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Pacific Pr Pub Assn",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Memorable Scenes from Old Testament Homes: Bible Study Guide",
        "Authors": "By Swindoll, Charles R.",
        "Description": "",
        "Category": "",
        "Publisher": "Insight for Living",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Getting to the 21st Century: Voluntary Action and the Global Agenda (Kumarian Press Library of Management for Development)",
        "Authors": "By Korten, David C.",
        "Description": "",
        "Category": " Political Science , Public Policy , Social Services & Welfare",
        "Publisher": "Kumarian Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "The Berenstain Bears Inside Outside Upside Down",
        "Authors": "By Berenstain, Stan and Berenstain, Jan",
        "Description": "Brother Bear gets into a box. Papa Bear turns the box upside down, takes it outside, and puts it on a truck. The simple art and rhyming text make this a perfect choice for teaching spatial concepts.",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Murder Most Merry",
        "Authors": "By Browning, Abigail (EDT)",
        "Description": "A great holiday gift for mystery fans, this new short story collection of over thirty Christmas tales of crime contains contributions from some of the best writers of the genre: Patricia Moyes, John D. MacDonald, Rex Stout, Julian Symons, Georges Simenon, Margery Allingham, Lawrence Block, John Mortimer and many others. These holiday tales with a murderous twist include suspicious Santa's helpers; a Christmas pageant player who assumes the role of a killer; and evil elves with malicious intentions. Beware of hanging mistletoe and stuffed stockings this season, as you celebrate a creepy Christmas with Murder Most Merry.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "The Complete Home Guide to Furniture Finishing and Refinishing",
        "Authors": "By Gladstone, Bernard",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Baa-Choo! (I Can Read Level 1)",
        "Authors": "By Manning, Jane (ILT) and Weeks, Sarah",
        "Description": "Sam the lamb has a bad cold. But every time he thinks he is going to sneeze, he only gets as far as \"Baa . . . ahhh . . .\" No choo!  Sarah Weeks′ rhyming tale and Jane Manning′s lively art make for a hilarious barnyard romp.  Ages 4+",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Daughter of China : A True Story of Love and Betrayal",
        "Authors": "By Xu, Meihong and Engelmann, Larry",
        "Description": "This is the story of Meihong Xu, a woman trained as an elite member of the Chinese Army, who fell in love with a visiting American professor on whom she had been told to spy. Interspersed with flashbacks to Meihong's childhood, this is a tale of humanity triumphing over brutality.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Headline Book Pub Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The Everyday Gourmet: Fast and Fabulous Microwave Recipes",
        "Authors": "By Trittipo, Jane",
        "Description": "",
        "Category": " Cooking , Methods , Microwave",
        "Publisher": "Creative Cookery",
        "Price Starting With ($)": "8.43",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Honor Killing",
        "Authors": "By Timmerman, Kenneth R.",
        "Description": "",
        "Category": "",
        "Publisher": "Middle East Data Project, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Nobody's Safe",
        "Authors": "By Steinberg, Richard",
        "Description": "Gregory Picaro is the finest safecracker and break-in artist in the world. There is no safe, no lock, no security system that can keep him out.But some things are better left locked away. One evening, on a seemingly routine apartment burglary, Greg is caught with his guard down. Concealed in the owner's closet, Greg covertly witnesses an interrogation of his mark by three men in dark, conservative suits. Unable to crack the owner for the combination to his hidden safe, they torture and murder him in cold blood. Greg keeps his cool, and as the men in black regroup to dispose of the body, Greg picks the safe clean. What he finds in the stash is both perplexing and revelatory, and something that the highest and hidden levels of the government will kill to keep secret.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Soul Battle: It's Not Against Flesh and Blood",
        "Authors": "By Thompson, Jill",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Evangel Pub House",
        "Price Starting With ($)": "6.79",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "The Only Life That Mattered: The Short and Merry Lives of Anne Bonny, Mary Read, and Calico Jack Rackam",
        "Authors": "By Nelson, James L.",
        "Description": "Fed up with an outlaw existence, Calico Jack Rackam swears off the pirate life, until he meets Anne Bonny, a woman who would as soon stab a man as give him a good tumble&#151;that is, unless he's a pirate. Soon Jack finds himself out on the high seas, with Anne by his side and his men spoiling for action.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Lyons Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "The Story of Abraham (Great Bible Stories)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Unknown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1953"
        }
    },
    {
        "Title": "Ronald Reagan: In God I Trust",
        "Authors": "By Reagan, Ronald",
        "Description": "",
        "Category": "",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Favorite Brand Name Low-Carb Grilling",
        "Authors": "By",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Frogs, Toads & Turtles: Take Along Guide (Take Along Guides)",
        "Authors": "By Garrow, Linda (ILT) and Burns, Diane L.",
        "Description": "An introduction to the world of insects, caterpillars, and butterflies including identification nformation, educational activities, and fun facts.Invites young naturalists to spot wildlife. Safety tips are provided and interesting activities are sugested. Color illustrations enhance the presentation. —-HORN BOOKS (Tracks, Scats and Signs)",
        "Category": " Juvenile Nonfiction , Animals , Reptiles & Amphibians",
        "Publisher": "Cooper Square Publishing Llc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Froggy's Day with Dad",
        "Authors": "By Remkiewicz, Frank (ILT) and London, Jonathan",
        "Description": "It’s Father’s Day at last, and Froggy is so-o-o excited. \"We’re going to play golf!\" he tells his dad. Oh no. Dad says Froggy’s too little for golf. \"But you’re just the right size to play miniature golf!\" he explains. At the fun park, Froggy discovers mini golf is fun—especially once he figures out how to face the right way. With his beginner’s luck, Froggy makes a hole in one! But his next shot hits his dad on the head—bonk!—and that’s only the beginning. All ends well, though, when Froggy presents his dad with a special coffee mug he decorated in school: To the Best Dad I Ever Had!",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Celebrate Freedom: Songs, Symbols, and Sayings of the United States",
        "Authors": "By Scott Foresman",
        "Description": "",
        "Category": "",
        "Publisher": "Scott Foresman",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "THE ART OF FILO: International Entrees, Appetizers & Desserts Wrapped in Flaky Pastry",
        "Authors": "By Sousanis, Marti",
        "Description": "",
        "Category": "",
        "Publisher": "Aris Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "In the Court of Public Opinion (Borzoi Books)",
        "Authors": "By Alger Hiss",
        "Description": "",
        "Category": "",
        "Publisher": "Alfred Knopf",
        "Price Starting With ($)": "21.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "The Poky Little Puppy's First Christmas",
        "Authors": "By Korman, Justine and Chandler, Jean (ILT)",
        "Description": "Five little puppies celebrate Christmas with their friends.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Germany (Eyewitness Travel Guides)",
        "Authors": "By DK Publishing",
        "Description": "The guide that shows you what other travel books only tell you! With over 1,700 full-color photographs, unique cutaway pictures, easy-to-follow graphic illustrations and 3-D maps of Berlin and Munich, DK's Eyewitness Travel Guide: Germany helps you explore this fascinating country while providing history and a glance of Germany throughout the year. Whether taking a hike through the Black Forest or exploring Frederick the Grate's Palace of Sans Souci, the guide highlights everything important in each of Germany's 16 states. Includes lists of restaurants, hotels, attractions and museums, as well as key sights and sporting events.",
        "Category": " Travel , Europe , Germany",
        "Publisher": "DK Travel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "And Still We Rise: Interviews With 50 Black Role Models",
        "Authors": "By Reynolds, Barbara A.",
        "Description": "Fifty successful Black Americans discusses the rewards and challenges of their lives and offer advice on how to reach one's goals",
        "Category": " Biography & Autobiography , General",
        "Publisher": "USA Today Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Classic Advice on Managing Systems (Harvard Business Reviews on Management, Vol 2)",
        "Authors": "By Harvard Business Review",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins (paper)",
        "Price Starting With ($)": "5.98",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "Great Expectations (Barnes & Noble Classics)",
        "Authors": "By Dickens, Charles and Jones, Radhika (INT)",
        "Description": "&&LDIV&&R&&LDIV&&R&&LDIV&&R&&LI&&RGreat Expectations&&L/I&&R, by &&LB&&RCharles Dickens&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R&&LI&&R&&L/I&&R &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R&&LI&&RGreat Expectations&&L/I&&R, described by G. K. Chesterton as a “study in human weakness and the slow human surrender,” may be called &&LSTRONG&&RCharles Dickens&&L/B&&R’s finest moment in a remarkably illustrious literary career.&&LBR&&R&&LBR&&RIn an overgrown churchyard, a grizzled convict springs upon an orphan named Pip. The convict terrifies the young boy and threatens to kill him unless Pip helps further his escape. Later, Pip finds himself in the ruined garden where he meets the bitter and crazy Miss Havisham and her foster child Estella, with whom he immediately falls in love. After a secret benefactor gives him a fortune, Pip moves to London, where he cultivates great expectations for a life which would allow him to discard his impoverished beginnings and socialize with the idle upper class. As Pip struggles to become a gentleman and is tormented endlessly by the beautiful Estella, he slowly learns the truth about himself and his illusions.&&LBR&&R&&LBR&&RWritten in the last decade of his life, &&LI&&RGreat Expectations&&L/I&&R reveals Dickens’s dark attitudes toward Victorian society, its inherent class structure, and its materialism. Yet this novel persists as one of Dickens’s most popular. Richly comic and immensely readable, &&LI&&RGreat Expectations&&L/I&&R overspills with vividly drawn characters, moral maelstroms, and the sorrow and pity of love.&&L/P&&R&&LP&&R&&LB&&RRadhika Jones&&L/B&&R is a doctoral candidate in English and comparative literature at Columbia University and the managing editor of &&LI&&RGrand Street magazine&&L/I&&R.&&L/P&&R&&L/DIV&&R&&L/B&&R&&L/DIV&&R&&L/B&&R",
        "Category": " Fiction , Classics",
        "Publisher": "Barnes & Noble Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The Causes of the American Revolution [Problems in American Civilization]",
        "Authors": "By WAHLKE, JOHN C.",
        "Description": "",
        "Category": "",
        "Publisher": "D. C. Heath and Company",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1950"
        }
    },
    {
        "Title": "German Expressionist Watercolors from the Collections of the Wallraf-Richartz Museum, Cologne",
        "Authors": "By Horst Keller",
        "Description": "",
        "Category": "",
        "Publisher": "International Exhibitions Foundation",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "How to Advertise: A Professional Guide for the Advertiser. What Works. What Doesn't. And Why.",
        "Authors": "By Roman, Kenneth, Maas, Jane",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1977"
        }
    },
    {
        "Title": "Jane Austen: A Life (Penguin Lives Biographies)",
        "Authors": "By Shields, Carol",
        "Description": "With the same sensitivity and artfulness that are the trademarks of her award-winning novels, Carol Shields explores the life of a writer whose own novels have engaged and delighted readers for the past two hundred years. In Jane Austen, Shields follows this superb and beloved novelist from her early family life in Steventown to her later years in Bath, her broken engagement, and her intense relationship with her sister Cassandra. She reveals both the very private woman and the acclaimed author behind the enduring classics Sense and Sensibility, Pride and Prejudice, and Emma. With its fascinating insights into the writing process from an award–winning novelist, Carol Shields’s magnificent biography of Jane Austen is also a compelling meditation on how great fiction is created.",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Book of Vegetarian Cooking",
        "Authors": "By Pickford, Louise and Stewart, Jon (PHT)",
        "Description": "",
        "Category": " Cooking , Vegetarian",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    }
]