[
    {
        "Title": "Suzanne Somers' Get Skinny on Fabulous Food",
        "Authors": "By Somers, Suzanne and Schwarzbein, Diana (FRW)",
        "Description": "Somersize your way to weight loss and good health!Find out why Somersizing has swept the nation! In Get Skinny on Fabulous Food, the number one New York Times bestseller and sequel to Eat Great, Lose Weight, which also went to the top of the Times list, Suzanne Somers will show you how to shed pounds for good and have more energy than ever before -- without dieting. This lifestyle-altering book provides you with:* The guilt-free way to lose weight and reprogram your metabolism -- including more than 100 delicious Somersized recipes that leave you both satisfied and indulged* Breakthrough research on food and nutrition that changes the way you think about your body* Moving personal testimonials guaranteed to motivate and encourage you* An easy-to-follow weight-loss plan that teaches you how to combine foods properly so that you'll get, and stay, skinny without feeling deprived Join the millions of people who have lost weight safely and effectively with Get Skinny on Fabulous Food and start celebrating good health and good times with Suzanne's delectable, simple, and balanced Somersized meals.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "The President and Mrs. Reagan: An American Love Story",
        "Authors": "By Benson, Harry, Davis, Patti (INT), and Benson, Gigi",
        "Description": "A pictorial tribute to the Reagan marriage by their favorite photographer showcases images that were taken over the course of forty years for such publications as Life and Vanity Fair, includes a special final new portrait, and features an introduction by the Reagan's daughter.",
        "Category": " Photography , Subjects & Themes , Portraits & Selfies",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Life: Christmas Around the World",
        "Authors": "By Sullivan, Robert (EDT)",
        "Description": "Christmas customs from around the world are revealed in more than 150 photographs in a beautiful keepsake book that ranges from an observance of the winter soltice at Stonehenge to the origins of the holiday in the Holy Land. 25,000 first printing.",
        "Category": " Art , General",
        "Publisher": "Life",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Bathroom remodeling (Black & Decker Home Improvement Library)",
        "Authors": "By Paul Currie",
        "Description": "",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Cy DeCosse Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Holly-Jolly Christmas Crafts Under $10 (Clever Crafter)",
        "Authors": "By Oxmoor House",
        "Description": "",
        "Category": " Crafts & Hobbies , Holiday & Seasonal",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Paint Transformations (Do It Now Do It Fast Do It Right)",
        "Authors": "By Snyder, Tim (EDT) and Powell, Melanie (ILT)",
        "Description": "Transforming a room with paint is easier and more fun using this colorfully illustrated guide. Paint Transformations features an inspiring variety of design ideas, reveals the nuts and bolts of the process, and includes step-by-step photos that cover every aspect of the job and information on tools and materials. This fresh look at one of the most popular home improvement activities covers everything from paint selection and surface preparation to basic painting tasks and beautiful decorative painting projects and contains special sections on dry brush techniques like strie and chambray, stencils, and splatter techniques.",
        "Category": " House & Home , Decorating",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Fighting for Your Marriage: Positive Steps for Preventing Divorce and Preserving Lasting Love",
        "Authors": "By Markman, Howard, Stanley, Scott, and Blumberg, Susan L.",
        "Description": "Conflict in intimate relationships is as normal and essential as love. How you fight and resolve conflicts determines the difference between a sustained healthy and satisfying marriage or endless pain, frustration, and often divorce. At a time when families are falling apart at alarming rates and with enormous social cost, this book provides a research-based program to prevent relationship breakdown. The new audiotape set provides the key to the communication skills of PREPTM.",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Hugh Johnson's Pocket Encyclopedia of Wine, 1998",
        "Authors": "By Johnson, Hugh",
        "Description": "This fully revised and updated edition of the annual guide to the wines of the world includes more than six thousand foreign and domestic wines, regional maps, vintage charts, and information on the history, production, and appreciation of wine. Original. 90,000 first printing.",
        "Category": " Cooking , Reference",
        "Publisher": "Fireside",
        "Price Starting With ($)": "7.71",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "The New Year's Eve Compendium: Toasts, Tips, Trivia and Tidbits for Bringing in the New Year",
        "Authors": "By Lyon, Todd",
        "Description": "From selecting a distinctive champagne without breaking the bank, to preparing outstanding hors d'oeuvres, to kicking off a party with pinache, a New Year's Eve handbook includes predictions for the year 2000 and historical trivia. 20,000 first printing.",
        "Category": " Cooking , Holiday",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "When Is It Great To Turn Green? (An Environment Q & A)",
        "Authors": "By Drohan, Michele Ingber",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "True at First Light: A Fictional Memoir",
        "Authors": "By Hemingway, Ernest and Hemingway, Patrick (EDT)",
        "Description": "Both revealing self-portrait and dramatic fictional chronicle of his final African safari, Ernest Hemingway's last unpublished work was written when he returned from Kenya in 1953. Edited by his son Patrick, who accompanied his father on the safari, True at First Light offers rare insights into the legendary American writer in the year of the hundredth anniversary of his birth.  A blend of autobiography and fiction, the book opens on the day his close friend Pop, a celebrated hunter, leaves Ernest in charge of the safari camp and news arrives of a potential attack from a hostile tribe. Drama continues to build as his wife, Mary, pursues the great black-maned lion that has become her obsession. Spicing his depictions of human longings with sharp humor, Hemingway captures the excitement of big-game hunting and the unparalleled beauty of the scenery -- the green plains covered with gray mist, zebra and gazelle traversing the horizon, cool dark nights broken by the sounds of the hyena's cry.  As the group at camp help Mary track her prize, she and Ernest suffer the \"incalculable casualties of marriage,\" and their attempts to love each other well are marred by cruelty, competition and infidelity. Ernest has become involved with Debba, an African girl whom he supposedly plans to take as a second bride. Increasingly enchanted by the local African community, he struggles between the attraction of these two women and the wildly different cultures they represent.  In True at First Light, Hemingway also chronicles his exploits -- sometimes hilarious and sometimes poignant -- among the African men with whom he has become very close, reminisces about encounters with other writers and his days in Paris and Spain and satirizes, among other things, the role of organized religion in Africa. He also muses on the act of writing itself and the author's role in determining the truth. What is fact and what is fiction? This is a question that was posed by Hemingway's readers throughout his career and is one of his principal subjects here.  Equally adept at evoking the singular textures of the landscape, the thrill of the hunt and the complexities of married life, Hemingway weaves a tale that is rich in laughter, beauty and profound insight. True at First Light is an extraordinary publishing event -- a breathtaking final work from one of this nation's most beloved and important writers.",
        "Category": " Fiction , Classics",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "The Woven Figure: Conservatism and America's Fabric",
        "Authors": "By Will, George F.",
        "Description": "In a collection of essays, one of America's foremost conservative political commentators addresses such topics as inflation, the Gingrich revolution, and the arrogance of government and its inability to correct human nature. 100,000 first printing. Tour.",
        "Category": " Political Science , Political Process , Political Parties",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "And the World Came His Way",
        "Authors": "By Dodd, John",
        "Description": "",
        "Category": "",
        "Publisher": "Jesse Helms Center",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Living in Love",
        "Authors": "By Stoddard, Alexandra",
        "Description": "In Living in Love, Alexandra Stoddard shows us how to infuse our minds and hearts with such creative passion for living and loving that joy will fill our years. Inspired by her own twenty-three-year marriage to Peter Megargee Brown, Stoddard shares ideas, secrets, and luminous stories about what it means to be in love, stay in love, and extend ourselves in love to the world.",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Your Sixth Sense: Activating Your Psychic Potential",
        "Authors": "By Naparstek, Belleruth",
        "Description": "You know the feeling -- deja vu, already knowing what someone will say before they speak, a gut instinct that overrides logic, hearing from a distant friend you&#39;d only just thought of that day. It happens to everyone, but few of us acknowledge these occurrences as manifestations of our own psychic ability. Now, bestselling author Belleruth Naparstek reclaims the world of psychic phenomena from its sideshow trappings, examining scientific data and showing each of us how to tap our own latent powers of awareness and perception.  Naparstek, one of the country&#39;s leading teachers and speakers on developing the powers of the mind and heart, has trained thousands of individuals in using guided imagery techniques for psychic development and improved health and healing. Her powerful techniques have reached a wide audience--from \"the intuitively gifted to those whose third eye seemed virtually cemented shut.\"  With Your Sixth Sense,  Naparstek shares her proven methods in a guide that is both practical and wonderfully informative. Based on her own experience, her work with clients, and interviews with more than forty highly skilled \"intuitives,\" or psychics, Your Sixth Sense provides both a  thorough exploration of the nature of psychic ability--how and why it works--and a step-by-step guide filled with specific suggestions and  exercises carefully designed to help you foster, track, and illuminate your own rich output of psychic experience.  In an engaging, conversational style, Naparstek tackles the subject so often shunted to the realm of cut-rate fortune tellers, psychic hotlines, and television exposes on the paranormal, offering a thoroughly accessible scientific explanation of the physics of ESP, a detailed description of what happens in the mind just before and during an intuitive \"pop,\" and much more. Your Sixth Sense is the only guide you&#39;ll need for recognizing, utilizing, and expanding the dormant powers of your own mind. This is a book about how to recognize, cultivate, and direct the natural gift that we all are born with: our sixth sense. When all is said and done, our ability to know things in a way that leaps over \"normal\" cognition and perception and just shows up as a sudden intuition or a pop of psychic awareness is an altogether logical, natural, and predictable human skill. This book shows you how the sixth sense is simply standard-issue equipment, along with our eyes, ears, tongues, noses and skin. It is only as magical and as ordinary as they are--which is plenty magical enough--but no more and no less. --from the Preface  \" I loved this book. Reading it was an experience of remembering my own intuition and learning to trust it even more. Belleruth&#39;s insights are practical, grounded, validating, and helpful. This is a well-researched, thoughtful how-to-book, filled with stories and exercises, and accessible at any number of levels. There is truly something here for everyone.\" --Christiane Northrup, M.D., author of Women&#39;s Bodies, Women&#39;s Wisdom  \"Belleruth Naparstek&#39;s penetrating study of intuitives has transformed this brilliant classic, which unites the logic of the mind with the wisdom of the heart. Her wit, intellect, and compassion not only illuminate the science of the sixth sense but also provide a sound, practical framework for the development ;of psychic potential. Grounded in the cultivation of empathy, the exercises in this book will open your heart and expand your sense of intimate connectedness with this remarkable universe.\"  --Joan Borysenko, Ph.D., author of Minding the Body, Mending the Mind and A Woman&#39;s Book of Life  \"I do not know of any other book that combines the wisdom of a psychotherapist, the knowledge of a scholar, the skill of a master hypnotist, the sensitivity of a psychic intuitive, and the memories of a remarkable collection of gifted practitioners. This book is a treasure!\" --Jeffrey Mishlove, Ph.D.,  president of Intuition Network and author of Roots of Consciousness",
        "Category": " Body, Mind & Spirit , Parapsychology , ESP (Clairvoyance, Precognition, Telepathy)",
        "Publisher": "HARPER COLLINS PUBLISHERS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "It's Anybody's Ballgame",
        "Authors": "By Garagiola, Joe",
        "Description": "A noted baseball entertainer's collection of on-field and off-field anecdotes includes many never-before told stories about some of the best-known names in baseball",
        "Category": " Sports & Recreation , General",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Teach Yourself Borland C++ Builder in 14 Days",
        "Authors": "By Reisdorph, Kent",
        "Description": "",
        "Category": "",
        "Publisher": "Sams",
        "Price Starting With ($)": "5.5",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Contemporary Weight Training",
        "Authors": "By Murray, Jim",
        "Description": "A full training program supplements illustrated instructions in the principles, techniques, and benefits of weightlifting",
        "Category": " Sports & Recreation , General",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "Shrapnel in the Heart: Letters and Remembrance from the Vietnam Veteran's Memorial",
        "Authors": "By Palmer, Laura",
        "Description": "More than one hundred letters left at Washington's Vietnam Veterans Memorial are accompanied by interviews with the authors of the letters, families of soldiers killed in the war",
        "Category": " History , Military , Vietnam War",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Olive Oil (Basic Flavoring Series)",
        "Authors": "By Merrell, James (PHT) and Gordon-Smith, Clare",
        "Description": "Divides thirty tempting recipes into such sections as Marinades and Dressings, Salads and Vegetables, Pastas, Fish and Meats, and Cakes and Breads; and provides suggestions on how to use olive oil to enhance everyday dishes.",
        "Category": " Cooking , Specific Ingredients , Herbs, Spices, Condiments",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Buttercups & Daisy",
        "Authors": "By Cragoe, Elizabeth",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Pain Remedies: Over 1000 Quick and Easy Pain Remedies from Little Ouches to Big Aches",
        "Authors": "By Goldberg, Philip",
        "Description": "This book gives you authoritative, practical advice from 149 of the country's top doctors and health professionals. You'll find quick and easy remedies for long-lasting relief from 77 common ailments.If you have chronic pain, Pain Remedies will show you how to get relief naturally - without expensive drugs and their unwanted side effects. You'll tap into the therapeutic powers of time-honored healing techniques such as homeopathy, imagery, massage, and yoga.An A-to-Z reference with hundreds of user-friendly tips, Pain Remedies is a comprehensive resource for pain-free living.",
        "Category": " Medical , Pain Medicine",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The New Explorers, Women in Antarctica",
        "Authors": "By Land, Barbara",
        "Description": "",
        "Category": "",
        "Publisher": "Dodd Mead",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Freedom from Compulsion",
        "Authors": "By cammer, leonard",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1976"
        }
    },
    {
        "Title": "The Crystal Star (Star Wars)",
        "Authors": "By McIntyre, Vonda N.",
        "Description": "Han, Luke, and Leia meet at Hethrir's colony, encounter the alien Waru, who is more powerful than Jedi Knights, and search for the colony's secrets when the crystal star's emanations threaten its planetary system--and Leia's children. 350,000 first printing.",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Bantam Spectra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "The Lady in the Loch",
        "Authors": "By Scarborough, Elizabeth Ann",
        "Description": "As the newly appointed sheriff of Edinburgh, budding author Walter Scott expects his job to be a simple one. Old buildings torn down in favor of new, and prosperity among the citizenry make the future seem bright and peaceful. But no modern meddling can bury evil forever.Soon after he takes office, Scott witnesses a grisly discovery. Bones, bodies, and what is worse, parts of bodies are found on the banks of the half-frozen loch. At first the new sheriff assumes that the horror is related to the work of grave robbers. Then living women begin to go missing.The town's people take little notice - these women are gipsies, with no settled kin to worry after them. But a young gipsy woman named Midge Margret soon makes the vanishings the talk of the town, with her tale of a mysterious black coach seen traveling the snow-shrouded forest. When it appears, women disappear. Scott's writer's mind is haunted by the mystery, so when the lovely gipsy asks for his help, he offers it willingly.The solution, he will find, is perilously close to hand. And he will also find that there is a method to the madness behind the killings - a method forged by the blackest of magic...",
        "Category": " Fiction , General",
        "Publisher": "Ace Hardcover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Diana vs. Charles: Royal Blood Feud",
        "Authors": "By Whitaker, James",
        "Description": "The explosive love story and full details behind Diana and Charles's relationship have never been revealed ... until now. Their breakup sent shock waves around the world, as growing suspicions were officially confirmed: Their fairy-tale marriage was just that - a fairy tale. Not only was the lily-white veil stripped away from their private lives, but the British monarchy itself was suddenly under scathing scrutiny. After all the headlines, the whispers, the rumors, the damaging claims and counterclaims by intimate friends of each, the full inside story of Diana, Charles, and their doomed union is now revealed - by the one person uniquely qualified to tell the lurid and fascinating tale of royal romance, rivalry, and scandal.James Whitaker is famous in England as the authority on the Royal Family - the only journalist to have had access to all the members of the House of Windsor for more than two decades of exclusive reportage. At the same time, he knew the teenage Lady Diana Spencer long before the royal wedding bells.With vivid personality profiles of an awe-inspiring gallery of characters, with unblushing and authentic depictions of how the Royals live and love, with utter honesty about both the monarchy and the girl now exiled from its charmed circle, Diana vs. Charles offers the most staggering, far-reaching disclosures about the greatest personal crisis ever to shake the Royal Family.",
        "Category": "",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "The Alliance--America, Europe, Japan: Makers of the Postwar World",
        "Authors": "By Barnet, Richard J.",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Money for Life: The \"Money Make-Over\" That Will End Your Worries and Secure Your Dreams",
        "Authors": "By Crowley, Steve",
        "Description": "Explains how to adjust personal financial strategies to the new economic realities of the nineties, with solid advice that applies to everything from buying a car, to paying college tuition, to retiring early and worry-free",
        "Category": " Business & Economics , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "All About Darts: America's most complete and up-to-date book on the game of darts",
        "Authors": "By Brackin, I. L. and Fitzgerald, W.",
        "Description": "The basic rules and traditions of dart playing as well as the many different games and strategies for winning play are discussed",
        "Category": " Sports & Recreation , Reference",
        "Publisher": "McGraw-Hill Contemporary",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "Fabulous Food for Family and Friends: Healthy Menus for Entertaining With Style",
        "Authors": "By Peters, Cheryl D. Thomas",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Review & Herald Pub Assn",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Seeds of Change: The Living Treasure : The Passionate Story of the Growing Movement to Restore Biodiversity and Revolutionize the Way We Think About",
        "Authors": "By Ausubel, Ken",
        "Description": "Laments the trend toward biosimilarity and warns of its dangers, then outlines the efforts of Seeds of Change  to preserve biodiversity through providing organic seeds, and lastly offers recipes that employ these better-tasting organic foods. Original. 75,000 first printing. $100,000 ad/promo.",
        "Category": " Technology & Engineering , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Movements in art since 1945 (World of art)",
        "Authors": "By Lucie-Smith, Edward",
        "Description": "This standard work on the arts since World War II has been substantially revised, expanded and redesigned. Eight new chapters and a new Introduction cover and illustrate all the most recent international trends and artists, including art in the USA from the 1970s; Neo-Expressionist tendencies; Post-Pop Blues; art based on feminist and gay issues; the new media of video and photography; and new classicism in Russia, Italy and China. The book is as global in its reach as art has become in modern times, and also considers work from Latin America, Korea, India, Africa, China and Japan.",
        "Category": " Art , History , Modern (late 19th Century to 1945)",
        "Publisher": "Thames and Hudson",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Merlin: The Shooting Script (Newmarket Shooting Script)",
        "Authors": "By Khmara, Edward, Stevens, David, and Barnes, Peter",
        "Description": "Merlin was the highest rated TV miniseries of 1998, with over 70 million viewers over two nights. From Hallmark Entertainment and NBC, the producers of the hit TV miniseries Gulliver's Travels, The Odyssey, and Moby Dick, comes Merlin, the entirely new two-part, four-hour miniseries featuring an all-star international cast including Sam Neill, Isabella Rossellini, Miranda Richardson, Martin Short, Rutger Hauer, Helena Bonham Carter, John Gielgud, and James Earl Jones. 29 b/w photos. The Newmarket Shooting Script(tm) Series features an attractive 7 x 9 1/4 inch format that includes a facsimile of the film's shooting script, as chosen by the writer and/or director, exclusive notes on the film's production and history, stills, and credits.",
        "Category": " Performing Arts , Television , Direction & Production",
        "Publisher": "Newmarket Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Nothing Lasts Forever",
        "Authors": "By Sheldon, Sidney",
        "Description": "Three San Francisco doctors encounter the challenges of the medical profession, a murder charge, and a deadly bet. By the author of The Stars Shine Down. 1,000,000 first printing. $650,000 ad/promo. Lit Guild Main. Tour.",
        "Category": " Fiction , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Diabetes: Questions You Have. . . Answers You Need",
        "Authors": "By Brisco, Paula",
        "Description": "",
        "Category": " Health & Fitness , Diseases , Diabetes",
        "Publisher": "Wings Books / Random House Value Publishing",
        "Price Starting With ($)": "6.65",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Britain: The Queen, Cricket, Sherlock Holmes and Other Things Indubitably British",
        "Authors": "By Kolpas, Norman (EDT)",
        "Description": "Looks at various aspects of life in Britain, including seaside resorts, the underground, sports cars, rugby, cricket, polo, music, art, theater, public houses, castles, and gardens",
        "Category": " History , General",
        "Publisher": "Running Pr Book Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Sound of Waves",
        "Authors": "By Mishima, Yukio",
        "Description": "A poor fisherman longs to meet the young and beautiful pearl diver who has enthralled the Japanese village",
        "Category": " Fiction , General",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Love Nest",
        "Authors": "By Coburn, Andrew",
        "Description": "In her brief stay in Andover, Massachusetts, the charm and beauty of a young and alluring prostitute touches the lives of many of the town's leading citizens, including Sergeant Sonny Dawson, the investigator of her murder",
        "Category": " Fiction , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Early Airplanes",
        "Authors": "By Blake, John",
        "Description": "The efforts of the early pioneers in aviation are depicted in words and pictures",
        "Category": " Science , General",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1985"
        }
    },
    {
        "Title": "Ultimate Christmas",
        "Authors": "By Newdick, Jane",
        "Description": "Let your imagination run far beyond the familiar and everyday as you prepare for a merry holiday season. Transform your home with rococo mantelpiece displays, dramatic door wreaths, or jewel-like candle centerpieces. Create your own distinctive wrapping paper and stunning gift cards. Use dried flowers and fresh greenery to turn every room into a winter wonderland. Just choose your favorites from the full-color photographs, then follow the easy step-by-step directions to make your own masterpieces.Of course, the centerpiece of every Christmas celebration is the tree. Make yours truly special with any of dozens of Ultimate Christmas ideas: glittering stars, flowery garlands, pure white glass baubles, even delicious edible decorations.Celebrate Christmas with a feast of appetizers, main courses and side dishes, and desserts from around the world. In the extensive cooking section, you'll find more than 50 recipes for tried-and-true favorites and exciting seasonal dishes from other traditions.",
        "Category": " Crafts & Hobbies , Seasonal",
        "Publisher": "Dk Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Stone of Heaven: Unearthing the Secret History of Imperial Green Jade",
        "Authors": "By Levy, Adrian and Scott-Clark, Cathy",
        "Description": "A compelling and richly textured journey to Burma into the heart of Imperial Green Jade, the rare and stunning stone more precious than diamonds, interconnects the modern story of the miners of jadeite who are dying of AIDS because they are being paid in the form of heroin with the mythology and secret history of this unusual jewel that goes back to the Burmese court. Reprint. 25,000 first printing.",
        "Category": " History , General",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Two or Three Things I Know for Sure",
        "Authors": "By Allison, Dorothy",
        "Description": "In Two or Three Things I Know for Sure, Dorothy Allison takes a probing look at her family's history to give us a lyrical, complex memoir that explores how the gossip of one generation can become legends for the next.Illustrated with photographs from the author's personal collection, Two or Three Things I Know for Sure tells the story of the Gibson women - sisters, cousins, daughters, and aunts - and the men who loved them, often abused them, and, nonetheless, shared their destinies.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "E. P. Dutton",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "A Whole Different Ball Game: The Sport and Business of Baseball",
        "Authors": "By Miller, Marvin",
        "Description": "The author celebrates the history of baseball, focusing on the dramatic changes that he witnessed and participated in as the first executive director of the Major League Baseball Players Association union",
        "Category": " Sports & Recreation , Baseball , Essays & Writings",
        "Publisher": "Birch Lane Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Lois Burpee's Gardener's Companion and Cookbook",
        "Authors": "By Burpee, Lois",
        "Description": "Replete with tips on growing, harvesting, and storing vegetables, this handsome book provides more than 150 recipes for a variety of entrees and side dishes and demonstrates techniques for freezing garden produce",
        "Category": " Cooking , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "Mozart: A Life",
        "Authors": "By Solomon, Maynard",
        "Description": "In this first full-scale biography since the 1950s, esteemed biographer Maynard Solomon draws on a half-century of new information to provide an in-depth account of Mozart's family life, his passions, and his personality.",
        "Category": "",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "The Book of Cocktails",
        "Authors": "By Ridgwell, Jenny",
        "Description": "Discusses cocktail making equipment, glasses, garnishes, and accompaniments, and shows and provides the recipes for the most popular alcoholic and nonalcoholic drinks",
        "Category": " Cooking , Reference",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "God's Calling: Searching for Your Purpose in Life",
        "Authors": "By Coppernoll, Christopher L.",
        "Description": "As the creator and host of the syndicated radio show Soul2Soul, Chris Coppernoll has compiled some of the most inspirational stories from the hundreds of interviews he has conducted for this innovative book. Featured are such well-recognized individuals as Max Lucado, Michael W. Smith, Patsy Clairmont, Barbara Johnson, Frank Peretti, and Henry Blackaby, who candidly speak about the daily issues and challenges of life. Succinctly presented for use as a devotional, readers will learn about some of their favorite authors and artists while connecting with personal applications that will lead to a sense of greater purpose in life.",
        "Category": " Religion , Inspirational",
        "Publisher": "J Countryman Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "The Last Good Day",
        "Authors": "By Blauner, Peter",
        "Description": "At the beginning of a dark autumn, a quiet suburban town is shaken when a headless body washes up next to its riverside train station. The shock is truly brought home when Lynn Schulman, who's just moved back to town with her family, learns that the victim is her lifelong best friend, Sandi Lanier. The illusion of security that this place has given Lynn since childhood begins to crumble - especially when the police investigator assigned to the case turns out to be her high school boyfriend, Michael Fallon, who stalked her after she broke off their relationship all those years ago.Michael has become a respected figure in town, but one thing hasn't changed: he's still obsessed with Lynn. He forces himself back into Lynn's life, showing up unannounced at her house, acting strangely, and fighting with her husband, Barry. Tensions boil over, friends turn against one another, old secrets are unearthed, and it becomes clear that Sandi's murder isn't an isolated case. Increasingly alone in a place they thought they knew, the Schulman's realize it's not just real estate values at risk here. It's their lives.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Little & Brown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Beni's First Chanukah",
        "Authors": "By Zalben, Jane Breskin",
        "Description": "\"Appropriate for lap reading with preschoolers, this quiet story of family holiday togetherness is well served by Zalben’s highly detailed, soft, colored-pencil drawings.\" --School Library Journal",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Henry Holt and Co. (BYR)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Second Draft of My Life: A Novel",
        "Authors": "By Lewis, Sara",
        "Description": "Forty-two years and five books into her life, Charlotte Dearborn is ready to start over from scratch. As a writer, she's had enough rejection to sink a ship -- or at least a writing career. It's time to find a new job. Teaching elementary school sounds good. Although the work may not be glamorous, it offers many of the compensations that writing lacks. Steady paychecks. The camaraderie of colleagues. And the children -- to give her life a clear purpose.  As she's committing herself to getting what she wants from her work, Charlotte decides to break free from her noncommittal boyfriend. She deserves better! She may be giving up her dream of being a recognized novelist, but in return she'll find a stable income, job satisfaction, and even love.  Won't she?  Of course she will. Any minute now. Just as soon as she figures out how to cope with twenty yelling first-graders, her nasty coworkers, and a series of romantic misadventures that fall far short of true love.  Charlotte's struggle to navigate the waters of a new career, a new single life, and the loss of her identity as a writer make Second Draft Of My Life a funny, compulsively readable gem. From an author The Boston Globe applauded as \"very, very good on the business of falling in and out of love,\" it is part romantic comedy, part manual for living, and wholly triumphant.",
        "Category": " Fiction , Literary",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Deeper: My Two-Year Odyssey in Cyberspace",
        "Authors": "By Seabrook, John",
        "Description": "In Deeper, John Seabrook, a staff writer for the New Yorker, takes us along his personal journey down the information highway. In the beginning of this pioneering adventure into cyberspace, our hero (seabrook) is a clueless newbie. He ends up an old hand, complete with arrow wounds to show off.When Seabrook is not narrating his own on-line adventures, he is writing an eyewitness history of a tumultuous period in the early history of a new medium, when the Net moved decisively from a geeky hobby to a part of mainstream popular culture. We meet major figures in the computer industry, catch the utopian feeling, get flamed, get laid, soar over the Net like Satan soaring over the Earth in Paradise Lost, join a virtual community and find out what daily life is like, lose the utopian feeling, adapt to the World Wide Web, and build a Web site.",
        "Category": " Computers , Computer Science",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "A Random Act: An Inspiring True Story of Fighting to Survive and Choosing to Forgive",
        "Authors": "By Broaddus, Cindi and Suiters, Kimberly Lohman",
        "Description": "The amazing story of Dr. Phil McGraw&#39;s beloved sister–in–law, an ordinary woman transformed by tragedy who has become an extraordinary hero for us all. In 2001, Cindi Broaddus was a passenger in a car driving along a lonely highway on her way toward a much–anticipated vacation. Suddenly, the predawn peace was shattered when an unknown assailant threw a gallon–sized jar full of sulphuric acid off an overpass and through the windshield. Though Broaddus was covered with second– and third–degree burns across her face and body, miraculously she did not die.  Today, she is not only alive and well, but has a positive message of survival and hope to share. A Random Account recounts Broaddus&#39;s incredible journey from life–threatening disaster to recovery. Throughout her years–long, often excruciating recuperation – involving numerous reconstructive surgeries, multiple skin grafts, and implanted tissue expanders – this single mother of three has had one goal: to prevent such a terrible crime from happening again. Although her attacker has never been caught, Broaddus travels far and wide, sharing her story, lobbying for improving highway safety, and offering hope and down–to–earth guidance for other victims of senseless tragedy. For such a random act can happen to anyone, turning one&#39;s life upside down in an instant. As compelling as it is important, A Random Act is a must–read tale of tragedy and triumph from a truly remarkable woman.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Jinxed (Regan Reilly Mysteries, No. 6)",
        "Authors": "By Clark, Carol Higgins",
        "Description": "Carol Higgins Clark, bestselling author of Fleeced and co-author with Mary Higgins Clark of He Sees You When You're Sleeping, returns in top form in her new Regan Reilly mystery, blending her talent for intriguing locales, eccentric characters, and fast-paced suspense laced with humor.  In Jinxed, smart, saucy sleuth Regan Reilly faces a new challenge -- the case of the missing wedding guest.  Regan, an L.A.-based private detective, returns to her office after a vacation with her beau, Jack \"no relation\" Reilly. Their tour of the wineries in Napa Valley and Santa Barbara County is cut short when Jack has to fly back to New York City, where he is the head of the Major Case Squad of the NYPD. Their last stop had been at Altered States, a run-down winery owned by three siblings who are all former hippies -- Lilac, Earl, and Leon Weldon. Not knowing how soon it would be put to use, Regan leaves her business card behind.  Within minutes of being back to work, Regan gets an excited call from Lilac. The Weldon family has been invited to the wedding of ninety-three-year-old Lucretia Standish, a former silent-screen star, who made a killing in a dot-com before it went bankrupt. Lucretia had been married to the Weldons' Uncle Haskell and had invested the money she inherited from Haskell in the dot-com. Lucretia's maid, Phyllis, clues Lilac in on the fact that Lucretia plans to give the Weldons $2 million each -- if they all show up at the wedding. The wedding is two days away, and there is only one problem -- Lilac's daughter, Whitney, aka Freshness, a young actress, has taken off on one of her go-with-the-flow weekends. Whitney is out of touch and goes where the wind blows. If it doesn't blow her back into town by Sunday morning, the Weldon family will be out $8 million.  Regan's job is to find Whitney. But unbeknownst to Regan, there's someone else on the hunt. Lucretia's fiancé, the much younger Edward Fields, has hired an accomplice in crime to locate Whitney and keep her away from the wedding. Edward knows Whitney will recognize him as the con man she'd met in acting class in New York. He wants to say \"I do\" to Lucretia and her millions before Whitney can protest. When Edward finds out that Regan Reilly has been hired to find the missing Whitney, he gives the order to get rid of her as well.  Meanwhile, Lucretia is befriended by a gang of bikers, the story of her upcoming nuptials is featured on national television news, and wildfires are threatening to consume the barn where Whitney is being held captive.  As in her previous novels, Carol Higgins Clark has created a novel that is both exciting and vastly entertaining. As no less a master of suspense than Nelson DeMille has said, \"Clark's writing is elegantly clear and concise, her characters are witty and engaging, and her plots and pacing are perfect.\" And in Jinxed, she is at her very considerable best.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Home Lands: Portraits of the New Jewish Diaspora",
        "Authors": "By Tye, Larry",
        "Description": "The idea for this book came to Larry Tye as he traveled overseas as a reporter for the Boston Globe. In each city he visited he was intrigued by a reawakening of practice and spirit of the long repressed Jewish community. And the more communities he saw close-up, the clearer it became to him that the Jewish world was being reshaped and revitalized in ways that were not reflected in what he was reading about the disappearing diaspora and the vanishing Jews of America.The result is Home Lands, an narrative that tells the story of the new Jewish diaspora. Tye picked seven Jewish communities from Boston to Buenos Aires and Dusseldorf to Dnepropetrovsk deep in the Ukraine, and in each he zeroes in on a single family or congregation whose tale reflects the wider community's history and current situation. He met each community's leaders, talked with their scores of young people and old, and went with them to High Holiday services and Sabbath celebrations.The first impression that emerges from his travels is each city's uniqueness. Far more striking than the differences, however, is the unity. Jews all over the world still have enough customs and rituals in common for outsiders to see them as part of the same people, and for them to define themselves that way. It is that new comfort level, that sense of finally feel comfortable in the lands where they are living, that is at the heart of this engrossing book. Readers' eyes will be opened to how Germany, just a generation after the genocide, has the world's fastest-growing Jewish population; how the Jews of Buenos Aires have carved a place for themselves in a land that also gave refuge to Nazi henchmen like Adolph Eichman, and how Ireland is home to a tight-knit Jewish community that, remarkably, has produced Jewish Lord Mayors in Belfast, Cork and, twice from the same family, in Dublin. In Boston, Tye tells the story of his own family, whose roots run deep in the city's Jewish community.Home Lands is a book that is deeply personal even as it sheds light on the larger Jewish experience.",
        "Category": " History , Middle East , Israel & Palestine",
        "Publisher": "Henry Holt and Co.",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Heirs of the Fisherman: Behind the Scenes of Papal Death and Succession",
        "Authors": "By Pham, John-Peter",
        "Description": "The death of Pope John Paul II and consequent election of Pope Benedict XVI has shed light on a political process that the world has not been privy to for almost twenty-six years. People from around the world gathered in St. Peter's Square, wondering who the next Vatican leader would be and how the election process really worked, while everyone from international news correspondents to local priests added their own opinions to the debate.In Heirs of the Fisherman, former Vatican insider John-Peter Pham presents a candid portrait of the modern Vatican, the only account to reveal the striking changes to papal succession procedures made by John Paul II. Blending political and ecclesiastical history, Pham goes beyond a mere description of the complex rituals to offer rare insight into the dramatic shifts inside the College of Cardinals, whose 100 members now hail from 50 nations around the globe. He takes us into the secret conclave, where the electors were kept under lock and key, until they had selected a new pope. He also includes a chapter devoted to the intrigues of the 20th century where the first conclave had an emperor's veto and the last was won by the first non-Italian in four centuries becauase the Italians were bitterly divided. With a new Preface, Afterword, and appendices that include an English translation of the last will and testament of Pope John Paul II,Heirs of the Fisherman is an illuminating history and must-have guide to this vitally important world event. It will continue to be an indispensable reference to observers of future Catholic Church politics.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Jesus Loves Me: Celebrating the Profound Truths of a Simple Hymn",
        "Authors": "By Miller, Calvin",
        "Description": "There are few songs more recognizable to the Christian believer than Anna B. Warner's beloved hymn, \"Jesus Loves Me.\" The simple yet eloquent lyric states the basic elements of faith both plainly and succinctly; within the three title words are found the tenets of Christianity. Now, by examining this beloved hymn verse by verse, including the little known second and third stanzas, Calvin Miller seeks to remind believers of the clear and abiding truths found within this child's rhyme. In doing so, he establishes the song as a creed by which busy Christian adults can live and grow.",
        "Category": " Religion , Devotional",
        "Publisher": "FaithWords",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Suddenly One Morning: The Shopkeeper's Story: An Easter Narrative",
        "Authors": "By Swindoll, Charles R. and Thoene, Jake",
        "Description": "Through the eyes of a shopkeeper on the main street of Jerusalem, \"readers\" experience the life-changing events of a week that begins with a parade and ends with an empty grave. This Easter gift book combines with an original Swindoll story with beautiful full-color art.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Word Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Herbs: The Complete Gardener's Guide",
        "Authors": "By Lima, Patrick and Forsyth, Turid",
        "Description": "When first published, Herbs was extremely well received and set a new standard of excellence for gardening books. Turid Forsyth's photographs and watercolor illustrations capture all the beauty and detail of these fascinating and practical plants, and Patrick Lima's highly entertaining text is chock-full of clear information, helpful advice and wry anecdotes.    The book covers:    Selecting and growing herbs  Soil  Perennial kitchen herbs, such as horseradish, oregano, bay leaf and rosemary  Annual and biennial kitchen herbs, such as basil, chili peppers and parsley  Varieties of thyme  Varieties of sage  Seeds and sprouts, including anise, caraway, coriander and cumin  Alliums, including chives, leeks, onions, garlic            and shallots  Leafy herbs, such as arugula and watercress  Herbs for blending and brewing, such as mint, chamomile and bergamot  Fragrant herbs, such as old roses and lavender  Gathering wild herbs    Special sections outline how to use herbs to add color to flowerbeds and how to propagate, preserve and grow herbs indoors. The book concludes with 16 delicious recipes that make the most of fresh herbs.     This beautiful book combines the wisdom of two longtime gardeners, creating a comprehensive reference that any gardener will enjoy and use regularly.",
        "Category": " Photography , Subjects & Themes , Plants & Animals",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "6.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2012"
        }
    },
    {
        "Title": "Family Politics: Love and Power on an Intimate Frontier",
        "Authors": "By Pogrebin, Letty Cottin",
        "Description": "A look at the modern family explains how to preserve the virtues of the traditional family while alleviating inequities and promoting individual freedom and potential",
        "Category": " Social Science , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Durrell in Russia",
        "Authors": "By Durrell, Gerald and Durrell, Lee",
        "Description": "Naturalists Gerald and Lee Durrell chronicle their journey across the vast landscape of the Soviet Union and describe their encounters with its people, wildlife, and natural wonders.",
        "Category": " Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Amelia Earhart: The Mystery Solved",
        "Authors": "By Long, Elgen M. and Long, Marie K.",
        "Description": "For more than sixty years people have wondered what happened to Amelia Earhart. Here at last is the answer.In 1937, Amelia Earhart disappeared into the Pacific Ocean only days from completing her famous around-the-world flight. Her plane was never found. Now, with the recent discovery of long-lost radio messages, combined with authors Elgen M. Long and Marie K. Long's twenty-five years of research, the mystery surrounding Earhart has been solved. Amelia Earhart: The Mystery Solved simultaneously reveals their findings and brings to life the primitive conditions under which early aviators flew -- including lack of radar, unreliable communications, grass landing strips, and poorly mapped islands -- reminding us just how daring Earhart was.",
        "Category": " Transportation , Aviation , History",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Christmas Family Gatherings: Recipes and Ideas for Celebrating with People You Love",
        "Authors": "By Maggipinto, Donata and Ruffenach, France (PHT)",
        "Description": "Gatherings is festive inspiration. Part cookbook, part party planner, part crafty idea book, this is the complete guide to making Christmas special for all ages. Beautifully illustrated with color photography, this handsome volume helps busy families recapture the simple pleasures of the season. Donata Maggipinto, an expert in the art of entertaining, reinvents familiar traditions and adds her own fabulous touches to everything from sweet and savory holiday dishes to festive table decorations, ingenious gifts, and so much more. Her easy party plans each include complete menus, ideas for decorations, and heartfelt tips for making the most of time spent with family and friends. A White Christmas Eve Dinner features a holiday meal with all the fixings on a table set with a miniature village in faux snow. The Old-Fashioned Christmas Breakfast brings the family together over Gingerbread Shakes. And the Gift Wrapping Get-Together is a delicious way to sneak in time with girlfriends while crossing a holiday chore off the list. Packed with satisfying crafts that are fun to make and give, this handbook to the holiday season also includes family-friendly activities perfect for winter afternoons. The modern-day guide to timeless good cheer, Christmas Family Gatherings helps make the holidays the way they were meant to be: magical.",
        "Category": " Cooking , Holiday",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Promise and the Product",
        "Authors": "By Margolin, Victor and Vivian",
        "Description": "",
        "Category": "",
        "Publisher": "MacMillan Publishing Company.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1979"
        }
    },
    {
        "Title": "Halftime: Changing your game plan from Success to Significance",
        "Authors": "By Buford, Bob",
        "Description": "Is there life after success?'One of the most common characteristics of a person nearing the end of the first half (of the game of life) is that unquenchable desire to move from success to significance.'Bob Buford believes the second half of your life can be better than the first. Much better. But first, you need time to figure out what you want to do with the rest of your life.In Halftime, Bob focuses on this important time of transition--the time when, as he says, a person pauses to consider what will make their remaining years rich and meaningful.As Buford explains, 'My passion is to inspire business and professional leaders to embrace God's calling and move from success to significance.'To help people at midlife to embark on their 'personal renaissance,' Buford lifts up the important questions we need to ask:What am I really good at?What do I want to do?What is most important to me?What do I want to be remembered for?If my life were absolutely perfect, what would it look like?Buford fills Halftime with a blend of personal insight, true-life examples, and hit-the-nail-on-the-head quotes from men who have successfully navigated the exhilarating and potentially dangerous shoals of midlife.The real test of a man is not when he plays the role that he wants for himself, but when he plays the role destiny has for him.--Vaclav HavelThe thing to understand is myself, to see what God really wishes me to do . . . to find the idea for which I can live and die.--Soren KierkegaardMidlife. Halftime. It doesn't need to be a time of crisis; it can be a catalyst. Bob Buford provides the encouragement and insight to propel your life on a new course away from mere success to true significance--and the best years of your life.",
        "Category": " Religion , Christian Life , Professional Growth",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Spiritual Literacy: Reading the Sacred in Everyday Life",
        "Authors": "By Brussat, Frederic and Brussat, Mary Ann",
        "Description": "Spiritual Literacy answers the universal question, \"How can I live a spiritual life every day?\" Frederic and Mary Ann Brussat, who have been covering contemporary culture and the spiritual renaissance for more than twenty-five years, believe that we can read the texts of our lives and of the world around us for sacred meaning. All we need is spiritual literacy.To illustrate their point, the Brussats present more than 650 \"readings\" about daily life from present-day authors - spiritual teachers, essayists, novelists, filmmakers, poets, naturalists, and social activists. This collection is unprecedented - an enthralling treasury of brief, \"aha!\" passages from such writers as Maya Angelou, Wendell Berry, Ram Dass, Annie Dillard, Clarissa Pinkola Estes, Robert Fulghum, Eduardo Galeano, Thich Nhat Hanh, Barbara Kingsolver, Jonathan Kozol, Kathleen Norris, Henri J. M. Nouwen, Anne Tyler, and many more. The Brussats add demonstrations of spiritual literacy based on their personal experiences and their interpretations of contemporary movies, songs, and television dramas.These remarkable readings tutor us in the art of lingering with our experiences and seeing the world with fresh eyes. They offer spiritual perspectives on things, places, nature, animals, leisure activities, creative pursuits, work, body, illness, death, relationships, and community.Spiritual literacy does not require that we become masters of certain religious texts or that we climb to a high rung on the ladder of enlightenment. Indeed, it is the very opposite of such elitism. At the end of each chapter, the Brussats invite their readers to practice spiritual literacy themselves through journal exercises, household projects, and rituals.",
        "Category": " Religion , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "KISS Guide to Photography (Keep It Simple Series)",
        "Authors": "By Garrett, John",
        "Description": "Kiss the competition goodbye! The only guide you'll ever need to take photographs like a professional. Understand how cameras work and how to choose the right one for you. Discover how to use light sources and lenses, apertures and shutters as creative tools. Master the skills you need to create portraits, landscape, still-life, action, and travel photography. Learn how to develop your photographs in the darkroom or scan and retouch digital pictures. The Keep It Simple Series is the new standard in how-to books! Written by leading experts, each book includes full-color photographs and illustrations throughout, making these the first and only truly accessible guides for beginners. The KISS format is designed to help readers build confidence from the start, and learn gradually and thoroughly to the very last page. Much more than introductions to various subjects, these inspiring and innovative books are the ones that readers can trust!",
        "Category": " Photography , Techniques , General",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Cop-Out",
        "Authors": "By Jones, R. W.",
        "Description": "Detective Inspector Evans must track a rapist and win back the admiration of his fellow officers",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "The Broker: A Novel",
        "Authors": "By Grisham, John",
        "Description": "In his final hours in the Oval Office, the outgoing President grants a controversial last-minute pardon to Joel Backman, a notorious Washington power broker who has spent the last six years hidden away in a federal prison. What no one knows is that the President issues the pardon only after receiving enormous pressure from the CIA. It seems Backman, in his power broker heyday, may have obtained secrets that compromise the world’s most sophisticated satellite surveillance system.Backman is quietly smuggled out of the country in a military cargo plane, given a new name, a new identity, and a new home in Italy. Eventually, after he has settled into his new life, the CIA will leak his whereabouts to the Israelis, the Russians, the Chinese, and the Saudis. Then the CIA will do what it does best: sit back and watch. The question is not whether Backman will survive—there is no chance of that. The question the CIA needs answered is, who will kill him?",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Prodigal Project: Book 1: Genesis",
        "Authors": "By Hart, Daniel and Abrahaiti, Ken",
        "Description": "Azul Dante, the charismatic leader of the Prodigal Project, offers a beacon of hope in the darkest hours following the Rapture, but seven men and women find their souls tested to the limits in their search for the promised land.",
        "Category": " Fiction , Religious",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Dinosaurs Are Different (Let's Read-And-Find-Out Science)",
        "Authors": "By Aliki",
        "Description": "Explains the special characteristics of the many types of dinosaurs and their main groups, from swift, small species to the giant plant eaters",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "Treasures for the Christmas Tree: 101 Festive Ornaments to Make & Enjoy",
        "Authors": "By Taylor, Carol",
        "Description": "Shows how to make Christmas decorations and ornaments using herbs, dried flowers, fabric, yarn, buttons, bows, paper, candy, and foods",
        "Category": " Crafts & Hobbies , Seasonal",
        "Publisher": "Lark Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "Country Living Recipes (Progressive Farmer)",
        "Authors": "By Liles, Jean",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor House, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "Wave 3: The New Era in Network Marketing",
        "Authors": "By Poe, Richard",
        "Description": "Catch the Wave!Fueled by new technology and innovative marketing ideas, cutting-edge network-marketing companies have set out to change the way North Americans live and work. To the corporate world, these companies offer a secret formula for lightning growth and global dominance. To people like you, they offer a chance to start a business at minimal cost, to work comfortably from your home and—for a fortunate few—to acheive wealth beyond your wildest dreams. The ideas are revolutionary, and before the 1990s are over, the movement these companies have started will transform us all. It’s called the Wave Three Revolution. In today’s Wave-Three organization, distributors rely on a twenty-first century network of systems, procedures, media, and technology that simplifies, standardizes, and even automates the most difficult aspects of the business. Richard Poe explains what you will need to know about network marketing and how you can get started right away on this exciting path toward financial independence. Chapters include: The Wave-Three Revolution How to Spot a Wave-Three Company Wave-Three Prospecting Wave-Three Sponsoring The Fifth Income Stream And much, much more Armed with the information in Wave 3, you can learn how easy it is to become a part of what could be your best hope for attaining financial freedom in today’s economy!",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "Prima Lifestyles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Period",
        "Authors": "By Loulan, JoAnn Gardner, etc.",
        "Description": "Discusses menstruation and other related mental and physical changes girls experience, gives suggestions for coping with these changes, and explains what happens during a pelvic exam.An illustrated and informative discussion of menstruation and other related physical and mental changes experienced by young adolescent girls suggests practical ways of coping with these changes and explains what happens during a pelvic examination",
        "Category": "",
        "Publisher": "Volcano Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The Passion of Estelle Jordan",
        "Authors": "By Hebert, Ernest",
        "Description": "The afflicted Jordan Clan of Tukerman County embraces an aging, heart-scarred woman known as the Witch, a woman whose passion decides her own fate and the fates of those who turn to her",
        "Category": " Fiction , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "15.19",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Cost Accounting: A Managerial Emphasis (Prentice Hall Series in Accounting)",
        "Authors": "By Horngren, Charles T., Datar, Srikant M., and Foster, George",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "9.03",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Big Sister Is Watching You: Hillary Clinton and the White House Feminists Who Now Control America--And Tell the President What to Do",
        "Authors": "By Marrs, Texe W.",
        "Description": "",
        "Category": " Political Science , American Government , General",
        "Publisher": "Living Truth Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The Money Culture",
        "Authors": "By Lewis, Michael",
        "Description": "The classic warts-and-all portrait of the 1980s financial scene.The 1980s was the most outrageous and turbulent era in the financial market since the crash of '29, not only on Wall Street but around the world. Michael Lewis, as a trainee at Salomon Brothers in New York and as an investment banker and later financial journalist, was uniquely positioned to chronicle the ambition and folly that fueled the decade.",
        "Category": " Business & Economics , Money & Monetary Policy",
        "Publisher": "W W Norton & Company",
        "Price Starting With ($)": "10.0",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Managing Information: The Challenge and the Opportunity",
        "Authors": "By DIEBOLD, John",
        "Description": "Stresses the importance of setting corporate policies to control the flow of information, discusses interactive videotex, and looks at the way the proliferation of information affects American business",
        "Category": " Business & Economics , General",
        "Publisher": "Amacom Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Roaring 2000s: Building the Wealth and Life Style You Desire in the Greatest Boom in History",
        "Authors": "By Dent, Harry S.",
        "Description": "In his bestselling book, The Great Boom Ahead, published in 1993, Harry Dent, one of the world's most prescient economic prognosticators, stood practically alone in forecasting a new age of prosperity emerging in the 1990s and extending into the new century. Dent foresaw a booming stock market, falling mortgage rates, and the resurgence of America as the premier global economic superpower. All of his predictions have come to fruition.  Now, in The Roaring 2000s, Dent focuses his visionary eye on the full spectrum of changes that will follow in the wake of the burgeoning turn-of-the-century economy. According to Dent, how and where we work and live is about to change more drastically than at any time in our history due to the convergence of the mainstreaming of the Internet and other technologies and the peak spending years of the aging baby boomers. This will result in nothing less than the greatest boom in history and an unprecedented opportunity for investors and entrepreneurs, great buys in real estate, and a wealth of high-quality lifestyle choices for the savvy people who anticipate these changes. We will we such rapid and exciting change as we have not seen since the dizzying pace of the productivity revolution unleashed by the assembly line in the Roaring Twenties.  Dent not only offers detailed investment strategies aimed at exploiting the coming boom for the next fifteen years but he also explains future trends in the job market, technology, demographics, and real estate. He foresees the next great population migration and explores the radically different business and organizational structures that will be the offspring of the Information Age. At the crux of these changes is the fundamental shift to a new network model wherein front-line human \"browsers\" focus on intimately understanding the needs of a unique segment of customers and coordinate the products or expertise of specialized back-line human \"servers\" to customize solutions.  With new research tools applied to the trends that have developed within the last few years, The Roaring 2000s reveals concrete predictions and indepth insights into the next decade, including:   A Dow that continues to soar and will eventually reach at least 21,500, and possibly 35,000, by the year 2008  The importance of \"gazelles,\" small- to medium-sized, high-growth companies, which today are creating most of of the jobs in this country  The rapid future economic development in countries in die Far East, South America, and Eastern Europe, and select areas of Africa, and what that means for investment, employment, and business growth opportunities now  The Roaring 2000s also describes the lifestyle changes these developments will inspire, including:  The New American Deam -- why changing techologies could mean a return to small-town living and which nine types of boomtowns will offer the highest quality of life in the decades ahead  Investment strategies that will help readers get the most out of a rapidly changing world  It is essential, Dent explains, to understand the magnitude and nature of the forces changing our economy and lifestyles in order to take advantage of the invaluable, emerging opportunities for significantly improving ones quality of life. The Roaring 2000s is a necessary guidebook to the not-so-distant future.",
        "Category": " Business & Economics , Economics , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Before Burnout: Balanced Living for Busy People",
        "Authors": "By Minirth, Frank, Hawkins, Don, Heier, Paul, and Thurman, Chris",
        "Description": "",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Moody Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "100% American",
        "Authors": "By Weiss, Daniel Evan",
        "Description": "Gathers unusual and little known statistics about Americans, from the one percent who are color-blind to the ninety-nine percent of American households that have at least one radio",
        "Category": " Humor , General",
        "Publisher": "Poseidon Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Database Processing: Fundamentals, Design, and Implementation",
        "Authors": "By Kroenke, David",
        "Description": "A text/CD-ROM intended for use in a one-term course on database processing, focusing on application design considerations that pertain directly to databases and data models. Part I surveys history of the field and different types of databases and applications, and Part II focuses on data modeling. Part III discusses transformation of data models into relational database designs, and Part IV presents implementation of relational databases. Part V discusses concepts and technology for multi-user databases, and Part VI addresses nonrelational database processing. Features chapter summaries, key terms, questions, and projects. This second edition discusses new technologies that support database applications, such as ODBC, data warehousing, intranet and Internet databases, multimedia DBs, object databases, and SQL3. The CD-ROM contains SALSA for the Desktop, a commercial software package that allows beginning students to create accurate database models. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Computers , Database Management , General",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "7.35",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Bug-eyed monsters (A Harvest/HBJ original)",
        "Authors": "By Pronzini, Bill and Malzberg, Barry N.",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt Brace Jovanovich",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "How to Redesign & Renovate Your House or Apartment",
        "Authors": "By Sperling, Phyllis and Didonno, Lupe",
        "Description": "Presents a complete, specific how-to book on redesigning and renovating, with clear step-by-step instructions and drawings for exhaustive jobs or for minor changes",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Adult Children of Divorce Speak Out: About Growing Up With and Moving Beyond Parental Divorce",
        "Authors": "By Berman, Claire",
        "Description": "Explores common problems experienced by adult children of divorce through extensive interviews with both men and women, and offers advice for overcoming those problems",
        "Category": " Health & Fitness , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "New York Times Guide to Reference Materials",
        "Authors": "By McCormick, Mona",
        "Description": "",
        "Category": "",
        "Publisher": "Dorset House Publishing Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "America in Perspective: Major Trends in the United States Through the 1990's",
        "Authors": "By Oxford Analytica (COR)",
        "Description": "Predicts short-term trends in American politics, economic situations and in social conditions",
        "Category": " Social Science , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "DEVALUING OF AMERICA: FIGHT FOR OUR CULTURE AND OUR CHILDREN",
        "Authors": "By Bennett, William J.",
        "Description": "A provocative and personal study of the crisis in American values discusses the problem of educational standards, drugs, AIDS, and sex education; racial strife; the controversy over values; and the debate on affirmative action and quotas. 50,000 first printing.",
        "Category": " Political Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "The Physics of Baseball",
        "Authors": "By Adair, Robert Kemp",
        "Description": "Adair (physics, Yale U. and physicist to the National League, 1987-89) offers the physics and formulae along with examples and anecdotes from pro ball play. If you follow the game, you ought to understand the principles. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "New York Public Library Desk Reference",
        "Authors": "By Gregorian, Vartan",
        "Description": "A researcher's dream and a browser's delight, this brand-new edition of the national bestseller puts at your fingertips the best resources of one of the world's finest libraries. More permanent than an almanac, handier than an encyclopedia, The New York Public Library Desk Reference is the first place to look for quick answers to all your reference questions.",
        "Category": "",
        "Publisher": "Prentice Hall General",
        "Price Starting With ($)": "7.98",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Making Stress Work For You: Ten Proven Principles",
        "Authors": "By Ogilvie, Lloyd John",
        "Description": "",
        "Category": "",
        "Publisher": "Word Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "No Bad Dogs: The Woodhouse Way",
        "Authors": "By Woodhouse, Barbara",
        "Description": "Barbara Woodhouse, \"the lady with the dogs,\" is already familiar to millions of Americans through the publication of her best-selling book, No Bad Dogs, her frequent appearances on such national television shows as \"60 Minutes,\" \"The Tonight Show,\" \"Donahue,\" \"Merv Griffin,\" \"Good Morning America,\" and the syndication of her enormously popular television series, \"Training Dogs the Woodhouse Way.\"  There are no bad dogs, Barbara Woodhouse believes -- only inexperienced owners. She ought to know: in thirty years she has personally trained 17,000 dogs and their owners in her weekend courses, teaching perfect obedience to basic commands in only six and a half hours.  In this irresistible book, Barbara Woodhouse passes on to the reader the simple, effective techniques as well as the infectious, positive attitude that have enabled her to make the most unruly or nervous dog happily obedient -- sometimes within a few minutes, as astonished television audiences can attest.  No Bad Dogs will leave every dog owner with both the skills and the indispensable attitude of love, firmness, and enthusiasm that gets results -- The Woodhouse Way.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "The Ghosts at Manor House",
        "Authors": "By Dunnington, Tom and Skipper, G. C.",
        "Description": "Carol and Charles choose the history of the Manor House museum as their term paper topic and, during their research, discover ghostly remnants of the house's tragic past",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Childrens Pr",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "February",
            "Year": "1978"
        }
    },
    {
        "Title": "America's Best Cross Stitch (Better Homes and Gardens)",
        "Authors": "By Better Homes and Gardens Books",
        "Description": "A selection of patterns and projects for cross-stitching afghans, samplers, sachets, tablecloths, pillows, pictures, and more",
        "Category": " Art , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Sneezing Your Head Off? How to Live with Your Allergic Nose",
        "Authors": "By Boggs, Peter B",
        "Description": "",
        "Category": "",
        "Publisher": "Patient Education Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Book Wars : What It Takes to Be Educated in America",
        "Authors": "By Atlas, James",
        "Description": "",
        "Category": "",
        "Publisher": "Whittle Direct Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "I Love Paul Revere, Whether He Rode or Not",
        "Authors": "By Shenkman, Richard",
        "Description": "Provocative and amusingly heretical, \"I Love Paul Revere, Whether He Rode or Not\" (a quote attributed to Warren Harding) offers eye-opening revelations debunking long-held American legends.",
        "Category": " History , United States , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Unto the Sons",
        "Authors": "By Talese, Gay",
        "Description": "\"An Italian ROOTS.\" The Washington Post Book WorldAt long last, Gay Talese, one of America's greatest living authors, employs his prodigious storytelling gifts to tell the saga of his own family's emigration to America from Italy in the years preceding World War II. Ultimately it is the story of all immigrant families and the hope and sacrifice that took them from the familiarity of the old world into the mysteries and challenges of the new.From the Paperback edition.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    }
]