[
    {
        "Title": "Beauty Queens: A Playful History",
        "Authors": "By Savage, Candace and Savave, Candace Sherk",
        "Description": "More than one hundred illustrations and photographs complement an entertaining history of the beauty pageant, from the 1850s to the present day, tracing the changing perspective on feminine beauty and its evolving role as a cultural institution. Original.",
        "Category": " Social Science , Popular Culture",
        "Publisher": "Abbeville Press",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Me & Emma",
        "Authors": "By Flock, Elizabeth",
        "Description": "Eight-year-old Carrie Parker and her little sister, tired of living in an abusive environment, concoct a plan to run away, but their escape is thwarted by shocking revelations that will change their lives forever. 200,000 first printing.",
        "Category": " Fiction , Literary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Battle field and prison pen,: Or Through the war, and thrice a prisoner in rebel dungeons",
        "Authors": "By Urban, John W",
        "Description": "",
        "Category": "",
        "Publisher": "Hubbard Brothers] Edgewood Pub. Co",
        "Price Starting With ($)": "26.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1882"
        }
    },
    {
        "Title": "Couples Companion: Meditations & Exercises for Getting the Love You Want: A Workbook for Couples",
        "Authors": "By Hendrix, Harville, Hunt, Helen, and Benjamin, Beatrice (ILT)",
        "Description": "Shows how an enlightened relationship can lead to spiritual growth and personal healing and offers a life-changing program for doing so. Reprint. 100,000 first printing.",
        "Category": " Self-help , Personal Growth , Happiness",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "The Gradual Vegetarian: The step-by-step way to start eating the right stuff today!",
        "Authors": "By Tracy, Lisa",
        "Description": "Stage one of this vegetarian lifestyle sampler allows poultry, fish, and eggs; stage two eliminates poultry, limits fish, and uses dairy foods, grains, nuts,and beans for protein; and stage three introduces macrobiotic meals and hygienism",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "The Essential Baking Cookbook",
        "Authors": "By Whitecap Books",
        "Description": "",
        "Category": " Cooking , Methods , Baking",
        "Publisher": "Whitecap Books Ltd",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Puntos De Partida: An Invitation to Spanish (English and Spanish Edition)",
        "Authors": "By Knorre, Marty",
        "Description": "Take a fresh look at Puntos – it’s everything you wanted and more than you hoped for.Puntos has offered more than a million students a solid foundation to their language studies. The new edition ofPuntos maintains its pioneer approach of the development of all four skills with a strong grammar and vocabulary foundation, as well as the teacher tested activities. The new design ofPuntos brings to this program the best tradition of excellence and outstanding instructor support adaptable to different teaching and learning styles.Puntos , the most successful Intro Spanish program ever, is now: breaking new ground to meet the changing needs for face-to-face, hybrid, and online Spanish programs.offering students more opportunities to develop their communication skills via TelePuntos, a new integrated video program with corresponding in-text and digital activities.innovating through LearnSmart, a first-of-its-kind adaptive learning system within McGraw-Hill Connect, adjusts to the learning needs of every studentThis new edition of Puntos provides students with all of the necessary tools to take their second language acquisition from the classroom into their daily lives in an efficient and personalized way. With Connect Spanish, the exclusive digital learning platform from McGraw-Hill, students have access to Mundo interactivo, an immersive, story-based world where they experience the thrill of mastering relevant, task-based communication scenarios in real-world contexts. Also, with synchronous and asynchronous video chat functionality, students can easily engage in communication practice online. Additionally, McGraw-Hill and Blackboard® have teamed up to simplify the instructor and student digital learning experience! McGraw-Hill allows you to manage your course content, assignments, assessments, and grades all from within your institution’s existing Blackboard environment.Puntos – it WILL take you there! *Connect Spanish, including but not limited to the workbook/lab manual, LearnSmart, the video program, and chat tools, is sold separately and does not come automatically with the purchase of the textbook.",
        "Category": " Foreign Language Study , Spanish",
        "Publisher": "McGraw-Hill College",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Breaking Away to Virginia and Maryland Wineries (Washington Weekends)",
        "Authors": "By Frater, Elisabeth",
        "Description": "The first in the \"Washington Weekends\" series, \"Breaking Away to Virginia and Maryland Wineries\" describes the lush, green splendor of the countryside, the charm and beauty of the vineyards and wineries, and the history and personalities of the industry in this up-and-coming wine region. Two pages are dedicated to each of 60 wineries in Virginia and 10 in Maryland, including information about the owners of the winery, directions, hours of operation, and the wines offered. Sprinkled throughout are sidebars on interesting topics that enrich the reader’s wine experience and highlight special places and activities in the area including barrel tasting, the cheeses of Virginia, horseback riding, historic inns, and more. Included are useful maps, the best winery wedding sites, and an ‘aroma wheel’ that enhances the tasting experience.",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Capital Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Mr. Darcy Takes a Wife: Pride and Prejudice Continues",
        "Authors": "By Berdoll, Linda",
        "Description": "Every woman wants to be Elizabeth Bennet Darcy—beautiful, gracious, universally admired, strong, daring and outspoken—a thoroughly modern woman in crinolines. And every woman will fall madly in love with Mr. Darcy—tall, dark and handsome, a nobleman and a heartthrob whose virility is matched only by his utter devotion to his wife.Their passion is consuming and idyllic—essentially, they can't keep their hands off each other—through a sweeping tale of adventure and misadventure, human folly and numerous mysteries of parentage.Hold on to your bonnets! This sexy, epic, hilarious, poignant and romantic sequel to Pride and Prejudice goes far beyond Jane Austen.",
        "Category": " Fiction , Classics",
        "Publisher": "Sourcebooks Landmark",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Search for Ancient Greece",
        "Authors": "By Etienne, Francoise and Etienne, Roland",
        "Description": "A critical study of ancient Greek culture and its dramatic influence on the course of Western civilization also examines the development of archaeology in nineteenth- and twentieth-century Greece. Original.",
        "Category": " History , Ancient , Greece",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Ten Philosophical Mistakes: Basic Errors in Modern Thought - How They Came About, Their Consequences, and How to Avoid Them",
        "Authors": "By Adler, Mortimer J.",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Starfish, Seashells, and Crabs (A Golden Junior Guide)",
        "Authors": "By Fichter, George S. and Sandstrom, George F. (ILT)",
        "Description": "Introduces different kinds of starfish, shells, and crabs, and tells how they live",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Goldencraft",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Deerfield: An American Garden Through Four Seasons",
        "Authors": "By Fell, Derek",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Pidcock Pr",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "Boost Your Brain Power: A Total Program to Strengthen and Expand Your Most Important Resource",
        "Authors": "By Michaud, Ellen and Wild, Russell",
        "Description": "",
        "Category": "",
        "Publisher": "MJF Books",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Design and Details: Creative Ideas for Styling Your Home",
        "Authors": "By Manroe, Candace Ord, Frankel, Candie, and Litchfield, Michael W.",
        "Description": "Packed with lavish full-color photography, Design & Details explores the many ways to bring life to your home, from making a splash with an unusual color of paint and changing the lighting scheme to laying down tiles and playing up architectural details. Every page will inspire design excellence.",
        "Category": " House & Home , Decorating",
        "Publisher": "Metro Books",
        "Price Starting With ($)": "7.42",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Football: Winning Defense (Sports Illustrated Winner's Circle Books)",
        "Authors": "By Handville, Robert (ILT) and Wilkinson, Bud",
        "Description": "Defense is what wins football games, and this brilliant update of a sports instructional classic is perfectly suited to today's player, coach and fan. Here  Bud Wilkinson , University of Oklahoma's famed former coach, analyzes the basic patterns and strategies employed in defensive football today.",
        "Category": " Sports & Recreation , Football",
        "Publisher": "Sports Illustrated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Energize Your Life",
        "Authors": "By Rowley, Nick",
        "Description": "",
        "Category": "",
        "Publisher": "One Spirit",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "When Dad Cuts Down the Chestnut Tree",
        "Authors": "By Pam Ayres",
        "Description": "",
        "Category": "",
        "Publisher": "DISCOVERY TOYS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Writing with precision: How to write so that you cannot possibly be misunderstood",
        "Authors": "By Bates, Jefferson D.",
        "Description": "",
        "Category": "",
        "Publisher": "Acropolis Books",
        "Price Starting With ($)": "17.5",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Great Food Without Fuss: Simple Recipes from the Best Cooks",
        "Authors": "By McCullough, Frances and Witt, Barbara",
        "Description": "Two seasoned food professionals--one a cookbook editor and the other a caterer--match wits here to solve the kitchen dilemme of the '90s: how to serve imaginative, lively food without spending hours fussing or compromising on soul-satisfying flavor. Their solution is just to look to the great cooks--from Julia Child to James Beard to Diana Kennedy--for the simple dishes that are hidden away in even the most complicated cookbooks. They've assembled a treasury of superb recipes that depend on perfectly balanced flavors. The range is broad, from favorite American classics like spoon bread, corn fritters, and the only really delicious oven-fried chicken to exotic new tastes like Moghul Lamb, Bangkok Chicken, and Pasta with Vodka. For each recipe the editors offer tips, variations, suggests, and down-to-earth commentaries about how to work with exciting new ingredients as well as giving their own tried-and-true favorite recipes, simple winners they've cooked for years to great applause. Altogether there are 119 master recipes with 81 variations and 34 Editors' Kitchen recipes, a true culinary gold mine. In their pursuit of the secrets of true flavor, Frances McCullough and Barbara Witt come up with some unusual approaches, rethinking some of our basic ideas about how to prepare roasted chicken and turkey (in a very hot oven), pasta (one method lets it sit in hot water off the flame), and baking potatoes (they're particularly wonderful baked to death). Here you'll find a lot of nitty-gritty information about entertaining, a refresher course on how to make a really good green salad, lists of canapes and tidbit desserts, a collection of quick breads, and microwave notes.In a warm, intimate, encouragingly frank style, McCullough and Witt constantly encourage cooks to improvise by offering a range of variations, to start them experimenting with foods and flavors to develop their own recipes. This is a unique, user-friendly book that works for beginners who are reasonably sophisticated eaters as well as for experienced cooks. It will become the contemporary cook's favorite sourcebook for distinctive food.",
        "Category": " Cooking , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Fish Tales",
        "Authors": "By Miller, John (EDT) and Lizars, William Home (ILT)",
        "Description": "",
        "Category": " Sports & Recreation , Fishing",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Southern Living Garden Guide: Lawns & Ground Covers (Southern Living Garden Guides)",
        "Authors": "By Pleasant, Barbara",
        "Description": "Profiles over twenty-five lawn grasses, ornamental grasses, and groundcovers suitable for use in the Southern States, explaining how to fertilize, avoid pests and weeds, and design durable low-maintenance lawns",
        "Category": " Gardening , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Gardener's Palette: The Ultimate Garden Plant Planner",
        "Authors": "By Rainbird",
        "Description": "Shows and describes ornamental trees, shrubs, and flowers, explains soil and care requirements, and recommends specific varieties",
        "Category": " Gardening , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "7.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Flowering Shrubs and Small Trees",
        "Authors": "By Zucker, Isabel",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Grove Pr",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "The Wildflower Book: East of the Rockies - A Complete Guide to Growing and Identifying Wildflowers (Stokes Backyard Nature Books)",
        "Authors": "By Stokes, Lillian Q. and Stokes, Donald",
        "Description": "A complete guide to growing, identifying, conserving, and landscaping with the wildflowers found in the eastern half of the United States and Canada includes a full-color, photographic portfolio of the most popular eastern wildflowers. Original.",
        "Category": " Nature , Plants , Flowers",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Lawns and Ground Covers/Landscaping Planting & Care Sprinkler Systems",
        "Authors": "By Sunset Books",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "The Wisdom of Menopause: Creating Physical and Emotional Health and Healing During the Change",
        "Authors": "By Northrup, Christiane",
        "Description": "Dr. Christiane Northrup has become one of American women's most trusted medical advisers. In Women's Bodies, Women's Wisdom, she broke entirely new ground by demonstrating that women's most common medical problems are often rooted in the basic conditions of their lives -- and that they can return to health by learning to listen to their bodies. She also integrated advanced medical techniques with the best natural remedies, offering readers specific guidance on choosing the right approach for themselves. Now, in The Wisdom of Menopause, Dr. Northrup once again challenges convention. \"The change\" is not simply a collection of physical problems to be \"fixed\" -- whether with hormones or herbs -- but a mind-body revolution that brings the greatest opportunity for growth since adolescence. This vitally important new book examines the connection between menopause and a woman's emotional and spiritual life. And it stresses how the choices a woman makes now -- from the quality of her relationships to the quality of her diet--either secure her health and well-being for the rest of her life, or put her future at risk.Dr. Northrup draws on her own life-changing experiences -- as well as on many intimate case histories--to explore the transformative power of these years.  Readers will learn: * how menopause literally rewires the brain, triggering a shift of priorities from nesting and caretaking to personal growth and equality * how to listen for the wake-up calls inherent in women's cyclic nature, from PMS to SAD to menopausal symptoms* how the body adjusts naturally to changing hormones, and how to make personalized decisions about HRT and alternative supplements* how to rebalance metabolism shifts and prevent middle-age spread* how to deal with the myths and realities of sexual changes and appearance issues* how to prevent  long-term health problems such as heart disease, hormone-related cancers, and memory lossCandid and reassuring, The Wisdom of Menopause elucidates the changes women should expect from ages 40 to 55, and shows how these changes can be wonderfully life-affirming. Instead of dreading menopause as a time of loss, women will hear the real message their bodies are sending -- that this is a time of personal empowerment and positive energy ... and a time for women to break free and thrive.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Bantam",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Groundcovers (Burpee American Gardening Series)",
        "Authors": "By Roach, Margaret",
        "Description": "Gives a detailed description of plants suitable for groundcover, including vines and grasses, and presents advice on soil preparation, design, color, and selection of plants",
        "Category": " Gardening , General",
        "Publisher": "Prentice Hall General",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Myths and Facts: A Guide to the Arab-Israeli Conflict",
        "Authors": "By Bard, Mitchell Geoffrey",
        "Description": "For years people have been asking for a resource that provides concise, factual information on the history of the Arab-Israeli conflict. Myths and Facts fills this desperate need. This 384-page guide contains chapters covering everything from Israel's roots to each of the wars to the search for peace. In addition to discussions of the historical issues and current events, the book has a collection of maps and key documents, such as the Hamas Covenant, UN Resolution 242 and the Road Map for peace. The facts are footnoted and a wide variety of sources have been consulted, from Arabic, Hebrew and English newspapers to scholarly journals and books.",
        "Category": " History , United States , State & Local , General",
        "Publisher": "A I C E",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Hardy Herbaceous Perennials (Gardener's Guide)",
        "Authors": "By Schacht, Wilhelm, Fessler, Alfred, and Epp, Michael E. (TRN)",
        "Description": "The first English translation, revised and expanded, of the classic German plant encyclopedia first published 40 years ago. The core of the book is an alphabetical description by genus and species of plants considered hardy in temperate climates and recognized as having garden merit, as well as some species of less aesthetic but greater botanic interest. The presentation combines botanical information, guidance on cultivation, and suggestions for effective landscape use, and includes some 1,000 photographs, about two-thirds in color. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Gardening , Flowers , Perennials",
        "Publisher": "Timber Press, Incorporated",
        "Price Starting With ($)": "32.86",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Down and Out in the Great Depression: Letters from the Forgotten Man",
        "Authors": "By McElvaine, Robert S. (EDT)",
        "Description": "Down and Out in the Great Depression is a moving, revealing collection of letters by the forgotten men, women, and children who suffered through one of the greatest periods of hardship in American history. Sifting through some 15,000 letters from government and private sources, Robert McElvaine has culled nearly 200 communications that best show the problems, thoughts, and emotions of ordinary people during this time.Unlike views of Depression life \"from the bottom up\" that rely on recollections recorded several decades later, this book captures the daily anguish of people during the thirties. It puts the reader in direct contact with Depression victims, evoking a feeling of what it was like to live through this disaster.Following Franklin D. Roosevelt's inauguration, both the number of letters received by the White House and the percentage of them coming from the poor were unprecedented. The average number of daily communications jumped to between 5,000 and 8,000, a trend that continued throughout the Rosevelt administration. The White House staff for answering such letters--most of which were directed to FDR, Eleanor Roosevelt, or Harry Hopkins--quickly grew from one person to fifty.Mainly because of his radio talks, many felt they knew the president personally and could confide in him. They viewed the Roosevelts as parent figures, offering solace, help, and protection. Roosevelt himself valued the letters, perceiving them as a way to gauge public sentiment. The writers came from a number of different groups--middle-class people, blacks, rural residents, the elderly, and children.  Their letters display emotional reactions to the Depression--despair, cynicism, and anger--and attitudes toward relief.In his extensive introduction, McElvaine sets the stage for the letters, discussing their significance and some of the themes that emerge from them. By preserving their original spelling, syntax, grammar, and capitalization, he conveys their full flavor.The Depression was far more than an economic collapse.  It was the major personal event in the lives of tens of millions of Americans. McElvaine shows that, contrary to popular belief, many sufferers were not passive victims of history. Rather, he says, they were \"also actors and, to an extent, playwrights, producers, and directors as well,\" taking an active role in trying to deal with their plight and solve their problems.For this twenty-fifth anniversary edition, McElvaine provides a new foreword recounting the history of the book, its impact on the historiography of the Depression, and its continued importance today.",
        "Category": " History , United States , General",
        "Publisher": "The University of North Carolina Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "A Year Full of Poems",
        "Authors": "By Harrison, Michael (EDT) and Stuart-Clark, Christopher (EDT)",
        "Description": "Now children may  Go out of doors,Without their coats,  To candy stores.The apple branches  And the pearMay float their blossoms  Through the air,And Daddy may  Get out his hoeTo plant tomatoes  In a row,And, afterwards,  May lazilyLook at some baseball  On TV. --from \"May\" by John UpdikeFrom January to December, Michael Harrison and Christopher Stuart-Clark trace all the months of the year in this rich collection of poems for children. Eight to twelve poems are chosen for each month to capture the essence of a particular time and season. Narrative poems, very short poems, funny poems, sad poems--each month offers quite a variety, chosen especially for children aged 9 to 14.February boasts poems by Sara Teasdale and Walter de la Mare. April offers Langston Hughes and Tennyson. John Updike is a contributor to May and August. And the other months are made particularly memorable with poems from Emily Bronte, Longfellow, D. H. Lawrence, Rupert Brooke, Emily Dickinson, and many others. The poems are illustrated by a variety of artists in an open and easy-to-read format that blends the poetry with the artwork. Included are an index of authors and artists, and of titles and first lines.The lavish design and the thoughtful, diverse selection of poems make this an ideal resource for classroom and library, a special gift for a young poet, or the perfect choice for beginning or adding to a child's first personal library.",
        "Category": " Juvenile Nonfiction , Poetry , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Culture of Fear: Why Americans Are Afraid of the Wrong Things",
        "Authors": "By Glassner, Barry",
        "Description": "There has never been another era in modern history, even during wartime or the Great Depression, when so many people have feared so much. Three out of four Americans say they feel more fearful today then they did twenty years ago. The Culture of Fear describes the high costs of living in a fear-ridden environment where realism has become rarer than doors without deadbolts.Why do we have so many fears these days? Are we living in exceptionally dangerous times? To watch the news, you’d certainly think so, but Glassner demonstrates that it is our perception of danger that has increased, not the actual level of risk. The Culture of Fear is an expose of the people and organizations that manipulate our perceptions and profit from our fears: politicians who win elections by heightening concerns about crime and drug use even as rates for both are declining; advocacy groups that raise money by exaggerating the prevalence of particular diseases; TV newsmagazines that monger a new scare every week to garner ratings.Glassner spells out the prices we pay for social panics: the huge sums of money that go to waste on unnecessary programs and products as well as time and energy spent worrying about our fears.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Shadow Of A Man: A Novel",
        "Authors": "By Sarton, May",
        "Description": "Twenty-six-year-old Francis Chabrier fears his inability to love until he discovers the distinctive beauties of Paris and his first love at the same time",
        "Category": " Fiction , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1982"
        }
    },
    {
        "Title": "The Oxford Dictionary of Foreign Words and Phrases",
        "Authors": "By Speake, Jennifer (EDT)",
        "Description": "If foreign words and phrases are your \"bete noire\", here is a superb reference that offers coverage of over 8,000 foreign words and phrases that are in regular use in English today. Readers will find clear definitions of words such as \"fandango,\" \"futon,\" \"falsetto,\" \"basmati,\" \"bistro,\" \"nouvelle cousine\"--and many other words found in everyday speech as well as in musical direction, the arts, food, medicine, science, literature and belles-lettres. As one would expect in a language as global as English, the Dictionary draws words from a wide array of languages including Afrikaans, Chinese, Dutch, French, German, Greek, Hebrew, Hindustani, Italian, Japanese, Latin, Russian, and Turkish. The entries are browsable, but also authoritative, with detailed information on each word or phrase, including any alternative spellings, the date of the word's introduction into English, its language of origin and original spelling, its definition, and notes on usage and other points of interest. Quotations have been liberally sprinkled throughout to illustrate how the words are used in context. All of these features add up to a book that is \"sine qua non\" (absolutely indispensable) for all reference shelves.",
        "Category": " Language Arts & Disciplines , Linguistics , Etymology",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "No Hiding Place: A Tamara Hayle Mystery",
        "Authors": "By Wesley, Valerie Wilson",
        "Description": "In just three Tamara Hayle mysteries, Valerie Wilson Wesley has created one of the most memorable private investigators to hit urban streets in years. As the Ft. Lauderdale Sun-Sentinel has proclaimed, \"Tamara continues to emerge as a strong, decisive woman.\" When the grieving mother of a slain hoodlum begs the Newark p.i. to look into the unsolved murder, Tamara initially refuses, but then discovers a connection between the victim and her late policeman brother. Her search for the truth takes Tamara from the grittiest sections of the city to its middle class neighborhoods where family secrets are preserved at any cost. However, as the case creeps into her personal life, Tamara learns that when it comes to murder--there is no hiding place.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Gadget (Penguin Crime Fiction)",
        "Authors": "By Freeling, Nicolas",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "May",
            "Year": "1979"
        }
    },
    {
        "Title": "The Garden of Claude Monet: The Four Seasons of Giverny",
        "Authors": "By Prost, Charles (PHT)",
        "Description": "",
        "Category": " Art , Individual Artists , General",
        "Publisher": "Barron's Educational Series, inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Cupids and Cherubs: Divine Inspirations in Craft and Decorating",
        "Authors": "By Owens, Louise, Tully, Kate, and Bacon, Quentin",
        "Description": "",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Barron's Educational Series, inc",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "East and West: China, Power, and the Future of Asia",
        "Authors": "By Patten, Chris",
        "Description": "Hong Kong's last British governor takes a close-up look at the future of Asia and explains how its influence will shape world politics, economics, and social institutions in the twenty-first century. 50,000 first printing. Tour.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Times Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Enchanted Love: The Mystical Power Of Intimate Relationships",
        "Authors": "By Williamson, Marianne",
        "Description": "Three of Marianne Williamson's previous best-sellers -- A Return to Love, A Woman's Worth, and Illuminata -- explored the issue of relation- ships. Now, in this deeply personal collection of essays, prayers, and self- reflection, she turns to romantic love.  Enchanted Love envisions a way of being in love with another person and at peace and at one with God and with ourselves. It envisions a reinvention of romantic love as our newest spiritual frontier. In Illuminata Williamson wrote that \"we experience God to the extent to which we love, forgive, and focus on the good in others and ourselves.\" Now, in Enchanted Love, she writes that \"enchanted partnership begins with the conscious understanding, on the part of two people, that the purpose of their relationship is not so much material as spiritual, and the internal skills demanded by it are prodigious.\" High romance, she says, \"is not about past or future. It is not about practicality. It is not about society or worldly routines. It is an audacious ride to the center of what is, at the heart of every person. It is a bold and masterful inquiry into what two people really are and how we might become, while still on earth, the angels who reside within us.\"  Filled with parables and references to classic myths and legends of love, Enchanted Love also contains some of Williamson's beautiful signature prayers to help readers -- single or coupled -- meditate and awaken to the possibilities of romantic enchantment within themselves and with their partners. We can only experience what we are willing to acknowledge, Williamson writes, as she guides us on a sacred journey from our disenchanted worlds to a paradise on earth, where we and our loved ones can give and receive enchanted love.",
        "Category": " Religion , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Changing America: Blueprints for the New Administration : The Citizens Transition Project",
        "Authors": "By Green, Mark J. (EDT) and Citizens Transition Project (U. S.) (COR)",
        "Description": "Thirteen months before the 1992 national election, dozens of scholars, authors, and officials came together to form the nonprofit Citizens Transition Project, with the goal of drafting a transition report for the new administration that would help provide a fast start for bold change. Changing America is the result. The only transition report organized on a government-wide, agency-0by-agench basis, its 58 chapters by 78 leading progressive commentators represent, according to editor Mark Green, \"a menu of new ideas for a new President in this new post-Cold Wear era.\" The complete 1200-page manuscript was delivered to President-elect Clinton on November 4., 1992. This is the only full-length publication of the report in book form.",
        "Category": " Political Science , Public Affairs & Administration",
        "Publisher": "Newmarket Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "Looking Good in Print: A Guide to Basic Design for Desktop Publishing (The Ventana Press Looking Good Series)",
        "Authors": "By Parker, Roger C.",
        "Description": "New edition of a clear and thorough guide to good design for desktop publishers. Advises on directing the reader's eye, choosing images, choosing type, creating balance, and avoiding common mistakes that undermine impact. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Ventana Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Applique Innovations: New Techniques for Beautiful Clothing",
        "Authors": "By Mercik, Agnes",
        "Description": "",
        "Category": " Crafts & Hobbies , Applique",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Around America: A Tour of Our Magnificent Coastline",
        "Authors": "By Cronkite, Walter and Canright, David (ILT)",
        "Description": "In a witty travelogue, the award-winning journalist describes his odyssey around the coastlines of America, from the easternmost tip of Maine, to the islands off the coast of Texas, to California's Redwood Coast, documenting the people and places, past and present, that have shaped the United States.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "George Washington",
        "Authors": "By Jones, Robert Francis",
        "Description": "George Washington: Ordinary Man, Extraordinary Leader is a revised edition of the author's George Washington, published in 1979. Totally updated to include the author's extensive research conducted in the intervening two decades, the book is a concise but complete biography of Washington as gentleman planter, colonial rebel, American general, and U.S. president. The book provides a full and even-handed portrait of the first president, with special emphasis on how he took his rather commonplace talents and transformed them with self-discipline into extraordinary leadership in a time of turmoil. The book pays special attention to Washington's struggles during the Revolution and his tenure as president and deals with his gradual conversion from advocate of nonpartisan politics to a strict Federalist. This book synthesizes the current research in a readable style that affords the general reader an understanding of Washington's special character and his vital role in the making of the United States.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Fordham University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Byways of America",
        "Authors": "By IDEAL'S PUBLICATIONS and Skarmeas, Nancy J. (EDT)",
        "Description": "",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Ideals Childrens Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Creative Ideas for Decorating",
        "Authors": "By Thomason, Julia Hamilton (EDT)",
        "Description": "Offers suggestions concerning color, pattern, stenciling, window treatments, furniture, and accessories, and shows kitchens, dining rooms, bedrooms, and living rooms",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Free to stay at home: A woman's alternative",
        "Authors": "By Horton, Marilee",
        "Description": "",
        "Category": "",
        "Publisher": "Word Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Back to Square One: A Practical Guide to the Spirit-LED Life",
        "Authors": "By Christenson, Larry",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "Decade of Destiny",
        "Authors": "By Vandeman, George E.",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Pacific Pr Pub Assn",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Great Golf Courses of the World",
        "Authors": "By Jacobs, Timothy",
        "Description": "",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Bokotola",
        "Authors": "By Fuller, Millard",
        "Description": "",
        "Category": " Religion , Christian Ministry , Missions",
        "Publisher": "Winchester Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "HTML, Java, CGI, VRML, SGML Web Publishing Unleashed",
        "Authors": "By Stanek, William R.",
        "Description": "This comprehensive Web publishing resource shows those who are new to the Web how to create, design and publish Web publications. It gives an overview of the Web and then explores in greater detail HyperText Markup Language, interactive publications, Web publishing production systems, multimedia concepts, the future of the Web, and how to build and publish a Web page.  Contains 5 Appendices including an HTML reference and SGML upgrade guide. The included CD-ROM contains HTML editing tools source code, Java applets, and Netscape plug-ins, among other useful material. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Computers , Internet , General",
        "Publisher": "Sams",
        "Price Starting With ($)": "7.72",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "America's wildlife sampler",
        "Authors": "By Peters, Barbara",
        "Description": "",
        "Category": "",
        "Publisher": "National Wildlife Federation",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "American Horticultural Society Practical Guides: Roses",
        "Authors": "By Hawthorne, Linden",
        "Description": "Tells how to plant, train, and cultivate roses, and describes the characteristics of popular varieties",
        "Category": " Gardening , Regional , General",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "A Charge to Keep: My Journey to the White House",
        "Authors": "By Bush, George W.",
        "Description": "I was not elected to serve one party, but to serve one nation.  The president of the United States is the president of every single American, every race and every background.  Whether you voted for me or not, I will do my best to serve your interests, and I will work to earn your respect.I will be guided by President Jefferson's sense of purpose: to stand for principle, to be reasonable in manner, and, above all, to do great good for the cause of freedom and harmony.The presidency is more than an honor, it is more than an office.  It is a charge to keep, and I will give it my all.--George W. Bush, December 13, 2000, Texas House of RepresentativesIn A Charge to Keep, George W, Bush offers readers a warm, insightful, and honest look at the personal and political experiences that have shaped his values and led to his decision to run for president.  The George W. Bush who leaps off these pages has his mother's wit and down-to-earth personality, his father's energy and competitive drive, and his own unique style and philosophy.Written with his long term communications director, Karen Hughes, A Charge to Keep is a revealing look into the background, philosophy, family, and heart of our new president.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Finding Your Roots: How Every American Can Trace His Ancestors At Home and Abroad",
        "Authors": "By Westin, Jeane Eddy",
        "Description": "Americans interested in finding out about their personal heritages are shown that family-tree tracing can be done simply and inexpensively using such sources as public records, ship manifestos, and foreign registries",
        "Category": " History , General",
        "Publisher": "Tarcherperigree",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Defcon One: A Novel",
        "Authors": "By Weber, Joe",
        "Description": "A worst-case scenario of the future of U.S.-Soviet relations envisions the failure of the current Soviet reform, leading to a desperate attack on the U.S. that threatens to escalate to nuclear war",
        "Category": " Fiction , General",
        "Publisher": "Presidio Pr",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Bertie and the Tinman",
        "Authors": "By Lovesey, Peter",
        "Description": "In 1886, after a jury rules that the death of a popular jockey known as the Tinman had been suicide, the Prince of Wales suspects murder and at great personal risk, investigates the crime",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mysterious Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Developing client/server applications",
        "Authors": "By Inmon, William H.",
        "Description": "",
        "Category": "",
        "Publisher": "Qed Technical Pub. Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Courting Emma Howe: A Novel",
        "Authors": "By Robinson, Margaret A.",
        "Description": "Reality clashes with expectations when, in 1905, Vermont resident Emma Howe travels to Washington's North Falls to marry Arthur Smollet, a man she has never met and knows only through correspondence",
        "Category": "",
        "Publisher": "Adler & Adler Pub",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Braided Streams: Esther and a Woman's Way of Growing",
        "Authors": "By Bankson, Marjory Zoet",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "LuraMedia",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1985"
        }
    },
    {
        "Title": "Guilty of Innocence",
        "Authors": "By Costopoulos, William C.",
        "Description": "",
        "Category": " Comics & Graphic Novels , General",
        "Publisher": "Camino Books Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Development Strategies Reconsidered: A New Synthesis (World Policy Perspectives, No 5)",
        "Authors": "By Lewis, John P. and Kallab, Valeriana (EDT)",
        "Description": "\"First rate, comprehensive analysis-presented in a manner that makes it extremely valuable to policymakers.\"--Robert N. Nathan, Robert Nathan AssociatesIn this volume, policy syntheses are proposed to reconcile the goals of growth, equity, and adjustment, to strike fresh balances between agricultural and industrial promotion and between capital and other inputs, and to reflect the interplay of democracy and development. This volume includes contributions by John P. Lewis, Irma Adelman, John W. Mellor, Jagdish N. Bhagwati, Leopoldo Solis, Aurelio Montemayor, Colin I. Bradford, Jr., Alex Duncan, and Atul Kohli.",
        "Category": " Business & Economics , International , General",
        "Publisher": "Transaction Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Blue-collar Christianity",
        "Authors": "By Exley, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Classic English Crime",
        "Authors": "By Heald, Tim (EDT)",
        "Description": "In honor of the Agatha Christie Centenary, leading members of the Crime Writers' Association offer thirteen stories set in the Golden Age of detective fiction, between the two world wars",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mysterious Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Discover America: The Smithsonian Book of the National Parks",
        "Authors": "By Little, Charles E. and Muench, David (PHT)",
        "Description": "Discover America offers a fresh way to explore the vast pageant of natural and human history to be found in the National Park Service's 368 national monuments, parks, battlefields, and preserves. Linking together better- and lesser-known sites, the book opens new vistas on our country's geology, prehistory, immigration, settlement, and war.Discover America is more than an information-packed guide to understanding our nation's history. It is also a celebration in words and pictures of the parks that best express the essential character of America. With an engaging, full-length narrative by acclaimed author Charles E. Little and the color photography of David Muench, America's premier landscape photographer, Discover America highlights the parks that convey the full sweep, grandeur, and tragedy of our past.",
        "Category": " Travel , Parks & Campgrounds",
        "Publisher": "Smithsonian Institution",
        "Price Starting With ($)": "5.28",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "High Spirits: A Celebration of Scotch, Bourbon, Cognac, and More",
        "Authors": "By Jeffers, H. P. and Gordon, Kevin (ILT)",
        "Description": "High Spirits celebrates the world of fine spirits - single-malt scotches, small-batch bourbons, fine cognacs, liqueurs, and the clear spirits (gin, vodka, and others) - with a unique blend of practical information and entertaining anecdote.The book discusses how these spirits are made and which ones (in the author's unassailable opinion) are best. It describes both the role spirits have played in history as well as practicalities of bar setup and drink mixing. And it dispenses even measures of lore, illustrations, and good sense about these liquors in a supremely engaging way.",
        "Category": " Cooking , Beverages , Wine & Spirits",
        "Publisher": "The Lyons Press",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Irresistible Impulse: A True Story of Blood and Money",
        "Authors": "By Lindsey, Robert",
        "Description": "From Robert Lindsey, best-selling author of The Falcon and the Snowman and The Flight of the Falcon, comes a riveting true story of money, madness, and murder.To Monika Zumsteg, a modest California beauty, it seemed like a fairy tale come true. The quiet, handsome Englishman who rode in on a gleaming motorcycle, who swept her off her feet, and who politely asked her father for her hand in marriage, turned out to be one of the richest men in the world. He is an heir to the billion-dollar fortune of the Vesteys, Britain's second-wealthiest family after the royals.At first, her life in England is idyllic. The newlyweds settle into a sprawling manor house in the countryside. The Vestey Trust picks up all the expenses. Monika learns to ride and hunt foxes, dabbles in Victorian antiques, and even applies to Oxford. She is thrown into a world of wealth and aristocracy beyond her imagination. But what began as a storybook romance soon becomes an unstoppable horror.Her husband, Michael Telling, is sly, deceitful, and wildly erratic. She makes excuses for his lies and his disappearances. In fits of jealousy, he rips apart their home and threatens Monika with knives and guns. A diabetic, he sends himself into insulin shock in a desperate plea to keep her from leaving. Monika discovers that Michael spent much of his privileged childhood in a psychiatric hospital, and she can't resist trying to help him. Besides, his aristocratic family tells the bride from California they are counting on her.Monika's efforts and Michael's promises give the couple a chance to put their marriage back on track. But no matter how hard she tries, Monika never knows what to expect. As the terror in her life increases, she turns to alcohol. Monika and Michael are on a fatal collision course that neither seems able to escape.Irresistible Impulse is a vivid, Hitchcockian account of what became one of England's most celebrated and disturbing criminal cases. It is a complex and complete psychological study, a bone-chilling drama that only Robert Lindsey could write.",
        "Category": " Social Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Kings of the Hill: An Irreverent Look at the Men on the Mound",
        "Authors": "By Herskowitz, Mickey and Ryan, Nolan",
        "Description": "The only major league pitcher to pitch seven career no-hitters presents an insightful look at some of the remarkable pitchers in baseball, including Tom Seaver, Catfish Hunter, Roger Clemens, Dwight Gooden, Don Drysdale, Juan Marichal, and others. $50,000 ad/promo.",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Independence Avenue",
        "Authors": "By Sherman, Eileen Bluestone",
        "Description": "Elias, a fourteen-year-old Russian immigrant, arrives alone in Kansas City in 1907, finding new employment and friends but also receiving bad news about his family back in Russia.",
        "Category": " Juvenile Fiction , People & Places , United States , General",
        "Publisher": "The Jewish Publication Society",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Adolescent sexuality in contemporary America: personal values and sexual behavior, ages, thirteen to nineteen",
        "Authors": "By Sorensen, Robert C",
        "Description": "",
        "Category": "",
        "Publisher": "World Publishing",
        "Price Starting With ($)": "26.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Audubon Perspectives:Fight for Survival (Wiley Nature Editions)",
        "Authors": "By Disilvestro, Roger L.",
        "Description": "This beautifully illustrated book is the companion volume to this year's eight Audubon Television Specials on PBS and TBS. Offering an in-depth look at the fight for survival of a number of endangered species imperiled habitats, it unites image and word to create a beautiful and enduring chronicle of hope. The book combines dramatic on-the-scenes photojournalism with the exquisite nature photography that has become an Audubon hallmark. From ocean depths to arctic tundra and ancient forests, the collection of pieces here will bring readers to the major battlefields where the fight for survival is being waged by species such as wolves, sea turtles, and sharks. The role played by human beings in those battles is thoroughly explored, and shown to be no longer exclusively the concern of environmentalists but an issue of increasing importance to ordinary people around the world.",
        "Category": " Business & Economics , General",
        "Publisher": "John Wiley & Sons / Audubon Society",
        "Price Starting With ($)": "7.72",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "999 Little Known Natural Healing Foods and Proven Home Remedies",
        "Authors": "By Frank Cawood and Associates, Fc&a",
        "Description": "",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "6.83",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "A still and woven blue",
        "Authors": "By Stookey, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Andre Talks Hair",
        "Authors": "By Walker, Andre and Wiltz, Teresa",
        "Description": "Andre Walker, five-time Emmy Award-winning hairstylist for the Oprah Winfrey Show, has the solutions to your hair problems, from finding the right stylist to maintaining your crowning glory.Based on your hair type, Andre will fill you in on the dos and don'ts of hair care and help you determine the best look for your lifestyle. He'll teach you how to maintain your new tresses and add versatility by \"doing the 'do\" - adding color, texture and other accents without damaging what nature gave you. Andre also celebrates the beauty of gray hair with advice on how to create a well-cut, healthy head of gorgeous silver. Throughout Andre Talks Hair!, you'll find page after page of fabulous photographs.",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.63",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Buscapade: Plain Talk Across the USA (USA Today)",
        "Authors": "By Neuharth, Allen H.",
        "Description": "Gathers brief interviews with governors local residents, and celebrities from all fifty states",
        "Category": " History , General",
        "Publisher": "Longmeadow Pr",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Cross Stitch: Inspirations in Color",
        "Authors": "By Dessein, Miky, Filippa, Elda, and Schiaffino, Mariarosa",
        "Description": "",
        "Category": "",
        "Publisher": "Friedman/Fairfax Pub",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "Get a Raise in 7 Days: 10 Salary Savvy Steps to Success",
        "Authors": "By Krannich, Ronald L. and Krannich, Caryl Rae",
        "Description": "A step-by-step guide shows readers what to say and do to get a raise or promotion, using a ten-step plan for salary enhancement, a sample pitch for a raise, strategies for documenting their performance, and more. Original. Tour. IP.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Impact Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Great People of the 20th Century",
        "Authors": "By Time Magazine (EDT)",
        "Description": "",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Fifth Generation Management: Integrating Enterprises Through Human Networking",
        "Authors": "By Savage, Charles",
        "Description": "Savage argues that new technologies like computer integrated manufacturing and computer integrated enterprises will never be successful until organizations transform their management structures from the steep hierarchies of second generation management to the flattened networks of the fifth generation. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Digital Pr",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "For Your Garden: Hanging Basket and Planters",
        "Authors": "By Dunn, Teri",
        "Description": "",
        "Category": " Crafts & Hobbies , Flower Arranging",
        "Publisher": "Friedman/Fairfax Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Bar/Bat Mitzvah Basics: A Practical Family Guide to Coming of Age Together",
        "Authors": "By Leneman, Helen (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Jewish Lights Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Dynamics of Worship",
        "Authors": "By Gills, James",
        "Description": "",
        "Category": "",
        "Publisher": "Love Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Frog Girl",
        "Authors": "By Lewis, Paul Owen",
        "Description": "When the frogs suddenly vanish from the lake behind her village, a young Native American girl is led to the frog village underneath the lake and learns what she must do to save both the frogs and her own people.",
        "Category": " Juvenile Fiction , People & Places , United States , Native American",
        "Publisher": "Beyond Words Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Inside the I. B. M. Personal Computer: Access to Advanced Features and Programming (The Peter Norton Foundation series)",
        "Authors": "By Norton, Peter",
        "Description": "Revision of  Inside the IBM PC  (1986). Covers every generation, from the original PC to the latest PS/2 models. No bibliography. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Brady Publishing",
        "Price Starting With ($)": "5.61",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "Improving Your Memory: How to Remember What You're Starting to Forget",
        "Authors": "By Stern, Lynn and Fogler, Janet",
        "Description": "Do you have trouble finding your keys or recalling a familiar name? Do you arrive home from the grocery store without all the items you needed to buy? Are you worried that this kind of forgetfulness will become a more serious problem over time? This book - with its clear explanation of how memory works and its variety of simple strategies to improve memory - will help you do something about this common concern.The first edition of Improving Your Memory received rave reviews in the national media and enthusiastic endorsements from the thousands who benefited from its advice. This revised edition builds on the strengths of the original - it's still fun and easy to read - and now includes even more practical information and proven methods to improve memory for people of all ages.Improving Your Memory will help you with memory improvement techniques that work - and are fun and easy to use; step-by-step descriptions of how to use strategies such as written reminders, the story method, first letter cues, and alphabet search; self-assessment exercises and clear explanations of how the memory process works and how it changes over time; and facts about stress, nutrition, medication, depression, physical illness, and other factors that affect memory.As Americans have become more active and health-conscious in recent years, attitudes about aging have changed dramatically. But, surprisingly, many people still believe that serious memory loss is a natural part of the aging process. Improving Your Memory separates fact from fiction. It explains that, while memory changes do occur as people age, nearly everyone's memory skills can be improved with training and practice. With detailed information and practical strategies for coping with memory changes, this book is an essential resource.",
        "Category": " Self-help , General",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Lenin's Grandchildren: Preschool Education in the Soviet Union",
        "Authors": "By Kitty D. Weaver",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "April",
            "Year": "1971"
        }
    },
    {
        "Title": "Low-Fat, High-Flavor Cookbook (Today's Gourmet)",
        "Authors": "By Wyatt, Nancy Fitzpatrick (EDT)",
        "Description": "",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "A Scandal in Belgravia",
        "Authors": "By Barnard, Robert",
        "Description": "A moving and suspenseful story of two men, Peter Proctor, a retired British cabinet minister and Timothy Wycliffe, a young aristocrat murdered thirty years ago, offers a penetrating analysis of social decay and society in transition",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Altered Fates: Gene Therapy and the Retooling of Human Life",
        "Authors": "By Lyon, Jeff and Gorner, Peter",
        "Description": "As gripping as a novel, this tale of science, medicine, politics, and the jealousies, passions, and dedication of the human heart is certain to be recognized as one of the major nonfiction works of the decade.Seven years in the making, Altered Fates chronicles the saga of gene therapy, a medical revolution unparalleled in human history. Scientists armed with powerful new tools of genetic engineering are attacking such deadly disorders as lung cancer, heart disease, and AIDS by repairing and replacing defective genes. Further, they are racing to find the genes responsible for depression, schizophrenia, Alzheimer's disease, and other psychiatric and neurologic disorders, and they are consummating the marriage of genetics and reproductive technology, raising the possibility of human cloning and the production of \"designer\" babies.In the pages of this rich and detailed narrative, whose characters include the field's leading scientists as well as key patients and their families, the Pulitzer Prize-winning authors tell the story of the race to be the first to do gene therapy (a feat almost certain to garner a Nobel Prize and a place in medical history), uncovering the behind-the-scenes machinations and rivalries among the prima-donna researchers at some of the world's leading medical centers, including the National Institutes of Health. They also reveal the details of the initial human experiments in gene transfer, and the agonizing decisions faced by the families of the first children to be submitted to the therapy.",
        "Category": " Medical , Genetics",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "A Proper Breakfast",
        "Authors": "By Parsons, Alexandra and Safarewicz, Evie",
        "Description": "Offers more than forty recipes and practical breakfast menus from around the world",
        "Category": " Cooking , Courses & Dishes , Breakfast",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Gertrude and Alice",
        "Authors": "By Souhami, Diana",
        "Description": "Nominated for a Lambda literary award, this incisive biography draws on memoirs, letters, published writings, and other sources to examine the relationship between Gertrude Stein and Alice B. Toklas. Reprint.",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Entertaining in Style: A Year of Recipes, Menus & Celebrations",
        "Authors": "By Hobson, Wendy",
        "Description": "",
        "Category": " Cooking , Entertaining",
        "Publisher": "Quadrillion Pub",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Burden of Desire (Harvest Book)",
        "Authors": "By MacNeil, Robert",
        "Description": "The disastrous 1917 explosion of a munitions ship in Halifax Harbor, Nova Scotia, forms the backdrop to this “rich, abundantly humane love story” (Chicago Tribune)-”a powerful piece of work” (Washington Post Book World) that marks an “auspicious fiction debut for an already accomplished author and award-winning journalist” (Chicago Sun-Times).",
        "Category": " Fiction , Historical",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Fast Fade (Jacob Asch Mystery)",
        "Authors": "By Lyons, Arthur",
        "Description": "Los Angeles private investigator Jacob Asch investigates the murder of Walter Cairns, a noted film director whose enemies were numerous",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mysterious Pr",
        "Price Starting With ($)": "16.42",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Interview for Success: A Practical Guide to Increasing Job Interviews, Offers, and Salaries (6th ed)",
        "Authors": "By Krannich, Ronald L. and Krannich, Caryl Rae",
        "Description": "The Drs. Krannich quickly show interviewees how to best prepare for different types of interviews, network for information and advice, handle stress, observe etiquette, formulate key questions, rehearse the tough questions, dress appropriately, communicate class, listen effectively, reach an excellent salary figure, handle the critical post-interview period, and much more.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Impact Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Microsoft Certification Success Guide",
        "Authors": "By Mueller, John Paul",
        "Description": "",
        "Category": " Computers , General",
        "Publisher": "Windcrest",
        "Price Starting With ($)": "10.63",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Invertebrates (Exploring Science)",
        "Authors": "By Burnham, Bradford",
        "Description": "",
        "Category": " Young Adult Nonfiction , General",
        "Publisher": "Thomson Learning",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    }
]