[
    {
        "Title": "Upgrading & Fixing PCs For Dummies (4th ed)",
        "Authors": "By Rathbone, Andy",
        "Description": "The best-selling author of Windows 95 for Dummies presents a comprehensive, up-to-date handbook that describes the latest in computer technology, offers step-by-step guidelines for adding memory and software to a system, and discusses Windows 98, plug-and-play operations, Internet connections, and more. Original. (Beginner).",
        "Category": " Computers , Hardware , Personal Computers , PCs",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "The Interplay of Influence: News, Advertising, Politics, and the Mass Media (Mass Communication Series)",
        "Authors": "By Campbell, Karlyn Kohrs and Jamieson, Kathleen Hall",
        "Description": "Helps students understand the power of the media to influence perceptions, and provides tools for analyzing media messages. This fifth edition covers new government regulations relating to mass media, discusses political advertising, and offers current coverage of the Internet and its influence on news, advertising, and politics. There are also new case studies. Jamieson teaches communication and is dean of the Annenberg School for Communication at the University of Pennsylvania.  Campbell is chair of the Speech-Communication Department at the University of Minnesota. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Social Science , Media Studies",
        "Publisher": "Wadsworth Publishing",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Bikram's Beginning Yoga Class",
        "Authors": "By Reynolds, Bonnie Jones and Choudhury, Bikram",
        "Description": "Sweat, strain, laugh, and do more for your health, body, and general well-being than you even imagined possible as you take your beginning yoga class from Bikram. For more than twenty years, Bikram's Beginning Yoga Class has been among the preeminent and most beloved of all yoga guides-and now it has been revised and updated by Bikram, with virtually all-new photographs and an updated section on yoga's medical benefits.With nearly two hundred vivid instructional photographs, Bikram's Beginning Yoga Class is the perfect guidebook for any student of yoga, either advanced or beginner-a reference that makes Hatha yoga fun, easy, and completely understandable.Illustrated throughout with 160 black-and-white photographs by Biswanath \"Bisu\" Ghosh",
        "Category": " Health & Fitness , Yoga",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1978"
        }
    },
    {
        "Title": "Controlling vegetable pests",
        "Authors": "By Putnam, Cynthia (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Ortho Books, Chevron Chemical Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Fodor's Oregon (Full-color Travel Guide)",
        "Authors": "By Moker, Molly (EDT), Duecy, Erica (CON), Galgano, Carolyn (CON), Collins, Andrew (CON), and Cypher, Sarah (CON)",
        "Description": "PLAN your Perfect GetawayFull-color guide • Make your trip to Oregon unforgettable with illustrated features, 52 maps, and color photos.Customize your trip with simple planning tools • Top experiences • Restaurant and hotel Best Bet charts • Easy-to-read color regional mapsExplore Portland, the Willamette Valley Wine Country, the Coast, and beyond • Discerning Fodor’s Choice picks for hotels, restaurants, sights, and more • “Word of Mouth” tips from fellow Fodor’s travelers • Illustrated features on wine tasting and tours, whale watching, and adventure sports • Best wineries, breweries, beaches, sport outfitters, shopping, and nightlife Opinions from destination experts • Fodor’s Oregon-based writers reveal their favorite local haunts • Frequently updated to provide the latest information",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "Yoga Bitch: One Woman's Quest to Conquer Skepticism, Cynicism, and Cigarettes on the Path to Enlightenment",
        "Authors": "By Morrison, Suzanne",
        "Description": "What happens when a coffee-drinking, cigarette-smoking, steak-eating twenty-five-year-old atheist decides it is time to get in touch with her spiritual side? Not what you’d expect . . .   When Suzanne Morrison decides to travel to Bali for a two-month yoga retreat, she wants nothing more than to be transformed from a twenty-five-year-old with a crippling fear of death into her enchanting yoga teacher, Indra—a woman who seems to have found it all: love, self, and God.   But things don’t go quite as expected. Once in Bali, she finds that her beloved yoga teacher and all of her yogamates wake up every morning to drink a large, steaming mug . . . of their own urine. Sugar is a mortal sin. Spirits inhabit kitchen appliances. And the more she tries to find her higher self, the more she faces her cynical, egomaniacal, cigarette-, wine-, and chocolate-craving lower self.    Yoga Bitch chronicles Suzanne’s hilarious adventures and misadventures as an aspiring yogi who might be just a bit too skeptical to drink the Kool-Aid. But along the way she discovers that no spiritual effort is wasted; even if her yoga retreat doesn’t turn her into the gorgeously calm, wise believer she hopes it will, it does plant seeds that continue to blossom in surprising ways over the next decade of her life.",
        "Category": " Humor , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2011"
        }
    },
    {
        "Title": "I Don't Know How She Does it (Movie Tie-in Edition) (Vintage Contemporaries)",
        "Authors": "By Pearson, Allison",
        "Description": "Now a Major Motion Picture Delightfully smart and heartbreakingly poignant, Allison Pearson’s smash debut novel has exploded onto bestseller lists as “The national anthem for working mothers.” Hedge-fund manager, wife, and mother of two, Kate Reddy manages to juggle nine currencies in five time zones and keep in step with the Teletubbies. But when she finds herself awake at 1:37 a.m. in a panic over the need to produce a homemade pie for her daughter’s school, she has to admit her life has become unrecognizable. With panache, wisdom, and uproarious wit, I Don’t Know How She Does It brilliantly dramatizes the dilemma of every working mom.",
        "Category": " Fiction , Humorous",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2011"
        }
    },
    {
        "Title": "The Tower, the Zoo, and the Tortoise",
        "Authors": "By Stuart, Julia",
        "Description": "Brimming with charm and whimsy, this national bestseller set in the Tower of London has the transportive qualities and delightful magic of the contemporary classics Chocolat and Amélie. Balthazar Jones has lived in the Tower of London with his loving wife, Hebe, and his 120-year-old pet tortoise for the past eight years. That’s right, he is a Beefeater (they really do live there). It’s no easy job living and working in the tourist attraction in present-day London. Among the eccentric characters who call the Tower’s maze of ancient buildings and spiral staircases home are the Tower’s Rack & Ruin barmaid, Ruby Dore, who just found out she’s pregnant; portly Valerie Jennings, who is falling for ticket inspector Arthur Catnip; the lifelong bachelor Reverend Septimus Drew, who secretly pens a series of principled erot­ica; and the philandering Ravenmaster, aiming to avenge the death of one of his insufferable ravens. When Balthazar is tasked with setting up an elaborate menagerie within the Tower walls to house the many exotic animals gifted to the Queen, life at the Tower gets all the more interest­ing. Penguins escape, giraffes are stolen, and the Komodo dragon sends innocent people running for their lives. Balthazar is in charge and things are not exactly running smoothly. Then Hebe decides to leave him and his beloved tortoise “runs” away. Filled with the humor and heart that calls to mind the delight­ful novels of Alexander McCall Smith, and the charm and beauty of The Guernsey Literary and Potato Peel Pie Society, The Tower, the Zoo, and the Tortoise is a magical, wholly origi­nal novel whose irresistible characters will stay with you long after you turn the stunning last page.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2011"
        }
    },
    {
        "Title": "An Unquenchable Thirst: A Memoir",
        "Authors": "By Johnson, Mary",
        "Description": "NAMED ONE OF THE BEST BOOKS OF THE YEAR BY KIRKUS REVIEWSAn unforgettable spiritual autobiography about a search for meaning that begins alongside one of the great religious icons of our time and ends with a return to the secular world At seventeen, Mary Johnson saw Mother Teresa’s face on the cover of Time and experienced her calling. Eighteen months later, she entered a convent in the South Bronx to begin her religious training. Not without difficulty, this bright, independent-minded Texas teenager eventually adapted to the sisters’ austere life of poverty and devotion, and in time became close to Mother Teresa herself. Still, beneath the white and blue sari beat the heart of an ordinary young woman facing the struggles we all share—the desire for love and connection, meaning and identity. During her twenty years with the Missionaries of Charity, Sister Donata, as she was known, grappled with her faith, her sexuality, the politics of the order, and her complicated relationship with Mother Teresa. Eventually, she left the church to find her own path—one that led to love and herself.Provocative, profound, and emotionally charged, An Unquenchable Thirst presents a rare, privileged view of  Mother Teresa. At the same time, it is a unique and magnificent memoir of self-discovery.",
        "Category": " Religion , Christian Ministry , Missions",
        "Publisher": "Spiegel & Grau",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2011"
        }
    },
    {
        "Title": "Becoming Marie Antoinette: A Novel",
        "Authors": "By Grey, Juliet",
        "Description": "This enthralling confection of a novel, the first in a new trilogy, follows the transformation of a coddled Austrian archduchess into the reckless, powerful, beautiful queen Marie Antoinette. Why must it be me? I wondered. When I am so clearly inadequate to my destiny?Raised alongside her numerous brothers and sisters by the formidable empress of Austria, ten-year-old Maria Antonia knew that her idyllic existence would one day be sacrificed to her mother’s political ambitions. What she never anticipated was that the day in question would come so soon.Before she can journey from sunlit picnics with her sisters in Vienna to the glitter, glamour, and gossip of Versailles, Antonia must change everything about herself in order to be accepted as dauphine of France and the wife of the awkward teenage boy who will one day be Louis XVI. Yet nothing can prepare her for the ingenuity and influence it will take to become queen.Filled with smart history, treacherous rivalries, lavish clothes, and sparkling jewels, Becoming Marie Antoinette will utterly captivate fiction and history lovers alike.Praise for Becoming Marie Antoinette“A thoroughly enjoyable novel, brimming with delightful details. Grey writes eloquently and with charming humor, bringing ‘Toinette’ vividly to life as she is schooled and groomed—molded, quite literally—for a future as Queen of France, an innocent pawn in a deadly political game.”—Sandra Gulland, bestselling author of Mistress of the Sun and the Josephine Bonaparte trilogy“In her richly imagined novel, Juliet Grey meticulously recreates the sumptuous court of France's most tragic queen. Beautifully written, with attention paid to even the smallest detail, Becoming Marie Antoinette will leave readers wanting more!\"—Michelle Moran, bestselling author of Madame Tussaud“A lively and sensitive portrait of a young princess in a hostile court, and one of the most sympathetic portrayals of the doomed queen.”—Lauren Willig, bestselling author of the Pink Carnation series “Wonderfully delectable and lusciously rich, an elegant novel to truly savor. Juliet Grey’s Marie Antoinette is completely absorbing.”—Diane Haeger, author of The Queen’s Rival“[A] sympathetic take on the fascinating and doomed Marie Antoinette.”—Publishers Weekly",
        "Category": " Fiction , Biographical",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2011"
        }
    },
    {
        "Title": "Girls in White Dresses",
        "Authors": "By Close, Jennifer",
        "Description": "Wickedly hilarious and utterly recognizable, Girls in White Dresses tells the story of three women grappling with heartbreak and career change, family pressure and new love—all while suffering through an endless round of weddings and bridal showers.Isabella, Mary, and Lauren feel like everyone they know is getting married. On Sunday after Sunday, at bridal shower after bridal shower, they coo over toasters, collect ribbons and wrapping paper, eat minuscule sandwiches and doll-sized cakes. They wear pastel dresses and drink champagne by the case, but amid the celebration these women have their own lives to contend with: Isabella is working at a mailing-list company, dizzy with the mixed signals of a boss who claims she’s on a diet but has Isabella file all morning if she forgets to bring her a chocolate muffin. Mary thinks she might cry with happiness when she finally meets a nice guy who loves his mother, only to realize he’ll never love Mary quite as much. And Lauren, a waitress at a Midtown bar, swears up and down she won’t fall for the sleazy bartender—a promise that his dirty blond curls and perfect vodka sodas make hard to keep.With a wry sense of humor, Jennifer Close brings us through those thrilling, bewildering, what-on-earth-am-I-going-to-do-with-my-life years of early adulthood. These are the years when everyone else seems to have a plan, a great job, and an appropriate boyfriend, while Isabella has a blind date with a gay man, Mary has a crush on her boss, and Lauren has a goldfish named Willard. Through boozy family holidays and disastrous ski vacations, relationships lost to politics and relationships found in pet stores,Girls in White Dresses pulls us deep inside the circle of these friends, perfectly capturing the wild frustrations and soaring joys of modern life.",
        "Category": " Fiction , Women",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.22",
        "Publish Date": {
            "Month": "August",
            "Year": "2011"
        }
    },
    {
        "Title": "American Dreamers: How the Left Changed a Nation",
        "Authors": "By Kazin, Michael",
        "Description": "A panoramic yet intimate history of the American left—of the reformers, radicals, and idealists who have fought for a more just and humane society, from the abolitionists to Michael Moore and Noam Chomsky—that gives us a revelatory new way of looking at two centuries of American politics and culture. Michael Kazin—one of the most respected historians of the American left working today—takes us from abolitionism and early feminism to the labor struggles of the industrial age, through the emergence of anarchists, socialists, and communists, right up to the New Left in the 1960s and ’70s. While the history of the left is a long story of idealism and determination, it has also been, in the traditional view, a story of movements that failed to gain support from mainstream America. In American Dreamers, Kazin tells a new history: one in which many of these movements, although they did not fully succeed on their own terms, nonetheless made lasting contributions to American society that led to equal opportunity for women, racial minorities, and homosexuals; the celebration of sexual pleasure; multiculturalism in the media and the schools; and the popularity of books and films with altruistic and antiauthoritarian messages.  Deeply informed, at once judicious and impassioned, and superbly written, American Dreamers is an essential book for our times and for anyone seeking to understand our political history and the people who made it.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2011"
        }
    },
    {
        "Title": "Declarations of Independence: Cross-Examining American Ideology",
        "Authors": "By Zinn, Howard",
        "Description": "The acclaimed author of A People's History of the United States (more than 200,000 copies sold) presents an honest and piercing look at American political ideology.",
        "Category": "",
        "Publisher": "Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Darkness, My Old Friend (Jones Cooper)",
        "Authors": "By Unger, Lisa",
        "Description": "The New York Times bestselling author of Beautiful Lies and Fragile returns to The Hollows, delivering a thriller that explores matters of faith, memory, and sacrifice. After giving up his post at the Hollows Police Department, Jones Cooper is at loose ends. He is having trouble facing a horrible event from his past and finding a second act. He’s in therapy. Then, on a brisk October morning, he has a visitor. Eloise Montgomery, the psychic who plays a key role in Fragile, comes to him with predictions about his future, some of them dire.Michael Holt, a young man who grew up in The Hollows, has returned looking for answers about his mother, who went missing many years earlier. He has hired local PI Ray Muldune and psychic Eloise Montgomery to help him solve the mystery that has haunted him. What he finds might be his undoing. Fifteen-year-old Willow Graves is exiled to The Hollows from Manhattan when six months earlier she moved to the quiet town with her novelist mother after a bitter divorce.  Willow is acting out, spending time with kids that bring out the worst in her. And when things get hard, she has a tendency to run away—a predilection that might lead her to dark places.Set in The Hollows, the backdrop for Fragile, this is the riveting story of lives set on a collision course with devastating consequences. The result is Lisa Unger’s most compelling fiction to date.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "August",
            "Year": "2011"
        }
    },
    {
        "Title": "Color Zoo",
        "Authors": "By Ehlert, Lois",
        "Description": "This acclaimed Caldecott Honor Book is a visually exciting introduction to colors, shapes, and animals for preschoolers.\"Boldly designed pages easily carry to the rear of the room during story hours, and brilliant juxtapositions of vibrant primary colors will make children's eyes tingle.\" (School Library Journal)\"A masterpiece of graphic design.\" (American Library Association Caldecott Committee)\"Color Zoo is about concepts—shapes, colors, and animals—but also about looking at the world in a new and creative way.\" (Children's Books and Their Creators)\"Employs ingeniously designed, perfectly die-cut and bound pages which line up exactly to unfold nine distinctly recognizable abstractly formed animal heads. Immensely enjoyable.\" (CCBC Choices)Shapes and colors in your zoo, lots of things that you can do. Heads and ears, beaks and snouts, that's what animals are all about. I know animals and you do too; make some new ones for your zoo.",
        "Category": " Juvenile Fiction , Concepts , Size & Shape",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Facebook: The Missing Manual",
        "Authors": "By Veer, E. A. Vander",
        "Description": "Facebook is the wildly popular, free social networking site that combines the best of blogs, online forums and groups, photosharing, clever applications, and interaction among friends. The one thing it doesn't have is a users guide to help you truly take advantage of it. Until now. Facebook: The Missing Manual gives you a very objective and entertaining look at everything this fascinating Facebook phenomenon has to offer.Teeming with high-quality color graphics, each page in this guide is uniquely designed to help you with specific Facebook tasks, such as signing up, networking, shopping, joining groups, finding or filling a job, and a whole lot more. You'll discover how to create your page and make connections with other members in no time -- everybody who went to your school, for example, or those who work at your company or play on your soccer team. Bingo: instant access to the personal and professional details of all the folks you're connected with, the folks they're connected with, and so on, and so on. With Facebook: The Missing Manual, you learn to:Join a network, whether it's in your area, or work-related, or based on other interestsLook up old friends, find new ones, and decide who you'd like to keep track ofContact members by poking them, writing on their walls, and sending them giftsGet automatic updates from Facebook friends and send updates to themParticipate in groups of particular interest and hook up with members face-to-faceBuy and sell using Facebook's uniquely targeted marketplace and classified adsFind a job or hire employees by combing through Facebook's member poolUse Facebook as a collaboration tool to keep team members, co-workers, clients, and projects up to datePlay it safe by using a multi-pronged approach to ensuring your privacyThink of Facebook as a 30-million-plus-entry searchable Rolodex on steroids! With help from this Missing Manual, you'll quickly get in the swim of the Facebook experience -- without getting in over your head.",
        "Category": " Computers , Web , General",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Headhunters (Vintage Crime/Black Lizard)",
        "Authors": "By Nesbo, Jo and Bartlett, Don (TRN)",
        "Description": "From the author of The Snowman, a funny, dark, and twisted caper story worthy of Quentin Tarantino and the Coen brothers. Roger Brown is a corporate headhunter, and he’s a master of his profession. But one career simply can’t support his luxurious lifestyle and his wife’s fledgling art gallery. At an art opening one night he meets Clas Greve, who is not only the perfect candidate for a major CEO job, but also, perhaps, the answer to his financial woes: Greve just so happens to mention that he owns a priceless Peter Paul Rubens painting that’s been lost since World War II—and Roger Brown just so happens to dabble in art theft. But when he breaks into Greve’s apartment, he finds more than just the painting. And Clas Greve may turn out to be the worst thing that’s ever happened to Roger Brown.",
        "Category": " Fiction , Crime",
        "Publisher": "Vintage Crime/Black Lizard",
        "Price Starting With ($)": "10.95",
        "Publish Date": {
            "Month": "September",
            "Year": "2011"
        }
    },
    {
        "Title": "The 10 Habits of Happy Mothers: Reclaiming Our Passion, Purpose, and Sanity",
        "Authors": "By Meeker, Meg",
        "Description": "This sanity-saving guide “offers practical ways to help you let go of ‘mom guilt’ in order to become a happier, healthier woman” (Parent & Child).Now with wellness tips and exercises!The pressure on women today has pushed many American mothers to the breaking point. It feels as if “doing your best” is never enough to please everyone, and the demands mothers place on themselves are both impossible and unrealistic. Now Meg Meeker, M.D., critically acclaimed author of Strong Fathers, Strong Daughters, puts her twenty-five years’ experience as a practicing pediatrician and counselor into a sound, sane approach to reshaping the frustrating, exhausting lives of so many moms.  Mothers are expected to do it all: raise superstar kids, look great, make good salaries, volunteer for everything, run errands, keep a perfect house, be the perfect wife. Single mothers often have even more demands—and less support. In this rallying cry for change, Dr. Meeker incorporates clinical data and her own experience raising four children to show why mothers suffer from the rising pressure to excel and the toll it takes on their emotional, physical, mental, and spiritual health. Too many mothers are increasingly lonely, anxious, depressed, and unhappy with themselves, refusing to let themselves off the hook. Here, Dr. Meeker has identified the 10 most positive habits of mothers who are healthy, happy, and fulfilled. The key is to embrace a new perspective and create real joy and purpose by utilizing such core habits as  • making friends with those who know the meaning of friendship• finding out what money can buy (and what it cannot)• lightening the overload—and doing less more often• discovering faith and learning how to trust it• taking some alone time and reviving yourself Mothers, it’s time to view the unconditional trust that you see in your children’s eyes when they take your hand or find your face in a crowd as a mirror of your own wonder and worth. You are the light that shines in their lives, the beacon that guides them. By implementing the key strategies in Dr. Meeker’s book, you can be happy, hopeful, and a wonderful role model. You can teach your children to be the very best they can be—and isn’t that still the most precious reward of motherhood?",
        "Category": " Psychology , Mental Health",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2011"
        }
    },
    {
        "Title": "All Our Worldly Goods",
        "Authors": "By Nemirovsky, Irene and Smith, Sandra (TRN)",
        "Description": "In haunting ways, this gorgeous novel prefigures Irène Némirovsky’s masterpiece Suite Française. Set in France between 1910 and 1940 and first published in France in 1947, five years after the author’s death, All Our Worldly Goods is a gripping story of war, family life and star-crossed lovers. Pierre and Agnes marry for love against the wishes of his parents and his grandfather, the tyrannical family patriarch. Their marriage provokes a family feud that cascades down the generations. This brilliant novel is full of drama, heartbreak, and the telling observations that have made Némirovsky’s work so beloved and admired.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2011"
        }
    },
    {
        "Title": "Can't Wait Till Christmas",
        "Authors": "By Huckabee, Mike and Henry, Jed (ILT)",
        "Description": "A New York Times bestseller!One of America's most prominent and personable politicians shares his mischievous side in a heartwarming story of a childhood Christmas. Mike is desperate to get a football for Christmas. Then one day in the middle of December, a box that looks the exact right size appears under his family's Christmas tree. Mike just can't handle the temptation! He convinces his sister Pat that they should open their gifts and play with them THIS INSTANT. And that's what they do. But on Christmas morning, the muddy football gives them away. After talking about the real meaning of Christmas and how some things are worth waiting for, Mike and Pat learn the benefit of patience, making the following Christmas more delightful than ever.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "G.P. Putnam's Sons Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Frankly, My Dear (Timeswept)",
        "Authors": "By Hill, Sandra",
        "Description": "Selene, a gorgeous model who is addicted to men, food, and Gone With The Wind,  falls victim to a voodoo spell that transports her back in time  to the Old South where she meets the man of her dreams in James Baptiste, a dangerously sexy plantation owner. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Sports Speed: #1 Program for Athletes",
        "Authors": "By Dintiman, George B., Ward, Robert D., and Tellez, Tom",
        "Description": "",
        "Category": " Sports & Recreation , Training",
        "Publisher": "Human Kinetics Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Triathlon Training",
        "Authors": "By Barr, Colin and Katai, Steve",
        "Description": "Every man an Iron Man?and every woman, too! No longer exclusive events reserved for only the most committed athletes, triathlons, duathlons (bike and run), and aquathons (swim and run) now attract hundreds of thousands of Americans. Filled with the inside tips, practical advice, and photos, this is the book for any man or woman who wants to compete in multi-sport events, regardless of experience level. --Authors are experienced triathlon competitors and personal trainers --Tips on setting up, equipment, training, diet, and motivation --Dozens of exciting instructional photos",
        "Category": " Sports & Recreation , Training",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Susan Sontag: The Making of an Icon",
        "Authors": "By Rollyson, Carl E. and Paddock, Lisa Olson",
        "Description": "The first--and unauthorized--biography of the so-called dark lady of American letters. Ever since she took American culture by storm with the publication of her Notes on Camp in 1964, Susan Sontag has been a star. Her austere glamour has been a critical factor in her success, making her a role model for intellectual women, a sex symbol for brainy men. She has never ceased to fascinate the public: as brilliant wunderkind, bringing the latest in French thought to America; as sophisticated analyst of her own experience with cancer in Illness as Metaphor; as champion of free speech in the Rushdie Affair; as theater director in besieged Sarajevo; and, with the publication of The Volcano Lover, as best-selling historical novelist. Yet she has both courted that fascination and insisted on holding it at a distance, demanding control over her public image. This first--and most definitely unauthorized--biography delves beneath the surface to examine the forces that made Susan Sontag an international icon. Carl Rollyson and Lisa Paddock explore her public persona and private passions, including the strategies behind her meteoric rise to fame and her political moves and missteps. Above all, they show how the life of Susan Sontag reveals to us the way we live now.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Relax: 200 Ways to Achieve Calm in Mind and Body",
        "Authors": "By Ash, Stephen and Ash, Renata",
        "Description": "",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Thunder Bay Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "The Feel-good Curriculum: The Dumbing Down Of America's Kids In The Name Of Self-esteem",
        "Authors": "By Stout, Maureen, Ph.D.",
        "Description": "The so-called “self-esteem movement”—a progressive, child-centered, discovery model of schooling—has transformed schools into therapeutic clinics and teachers into counselors, creating a generation of righteous, entitled, underachieving children. An insider’s account of the pernicious aspects of this seemingly well-meaning movement, The Feel-Good Curriculum provides devastating evidence that our belief in the power and importance of self-esteem in education is misplaced and without basis.Avoiding political posturing and political correctness, The Feel-Good Curriculum identifies the four specific effects of self-esteem’s stranglehold on our schools—narcissism, emotivism, separatism, and cynicism. It prescribes clear antidotes to them—empathy, rationality and morality, connectedness, and skepticism—and offers a hopeful view of educational philosophy for the next millennium. Professor Stout urges us to replace our coddling, indulgent approach to building self-esteem in children with a sense of authentic self-confidence developed from intellectual, physical, and moral effort and achievement.",
        "Category": " Education , Philosophy, Theory & Social Aspects",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Friendship for Grown-Ups: What I Missed and Learned Along the Way",
        "Authors": "By Whelchel, Lisa",
        "Description": "Do you long for a true friend?\"Isn't that what we all want? To be seen, in all our glory, for better or worse, the good, the bad, and the ugly and still be embraced?\"If only such friendships were easy to find. And keep. For Lisa Whelchel and millions of others, friendship is a challenge. The vulnerability, trust, balance, grace, and time required to develop and maintain strong friendships do not come easily.Growing up as an actress in Hollywood, there were few people Lisa could trust, and even fewer to guide her. By the time she reached adulthood, she had learned to be self-sufficient. She was strong, she was “safe,” and she was lonely.One day, Lisa found that “the desire to experience connection was stronger than the desire to be safe.” She determined right then to finally understand friendship: how to create one, sustain it, and experience the sheer joy of having it. But it wasn’t easy.Since then, she has traveled the ups and downs of friendship, learning about herself, others, and the kinds of friendship God designed.A speaker, teacher, and compelling storyteller, Lisa writes from her heart and her head, sharing her story and helping women understand how to cope with the strengths and weaknesses of friendship, and basing all her advice on the foundation of our ultimate relationship with the Savior.",
        "Category": " Religion , Christian Living , Women's Interests",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Bel-air Dead (Stone Barrington)",
        "Authors": "By Woods, Stuart",
        "Description": "In the newest addition to the New York Times-bestselling series, Stone Barrington comes face-to-face with a beautiful woman from his past. . . .  Stone Barrington receives a rather unexpected phone call from Arrington Calder, the ex-girlfriend with whom he has a son. Arrington's much older husband, the actor Vance Calder, has just died, leaving her a fortune in Centurion Studios stock. Arrington has plans for the money and asks Stone to represent her in the sale of the company. But when he arrives at her home in Bel-Air to finalize the deal, things take a nasty turn. It seems many of Hollywood's rich and beautiful have Arrington and Centurion in their sights, and Stone finds himself dragged into a surprisingly deadly web of intrigue.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2011"
        }
    },
    {
        "Title": "Lonely Planet China (Country Guide)",
        "Authors": "By Harper, Damian, Grundvig, Julie, and Burke, Andrew",
        "Description": "Complemented by easy-to use, reliable maps, helpful recommendations, authoritative background information, and up-to-date coverage of things to see and do, a popular travel guide helps the world traveler discover China with its teeming cities, mountain temples, and ancient palaces. Original.",
        "Category": " Travel , Asia , China",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Elusive Voice,  The (Michael Merrick Mysteries)",
        "Authors": "By Adamson, M. J.",
        "Description": "When a respected Harvard professor turns up dead during a sTance led by controversial medium Sylvie Singer, Michael Merrick, an investigative reporter for a prominent Boston newspaper, is plunged into the world of the supernatural as he searches for the killer. Original.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Penguin Dictionary of American Usage and Style: A Readable Reference Book, Illuminating Thousands of Traps That Snare Writers and Speakers",
        "Authors": "By Paul W. Lovinger",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Reference",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Modern European History (Harpercollins College Outline Series)",
        "Authors": "By Barber, J. R.",
        "Description": "The Age of Modern Europe; The Industrial Revolution; The Ancien Regime and Its Critics; The Despots and the High Enlightenment; The French Revolution and the Reign of Terror; The French Revolution and the Napoleonic Empire; The Attempt to Restore the Acien Regime; The Age of European Revolution; The New Nationalism; The Industrial Nation States; The Industrializing States; The Culture of Industrial Europe; The Great War and the Russian Revolution; The Formation of the Soviet Union; The Rise of Fascism; The European Democracies; The Second World War; Cold War Europe; Eastern Europe since 1953; The Cold Wars and After; Western Europe and the European Community since the 1950's; Modern and Ultra-Modern Europe in the 1990's.Also includes Chronology of History, Maps, Charts, Tables, Full Index, and Bibliography.",
        "Category": "",
        "Publisher": "Collins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Visions of Culture: An Introduction to Anthropological Theories and Theorists",
        "Authors": "By Moore, Jerry D.",
        "Description": "An undergraduate text on anthropological theory, surveying theoretical developments in the field from the days of Tylor and Morgan through contemporary postmodernists and cultural materialists. Organized by major themes, chapters describe key ideas of 21 major theorists and assess each scholar's impact on contemporary theorizing. Includes quotes from theorists' writings. For courses in theory and history of anthropology. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Social Science , Anthropology , General",
        "Publisher": "AltaMira Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Little Bunny Gets Lost (Little Bunny Adventures Series)",
        "Authors": "By Nilsson, Ulf",
        "Description": "Little Sister Rabbit is happy to be off on an adventure without her annoying older brother until she gets lost.",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "Foreign Influence: A Thriller (9) (The Scot Harvath Series)",
        "Authors": "By Thor, Brad",
        "Description": "Homeland Security operative Scot Harvath is called to action once again in this pulse-pounding political thriller from #1 New York Times bestselling author Brad Thor.Navy SEAL turned covert operative Scot Harvath is called to action in Brad Thor’s red-hot thriller—a “must read for our times” (James Rollins). Buried within the black ops budgets of the Department of Defense, a newly created spy agency reports only to a secret panel of military insiders. Its job is to target America’s enemies—both foreign and domestic—under a charter of three simple words: Find, Fix, and Finish. When a bombing in Rome kills a group of American college students, the evidence points to a dangerous colleague from Harvath’s past. Tasked with leveraging this relationship to lure the man out of hiding, Harvath must destroy him. But what if it is the wrong man? In Chicago, a young woman is struck by a taxi in a hit-and-run, and the family’s attorney uncovers a shocking connection to the Rome bombing. Harvath must link together the disparate violence and race to prevent one of the most audacious and unthinkable acts of war in the history of mankind.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "Miracles: Healing for a Broken World",
        "Authors": "By Starzynski, Stefan and Grzasko, Chris (CON)",
        "Description": "",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Our Sunday Visitor",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Silent Mercy",
        "Authors": "By Fairstein, Linda A.",
        "Description": "Watch a video                  In the latest thriller in Linda Fairstein's bestselling series, Alex Cooper dives deep into the byzantine, sinister world of New York City's powerful religious institutions.  It's the middle of the night. Prosecutor Alexandra Cooper is called to Harlem's Mount Neboh Baptist Church, a beautiful house of worship originally built as a synagogue. But the crowd gathered there isn't interested in architecture, or even prayer. They've come for the same reason Alex has: to find out why the body of a young woman has been decapitated, set on fire, and left burning on the church steps. The only identifiable artifact on the charred remains is the imprint of a Star of David necklace seared into the victim's flesh. Alex wonders if the fire was meant to destroy this woman's body, or to draw attention to it. Her fears are confirmed days later, when a second corpse is found at a cathedral in Little Italy. The killings look like serial hate crimes, but the apparent differences in the victims' beliefs seem to eliminate a religious motive. Convinced that another young woman is bound to die, Alex mines the depths of Manhattan's many houses of worship to find a connection between the victims-and in the process uncovers a terrible and perilous truth that takes her far beyond the scope of her investigation, and directly into the path of terrible danger.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "The Heart and the Fist: The education of a humanitarian, the making of a Navy SEAL",
        "Authors": "By Greitens, Eric",
        "Description": "THE HEART AND THE FIST shares one man’s story of extraordinary leadership and service as both a humanitarian and a warrior. In a life lived at the raw edges of the human experience, Greitens has seen what can be accomplished when compassion and courage come together in meaningful service.As a Rhodes Scholar and Navy SEAL, Greitens worked alongside volunteers who taught art to street children in Bolivia and led US Marines who hunted terrorists in Iraq. He’s learned from nuns who fed the destitute in one of Mother Teresa’s homes for the dying in India, from aid workers who healed orphaned children in Rwanda, and from Navy SEALs who fought in Afghanistan. He excelled at the hardest military training in the world, and today he works with severely wounded and disabled veterans who are rebuilding their lives as community leaders at home.Greitens offers each of us a new way of thinking about living a meaningful life. We learn that to win any war, even those we wage against ourselves; to create and obtain lasting peace; to save a life; and even, simply to live with purpose requires us—every one of us—to be both good and strong.",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2011"
        }
    },
    {
        "Title": "Kiss at Your Own Risk",
        "Authors": "By Rowe, Stephanie",
        "Description": "He needed a killer woman... Blaine Underhill is one lucky man after having recently escaped a century and a half of imprisonment at the hands of an evil witch. Now he's determined to save his still-enslaved friend, but in order to do so, he'll need the help of one of the world's most lethal women. She was drop dead gorgeous, literally... Trinity Harpswell is sick and tired of being a Black Widow. Having managed to go three years without accidentally killing anyone she loves, she's one short week away from freeing herself from this killer curse forever. When Blaine tracks her down and convinces her to help him, little does Trinity know that the next seven days are going to be murder! Praise for Stephanie Rowe's paranormal Romances: \"A hilarious underworld romp filled with mayhem, sass, and romance to die for.\" -Katie MacAlister, New York Times bestselling author of Love in the Time of Dragons \"Snappy patter, goofy good humor, and enormous imagination... [a] genre-twister that will make readers... rabid for more.\" -Publishers Weekly",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Sourcebooks Casablanca",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "The Boy of Chancellorville and Other Civil War Stories",
        "Authors": "By Marten, James Alan",
        "Description": "The Boy of Chancellorville and Other Civil War Stories is an unforgettable collection of stories for and about children during the Civil War, with contributions from American luminaries such as Louisa May Alcott, Ambrose Bierce, Paul Laurence Dunbar, and Walt Whitman. The book reveals that the war affected the lives of children differently than their mothers and fathers: some looked at it as a grand adventure and for others it was a puzzling, premature end to childhood. James Marten includes accounts from nearly every viewpoint-boys and girls, Northerners and Southerners, blacks and whites-and various situations, ranging from life on the home front to confronting enemy soldiers to the aftermath of the war. Each story begins with a short introduction to place it in its literary context and explains the author's connection to the war.",
        "Category": " Juvenile Fiction , Historical , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "The How of WOW: A Guide to Giving a Speech That Will Positively Blow 'Em Away",
        "Authors": "By Carlson, Tony",
        "Description": "If you want your speeches to really resonate and shine among the countless yawn-inducing presentations heard (and immediately forgotten) every day, this book gives you a treasure trove of proven ideas and techniques for: getting attention, empathy, and respect from your audience; identifying and avoiding correcting common speech-killing mistakes; developing a bigger and better stage presence; and more. With The How of Wow, you'll make it through the speech process brilliantly, and your message will be heard - and, better yet, remembered, long after your speech is over.",
        "Category": " Business & Economics , Business Communication , General",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Stop Treating Me Like a Kid: Everyday Parenting: The 10- to 13-Year-Old",
        "Authors": "By Goldstein, Robin and Gallant, Janet",
        "Description": "Offers solutions to common problems, including listening, respectfulness, privacy, divorce, puberty, clothing styles, allowances, manners, room cleaning, peer influence, discipline, and profanity",
        "Category": " Family & Relationships , General",
        "Publisher": "Penguin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Rudolph, the Red-Nosed Reindeer (Rudolph the Red-Nosed Reindeer) (Pictureback(R))",
        "Authors": "By Shealy, Dennis R. and Karl, Linda (ILT)",
        "Description": "POOR RUDOLPH! All the other reindeer make fun of his bright red nose! Find out how this misfit saves Christmas and becomes the most famous reindeer in history in this cheery retelling of the TV classic.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Essence Of Leadership",
        "Authors": "By Anderson, Mac",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "The Gestapo: A History of Horror",
        "Authors": "By Jacques Delarue",
        "Description": "",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Papier-Mache for Kids",
        "Authors": "By McGraw, Sheila",
        "Description": "Step-by-step, easy instructions show how to make pigs, cats, masks, monsters and more. Eight great projects in all! Everyone has the basic ingredients for papier-mâché around the house - newspaper, flour and water - and everyone can do this creative, satisfying craft that allows you to build big, small, crazy and decorative sculpture.    More than 150 color pictures guide you through the steps and show lots of variations on the results. Try it - it's fun!",
        "Category": " Juvenile Nonfiction , Crafts & Hobbies",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Toward a psychology of being (An Insight book)",
        "Authors": "By Maslow, Abraham H",
        "Description": "",
        "Category": "",
        "Publisher": "Van Nostrand",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "The Wild Within, Adventures in Nature and Animal Teachings",
        "Authors": "By Paul Rezendes",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Putnam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Sisters (Charming Petites)",
        "Authors": "By Miniature Book Collection (Library of Congress) (COR), Gandolfi, Claudine (EDT), and Barnwell, Katherine (ILT)",
        "Description": "",
        "Category": " Family & Relationships , Siblings",
        "Publisher": "Peter Pauper Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "The Joy of Being Human: Reflections for Every Day of the Year",
        "Authors": "By Kennedy, Eugene C",
        "Description": "Covers familiar human and spiritual themes to make the reader aware of simple joys and everyday pleasures",
        "Category": " Religion , General",
        "Publisher": "Image Books (Doubleday)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1976"
        }
    },
    {
        "Title": "Use of interpretation in treatment;: Technique and art",
        "Authors": "By Hammer, Emanuel F",
        "Description": "",
        "Category": "",
        "Publisher": "Grune & Stratton",
        "Price Starting With ($)": "17.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Wicked Lies",
        "Authors": "By Jackson, Lisa and Bush, Nancy",
        "Description": "If At First You Don't SucceedFor two years, Justice Turnbull has paced his room at Halo Valley Security Hospital, planning to escape. Justice has a mission-one that began with a vicious murder two decades ago. And there are so many others who must be sent back to the hell that spawned them.  .  .Kill.  .  .Laura Adderley didn't plan to get pregnant by her soon-to-be ex-husband, though she'll do anything to protect her baby. But now reporter Harrison Frost is asking questions about the mysterious group of women who live at Siren Song lodge. Harrison hasn't figured out Laura's connection to the story yet. But Justice knows. And he is coming.  .  .Then Kill Again.  .  .All her life, Laura has been able to sense approaching evil. But that won't stop a psychopath bent on destroying her. Justice has been unleashed, and this time, there will be no place safe to hide.  .  .Praise for Wicked Game\"Chilling.  .  . Swift pacing and an intriguing plot make this a first-rate supernatural thriller.\" --Publishers Weekly (starred review)",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2011"
        }
    },
    {
        "Title": "The Best Pet Name Book Ever",
        "Authors": "By Eldridge, Wayne Bryant",
        "Description": "",
        "Category": "",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Our Covenant with God",
        "Authors": "By Copeland, Kenneth",
        "Description": "",
        "Category": "",
        "Publisher": "Kenneth Copeland Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Hot Hand: Mike Lupica's Comeback Kids (Comeback Kids Series)",
        "Authors": "By Lupica, Mike",
        "Description": "#1 New York Times bestseller Mike Lupica scores from downtown with his Comeback Kids series for young middle-grade readers.It's simple. All Billy Raynor wants to do is shoot. After all, he is one of the best shooters in the league. But with his dad as his coach, and his parents newly separated, somehow everything's become complicated. His brother Ben, the piano prodigy, hardly talks anymore. His mom is always traveling on business. And his dad is always on his case about not being a team player. But when Ben's piano recital falls on the same day as the championship game, it is Billy who teaches his dad the true meaning of being a team player.Praise for the Comeback Kids:Lupica portrays the action clearly and vividly, with a real sense of the excitement and unpredictable nature of the games. These are worthy additions to collections seeking to draw in middle-grade boys with an enthusiasm for athletics.”School Library JournalThese should score big with middle-graders looking for alternatives to Matt Christopher's titles.”Publisher’s Weekly This title is a good choice for reluctant readers with a background in baseball.”School Library Journal",
        "Category": " Juvenile Fiction , Family , Marriage & Divorce",
        "Publisher": "Philomel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Wealthy and Wise: How You and America Can Get the Most Out of Your Giving",
        "Authors": "By Rosenberg, Claude, Jr.",
        "Description": "Philanthropy from the private sector is rapidly becoming the most practical source of long-term change in America - and in Wealthy and Wise, Claude Rosenberg explains why charitable giving is not only a sensible solution to today's most pressing problems but a sound personal investment as well. At last, here is a guide that revolutionizes the way we think about giving - and tells us in clear, no-nonsense language how to get the most out of our donation dollars.Expertly reasoned and meticulously researched, Wealthy and Wise shows us how we can convert tax-deductible contributions to great reward at little or no personal risk. Rosenberg provides a detailed plan for transforming our troubled communities and improving our lives, and the lives of all Americans, by learning simple strategies for more effective giving. In addition to teaching people of all tax brackets how to cultivate constructive financial habits, this innovative guide will tell you everything you need to know to turn your philanthropic contributions into the soundest investments of all, including: how to calculate what you can realistically afford to give, and where to consider giving it; how to contribute most effectively within your own area of interest, and how to assess where your money is going; how to promote leadership locally; how to estimate your needs over short and long periods of time; how to plan bequests to your children and to charities; how to stop depriving yourself, and allay anxieties over dipping into capital, by learning a new definition of surplus money; how to diversify assets to protect financial investments; how to establish cushions against unforeseen financial problems; and how to plot your own lifelong financial statement and chart goals for personal wealth and intelligent gifting.Wealthy and Wise offers a realistic model for people to use when considering their financial wherewithal, whether for better living for themselves or for enhanced giving to society. Here, truly, is a book for our times, a practical, principled guide to responsible giving that no investor will want to be without.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "God's Hall of Fame (Valuebooks)",
        "Authors": "By Barbour Books Staff",
        "Description": "",
        "Category": "",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Pleasures of the Night (Dream Guardians, Book 1)",
        "Authors": "By Day, Sylvia",
        "Description": "There are sensuous pleasures that can only be tasted in the night . . . He comes to her in the twilight between sleep and consciousness to fulfill her secret desires. Lyssa Bates has never experienced such ecstasy, brought to her by a man whose deep, soul-penetrating blue eyes hold the promise of tempting intimacies and decadent pleasures. But this stranger, this lover, this immortal seducer is only a dream—a phantom of her nocturnal fantasies—until he appears, inexplicably, at her door in the flesh! Lyssa aches for the reality of him, but there is grave danger in surrender. Because Captain Aidan Cross is on a mission, and the passion that consumes them both, body and soul, could have dire consequences in a world of dreams . . . and in the waking one as well.",
        "Category": " Fiction , Erotica , General",
        "Publisher": "Avon Red",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "JavaScript Pocket Reference",
        "Authors": "By Flanagan, David",
        "Description": "JavaScript is a powerful, object-based scripting language that can be embedded directly in HTML pages. It allows you to create dynamic, interactive Web-based applications that run completely within a Web browser -- JavaScript is the language of choice for developing Dynamic HTML (DHTML) content. JavaScript can be integrated effectively with CGI and Java to produce sophisticated Web applications, although, in many cases, JavaScript eliminates the need for complex CGI scripts and Java applets altogether.The JavaScript Pocket Reference is a companion volume to JavaScript:  The Definitive Guide. This small book, covering JavaScript 1.2,  is a handy reference guide to this popular language for Web development. It provides a complete overview of the core JavaScript language and contains summaries of both core and client-side objects, methods, and properties.",
        "Category": " Computers , Programming Languages , JavaScript",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "CSS Pocket Reference",
        "Authors": "By Meyer, Eric A. and Lejeune, Lorrie (EDT)",
        "Description": "CSS (Cascading Style Sheets) is the W3C-approved method for enriching the visual presentation of web pages. CSS allows web pages to become more structural, and at the same time promises that they can have a more sophisticated look than ever before. With good implementations in Internet Explorer 5.0 and Opera 3.6, and 100% CSS1 support expected in Netscapes's Mozilla browser, signs are that CSS is rapidly becoming a useful, reliable, and powerful tool for web authors.The CSS Pocket Reference  briefly introduces CSS and then lists all CSS1 properties, plus the CSS1 pseudo-elements and pseudo-classes. Since browser incompatibility is the biggest obstacle to CSS adoption, we've also included a comprehensive guide to how the browsers have implemented support for CSS1. For anyone who wants to correctly implement CSS, this is a handy condensed reference to all the details in the larger volume, Cascading Style Sheets: The Definitive Guide.",
        "Category": " Computers , Web , Design",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "The Tragedy of Richard III",
        "Authors": "By Shakespeare, William",
        "Description": "",
        "Category": " Drama , Shakespeare",
        "Publisher": "Pocket Books (Mm)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1983"
        }
    },
    {
        "Title": "The Age of Ideology (The Mentor Philosophers)",
        "Authors": "By Aiken, Henry D.",
        "Description": "",
        "Category": "",
        "Publisher": "Mentor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "Navigating Through Change",
        "Authors": "By Woodward, Harry, Ph.D. and Woodward, Mary Beckman",
        "Description": "Navigating through Change is one of the few books that addresses both the operational and the human needs of an organization undergoing change. On the operational level, author Harry Woodward offers a complete strategic planner for setting goals - and meeting them - within a chaotic change environment.On the human side, he outlines the specific skills and sensitivity needed to gain the trust of employees, encourage innovation and teamwork, and replace uncertainty with motivation.Navigating through Change is based on the author's 15 years of experience in a variety of change environments, where he observed first-hand the management skills that facilitate a successful change.Navigating through Change is an important handbook for managers, human resource professionals, trainers, and others who must balance organizational needs, employee needs, and their own needs in the face of dramatic change.",
        "Category": " Business & Economics , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.3",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Fault Lines: A Novel",
        "Authors": "By Siddons, Anne Rivers",
        "Description": "“A literary meteor shower....One great read.” —Detroit News A classic from New York Times bestselling author Anne Rivers Siddons, Fault Lines is the powerful and deeply moving story of three women on a life-changing road trip up the California coast. Pat Conroy (The Prince of Tides) says that Siddons, “ranks among the best of us and delivers the goods—the whole fabulous package—with every book she writes.” Fault Lines is one of her finest, a truly stunning read from a novelist acclaimed for her wondrous array of literary masterworks—from Sweetwater Creek to Up Island through Low Country and Nora Nora.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Passion For Piano",
        "Authors": "By Judith Oringer",
        "Description": "",
        "Category": "",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "6.2",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Fireflies and Headwinds",
        "Authors": "By Dodd, Chuck",
        "Description": "",
        "Category": "",
        "Publisher": "Limelight Publishing Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "CrazyBusy: Overstretched, Overbooked, and About to Snap! Strategies for Handling Your Fast-Paced Life",
        "Authors": "By Hallowell, Edward M.",
        "Description": "Look at what's happened to the usual how-are-you exchange.  It used to go like this: \"How are you?\"  \"Fine.\"  Now it often goes like this: \"How are you?\" \"Busy.\"  Or \"Too busy.\"  Or simply \"Crazy.\"Without intending for it to happen or knowing how, when, or why it got started, many people now find that they live in a rush they never wanted.  If you feel busier than you've ever been and wonder how this happened and how you can keep up the pace much longer, you are hardly alone.  Crazy? Maybe not. Dysfunctional? Yes, indeed. We all have more to do than ever before -- and less time to do it. In this highly listenable audiobook, the foremost expert on ADD, Ned Hallowell, explores the society-wide phenomenon of culturally induced ADD.  Being busy may very well keep you from doing what matters most, or it may lead you to do things you deem unwise (like getting angry, for example). Being busy is a problem for almost all of us.  This audiobook is about both the opportunity and the problem -- where this peculiar life comes from and how to turn it to your advantage. Offering solutions to this difficult, complex problem that might work for you, most importantly, Crazybusy may prompt you to create solutions of your own.",
        "Category": " Psychology , Applied Psychology",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "King Lear (Everyman Shakespeare)",
        "Authors": "By Shakespeare, William and Andrews, John F. (EDT)",
        "Description": "",
        "Category": " Drama , Shakespeare",
        "Publisher": "Orion Publishing Group, Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "The Transformation of Bartholomew Fortuno: A Novel",
        "Authors": "By Bryson, Ellen",
        "Description": "Water for Elephants meets Geek Love in this riveting first novel, an enchanting love story set in P. T. Barnum's American Museum in 1865 New York CityBartholomew Fortuno, the World's Thinnest Man, believes that his unusual body is a gift. Hired by none other than P. T. Barnum to work at his spectacular American Museum—a modern marvel of macabre displays, breathtaking theatrical performances, and live shows by Barnum's cast of freaks and oddities—Fortuno has reached the pinnacle of his career. But after a decade of constant work, he finds his sense of self, and his contentment within the walls of the museum, flagging. When a carriage pulls up outside the museum in the dead of night, bearing Barnum and a mysterious veiled woman—rumored to be a new performer—Fortuno's curiosity is piqued. And when Barnum asks Fortuno to follow her and report back on her whereabouts, his world is turned upside down. Why is Barnum so obsessed with this woman? Who is she, really? And why has she taken such a hold on the hearts of those around her? Set in the New York of 1865, a time when carriages rattled down cobblestone streets, raucous bordellos near the docks thrived, and the country was mourning the death of President Lincoln, The Transformation of Bartholomew Fortuno is a moving novel about human appetites and longings. With pitch-perfect prose, Ellen Bryson explores what it means to be profoundly unique—and how the power of love can transcend even the greatest divisions.",
        "Category": " Fiction , Literary",
        "Publisher": "Henry Holt and Co.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "The Gammage Cup: A Novel of the Minnipins",
        "Authors": "By Enright, Elizabeth, Kendall, Carol, and Blegvad, Erik (ILT)",
        "Description": "Carol Kendall's witty, epic tales about the race of people called the Minnipins are now available as Odyssey/Harcourt Young Classics. Now a new generation of readers can thrill to the adventures of the tiny folk who become mighty heroes. The original interior illustrations by Erik Blegvad and Imero Gobbato have been retained, but vibrant new cover art by beloved illustrators Tim and Greg Hildebrandt gives the books a new look for a new audience.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "U Chic: The College Girl's Guide to Everything",
        "Authors": "By Garton, Christie",
        "Description": "The Complete Guide to a Fabulous College Life!From the day you set foot on campus until the day you wear a cap and gown, get advice from a source you can trust: the expert team of all-star college students and recent grads behindU Chic. This indispensible college resource has everything you need to know, including:Getting Started: First week advice and tuning out the homesick bluesSharing Space: A fashionista's tips for fitting it all in Healthy and Happy: Common campus ailments, staying fit on dorm food, and Sex Ed 101Sorority Chic: The ins and outs of going Greek Love Life: Love vs. hookups and surviving long-distance relationshipsHead of the Class: Picking the right major, getting ready for finals, and studying tips and tricksPRAISE FOR U CHIC \"Get ready to be empowered. This isn't just a manual to college, but to life!\"Stephanie Elizondo Griest | Author of 100 Places Every Woman Should Go\"Lots of clever strategies on how to have a fabulous time at college, combined with wise advice on how to avoid all-too-common mistakes.A great resource for anyone who wants to be a chic college coed.\"Kim Clark | Senior Writer, U.S.News & World Report\"Full of fun, sassy advice on how to make the most of a great time of life, U Chic makes me yearn for my college days!\"Marcy McGinnis | Associate Dean, School of Journalism, Stony Brook University\"From the sisterhood of girlfriends who've been there, U Chic answers everything a college girl really wants to know.\"Tracey Wong Briggs | Former coordinator of USA TODAY's All-USA Academic and Teacher Teams",
        "Category": " Study Aids , College Guides",
        "Publisher": "Sourcebooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Death on the Mississippi (Mark Twain)",
        "Authors": "By Heck, Peter J.",
        "Description": "The irrepressible Mark Twain and his baffled new secretary, Wentworth Cabot, embark on a riverboat lecture series in the company of a New York cop and the killer the officer seeks. Reprint.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "No one's in charge anymore",
        "Authors": "By Gardner, Gerald C.",
        "Description": "",
        "Category": "",
        "Publisher": "Today Press",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "CliffsQuickReview Geometry",
        "Authors": "By Kohn, Edward",
        "Description": "Cliffs Quick Reviews are Produced by The People Who Know Student Needs and Respond to Them. This logically presented, easy-to-grasp review gives you the reference you want to effectively organize your introductory-level course work. Each Review Gives Youa concise but comprehensive source of ready information on the fundamentals of the subjectclearly arranged and accessible basic course notes in manageable units and straightforward languagepractical help in checking your understanding of material presented in your classesthe expertise of an accomplished teacher as your private tutoran excellent way to review core concepts before quizzes, midterms, and finals",
        "Category": " Mathematics , Geometry , General",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Invisible Applique",
        "Authors": "By Simms, Ami",
        "Description": "",
        "Category": " Crafts & Hobbies , Applique",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Our Friend The Sun - (Now I Know)",
        "Authors": "By Hall, Susan (ILT) and Palazzo-Craig, Janet",
        "Description": "Simple text and illustrations introduce the characteristics of the sun and its relationship to the earth.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Identidades: Exploraciones e interconexiones",
        "Authors": "By Guzman, Elizabeth, Liskin-Gasparro, Judith E., De Castells, Matilde Olivella, and Lapuerta, Paloma E.",
        "Description": "Identidades offers a content-rich communicative presentation for students entering Intermediate Spanish - meeting you where you are and moving you realistically to higher proficiency levels.   Drawing on skills students have developed in other course areas, Identidades further develops these abilities by taking a process-oriented methodology to skill building. Rich in cultural content, Identidades helps you draw parallels between your own identity and the cultural identities of the Spanish-speaking world.",
        "Category": " Foreign Language Study , Spanish",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Dark Windows",
        "Authors": "By Louis, Mary-Ben",
        "Description": "",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "8.47",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Slow Cooker Winning Recipes",
        "Authors": "By Publications International staff",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "The Rise of China (International Security Readers)",
        "Authors": "By Lynn-Jones, Sean M. (EDT), Miller, Steven E. (EDT), Brown, Michael E. (EDT), and Cote, Owen R., Jr. (EDT)",
        "Description": "Analysts debate the international implications of a newly powerful China.China's relentless economic growth in the 1980s and 1990s heralded its emergence as a great power in world politics. As its economy expanded, China seemed poised to become the second-largest economy in the world. At the same time, it modernized its military and adopted a more assertive diplomatic posture. Many observers have begun to debate the international implications of China's rise. Some analysts argue that China will inevitably pose a threat to peace and security in East Asia. A few even predict a new cold war between Beijing and Washington. Others claim that a powerful China can remain benign. None believes that China can be ignored. The essays in this volume assess China's emerging capabilities and intentions, debate the impact that China will have on security in the Asia-Pacific region, and propose polices for the United States to adopt in its relations with China.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "The MIT Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "The Age of Zeus (2) (The Pantheon Series)",
        "Authors": "By Lovegrove, James",
        "Description": "Continuation of a series that is already a best-seller with a strong alternate history setting!The Olympians appeared a decade ago, living incarnations of the Ancient Greek gods on a mission to bring permanent order and stability to the world. Resistance has proved futile, and now humankind is under the jackboot of divine oppression. Then former London police officer Sam Akehurst receives an invitation too tempting to turn down, the chance to join a small band of geurilla rebels armed with high-tech weapons and battlesuits. Calling themselves the Titans, they square off against the Olympians and their ferocious mythological monsters in a war of attrition which not all of them will survive!",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Solaris",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "The Portable Dad: Fix-It Advice for When Dad's Not Around",
        "Authors": "By Elliott, Steve",
        "Description": "For college students, twentysomethings, and anyone else who keeps Dad on speed-dial for car emergencies, plumbing woes, appliance advice, and more. Take Dad’s know-how with you everywhere you go! This Dad’s got all the answers to all the basics, so that you can get it done and move on. He knows how to hang, unclog, patch, drill, paint, mow, lube, edge, weed, sand, pack, and more.The Portable Dad is the answer to those panicked late-night phone calls: how to keep things running, how to maintain the stuff you use, how to get by without getting in over your head. If Dad doesn’t know the answer, you don’t really need to do it!",
        "Category": " House & Home , Reference",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.52",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Connecting Teachers, Students, and Standards: Strategies for Success in Diverse and Inclusive Classrooms: Strategies for Success in Diverse and Inclusive Classrooms",
        "Authors": "By Voltz, Deborah L., Sims, Michele Jean, and Nelson, Betty",
        "Description": "The authors of Connecting Teachers, Students, and Standards extend their ideas with practical strategies for teaching English language learners, students from culturally diverse backgrounds, and students with disabilities, within a framework that integrates four major instructional approaches for teaching diverse populations: multicultural education, sheltered instruction, differentiated instruction, and universal design for learning. The framework has been tested in 50 standards-based classrooms, and is composed of six elements: methods, materials, environment, content, collaboration, and assessment. Scenarios follow elementary, middle, and high school teachers. Voltz directs the Center for Urban Education and teaches at the University of Alabama. Annotation ©2010 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Education , Inclusive Education",
        "Publisher": "ASCD",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "How to Give Effective Feedback to Your Students",
        "Authors": "By Brookhart, Susan M.",
        "Description": "Done well, feedback from teachers to students addresses both cognitive and motivational factors. In this book for elementary school teachers, Brookhart, an educational consultant, categorizes important elements of feedback content (such as focus, comparison, clarity, and tone) and strategy (such as timing, mode, and audience), and offers practical suggestions for using feedback in positive ways. In addition to giving guidelines for good feedback, the author explains what kinds of feedback work best in various content areas and shows how to adjust feedback for different kinds of learners, including successful and struggling students and English language learners. Annotation ©2009 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Language Arts & Disciplines , Communication Studies",
        "Publisher": "Assn for Supervision & Curriculum",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Transforming Professional Development into Student Results",
        "Authors": "By Reeves, Douglas B.",
        "Description": "Reeves has worked with education, business, nonprofit, and government organizations throughout the world, and is the author of numerous articles and books on leadership and organizational effectiveness, including four other ASCD books. His latest text offers teachers, administrators, and policymakers suggestions for creating and sustaining professional learning programs that lead to improved student achievement. Reeves examines what is wrong with current professional development in schools, how to fix the problems, and how to use the lessons from the book to build lasting improvements for schools and educational systems. Annotation ©2011 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Education , Professional Development",
        "Publisher": "ASCD",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "USA (Lonely Planet USA)",
        "Authors": "By Lyon, James",
        "Description": "",
        "Category": " Travel , United States , General",
        "Publisher": "Lonely Planet Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Kingdom Keepers II: Disney at Dawn (Kingdom Keepers, 2)",
        "Authors": "By Pearson, Ridley",
        "Description": "It's supposed to be a happy day at the Magic Kingdom-the return of the teenaged holographic hosts. But things go very wrong when a sudden lightning storm disrupts the celebration, and Amanda's mysterious sister, Jez, disappears. The only clue is the sighting of a wild monkey in the Magic Kingdom during the storm. The mystery deepens as Finn is contacted by Wayne, an old man he hasn't heard from in months. Wayne tells Finn that there's trouble at the Animal Kingdom: the evil Overtakers have gained control of one of the computer servers that will be used to operate Daylight Holographic Imaging there. That means that if any of the holographic hosts fall asleep, they will go into comas-permanently. Filled with action and brimming with the same meticulous detail as The Kingdom Keepers: Disney After Dark, this second book in the series-The Rise of Chernabog-is the result of hands-on research behind the scenes at Disney's Animal Kingdom Park. Young and older readers alike will get a glimpse into a second Disney kingdom. The wild rides have only just begun; and the clock is ticking. How long can the teens keep themselves awake in their quest to find their friend-and what happens if they fail?",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Hyperion Book CH",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Rumpole and the Reign of Terror",
        "Authors": "By Mortimer, John",
        "Description": "John Mortimer's bestselling barrister is back, in his most timely case yet  Just in case Rumpole and the Penge Bungalow Murders gave fans the impression that the Great Defender was resting on his laurels, his new case sends him at full sail into our panicky new world. Rumpole is asked to defend a Pakistani doctor who has been imprisoned without charge or trial on suspicion of aiding Al Qaeda. Meanwhile, on the home front, She Who Must Be Obeyed is threatening to share her intimate view of her husband in a tell-all memoir. The result is Rumpole at his most ironic and indomitable, and John Mortimer at his most entertaining.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Hunger for the Word: Lectionary Reflections on Food and Justice - Year A",
        "Authors": "By Hollar, Larry (EDT)",
        "Description": "We have all experienced hunger, whether it’s a need for spiritual guidance or physical nutrition. Our hunger for God’s Word can benefit those needing material sustenance. God’s Word calls us to nourish the hungry and poor, just as it nourishes our faith and sustains us in our struggle for justice.Hunger for the Word explores the Lectionary with a focus on anti-hunger advocacy, social activism, and political issues affecting marginalized people. Using insights, images, and stories from pastors, professors, and laity active in anti-hunger campaigns, this ecumenical book offers devotional connections to inequality issues, as well as themes to help in our struggle to understand and eliminate injustice. Hunger for the Word, edited by Larry Hollar of Bread for the World, brings concern for hunger and fairness into our daily religious life.With weekly sermon/homily reflections, Hunger for the Word is an invaluable resource for pastors, liturgical ministers, and those interested in justice-oriented Bible study and spiritual growth. Also includes suggestions for musical worship, and ideas for children’s sermons to help spread God’s Word of activism, compassion, and integrity throughout the congregation.",
        "Category": " Religion , Biblical Meditations , General",
        "Publisher": "Liturgical Press",
        "Price Starting With ($)": "12.11",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Curb Appeal Idea Book (Taunton Home Idea Books)",
        "Authors": "By Polson, Mary Ellen",
        "Description": "Spruce up the front of your home and create a good first impression with the inspiration in Curb Appeal Idea Book. Inside you'll find hundreds of ideas and tips for all areas of the front of the house, from the curb to the front door and every space in between. Whether your home is small or large, in the city or suburbs, look inside for creative ways to make your home look great.",
        "Category": " House & Home , Outdoor & Recreational Areas",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "New Moon (Twilight)",
        "Authors": "By Meyer, Stephenie",
        "Description": "The movie tie-in edition of the #1 bestselling trade paperback includes a collectible full-color, fold-out poster with photos of the movie cast on both sides.In New Moon, Stephenie Meyer delivers another irresistible combination of romance and suspense with a supernatural twist. The \"star-crossed\" lovers theme continues as Bella and Edward find themselves facing new obstacles, including a devastating separation, the mysterious appearance of dangerous wolves roaming the forest in Forks, a terrifying threat of revenge from a female vampire and a deliciously sinister encounter with Italy's reigning royal family of vampires, the Volturi. Passionate, riveting, and full of surprising twists and turns, this vampire love saga captures the struggle between defying our instincts and satisfying our desires. This is a love story with bite.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Just Like Mike",
        "Authors": "By Herman, Gail and Treatner, Meryle (ILT)",
        "Description": "When Michael Brown’s mom marries Mr. Jordan, everything changes. Now Michael’s got a new dad, a new house, a new school, and worst of all, a new name. Michael is nothing like the famous athlete. In fact, he can’t even dribble a basketball, let alone swoosh it through the hoop! How can he survive the rest of the year–the rest of his life, really–as Michael Jordan?",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Bridge at Dong Ha (Bluejacket Books)",
        "Authors": "By Miller, John Grider",
        "Description": "This is the true story of the legendary Vietnam War hero John Ripley, who braved intense enemy fire to destroy a strategic bridge and stall a major North Vietnamese invasion into the South in April 1972. Told by a fellow Marine, the account lays bare Ripley's innermost thoughts as he rigged 500 pounds of explosives by hand-walking the beams beneath the bridge, crimped detonators with his teeth, and raced the burning fuses back to shore, thus saving his comrades from certain death.First published in 1989, the book has broad appeal as a riveting tale of adventure. But John Miller has taken this daring act of heroism beyond the specifics of time and place to provide new insights into the nature of war and warriors, characteristics that have remained unchanged for centuries and will remain valid for generations to come. It has been on the Marine Corps Commandant's recommended reading list since 1990. Newly illustrated by Col. Charles Waterhouse, USMCR (Ret.).",
        "Category": " History , Military , Naval",
        "Publisher": "Naval Institute Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Layers: Uncovering and Celebrating God's Original Idea of You",
        "Authors": "By Patty, Sandi",
        "Description": "A look through life's failures and fears to find the real woman God intended you to be.On athletic fields children wear safety equpment to keep them from getting hurt. In battle soldiers wear body armor to protect them. But when we're safe and secure with our friends and families, we should not need protective layers. Yet many of us wear them . . . protective emotional and behavioral layers that we use to shield us from life's heart hurts.Those layers are different for each of us: anger, shame, guilt, perfectionism, withdrawal, overeating, addiction, or other compulsive behaviors. Sometimes they even start out as something good?laughing through our tears and masking our real feelings to get through public situations.But when they stay too long, those protective layers get firmly attached, eventually imprisoning us and preventing us from being the cherished creations God intended us to be.In Layers, acclaimed recording artist Sandi Patty invites you to join her in a journey of self-discovery, peeling back the layers of her life and yours to celebrate the real you God created you to be.",
        "Category": " Religion , Christian Life , Women's Issues",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Hill Towns of Italy",
        "Authors": "By Field, Carol and Kauffman, Richard (ILT)",
        "Description": "Traces the history of the ancient hillside towns of Tuscany and Umbria, including Siena, Assisi, and Spoleto and shows the churches, palaces, abbeys, and countryside of the region",
        "Category": "",
        "Publisher": "Plume",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Keep The Faith, Change The Church: The Battle By Catholics For The Soul Of Their Church",
        "Authors": "By Kenney, Charles and Muller, James E.",
        "Description": "A Defining Moment in the Life of the ChurchEven before the terrible revelations of sexual misconduct and the cover-up that allowed such atrocities to continue happening, the Catholic Church was in trouble. With a devout but aging congregation giving way to a generation of so-called lapsed Catholics, the spiritual vitality and significance of the church had seemed, in the context of modern American society, to be ebbing away. Then when the scandal hit, even true believers were pitched into an all-out crisis of faith.It was at this low point that a fiercely committed group of Catholics emphatically said, Enough! This book tells their inspiring story, the story of Voice of the Faithful, a grassroots organization formed to give the laity a voice in making their church a more effective spiritual and social force. The group came to realize that the underlying cause of the cover-ups and the failure of the church to adopt many needed changes is the abuse by some in the hierarchy of the excessive power they hold.For too long, average Catholics have been disenfranchised. Now, with the growing success of Voice of the Faithful, there is finally a legitimate forum for the laity. As James E. Muller and Charles Kenney show in this urgent call to action, history is on the side of those who would stand up and be heard.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Emlyn's Moon (The Magician Trilogy #2)",
        "Authors": "By Nimmo, Jenny",
        "Description": "Gwyn and his magical Snow Spider return for another enchanting adventure in book two of Jenny Nimmo's Magician Trilogy!Young magician Gywn and his friend Nia have been warned to stay away from Emlyn Llewelyn, the strange boy who claims his mother lives on the moon. And yet, a mysterious magic continues to draw them to him. But why?It's up to Gwyn and Nia to solve the mystery, with the help of Arianwen, the Snow Spider. Readers will race along with Gwyn in this fantastic magical adventure to rescue Emlyn and his family before it's too late!",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Orchard Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Link to the Past: Colonial Williamsburg's Animals",
        "Authors": "By Doody, David M. (PHT) and Hunter, John P.",
        "Description": "",
        "Category": " History , United States , Colonial Period (1600-1775)",
        "Publisher": "COLONIAL WILLIAMSBURG FOUNDATION",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "A World Without Islam",
        "Authors": "By Fuller, Graham E.",
        "Description": "\"Another must-read by one of the most thought-provoking writers on Islam and the Middle East. At once a brilliant history lesson and a fascinating thought experiment, A World Without Islam is sure to challenge the simplistic view held by so many in the West that Islam is the source of the conflicts we are witnessing in the Middle East.\"---Reza Aselan, Author of No God Bgt God and Beyond Egndamentalism\"A must-read. Graham Fuller's A World Without Islam is a tour de force by one of the foremost authorities on global Muslim politics. Fuller's masterful study provides an insightful and at times provocative analysis of the character of Muslim-West relations from the rise of Islam, addressing major issues from the clash of civilizations and the roots of terrorism to the significance of the Palestinian-Israeli conflict and U.S. foreign policy.\"---John L. Esposito, Professor of Religion and International Affairs, Georgetown University, and Author of the Future of Islam and Who Speaks for Islam?\"A cogent argument demonstrating that a knowledgeable awareness of the rich dynamics that drive societies will better help diffuse tensions.\"---Kirkus ReviewsIn A World Without Islam, Graham E. Fuller, a professor and former vice chairman of the National Intelligence Council at the CIA, guides us on an illuminating journey through history, geopolitics, and religion to investigate whether there is something unique in Islam that breeds violence and conflict. Taking us from the rise of Muhammad to the collapse of the Ottoman Empire to the present day, Fuller analyzes the roots of terrorism, the conflicts in Israel and Chechnya, and the role of Islam in supporting and energizing the anti-imperial struggle.Filled with fascinating details and counterintuitive conclusions, A World Without Islam is essential reading for anyone who cares about the future of the Middle East. It is certain to inspire debate and reshape the way we think about America's relationship with the Muslim world\"After September 11, 2001, the discussion around Islam has often been shrill and usually sterile. That is why Graham Fuller's measured, scholarly, and eminently sensible voice needs to be heard.\"---Akbar S. Ahmed, IBN Khaldun Chair of Islamic Studies, American University, Washington, D.C., And Author of Islam Today: A Short Introduction To the Muslim World",
        "Category": " Religion , Islam , History",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Dreaming in English",
        "Authors": "By Fitzgerald, Laura",
        "Description": "A captivating sequel to the national bestselling novel Veil of Roses.  Knowing she could never be happy in Iran, Tamila Soroush took her mother's advice to \"Go and wake up your luck\" and joined her sister in the United States. Now, after a spur-of-the-moment exchange of \"I do\"s with her true love, Ike Hanson, Tami is eager to start her new life. But not everyone is pleased with their marriage, and Tami's happily- ever-after is no sure thing. With an interview with Immigration looming, Tami wonders if she's got the right stuff when it comes to love, American-style. Maybe her luck is running out. Or maybe she'll stand up for herself and claim her American dream.",
        "Category": " Fiction , Cultural Heritage",
        "Publisher": "NAL",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    }
]