[
    {
        "Title": "Make Peace With Anyone: Breakthrough Strategies to Quickly End Any Conflict, Feud, or Estrangement",
        "Authors": "By Lieberman, David J., Ph.D.",
        "Description": "Make Peace with Anyone is the first book that shows readers how to quickly resolve any situation, no matter how long it's been going on, or how many people are involved. The techniques and psychological strategies presented here are simple, easy to understand, and work...fast. In this book readers will learn how to:*End any family feud*Get an apology from anyone*Jumpstart any relationship or friendship*Handle any passive-aggressive person*Get the respect you deserve from anyone*Dramatically improve any relationship*Get anyone to forgive you for anything*Align anyone to your way of thinkingDr. David Lieberman provides the path to permanent peace and will show you the way to Make Peace with Anyone.",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Creative Aggression: The Art of Assertive Living",
        "Authors": "By George R. Bach, Herb Goldberg",
        "Description": "",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Haunted Castle on Hallow's Eve (Magic Tree House, 30)",
        "Authors": "By Murdocca, Sal (ILT) and Osborne, Mary Pope",
        "Description": "The intrepid Jack and Annie are summoned once again to the fantasy realm of Camelot. There, Merlin the Magician tells them that the Stone of Destiny has been stolen. The answer to its disappearance lies within a haunted castle. With a young magician named Teddy, Jack and Annie take on the challenge in an adventure that takes them to new heights and places they couldn’t even imagine!a Stepping Stone Book™",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Mars and Venus Starting Over: A Practical Guide for Finding Love Again after a Painful Breakup, Divorce, or the Loss of a Loved One",
        "Authors": "By Gray, John",
        "Description": "Is it possible to find love again after a breakup, death, or divorce?The end of a relationship can sometimes feel like the end of the world. Devastation, loneliness, and bitterness are some emotions that exist due to a breakup, divorce, or the loss of a loved one. But with the help of this compassionate guide, Dr. John Gray expresses that you will survive and tells you how to find love again.While the process of healing is similar with both sexes, there are distinct differences between the ways men and women heal their bruised hearts. In Mars and Venus Starting Over, Dr. Gray offers gender-specific advice on how to:Deal with painFind forgivenessDiscover the strength to let goRebuild confidenceRise to the challenge of finding fulfillment againFilled with gentle guidance, healing practices, and compassionate wisdom, Mars and Venus Starting Over will help men and women explore the meaning of loss, find their way through the healing process, and discover the secret to moving on.",
        "Category": " Self-help , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Busybody Nora (Riverside Kids) (Riverside Kids (Paperback))",
        "Authors": "By Hurwitz, Johanna and Tilley, Debbie (ILT)",
        "Description": "\"What is your name?\"That's what Nora asks her neighbors as she rides up and down the elevator of her apartment house. She doesn't mean to be a busybody. She just wants to be like doorman Henry and know all the people in her building--all 200 of them! And then one day Nora gets a great idea: they'll have a giant party, for everyone in the building!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Man Who Mistook his Wife for a Hat and other Clinical Tales",
        "Authors": "By Sacks, Oliver W.",
        "Description": "Presents a series of stories about men and women who, representing both medical and literary oddities, raise fundamental questions about the nature of reality",
        "Category": " Psychology , Neuropsychology",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Down to Earth Sociology: Introductory Readings, Eleventh Edition",
        "Authors": "By Henslin, James M. (EDT)",
        "Description": "For more than twenty years, and through ten editions, James Henslin's Down to Earth Sociology has opened new windows onto the social realities that shape our world. Now in its eleventh edition, the most popular anthology in all of sociology includes new articles on our changing world while also retaining its classic, must-read essays. Focusing on social interaction in everyday life, the forty-five selections bring students face-to-face with the twin projects of contemporary sociology: understanding the individual's experience of society and analyzing social structure.  The eleventh edition's exceptional new readings include selections on social inequality and class relations in the United States, the development of racial awareness and identity, the subtleties of gender differences, the implicit rules people use to make their decisions, and the structural features of society that make drug dealing a regular part of inner-city life. Together with these essential new articles, the selections by Peter Berger, Kai Erikson, Herbert Gans, Erving Goffman, Arlie Hochschild, Jonathan Kozol, Zella Luria, C. Wright Mills, George Ritzer, Deborah Tannen, Barrie Thorne, Philip Zimbardo, and many others provide firsthand reporting that gives the student a sense of \"being there.\" Henslin also explains basic methods of social research, providing insight into how sociologists explore the social world. The selections in Down to Earth Sociology highlight the most significant themes of contemporary sociology, ranging from the sociology of gender, power, politics, sports, and religion, to the contemporary crises of racial tension, violent crime, rape, poverty, and homelessness.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Dying to Get Published (Jennifer Marsh Mysteries)",
        "Authors": "By Fitzwater, Judy",
        "Description": "INTRODUCING JENNIFER MARSHWhat does it take to get a book contract? That's the lament of every unpublished author--including aspiring murder-mystery novelist Jennifer Marsh.After submitting eight diligently crafted manuscripts to every prominent publisher in New York, Jennifer has collected enough rejection letters to wallpaper a room. But that doesn't stop her from concocting one killer of a scheme for her next novel.And suddenly Jennifer's lifelong love affair with crime fiction brings her face to face with real-life murder. . . .",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Ramona the Pest (Ramona, 2)",
        "Authors": "By Cleary, Beverly",
        "Description": "Newbery Medal-winning author Beverly Cleary expertly depicts the trials and triumphs of growing up through a relatable heroine who isn't afraid to be exactly who she is.Ramona Quimby is excited to start kindergarten. No longer does she have to watch her older sister, Beezus, ride the bus to school with all the big kids. She's finally old enough to take the bus too!Then she gets into trouble for pulling her classmate's boingy curls during recess. Even worse, her crush rejects her in front of everyone. Beezus says Ramona needs to quit being a pest, but how can she stop if she never was trying to be one in the first place?",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2020"
        }
    },
    {
        "Title": "Tourney Time: It's Awesome Baby!",
        "Authors": "By Vitale, Dick and Douchant, Mike",
        "Description": "",
        "Category": " Sports & Recreation , General",
        "Publisher": "Masters Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Totally Cool Grandparenting: A Practical Handbook of Tips, Hints, & Activities for the Modern Grandparent",
        "Authors": "By Linsley, Leslie and Aron, Jon (ILT)",
        "Description": "What Every Modern Grandparent Needs To KnowToday's grandparents continue with their careers and activities well into their grandparenting years.  Totally Cool Grandparenting explains how these modern grandmparents can participate in the traditional joyous reponsibilities of their role in up-to-date ways.  With clear, upfront advice, humor, and time-tested tactics, gathered from personal experience and dozens of interviews with grandparents--and grandkids--across the country, Linsley covers such topics as:Spoiling the grandchildren without annoying the parentsGiving gifts that the kids will likeHandling the visit, from baby-sitting to a holiday vacationTackling errands with grandkids in towCoping with modern methods of communicationTeaching, giving, and receiving respectAnd much moreThey always say children don't come with a manual, but thanks to Linsley, now grandkids do!",
        "Category": " Family & Relationships , Parenting , Grandparenting",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "The One Minute Father",
        "Authors": "By Johnson, Spencer",
        "Description": "",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Collins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Half-Moon Investigations",
        "Authors": "By Colfer, Eoin",
        "Description": "Twleve-year-old private investigator Fletcher Moon, nicknamed \"Half Moon\" because of his shortness, must track down a conspiracy or be framed for a crime he did not committ.",
        "Category": " Young Adult Fiction , Historical , Europe",
        "Publisher": "Miramax",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "The Hideout",
        "Authors": "By Kehret, Peg",
        "Description": "In a moment of madness, Jeremy Holland's parents were killed by a gunman in a Seattle mall. Now he faces a new life with his uncle Ed, a man with a vastly different lifestyle from the one Jeremy is used to.  As he sits on the train hurtling toward Chicago, he can barely believe the terrible truth. He has no mother, no father, no home. Suddenly the impossible happens -- again -- as the train crashes in a blaze of fire, twisted metal, and screaming people. Jeremy staggers off, wandering aimlessly.  He finds a deserted cabin in the woods, which seems to be just waiting for him. He thinks he can hide out and escape form the grief of his past and his future with his uncle. Instead, Jeremy faces more danger than he bargained for when he discovers evidence of bear poachers. When he hears gun shot at night, Jeremy decides to leave his refuge and put his own life at stake in a desperate race to unmask the villains and save the bears.",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Why wait?: What you need to know about the teen sexuality crisis",
        "Authors": "By McDowell, Josh",
        "Description": "",
        "Category": "",
        "Publisher": "Here's Life Publishers",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "The Culinary Arts Institute Cookbook: An Encyclopedia of Over 4400 Recipes with More Than 500 Color Photographs",
        "Authors": "By Culinary Arts Institute",
        "Description": "",
        "Category": " Cooking , Methods , General",
        "Publisher": "Advance Publishers",
        "Price Starting With ($)": "9.92",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Grown-Up Children Who Won't Grow Up",
        "Authors": "By Stockman, Larry V. and Graves, Cynthia S.",
        "Description": "Describes adults who show an adolescent dependence on their parents, and provides advice on how to help them achieve maturity",
        "Category": " Social Science , General",
        "Publisher": "Prima Lifestyles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Yes, Your Teen is Crazy!: Loving Your Kid without Losing Your Mind",
        "Authors": "By Bradley, Michael J.",
        "Description": "Now in paperback! Here is the book that updates the rulebook, giving parents the training and skills they need to transform their teenage children into strong, confident, productive adults.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Harbor Press, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Real Security (Touchstone Books (Paperback))",
        "Authors": "By Barnet, Richard J.",
        "Description": "Compares the state of the American national defense system to that of the Soviet Union, refuting the idea that it is necessary to achieve a superiority in arms and armaments",
        "Category": " Political Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1981"
        }
    },
    {
        "Title": "The Pregnancy Bible: Your Complete Guide to Pregnancy and Early Parenthood",
        "Authors": "By Stone, Joanne (EDT) and Eddleman, Keith, M.D. (EDT)",
        "Description": "An authoritative and up-to-date reference.    The Pregnancy Bible combines the knowledge and experience of medical specialists and family doctors -- all under the direction of practicing and widely published obstetricians.    It follows the complete sequence of fetal development in utero week by week. Each step is illustrated with full color photography -- many of which are life-size. Dozens of step-by-step illustrations help make the many aspects of infant care easier to master.     In-depth and highly readable information covers:  Nutrition and exercise  Cesarean section  Planning for a home birth  Options for pain relief  Prenatal and postpartum care  Coping with emotional changes  Taking            care of newborns  Preparing a safe environment at home    Quick reference gatefold spreads help keep track of important tests and check-ups for each trimester. Included is an in-depth directory of specialized tests and procedures available for both mother and child.     The Pregnancy Bible is an extensive, accessible, up-to-the-minute sourcebook of everything expecting parents need to know, combining the knowledge and experience of many medical specialists and healthcare providers.",
        "Category": " Health & Fitness , Pregnancy & Childbirth",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Active Parenting Today (For Parents of 2- to 12-year-olds)",
        "Authors": "By Popkin, Michael H.",
        "Description": "Dr. Michael Popkin, founder and president of Active Parenting Publishers and one of the nation's foremost experts on parent education, shows you how to develop courage, responsibility and self-esteem in your children.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Active Parenting Publishers, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Home Sweet Home (Disney's Winnie the Pooh; Lessons from the Hundred-Acre Wood, Book 4)",
        "Authors": "By Nancy Parent",
        "Description": "",
        "Category": "",
        "Publisher": "Advance Publishers LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "In the Absence of Power: Governing America",
        "Authors": "By Johnson, Haynes Bonner",
        "Description": "",
        "Category": "",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1980"
        }
    },
    {
        "Title": "Just Say \"Thank You\" (Disney's Winnie the Pooh)",
        "Authors": "By Berk, Sheryl",
        "Description": "",
        "Category": "",
        "Publisher": "Disney Enterprises, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Well Child Book",
        "Authors": "By Samuels, Mike and Samuels, Nancy",
        "Description": "",
        "Category": " Health & Fitness , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1983"
        }
    },
    {
        "Title": "The Book of Fondues",
        "Authors": "By Rhodes, Lorna",
        "Description": "Provides recipes for deep-fried, seafood, vegetable, fruit, and dessert fondues, describes useful equipment, and suggests menus",
        "Category": " Cooking , Reference",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Baseball: Rules of the Game",
        "Authors": "By Sakurai, Jennifer M. and Dierksen, Jane (ILT)",
        "Description": "Explains the rules for major league and Little League baseball with information on the playing field, equipment, player positions, and definitions of terms.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "The Next Four Years: A Vision of Victory",
        "Authors": "By Phillips, Howard (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Adroit Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "The Courage of Their Convictions: Sixteen Americans Who Fought Their Way to the Supreme Court",
        "Authors": "By Irons, Peter",
        "Description": "Cites sixteen landmark civil liberties cases and the individuals who challenged laws that they felt impinged upon their personal freedom and who took their battles to the nation's highest court of law.",
        "Category": " History , United States , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Baseball Hall of Shame",
        "Authors": "By Nash, Bruce",
        "Description": "A compilation of baseball's most embarrassing moments records the most outrageous blunders made by players, owners, managers, umpires, and fans",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Entrepreneur Magazine: Bringing Your Product to Market (Entrepreneur Magazine Series)",
        "Authors": "By Debelak, Don",
        "Description": "Build an empire step by stepDon't risk a small fortune trying to make a big one. Let acclaimed consultant Don Debelak show you how to get your exciting new product off the drawing board and into the marketplace—without losing your shirt! In this book, you'll learn what every inventor and entrepreneur needs to know about manufacturing techniques, product design, distribution channels, patents, licensing, and cash flow. You'll also discover how to handle some very tricky issues that are crucial to your success, including Knowing when your product is market ready Creating a step-by-step product-to-market strategy Adjusting your strategy to changing market conditions Finding financial help from investors, manufacturers, and distributors Having manufacturers pay development costs prior to licensingENTREPRENEUR Magazine is the banner publication of the Entrepreneur Magazine Group. It has the largest newsstand circulation of any business monthly with a total ABC-audited circulation of 410,000. DON DEBELAK is President of DSD Marketing, an inventor assistance firm. He has personally helped more than 100 entrepreneurs market and sell their products successfully.Also available from the Entrepreneur Magazine library: The Entrepreneur Magazine Small Business Advisor The Entrepreneur Magazine Small Business Answer Book Guide to Integrated Marketing Human Resources for Small Businesses Making Money with Your Personal Computer Small Business Legal Guide Starting a Home-Based Business Starting an Import/Export Business Successful Advertising for Small BusinessesSPECIAL OFFERS!FREE issue of Entrepreneur Magazine 50 0iscount on Entrepreneur Magazine subscription 1/2 price admission to any Entrepreneur Magazine Small Business Expo Discount on American Entrepreneurs Association membershipSee details and coupons in back of book.",
        "Category": " Business & Economics , Entrepreneurship",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Baseball Memorabilia",
        "Authors": "By Obojski, Robert",
        "Description": "Surveys the turbulent baseball memorabilia market, from baseball cards and autographed balls to press pins and World Series collectibles",
        "Category": " Antiques & Collectibles , General",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "Winnie The Pooh: I'm Really Sorry (Disney)",
        "Authors": "By Jamie Simons",
        "Description": "",
        "Category": "",
        "Publisher": "Advance Publishers, L.C.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "If You Want to Walk on Water, You've Got to Get Out of the Boat",
        "Authors": "By Ortberg, John",
        "Description": "Winner of the 2002 Christianity Today Book Award!You’re One Step Away from the Adventure of Your LifeDeep within you lies the same faith and longing that sent Peter walking across the wind-swept Sea of Galilee toward Jesus.In what ways is the Lord telling you, as he did Peter, \"Come\"?John Ortberg invites you to consider the incredible potential that awaits you outside your comfort zone. Out on the risky waters of faith, Jesus is waiting to meet you in ways that will change you forever, deepening your character and your trust in God. The experience is terrifying. It’s thrilling beyond belief. It’s everything you’d expect of someone worthy to be called Lord.The choice is yours to know him as only a water-walker can, aligning yourself with God’s purpose for your life in the process. There’s just one requirement: If You Want to Walk on Water, You’ve Got to Get Out of the Boat.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Ain't I a Woman! A Book of Women's Poetry from Around the World",
        "Authors": "By Linthwaite, Illona (EDT)",
        "Description": "Spanning the centuries from Sappho's Greece to tenth-century Japan, from nineteenth-century Chile to Zindziswa Mandela's twentieth-century South Africa, the voices of these women poets express themes of love, injustice, motherhood, and loss, and the oppressions of race and sex.  The sequence of the poems moves from youth to old age, and they bear witness to the triumphs as well as the pain and frustration of women in many times and in many places.  Among the many poets whose work is included are Anna Akhmatova, Maya Angelou, Judith Kazantzis, Gabriela Mistral, Marge Piercy, Irina Ratushinskaya and Alice Walker.Illona Linthwaite began gathering this collection several years ago, initially for a theatrical performance.  Here, in this unique exchange between women of many races, affirming their differences and what they have in common, are more than 150 poems which assert the black abolitionist Sojourner Truth's challenge, \"Ain't I a Woman!\"In addition to the poems, there are biographies of the 91 contributors.",
        "Category": " Poetry , Anthologies (multiple authors)",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Flow: The Psychology of Optimal Experience",
        "Authors": "By Csikszentmihalyi, Mihaly",
        "Description": "The bestselling introduction to \"flow\"--a groundbreaking psychological theory that shows readers how to improve the quality of life. \"The way to happiness lies not in mindless hedonism, but in mindful change.\"--New York Times Book Review",
        "Category": " Psychology , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "The Face of Baseball",
        "Authors": "By Weiss, John",
        "Description": "The text by novelist/critic Sheed has wit and warmth and is a good complement to the collection of portraits and candids by photographer Weiss. 10x10\" Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Lickle Pub Inc",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "The Metaphysical Club: A Story of Ideas in America",
        "Authors": "By Menand, Louis",
        "Description": "The Metaphysical Club is the winner of the 2002 Pulitzer Prize for History.A riveting, original book about the creation of modern American thought.The Metaphysical Club was an informal group that met in Cambridge, Massachusetts, in 1872, to talk about ideas. Its members included Oliver Well Holmes, Jr., future associate justice of the United States Supreme Court; William James, the father of modern American psychology; and Charles Sanders Peirce, logician, scientist, and the founder of semiotics. The Club was probably in existence for about nine months. No records were kept. The one thing we know that came out of it was an idea -- an idea about ideas. This book is the story of that idea.Holmes, James, and Peirce all believed that ideas are not things \"out there\" waiting to be discovered but are tools people invent -- like knives and forks and microchips -- to make their way in the world. They thought that ideas are produced not by individuals, but by groups of individuals -- that ideas are social. They do not develop according to some inner logic of their own but are entirely depent -- like germs -- on their human carriers and environment. And they thought that the survival of any idea deps not on its immutability but on its adaptability.The Metaphysical Club is written in the spirit of this idea about ideas. It is not a history of philosophy but an absorbing narrative about personalities and social history, a story about America. It begins with the Civil War and s in 1919 with Justice Holmes's dissenting opinion in the case of U.S. v. Abrams-the basis for the constitutional law of free speech. The first four sections of the book focus on Holmes, James, Peirce, and their intellectual heir, John Dewey. The last section discusses some of the fundamental twentieth-century ideas they are associated with. This is a book about a way of thinking that changed American life.\"",
        "Category": " Philosophy , Metaphysics",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Wealth and Democracy: How Great Fortunes and Government Created America's Aristocracy",
        "Authors": "By Phillips, Kevin P.",
        "Description": "For more than thirty years, Kevin Phillips' insight into American politics and economics has helped to make history as well as record it.  His bestselling books, including The Emerging Republican Majority (1969) and The Politics of Rich and Poor (1990), have influenced presidential campaigns and changed the way America sees itself. Widely acknowledging Phillips as one of the nation's most perceptive thinkers, reviewers have called him a latter-day Nostradamus and our \"modern Thomas Paine.\"  Now, in the first major book of its kind since the 1930s, he turns his attention to the United States' history of great wealth and power, a sweeping cavalcade from the American Revolution to what he calls \"the Second Gilded Age\" at the turn of the twenty-first century.The Second Gilded Age has been staggering enough in its concentration of wealth to dwarf the original Gilded Age a hundred years earlier. However, the tech crash and then the horrible events of September 11, 2001, pointed out that great riches are as vulnerable as they have ever been.  In Wealth and Democracy, Kevin Phillips charts the ongoing American saga of great wealth–how it has been accumulated, its shifting sources, and its ups and downs over more than two centuries.  He explores how the rich and politically powerful have frequently worked together to create or perpetuate privilege, often at the expense of the national interest and usually at the expense of the middle and lower classes.With intriguing chapters on history and bold analysis of present-day America, Phillips illuminates the dangerous politics that go with excessive concentration of wealth.  Profiling wealthy Americans–from Astor to Carnegie and Rockefeller to contemporary wealth holders–Phillips provides fascinating details about the peculiarly American ways of becoming and staying a multimillionaire.   He exposes the subtle corruption spawned by a money culture and financial power, evident in economic philosophy, tax favoritism, and selective bailouts in the name of free enterprise, economic stimulus, and national security.Finally, Wealth and Democracy turns to the history of Britain and other leading world economic powers to examine the symptoms that signaled their declines–speculative finance, mounting international debt, record wealth, income polarization, and disgruntled politics–signs that we recognize in America at the start of the twenty-first century.  In a time of national crisis, Phillips worries that the growing parallels suggest the tide may already be turning for us all.",
        "Category": " Political Science , Political Economy",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Staying Fat for Sarah Byrnes",
        "Authors": "By Crutcher, Chris",
        "Description": "Called a “masterpiece” in a starred review from School Library Journal, award-winning author Chris Crutcher’s acclaimed Staying Fat for Sarah Byrnes is an enduring classic.This bestselling novel is about love, loyalty, and friendship in the face of adversity. “Superb plotting, extraordinary characters, and cracking narrative make this novel unforgettable.”—Publishers Weekly  Sarah Byrnes and Eric Calhoune have been friends for years. When they were children, his weight and her scars made them both outcasts. Now Sarah Byrnes—the smartest, toughest person Eric has ever known—sits silent in a hospital. Eric must uncover the terrible secret she’s hiding before its dark current pulls them both under. Will appeal to fans of Marieke Nijkamp, Andrew Smith, and John Corey Whaley.“Once again, Chris Crutcher plunges his readers into life's tough issues within a compelling story filled with human compassion . . . with his characteristic intelligence, humor, and empathy.\"—ALAN ReviewAn American Library Association Best Book for Young Adults",
        "Category": " Young Adult Fiction , Social Themes , Friendship",
        "Publisher": "Greenwillow Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Quiet Time",
        "Authors": "By Houghton, Frank L., Scroggie, W. Graham, Wilkes, A. Paget, Banham, V. G., and Woods, C. Stacey",
        "Description": "We all long for an ever-deepening fellowship with God. But how do we find it? The mystery is not great. Experience shows that those who are close to God have set time aside each day with him.Over a million Christians have turned again and again to this classic introduction to daily devotions. Here they have found simple, sound and practical advice on quiet time with their Lord.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "IVP",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1947"
        }
    },
    {
        "Title": "Simple Wisdom: Shaker Sayings, Poems, and Songs",
        "Authors": "By Mahoney, Kathleen (EDT), Raymond, Lilo (PHT), Raymond, Lilo (EDT), and Shakers (COR)",
        "Description": "Photographs of Shaker buildings, furniture, and handicrafts accompany Shaker writings",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Avery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Prepare the Way: Twelve Spiritual Signposts for the New Millennium",
        "Authors": "By Stearns, Robert",
        "Description": "",
        "Category": " Religion , Leadership",
        "Publisher": "Creation House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Mystery at the Big Blue House (Bear in the Big Blue House 8X8, 5)",
        "Authors": "By Brannon, Tom (ILT) and Cherrington, Janelle",
        "Description": "What happens when things start disappearing at the Big Blue House? The Big Blue House detectives must crack the case! Join Bear and the supersleuths Ojo and Tutter as they track down clues and get to the bottom of it all. Try to guess whodunnit in this sidesplitting tale of mystery and intrigue!",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "6.49",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Reflections of the Game: Lives in Baseball",
        "Authors": "By Jordan, Pat and Modra, Ron (PHT)",
        "Description": "Reflections of the Game is a very personal word and picture image of a love affair with America's favorite pastime and its excitement, personalities, traditions and history. With over 200 color photographs, Reflections of the Game is a gallery of award-winning Sports Illustrated photographer Ron Modra's twenty years of capturing baseball's most cherished moments for some several Sports Illustrated covers. Modra's photographs are complemented throughout by an original Pat Jordan essay. As well, poignant and exclusive commentary is offered by such giants of the game as Bob Costas, Bob Uecker, Nolan Ryan, Keith Hernandez, Barry Bonds, Bud Selig, Tom Glavine, Goose Gossage and many others.",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Willow Creek Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "God Things Come in Small Packages for Moms",
        "Authors": "By Weiss, Leann, Duke, Susan, Carden, Judy, and Loveless, Caron",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Starburst Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "I Can Finger Paint (Playtime Series)",
        "Authors": "By Gibson, Ray",
        "Description": "",
        "Category": " Juvenile Nonfiction , Art , Painting",
        "Publisher": "Usborne Pub Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Just Give Me a Little Piece of Quiet: 60 Mini-retreats for a Mom's Soul",
        "Authors": "By Craker, Lorilee",
        "Description": "",
        "Category": "",
        "Publisher": "Revell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Bears' Vacation",
        "Authors": "By Berenstain, Stan and Berenstain, Jan",
        "Description": "Stan and Jan Berenstain take readers on a fun-filled trip to the beach in this classic Beginner Book, edited by Dr. Seuss. “Hooray! Hooray! We’re on our way! Our summer vacation starts today!” School’s out, and the Bear family is ready for a vacation at the beach. Whether the Bears are sailing, swimming, surfing, snorkeling, or having a run-in with an angry whale, Father Bear certainly knows how to find trouble. The Bears' Vacation will leave young readers eager for their very own summer fun! Originally created by Dr. Seuss, Beginner Books encourage children to read all by themselves, with simple words and illustrations that give clues to their meaning.",
        "Category": " Juvenile Fiction , Animals , Bears",
        "Publisher": "Beginner Books",
        "Price Starting With ($)": "11.53",
        "Publish Date": {
            "Month": "August",
            "Year": "1968"
        }
    },
    {
        "Title": "The Associated Press Stylebook and Briefing on Media Law",
        "Authors": "By Associated Press (COR) and Goldstein, Norm (EDT)",
        "Description": "More people write for the Associated Press than for any newspaper in the world, and more writers --over 1,750,000--have bought The AP Stylebook than any other journalism reference. It provides facts and references for reporters, and defines usage, spelling, and grammar for editors. There are separate sections for journalists specializing in sports and business, and complete guidelines for how to write photo captions, proofread text, file copy over the wire, handle copyrights, and avoid libel. This new edition of the Stylebook has been fully updated with fifty new entries and revisions to more than one hundred others in order to keep pace with world events, common usage, and Associated Press procedures. More than 1.7 million copies sold",
        "Category": " Language Arts & Disciplines , Journalism",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "The Rehnquist Court: Judicial Activism on the Right",
        "Authors": "By Schwartz, Herman (EDT)",
        "Description": "Incisive commentary on recent Supreme Court decisions from America's foremost constitutional scholars  For nearly all his tenure as Chief Justice of the Supreme Court, William Rehnquist has enjoyed the support of a slim but usually solid majority of his fellow justices. With it he has been able to effect a dramatic shift to the right in many vital areas of constitutional law. Displaying a judicial activism not seen since the 1930s, Rehnquist and his allies, in a series of 5-4 decisions, have undermined civil rights and weakened the federal government's ability to respond to pressing social needs.  As the Rehnquist court concludes its fifteenth term, the well-known constitutional authority Herman Schwartz has assembled seventeen distinguished legal scholars to evaluate its record on the many controversial issues that have come before it. Among them are Stephen Bright on capital punishment, Charles Ogletree on criminal procedure, Norman Redlich on religion, Allan Morrison and David Vladeck on regulation, and John Mackenzie on Bush v. Gore. The book concludes with an overall reflection on Rehnquist's legacy by Tom Wicker.",
        "Category": " Law , Courts",
        "Publisher": "Hill and Wang",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Prepare for the Great Tribulation and the Era of Peace, Vol. 4",
        "Authors": "By Leary, John",
        "Description": "",
        "Category": " Political Science , Peace",
        "Publisher": "Queenship Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Pooh Invents a New Game",
        "Authors": "By Milne, A. A.",
        "Description": "",
        "Category": "",
        "Publisher": "Dutton Juvenile",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Dora's Spooky Halloween (Dora the Explorer)",
        "Authors": "By Fry, Sonali and Style Guide (ILT)",
        "Description": "It's Halloween, and Dora is ready to go trick-or-treating! But first she needs to find something to wear. Join Dora on this spooky adventure!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Halloween",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The Readymade Family: How to Be a Stepparent and Survive",
        "Authors": "By Bustanoby, Andre",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The Complete Armchair Book of Baseball: An All-Star Lineup Celebrates America's National Pastime",
        "Authors": "By Thorn, John (EDT)",
        "Description": "Batters up! Here are the heavy hitters of baseball writing and reporting, the raconteurs and the players of America’s favorite game, all in one big, entertaining volume that no fan can do without. The featured luminaries include Zane Grey, Ring Lardner, Damon Runyan, W.P. Kinsella, Red Smith, Tim McCarver, Pete Rose, and George Will, and they all weigh in with wit and an obvious love of the sport. Many offer a fascinating glimpse into baseball’s history, such as Walt Whitman, who reports on a rugged game played even before the Civil War. Russell Baker provides lessons on the art of firing, “learned at the knee of Mr. Steinbrenner.” An excerpt from Jim Bouton’s groundbreaking classic Ball Four examines the sport’s unrelenting power over him: “You see, you spend a good piece of your life gripping a baseball, and in the end it turns out that it was the other way around all the time.” With these stories and essays, baseball buffs will relive important moments, such as Candy Cummings’ perfecting the first curve ball, baseball’s drawing the color line in 1887, and Bob Carroll’s uncovering Nate Colbert’s hidden RBI record in 1972.",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Galahad",
        "Price Starting With ($)": "7.56",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Meaning Of Life",
        "Authors": "By Greive, Bradley Trevor",
        "Description": "It's an age-old question that has stumped the great minds of history: What is the meaning of life? In his hilarious and uplifting style, best-selling author Bradley Trevor Greive finally provides the answer: Figure out what you love and do it.  Illustrated with playful photographs of animals, BTG's insightful prose again hits his target straight on. He muses about why we're here and our greater purpose in the grand scheme of things. His informal style provides a refreshing counterpoint to what has always been one of life's big debates. For example, when it comes to discovering your passion, BTG writes, \"First, no one else will tell you about it—it's just like walking around all day with a sign on your back that says KICK ME.\"The Meaning of Life is a witty, thought-provoking book that makes an ideal gift for anyone who's seeking their true purpose—and wants to laugh along the way.",
        "Category": " Photography , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Barn Burning Barn Building: Tales of a Political Life, From LBJ to George W. Bush and Beyond",
        "Authors": "By Barnes, Ben F. and Dickey, Lisa",
        "Description": "How did the Democratic Party—of JFK, LBJ, and civil rights—fall from glory? How did Texas, home of its most promising players, become Bush territory? What do politicians on either side need to do today to get our country back on track? Ben Barnes has the answers. Barnes had a front-row seat through it all. His political savvy and bravado made him a standout in the rough-and-tumble world of Texas politics. He won a seat in the Texas Legislature in 1960, at the unheard-of age of 22, and four years later he became the youngest Speaker of the House since the Civil War. In 1968, he helped Congressman George Herbert Walker Bush get his son into the National Guard—a controversy that would rage during the 2004 presidential election. In 1970, Lyndon Johnson told the public that Ben was destined to be the next US president to hail from Texas. Barnes’s rollicking memoir recalls the glory days of his Texas past and blazes a trail for our country’s future.",
        "Category": " Political Science , American Government , General",
        "Publisher": "Bright Sky Press",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "An Expotition to the North Pole",
        "Authors": "By Milne, A. A.",
        "Description": "",
        "Category": "",
        "Publisher": "Dutton Juvenile",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "The Toddler's Busy Book: 365 Creative Games and Activities to Keep Your 1 1/2- to 3-Year-Old Busy",
        "Authors": "By Kuffner, Trish",
        "Description": "Fun and creative activities to stimulate your toddler every day of the yearThe Toddler's Busy Book contains 365 screen-free activities for one-and-a-half- to three-year-olds using things found around the home. It shows parents and daycare providers how to:  Prevent boredom during the longest stretches of rainy days with ideas for indoor play, kitchen activities, and arts and crafts projects.  Stimulate your child's natural curiosity with entertaining math, language, and motor-skills activities.  Encourage your child's physical, mental, and emotional growth with fun music, food, water, and outdoor activities.  Celebrate holidays and other occasions with special projects and activities.  Keep toddlers occupied during long car trips or crosstown errands.The Toddler's Busy Book is written with warmth and sprinkled with humor and insight. It should be required reading for anyone raising or teaching toddlers.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Tales of a Drama Queen (Red Dress Ink)",
        "Authors": "By Nichols, Lee",
        "Description": "A rollicking debut novel follows Elle Medina, a newly single drama queen who has never worked a day in her life, as she, while trying to find to a job that does not result in legal action, wreaks havoc on the city of Santa Barbara. Original. 100,000 first printing.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Red Dress Ink",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Just My Friend & Me",
        "Authors": "By Mayer, Mercer and Mayer, Mercer (ILT)",
        "Description": "Mercer Mayer’s Little Critter is inviting his best friend over to play in this classic, funny, and heartwarming book. Whether these buddies are climbing trees, playing basketball, or riding bikes, both parents and children alike will relate to this beloved story. A perfect way to teach children about being a good friend!",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "The Secure Child: Helping Children Feel Safe and Confident in a Changing World",
        "Authors": "By Greenspan, Stanley I.",
        "Description": "In the wake of the events of September 11th, families have drawn closer together, recognizing the comfort that can be drawn from those we treasure most. But how do we help children feel secure longterm? And how can we recognize the signs of distress or anxiety in their behavior that tell us that they need our help?In The Secure Child, Dr. Stanley Greenspan offers a set of guiding principles that will help parents of children at each age--from preschoolers to teenagers --both reassure and guide them so that they feel secure in their homes, their schools, and in their community at large. In addition. Greenspan illuminates the often subtle shifts in children's behavior that signal reaction to the current stress and fears and gives parents concrete suggestions to help children handle their anxieties and look to the future with confidence and optimism. From showing parents how to allow children to talk about their feelings to giving them concrete ways to contribute to national healing efforts, this profoundly wise book will help families everywhere move towards the common goal of a more stable and secure future.",
        "Category": " Psychology , Developmental , Child",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "More Tales from Baseball's Golden Age",
        "Authors": "By Fehler, Gene and Daily News (New York, N. Y.)",
        "Description": "After the runaway success of his Tales from Baseball's Golden Age, Gene Fehler presents his second installation, More Tales from Baseball's Golden Age. It is a collection of anecdotes, memories, and stories from the men who played baseball during its heyday, the '40s and '50s. Stories about playing with or against baseball legends such as Hank Aaron, Mickey Mantle, Satchel Paige, and Ted Williams; including interviews with nearly two dozen players who were not heard from in Tales from Baseball's Golden Age. Mr. Fehler combines lifetime statistics and personal interviews with over 50 Hall of Famers, All-Stars, and ordinary players to create a memorable book sure to delight any baseball fan, young or old.",
        "Category": " Sports & Recreation , Baseball , History",
        "Publisher": "Sports Publishing LLC",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Girlfriends Talk About Men: Sharing Secrets for a Great Relationship",
        "Authors": "By Berry, Carmen Renee and Traeder, Tamara",
        "Description": "In girlfriends Talk About Men, women speak candidly about what they truly think about men - the agony and ecstasy of dating and falling in and out of love, what long-term relationships realistically offer us and how to keep them working, how to keep our balance in the sometimes rocky road of male-female relationships - and how our girlfriends can help us through it all. From recognizing the right man to deciding when to become intimate, surviving infidelity to judiciously dividing up household duties, this invaluable book explores the issues women face when they are in relationships with men.",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Wildcat Canyon Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Trapped in Death Cave (Aladdin Adventure)",
        "Authors": "By Wallace, Bill",
        "Description": "A CURSED TREASURE!  Everybody thinks Gary's grampa died in a fishing accident. But from a note Grampa left, Gary suspects he was murdered. The note tells of a million dollars in gold hidden in a cave and an old Indian curse promising that anyone who touches it will die! Gary and his friend Brian are sure that if they find the gold, they will also find Grampa's killer.  But treasure hunting can be deadly. Now they are stuck in a dark cavern full of tangled skeletons, restless Indian spirits, and a murderer out for their blood! Will Brian and Gary ever get out of Death Cave alive?",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Curious George Goes to a Movie",
        "Authors": "By Rey, H. A. and Rey, Margret",
        "Description": "The movie that George and the man with the yellow hat have been waiting to see is now playing! Once inside the darkened theater, George is curious about the light coming from the back of the room. As usual, George's curiosity gets him into trouble but his clever tricks save the day. The adventures of Curious George continue in an all-new series beginning in fall 1998 with eight new stories. Written and illustrated in the style of Margret and H. A. Rey, the books will appear in paperback (8 x 8\") and hardcover editions and will feature the art of Vipah Interactive, the animators of HMI's Curious George CD-ROMs.",
        "Category": " Juvenile Fiction , Animals , Apes, Monkeys, etc.",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Techniques of Family Therapy",
        "Authors": "By Haley, Jay",
        "Description": "Transcripts of actual therapy sessions accompanied by the therapist's comments reveal the processes and techniques of dealing with the problems and interactions of the family unit",
        "Category": " Health & Fitness , General",
        "Publisher": "Basic",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "The Berenstain Bears Think of Those in Need (First Time Books(R))",
        "Authors": "By Berenstain, Stan and Berenstain, Jan",
        "Description": "This classic Berenstain Bears story is a perfect way to teach children about the importance of giving and generosity! Come for a visit in Bear Country with this classic First Time Book® from Stan and Jan Berenstain. From closets and drawers to the attic and the basement - Papa, Mama, Brother, and Sister realize that they have too much stuff. But what will they do with it all?",
        "Category": " Juvenile Fiction , Animals , Bears",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Civilization and Its Discontents (The Standard Edition) (Complete Psychological Works of Sigmund Freud)",
        "Authors": "By Freud, Sigmund, Gay, Peter (INT), and Strachey, James (TRN)",
        "Description": "It stands as a brilliant summary of the views on culture from a psychoanalytic perspective that he had been developing since the turn of the century. It is both witness and tribute to the late theory of mind—the so-called structural theory, with its stress on aggression, indeed the death drive, as the pitiless adversary of eros.Civilization and Its Discontents is one of the last of Freud's books, written in the decade before his death and first published in German in 1929. In it he states his views on the broad question of man's place in the world, a place Freud defines in terms of ceaseless conflict between the individual's quest for freedom and society's demand for conformity.Freud's theme is that what works for civilization doesn't necessarily work for man. Man, by nature aggressive and egotistical, seeks self-satisfaction. But culture inhibits his instinctual drives. The result is a pervasive and familiar guilt.Of the various English translations of Freud's major works to appear in his lifetime, only one was authorized by Freud himself: The Standard Edition of the Complete Psychological Works of Sigmund Freud under the general editorship of James Strachey.Freud approved the overall editorial plan, specific renderings of key words and phrases, and the addition of valuable notes, from bibliographical and explanatory. Many of the translations were done by Strachey himself; the rest were prepared under his supervision. The result was to place the Standard Edition in a position of unquestioned supremacy over all other existing versions.",
        "Category": " Psychology , Movements , Behaviorism",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Disney's The Little Mermaid (Disney Princess, Pictureback®)",
        "Authors": "By Mateu, Francese (ILT), Shimabukuro, Denise (ILT), Ford, Brent (ILT), and Calmenson, Stephanie (ADP)",
        "Description": "Ariel is tired of living under the sea–she wants to be human and walk on land. She gets her chance after making a deal with an evil sea witch, but something’s fishy! Can Flounder, Sebastian, and Scuttle help make the little mermaid’s dream come true? Find out in this full-color retelling of Disney’s classic film, The Little Mermaid.",
        "Category": " Juvenile Fiction , Royalty",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "I Love Gymnastics!",
        "Authors": "By Feldman, Jane",
        "Description": "This photo essay captures the hard work and dedication of one young girl as she struggles and trains to be the best gymnast she can be. Original.",
        "Category": " Juvenile Nonfiction , Sports & Recreation , Gymnastics",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "How to Win at Rotisserie Baseball: The Strategic Guide to America's New National (Armchair) Pastime",
        "Authors": "By Gollenbeck, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Waiting: The True Confessions of a Waitress",
        "Authors": "By Ginsberg, Debra",
        "Description": "A veteran waitress dishes up a spicy and robust account of life as it really exists behind kitchen doors.Part memoir, part social commentary, part guide to how to behave when dining out, Debra Ginsberg's book takes readers on her twentyyear journey as a waitress at a soap-operatic Italian restaurant, an exclusive five-star dining club, the dingiest of diners, and more. While chronicling her evolution as a writer, Ginsberg takes a behind-the-scenes look at restaurant life-revealing that yes, when pushed, a server will spit in food, and, no, that's not really decaf you're getting-and how most people in this business are in a constant state of waiting to do something else.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Missing Mom: A Novel",
        "Authors": "By Oates, Joyce Carol",
        "Description": "Nikki Eaton, single, thirty-one, sexually liberated, and economically self-supporting, has never particularly thought of herself as a daughter. Yet, following the unexpected loss of her mother, she undergoes a remarkable transformation during a tumultuous year that brings stunning horror, sorrow, illumination, wisdom, and even&#8212from an unexpected source&#8212a nurturing love.",
        "Category": " Fiction , Literary",
        "Publisher": "Ecco",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Heaven: Your Real Home",
        "Authors": "By Tada, Joni Eareckson",
        "Description": "Step back a moment, focus your eyes of faith, and then come with Joni into a world you’ve heard about from your youth but have never seen: heaven. You just might discover that heaven is closer--and more real--than you’ve ever thought. In this joyful best-seller, Joni Eareckson Tada paints a shining portrait of our heart’s true home. Joni talks about what heaven will be like, what we’ll do, and whom we’ll see. She shows how heaven will be the satisfaction of all that our hearts cry for, something more real than anything this side of eternity. And Joni tells how we can prepare now for the reality of heaven. With hope for today and vision for those who struggle in life, Heaven invites us to a refreshing and faith-filled picture of our glorious destination. Once you’ve caught a glimpse of heaven, you’ll see earth in a whole new light.",
        "Category": " Religion , Christian Living , Personal Growth",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Bay of Angels",
        "Authors": "By Brookner, Anita.",
        "Description": "Despite growing up with a widowed and reclusive mother, young Zoë Cunningham retains an unshakable faith in storybook happy endings. When her mother, Anne, finally decides to remarry, Zoë is thrilled with her prospective stepfather, Simon Gould, who is not only wealthy, but also kind and generous. Simon’s affection for his new family allows Zoë to pursue what she thinks is an independent life: her own apartment in a fashionable part of London, a university education, casual affairs, and carefree holidays at Simon’s villa in Nice. When a series of unexpected calamities intervene, Zoë learns that the idyllic freedom she enjoys has come at a steep price. To preserve both her mother’s and her own sense of wellbeing, Zoë must discern the real motives of the strangers on whom she now depends, including the silent and mysterious man whose nocturnal movements have attracted her attention.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Burning House",
        "Authors": "By Beattie, Ann",
        "Description": "The now-classic, utterly unique voice of Ann Beattie is so dry it throws off sparks, her eye endowed with the emotional equivalent of X-ray vision. Her characters are young men and women discovering what it means to be a grown-up in a country that promised them they'd stay young forever. And here, in shapely, penetrating stories, Beattie confirms why she is one of the most widely imitated -- yet surely inimitable -- literary stylists of her generation.In The Burning House, Beattie's characters go from dealing drugs to taking care of a bereaved friend. They watch their marriages fail not with a bang but with a wisecrack. And afterward, they may find themselves trading confidences with their spouses' new lovers. The Burning House proves that Beattie has no peer when it comes to revealing the hidden shapes of our relationships, or the depths of tenderness, grief, and anger that lie beneath the surfaces of our daily lives.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Knopf Doubleday Publishing Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "HOW TO AVOID PROBATE NEWLY UPD",
        "Authors": "By Dacey, Norman F.",
        "Description": "Provides expanded, detailed coverage of many new types of assets, outlining more than one hundred new trust forms designed to minimize or eliminate court involvement and legal consultations",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "E-Policy: How to Develop Computer, E-mail, and Internet Guidelines to Protect Your Company and Its Assets",
        "Authors": "By Overly, Michael R.",
        "Description": "With clear, legally sound policies any company can reduce, even eliminate the dangers posed by computer/e-mail use, protect their interests - and reap the rewards of these technologies without any of the risks. e-policy is the first book written to help you do just that. A one-stop computer/e-mail policy writing kit, it examines the potentially astronomical costs of e-mail and Internet misuse, and gives you step-by-step guidelines for creating up-to-date, legally sound policies that explicitly define the rights and obligations of employees. e-policy is packed with background information, detailed instructions, sample clauses, prewritten policies you can put to immediate use, and real-life horror stories that emphasize how explosive these problems really can be - and how crucial the solution it provides is.",
        "Category": " Business & Economics , Human Resources & Personnel Management",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Ballerinas Are Beautiful (The Little Friends)",
        "Authors": "By Church, Caroline Jayne (ILT) and Smith, Kath",
        "Description": "Three student ballerinas help each other, as Izzy learns her left from her right, Di overcomes her shyness, and Zoe learns that friendship is more important than boasting.",
        "Category": " Juvenile Fiction , Performing Arts , Dance",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Henry and Mudge and the Forever Sea",
        "Authors": "By Rylant, Cynthia",
        "Description": "Henry and his dog Mudge share a fun-filled day at the beach in this sixth Ready-to-Read book of their adventures.Henry and his 180-pound dog Mudge are best friends forever. And they're ready for some sun and sand!",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "The Alphabet Book (Bright & Early Board Books(TM))",
        "Authors": "By Eastman, P. D.",
        "Description": "From American ants to zebras with zithers, kids will love exploring the alphabet in this classically creative P. D. Eastman alphabet book.",
        "Category": " Juvenile Fiction , Concepts , Alphabet",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "A Day at the Beach",
        "Authors": "By Silverhardt, Lauryn and Fruchter, Jason (ILT)",
        "Description": "Young explorers can join Dora the Explorer and Boots for lots of fun in the sun as they build sand castles, collect seashells, swim in the ocean, and much more.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Poppleton In Spring",
        "Authors": "By Rylant, Cynthia and Teague, Mark (ILT)",
        "Description": "Poppleton the pig does some spring cleaning, tries to buy a bicycle, and stays up all night in a tent in his backyard",
        "Category": " Juvenile Fiction , Sports & Recreation , General",
        "Publisher": "Blue Sky Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Pitching: The Keys to Excellence (Sports Illustrated Winner's Circle Books)",
        "Authors": "By Jordan, Pat and Handville, Robert (ILT)",
        "Description": "The ultimate instruction for young pitchers. In addition to covering all the basic pitches, it also includes sections on proper motion, strength development, and pitching control.",
        "Category": " Sports & Recreation , Coaching , Baseball",
        "Publisher": "Taylor Trade Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Truly, Madly Manhattan: Local Hero\\Dual Image",
        "Authors": "By Roberts, Nora",
        "Description": "Single mother Hester Wallace reluctantly begins to care about comic book creator Mitch Dempsey; and cynical Booth DeWitt becomes unwillingly fascinated with actress Ariel Kirkwood, who is playing the role of his cruel ex-wife.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Autobiography of a Face",
        "Authors": "By Grealy, Lucy",
        "Description": "\"I spent five years of my life being treated for cancer, but since then I've spent fifteen years being treated for nothing other than looking different from everyone else. It was the pain from that, from feeling ugly, that I always viewed as the great tragedy of my life. The fact that I had cancer seemed minor in comparison.\"At age nine, Lucy Grealy was diagnosed with a potentially terminal cancer. When she returned to school with a third of her jaw removed, she faced the cruel taunts of classmates. In this strikingly candid memoir, Grealy tells her story of great suffering and remarkable strength without sentimentality and with considerable wit. Vividly portraying the pain of peer rejection and the guilty pleasures of wanting to be special, Grealy captures with unique insight what it is like as a child and young adult to be torn between two warring impulses: to feel that more than anything else we want to be loved for who we are, while wishing desperately and secretly to be perfect.",
        "Category": " Biography & Autobiography , Medical (incl. Patients)",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Misstating the State of the Union: Right-wing Media Distortions About the Clinton and Bush Presidencies",
        "Authors": "By MediaMatters. Org and Brock, David (INT)",
        "Description": "Misstating the State of the Union reveals a simple truth that the media too often obscures: By every objective measure, the Clinton presidency was far better for America than the Bush presidency. Yet an army of conservative pundits have conspired to lie to the public about both the Clinton and Bush records, denying the proven success of progressive policies and leadership while shamelessly covering up abject conservative failures. This book dissects the conservative misinformation campaign to distort and discredit the progressive agenda point by point, while unmasking the dark ideological agenda and rank dishonesty behind all the cable TV and radio hot air.From Rush Limbaugh’s claim that the federal government spends three times as much on education as defense (the truth: the government spends five times as much on defense as on education) to Sean Hannity’s dismissal of air quality concerns to Ann Coulter’s attacks on the elderly, this book clearly and concisely refutes many of the most dangerous right-wing lies in circulation in this political year, using sound logic, incontrovertible fact and illustrative charts and graphs.Misstating the State of the Union is the first book produced by Media Matters Action Network, the advocacy organization associated with Media Matters for America, a new nonprofit web-based media research center in Washington, DC, that monitors, analyzes and corrects conservative misinformation in the US media.David Brock, a writer in Washington, DC, is the author of The New York Times bestsellers Blinded by the Right: The Conscience of an Ex-Conservative and The Republican Noise Machine: Right-Wing Media and How It Corrupts Democracy. He has written for Esquire, New York and the op-ed pages of The New York Times and The Washington Post. He appears regularly on television talk shows, and his work has been featured on Air America and National Public Radio. He is the founder of Media Matters for America.",
        "Category": " Political Science , Essays",
        "Publisher": "Akashic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Reefs (The Journeys of Mcgill Feighan, Book 2)",
        "Authors": "By Kevin O'Donnell,Jr.",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1981"
        }
    },
    {
        "Title": "Caverns",
        "Authors": "By O'Donnell, Kevin",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1981"
        }
    },
    {
        "Title": "The Dancing Cats of Applesap",
        "Authors": "By Lisle, Janet Taylor",
        "Description": "In order to save Rigg's Drug Store from going out of business, Melba Morris convinces Miss Toonie to lead a parade featuring the store's one hundred dancing cats in the hopes that it will draw customers.In order to save Riggs' Drugstore from going out of business, Melba convinces Miss Toonie to lead a parade featuring the store's one hundred cats in the hopes that it will draw customers",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1985"
        }
    },
    {
        "Title": "R is for Ricochet (A Kinsey Millhone Mystery, Book 18)",
        "Authors": "By Grafton, Sue",
        "Description": "Reba Lafferty was a daughter of privilege, the only child of an adoring father. Nord Lafferty was already in his fifties when Reba was born, and he could deny her nothing. Over the years, he quietly settled her many scrapes with the law, but he wasn't there for her when she was convicted of embezzlement and sent to the California Institution for Women. Now, at thirty-two, she is about to be paroled, having served twenty-two months of a four-year sentence. Nord Lafferty wants to be sure she stays straight, stays at home and away from the drugs, the booze, the gamblers.\" \"It seems a straightforward assignment for Kinsey: babysit Reba until she settles in, make sure she follows all the rules of her parole. Maybe all of a week's work. Nothing untoward - the woman seems remorseful and friendly. And the money is good.\" But life is never that simple, and Reba is out of prison less than twenty-four hours when one of her old crowd comes circling round.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Stallion Gate: A Novel",
        "Authors": "By Smith, Martin Cruz",
        "Description": "This is a novel about the most important ten seconds in history.Stallion Gate, a magnificent successor to Gorky Park, is a powerful sensual idyll, a blend of love and betrayal, of humor and cultures in collision, of jazz and war.In a New Mexico blizzard, four men cross a barbed-wire fence at Stallion Gate to select the test site for the first automatic weapon. They are Oppenheimer, the physicist; Groves, the general; Fuchs, the spy. The fourth man is Sergeant Joe Peña, a hero, informer, fighter, musician, Indian.Oppenheimer and Groves have hidden Los Alamos on a mesa surrounded by vast Indian reservations. It is the most secret installation of the war, the future encompassed by the past. To it come soldiers, roughnecks and scientists, including Anna Weiss, a mathematician and refugee from the Holocaust with whom Joe falls in love.",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "The Gatecrasher",
        "Authors": "By Wickham, Madeleine",
        "Description": "The Secret Is Out!Madeleine Wickham is Sophie Kinsella, and The Gatecrasher is just as delicious as her internationally bestselling Shopaholic series.  Everything's coming up roses for Fleur Daxeny, as she goes through more rich men than she does designer hats.  Beautiful and utterly irresistible, her success at crashing funerals to find wealthy men is remarkable. Fleur wastes no time in seducing her latest conquest, the handsome and rich widower Richard Favour. His children are caught up in a whirlwind as their father's new girlfriend descends on the family estate. Fleur is not one to wear her heart on her Chanel sleeves, but she soon finds herself embracing Richard and his family. But just as Fleur contemplates jumping off the gold-digger train for good, a long-buried secret from her past threatens to destroy her new family.Take a wild and marvelous ride with The Gatecrasher, whose clever, chic, and sassy style will leave you desperately wanting more wonderful Wickham!",
        "Category": " Fiction , Women",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Prizes",
        "Authors": "By Segal, Erich",
        "Description": "Haunted by the promise of the Nobel Prize, three very different characters come together in a story of love, betrayal, ambition, and genius. Reprint.",
        "Category": " Fiction , General",
        "Publisher": "Ivy Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Outbreak (A Medical Thriller)",
        "Authors": "By Cook, Robin",
        "Description": "Murder and intrigue reach epidemic proportions when a devastating plague sweeps the country. Dr. Marissa Blumenthal of the Atlanta Centers for Disease Control investigates--and soon uncovers the medical world's deadliest secret...",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "The Voice of the Night",
        "Authors": "By Koontz, Dean R.",
        "Description": "#1 New York Times bestselling author Dean Koontz gives a new meaning to “blood brothers” in this chilling novel of friendship gone awry...No one could understand why Colin and Roy were best friends. Colin was so shy; Roy was so popular. Colin was nervous around girls; Roy was a ladies’ man. Colin was fascinated by Roy—and Roy was fascinated by death. Then one day Roy asked his timid friend: “You ever killed anything?” And from that moment on, the two were bound together in a game too terrifying to imagine...and too irresistible to stop.",
        "Category": " Fiction , Horror",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Crusader Gold (Jack Howard)",
        "Authors": "By Gibbins, David",
        "Description": "From the fall of the Roman Empire to the last days of Nazi power, marine archaeologist Jack Howard and his team of adventurers are hot on the trail of history’s most elusive and desired treasure: the lost golden menorah of Jerusalem. And what they discover could change the world forever….Deep beneath the windswept waters near Istanbul, Jack and his crack team of experts have uncovered a surprising clue to the location of the fabled treasure plundered during the Crusades. Meanwhile, in a dusty cathedral library, someone unearths a long-forgotten medieval map. Together the two discoveries will solve an ancient mystery—and spark a race to stop a present-day conspiracy of staggering proportions.From diving into the core of an arctic iceberg to the last stand of a Viking warship to an extraordinary revelation deep in the jungles of Central America, Jack is headed straight into a globe-spanning clash of civilizations, into an astounding underground labyrinth steeped in blood and horrors—and to a confrontation with a killer on a shattering crusade of his own.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "After the Fire: A Novel",
        "Authors": "By Plain, Belva",
        "Description": "What happens when the picture-perfect marriage dissolves?In her stunning new novel, New York Times-bestselling author Belva Plain penetrates a shattered marriage to explore one of the most provocative issues of our time. Once again Plain proves herself the writer who sets the standard for family stories in a novel that is at once harrowing and deeply moving.  Gerald and Hyacinth had the kind of marriage others envied. She was a beautiful artist. He was a brilliant plastic surgeon. Theirs was a comfortable, happy home with two wonderful children. Then whispers of betrayal tainted Hy's perfect marriage. And in one terrible night she commits an act she will regret for the rest of her life. An act that gives Gerald the ultimate weapon: blackmail. The price of his silence is uncontested custody of their two children. When her own beautiful, angry mother wants to know why she won't fight for custody, Hy can give no answers. But deep in her heart, Hy knows there is one question she must answer if she wants to free herself from a life of lies: What really happened that terrible night? Only then can she reclaim her children, her pride, her life—at last.",
        "Category": " Fiction , Women",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    }
]