[
    {
        "Title": "Tapestry of Life ~ Devotions for the Unique Woman",
        "Authors": "By Cole, Nancy Corbett",
        "Description": "",
        "Category": "",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Be A Survivor: Your Guide to Breast Cancer Treatment",
        "Authors": "By Lange, Vladimir",
        "Description": "",
        "Category": " Health & Fitness , Diseases , Cancer",
        "Publisher": "Jones & Bartlett Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Say It With Love",
        "Authors": "By Hendricks, Howard G",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Victor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1972"
        }
    },
    {
        "Title": "A Guide to the Georgia coast",
        "Authors": "By Georgia Conservancy",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Georgia Conservancy",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Tom's Tail",
        "Authors": "By Dubanevich, Arlene",
        "Description": "An old tomcat grows increasingly lazy and sleepy, despite the presence of many mischievous mice.While Tom the cat sleeps the day away, mischievous mice run rampant, grabbing tidbits in the kitchen, snatching fish from the fish bowl, and poking the fatigued feline",
        "Category": "",
        "Publisher": "Viking Juvenile",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "The Rant Zone: An All-Out Blitz Against Soul-Sucking Jobs, Twisted Child Stars, Holistic Loons, and People Who Eat Their Dogs!",
        "Authors": "By Miller, Dennis",
        "Description": "In this fourth installment of his acclaimed Rants series, bestselling author, Emmy Award-winning talk-show host, and wisecracking analyst for ABC's Monday Night Football Dennis Miller makes hamburger meat out of society's most sacred cows as only he can, with the kinds of allusions that require high SAT scores -- or at least a smart crib sheet. For instance, in ranting against bureaucrats, Miller notes, \"They may bestride the rest of us like some kind of Cubicle Colossus bellowing, 'I am Ozymandias, Clerk of Clerks! Look on my Files, ye Mighty, and despair!' All ye who enter here.\"Long before he became America's most-beloved, most-trusted, and most-heckled network football analyst, Miller was an expert commentator on another violent full-contact sport: American pop culture. His gridiron work is merely a sideline, a diversion from his life's mission: to flagellate the fat cats and to punish the puny-minded pundits.This time around, Miller takes on child stars with rap sheets, women with bigger muscles than his own, herbs you don't smoke, God, and, yes, football. As always, nothing is out of bounds. And don't feel guilty for laughing -- these rants are actually good for you. (They provide your daily irony supplement.) Hilarious, sometimes angry, always insightful, The Rant Zone is Miller's most provocative book to date. With Dennis Miller calling the signals, the comedy always goes deep.",
        "Category": " Humor , Topic , Adult",
        "Publisher": "Harper",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Effective Meetings: The Complete Guide",
        "Authors": "By Burleson, Clyde W.",
        "Description": "How to set-up, run, and get the most out of meetings, including effective use of new meeting technologies such as teleconferencing and audiovisual equipment. Shows how to make meetings productive, covering every meeting type and size from an informal meeting in a private office to a huge annual meeting of sales representatives. Provides step-by-step instructions for planning, running, and following up on meetings. Includes tips on goal-setting, timing, and meeting breaks.",
        "Category": " Business & Economics , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Fly;: The complete book of sky sailing",
        "Authors": "By Carrier, Rick",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Washington, D.C. (Great Cities)",
        "Authors": "By Visalli, Santi (PHT) and Visalli, Santi",
        "Description": "Washington is a magnificent city. It's also a great town. The city is made up of official buildings and monuments, handsome bridges, and wide avenues. The town consists of neighborhoods with distinct characteristics, tree-lined streets and playgrounds, small shops, and corner grocery stores. Washington is the center of the free world, and it's also a town of individual communities. The White House, the Capitol building, the official monuments, all presented here through the perceptive eye of Santi Visalli, remind us yet again what an extraordinarily beautiful city this is.",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Universe",
        "Price Starting With ($)": "6.03",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "General Chemistry",
        "Authors": "By Ebbing, Darrell D. and Gammon, Steven D.",
        "Description": "",
        "Category": " Science , Chemistry , General",
        "Publisher": "Houghton Mifflin College Div",
        "Price Starting With ($)": "9.55",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "What Is God?",
        "Authors": "By Boritzer, Etan and Marantz, Robbie (ILT)",
        "Description": "What is God? is an eloquent introduction to the ideas behind God and religion, and brings forward complex ideas in a way children will understand. It is written with a simple clarity and beautifully illustrated with just the right blend of seriousness and humor.    What is God? compares different religions -- Christianity, Islam, Judaism, Hinduism, Buddhism -- and their holy books, looks at misunderstandings and arguments among people of different religions, and talks about praying as well as feeling connected to everything in the world.    If you want to talk about spirituality with a child, or introduce them to philosophy or religion, or just help them to begin to center themselves and their feelings about the world, this book is a great beginning.",
        "Category": " Juvenile Nonfiction , Religion , General",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Dancing in the Movies (Plume contemporary fiction)",
        "Authors": "By Boswell, Robert",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "9.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Letourneau's Used Auto Parts",
        "Authors": "By Chute, Carolyn",
        "Description": "Tells the stories of the inhabitants of Miracle City, including Big Lucien, owner of the auto parts store, Crowe Bovey, a mechanic, Ernie Train, a country music star, and June Marie, who's in business for herself",
        "Category": " Fiction , General",
        "Publisher": "Ticknor & Fields",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "When Did Wild Poodles Roam the Earth?: An Imponderables Book",
        "Authors": "By Feldman, David and Schwan, Kassie (ILT)",
        "Description": "The author of Do Penguins Have Knees? and Why Do Clocks Run Clockwise? responds to the thousands of inquiries he receives, providing answers to such questions as, \"Why is there no Betty Rubble in the Flintstones vitamins?\" Reprint.",
        "Category": "",
        "Publisher": "Perennial",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Tenth Man",
        "Authors": "By Greene, Graham",
        "Description": "This recently recovered novel, written in 1944, focuses on Jean-Louis Charlot, who returns to his home after a four-year absence knowing that strangers live there and that one moment of panic has cost him the right to call it his own",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Natural History: A Novel",
        "Authors": "By Howard, Maureen",
        "Description": "Maureen Howard is a writer who matters, whose every novel is anticipated as a passionately intelligent inquiry into the state of the American soul, and as an addition to the literature of our time. Now, in Natural History, she gives us her masterwork, a gorgeous display of storytelling - enchanting, bawdy, and profound.",
        "Category": " Fiction , General",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Ghostrider One",
        "Authors": "By Carroll, Gerry",
        "Description": "After three years stateside in Training Command, Commander Jim \"Hog\" Hogan, U.S. Navy, has signed on for his second tour of duty in Vietnam, assigned to the aircraft carrier U.S.S. Shiloh off the northern coast and named executive officer of an A-4 Skyhawk attack squadron, VA-262.VA-262 is in disarray; it's up to Hogan to instill confidence and passion in the men he commands. They must be willing to push their aircraft and themselves to the limit...and beyond. For they are about to undertake a mission unlike any they've faced before, one requiring all the skill and courage they can muster - a mission in which the tiniest miscalculation could have tragic consequences.Hogan's old friend, Marine aviator Major Dick Averitt, is in-country, Acting Air Liaison Officer for the Twenty-seventh Marines, operating in the highlands of I Corps near the DMZ and Laos - trapped in a little bit of hell on earth called Khe Sanh. The Tet Offensive is underway, and the North Vietnamese have laid siege to Khe Sanh. For Averitt and his fellow Marines, there is but one hope: Operation Niagara. Hogan's A-4 Skyhawks, in tandem with F-4 Phantoms from the U.S.S. Shiloh and combat aircraft from all the services, must lay down a carpet of death just outside the combat base perimeter. It will test the courage and conviction not only of Averitt and Hogan but of every man under their command. Ultimately, the mission will turn on the strength and the endurance of the American brotherhood of arms....",
        "Category": " Fiction , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "The Book of Color",
        "Authors": "By Blackburn, Julia",
        "Description": "This is a story of unwanted but undeniable inheritance, the tale of a family whose legacy is a curse. It begins in the late 1800s on a remote island in the Indian Ocean, where a missionary has dedicated himself to stamping out fornication among the natives. His own wife is dark-skinned, but that is no shield when she is afflicted with a curse meant for her husband. When her affliction cannot be exorcised, their ten-year-old son must be sent to England. There he will become a minister as hardhearted as his father, his missionary zeal directed against the demons he senses in the world around him. His son, however, will not have the same unforgiving strength: a poet possessed by his own demons, he will end his life wandering the halls of Bedlam.",
        "Category": " Fiction , General",
        "Publisher": "Pantheon Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Father and Son",
        "Authors": "By Maas, Peter",
        "Description": "New York executive Michael McGuire finds his relationship with his son changed and his life endangered when he becomes involved in an IRA gunrunning plot",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Deserts (Where Are You?)",
        "Authors": "By Arvetis, Chris, Palmer, Carole, and Buckley, James (ILT)",
        "Description": "The \"Where Are We?\" frog provides information about deserts and the animals and plants that live there",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Rand McNally",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Edge of Danger",
        "Authors": "By Higgins, Jack",
        "Description": "I always return: for centuries, that had been the Rashid motto. Over the years, their British and Arab ancestries had interwoven to produce a remarkable family of warriors, as much at home under the pitiless desert sun as in the streets of London. But it is to neither of these places that the Rashids now direct their rage. It is to the United States, whose president they hold accountable for a series of attacks against their power and their honor. From opposite ends of the world, hints are picked up by Blake Johnson, head of the clandestine White House operation known as The Basement, and his Irish colleague, Sean Dillon, but hints to what? By whom? Frantically, they work to find the answer - and meanwhile the killers wait. And that is only the beginning.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Abraham and Sarah: The Long Journey",
        "Authors": "By Dorr, Roberta Kells",
        "Description": "When Sarah is taken away to the Pharaoh's harem, Abraham confesses Sarah is not his sister, but his wife, and the couple, along with Hagar, the Pharaoh's headstrong daughter, are sent into exile",
        "Category": " Fiction , Religious",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Holy War for the Promised Land: Israel's Struggle to Survive in the Muslim Middle East",
        "Authors": "By Dolan, David",
        "Description": "Provides a history of the conflict between the two regions by examining the persecution of the Jews and the story of Islam, and emphasizes the religion issue as a central theme in the conflict",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Vicar of Christ",
        "Authors": "By Murphy, Walter F.",
        "Description": "Over-burdened with remorse for sacrificed loved ones in war and peace, Declan Walsh, retires from the Supreme Court to a Trappist monastery, and from there he is called to the papacy",
        "Category": " Fiction , General",
        "Publisher": "Macmillan Publishers",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "April",
            "Year": "1979"
        }
    },
    {
        "Title": "Take It Off! Keep It Off!",
        "Authors": "By Ulene, Art",
        "Description": "Approaching obesity in terms of a chronic disease, a noted health expert explains why diets do not work and presents a health-smart program that utilizes an individual's internal metabolic regulator to take weight off and keep it off. Original. 50,000 first printing. IP.",
        "Category": " Health & Fitness , General",
        "Publisher": "Ulysses Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "China Boy",
        "Authors": "By Lee, Gus",
        "Description": "A young, American-born child of an aristocratic Mandarin family that has fled China struggles to assimilate in 1950s San Francisco in a novel from \"an incredibly rich and new voice.\" (Amy Tan).",
        "Category": " Fiction , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Murder on the Menu",
        "Authors": "By Haining, Peter (EDT)",
        "Description": "Sit down and prepare yourself for a satisfying banquet of murder. Your tastes - both literary and gastronomic - will be tantalized by this exemplary collection of stories by such giants as Agatha Christie, P.D. James, Georges Simenon, and Roald Dahl.Throughout history, food and drink have been used as convenient vehicles for the administering of a fatal dose. Small wonder, then, that the golden age of crime fiction has seen a feast of stories in which murder features prominently on the menu. From the breakfast porridge laced with arsenic to the bedtime cocoa doctored with strychnine, no meal has escaped the determined killer. Country house parties have had a predilection for weedkiller, while many a restaurant specialty has concealed a deadly dose of cyanide in the delicately flavored sauce.Poison is not the only weapon chosen by the mealtime murderer. Guns, knives, and the good old-fashioned blunt instrument have all been used to strike down the unsuspecting victim.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Carroll & Graf Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Stephen Hawking's Universe",
        "Authors": "By Boslough, John",
        "Description": "Summarizes the work of Hawking, a British physicist afflicted with Lou Gehrig's disease, concerning gravity, subatomic particles, black holes, and the origins of the universe",
        "Category": " Science , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "A Secret Life (Alias)",
        "Authors": "By Roberts, Laura Peyton",
        "Description": "It’s Sydney Bristow’s first mission–in Paris.Her first alias.Her first real enemy.Her first real crush.And her first big mistake.There are a lot of firsts for Sydney.But no second chances.",
        "Category": " Young Adult Fiction , Media Tie-In",
        "Publisher": "Bantam Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Blue Death",
        "Authors": "By O'Donnell, Lillian",
        "Description": "Forty-one-year-old Norah Mulcahaney's star is on the rise. Not only has she passed the rigorous NYPD captain's exam, thus achieving a long-held career goal, but she's also succeeded in adopting a baby boy, whose presence fills her with a joy she never could have imagined. But her happiness is shattered when, within a month's time, four fellow officers die, apparent suicides. When Chief James Felix, Norah's longtime friend and mentor, asks her to pay a visit to one of the grieving widows, she is immersed in a controversial case that hits much too close to home.To complicate matters, Norah faces every working mother's nightmare when her nanny suddenly leaves, forcing her into a child-care crisis. When her superior refuses to approve her makeshift home office, Norah enlists the help of Chief Felix - until her beloved friend very nearly becomes the fifth policeman to die. Spurred by the personal turn the case has taken, Norah must prove the deaths were murders, not suicides.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "G.P Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Kid Tips",
        "Authors": "By McMahon, Tom (EDT)",
        "Description": "The Real Parenting Experts Speak Out!  For this invaluable book, Tom McMahon mounted a nationwide media campaign and gathered a wealth of tested and proven child raising tips from experienced parents in over three hundred cities across the country. Here are more than one thousand of the best, reflecting every aspect of parenting -- inside tips today's busy parents all too often don't have time to share with their family and friends. Discover fresh, unique, creative ideas that are fun, thrifty, easily accessible and pediatrician-approved for health and safety:  PLAYTIME -- from indoor activities to outdoor play to coping with clutter and cleanup  MEALTIME -- how to feed baby, deal with your finicky eater and dine out without losing your mind  HEALTH AND SAFETY -- taking medicine painlessly, soothing colicky babies, visiting the doctor, and more  DISCIPLINE -- three easy steps that short-circuit big problems before they begin!  BEDTIME -- from putting baby to bed to quieting bumps in the night  ON THE GO -- travel and vacations, errands and shopping made easy  SELF ESTEEM AND RELATIONSHIPS -- promoting healthful self-respect and respect for others  From baby basics to easy toilet training to teaching your children responsibility and more, here are fast, fabulous \"fixes\" that work!",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Puppy Care & Training: An Owner's Guide to a Happy Healthy Pet",
        "Authors": "By McLennan, Bardi",
        "Description": "An Owner's Guide to a Happy Healthy Pet is the series to turn to when you want a basic reference that's reliable, up-to-date, and complete. These guides feature:Expert authors, plus renowned guest contributors on specialized topicsFull-color photos throughoutBasic information on the breed, species, or topicComplete coverage of care, health, grooming, training, and moreTips and techniques to make life with a pet more rewarding",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Individual Investor Revolution: Seize Your New Powers of Investing & Make More Money in the Market",
        "Authors": "By Carlson, Charles B.",
        "Description": "Individual investors now enjoy the same access to global markets, lightning-fast research, and market intelligence as the big guys on Wall Street. Chuck Carlson, the individual investor's earliest champion, shows how to use your power and hold onto it, especially in turbulent times. Includes Carlson's \"10 Rules of Engagement\" and complete information (with directories) on No-Load Stocks™ and Dividend Reinvestment Plans. Carlson also covers essential macro tools, e-trading and online research, finding value stocks in an overvalued market, and much more.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "The Leadership Engine: How Winning Companies Build Leaders at Every Level",
        "Authors": "By Tichy, Noel M. and Cohen, Eli B.",
        "Description": "Shows how to access untapped leadership potential to create dynamic leaders at every level of an organization, offering concrete methods for developing good business idea, instilling values that support success, generating positive energy, and making tough decisions. A handbook section provides hands-on development activities for improving leadership abilities. Includes real-life examples of successful leaders. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Harperbusiness",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "The long distance grandmother: How to stay close to distant grandchildren",
        "Authors": "By Selma Wassermann",
        "Description": "",
        "Category": "",
        "Publisher": "Hartley & Marks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "2PLUS2: A Collection of International Writing",
        "Authors": "By Ion Caraion~James Gill~Dedwydd Jones~Jamie Lehrer~",
        "Description": "",
        "Category": "",
        "Publisher": "Mylabris Press",
        "Price Starting With ($)": "5.59",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Rascal: Celebrating 50 Years of Sterling North's Classic Adventure! (Puffin Modern Classics)",
        "Authors": "By North, Sterling and Schoenherr, John (ILT)",
        "Description": "A Newbery Honor BookCelebrating 50 years of a beloved classic!Nothing's surprising in the North household, not even Sterling's new pet raccoon. Rascal is only a baby when Sterling brings him home, but soon the two are best friends, doing everything together--until the spring day when everything suddenly changes.Rascal is a heartwarming boyhood memoir that continues to find its way into the hearts of readers fifty years later. This special anniversary edition includes the book's classic illustrations restored to their original splendor, as well as a letter from the author's daughter, and material from the illustrator's personal collection.\"Everyone should knock off work, sit beneath the nearest tree, and enjoy Rascal from cover to cover.\"—Chicago Tribune",
        "Category": " Young Adult Fiction , Science & Nature , General",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Light Before Day",
        "Authors": "By Rice, Christopher",
        "Description": "Twenty-six-year-old journalist Adam Murphy is chasing a career-making story when he is suspiciously fired by the magazine that employs him. Scarred by the failure of a recent relationship, and haunted by the violent death of his alcoholic mother, Adam finds himself cut adrift in the city of West Hollywood. Determined to expose the facts behind the suicide of the Marine pilot, he discovers that his estranged lover has vanished without a trace, and that his disappearance matches several other recent missing persons cases. Working with his new boss, James Wilton - a famously curmudgeonly mystery novelist with his own battle scars, who is eager for a new case to write about - Adam begins to suspect a serial killer is preying on the city's young gay men.Meanwhile, Caroline Hughes, an intense young surgical resident, scours central California, also seeking a serial killer: an avenger of such legendary violence he seems more demon than man.The truth that Adam, Caroline, and James Wilton discover is far more diabolical than they could ever have imagined.From the mansion-strung Hollywood Hills to the drug-ravaged hamlets of the Central Valley, they enter a labyrinth that leads to the darkest core of the human heart - uncovering a conspiracy so extraordinary that it threatens both their sanity and their lives.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Miramax",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Beyond Jennifer & Jason, Madison & Montana",
        "Authors": "By Rosenkrantz, Linda and Satran, Pamela Redmond",
        "Description": "Quoted everywhere from Parenting to The Wall Street Journal, with more than a million copies of their books in print, bestselling authors Linda Rosenkrantz and Pamela Redmond Satran are the baby-name experts. In this fresh and expanded new edition of \"the best baby-naming book ever written\" (The News Journal), they offer irresistible lists of names you won't find anywhere else, along with their trademark wit and insight on the most important questions---and answers---for expectant parents:Style: What's hot and what's cool---including Honest Names, Spiritual Names, Kreeatif Names, The Two-Syllable Solution, Word Names, The Exotics, and a Girl Named BoyPopularity: The most popular names in America and around the world, and whatcelebrities are naming their babiesImage: What's really in a name, and why Briyana spells troubleSex: What's it like for a girl to grow up with a traditionally feminine name like Abigail or Blossom; a no-frills name like Alice or Jane; or a unisex name like Dylan or Dakota? And are there any decidedly masculine names left for boys?Tradition: A concise history of American baby naming, plus inspired ways to reflect your own cultural heritageFamily: Whose name is it, anyway? And other vital considerations",
        "Category": " Family & Relationships , Baby Names",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Opposite of Fate",
        "Authors": "By Tan, Amy",
        "Description": "In her first book of nonfiction, bestselling novelist Amy Tan shares her personal philosophy of fate.  Amy Tan was born into a family that believed in fate. In The Opposite of Fate: A Book of Musings, she explores this legacy, as well as American circumstances, and finds ways to honor the past while creating her own brand of destiny. She discovers answers in everyday actions and attitudes-from writing stories, decorating her house with charms, learning to ski, and living with squirrels, to dealing with three members of her family afflicted with brain disease, surviving natural disasters, and shaking off both family curses and the expectations that she should become a doctor and a concert pianist.  With the same spirit, humor, and magic that characterize her beloved novels, Amy Tan presents a refreshing antidote to the world-weariness and uncertainties we face today, contemplating how things happen-in her own life and beyond-but always returning to the question of fate and its opposites: the choices, charms, influences, attitudes, and lucky accidents that shape us all.",
        "Category": " Literary Collections , Essays",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Procrastination: Why You Do It, What To Do About It",
        "Authors": "By Burka, Jane, Yuen, Lenora K",
        "Description": "Describes the main causes of procrastination, discusses fears of failure, separation, and attachment, and gives advice on time management, goal setting, and stress",
        "Category": "",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "The Corruption of American Politics: What Went Wrong and Why",
        "Authors": "By Drew, Elizabeth",
        "Description": "Examining twenty-five years of American politics since the Watergate scandal, the former New Yorker  Washington correspondent concludes that big money and vicious politics have eroded American faith in the political system and bred a generation of substandard leaders. Reprint.",
        "Category": " Political Science , American Government , General",
        "Publisher": "Overlook Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Eloise's Guide to Life",
        "Authors": "By Knight, Hilary (ILT) and Thompson, Kay",
        "Description": "Eloise shares her  favorite bon mots, from \"You absolutely cannot go anywhere in Paris without your map,\" to \"Sometimes I throw a temper fit. But not often,\" in a delightful how-to guide featuring six new drawings.",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Forbidden Truth: U.S.-Taliban Secret Oil Diplomacy, Saudi Arabia and the Failed Search for bin Laden",
        "Authors": "By Brisard, Jean-Charles, Dasquie, Guillaume, and Madsen, Wayne (FRW)",
        "Description": "Explores the United States' hidden interests in Afghanistan, reveals an intricate network of Saudi-based support for Osama bin Laden, and discusses the impact of U.S./Saudi relations upon the War on Terrorism.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Nation Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Java Examples in a Nutshell: A Tutorial Companion to Java in a Nutshell (In a Nutshell (O'Reilly))",
        "Authors": "By Flanagan, David",
        "Description": "Java Examples in a Nutshell is full of real-world Java programming  examples. The second edition of this bestselling book covers Java 1.3 and  contains 164 complete, practical programs: over 17,900 lines of densely  commented, professionally written Java code covering 20 distinct Java APIs,  including Servlets, JavaServer Pages, XML, Swing, and Java 2D. David Flanagan,  the author of Java in a Nutshell, has created an entire book of  programs that readers can learn from and modify for their own use.This book is a companion volume to Java in a Nutshell, Java  Foundation Classes in a Nutshell, and Java Enterprise in a  Nutshell. While those books are quick references at heart, they each  include accelerated tutorials on various Java topics. Java Examples in a  Nutshell picks up where those books leave off, serving up a suite of  example programs for novice Java programmers and experts alike. This book  doesn't hold readers' hands or supply detailed explanations of Java syntax or  method calls; it simply delivers well-commented working examples for exploring  the wide range of what's possible with Java. Each chapter concludes with  programming exercises that suggest avenues for building further knowledge.Java Examples in a Nutshell contains the following:Examples that demonstrate basic Java functionality and the essential  Java API's, including I/O, threads, networking, security, reflection,  serialization, and security.Programs that use the graphical user interface and graphics features  of Java, highlighting the Swing, Java 2D, printing, data transfer,  JavaBeans, and applet APIs.Examples that illustrate key enterprise APIs in Java, including  remote method invocation (RMI), database connectivity (JDBC), servlets,  JavaServer Pages (JSP), and XML.An example index that lets users look up a programming concept or  Java class and find any examples in the book that demonstrate that  concept or use that class.",
        "Category": " Computers , Programming Languages , Java",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Only Wine Book You'll Ever Need",
        "Authors": "By May, Danny and Sharpe, Andy",
        "Description": "Anyone who's ever walked into a wine store and found themselves befuddled by the myriad varieties and vintages available knows that choosing the right bottle of wine isn't easy. Fortunately, The Only Wine Book You'll Ever Need takes a simplified approach to this seemingly complicated topic.Whether looking to build your own personal wine cellar or to brush up on serving wine in social situations, you will learn:What makes a good wine goodWhy some wines are categorized by both region and varietyWhich flaws to watch for in winesHow to choose the right wine for the right occasion for the right priceHow to order and serve wine like an expertHow to pair wine with foodTeeming with 288 pages of valuable information and tips, this book is perfect for wine lovers who want to know what they are drinking.",
        "Category": " Cooking , Beverages , Alcoholic , Wine",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Just The Faq*s About God",
        "Authors": "By Anders, Max E.",
        "Description": "",
        "Category": " Religion , Biblical Reference , General",
        "Publisher": "Nelson Reference & Electronic Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Get The Fat Out: 501 Simple Ways to Cut the Fat in Any Diet",
        "Authors": "By Moran, Victoria",
        "Description": "More than five hundred simple tips on how to rid one's diet of fat explain how to reduce fat and cholesterol, providing advice from dieticians, nutritionists, doctors, and chefs on cooking without fat and furnishing guidelines on shopping and dining out. Original. 35,000 first printing.",
        "Category": "",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Global Reach: The Power of the Multinational Corporations",
        "Authors": "By Barnet, Richard J. and Muller, Ronald E.",
        "Description": "Describes and assesses the current operations and future plans of the global corporations and their managers, their crucial role in dominating the world economy, and their impact on individuals and governments",
        "Category": " Business & Economics , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1976"
        }
    },
    {
        "Title": "Mapping America's Past: A Historical Atlas (Henry Holt Reference Book)",
        "Authors": "By Garraty, John A., Carnes, Mark C., and Williams, Patrick",
        "Description": "Mapping America's Past brings a sweeping range of historical details into sharp focus. Rather than simply charting activity, it explores the issues and the influences that have formed this country over the centuries, clarifying our environmental, social, economic, demographic, political, and cultural development. Its themes are as intimate as they are far-reaching: from utopian communities, Prohibition, gender relations, and segregation to exploration, colonization, the slave trade, immigration, and the containment of communism.Each of the 120 spreads considers a historical debate or theme in comprehensive detail. Nearly 400 color maps, created specially for this volume, help to illustrate the abundant history of the United States, from pre-Columbian times to the present. With text by an acclaimed team of historians, and further enhanced by more than 120 paintings, engravings, and photographs that provide a visual commentary on the country's life and culture, Mapping America's Past is a vibrant and informative history that offers a truly new look at who Americans are.",
        "Category": " History , United States , General",
        "Publisher": "Henry Holt and Co.",
        "Price Starting With ($)": "6.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Louisville Slugger Presents: The Boston Red Sox (Louisville Slugger/1991 Collector's Edition)",
        "Authors": "By Lally, Dick",
        "Description": "An overview of the Boston Red Sox baseball team, discussing its players, history, last season, great moments, records, and prospects",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "The Scarlet Letter & the House of the Seven Gables",
        "Authors": "By Hawthorne, Nathaniel",
        "Description": "",
        "Category": " Literary Criticism , Reference",
        "Publisher": "Toby Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Cracking Da Vinci's Code: You've Read the Fiction, Now Read the Facts",
        "Authors": "By Jones, Peter and Garlow, James L.",
        "Description": "Examines the controversial assertions of \"The Da Vinci Code,\" arguing that many of them are based on inaccurate and unsupported claims that reveal a hidden agenda.",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Victor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Beating the Paycheck to Paycheck Blues",
        "Authors": "By Ventura, John",
        "Description": "Advice for managing personal finances includes using government programs, rebuilding credit, changing careers, making careful purchases, and creating a spending plan",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Dearborn Trade Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Ambroise Vollard Editeur: Prints, Books, Bronzes",
        "Authors": "By Una E. Johnson",
        "Description": "",
        "Category": "",
        "Publisher": "distributed by New York Graphic Society",
        "Price Starting With ($)": "25.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Hooked for Life",
        "Authors": "By Houston, Jimmy",
        "Description": "Forty million licensed fishermen in the U.S. can't be wrong: fishing is a national pastime! Fishing for fish and fishing for men have many parallels which are explored in this gift book aimed at anglers. And they can even read it . . . while fishing!",
        "Category": " Religion , Meditations",
        "Publisher": "J Countryman Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Blind Alley (Eve Duncan)",
        "Authors": "By Johansen, Iris",
        "Description": "The New York Times bestselling author of Firestorm, Iris Johansen, returns with a psychological thriller so terrifying, so relentlessly paced, it won’t leave you time to catch your breath before the next shock comes. A forensic sculptor is locked in a deadly duel with a serial killer determined to destroy her—one life at a time.Eve Duncan’s job is to put a face on the faceless victims of violent crimes. Her work not only comforts their survivors—but helps catch their killers. But there is another, more personal reason that Eve Duncan is driven to do the kind of work she does—a dark nightmare from a past she can never bury. And as she works on the skull of a newly discovered victim, that past is about to return all over again.The victim is a Jane Doe found murdered, her face erased beyond recognition. But whoever killed her wasn’t just trying to hide her identity. The plan was far more horrifying. For as the face forms under Eve’s skilled hands, she is about to get the shock of her life. The victim is someone she knows all too well. Someone who isn’t dead. Yet.Instantly Eve’s peaceful life is shattered. The sanctuary of the lakeside cottage she shares with Atlanta detective Joe Quinn and their adopted daughter Jane has been invaded by a killer who’s sent the grimmest of threats: the face of his next victim. To stop him, Eve must put her own life in the balance and question everything and everyone she trusts. Not even Quinn can go where Eve must go this time. As the trail of faceless bodies leads to a chilling revelation, Eve finds herself trying to catch a master murderer whose grisly work is a testament to a mind warped by perversion and revenge. Now she must pit her skills against his in a showdown where the stakes are life itself—and where the unbearable cost of failure will make Eve’s own murder seem like a mercy killing.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Market Shock",
        "Authors": "By Buchholz, Todd G.",
        "Description": "A stock market expert offers an up-to-the-minute handbook for weathering and even triumphing over potential economic or political upheavals, presenting ten possible disruptive scenarios, explaining their ramifications, and showing how to survive them. Tour.",
        "Category": " Business & Economics , Forecasting",
        "Publisher": "Harperbusiness",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Cauldron of Turmoil: America in the Middle East",
        "Authors": "By Rubin, Barry M.",
        "Description": "A history of America's tangled role in the Middle East traces the roots of the Persian Gulf War back to the oil boom days of the 1970s. By the author of Islamic Fundamentalism in Egyptian Politics.",
        "Category": " Political Science , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "How to Know God: The Soul's Journey into the Mystery of Mysteries",
        "Authors": "By Chopra, Deepak",
        "Description": "You don't have to believe in God in order to experience God.--- Deepak ChopraThe celebrated author of Ageless Body, Timeless Mind and The Seven Spiritual Laws of Success has written his most ambitious and important work yet, a runaway international bestseller that has inspired hundreds of thousands of readers to rethink their concept of God.According to Chopra, the brain is hardwired to know God. The human nervous system has seven biological responses that correspond to seven levels of divine experience. These are shaped not by any one religion (they are shared by all faiths), but by the brain's need to take an infinite, chaotic universe and find meaning in it. How to Know God describes the quest each of us is on, whether we realize it or not. For, as Chopra puts it, \"God is our highest instinct to know ourselves.\" This book makes a dramatic and enduring contribution to that knowledge.",
        "Category": " Religion , Spirituality",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "The Simple Truth",
        "Authors": "By Baldacci, David",
        "Description": "When cop-turned-attorney John Fiske comes to Washington to investigate his brother's murder, he unearths decades-old secrets and discovers the truth is anything but simple in this #1 New York Times bestselling thriller.It's never what it seems...Young attorney Michael Fiske broke the law when he took Rufus Harms's prison letter from the Supreme Court. But he also sealed his own fate. Suddenly everyone who has anything to do with Harms or his appeal mysteriously dies. Now Michael's brother John, a cop turned attorney, comes to Washington to find out why his brother was murdered--and what it had to do with a crime that Harms committed twenty-five years before. But the one man who can help John, the one man who knows what really happened more than two decades ago--and why--has escaped from prison and is running for his life.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Ultra goes to war: The first account of World War II's greatest secret based on official documents",
        "Authors": "By Lewin, Ronald",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The Passion",
        "Authors": "By Gibson, Mel (FRW)",
        "Description": "Mel Gibson's film The Passion of The Christ portrays the last twelve hours in the life of Christ - leading up to His crucifixition. In this companion book to the film, the movie's impact continues through the gripping still photographs taken on location during the actual filming. Accompanied by the biblical narrative from the Douay-Rheims Bible as well as Aramaic and Latin text, the drama unfolds rapidly and with searing realism.",
        "Category": " Photography , Techniques , Cinematography & Videography",
        "Publisher": "TAN Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "2015"
        }
    },
    {
        "Title": "The Canfield decision",
        "Authors": "By Agnew, Spiro T",
        "Description": "",
        "Category": "",
        "Publisher": "Playboy Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Readings About The Social Animal",
        "Authors": "By Aronson, Elliot (EDT)",
        "Description": "",
        "Category": " Psychology , Social Psychology",
        "Publisher": "Worth Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Clarence Thomas: A Biography",
        "Authors": "By Thomas, Andrew Peyton",
        "Description": "Andrew Thomas (no relation to Clarence, he's a lawyer and author) has written a massive biography of the controversial Supreme Court justice based on careful research that includes numerous interviews. The early life of the justice, the history of his family, his education, and, of course, the story of Anita Hill are each explored at length, with the final third of the book devoted to his Supreme Court career up to 2000.  The author provides a balanced view of Thomas, with a focus on the personal toll taken on him by his actions and the events of his life. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Biography & Autobiography , Lawyers & Judges",
        "Publisher": "Encounter Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Whittaker Chambers: A Biography",
        "Authors": "By Tanenhaus, Sam",
        "Description": "Featuring an exhaustive account of the Alger Hiss perjury case based on the latest research, a biography of Hiss's famed accuser traces Chambers's life from his years as a Soviet agent to his role in the postwar anti-communist movement. 35,000 first printing. $35,000 ad/promo.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Exercise physiology: Energy, nutrition, and human performance",
        "Authors": "By McArdle, William D., Katch, Frank I.",
        "Description": "",
        "Category": "",
        "Publisher": "Lea & Febiger",
        "Price Starting With ($)": "7.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Women in Espionage The role of female agents including the workings of Eastern and Western secret services, the latest...",
        "Authors": "By Hutton, J. Bernard",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan Co",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "The third truth",
        "Authors": "By Bar-Zohar, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Mary Baker Eddy: child of promise",
        "Authors": "By King, Marian",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Twins!",
        "Authors": "By Agnew, Connie L., M.D., Klein, Alan H., Ganon, Jill Alison, and Robert, Victor (ILT)",
        "Description": "The likelihood of giving birth to twins has shot up from one-in-90 to one-in-40 in recent years, thanks to the escalating use of fertility treatments and the advancing age of first-time mothers. Today, more than 100,000 multiple births take place annually, but despite this astonishing statistic, there hasn't been an authoritative reference that adequately focuses on the unique concerns of the parents until now.   Twins! gives parents comprehensive information on the physical, medical, emotional, and psychological issues involved in having twins. The first part of the book covers the pregnancy, birth, and postpartum experience, and discusses a broad range of twin-specific information such as the epidemiology of twinning, fetal and embryonic development, nutritional needs, and exercise. The second section covers the first year of life, discussing such topics as telling the twins apart, size and energy differences, and how to cope with the extra work.   Additional features include discussions with parents of twins, in which they share their experience on a variety of topics; sidebars filled with fascinating facts; a workbook for recording the pregnancies progress; and several appendices.",
        "Category": " Medical , Gynecology & Obstetrics",
        "Publisher": "HarperPb",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The IRS Problem Solver: From Audits to Assessments--How to Solve Your Tax Problems and Keep the IRS Off Your Back Forever",
        "Authors": "By Pilla, Daniel J.",
        "Description": "Are you burdened with the tax debt of a current or former spouse? Have you just received an IRS computerized or \"correction\" notice? Are you in danger of having your property seized? Has your tax return been selected for an audit?Is the IRS knocking on your door? If you've answered \"yes\" to any of these questions, you're not alone: more than twenty-five million taxpayers are faced with the terrifying prospect of dealing with audits, assessments, or other IRS problems every year. But with all the books devoted to how to prepare your taxes, there's never been one that explains how to get yourself out of trouble easily, legally, and inexpensively -- until now. With The IRS Problem Solver, veteran tax expert Dan Pilla offers the first comprehensive guide to dealing with the most common IRS problems taxpayers confront, from face-to-face audits to fraud penalties. Pilla's book is an indispensable preventive tool for all who file their own taxes—and a necessity for anyone who's just received a notice that the wolf is at the door.",
        "Category": " Business & Economics , Finance , General",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Laura Ingalls Wilder Country: The People and Places in Laura Ingalls Wilder's Life and Books",
        "Authors": "By anderson, william and Kelly, Leslie A. (PHT)",
        "Description": "Laura Ingalls Wilder Country takes the millions of fans of the Little House books and the hit TV series on an enchanting tour of the real world of the well-loved author, visiting the people and places who inspired her classic books. With hundreds of photos, many in full color, this memorabilia book makes a beautiful gift.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "HarperPerennial",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "The End of the Battle",
        "Authors": "By Waugh, Evelyn",
        "Description": "This is the third volume in the 'Sword of Honor' trilogy. The other volumes in this trilogy include: 'Men at Arms' and 'Officers and Gentlemen'.",
        "Category": " Fiction , Classics",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1979"
        }
    },
    {
        "Title": "Big Shoes: In Celebration of Dads and Fatherhood",
        "Authors": "By Roker, Al (EDT) and Rennert, Amy (EDT)",
        "Description": "From Al Roker and friends, a new book in celebration of Dad, just in time for Father's Day!Bestselling author and beloved Today show personality Al Roker teams up with his celebrity friends to share personal thoughts, stories, and reflections on fathers and fatherhood in this heartwarming collection.A dad is always there to provide support and encouragement just when it's needed most, as well as help teach us some of life's most invaluable lessons--from how to fly a kite and pitch a tent to how to change a tire, negotiate a raise, or take on our first big home improvement project. Now it's time to say thank you!In Big Shoes, Al Roker and 45 other well-known personalities share personal stories about how their fathers have been there for them during times of both adversity and triumph, and the countless large and small ways they've shaped their lives throughout the years. These essays remind us of the important--and lasting--legacy of our dads, even as we've grown up and gone on to start families of our own.A stellar group of contributors reflects on the importance of fathers and fatherhood, including:Matt Lauer Katie Couric Beau Bridges Bonnie Rait Kris Kristofferson Lemony Snicket (aka Daniel Handler) Bradley Whitford Robert Mondavi Dr. Dean Ornish B.D. Wong and many more!",
        "Category": " Family & Relationships , Parenting , Fatherhood",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Littlest Horse Thieves",
        "Authors": "By rosemary anne sisson",
        "Description": "",
        "Category": "",
        "Publisher": "POCKET",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1977"
        }
    },
    {
        "Title": "Good Grief",
        "Authors": "By Winston, Lolly",
        "Description": "In this \"funny, fresh, and utterly believable\" New York Times bestseller, a young woman struggles to build a new life after the death of her husband (Publishers Weekly). 36-year-old Sophie Stanton loses her young husband to cancer. In an age where women are expected to be high-achievers, Sophie desperately wants to be a good widow -- a graceful, composed Jackie Kennedy kind of widow. Alas, Sophie is more of a Jack Daniels kind. Downing cartons of ice cream for breakfast, breaking down in the produce section of supermarkets, showing up to work in her bathrobe and bunny slippers. Soon, she's not only lost her husband, but her job and her waistline as well. In a desperate attempt to reinvent her life, Sophie moves to Ashland, Oregon. But instead of the way it's depicted in the movies, with a rugged Sam Shepherd kind of guy finding her, Sophie finds herself in the middle of Lucy-and-Ethel madcap adventures with a darkly comic edge. Still, Sophie proves that with enough humor and chutzpah, it is possible to have life after loss.",
        "Category": " Fiction , Literary",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Congress V. the Supreme Court",
        "Authors": "By Cox, Archibald",
        "Description": "The appointment of Earl Warren as Chief Justice of the United States in 1953 marked the opening of a new era in the nation's constitutional development. As Mr. Cox points out in his Preface, during the next fifteen years the Supreme Court rewrote, with profound social consequences, major constitutional doctrines governing race relations, the administration of criminal justice, and the operation of the political process. The extent and the rapidity of these changes raise grave questions concerning the nature and function of constitutional adjudication and the proper role of the Supreme Court in the national life.In these lectures, originally given in somewhat shorter form in Honolulu in the summer of 1967 under the joint auspices of Harvard Law School and the University of Hawaii, Mr. Cox describes the main lines of constitutional development under the Warren Court. He analyzes the underlying pressures involved and the long-range institutional consequences in terms of the distribution of governmental power. The central theme of Mr. Cox's book is embodied in his examination of the American paradox that invests the judicial branch with the responsibility of deciding \"according to law\" our most pressing and divisive social, economic, and political questions.Although not uncritical of the grounds on which several of the court's crucial decisions have been reached, Mr. Cox comes to the conclusion that the trend of the rulings has been \"in keeping with the mainstream of American history--a bit progressive but also moderate, a bit humane but not sentimental, a bit idealistic but seldom doctrinaire, and in the long run essentially pragmatic--in short, in keeping with the true genius of our institutions.\"",
        "Category": " Political Science , General",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "6.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Family Romance of the Impostor Poet Thomas Chatterton",
        "Authors": "By Kaplan, Louise J.",
        "Description": "Recounts the life of Chatterton, the British poet and forger who ended his own life at seventeen, and attempts to analyze his complex personality",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Calvin: Baseball's Last Dinosaur : An Authorized Biography",
        "Authors": "By Kerr, Jon",
        "Description": "",
        "Category": " Biography & Autobiography , Sports",
        "Publisher": "Brown & Benchmark Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Simple Pleasures Of Tea",
        "Authors": "By Seton, Susannah",
        "Description": "Simple Pleasures of Tea offers wonderful ways to enjoy a range of teas  both herbal and black  along with easy recipes for delicious baked treats such as almond cookies, pumpkin bread, scones, and red velvet cake to accompany your teatime. With stories, quotations, recipes, and suggestions, this book will help even the busiest of us find repose and relief in a steaming cup of tea.Learn how to make tea naturally brewed by the sun, mull a cinnamon and nutmeg cider to coax yourself through the autumn months, discover herbal infusions for your health, create a morning ritual with tea to give all your days the peaceful beginnings they deserve.Drink, eat, and pamper yourself to your heart's content. And discover other creative uses for tea  giving your plants a cup of tea for nourishment, for example, or treating yourself to a steaming tea facial.",
        "Category": " Cooking , Beverages , Coffee & Tea",
        "Publisher": "Conari Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Beyond the Numbers: A Reader on Population, Consumption and the Environment",
        "Authors": "By Mazur, Laurie Ann (EDT)",
        "Description": "",
        "Category": " Science , Environmental Science",
        "Publisher": "Island Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Managing Yourself: How to Control Emotion, Stress, and Time (Skills for success)",
        "Authors": "By Goodloe, Alfred",
        "Description": "Tells how to handle stress, anger, fear, distrust, envy, and guilt in the workplace, and includes advice on relaxation and time management",
        "Category": " Business & Economics , General",
        "Publisher": "Franklin Watts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "Plants in Landscape: Heredity & Envr",
        "Authors": "By Philip L Carpenter, Theodore D Walker",
        "Description": "",
        "Category": "",
        "Publisher": "W.H. Freeman & Company",
        "Price Starting With ($)": "43.95",
        "Publish Date": {
            "Month": "May",
            "Year": "1975"
        }
    },
    {
        "Title": "Saints : Their Cults and Origins",
        "Authors": "By Williams, Caroline",
        "Description": "Brief descriptions of the lives of Catholic saints are accompanied by depictions in paintings and sculpture of their martyrdom or ministry",
        "Category": " Religion , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1980"
        }
    },
    {
        "Title": "12 Secrets to Finding Love & Commitment",
        "Authors": "By Ullman, Jeffrey",
        "Description": "The creator of a highly successful video-dating service offers proven techniques for finding lasting love, including being realistic about dating opportunities, making connections, and understanding what the opposite sex is really looking for. Original. 35,000 first printing. Tour.",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Axis",
        "Authors": "By Irving, Clive",
        "Description": "",
        "Category": "",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Growing a Girl: Seven Strategies for Raising a Strong, Spirited Daughter",
        "Authors": "By MacKoff, Barbara",
        "Description": "“Mackoff’s strategies for enhancing girls’ self-esteem and creating equal opportunity are clear, practical, and most important, achievable.”—Peggy Orenstein, author of School Girls: Young Women, Self-Esteem, and the Confidence Gap   “IS THAT YOUR DAUGHTER? ISN’T SHE PRETTY?”   Like parents of girls everywhere, psychologist Barbara Mackoff often heard her young daughter Hannah dismissed with those words. So often that she started to reply: “And she’s smart too.” Hoping to counter the culture that she feared would stereotype her daughter and diminish her confidence, Dr. Mackoff spent three years searching for strategies to nurture Hannah’s growing sense of self. The result is Growing a Girl.   Offering hundreds of specific suggestions and tools for fostering a daughter’s independence and individuality, Growing a Girl encourages parents to act now by exploring seven practical paths. Based on clinical research and Dr. Mackoff’s highly acclaimed Growing a Girl workshop, this extraordinary book offers parents the skills to shatter stereotypes that can stunt a daughter’s growth while giving her the tools to nourish her strength, spirit, and capacity to care.   YOU WILL DISCOVER: • How gender stereotyping starts at birth—and how you can prevent it • Why she can wear a velvet dress to the ballet and still climb to the treetops • What to do about Barbie dolls and traditional fairy tales—without spoiling your daughter’s fun • How to discover and honor her feelings • How to counteract our culture’s emphasis on physical beauty • How to bring home heroines—in books, magazines, movies, and in her community • How to recognize and strengthen your daughter’s learning style—and build on her natural interesting science and math • And more.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Zen and the Art of Making a Living: A Practical Guide to Creative Career Design",
        "Authors": "By Boldt, Laurence G.",
        "Description": "An inventive and down-to-earth career guide, featuring 120 easy-to-use worksheets, proposes a new vision of work, helping people recognize what they really want to do and offering practical suggestions for finding that work. Reprint. 35,000 first printing.",
        "Category": " Religion , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Daniel: Book for Troubling Times (Spiritual Commentaries)",
        "Authors": "By Di Lella, Alexander A.",
        "Description": "",
        "Category": " Religion , Biblical Commentary , Old Testament",
        "Publisher": "New City Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Leadership Through the Ages: a Collection of Favorite Quotations",
        "Authors": "By Rudolph W. Giuliani",
        "Description": "",
        "Category": "",
        "Publisher": "Miramax Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Howard Dean In His Own Words",
        "Authors": "By Dean, Howard and Rogak, Lisa (EDT)",
        "Description": "\"Has anyone really stood up against George Bush and his policies? Don't you think it's time somebody did?\"As the 2004 election shifts into primary overdrive, the one candidate who is getting the most ink and air time is former Vermont Governor Howard Dean. His fundraising has skyrocketed past his Democratic opponents and almost a quarter-million people from all fifty states have signed up to volunteer for his campaign.To say Howard Dean is outspoken is something of an understatement. But what is Dean really saying? And why does the media -- and the other Democratic candidates as well as Republicans -- constantly try to paint Dean as an extreme liberal? Howard Dean In His Own Words clearly states the governor's opinions on over 100 issues, from the military to the environment to education. A valuable primer for the politically curious to the most ardent Dean blogger, Howard Dean In His Own Words captures the voice and intellect of one of America's most fascinating political figures.Howard Dean on How to Win the Election:\"The way to beat this president is not to be like him. We have to stand up and give the 50 percent of Americans who don't vote a reason to vote.\"Howard Dean on the Democratic Party:\"When I say that a lot of Democrats are more mad at the Democrats than at the Republicans, I get a lot of nods.\"Howard Dean on Education:\"The single most important factor in how a child learns has less to do with the quality of the building, the computers or even the teachers. The most important predictor is the attitude in that child's home toward education. We must involve the parents again.\"Howard Dean on Being Called a Liberal:\"I think it's pathetic that I'm considered the left-wing liberal. It shows just how far to the right this country has lurched.\"",
        "Category": " Political Science , American Government , National",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "All lie in wait",
        "Authors": "By William Samelson",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "HITTING HOME The Great Depression in Town and Country.",
        "Authors": "By Sternsher, Bernard (editor)",
        "Description": "",
        "Category": "",
        "Publisher": "Quadrangle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Main Streets",
        "Authors": "By Jacobs, Timothy",
        "Description": "",
        "Category": "",
        "Publisher": "Siena Publishers Assoc",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "The World's Greatest Christmas Stories",
        "Authors": "By Eric Posselt",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1950"
        }
    },
    {
        "Title": "The Ghost Writer",
        "Authors": "By Harwood, John",
        "Description": "A tantalizing tale of suspense and family secrets that weaves Victorian ghost stories into the present—where they start to come true Timid, solitary librarian Gerard Freeman lives for just two things: his elusive pen pal Alice and a story he found hidden in his mother’s drawer years ago. Written by his great-grandmother Viola, it hints at his mother&#39;s role in a sinister crime. And as he discovers more of Viola’s chilling tales, he realizes that they might hold the key to finding Alice and unveiling his family&#39;s mystery—or will they bring him the untimely death they seem to foretell? Harwood’s astonishing, assured debut shows us just how dangerous family skeletons—and stories—can be.",
        "Category": " Fiction , Literary",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Lost Lake",
        "Authors": "By Margolin, Phillip",
        "Description": "It's a beautiful summer night in Portland, Oregon.Ami Vergano, a young attorney and single mother, arrives at her son Ryan's Little League game with their tenant and new friend, Dan Morelli. When the assistant coach calls in sick, Morelli seems happy to help out. But then one player roughly blocks another, and a fight erupts. Before the game ends, Ami witnesses violence that shocks and horrifies her and makes her question everything she thought she knew about Morelli.On the other side of the continent, in a cheap motel room in Washington, D.C., ex-mental patient Vanessa Kohler, a reporter for Exposed, a tabloid that specializes in alien-abduction stories, watches a piece on television about the Little League massacre and quickly places a call to the FBI. For years she's been telling anyone who will listen about a vast government conspiracy to conceal a secret military unit headed by Gen. Morris Wingate, a presidential candidate, and for years every-one has dismissed her stories. But when Vanessa sees Dan Morelli fighting, she believes she's found the key to proving that her theories are true.Vanessa hires Ami Vergano to represent Morelli, who is charged with attempted murder, and Ami is drawn into Vanessa's paranoid world. Are Vanessa, a former mental patient, and Morelli, a confessed mass murderer, telling the truth about one of the nation's most respected soldiers and politicians? Or are their charges a product of two sick minds? Ami has to decide who -- and what -- to believe, in Phillip Margolin's most exciting and surprising thriller since his breakout bestseller, Gone, But Not Forgotten.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Adult Psychopathology: A Social Work Perspective",
        "Authors": "By Turner, Francis J. (EDT)",
        "Description": "When Adult Psychopathology: A Social Work Perspective was first published in 1984, this pioneering text was the first to conceptualize and organize theory and practice about the treatment of the mentally ill within their families and communities from a social work perspective. Now, in response to new developments in theory and research, as well as changes in service delivery within the field, the second edition contains updated and accessible information on how mental illnesses develop and how they can be treated within a social work framework that recognizes the importance of family, economics, and culture as well as biochemical and psychodynamic factors. Each chapter is written by the leading social work authority on that subject and includes practical, in-depth discussion of state-of-the-art technologies, treatments, and research.",
        "Category": " Social Science , Human Services",
        "Publisher": "Free Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    }
]