[
    {
        "Title": "Hope Matters: The Untold Story of How Faith Works in America",
        "Authors": "By Calhoun, John A.",
        "Description": "Mary Gonzales strolls the streets of Chicago's meatpacking district every evening, keeping a watchful eye over \"her\" neighborhood kids. Tony Ortiz encourages young men in California state prisons to break free of the brutal gang life he once knew all too well. Joe Hynes, Brooklyn's district attorney, champions women and children, not wanting them to suffer as he suffered.They, and the twenty-one other amazing people interviewed by Jack Calhoun, are reshaping lives and communities across America. They include Christians of every denomination, Muslims, Jews, and others, some who pray five times a day and some who are, frankly, \"not that religious.\"But each tells Calhoun, there's much more to the story.You may have heard of some of these Americans. Several are in the news. The good words of all shine brightly in their communities. What you haven't heard about is the underlying force, the hidden source of their seemingly endless energy and selflessness.It is faith -- a deep and, in some cases, unsuspected spirituality. They have the unshakable sense that they work not only for their organizations -- and each individual they encounter -- but especially for God.Calhoun was once an eager divinity school student, hungry to make a difference. Through the years he rose to national prominence in the field of public policy, spending twenty-plus years as the founding president of the National Crime Prevention Council. However, something wasn't right. Caught up in a parade of committee meetings, speaking engagements, and policy and program initiatives, he had lost touch with the bedrock of his vocation. It took an encounter with an unusually clear-sighted volunteer to reconnect his daily work to his faith in God.Reinvigorated, Calhoun embarked on a two-year cross-country quest to find out how faith motivates some of America's hardest-working public servants. They pursue a range of innovative and ambitious plans to help their communities, and their accomplishments are impressive. But just try telling them so.They have been chosen, they'll explain, to fulfill a larger purpose. Their paths have been rocky, their burdens heavy, and the work hasn't always been fun. Yet they feel blessed, emboldened by their trust in a higher power to live lives of acceptance and unbounded love.Some recent books have laid divisiveness and hostility at faith's door. \"Hope Matters\" brings to light the togetherness and reconciliation that faith truly engender when good people heed its call to action.You won't hear Mary, Tony, Joe or the rest preaching from the pulpit, or even in the streets. They have no sermon or script to follow. There is a ministry of open arms and second chances, of waking up each morning with new challenges and going to bed each night with renewed faith. Their stories just might inspire you to make your own \"place of worship\" a little bigger.",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Bartleby Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "On the Farm (Bright Baby Touch and Feel)",
        "Authors": "By Priddy Bicknell Books (COR)",
        "Description": "This charming board book featuring adorable farm animals is perfect for the youngest readers! Featuring a different texture on each page, this adorable book will stimulate your child's senses and encourage their imagination.",
        "Category": " Juvenile Nonfiction , Animals , Farm Animals",
        "Publisher": "Priddy Books US",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Minute Mysteries 2: More Stories to Solve (American Girl Mysteries)",
        "Authors": "By Taylor, Dahl (ILT), Graef, Renee (ILT), Andreasen, Dan, Skeen, Keith (ILT), Hirsch, Jennifer, and Wikowski, Teri",
        "Description": "Characters from the American Girl books are featured in eleven short stories with mysteries, puzzles, and riddles for the reader to solve. Original. 40,000 first printing.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "American Girl",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "A Made-Over Chelsea (Best Friends, Book 7)",
        "Authors": "By Stahl, Hilda",
        "Description": "",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "Crossway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Just Cookies Cookbook (Christmas at Home)",
        "Authors": "By Hake, Cathy Marie and Boone, Deborah",
        "Description": "This festive, \"wintry\" collection of cookie recipes features ideas for everything from traditional Christmas cutouts to unique meringues and jar mixes-all perfect for gift giving.",
        "Category": " Cooking , Courses & Dishes , Cookies",
        "Publisher": "Barbour Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "The Supernova Story",
        "Authors": "By Marschall, Laurence A.",
        "Description": "Tells the story of the supernova of 1987, looks at supernovas of the past, and explains why stars explode",
        "Category": " Science , Astronomy",
        "Publisher": "Plenum",
        "Price Starting With ($)": "26.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "The Bridesmaid Handbook",
        "Authors": "By Naylor, Sharon",
        "Description": "The ultimate guide to being a great bridesmaid, helping you focus on what you need to do, when to do it, and how to be both economical and fulfill the bride's wishes at the same time.This comprehensive handbook includes:--What needs to be on your To-Do List: the responsibilities of bridesmaids--Guidelines on how much time and money you can expect to spend--How to look fabulous on the wedding day--Influencing the choice of bridesmaids' dresses--What to do about bridal showers, engagement parties, bachelorette bashes and other parties--Ceremony etiquette, what to give the bride & groom, the rehearsal and rehearsal dinner--Running interference and otherwise saving the bride's day",
        "Category": " Reference , Weddings",
        "Publisher": "Sourcebooks Casablanca",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Cockatoos: Acclimation, Care, Feeding, Sickness, and Breeding (English and German Edition)",
        "Authors": "By Lantermann, Werner and Lantermann, Susanne",
        "Description": "Details the feeding, behavior, health, breeding, and care of cockatoos",
        "Category": " Nature , General",
        "Publisher": "B E S Pub Co",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Light at the End of the Tunnel: A Vietnam War Anthology",
        "Authors": "By Rotter, Andrew Jon (EDT)",
        "Description": "This updated and revised edition of Light at the End of the Tunnel is an exhaustive account of the Vietnam War that gives a total overview of the conflict. Starting with Ho Chi Minh's revolt against the French, Andrew Rotter takes the reader through the succeeding years as scholars, government officials, journalists, and others recount the important events and examine issues that developed during this tumultuous time. This book is essential for anyone who has an interest in truly understanding the Vietnam War. These readings will both educate and entertain students about this turning point in the history of the United States and, indeed, the world.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Rowman & Littlefield Publishers",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Pug Handbook (Barron's Pet Handbooks)",
        "Authors": "By Belmonte, Brenda and Earle-Bridges, Michele (PHT)",
        "Description": "In spite of its rough appearance, the Pug is a very friendly dog, good with children, and easy to groom. In general, it's a fine companion for dog lovers. Titles in the Pet Handbooks series are filled with detailed pet-care advice and feature vivid color photos as well as instructive line art. All Barron's Pet Handbooks are written by experienced breeders, trainers, and veterinarians. They focus on all major aspects of owning and caring for a pet, including acquiring, proper feeding, housing, health care, breeding, and where applicable, training, exercise, and grooming.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Lost Sock!: 200 Clever Ways to Use Your Single Socks",
        "Authors": "By Copeland, Cynthia L. and Lewis, Anya",
        "Description": "It’s something we all can relate to: you open the dryer, match up your socks…and inevitably a few have mysteriously vanished into thin air. Where have they gone? We don’t know. But now once-happy pairs have become sad “singletons” with no purpose. Now, Cynthia Copeland—whose books regularly break sales records—comes to the rescue with a little gem of a book that gives new meaning to those left-behinds. Filled with Cynthia’s wonderful light-hearted illustrations, it contains 200 surprising, clever, and fun uses for the remaining sock, along with humorous insights into where all these missing ones may have washed off to. This will be a welcome gift book for anyone who’s ever done a load of laundry.",
        "Category": " Humor , General",
        "Publisher": "Cider Mills Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Fun at Home With Dian Thomas",
        "Authors": "By Thomas, Dian",
        "Description": "Provides instructions for craft projects for holidays, parties, special occasions, and items to amuse children, and includes suggestions for family activities",
        "Category": " Family & Relationships , General",
        "Publisher": "Dian Thomas Communications",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "The Constitution in Exile: How The Federal Government Has Seized Power By Rewriting the Supreme Law of the Land",
        "Authors": "By Napolitano, Andrew P.",
        "Description": "What ever happened to our inalienable rights?The Constitution was once the bedrock of our country, an unpretentious parchment that boldly established the God-given rights and freedoms of America. Today that parchment has been shred to ribbons, explains Fox News senior judicial analyst Judge Andrew P. Napolitano, as the federal government trounces state and individual rights and expands its reach far beyond what the Framers intended.An important follow-up to Judge Napolitano's best-selling Constitutional Chaos, this book shows with no-nonsense clarity how Congress has \"purchased\" regulations by bribing states and explains how the Supreme Court has devised historically inaccurate, logically inconsistent, and even laughable justifications to approve what Congress has done.It's an exciting excursion into the dark corners of the law, showing how do-gooders, busybodies, and control freaks in government disregard the limitations imposed upon Congress by the Constitution and enact laws, illegal and unnatural, in virtually every area of human endeavor. Advance Praise for The Constitution in Exile from Left, Right, and Center\"Does anyone understand the vision of America's founding fathers? The courts and Congress apparently don't have a clue. But Judge Andrew P. Napolitano does, and so will you, if you readThe Constitution in Exile.\"-BILL O'REILLY \"Whatever happened to states rights, limited government, and natural law? Judge Napolitano, in his own inimitable style, takes us on a fascinating tour of the destruction of constitutional government. If you want to know how the federal government got so big and fat, read this book. Agree or disagree, this book will make you think.\"-SEAN HANNITY\"In all of the American media, Judge Andrew P. Napolitano is the most persistent, uncompromising guardian of both the letter and the spirit of the Constitution, very much including the Bill of Rights. Increasingly, our Constitution is in clear and present danger. Judge Napolitano-in The Constitution in Exile-has challenged all Americans across party lines to learn the extent of this constitutional crisis.\"-NAT HENTOFF\"Judge Napolitano engages here in what I do every day on my program-make you think. There's no question that potential Supreme Court nominees and what our Constitution says and doesn't say played a major role for many voters in our last couple of elections. What the judge does here is detail why the federal government claims it can regulate as well as tax everything in sight as it grows and grows. Agree or disagree with him-you need to read his latest book, think, and begin to arm yourself as you enter this important debate.\"-RUSH LIMBAUGH\"At a time when we are, in Benjamin Franklin's words, sacrificing essential liberty to purchase a little temporary safety, here comes the judge with what should be mandatory reading for the executive branch cronies who are busy stealing power while they think we're not watching. Thank goodness the judge is watching and speaking truth to power. More than a book, this is an emergency call to philosophical arms, one we must heed before it's too late.\"-ALAN COLMES",
        "Category": " Political Science , American Government , General",
        "Publisher": "Nelson Current",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "No Walls Between Us (CLOSE TO HOME)",
        "Authors": "By NAOMI HORTON",
        "Description": "",
        "Category": "",
        "Publisher": "Silhouette Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Meg Mackintosh and the Mystery at Camp Creepy - title #4: A Solve-It-Yourself Mystery (4) (Meg Mackintosh Mystery series)",
        "Authors": "By Landon, Lucinda",
        "Description": "While attending summer camp for the first time, Meg tries to solve the mystery of the camp's legendary ghost. The reader is challenged to interpret each clue before Meg finds the solution.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Secret Passage Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Black Beauty My First Classics",
        "Authors": "By Sewell, Anna and Marsh, Laura F.",
        "Description": "A horse never knows what his next adventure will be. . . .  When Black Beauty is a young colt, he is surrounded by gentle care and comfort. As he is sold to a series of owners, including a squire, an earl, and a cab driver, he discovers that while some people are kind, others are equally as cruel. This is a horse's story of strength and spirit, as shown through his own eyes.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Charming Ponies: A Perfect Pony",
        "Authors": "By Szymanski, Lois K.",
        "Description": "A PERFECT PONY It's the most exciting day of Niki's life! She's saved up enough money to buy her very own pony and today is the day of the pony auction. She could take home a magnificent pinto or a proud Thoroughbred, but she sets her heart on a beautiful white mare instead.  When a little black horse with big sad eyes distracts Niki from the mare of her dreams, will she miss the chance to own the perfect pony?",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Festival",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Learn Art in One Year",
        "Authors": "By Girard, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Avenel Books",
        "Price Starting With ($)": "25.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "The Great Depression (Cornerstones of Freedom Second Series)",
        "Authors": "By Stein, R. Conrad",
        "Description": "Describes the 1929 stock market crash and the events and effects of the depression that followed, including the New Deal programs intended to restore the economy",
        "Category": " Juvenile Nonfiction , History , United States , 20th Century",
        "Publisher": "Childrens Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Photography Guide For Kids",
        "Authors": "By Johnson, Neil",
        "Description": "Combining his own photos with simple diagrams, easy-to-read text, and striking images from National Geographic photographers, the author teaches youngsters how to think like a photographer and get the kinds of pictures they want. Simultaneous.",
        "Category": " Juvenile Nonfiction , Technology , How Things Work-Are Made",
        "Publisher": "National Geographic Children's Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Apollo 11 (Cornerstones of Freedom Second Series)",
        "Authors": "By Stein, R. Conrad",
        "Description": "Surveys the various Apollo spaceflights that marked America's attempts to put a man on the moon, with an emphasis on the 1969 Apollo 11 project culminating in the first landing",
        "Category": " Juvenile Nonfiction , History , United States , 20th Century",
        "Publisher": "Childrens Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "The Gettysburg Address (Cornerstones of Freedom Second Series)",
        "Authors": "By Richards, Kenneth G",
        "Description": "Traces the events which led to the Battle of Gettysburg in 1864 and describes the dedication of the cemetery to the fallen soldiers by Lincoln in his famous speech",
        "Category": " Juvenile Nonfiction , History , United States , 19th Century",
        "Publisher": "Childrens Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The Story of the Vietnam Veterans Memorial (Cornerstones of Freedom)",
        "Authors": "By Wright, David K.",
        "Description": "",
        "Category": "",
        "Publisher": "Childrens Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Lifetime Guide to Business Writing & Speaking",
        "Authors": "By Griffin, Jack",
        "Description": "In today's increasingly specialized and competitive business world, the ability to communicate creatively and persuasively is a crucial job skill. Now there's a comprehensive guide packed with powerful writing and speaking techniques and ready-to-use models to help you communicate better in any situation. Whether you need to respond to a customer complaint ... write a winning sales proposal ... speak up to your boss ... or make an entertaining speech, you'll find everything you need in Lifetime Guide to Business Writing and Speaking.Written by an expert on business communications, this practical guide gives you all the tools you need to gather support for your ideas, resolve conflicts, and project an aura of authority and confidence in all your on-the-job interactions. You'll find a wealth of practical, real-world advice; business-tested examples; and hundreds of ready-to-use model letters, memos, and checklists for expressing yourself clearly, concisely, and effectively.For example, discover exactly what to say or what to write the next time you have to draw up an ironclad contract; generate a results-getting \"cold call\" letter; make a strong presentation to a prospective client; write letters of congratulations, sympathy, or reprimand; speak to customers with confidence; collect on a delinquent account; deal with the press and the media; clarify company policy; revive an inactive client; and prospect for new business.No matter what the situation, from planning a knock 'em dead sales presentation ... to writing a disciplinary memo to one of your staff ... here's your one-stop reference to creating business communications that get results.",
        "Category": " Business & Economics , Business Communication , General",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "D-Day (Cornerstones of Freedom)",
        "Authors": "By Stein, R. Conrad",
        "Description": "Describes the events of the Allied landing on the beaches of Normandy on June 6, 1944, the largest amphibious invasion ever attempted.",
        "Category": "",
        "Publisher": "Childrens Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "India : A Million Mutinies Now",
        "Authors": "By Naipaul, V. S.",
        "Description": "An account of a journey around India. Using interviews with people from many different walks of life, this book builds an oral history of a country constantly on the move.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Random House of Canada, Limited",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Concise Oxford Dictionary of Literary Terms (Oxford Paperback Reference)",
        "Authors": "By Baldick, Chris",
        "Description": "This dictionary provides succinct and often witty explanations of over one thousand potentially troublesome terms encountered in the study of literature, from absurd to zeugma, from the ancient dithyramb to the contemporary dub poetry, from the popular bodice-ripper to the aristocratic masque.  While it is fully up to date with the terminologies of deconstruction and other modern schools of literary theory, it also offers extensive coverage of traditional drama, versification, rhetoric, and literary history.  Literary schools from Alexandrianism to Transcendentalism are included, along with dozens of terms from languages other than English.  Adjectival forms and other derived words are displayed, and simple pronunciation guides are given for over two hundred difficult terms, making this thoroughly cross-referenced dictionary the most helpful of its kind for all readers of literature.",
        "Category": " Social Science , Penology",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "F U, Penguin: Telling Cute Animals What's What",
        "Authors": "By Gasteier, Matthew",
        "Description": "Perfect for the Scrooge in your life—a profane, hilarious takedown of all things cute and cuddly, by the author of the blog sensation of (almost) the same nameAttention, all you clumsy pandas, lovable puffins, huggable bunnies, and penguins  that elicit ooohs and aaahs: The jig is up! We have lived under your furry fists  for too long. There is a cute and present danger lurking out there–in the wild,  in the zoos, and sometimes even in our very own homes. Spurred on by the Cute Industrial  Complex, these cuddly animals have taken over blockbuster films, inspirational posters,  and computer desktops everywhere, further weakening the innocent civilians who are  beguiled by these fuzzy frauds. But you are stronger than them, aren’t you? Those  soft bellies and wet noses are no match for you–and their free ride has just come  to an end.  F U, Penguin is the rallying cry for those who choose to fight these  power-hungry cute-mongers. Loaded with color photographs and hilarious commentary,  this book will have you laughing out loud while it simultaneously saves you from  the tragic fate of tossing yarn with big-eyed kittens and bottle-nursing baby pandas  forever. ___________________________ \"Finally, a book for the rest of us! Most  animals go about our business without playing to the audience like the elitists exposed  in these chapters.I wasn't sure how many more times I could hear about those great  penguins and pandas and kittens before I started eating people... well, more people,  anyway.\"—Jerry the Shark \"Penguins killed my parents, and they would not hesitate  to kill me. I thank the Crustacean God for Matthew Gasteier, a true saint and a decent  human being in a world filled with heartless penguin accomplices.\"—Dennis the Krill \"It's all true. We're the worst.\"—Anonymous Penguin \"The average dolphin is far  beyond this level of vulgarity, but I could see how this would be a very enjoyable  book for humans. I should remember to hand these out to some of my slower relatives  at the common ancestor reunion.\"—Edward the Dolphin \"Thank you for your submission.  Unfortunately, this style of book is not something we are currently looking for.  However, we wish you the best of luck with your human publishers!\"—Danielle the Bear,  Editor-in-Chief, Random Cave Publishing",
        "Category": " Humor , Topic , Animals",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "An Empty Cradle, a Full Heart: Reflections for Mothers and Fathers after Miscarriage, Stillbirth, or Infant Death",
        "Authors": "By Tickle, Phyllis (FRW) and Lafser, Christine O'Keeffe",
        "Description": "“Bereavement after the loss of a baby is often quiet and lonely,” writes  Christine O’Keeffe Lafser, who has twice lost a child to death. “There is no  wake or funeral, no grave site, no memorial to our baby’s life or death. . . .  Since there are no real memories of our little one’s life, people have a hard  time comprehending the depth of our love and grief.” In these reflections,  Lafser offers grieving parents the empathy and courage that can come only from  one who has walked the same difficult path.“Chris expressed so many of my thoughts and feelings and made me feel  so normal. . . . The greatest gift is learning that God does not desert us in  our time of need.”Linda Davis, Compassionate Friends, after miscarriage and  stillbirth“The juxtaposition of a Scripture text with each reflection is  inspired. Some of the texts are breathtaking in their beauty and  appropriateness. This book is a ‘must’ for anyone who is ever touched by the  loss of an infant.”Joseph Awad, poet and grieving grandfather“This book will be very helpful for parents who are mourning the loss  of their child. It will also prove very beneficial to anyone who is ministering  to a bereaved parent.”Robert N. Craig, O.F.M. Cap., hospital chaplain“These reflections allowed me to ‘be’ how I was feeling—not feel like I  should be going through the stages of grief that other books described. With  this book I was no longer a square peg trying to fit into a round  hole.”Jeanette Siebels, after infant death",
        "Category": " Family & Relationships , Death, Grief, Bereavement",
        "Publisher": "Loyola Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Just for Kids (31 Daily Devotions, Honesty)",
        "Authors": "By Scriptures taken from different versions",
        "Description": "",
        "Category": "",
        "Publisher": "Family Christian Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "War Season (Super Bolan #74) (Mack Bolan)",
        "Authors": "By Pendleton, Don",
        "Description": "When hundreds of innocent civilians are killed in Philadelphia by terrorists using a prototype superweapon called the Annihilator, Mac Bolan is called in to track down a renegade arms dealer with ties to Iranian terrorists, whose base is hidden deep in the Brazilian jungle. Original.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Gold Eagle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Stony Man: Vector Three",
        "Authors": "By Pendleton, Don",
        "Description": "When Libya's most brutal and feared killers decide wreak havoc upon the world, the Stony Man force must journey to the heart of Africa to put an end to to their threats of world annihilation. Original.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Gold Eagle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "The Best Christmas Ever",
        "Authors": "By Bagwell, Stella",
        "Description": "Returning home to attend his brother's Christmas wedding, military man and confirmed bachelor Nick Gallagher finds himself distracted by his parent's gorgeous new neighbor, Allison Lee, who is distrustful of men, especially of him. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette Reader's Choice",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "CEO of YOU (The Chief Energizing Officer of Your Own Uniqueness): Discover the Emotional Reality of Success",
        "Authors": "By Sue, Marsha Petrie",
        "Description": "",
        "Category": " Business & Economics , Motivational",
        "Publisher": "Communicating Results Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Overflow A Student's Guide To Giving [Paperback]",
        "Authors": "By Gibbons, Scotty",
        "Description": "",
        "Category": "",
        "Publisher": "Onward Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Discovering Your Natural Talents; How to Love What You Do and Do What You Love",
        "Authors": "By Bradley, John",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Navpress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Incredible Illustrations: News You Can Use in Your Ministry",
        "Authors": "By Keefer, Mikal",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Group Pub Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Weaving Faith and Family...When You Are Hanging On By a Thread",
        "Authors": "By Marx, Eileen",
        "Description": "",
        "Category": " Family & Relationships , Conflict Resolution",
        "Publisher": "Ave Maria Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The Law And Miss Hardisson",
        "Authors": "By Banning, Lynna",
        "Description": "The Law And Miss Hardisson by Lynna Banning released on Oct 25, 2000 is available now for purchase.",
        "Category": " Fiction , General",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "How to Murder Your Wife",
        "Authors": "By Williams, Henry",
        "Description": "",
        "Category": "",
        "Publisher": "Dell 3921",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Bandit: Dossier of a Dangerous Dog",
        "Authors": "By Hearne, Vicki",
        "Description": "Describes the legal battle that insued when the state of Connecticut tried to execute a pit bull named Bandit--the beloved pet of Lamon Redd",
        "Category": " Pets , Dogs , General",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Ridiculous Packaging: Or, my long strange journey from atheist to Episcopalian in two acts",
        "Authors": "By Favreau, Karen",
        "Description": "Offering a humorous, non-preachy, and heartfelt memoir, the author attempts to decipher why a cynical, thirty-three year old atheist would open her heart and accept God's love after having spent an entire lifetime running away from him.",
        "Category": " Religion , Christianity , Episcopalian",
        "Publisher": "Cowley Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "China and Our Selves",
        "Authors": "By Douglas, Bruce",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Just Horses: Living With Horses in America (Half Pint Series)",
        "Authors": "By Bryan, Denver and Page, Margot",
        "Description": "",
        "Category": " Photography , Subjects & Themes , Plants & Animals",
        "Publisher": "Willow Creek Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Why Do Cats Always Land on Their Feet?: 101 of the Most Perplexing Questions Answered About Feline Unfathomables, Medical Mysteries and Befuddling Behaviors",
        "Authors": "By Becker, Marty and Spadafori, Gina",
        "Description": "Is My Cat Crazy?If only it were that simple! But the fact is that your cat is very sensible indeed—about cat things. She knows how to scratch upright surfaces, cough up hairballs, send messages with her pee, and party all night. To the feline mind, these are the stuff of everyday life—as important as sleeping all day and grooming for several hours using nothing but your tongue.Your clever kitty knows you very well (after all, she sits and stares at you when you're in the bathroom). But how well do you know her? Find out why cats knead against us, the best way to hold a cat, how cats can jump onto your kitchen counters without even a running start, why they chew on your sweaters.Award-winning pet experts Dr. Marty Becker and Gina Spadafori explain the ins and outs of the feline psyche. Because the better you understand cats, the easier it is to love the kitty on your couch. Can you teach an old cat new tricks? You bet! Expecting a baby? It's perfectly okay to keep your cat. What about kittens? You'll find everything you always wanted to know about feline sex but were afraid to ask.Your cat's not crazy, but she can be mysterious. Did you know cats can tell time? They talk with their tails and walk on their toes. And there are even rumors that some cats are descendents of space aliens. It's no wonder the ancient Egyptians were not the only ones who worshipped them.You'll also find the answers to questions that tend to tickle your curiosity: Why do cats' eyes glow in the dark? What's in catnip that makes kitties so silly? Can curiosity really kill a cat?You've got questions? This book's got answers. Do cats always land on their feet? Find out!",
        "Category": " Pets , Cats , General",
        "Publisher": "Hci",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The Broken Sword: King Arthur Returns",
        "Authors": "By Murphy, Warren and Cochran, Molly",
        "Description": "Camelot in New York?Not long ago, Arthur was an ordinary boy.  Now he knows that he is the legendary King Arthur, returned to lead not just Britain but all mankind into a new era of justice, peace, and freedom.  Accompanied by the wizard Merlin; Hal, an ex-FBI agent who is now Arthur's bodyguard; and a young girl who holds the powers of the ancient Druids, Arthur seeks the tools of his great work--the Holy Grail and the sword Excalibur.  The Grail's magic has attracted the attention of a powerful sorcerer who will do anything and kill anyone to claim its power.  To protect Arthur, Hal summons the Knights of the Round Table from their enchanted slumber in the mists of Camelot.  The Knights--now New York City's newest motorcycle club--find the 20th century a confusing time, but they know their mission--fight evil and save the King.In the final battle, Arthur learns that having right on your side is not always enough.  Sometimes there are sacrifices to be made.  Will the Round Table never rise again?  Will this Camelot, like the last, fade too soon into memory?",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "One Knight In Venice",
        "Authors": "By Phillips, Tori",
        "Description": "",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Prayer Factor",
        "Authors": "By Tippit, Sammy",
        "Description": "A fresh, compelling look at a most imperative subject. If you've wondered what else you can recommend on prayer, try this book by one who has seen God's marvelous answers. One remarkable account after another.",
        "Category": " Religion , Prayer",
        "Publisher": "Moody Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Amazing Snakes! (I Can Read Level 2)",
        "Authors": "By Thomson, Sarah L.",
        "Description": "If you were a snake, you could . . .sleep all winter!grow as long as a school bus!swallow your food whole!crawl out of your skin!Featuring stunning full-color photographs from the Wildlife Conservation Society, this is the latest title in an exciting I Can Read Book series that takes readers into the amazing world of animals.",
        "Category": " Juvenile Nonfiction , Science & Nature , Environmental Conservation & Protection",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "How Things Work (Nature Company Discoveries Libraries)",
        "Authors": "By Graham, Ian, Davies, Eryl (EDT), and Porter, Alison (EDT)",
        "Description": "Text and drawings explain the workings of certain everyday items including bicycles, traffic lights, and computers",
        "Category": " Young Adult Nonfiction , Technology , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "The Mother-Daughter Book Club Rev Ed.: How Ten Busy Mothers and Daughters Came Together to Talk, Laugh, and Learn Through Their Love of Reading",
        "Authors": "By Barker, Teresa and Dodson, Shireen",
        "Description": "Newly revised and updated!  The tenth anniversary edition of the inspirational book that has brought countless mothers and daughters closer together!The Mother-Daughter Book Club is the story of a group of mothers and their daughters, and how their relationships were strengthened and changed by starting a monthly reading club. But it is also a practical step-by-step guide—filled with stories, anecdotes, and reading lists—that will inspire parents to start reading clubs of their own.Shireen Dodson's message is a powerful one: Reading, learning, and sharing ideas can help nourish a daughter's confidence, strength, spirit, and independence.   A  reading club offers a mother the opportunity to enjoy her daughter's burgeoning mind as she moves toward womanhood. The Mother-Daughter Book Club is not merely about books. It is about mothers and daughters, girls and women, and how reading and talking enriches our relationships with one another.",
        "Category": " Literary Criticism , Books & Reading",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Hors D'Oeuvres (Good Cook Techniques and Recipes)",
        "Authors": "By Time-Life Books",
        "Description": "Shows how to prepare different kinds of appetizers from vegetables, meat, seafood, eggs, and pastry and provides recipes and tips on preparing sauces and garnishes",
        "Category": " Cooking , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "May",
            "Year": "1982"
        }
    },
    {
        "Title": "The King Nobody Wanted",
        "Authors": "By Norman F. Langford",
        "Description": "",
        "Category": "",
        "Publisher": "Westminster Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1948"
        }
    },
    {
        "Title": "Stop Memory Loss: How to Fight Forgetfulness over 40",
        "Authors": "By William Matteson PhD",
        "Description": "",
        "Category": "",
        "Publisher": "Matteson media",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Biscuit's Christmas",
        "Authors": "By Capucilli, Alyssa Satin and Schories, Pat (ILT)",
        "Description": "Christmas is coming!The little girl knows just what needs to be done to get ready for Christmas -- choose a tree, back cookies, decorate the house -- but Biscuit is so excited he can't seem to sit still.Scratch and sniff the scents to find out what that silly puppy has his nose in now!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Nature Doctor: A Manual of Traditional and Complementary Mediciine",
        "Authors": "By H. C. A. Vogel",
        "Description": "",
        "Category": "",
        "Publisher": "Instant Improvement, Inc.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Addictive Relationships: Reclaiming Your Boundaries",
        "Authors": "By Miller, Joy Erlichman",
        "Description": "Dedicated to the claiming of your own personal boundaries, this book deals with our addictive or destructive relationships not only centered around our spouse or lover, but also around our children, our friends or our parents.  If we have lost ourselves along the way, we have probably given ourselves away.  This book examines where we are, where we want to go and how to get there.  We will move addictive loving styles to find the true love of ourselves and reclaim our selfhood.This is a positive step-by-step process for recovery using affirmations and exercises for inner growth.",
        "Category": " Self-help , Affirmations",
        "Publisher": "Hci",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "The Whispered Secret (2) (Leven Thumps)",
        "Authors": "By Skye, Obert and Sowards, Ben (ILT)",
        "Description": "You must be ready to join Leven Thumps, Clover Ernest, and Winter Frore as they journey across Foo to free Geth from his existence as a toothpick and restore him as the rightful heir to the throne. It won't be easy. Foo is in chaos, and Leven must overcome several adversaries and survive the Swollen Forest to save his friends and keep hope alive. As fate would have it, bad goes to worse when Leven digs up a buried secret -- one that stalks him, determined to whisper a truth that could be deadly in the wrong hands. Will Leven master control of his power, or will Foo crumble under a dark, new enemy?",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Real Lives: Eleven Teenagers Who Don't Go to School",
        "Authors": "By Llewellyn, Grace (EDT)",
        "Description": "A collection of eleven profiles by teens who educate themselves or are educated at home, discussing why this alternative to traditional schooling was chosen",
        "Category": "",
        "Publisher": "Lowry House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "The Persecution of Sarah Palin: How the Elite Media Tried to Bring Down a Rising Star",
        "Authors": "By Continetti, Matthew",
        "Description": "The real story of the Republican vice presidential nominee and her collision with the elite liberal media  As the second woman ever nominated as a candidate for vice president, Alaska governor Sarah Palin became an instant phenomenon. Americans were enthralled by a woman with charm, ambition, natural political talent, and a passion for conservative values. But the fascination of ordinary people quickly drew an unprecedented attack from the media elite and liberal activists. Far beyond the normal bounds of tough questions and challenges, Palin's enemies decided that nothing was too personal to attack-including her marriage, her children, her faith, and her ward­robe. The media distorted Palin's positions and beliefs beyond recognition. And almost every word out of her mouth was spun as a \"flub.\" Weekly Standard writer Matthew Continetti reveals the true story of the 2008 Republican vice presidential nominee and her persecution by the elites who tried to hide their bias with solemn declarations of objectivity. Continetti offers fresh examples of malicious spin and deceit and shows how liberal snobbery has become a driving force in American politics. Palin's ordeal has become a rallying cry for the GOP in the Obama era. This perceptive book is a must-read for conservatives who want to understand what really happened-and how to avoid a repeat.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Sentinel HC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Praise Habit: Finding God in Sunsets and Sushi (Experiencing God)",
        "Authors": "By Crowder, David A.",
        "Description": "Praise is something we are, not something we do. Musician David Crowder redefines our perspective of God and helps us develop a habit of praising God by reflecting on targeted psalms from The Message//REMIX. Ideal for teens and those who love the beauty of the Psalms.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Navpress",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Florence (Berlitz Pocket Guides)",
        "Authors": "By Berlitz International, Inc. (EDT)",
        "Description": "",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Berlitz Guides",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "A Tapestry of Spells (The Nine Kingdoms, Book 4)",
        "Authors": "By Kurland, Lynn",
        "Description": "The compelling start of a new fantasy romance trilogy set in the world of the Nine Kingdoms, from New York Times bestselling author Lynn Kurland   Return to the world of the Nine Kingdoms with New York Times bestselling author Lynn Kurland as a new evil, and a new passion, emerges.  Sarah's brother has embraced the dark arts, vowing to destroy the Nine Kingdoms, and she doesn't have the power to stop him. Now she must risk everything to thwart his plans, even though she fears the quest will reveal the secret she's kept all her life.  After seeing his entire family slain by magic, Ruithneadh swore never to use his power again. But when Sarah pleads for his help, he's thrust back into a life of enchantments and peril, and a quest capable of unraveling the entire fabric of the Nine Kingdoms.",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "The Quotable Equine",
        "Authors": "By Dratfield, Jim",
        "Description": "From the Old West legend of the weathered cowboy and his trusty horse to the urbane athleticism of the hunter and jumper, from the majestic mountains of Montana to the volcanic terrain of Iceland, horses are an integral part of everyday life for many people around the world. In these beautiful sepia-toned photographs, Jim Dratfield captures the spirit, strength, and nobility of horses.Paired with quotations that include everyone from James Thurber to Amelia Earhart, Henrik Ibsen to Lauren Bacall, and ranging from the inspirational to the absolutely hilarious, The Quotable Equine celebrates these magnificent animals. Jim Dratfield has traveled the world to capture in both candid and portrait photography the essence of the equine, in the most stunning settings, from dancing Andalusians in Spain to workhorses in Mongolia.Whether it's a child obstinately pulling her donkey, a horse running free in the wild, or an intense moment at an equestrian competition, the images in this book are charming, poignant, gorgeous, and sometimes amusing.  The Quotable Equine pays homage to the timeless elegance of horses, to the many disciplines and sports built around them, and to all the people who love them.",
        "Category": " Pets , Horses , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Maryland: A History 1632-1974",
        "Authors": "By Walsh, Richard and William Lloyd Fox, Editors",
        "Description": "",
        "Category": "",
        "Publisher": "Maryland Historical Society",
        "Price Starting With ($)": "31.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Tropic of Creation",
        "Authors": "By Kenyon, Kay",
        "Description": "In the bloody war that ended between Th Congress Worlds and the alien ahtra, Captain Eli Dammond had distinguished himself as an officer who could no wrong--until his last catastrophic battle.  Now, with his shining reputation tarnished, the commander finds himself assigned to a grimy kettle of a ship making basic transport missions.  Routine work -until he arrives on Null: a barren, scorned world at the mercy of two suns.  Here, a marooned human outpost  has survived for three years until their rescue by Eli's ship.  But on this austere planet, the human newcomers are about to learn a harsh lesson: that nothing is quite as it seems.  For soon a new season will call forth a hidden ecology both exquisite and deadly.  And Null will test the survivors in a fight no soldier was ever trained for, and few can predict - while a young the survivors in a fight no soldier was trained for, and few predict - while a young woman of privilege may well prove to be their finest warrior.Yet for Eli Dammond, the worst struggle will unfold below the surface.  There he will discover a threat to all the settle human worlds, even as he matches wits an adversary both familiar and alien.  The odds are against human survival on null's surface or indeed, in the galaxy-- unless Eli succeeds in bringing home the hard-won secret that neither human nor ahtra can hear.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Spectra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Thursday Night Poker: How to Understand, Enjoy and Win",
        "Authors": "By Steiner, Peter O.",
        "Description": "Intended for the serious biweekly or monthly player, this gaming guide devotes chapters to calculating probabilities, estimating odds, bluffing and being bluffed, reading your opponents' down cards, and more. Virtually everyone will learn from this clearly written, fully illustrated instructional book.",
        "Category": " Games & Activities , Card Games , Poker",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Jesus: Uncovering the Life, Teachings, and Relevance of a Religious Revolutionary",
        "Authors": "By Borg, Marcus J.",
        "Description": "Almost two thousand years after his death, Jesus continues to be front-page news in the United States. Yet American Christians are deeply divided about what it means to follow him. Bible scholar Borg takes us on a journey to discover who Jesus was, what he taught, and why he still matters today. Borg argues that how we see Jesus affects how we see Christianity and reveals a new way of seeing--a new perspective that can overcome the differences between the literalists and progressives, a path that emphasizes following \"the way\" of Jesus, the original name of the Jesus movement. Jesus remains the decisive revelation of God, but we now encounter him as both a reality and a role model centered in God, focused on both personal and political transformation, emphasizing practices rather than beliefs, and exemplifying a faith characterized by deep commitment and gentle certitude.--From publisher description.A revised version of the author's major work on the historical Jesus demonstrates how the Gospels can be understood, rather than undermined, through historical analysis, in an edition that incorporates recent scholarship.",
        "Category": " Religion , Christian Theology , Christology",
        "Publisher": "HarperSanFrancisco",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Alice in Rapture, Sort Of",
        "Authors": "By Naylor, Phyllis Reynolds",
        "Description": "The summer of the first boyfriendThat's what Alice's father calls the summer before Alice starts junior high. And because Pamela's cousin from New Jersey says starting seventh grade without a boyfriend is the worst thing that can happen to a girl (even worse than not having pierced ears or a leather skirt), Alice is greatful that she's got Patrick.The trouble is, Patrick the boyfriend is a lot more complicated than Patrick the friend. What's an appropriate present for Alice to give Patrick for his birthday? What should she do if Patrick wants to kiss her and she hasn't just brushed her teeth? Alice really likes Patrick, but sometimes she thinkgs life would be a lot simpler if they were still just friends. The summer of the first boyfriendThat's what Alice's father calls the summer before Alice starts junior high. And because Pamela's cousin from New Jersey says starting seventh grade without a boyfriend is the worst thing that can happen to a girl (even worse than not having pierced ears or a leather skirt), Alice is greatful that she's got Patrick.The trouble is, Patrick the boyfriend is a lot more complicated than Patrick the friend. What's an appropriate present for Alice to give Patrick for his birthday? What should she do if Patrick wants to kiss her and she hasn't just brushed her teeth? Alice really likes Patrick, but sometimes she thinkgs life would be a lot simpler if they were still just friends.",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Random House Webster's French-English English-French Dictionary",
        "Authors": "By Gutman, Helene",
        "Description": "Designed to meet the needs of students, translators, and businesspeople, this dictionary is completely up-to-date, reflecting modern word usage. Features include:* More than 60,000 entries* Thousand of idioms, phrases, and common expressions* Guides to French and English pronunciation* Useful supplements, including tables of French and English irregular verbsIn addition, this volume incorporates a single A-Z listing of countries and other geographical names, as well as American English spelling and vocabulary throughout--reflecting recent international standardization of English usage.",
        "Category": " Reference , Dictionaries",
        "Publisher": "Random House Reference",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Cut-Throat Celts",
        "Authors": "By Deary, Terry",
        "Description": "The ghastly truth about the wild warrior race who weren't afraid to fight the Romans. The book includes stories about suffering saints, gruesome games for Celtic kids, and the dreadful Druids with their strange sacrifices and terrible trials.",
        "Category": " Juvenile Nonfiction , History , Prehistoric",
        "Publisher": "Hippo",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Common Fire: Leading Lives of Commitment in a Complex World",
        "Authors": "By Daloz, Laurent A. (EDT), Keen, Cheryl H., Keen, James P., and Parks, Sharon Daloz",
        "Description": "A landmark study that reveals how we become committed to the common good and sustain such commitments in a changing world. View the discussion guide for UU communities: HTML or PDF \"A perceptive, groundbreaking analysis of inspired lives. . . . This is a guidebook for the soul.\"—Daniel Goleman, author of Emotional Intelligence\"A truly refreshing book! In a day when the political and spiritual air has grown stale with cynicism, discouragement, and indirection, this beautifully written, penetrating study could not be more welcome or valuable. No teacher, parent, or civic leader who cares about nurturing social commitment can fail to be informed and inspired by this remarkable and surprisingly practical book.\"—Robert Kegan, author of In Over Our Heads\"Eloquent and profound, Common Fire addresses what Americans everywhere long for: a sense of the common good, an emphasis on community and compassion in everyday life, a values-based politics in the public sphere. A compelling, encouraging work.\"—Jim Wallis, author of The Soul of Politics\"A profound exposition and penetrating commentary on some of life's most important issues.\"—Clarence G. Newsome, dean, Howard Divinity School\"A compelling portrait of people who choose to make a difference and thus inspire us all.\"—Rosabeth Moss Kanter, author of World Class: Thriving Locally in the Global Economy",
        "Category": " Political Science , Civics & Citizenship",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Narrative of the Life of Frederick Douglass, an American Slave (Barnes & Noble Classics)",
        "Authors": "By Douglass, Frederick, O'Meally, Robert G., and O'Meally, Robert G. (INT)",
        "Description": "&&LDIV&&R&&LDIV&&R&&LDIV&&R&&LI&&RNarrative of Frederick Douglass, An American Slave&&L/I&&R, by &&LB&&RFrederick Douglass&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&L/DIV&&R&&LDIV&&R &&L/DIV&&R&&LDIV&&RNo book except perhaps &&LI&&RUncle Tom’s Cabin&&L/I&&R had as powerful an impact on the abolitionist movement as &&LI&&RNarrative of the Life of Frederick Douglass&&L/I&&R. But while Stowe wrote about imaginary characters, Douglass’s book is a record of his own remarkable life. &&LP&&RBorn a slave in 1818 on a plantation in Maryland, Douglass taught himself to read and write. In 1845, seven years after escaping to the North, he published &&LI&&RNarrative&&L/I&&R, the first of three autobiographies. This book calmly but dramatically recounts the horrors and the accomplishments of his early years—the daily, casual brutality of the white masters; his painful efforts to educate himself; his decision to find freedom or die; and his harrowing but successful escape. &&LP&&RAn astonishing orator and a skillful writer, Douglass became a newspaper editor, a political activist, and an eloquent spokesperson for the civil rights of African Americans. He lived through the Civil War, the end of slavery, and the beginning of segregation. He was celebrated internationally as the leading black intellectual of his day, and his story still resonates in ours.&&L/P&&R&&LP&&R&&LB&&RRobert O’Meally&&L/B&&R is Zora Neale Hurston Professor of Literature at Columbia University and the Director of Columbia University’s Center for Jazz Studies. He wrote the introduction and notes to the Barnes & Noble classics edition of &&LI&&RThe Adventures of Huckleberry Finn&&L/I&&R.&&L/P&&R&&L/DIV&&R&&L/DIV&&R",
        "Category": " Social Science , Slavery",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Burn Notice: the Fix",
        "Authors": "By Goldberg, Tod",
        "Description": "Covert spy Michael Westen has found himself in forced seclusion in Miami?and a little paranoid. Watched by the FBI, cut off from intelligence contacts, and with his assets frozen, Weston is on ice with a warning: stay there or get ?disappeared.? Driven to find out who burned him and why, he?s biding his time helping people with nowhere else to turn. People like socialite Cricket O?Connor whose own husband has vanished, along with her fortune...",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "With the Lightnings",
        "Authors": "By Drake, David",
        "Description": "The author of the Hammer's Slammers series presents a military science fiction novel in which Daniel Leary, a disaffected lieutenant in the Cinnabar Navy, and Adele Mundy, a dissident's daughter, team up to protect a neutral planet from invasion by a superpower's fleet. Reprint.",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Baen",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Cruden's Complete Concordance",
        "Authors": "By Cruden, Alexander",
        "Description": "For over 250 years, Cruden's Complete Concordance has been a standard tool for serious study of the Bible -- This edition offers you the most accurate, comprehensive, and readable rendering of Alexander Cruden's masterwork. The straightforward, uncluttered style lets you select from over 220,000 Scripture references to swiftly locate the exact words, topics, verses, and passages you're looking for. Compact and easy to use, the Cruden's Complete Concordance is a practical, convenient, eminently useful companion to the King James Version and other classic translations. It features: - Definitions and commentaries where appropriate - A list of seldom-mentioned biblical names - An appendix of names in the Old and New Testaments, complete with their meanings - A list of the names and titles given to Jesus Christ - A list of titles and descriptions given to the church",
        "Category": " Religion , Biblical Reference , Concordances",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Five Quarters of the Orange: A Novel (P.S.)",
        "Authors": "By Harris, Joanne",
        "Description": "When Framboise Simon returns to a small village on the banks of the Loire, the locals do not recognize her as the daughter of the infamous woman they hold responsible for a tragedy during the German occupation years ago. But the past and present are inextricably entwined, particularly in a scrapbook of recipes and memories that Framboise has inherited from her mother. And soon Framboise will realize that the journal also contains the key to the tragedy that indelibly marked that summer of her ninth year. . . .",
        "Category": " Fiction , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Kindness Handbook: A Practical Companion",
        "Authors": "By Salzberg, Sharon",
        "Description": "A friend criticizes you. You grow impatient with someone you’re trying to help. A cell phone user annoys you on a train. Would your first response to these situations be kindness? In The Kindness Handbook, Sharon Salzberg explores with insight and clarity how kindness for ourselves and others can be the quality we choose to steer our lives by.From the foundation of this transformative practice and its entry point through you, to its daily expression in your life, this book features a thoughtful collection of anecdotes, stories, and practical tools to inspire kindness for any life situation. The Kindness Handbook is your personal companion to explore the rich landscape of kindness—and help you see just how it might shift and open up your life to greater joy, meaning, and compassion. “For kindness to be more fully realized, it needs to be distinguished from being ineffectual or meek. It also needs to be infused with wisdom, supported by courage, and threaded with balance.” —Sharon Salzberg, author of The Kindness Handbook \"This book is like having Sharon and her gentle wisdom on call, 24-7, to remind you that in every moment, kindness can make a huge difference in how the next moment unfolds, in yourself and in others. This simple practice will light up and lighten your life.” —Jon Kabat-Zinn, author of Coming to Our Senses and Arriving at Your Own Door",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Sounds True",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Berlitz Greek Phrase Book & Dictionary (Quick Reference System)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Berlitz",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Mr. Jones, Meet the Master: Sermons and Prayers of Peter Marshall",
        "Authors": "By Marshall, Catherine and Marshall, Peter",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Fleming H. Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1982"
        }
    },
    {
        "Title": "Get into College",
        "Authors": "By Korn, Rachel (EDT) and Kabat, Jennifer Yetwin (EDT)",
        "Description": "Getting into college is one of life’s most daunting challenges. Why not let the experts help? The experts in this case include dozens of college consultants, admissions officers, parents, and, best of all, hundreds of students who have experienced the process firsthand. Individual chapters cover such topics as getting started, preparing for the SAT, deciding which colleges to apply to, perfecting applications and essays, putting one’s best foot forward in an interview, and what to do for extracurricular activities and summer vacations. Additional chapters explain what to look for when visiting schools, how to get financial aid, getting support from counselors and parents, dealing with rejection and acceptance, and how to pick the right school. This expanded edition includes special &#147;Counselor’s Corner” features, material on &#147;How to Survive Getting Your Kid into College,” Harvard Law grad Jay Brody’s discussion of how to write the best application essay, and much more.",
        "Category": " Study Aids , College Entrance",
        "Publisher": "Hundreds of Heads Books",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "What Would Audrey Do?: Timeless Lessons for Living with Grace and Style",
        "Authors": "By Keogh, Pamela Clarke",
        "Description": "From the New York Times bestselling author of Audrey Style comes a charming guide to Audrey Hepburn?inspired living for the modern woman Audrey Hepburn epitomized grace and style, not only in her appearance but in her very essence. Whether in fashion, relationships, her work on the screen, or for UNICEF and her home life, there is no one more worthy of imitation. How did she do it? What Would Audrey Do? is the answer: a complete Audrey primer, with rich anecdotes and insight from the people who knew her best, and Audrey-inspired lessons in loveliness, including: · Dating advice from the woman who enjoyed romances with John F. Kennedy, William Holden, and Albert Finney · What made her an icon, and how to apply her style choices to twenty-first-century clothes, makeup, and accessories · Raising children, trying to raise husbands, and making home life balanced in every way · How to travel, what to pack, and maintaining your cool on the road · Using renown (long before Angelina and Bono got all the press) to help others around the world · Insight into her rich interior life and the discipline, intelligence, and generosity that made her so compelling In an era fraught with selfishness, flamboyance, and sensational headlines, Audrey as a role model is precisely what the world needs.",
        "Category": " Performing Arts , Film , History & Criticism",
        "Publisher": "Avery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Thou Shalt Not Dump the Skater Dude (Splashproof edition)",
        "Authors": "By Graham, Rosemary",
        "Description": "Readers who love Sarah Dessen will enjoy this companion to My Not-So-Terrible Time at the Hippie Hotel Just when Kelsey is finally fitting into her new California life, C. J. Logan comes along. He?s hot, popular, and revered as the best skateboarder around. Girls want to be with him, and boys want to be him. And Kelsey is lucky enough to be his girlfriend. But when she decides that their relationship is over, she could not have imagined what would happen next. With rumors flying, she is forced to figure out who her true friends are and, more importantly, who her true self really is.",
        "Category": " Young Adult Fiction , Social Themes , Friendship",
        "Publisher": "Puffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Undead and Unreturnable (Queen Besty, Book 4)",
        "Authors": "By Davidson, MaryJanice",
        "Description": "Though she's the vampire queen, Betsy Taylor is much more like a princess. In MaryJanice Davidson's novels, this high-maintenance monarch is finally coming to terms with her new status.  They say Christmas is a time for friends and family. But with a half-sister who's the devil's daughter, an evil stepmother, a fiend living in her basement, assorted spirits and killers running amok, and a spring wedding to plan with the former bane of her existence, Eric Sinclair, Betsy is not sure she'll survive the holidays.  Oh, right. She's already dead...",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley Hardcover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Caillou Plans a Surprise (BACKPACK (CAILLOU))",
        "Authors": "By Sanschagrin, Joceline",
        "Description": "When Caillou and his sister Rosie wake up before their parents one morning, they decide to surprise them by making breakfast.",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Editions Chouette Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Why Do Animals Sleep Through Winter? (A Just Ask Book)",
        "Authors": "By Chris Arvetis and Carole Palmer",
        "Description": "",
        "Category": "",
        "Publisher": "Field Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Bringing a Garden to Life",
        "Authors": "By Williams, Carol and Stubbing, Newton H. (ILT)",
        "Description": "Focusing on the pleasure of the process of gardening, a poetic but practical guide to basic gardening shows readers how to cultivate their imagination, enthusiasm, and powers of observation while they learn the rudiments of producing a lovely garden.",
        "Category": " Gardening , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Articles of War: A Novel",
        "Authors": "By Arvin, Nick",
        "Description": "Capturing the reality of war with a fidelity and power that echoes the best of classic war writing, this haunting novel brings to life the terrors of a young soldier in shocking, almost hallucinatory detail.George Tilson is an eighteen-year-old Iowan farm boy who enlists in the army during World War II and is sent to Normandy shortly after D-Day. Nicknamed “Heck” because of his reluctance to curse, he is a typical soldier, willing to do his duty without fuss or much musing about grand goals. The night before he is trucked into the combat zone, Heck meets a young French refugee and her family, an encounter that unsettles him greatly.It is during his first, horrific exposure to combat that Heck discovers a dark truth about himself: He is a coward. Shamed by his fears and tortured by the never-ending physical dangers around him, he struggles to survive, to live up to the ideal of the American fighting man, and to make sense of his feelings for the young French woman. As the stark reality of combat—the knowledge that he could cease to exist at any moment—presses in on him, Heck makes a series of choices that would be rational in every human situation except war. With remorseless, hypnotic clarity, Arvin draws readers into the unimaginable fear, violence, and chaos of the war zone. Arvin layers profound meaning within a brilliantly executed minimalist style. His portrayal of the emotional and physical terrors Heck can neither understand nor escape is one of the most disturbing and unforgettable accounts of the life of a soldier ever written.",
        "Category": " Fiction , War & Military",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "The Monk Downstairs: A Novel",
        "Authors": "By Farrington, Tim",
        "Description": "Rebecca Martin is a single mother with an apartment to rent and a sense that she has used up her illusions. I had the romantic thing with my first husband, thank you very much, she tells a hapless suitor. I'm thirty-eight years old, and I've got a daughter learning to read and a job I don't quite like. I don't need the violin music. But when the new tenant in her in-law apartment turns out to be Michael Christopher, on the lam after twenty years in a monastery and smack dab in the middle of a dark night of the soul, Rebecca begins to suspect that she is not as thoroughly disillusioned as she had thought.Her daughter, Mary Martha, is delighted with the new arrival, as is Rebecca's mother, Phoebe, a rollicking widow making a new life for herself among the spiritual eccentrics of the coastal town of Bolinas. Even Rebecca's best friend, Bonnie, once a confirmed cynic in matters of the heart, urges Rebecca on. But none of them, Rebecca feels, understands how complicated and dangerous love actually is.As her unlikely friendship with the ex-monk grows toward something deeper, and Michael wrestles with his despair while adjusting to a second career flipping hamburgers at McDonald's, Rebecca struggles with her own temptation to hope. But it is not until she is brought up short by the realities of life and death that she begins to glimpse the real mystery of love, and the unfathomable depths of faith.Beautifully written and playfully engaging, this novel. is about one man wrestling with his yearning for a life of contemplation and the need for a life of action in the world. But it's Rebecca's spirit, as well as her relationships with Mary Martha, Phoebe, her irresponsible surfer ex-husband Rory -- and, of course, the monk downstairs -- that makes this story shine.",
        "Category": " Fiction , Literary",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "The Poem itself (A Touchstone book)",
        "Authors": "By Burnshaw, Stanley (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Story of the Amistad",
        "Authors": "By Sterne, Emma Gelders",
        "Description": "This gripping, fast-paced book tells the dramatic story of the epic 1839 voyage of the schooner Amistad and her cargo of Africans bound for slavery in the New World. Under the leadership of Cinque, a young African farmer, the Africans revolt and seize the ship. They start for home, but instead of reaching Africa, they wind up in New England. The story of these events and the resulting trial of the captured Africans was front-page news at the time. Were they rebellious slaves and mutineers — \"property\" that must rightfully be returned to its owners — or honest men and women trying to regain their freedom?James W. Ivy, editor of the NAACP's official publication, The Crisis, commented at the time of the book's release, \"Sterne has written a terse tale of great power. She presents her scenes with force and color and scrupulous sense of character.\" The subject of a critically acclaimed motion picture, Amistad (1997), the story of the Amistad is retold here — by a well-known author of books and plays for young people — in an exciting, readable style that will thrill young readers with its \"you-are-there\" flavor, authentic recreation of the facts, and accurate, and dignified portrayal of the central characters.",
        "Category": " Juvenile Nonfiction , History , Africa",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Africa's Top Wildlife Countries, Sixth Edition",
        "Authors": "By Nolting, Mark W. and Butchart, Duncan (ILT)",
        "Description": "Starting from scratch, Africa's Top Wildlife Countries answers such questions as: What safari options are available? What countries offer the kind of experience I am seeking? When is the best time to go? Covering Botswana, Kenya, Namibia, South Africa, Tanzania, Uganda, Zambia, Zimbabwe, Burundi, Congo, Lesotho, Malawi, Rwanda, Swaziland, Mauritius, and the Seychelles Islands, this is a complete guide for anyone planning a trip to Africa. Its user-friendly format makes planning a safari easy by highlighting and comparing wildlife reserves, depicting and describing types of accommodations and other major attractions. Jam-packed with information essential for the successful safari, this edition has been completely revised, and includes over 50 maps detailing countries and major wildlife reserves (including a new two-page Eco-Map depicting the primary vegetation zones, country, and park locations), 32 pages of color photographs, more than 125 black and white photos, 11 charts, and numerous illustrations. \"A must for all safari goers traveling in any part of Africa.\" -- R. Michael Wright, President, African Wildlife Foundation",
        "Category": " Nature , Animals , Wildlife",
        "Publisher": "Global Travel Publishers",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Unofficial Guide to Casino Gambling",
        "Authors": "By Nestor, Basil",
        "Description": "The casino games seem simple, but every year, millions of people lose billions of dollars at casinos and other gaming establishments. Why? Because they lack information, rather than luck. Beyond Las Vegas and Atlantic City, this book discusses riverboat and dockside gambling, as well as the boom in Indian Reservation gambling destinations and bingo parlors. In addition to the most popular card and dice games, readers discover the latest gambling craze -- virtual casinos found on the Internet. Basil Nestor delivers to the reader the kind of insider information that casinos, other books, or experts can't or won't tell them:* Thoroughly explains casino games, like blackjack, poker, craps, roulette, and more* Analyze odds and guaranteed advantages of certain types of play* Identifies isucker betsi and expose scam betting systems that lose gamblers money* Clarifies casino security protocol and explicate state operations regulations* Teaches prospective gamblers to implement methods that increase winning potential",
        "Category": " Games , Gambling , General",
        "Publisher": "John Wiley & Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "The Adventures of Tom Sawyer (Dover Thrift Editions)",
        "Authors": "By Twain, Mark",
        "Description": "Whether forming a pirate gang to search for buried treasure or spending a quiet time at home, sharing his medicine with Aunt Polly's cat, the irrepressible Tom Sawyer evokes the world of boyhood in nineteenth century rural America. In this classic story, Mark Twain re-created a long-ago world of freshly whitewashed fences and Sunday school picnics into which sordid characters and violent incidents sometimes intruded. The tale powerfully appeals to both adult and young imaginations. Readers explore this memorable setting with a slyly humorous born storyteller as their guide. Tom and Huck Finn conceal themselves in the town cemetery, where they witness a grave robbery and a murder. Later, the boys, feeling unappreciated, hide out on a forested island while the townspeople conduct a frantic search and finally mourn them as dead. The friends triumphantly return to town to attend their own funeral, in time for a dramatic trial for the graveyard murder. A three-day ordeal ensues when Tom and his sweetheart, Becky Thatcher, lose their way in the very cave that conceals the murderer. With its hilarious accounts of boyish pranks and its shrewd assessments of human nature, The Adventures of Tom Sawyer has captivated generations of readers of all ages. This inexpensive edition of the classic novel offers a not-to-be-missed opportunity to savor a witty and action-packed account of small-town boyhood in a bygone era.",
        "Category": " Fiction , Literary",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Tempest (Signet Classics)",
        "Authors": "By Shakespeare, William, Barnet, Sylvan, and Langbaum, Robert",
        "Description": "The Signet Classics edition of William Shakespeare's fantastical play that combines elements of tragedy and comedy.Prospero, sorcerer and rightful Duke of Milan, along with his daughter Miranda, has lived on an island for many years since his position was usurped by his brother Antonio. Then, as Antonio's ship passes near the island one day, Prospero conjures up a terrible storm...This revised Signet Classics edition includes unique features such as:• An overview of Shakespeare's life, world, and theater• A special introduction to the play by the editor, Robert Langbaum• Selections from William Strachey, Sylvester Jourdain, Montaigne, and Ovid, sources from which Shakespeare derived The Tempest• Dramatic criticism from Samuel Taylor Coleridge, E.M.W. Tillyard, Lori Jerrell, and others• A comprehensive stage and screen history of notable actors, directors, and productions• Text, notes, and commentaries printed in the clearest, most readable text• And more...",
        "Category": " Fiction , Classics",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "WWJD Today?: One year of daily devotions for youth",
        "Authors": "By Shipman, Brian K.",
        "Description": "A collection of devotional readings and Bible verses presenting the life of Jesus as a blueprint for daily choices made by Christians, in such areas as thankfulness, popularity, generosity, and obeying God's will.",
        "Category": " Young Adult Nonfiction , Religious , Christian , Devotional & Prayer",
        "Publisher": "B&H Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "365 Stories and Rhymes for Boys: A Story a Day",
        "Authors": "By Parragon (COR)",
        "Description": "Collects traditional and original short stories, fairy tales, and nursery rhymes.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "When Perfect Isn't Good Enough: Strategies for Coping with Perfectionism",
        "Authors": "By Antony, Martin M. and Swinson, Richard P.",
        "Description": "Two psychologists explain the phenomenon of perfectionism and outline a methodical program for overcoming it, including a series of exercises designed to help readers challenge their unrealistic expectations and identify situations where perfectionism arises. Original. IP.",
        "Category": " Psychology , Psychopathology , Compulsive Behavior",
        "Publisher": "New Harbinger Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Dark Knight: Batman Saves the Day, The",
        "Authors": "By Frantz, Jennifer (ADP), McCaig, Dave (ILT), and Stewart, Cameron (ILT)",
        "Description": "Bruce Wayne's friends throw him a birthday party. But a surprise guest shows up to spoil the fun—it's the Joker! Can Batman get there in time to save the day?",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Festival",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "The Three Little Pigs (My Turn! Your Turn!)",
        "Authors": "By Donehoo, Timothy S. (EDT) and Elizalde, Marcelo (ILT)",
        "Description": "The brand-new My Turn! Your Turn! series will have your kids reading confidently in no time! Designed for pre-readers and parents to read together, the books uses predictable language and concepts, repetition and rhyme to make learning to read enjoyable and fun! Loveable characters and storylines including the Three Little Pigs and Goldilocks and the Three Bears make these books timeless classics and favorites for bedtime reading!",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    }
]