[
    {
        "Title": "The Book of 1,001 Home Health Remedies",
        "Authors": "By FC&A",
        "Description": "",
        "Category": " Health & Fitness , Herbal Medications",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Walt Disney's 101 Dalmatians (Disney's Wonderful World of Reading)",
        "Authors": "By Dodie Smith",
        "Description": "",
        "Category": "",
        "Publisher": "Grolier Enterprises Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "John Wesley, the founder of Methodism (Ladybird history series)",
        "Authors": "By Vickers, John A",
        "Description": "",
        "Category": "",
        "Publisher": "Ladybird Books",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Russka: The Novel of Russia",
        "Authors": "By Rutherfurd, Edward",
        "Description": "\"Impressive.\"THE WASHINGTON POST BOOK WORLDSpanning 1800 years of Russia's history, people, poltics, and culture, Edward Rurtherford, author of the phenomenally successful SARUM: THE NOVEL OF ENGLAND, tells a grand saga that is as multifaceted as Russia itself. Here is a story of a great civilization made human, played out through the lives of four families who are divided by ethnicity but united in shaping the destiny of their land.\"Rutherford's RUSSKA succeeds....[He] can take his place among an elite cadre of chroniclers such as Harold Lamb, Maurice Hindus and Henri Troyat.\"SAN FRANCISCO CHRONICLE",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Ivy Books",
        "Price Starting With ($)": "8.57",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Jonah and the Very Big Fish - Arch Books",
        "Authors": "By Jonah",
        "Description": "",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "Concordia Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Southern Cooking (Step-By-Step Cookbooks)",
        "Authors": "By Carter, Ruthann",
        "Description": "Gathers recipes for Southern-style appetizers, soups, salads, meat, poultry, fish, seafood, gumbos, stews, vegetables, side dishes, breads, and desserts, and includes a list of suggested menus",
        "Category": " Cooking , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "New England Cooking (Step-By-Step Cookbooks)",
        "Authors": "By Smith, Sarah Putnam",
        "Description": "Gathers recipes for New England-style appetizers, soups, salads, vegetables, seafood, poultry, meat, breads, and desserts, and includes a list of suggested menus",
        "Category": " Cooking , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Your First Rabbit (Your First Series)",
        "Authors": "By Vernier, Louise",
        "Description": "Provides information on the selection, care, breeding, and housing of rabbits",
        "Category": " Technology & Engineering , General",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Compassion: Zack Lends a Hand (Adventures from the Book of Virtues)",
        "Authors": "By Bennett, William J., Canning, Shelagh, and Henry, Davis (ILT)",
        "Description": "Zack does not want to get involved when the house of his unusual new neighbors burns down, until the fable of Androcles and the lion makes him see how reaching out to help others can hold tremendous rewards. Original.",
        "Category": "",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "5.52",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Courage: Annie's Race (Adventures from the Book of Virtues)",
        "Authors": "By Canning, Shelagh and Henry, Davis (ILT)",
        "Description": "When a new girl in school beats Annie in a race, Annie does not want to risk another humiliating defeat, but the story of Perseus and the Minotaur shows her that finding the courage to try matters more than winning. Original.",
        "Category": "",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Honesty: Zach's Tall Tale (Adventures from the Book of Virtues, No 1)",
        "Authors": "By Canning, Shelagh, Bennett, William, and Henry, Davis (ILT)",
        "Description": "When Zack is afraid to tell his father that he broke a valuable camera that he promised he would not touch, Plato relates to him the story of George Washington and the cherry tree, and Zack learns the value of honesty. Original.",
        "Category": "",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Piggybook",
        "Authors": "By Browne, Anthony",
        "Description": "Illus. in full color. \"Mr. Piggott and his sons are a male chauvinist lot who, outside of yelling for their dinner, don't exercise themselves much around the house. When Mrs. Piggott finally tires of the endless chores that sandwich her workday, she leaves the menfolk on their own, with a note saying, 'You are pigs.' With the cooking and housework untended, they soon turn genuinely porcine, a transformation Browne foreshadows with pig faces on the wallpaper, vases, fireplace, phone. As in most of Browne's art, there is more than a touch of irony and visual humor here. Fun to read aloud.\"--Bulletin, Center for Children's Books.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Dragonfly Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "King Lear",
        "Authors": "By Shakespeare, William and Fraser, Russell A. (EDT)",
        "Description": "",
        "Category": " Drama , General",
        "Publisher": "Signet Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1963"
        }
    },
    {
        "Title": "The Berenstain Bears and the Bully",
        "Authors": "By Berenstain, Stan",
        "Description": "This beloved story is a perfect way to teach children about bullies, problem-solving, and communication!Come for a visit in Bear Country with this timeless classic from Stan and Jan Berenstain. There is a bully at school, and the bully is picking on Sister! Will she ever be able to stand up for herself? Includes over 50 bonus stickers!",
        "Category": " Juvenile Fiction , Social Themes , Bullying",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Illustrated Bible stories for children",
        "Authors": "By Hughes, Ray",
        "Description": "",
        "Category": "",
        "Publisher": "Joshua Morris Publishing, Inc.",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "The Very Busy Spider",
        "Authors": "By Carle, Eric",
        "Description": "A VERY classic from Eric Carle, creator of The Very Hungry CaterpillarEarly one morning a little spider spins her web on a fence post. One by one, the animals of the nearby farm try to distract her, yet the busy little spider keeps diligently at her work. When she is done, she is able to show everyone that not only is her creation quite beautiful, it is also quite useful!This multi-sensory book allows children to feel the pictures as well as see them. And with its rhythmic text, The Very Busy Spider becomes an experience to touch, to see, and to hear.\"A beautifully executed work for the very young that satisfies the needs of both visually handicapped and sighted children without losing its artistic integrity.\"--The Horn Book, starred review\"Both sighted and blind children will follow the action with ease . . . Visually and verbally, this is a winner.\"--Booklist, starred review.",
        "Category": " Juvenile Fiction , Animals , Insects, Spiders, etc.",
        "Publisher": "World of Eric Carle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Mr. Cuckoo's Clock Shop",
        "Authors": "By Shapiro, Arnold",
        "Description": "",
        "Category": "",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Valentine's Day: Things to Make and Do",
        "Authors": "By Supraner, Robyn",
        "Description": "Shows how to make many cards and gifts out of materials that are neither hard to find nor expensive and recommends activities to celebrate the holiday in high fashion",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1980"
        }
    },
    {
        "Title": "Almost a Lady (Almost Trilogy)",
        "Authors": "By Feather, Jane",
        "Description": "In this exhilarating new novel of romance and intrigue, New York Times bestselling author Jane Feather tells the tale of an adventurous young woman and the hardened spy who is unexpectedly–and most inconveniently–captivated by her....Independent and inquisitive, Meg Barratt wants nothing to do with any stifling society marriage. Meg yearns for the kind of passion that exists only in books–until a violent storm lands her on the high seas with the most dangerous and seductive man she’s ever encountered…or imagined. For Cosimo, women are objects, to be manipulated for business or pleasure…sometimes both. But when the seafaring assassin accidentally kidnaps Meg on his latest mission, he must reconsider his position. Recruiting his unsuspecting captive for the danger ahead is far more challenging than he expected–and far more seductive.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Cooking Italian: Classic to Contemporary (Better Homes & Gardens Test Kitchen)",
        "Authors": "By",
        "Description": "Provides Italian-style recipes for pasta, sauces, meat, poultry, fish, shellfish, pizza, sandwiches, soups, breads, grain dishes, antipasti, salads, vegetables, and desserts",
        "Category": " Cooking , General",
        "Publisher": "Meredith Corporation",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Full Bloom (Full Series)",
        "Authors": "By Evanovich, Janet and Hughes, Charlotte",
        "Description": "Dear Reader,The temperature's on \"sizzle\" again in Beaumont, South Carolina, where peach trees are in season and ripe for the picking. So is its newest entrepreneur, Annie Fortenberry, who has inherited her grandmother's B&B (and its eccentric handyman Erdle Thorney). According to a local psychic she also inherited a spirit from its glory days as a brothel-not the kind of publicity the Peach Tree Bed & Breakfast needs if it's hosting millionaire Max Holt's upcoming wedding! If rumors of a naughty, prank-playing ghost aren't stressful enough, a mysterious man has arrived with an eye on Annie and her master suite. Wes Bridges is all leather and denim, sporting a two-day beard, straddling a Harley, and sending the B&B's testosterone level through the roof. Annie's cool demeanor may be dropping as fast as Wes's jeans, but leave it to her missing ex-husband to dampen the passion! Turns out someone has done him in, and all evidence points to Annie! Wrapped up in a murder plot, Annie must find the killer, save her own neck, and get back to where she was-wrapped up in Wes's strong loving arms...We guarantee that you're going to have as much fun reading Full Bloom as we had writing it! (Even if we were surprised by the ending!) And you won't want to miss the hair-raising shenanigans when Fleas, the hound dog, meets the most cantankerous, snooty, bad-tempered, twenty-two pound orange cat....Janet and Charlotte",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "The sword of Siegfried (Legacy books)",
        "Authors": "By Katharine Scherman",
        "Description": "",
        "Category": "",
        "Publisher": "Random House-a Legacy Book",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "16 Lighthouse Road (Cedar Cove, Book 1)",
        "Authors": "By Macomber, Debbie",
        "Description": "When their divorce petition is denied by a family court judge, who believes that they just need to work harder at their relationship, Cecilia and Ian Randall's personal business suddenly becomes public knowledge when Jack Griffin, a devastatingly handsome reporter, finds out about their case. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "325 Creative Prompts for Personal Journals (Grades 4-8)",
        "Authors": "By Senn, James A.",
        "Description": "325 answers to \"What is there to write about?\" Try this wide array of authentic journal-writing ideas. Includes personal interests and opinions, memories, friends, science, ethics, and many more. For use with Grades 4-8.",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Teaching Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Ideals Easter 1991",
        "Authors": "By",
        "Description": "Poems, articles, and stories deal with the meaning, spirit, and customs of Easter",
        "Category": "",
        "Publisher": "Ideals Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "God's Answers to Your Questions: A Quick Reference to Bible Topics",
        "Authors": "By Tim Crosby, Editior",
        "Description": "",
        "Category": "",
        "Publisher": "Review & Herald Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Pride and Prejudice (Puffin Classics)",
        "Authors": "By Austen, Jane",
        "Description": "Now young readers can enjoy this beloved classic.Mr and Mrs Bennet live with their five daughters. Jane, the eldest daughter, falls in love with Charles Bingley, a rich bachelor who moves into a house nearby with his two sisters and friend, Fitzwilliam Darcy. Darcy is attracted to the second daugher, Elizabeth, but Elizabeth finds him arrogant and self-centered. When Darcy proposes to Elizabeth, she refuses. But perhaps there is more to Darcy than meets the eye. For over 150 years, Jane Austen's warm, witty account of love, family, and the folly of first impressions has been praised as a must-read book for readers of all ages.",
        "Category": " Young Adult Fiction , Classics",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Giver (21st Century Reference)",
        "Authors": "By Lowry, Lois",
        "Description": "Jonas's world is perfect. Everything is under control. There is no war or fear of pain. There are no choices. Every person is assigned a role in the community. When Jonas turns 12 he is singled out to receive special training from The Giver. The Giver alone holds the memories of the true pain and pleasure of life. Now, it is time for Jonas to receive the truth. There is no turning back.",
        "Category": "",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "The Search (Eve Duncan)",
        "Authors": "By Johansen, Iris",
        "Description": "NEW YORK TIMES BESTSELLER • He strikes without warning. He kills without mercy. He's only just begun.  As part   of an elite K-9 search and rescue team, Sarah Patrick and her golden retriever, Monty,   have a gift for finding what no one else can. But their latest assignment is not   like the others. This time Sarah is being forced to take part in a deadly mission   . . . by a man who knows enough about her past to ensure her cooperation. Billionaire   John Logan's top-secret venture has been sabotaged, its facilities destroyed, and   its handpicked staff massacred. The sole survivor is being held for ransom. Logan   knows that the only way to save the man—and the secrets he holds—is to find   him as soon as possible. Sarah is furious when she is strong-armed into joining   Logan on his search. And once she takes the perilous assignment, not even Logan's   promises that she and Monty will be safe may be enough to protect them. Because a   killer is devising a sadistic vengeance . . . and he may soon find use for Sarah.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "President George W. Bush : Our Forty-Third President",
        "Authors": "By Gormley, Beatrice",
        "Description": "Our new president, George W. Bush, once said: \"I never dreamed about becoming president. When I was growing up, I wanted to be Willie Mays.\" George W. was born in 1946 and attended Yale University. As a young man, he trained as a fighter pilot in the Texas Air National Guard before beginning a career in business. He then turned to Texas politics and served as governor there from 1994 to 2000. This is the first biography for young people to be published about the forty-third president of the United States, George W. Bush. With up-to-the-minute information and quotes from our new president -- including details of the final days of the campaign and a description of the events from Election Day to acceptance speech -- this book is essential reading for every young student of American history.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Political",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "The Grey King (The Dark is Rising Sequence)",
        "Authors": "By Cooper, Susan",
        "Description": "There is a Welsh legend about a harp of gold, hidden within a certain hill, that will be found by a boy and a white dog with silver eyes -- a dog that can see the wind.Will Stanton knew nothing of this when he came to Wales to recover from a severe illness.But when he met Bran, the strange boy who owned a white dog, he began to remember.For Will is the last-born of the Old Ones, immortals dedicated to saving the world from the forces of evil, the Dark.And it is Will's task to wake --with the golden harp -- the six who must be roused from their long slumber in the Welsh hills to prepare for the last battle between the Dark and the Light.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Adventure, Mystery and Romance: Formula Stories as Art and Popular Culture",
        "Authors": "By Cawelti, John G.",
        "Description": "In this first general theory for the analysis of popular literary formulas, John G. Cawelti reveals the artistry that underlies the best in formulaic literature. Cawelti discusses such seemingly diverse works as Mario Puzo's The Godfather, Dorothy Sayers's The Nine Tailors, and Owen Wister's The Virginian in the light of his hypotheses about the cultural function of formula literature. He describes the most important artistic characteristics of popular formula stories and the differences between this literature and that commonly labeled \"high\" or \"serious\" literature. He also defines the archetypal patterns of adventure, mystery, romance, melodrama, and fantasy, and offers a tentative account of their basis in human psychology.",
        "Category": " Literary Criticism , General",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "13.78",
        "Publish Date": {
            "Month": "July",
            "Year": "1977"
        }
    },
    {
        "Title": "Verbal Review for Standardized Tests (Cliffs Test Prep)",
        "Authors": "By Corvino, William A. and Orton, Peter Z.",
        "Description": "The CliffsTestPrep series offers full-length practice exams that simulate the real tests; proven test-taking strategies to increase your chances at doing well; and thorough review exercises to help fill in any knowledge gaps.For anyone taking any standardized test — such as the SAT, ACT, or GRE — Cliffs Verbal Review for Standardized Tests is designed to review, refresh, and reintroduce essential grammar and verbal skills. Written by test preparation experts, this clear, concise, and easy-to-use guide gives insight into the types of questions you'll face on the exam, and it demonstrates how to avoid the common and costly errors that trap the unprepared. Inside, you'll find an extensive overview of these areas:Grammar and usage reviewEnglish usage and sentence correctionTimed essay writingVerbal ability -- antonyms, analogies, and sentence completionReading comprehensionStrategies for each question typePractice exercises with hundreds of questions and complete explanationsThis guide's unique approach will not only review the essential basic skills, but also show you how to apply them effectively and specifically on standardized tests. As you work your way through this guide, you'll hone your knowledge ofParts of speech, adjectives and adverbs, linking verbs, and comparatives and superlativesDangling modifiers, ambiguous pronouns, and double negativesErrors in diction, idiom, and stylePunctuation — using commas, semi-colons, colons, apostrophes, and dashesWriting narrative, descriptive, analytical, and expository essaysWith guidance from the CliffsTestPrep series, you'll feel at home in any standardized-test environment!",
        "Category": " Study Aids , Tests (Other)",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1986"
        }
    },
    {
        "Title": "Robinson Crusoe (Bantam Classics)",
        "Authors": "By Defoe, Daniel",
        "Description": "This classic story of a shipwrecked mariner on a deserted island is perhaps the greatest adventure in all of English literature. Fleeing from pirates, Robinson Crusoe is swept ashore in a storm possessing only a knife, a box of tobacco, a pipe-and the will to survive. His is the saga of a man alone: a man who overcomes self-pity and despair to reconstruct his life; who painstakingly teaches himself how to fashion a pot, bake bread, build a canoe; and who, after twenty-four agonizing years of solitude, discovers a human footprint in the sand... Consistently popular since its first publication in 1719, Daniel Defoe's story of human endurance in an exotic, faraway land exerts a timeless appeal. The first important English novel, Robinson Crusoe has taken its rightful place among the great myths of Western civilization.",
        "Category": "",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1982"
        }
    },
    {
        "Title": "Tomorrow's Promise",
        "Authors": "By Brown, Sandra",
        "Description": "At a congressional hearing about American soldier missing in action in Vietnam, Keely Preston, at the conference to speak about her own lost husband, is drawn to handsome Congressman Dax Devereaux, but their growing love could be threatened by Keely's desperate determination to uncover the truth about her husband. Reissue.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The American Heart Association Cookbook: (Revised and Updated)",
        "Authors": "By Eshleman, Ruthe",
        "Description": "Offers recipes and menus calling for low-calorie, low-fat, low-cholesterol foods that reduce the chances of heart disease",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "The Foot Book (The Bright and Early Books for Beginning Beginners)",
        "Authors": "By Seuss, Dr.",
        "Description": "A Dr. Seuss classic turns 50!Since 1968, this super-simple, simply brilliant Bright and Early Book about feet has been helping beginning beginner readers step into the world of reading by themselves! From slow feet to quick feet to trick feet to sick feet, The Foot Book not only features a fleet of funny feet, but teaches children about opposites. Perfect for nurturing a love of reading, feet (!), AND Dr. Seuss—this special edition comes with a peel-off 50th Anniversary sticker on the front cover.Combining brief and funny stories, easy words, catchy rhythm, and lively illustrations, Bright and Early Books are an ideal way to introduce the joys of reading to children.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1968"
        }
    },
    {
        "Title": "Dianetics: The Modern Science of Mental Health",
        "Authors": "By Hubbard, L. Ron",
        "Description": "Dianetics If you've ever felt there was something holding you back in life, ruining your plans and stopping you from being who you want to be, you were right.  The fact is, there is a single source of all your problems, stress, unhappiness and self-doubt. It's called the reactive mind - the hidden part of your mind that stores all painful experiences and then uses them against you. Dianetics gets rid of the reactive mind. It's the only thing that does. With over 20,000,000 copies in dozens of languages, Dianetics has remained a bestseller for more than fifty years. Now used in more than 150 nations, Dianetics brings dramatic and permanent improvement to people all over the world. Read Dianetics and discover: * The real reason for unexplained pains, negative emotions and unhappy relationships in your life. * Exactly what is destroying your belief in yourself and how Dianetics helps you get rid of it so you become more you; * The precise technology that blows away the barriers in your life - forever. Don't live with insecurity, negative thoughts and irrational behavior. Use Dianetics and get rid of your reactive mind. Have you ever wondered how your mind works? Your mind records pictures of everything you experience throughout life. These \"mental image pictures\" ARE your memory. Through mental image pictures you can see the past, hear what was said, feel, taste and smell things from long ago or just from yesterday. Your perception of mental image pictures - however vague at first - can be sharpened with Dianetics. Mental image pictures are used continually to solve problems, imagine and remember things. L. Ron Hubbard's #1 New York Times bestseller,",
        "Category": " Religion , Scientology",
        "Publisher": "Bridge Publications, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Country Furniture: America's Rich Legacy of Design and Craftsmanship (American Country)",
        "Authors": "By Time Life",
        "Description": "Looks at antique American furniture including beds, chairs, tables, cupboards, and benches, demonstrates country-style painting techniques, and offers advice on decorating with country furniture",
        "Category": " House & Home , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Country Collections: Ideas for Collecting and Displaying Antiques and Other Country Treasures (American Country)",
        "Authors": "By Time-Life Books",
        "Description": "Offers advice on starting an antiques collection and shows a variety of collectibles.",
        "Category": " Antiques & Collectibles , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "My First 500 Words (Early Learning)",
        "Authors": "By Tulip, Jenny",
        "Description": "",
        "Category": "",
        "Publisher": "Autumn Publishing Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Sacred Honor: Colin Powell : The Inside Account of His Life and Triumphs",
        "Authors": "By Roth, David",
        "Description": "The personal story of one of America's most respected military leaders describes Powell's early days in Harlem, rise through the ranks of the military, battles with prejudice and poverty, and political aspirations for the future. Original.",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Creative Hamburger Cookery; 182 Unusual Recipes for Casseroles, Meat Loaves, and Hamburger.",
        "Authors": "By De Gouy, Louis Pullig",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , Asian",
        "Publisher": "Dover Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1974"
        }
    },
    {
        "Title": "The Rules: Time-Tested Secrets for Capturing the Heart of Mr. Right",
        "Authors": "By Fein, Ellen and Schneider, Sherrie",
        "Description": "You are a creature unlike any other (Rule #1)--that's why you need . . . The Rules. A simple set of dos and don'ts, The Rules will lead you to where you want to be: in a healthy, committed relationship. Unlike today's haphazard dating customs, The Rules recognizes certain facts of life. That men know what they want. That a man is either attracted to you--or not! That men want a challenge, not an instant or easy victory. When you follow these commonsense guidelines, you treat yourself with respect and dignity--and demand that men do likewise. Although they sound old-fashioned (\"Don't see him more than once or twice a week\"), they encourage you to lead a full, satisfying, busy life--outside of romance. Although they seem tough (\"Don't talk to a man first\"), they will teach you how to accept occasional defeat and move on. And although they require discipline (\"No more than casual kissing on the first date\"), they will bring out the best in you and in the men you date. The goal? Marriage, in the shortest time possible, to a man you love, who loves you even more than you love him.",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Little Red Riding Hood (Fairy Tale Treasury, Volume 1)",
        "Authors": "By Jane Jerrard~Susan Spellman",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Dr. Seuss's ABC: An Amazing Alphabet Book!",
        "Authors": "By Seuss, Dr.",
        "Description": "Complemented by Dr. Seuss's rhyming text and familiar creature illustrations, a sturdy, hand-sized introduction to the alphabet makes learning as simple as A, B, C. For children under three.",
        "Category": " Juvenile Fiction , Concepts , Alphabet",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "God loves me: Bible promises for little hearts",
        "Authors": "By Arbuckle, Kathy",
        "Description": "",
        "Category": "",
        "Publisher": "Barbour Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Santa's Surprise Sleigh (Creative Child Press)",
        "Authors": "By Susan Karnovsky",
        "Description": "",
        "Category": "",
        "Publisher": "Creative Child Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "This Great Salvation:",
        "Authors": "By Boisvert, Robin, Mahaney, C. J.",
        "Description": "",
        "Category": "",
        "Publisher": "Sovereign Grace Ministries",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "My Teacher Sleeps in School by Ellen Weiss (1984-04-01)",
        "Authors": "By Ellen Weiss",
        "Description": "Because Mrs. Marsh is always in her classroom before the students arrive and always stays after they leave, Mollie becomes convinced that her teacher has no home other than the school.",
        "Category": "",
        "Publisher": "Warne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "The Miracles of Jesus",
        "Authors": "By Etta Wilson",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Bridge Across Forever: A Lovestory",
        "Authors": "By Bach, Richard",
        "Description": "The author of \"Jonathan Livingston Seagull\" recounts his search for his dreamed-of soulmate, his detour into wealth and success, and his ultimate meeting with the woman with whom he has found new and intense love and enchantment",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "DELL",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "David and Goliath",
        "Authors": "By Brill, Marlene Targ, and Gianni, Thomas",
        "Description": "",
        "Category": "",
        "Publisher": "Ashley Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "McBroom Tells The Truth",
        "Authors": "By Sid Fleischman",
        "Description": "",
        "Category": "",
        "Publisher": "W. W. Norton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Eeyore, Be Happy ((A Little Golden Book) (Walt Disney's Winnie the Pooh))",
        "Authors": "By Ferguson, Don",
        "Description": "When Eeyore's prediction of earthquake weather spoils everyone else's day, his friends try to cheer him up by making him try some of the activities that make them happy",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Woman Next Door",
        "Authors": "By Delinsky, Barbara",
        "Description": "New York Times bestselling author Barbara Delinsky paints an ingenious portrait of the secrets inside every marriage in a sharp-eyed novel filled with suspense and surprise. Three married couples in peaceful suburban Connecticut are challenged and forever changed by the presence of the woman next door...  Along with their husbands, Amanda, Karen, and Georgia are a close-knit circle of friends enjoying seemingly ideal lives in an upscale neighborhood. But when they learn that their lovely younger neighbor, widowed for a year and presumably still unattached, is pregnant, the strains and imperfections of their lives come into full focus. As they ponder who the father might be, each of the women harbors suspicions about her own husband -- and each is forced to a crisis point that will strengthen or shatter her marriage.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The House on Honeysuckle Lane (Heartland Memories Series, Book 1)",
        "Authors": "By Page, Carole Gift",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "The Manhattan Hunt Club: A Novel",
        "Authors": "By Saul, John",
        "Description": "Falsely convicted of a brutal crime, college student Jeff Converse sees his future vanishing before his eyes. But someone has other plans for Jeff, in a far deadlier place than any penitentiary. Jeff finds himself beneath the teeming streets of Manhattan, in a hidden landscape of twisting tunnels and forgotten subterranean chambers. Here, an invisible population of the homeless, the desperate, and the mad has carved out its own shadow society. But they are not alone. For someone has made this forsaken civilization a private killing ground. Now, with no weapon but his wits, and an unimaginable threat lurking around every dark corner, Jeff must somehow move heaven and earth to escape from a living hell. . . .",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Moonwalk: The First Trip to the Moon (Step-Into-Reading, Step 5)",
        "Authors": "By Donnelly, Judy and Davidson, Dennis",
        "Description": "The astronauts of Apollo 11 made history as the first men to land on the Moon. Learn more about how Neil Armstrong, Buzz Aldrin, and Michael Collins trained and achieved this momentous feat in this Step 5 History Reader. Step  5 Readers tell stories in chapters using longer paragraphs, for  children who want to take the plunge into chapter books but still like  colorful illustrations and photography.\"The story of Apollo 11's historic flight, from lift-off, through 'The Eagle has landed,' to splashdown and quarantine. Donnelly does a good job of setting the stage with chapters on the history of the idea of flight to the moon, astronaut selection and training, and look at the flight's effect on people in general.\"  --School Library Journal.",
        "Category": " Juvenile Fiction , Historical , Exploration & Discovery",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Hide And Seek Science #02: Where's That Reptile?",
        "Authors": "By Brenner, Barbara and Chardiet, Bernice",
        "Description": "An introduction to reptiles featuring facts about the various types is accompanied by illustrations that invite readers to find hidden reptiles",
        "Category": "",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Timeline",
        "Authors": "By Crichton, Michael",
        "Description": "In an Arizona desert a man wanders in a daze, speaking words that make no sense. Within twenty-four hours he is dead, his body swiftly cremated by his only known associates. Halfway around the world archaeologists make a shocking discovery at a medieval site. Suddenly they are swept off to the headquarters of a secretive multinational corporation that has developed an astounding technology. Now this group is about to get a chance not to study the past but to enter it. And with history opened to the present, the dead awakened to the living, these men and women will soon find themselves fighting for their very survival--six hundred years ago. . . .",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Weekly Reader Children's Book CLub presents Hide and seek fog",
        "Authors": "By Tresselt, Alvin R",
        "Description": "",
        "Category": "",
        "Publisher": "Lothrop Lee & Shepard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Boston Freedom Trail: Revised 2007 (Back Bay Press)",
        "Authors": "By Dunwell, Steve (PHT) and Linden, Blanche M. G.",
        "Description": "This visual guide combines contemporary photography, historic imagery, and engaging text to provide a colorful introduction to Boston's Freedom Trail. Exclusive access takes the viewer inside Faneuil Hall and Paul Revere's house, to \"\"Old Ironsides\"\" at dawn, and to Park Street Church at sunset. Paintings by J. S. Copley and engravings by the multi-talented Revere illuminate the key players and events of Boston in the revolutionary period.",
        "Category": " Photography , Subjects & Themes , Regional",
        "Publisher": "Back Bay Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Heart of Darkness (Classic, 20th-Century, Penguin)",
        "Authors": "By Conrad, Joseph and Hampson, R. G.",
        "Description": "A group of white men journeys up the Congo River to invade the jungles of the Belgian Congo, in an effort to rob the natives of their irovy.",
        "Category": " Fiction , Classics",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The Mysterious Adventures of Sherlock Holmes (Puffin Classics)",
        "Authors": "By Doyle, Arthur Conan, Sir",
        "Description": "Further adventures of Sherlock Holmes and Dr Watson.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Jazz Up Your Jeans: Tips & Tricks to Wake Up Your Wardrobe (American Girl Library)",
        "Authors": "By Whitney, Brooks and Bourget, Geri Strigentz (ILT)",
        "Description": "Instructions for adding excitement to one's wardrobe by dyeing, embroidering, and using other assorted decorating techniques.",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Immigrant Kids",
        "Authors": "By Freedman, Russell",
        "Description": "",
        "Category": "",
        "Publisher": "paperback no dj",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "What's Inside? My Body",
        "Authors": "By Angela Royston",
        "Description": "",
        "Category": "",
        "Publisher": "DK Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "A Walk to Remember",
        "Authors": "By Sparks, Nicholas",
        "Description": "A high school rebel and a minister's daughter find strength in each other in this star-crossed tale of \"young but everlasting love\" (Chicago Sun-Times).There was a time when the world was sweeter....when the women in Beaufort, North Carolina, wore dresses, and the men donned hats.... Every April, when the wind smells of both the sea and lilacs, Landon Carter remembers 1958, his last year at Beaufort High. Landon had dated a girl or two, and even once sworn that he'd been in love. Certainly the last person he thought he'd fall for was Jamie, the shy, almost ethereal daughter of the town's Baptist minister....Jamie, who was destined to show him the depths of the human heart-and the joy and pain of living. The inspiration for this novel came from Nicholas Sparks's sister: her life and her courage. From the internationally bestselling author Nicholas Sparks, comes his most moving story yet....",
        "Category": " Fiction , Romance , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Little Boys Book of Prayers for Toddlers",
        "Authors": "By Larsen, Carolyn, Turk, Caron (ILT), and Turk, Caron",
        "Description": "Presents simple, illustrated prayers for preschool boys.",
        "Category": " Religion , Prayerbooks , Christian",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Neanderthal Book & Skeleton (Hand in Hand with Nature)",
        "Authors": "By Cumbaa, Stephen, Lafave, Kim (ILT), Hehner, Barbara, and Stewart, Kathlyn Moore",
        "Description": "Introducing a caveman for kids. Following the enormous success of The Bones Book & Skeleton comes the Neanderthal Book & Skeleton, combining kids' love for bones with their curiosity about prehistoric life. Neanderthal transports kids back to the Stone Age. The 12-inch, 25-piece skeleton reveals the differences and similarities between modern humans and this early species. Included are replicas of a bone flute and flint-point spearhead. The full-color book is a fascinating guide to what we know about the Neanderthals, weaving together the methods of scientific deduction with projects and activities. Suitable for ages 7 and up.135,000 copies in print.",
        "Category": " Juvenile Nonfiction , Social Science , Archaeology",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Zack Files 01: My Great-grandpa's in the Litter Box (The Zack Files)",
        "Authors": "By Davis, Jack E. (ILT) and Greenburg, Dan",
        "Description": "What I wanted was a cute little kitten. Instead, I got a tough tomcat that talks. And that's not all! He says he's my Great-Grandpa Julius and he needs my help. And messy litter box or not, family is family!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "An Unwilling Conquest (Lester Family, 2)",
        "Authors": "By Laurens, Stephanie",
        "Description": "Notorious scoundrel Harry Lester, fleeing from London's matchmaking mothers and widows, arrives in the racing town of Newmarket only to find himself caught in a passionate trap unknowingly set by an independent widow named Lucinda Babbacombe who seems immune to him. Reprint.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Catch Me If You Can: The True Story of a Real Fake",
        "Authors": "By Abagnale, Frank W. and Redding, Stan",
        "Description": "The uproarious, bestselling true story of the world's most sought-after con man, immortalized by Leonardo DiCaprio in DreamWorks' feature film of the same name, from the author of Scam Me If You Can. Frank W. Abagnale, alias Frank Williams, Robert Conrad, Frank Adams, and Robert Monjo, was one of the most daring con men, forgers, imposters, and escape artists in history. In his brief but notorious criminal career, Abagnale donned a pilot's uniform and copiloted a Pan Am jet, masqueraded as the supervising resident of a hospital, practiced law without a license, passed himself off as a college sociology professor, and cashed over $2.5 million in forged checks, all before he was twenty-one. Known by the police of twenty-six foreign countries and all fifty states as \"The Skywayman,\" Abagnale lived a sumptuous life on the lam—until the law caught up with him. Now recognized as the nation's leading authority on financial foul play, Abagnale is a charming rogue whose hilarious, stranger-than-fiction international escapades, and ingenious escapes-including one from an airplane-make Catch Me If You Can an irresistible tale of deceit.",
        "Category": " True Crime , White Collar Crime",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Rainbow Six (John Clark Novel, A)",
        "Authors": "By Clancy, Tom",
        "Description": "In this #1 New York Times bestselling John Clark thriller, author Tom Clancy takes readers into the shadowy world of anti-terrorism and gets closer to reality than any government would care to admit... Ex-Navy SEAL John Clark has been named the head of Rainbow, an international task force dedicated to combating terrorism. In a trial by fire, Clark is confronted with a violent chain of seemingly separate international incidents. But there is no way to predict the real threat: a group of terrorists like none the world has ever encountered, a band of men and women so extreme that their success could literally mean the end of life on earth as we know it.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Walt Disney's The Jungle Book",
        "Authors": "By Disney",
        "Description": "Presents the adventures of Mowgli, a boy reared by a pack of wolves, and the wild animals of the jungle.A children's classic, featuring Mowgli, the Indian boy brought up by wolves in the jungle, his companions, Baloo and Bagheera, and his enemy, Shere Khan",
        "Category": "",
        "Publisher": "Smithmark+publishers Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "The Going-To-Bed Book",
        "Authors": "By Boynton, Sandra",
        "Description": "Getting ready for sleep is tons of fun in this Sandra Boynton classic.The sun has set not long ago. Now everybody goes below to take a bath in one big tub with soap all over—SCRUB SCRUB SCRUB! This classic bedtime story is just right for winding down the day as a joyful, silly group of animals scrub scrub scrub in the tub, brush and brush and brush their teeth, and finally rock and rock and rock to sleep.",
        "Category": " Juvenile Nonfiction , Health & Daily Living , Daily Activities",
        "Publisher": "Boynton Bookworks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1982"
        }
    },
    {
        "Title": "The Collectors (Camel Club Series)",
        "Authors": "By Baldacci, David",
        "Description": "While a gifted con artist plots against the most ruthless businessman in the world, the Camel Club must stop a renegade CIA agent from selling American secrets to the highest bidder in this #1 New York Times bestselling thriller.The assassination of the speaker of the House has rocked the nation. And the Camel Club has found a chilling connection with another death: that of the director of the Library of Congress's Rare Books and Special Collections Division.The club's unofficial leader, a man who calls himself Oliver Stone, discovers that someone is selling America to its enemies one secret at a time. Then Annabelle Conroy, the greatest con artist of her generation, comes to town and joins forces with the Camel Club for her own reasons. And Stone will need all the help she can give, because the two murders are hurtling the Camel Club into a world of espionage that is bringing America to its knees.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Red Lily (In the Garden, Book 3)",
        "Authors": "By Roberts, Nora",
        "Description": "Three women learn that the heart of their historic home holds a mystery of years gone by, as #1 New York Times bestselling author Nora Roberts brings her In the Garden trilogy to a captivating conclusion.A Harper has always lived at Harper House, the centuries-old mansion just outside of Memphis. And for as long as anyone alive remembers, the ghostly Harper Bride has walked the halls, singing lullabies at night…Hayley Phillips came to Memphis hoping for a new start, for herself and her unborn child. She wasn’t looking for a handout from her distant cousin Roz, just a job at her thriving In the Garden nursery. What she found was a home surrounded by beauty and the best friends she’s ever had—including Roz’s son Harper. To Hayley’s chagrin, she has begun to dream about Harper—as much more than a friend…If Hayley gives in to her desire, she’s afraid the foundation she’s built with Harper will come tumbling down. And that wouldn’t be the only consequence, since her dreams are tangled up with Roz and the nursery. Hayley will have to put the past behind her to know her own heart again—and to decide whether she’s willing to risk it…Don't miss the other books in the In the Garden TrilogyBlue DahliaBlack Rose",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "The Whispering Rabbit (A Little Golden Book)",
        "Authors": "By Brown, Margaret Wise and Szekeres, Cyndy (ILT)",
        "Description": "A rabbit who swallows a bee that proceeds to fall asleep in his throat attempts to wake the bee gently with quiet whispers",
        "Category": " Juvenile Fiction , Animals , Rabbits",
        "Publisher": "Golden Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Portrait Of A Killer: Jack The Ripper Case Closed",
        "Authors": "By Cornwell, Patricia Daniels",
        "Description": "Now updated with new material that brings the killer's picture into clearer focus.In the fall of 1888, all of London was held in the grip of unspeakable terror. An elusive madman calling himself Jack the Ripper was brutally butchering women in the slums of London’s East End. Police seemed powerless to stop the killer, who delighted in taunting them and whose crimes were clearly escalating in violence from victim to victim. And then the Ripper’s violent spree seemingly ended as abruptly as it had begun. He had struck out of nowhere and then vanished from the scene. Decades passed, then fifty years, then a hundred, and the Ripper’s bloody sexual crimes became anemic and impotent fodder for puzzles, mystery weekends, crime conventions, and so-called “Ripper Walks” that end with pints of ale in the pubs of Whitechapel. But to number-oneNew York Times bestselling novelist Patricia Cornwell, the Ripper murders are not cute little mysteries to be transformed into parlor games or movies but rather a series of terrible crimes that no one should get away with, even after death. Now Cornwell applies her trademark skills for meticulous research and scientific expertise to dig deeper into the Ripper case than any detective before her—and reveal the true identity of this fabled Victorian killer.In Portrait of a Killer: Jack the Ripper, Case Closed, Cornwell combines the rigorous discipline of twenty-first century police investigation with forensic techniques undreamed of during the late Victorian era to solve one of the most infamous and difficult serial murder cases in history. Drawing on unparalleled access to original Ripper evidence, documents, and records, as well as archival, academic, and law-enforcement resources, FBI profilers, and top forensic scientists, Cornwell reveals that Jack the Ripper was none other than a respected painter of his day, an artist now collected by some of the world’s finest museums: Walter Richard Sickert.It has been said of Cornwell that no one depicts the human capability for evil better than she. Adding layer after layer of circumstantial evidence to the physical evidence discovered by modern forensic science and expert minds, Cornwell shows that Sickert, who died peacefully in his bed in 1942, at the age of 81, was not only one of Great Britain’s greatest painters but also a serial killer, a damaged diabolical man driven by megalomania and hate. She exposes Sickert as the author of the infamous Ripper letters that were written to the Metropolitan Police and the press. Her detailed analysis of his paintings shows that his art continually depicted his horrific mutilation of his victims, and her examination of this man’s birth defects, the consequent genital surgical interventions, and their effects on his upbringing present a casebook example of how a psychopathic killer is created.New information and startling revelations detailed in Portrait of a Killer include:- How a year-long battery of more than 100 DNA tests—on samples drawn by Cornwell’s forensics team in September 2001 from original Ripper letters and Sickert documents—yielded the first shadows of the 75- to 114 year-old genetic evid...",
        "Category": " True Crime , Murder , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Death at Sea: A Murder Mystery in 3-D",
        "Authors": "By Oszustowicz, Len, Small, Brian (ILT), and Small, Brian",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "The Summit Publishing Group",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Chicka Chicka ABC (Chicka Chicka Book, A)",
        "Authors": "By Martin, Bill, Archambault, John, and Ehlert, Lois (ILT)",
        "Description": "Race to the top of the coconut tree with this delightful alphabet rhyme from the creators of Chicka Chicka Boom Boom.A told B, and B told C, \"I'll meet you at the top of the coconut tree.\"   So begins the lively alphabet rhyme that children and their parents love to recite. Martin and Archambault's rhythmic chant and Caldecott Honor artist Lois Ehlert's bold, cheerful art make this rollicking story an ideal companion to Chicka Chicka Boom Boom.",
        "Category": " Juvenile Fiction , Concepts , Alphabet",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Inventions and Discoveries (Brainbooster Series)",
        "Authors": "By Staff",
        "Description": "",
        "Category": "",
        "Publisher": "Educational Insights, Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "How Many Hippos?: A Mix-And-Match Counting Book (Time-life Early Learning Program)",
        "Authors": "By Time-Life Books, Time-Life for Children (Firm) (COR), Singer, Muff, and Cremins, Robert (ILT)",
        "Description": "Horizontally split pages permit the reader to mix and match numbered objects and illustrated activities, creating stories while learning to count.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "A Family For Carter Jones (Harlequin Historicals , No 433)",
        "Authors": "By Seymour, Ana",
        "Description": "A Family For Carter Jones by Ana Seymour released on Aug 25, 1998 is available now for purchase.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Harrigan's Bride (Harlequin Historicals, 439)",
        "Authors": "By Reavis, Cheryl",
        "Description": "Harrigan's Bride by Cheryl Reavis released on Oct 23, 1998 is available now for purchase.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Holy Bible, King James Version (King James Bible)",
        "Authors": "By Publishing, Barbour",
        "Description": "The life-changing power of God's Word has never been more affordable! This attractive, paperback edition of the Holy Bible (King James Version) includes both the Old and New Testaments--the complete text of Scripture--plus a special page that clearly explains God's plan of salvation through faith in Christ. This Barbour Bargain Book edition is ideal for quantity purchases for churches, schools, and ministry outreach. Bob.",
        "Category": " Bibles , King James Version , Text",
        "Publisher": "Barbour Bibles",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1970"
        }
    },
    {
        "Title": "Space Invaders!",
        "Authors": "By Albee, Sarah, Zalme, Ron (ILT), and Willson, Sarah",
        "Description": "Help! Space creatures have invaded Tommy's backyard! Sure that the aliens have come for their moms and dads, the Rugrats bravely face the enemy. The babies even use their best weapon, and the invaders turn out not to be so tough, after all -- just a little messy!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "5.74",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Pierrot's ABC Garden: A Little Golden Book",
        "Authors": "By Lobel, Anita",
        "Description": "Pierrot gathers fruits and vegetables representing the letters of the alphabet from his garden, loads them on his zebra, and takes them to his beloved Pierrette",
        "Category": "",
        "Publisher": "Western Publishing Company",
        "Price Starting With ($)": "12.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "A Thief of Time",
        "Authors": "By Hillerman, Tony",
        "Description": "A noted anthropologist vanishes at a moonlit Indian ruin where \"thieves of time\" ravage sacred ground for profit. When two corpses appear amid stolen goods and bones at an ancient burial site, Navajo Tribal Policemen Lt. Joe Leaphorn and Officer Jim Chee must plunge into the past to unearth the astonishing truth behind a mystifying series of horrific murders.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Bad Place",
        "Authors": "By Koontz, Dean R.",
        "Description": "After repeatedly waking up in strange places and not knowing how he arrived there, Frank Pollard enlists the help of Nick and Julie Dakota, a husband-and-wife detective team, to watch where he goes in his sleep",
        "Category": " Fiction , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "Salad Herbs: Library of Culinary Arts",
        "Authors": "By Norman, Jill",
        "Description": "Identifies and illustrates a wide range of herbs, offers hints on growing and storing them, and includes a selection of recipes featuring herbs",
        "Category": " Cooking , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Spices: Roots & Fruits (Bantam Library of Culinary Arts)",
        "Authors": "By Norman, Jill",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Fruit",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Beautiful Braids",
        "Authors": "By Coen, Patricia and Maxwell, Joe",
        "Description": "Demonstrates a dozen hair braiding styles, including English, Dutch, and French, and offers tips on creating attractive braids",
        "Category": "",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1983"
        }
    },
    {
        "Title": "Mouse Paint",
        "Authors": "By Walsh, Ellen Stoll",
        "Description": "One day three white mice discover three jars of paint--red, blue, and yellow. Both parents and children alike will appreciate this lighthearted presentation of a lesson in color. “Walsh’s cut-paper collage illustrations have bold colors and just the right simplicity for the storyline. A real charmer that’s great fun as well as informative.”--School Library Journal",
        "Category": " Juvenile Fiction , Concepts , Colors",
        "Publisher": "Harcourt, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "My Little Bible",
        "Authors": "By Hollingsworth, Mary and Britt, Stephanie McFetridge (ILT)",
        "Description": "The My Little Bible series has simple Bible stories, memory verses, prayers and psalms for young readers and attractive art.  A world-wide bestseller in several languages.",
        "Category": " Juvenile Nonfiction , Religion , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Houghton Mifflin Soar to Success: Paperback Level 8 Lost Expedition",
        "Authors": "By Read (COR)",
        "Description": "",
        "Category": " Young Adult Nonfiction , Language Arts , General",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Desire Me Only",
        "Authors": "By Devine, Thea",
        "Description": "Recent widow Lady Diandra Reynell returns to London from India and comes face to face with her arrogant stepson, Justin, who believes that Diandra may be responsible for the murder of his father and vows to uncover the truth, regardless of his forbidden passion for the lovely widow, in an erotic tale of love and adventure. Original. 45,000 first printing.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Kensington",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Dinosaur Dinners (Eyewitness Readers, Level 2)",
        "Authors": "By Taylor, Barbara and Davis, Lee",
        "Description": "Follows a baby Maiasaurus on its first day out of the nest, describing the habits and behavior of the many other dinosaurs it meets",
        "Category": " Juvenile Nonfiction , Music , General",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    }
]