[
    {
        "Title": "World Book of Americas Presidents Vol. 1 The Presidents World",
        "Authors": "By World Book Inc",
        "Description": "",
        "Category": " History , United States , General",
        "Publisher": "World Book Encyclopedia, Inc",
        "Price Starting With ($)": "7.01",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Tillie and Mert (An I Can Read Book)",
        "Authors": "By Cushman, Doug (ILT) and Luttrell, Ida",
        "Description": "Best friends Tillie and Mert do everything together, from buying \"bargains\" at Weasel's garage sale to telling fortunes and opening their own grocery store.",
        "Category": "",
        "Publisher": "Harpercollins Childrens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1985"
        }
    },
    {
        "Title": "The Men and The Girls",
        "Authors": "By Trollope, Joanna",
        "Description": "Lifelong friends, now in their sixties, James Mallow, a teacher, and Hugh Hunter, a television personality, are both enjoying happy relationships with women twenty-five years their junior. James's partner of eight years, Kate Bain, appears devoted, though she will not marry him. Hugh's perfect wife, Julia, runs him, her career, their house, and their twins like clockwork. The men and the girls seem wonderfully suited.But the age difference is a time bomb ticking away at the heart of both relationships. The first signs of difficulty coincide with the appearance of an older and fiercely independent woman who unintentionally fuels the discontent already brewing in both girls. Kate's suppressed hunger for a life more natural to her age suddenly boils over; Julia, meanwhile, has to cope with her own blossoming career while watching Hugh's wither before their eyes.With warmth and wisdom, plus the acerbic sense of humor for which the English are so well known, Trollope takes a long hard look at the gaps between generations, and how very much we can learn from them.",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "16.82",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "The American Indian: perspectives for the study of social change",
        "Authors": "By Fred Eggan",
        "Description": "",
        "Category": "",
        "Publisher": "Aldine Publishing",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Psychotherapy for Women: Treatment Toward Equality",
        "Authors": "By Rawlings, Edna I. and Carter, Dianne K.",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Charles C Thomas Pub Ltd",
        "Price Starting With ($)": "8.2",
        "Publish Date": {
            "Month": "February",
            "Year": "1977"
        }
    },
    {
        "Title": "Lee's Terrible Swift Sword: From Antietam to Chancellorsville- An Eyewitness History",
        "Authors": "By Wheeler, Richard",
        "Description": "A look at the nine-month period in the Civil War that saw three great battles fought chronicles the period from Lee's first attempt to invade the North to the battle that preceded his defeat at Gettysburg. 10,000 first printing.",
        "Category": "",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Heaven Eyes",
        "Authors": "By Almond, David",
        "Description": "Erin Law and her friends are Damaged Children. At least that is the label given to them by Maureen, the woman who runs the orphanage that they live in. Damaged, Beyond Repair because they have no parents to take care of them. But Erin knows that if they care for each other they can put up with the psychologists, the social workers, the therapists -- at least most of the time. Sometimes there is nothing left but to run away, to run for freedom. And that is what Erin and two friends do, run away one night downriver on a raft. What they find on their journey is stranger than you can imagine, maybe, and you might not think it's true. But Erin will tell you it is all true. And the proof is a girl named Heaven Eyes, who sees through all the darkness in the world to the joy that lies beneath.",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Iridescent, Madly",
        "Authors": "By Burch, Wendy Jeanne",
        "Description": "",
        "Category": "",
        "Publisher": "Epicenter Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "What are the Seven Wonders of the World?: And 100 Other Great Cultural Lists--Fully Explicated",
        "Authors": "By Depiro, Peter and Pinkowish, Mary Desmond",
        "Description": "Can you name...Newton's 3 laws of motion?The 4 horsemen of the Apocalypse?The 5 pillars of Islam? The 6 wives of Henry VIII?The 7 kinds of plane triangles? The 8 Beatitudes?If you're not sure about the answers to the above, this is the book for you. A compendium of 101 culturally significant particulars from the fields of mythology, religion, literature, history, science, mathematics, art, and music,What Are the 7 Wonders of the World? is a stimulating fusion of facts and fun that makes for an invaluable reference and an entertaining diversion.Questions are grouped in sections according to the number of items in their answer (all the 3s, all the 4s, all the 5s, etc.), so that the answers are in the form of easily memorized lists. You won't find Luther's 95 theses, or the 264 Popes, for example, but you will find everything from the 3 sons of Adam and Eve all the way up to the 24 letters of the ancient Greek alphabet.This clever format lends itself well to quizzing and guessing, which gives it a deliciously sophisticated parlor-game quality. But for those who wish to delve a little deeper, there are thoughtful essays to go with each answer that include fascinating details and place the list in its larger cultural or historical context. Much more than a book of trivia,What Are the 7 Wonders of the World? offers a grand overview of the knowledge needed to appreciate many of the finest things in our cultural and intellectual life.",
        "Category": " Reference , Curiosities & Wonders",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Poetry: A Pocket Anthology (Penguin Academics)",
        "Authors": "By Gwynn, R. S. (EDT)",
        "Description": "This brief, affordable poetry collection features over 250 poems, and presents a diverse body of work ranging from William Shakespeare and John Milton to Rita Dove and Adrienne Rich.    Wide range of selections (arranged chronologically) from the popular ballads to poets born in the 60's. \"Writing About Poetry\" section offers readers the most basic tips on organization, style, and MLA style citation. \"An Anecdote: Where Poetry Starts\" is a narrative account of a campus poetry reading with a discussion of poetry as oral performance art. \"A Brief Note: Literary History and Poetic Conventions\" a discussion of how schools of poetry have dominated during certain historical periods. Index of critical terms provides a cross-referenced list of terms covered.   For anyone interested in poetry.",
        "Category": " Literary Criticism , Poetry",
        "Publisher": "Longman",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "A Beginner's Guide to the World Economy",
        "Authors": "By Epping, Randy Charles",
        "Description": "In a time of rapid change in the world economy, this fascinating, concise, and user-friendly primer is the most reliable tool for keeping track of  what's happening.  What is the new economy? What is globalization?  Is the euro the final seal on European Union? How is e-commerce transforming our  world beyond economics? What is virtual money, and does it have real value? How do  social concerns and societal ills (drugs, poverty, AIDS, endangered natural resources)  play a part in the rapidly changing world economy? What are multinationals, and do  they signal the end of nationalism? These and many other pertinent issues are addressed in an enlightening and entertaining handbook for those who want to be economically literate  (and who doesn't?).",
        "Category": " Business & Economics , International , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Dirty Sexy Knitting (A Malibu and Ewe Novel)",
        "Authors": "By Ridgway, Christie",
        "Description": "Conclusion to the trilogy that started with How to Knit a Wild Bikini and Unravel Me. Malibu & Ewe’s owner, Cassandra Riley, is about to turn thirty and wants to celebrate with her knitting club and her newfound half-sisters, Nikki and Juliet, in a big birthday extravaganza. But with Juliet on her honeymoon and Nikki with her fiancé, it seems everyone’s paired up-except for Cassandra. Until a series of near-death accidents causes Cassandra to run straight into the arms of the one man she's avoided most.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Voice for the World's Poor: Selected Speeches and Writings of World Bank President James D. Wolfensohn, 1995-2005",
        "Authors": "By Wolfensohn, James D. and Kircher, Andrew",
        "Description": "As president of the World Bank, James Wolfensohn managed operations in almost 150 countries and was responsible for tens of billions of dollars in aid to the world's poorest nations. During his ten years and visits to more than 120 countries, Wolfensohn tirelessly drew the world's attention to the need to provide hope and a better future for the world's poor. He transformed the World Bank, made it more open and transparent, and integrated the views of the poor into development planning. He also changed the face and the character of an institution that was previously seen by many as heartless and arrogant. By describing the challenge of development in terms of people, and not only numbers, Wolfensohn put the spotlight back on the World Bank's real purpose—fighting global poverty and helping the world's poor forge a better life.'Voice for the World's Poor' brings together the most important and inspiring speeches and writings by James Wolfensohn during his time as World Bank president. Spanning all ten years of his presidency (1995-2005), the book presents Wolfensohn's most stimulating and thought-provoking ideas on critical global issues including poverty, debt relief, corruption, HIV/AIDS, climate change, human rights, and globalization. Written during some of the most tumultuous times in recent history, Wolfensohn addresses and examines key global events and issues, from Bosnia's reconstruction, the Asian financial crisis, and the rise of the antiglobalization movement to the terrorist attacks of September 11, 2001, the aftermath of the Iraq war, and the outpouring of help for the victims of the tsunami of December, 2004.Over 100 speeches, essays, and letters chart Wolfensohn's thinking on development and his emergence as an advocate and voice for the world's poor. This book will be an invaluable resource for anyone interested in international relations, international development, the World Bank, and James Wolfensohn himself.",
        "Category": " Business & Economics , Development , Business Development",
        "Publisher": "World Bank Publications",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Who's Going to Take Care of Me?",
        "Authors": "By Hale, James Graham (ILT) and Magorian, Michelle",
        "Description": "With his big sister Karin now going to school with the bigger kids, little Eric worries about attending day care all by himself, until Eric meets a little boy who is even smaller and more lost than he is",
        "Category": "",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "All That Matters",
        "Authors": "By Holm, Stef Ann",
        "Description": "When a megastore grocery chain threatens to shut down the new boutique bakery Chloe Lawson's worked so hard to establish, she's furious. Her life may not be picture-perfect, but her custom cakes and pastries are becoming the talk of Boise, and she'd like to keep it that way.Chloe needs a champion, and handsome, widowed John Moretti turns out to be it. A high-powered lawyer whose two rebellious teenagers are the only people he doesn't seem able to impress, John is shocked to find himself fighting for Chloe's little cause, much less falling for her. But once he samples her home-baked charms, he's hooked--and determined to make her a permanent part of his family.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Through Our Enemies' Eyes: Osama bin Laden, Radical Islam, and the Future of America",
        "Authors": "By Scheuer, Michael (EDT)",
        "Description": "All Americans must read this book in order to truly understand the reasons why radical Muslims like Osama bin Laden and his followers have declared war on America and the West. Furthermore, only this book accurately describes the severity of the threat they will continue to pose, with or without bin Laden’s leadership, to our national security.To win the war against terrorism, the author argues that we must first stop dismissing militant Muslims as “extremists” or “religious fanatics.” Formulating a successful military strategy requires that we must see the enemy as they perceive themselves—highly trained and motivated soldiers who fervently believe their cause is righteous. The author describes how militants throughout the Islamic world are enraged by what they believe is Western aggression against their people, religion, and culture. Though bin Laden declared war on America years ago—not once but twice—the author argues that American complacence in the face of such violent threats stems from the increasing secularization and moral relativism of American society and culture. Even if bin Laden is brought to justice, the author warns, the dangers posed by radical Islamic militants will not disappear, and we must be prepared for a protracted war against terrorism. This important book will make a major impact on how America thinks about its enemy and itself.",
        "Category": " Political Science , Terrorism",
        "Publisher": "POTOMAC BOOKS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Shaman's Crossing: Book One of The Soldier Son Trilogy",
        "Authors": "By Hobb, Robin",
        "Description": "Nevare Burvelle was destined from birth to be a soldier. The second son of a newly anointed nobleman, he must endure the rigors of military training at the elite King's Cavella Academy&#8212and survive the hatred, cruelty, and derision of his aristocratic classmates&#8212before joining the King of Gernia's brutal campaign of territorial expansion. The life chosen for him will be fraught with hardship, for he must ultimately face a forest-dwelling folk who will not submit easily to a king's tyranny. And they possess an ancient magic their would-be conquerors have long discounted&#8212a powerful sorcery that threatens to claim Nevare Burvelle's soul and devastate his world once the Dark Evening brings the carnival to Old Thares.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Harper Voyager",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Born to Rock",
        "Authors": "By Korman, Gordon",
        "Description": "When Leo Caraway, president of the Young Republicans Club, gets his scholarship to Harvard taken away, he turns to his real father, a lead singer in a punk rock band whom Leo has just recently learned is his father, in hopes that dad will pay for his tuition, but Leo's summer job as the band's roadie teaches him a lot about his dad, his friends, and himself.",
        "Category": " Young Adult Fiction , Family , Parents",
        "Publisher": "Hyperion Books for Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Lessons in Heartbreak",
        "Authors": "By Kelly, Cathy",
        "Description": "From #1 bestselling Irish novelist Cathy Kelly, one woman’s journey to truly know the family she’s always loved…Lessons in Heartbreak.Izzie Silver—a warmhearted Irishwoman with a mane of chestnut hair and a zest for life—is a New York success story, a highly successful booking agent at a top-notch modeling agency. But while she dreams of starting an agency for plus-sized models, at heart she's still the convent schoolgirl from the exquisite Irish coastal town of Tamarin. Which is why falling in love with a married man is something Izzie couldn't possibly imagine herself doing—until it happens. And it's something she feels she could never tell her beloved family. Meanwhile, back in Tamarin, there's heartache, too. Izzie's aunt Anneliese is trying to hide her pain at her husband's betrayal of their marriage. And Lily—family matriarch and still feisty despite being nearly ninety—is taken ill. In her hospital bed, she reveals a tantalizing hint of a secret she has kept for decades, from her time as a 1930s servant girl at the local big house, before she ran off to London during World War Two to train as a nurse. Will the family be torn apart by the secrets they can't reveal...or will they have the courage to share their heartbreak and their joy?",
        "Category": " Fiction , Family Life",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "The Church Potluck Supper Cookbook: Over 500 Hearty, Delicious Recipes for Friends, Family, and Community",
        "Authors": "By Robinson, Elaine",
        "Description": "A collection of more than five hundred dishes culled from church suppers across America includes recipes for New England fish chowder, popovers, peanut butter-cream cheese pie, and other tasty favorites. Original.",
        "Category": " Cooking , General",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "The Mystery of Blackbeard the Pirate (3) (Real Kids Real Places)",
        "Authors": "By Marsh, Carole",
        "Description": "",
        "Category": "",
        "Publisher": "Gallopade International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Gossamer",
        "Authors": "By Lowry, Lois",
        "Description": "Where do dreams come from? What stealthy nighttime messengers are the guardians of our most deeply hidden hopes and our half-forgotten fears? Drawing on her rich imagination, two-time Newbery winner Lois Lowry confronts these questions and explores the conflicts between the gentle bits and pieces of the past that come to life in dream, and the darker horrors that find their form in nightmare. In a haunting story that tiptoes between reality and imagination, two people—a lonely, sensitive woman and a damaged, angry boy—face their own histories and discover what they can be to one another, renewed by the strength that comes from a tiny, caring creature they will never see.Gossamer is perfect for readers not quite ready for Lois Lowry's Newbery-Award winner The Giver and also for readers interested in dreams, nightmares, spirits and the dream world.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "The Song of Hiawatha (Everyman's Library)",
        "Authors": "By Longfellow, Henry Wadsworth and Aaron, Daniel (EDT)",
        "Description": "The epic story of Hiawatha and his fantastic magical powersAngered by the sight of warring nations, Gitche Manito, Mohican Masters of Life, sends for the prophets Hiawatha to bring peace. Brought up by his grandmother on the shores of Lake superior, Hiawatha learns to use his remarkable powers for good of humanity: wearing his magic moccasins he covers a mile with every step; grinds boulders to dust with his special mittens: speaks with all kinds of animals and birds in their own language. Overcoming evil forces, Hiwatha offers the gift of civilization to the world. His marriage to Minnehaha leads to golden age of happiness and peace–unitl the reappearance of mischievous spirits leads Hiawatha into further adventures.The song of Hiawathareflects the traditional Native American way of story–telling.Highly controversial when first published, Longfellow's epic poem has nonetheless created a legend still loved by millions.The most comprehensive paperback edition available, including introduction and chronology of Longfellow's life and times",
        "Category": " Poetry , American , General",
        "Publisher": "Everyman Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "In The Blue Before Night.",
        "Authors": "By MCGRATH, BETH.",
        "Description": "",
        "Category": "",
        "Publisher": "Whatley, MA:Heatherstone Press,",
        "Price Starting With ($)": "11.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Parent's Journal: Guide to Raising Great Kids",
        "Authors": "By Conner, Bobbi",
        "Description": "The Parent's Journal Guide to Raising Great Kids is a comprehensive book of ingredients for raising children. It is based upon Bobbi Conner's experience as a mother and upon the ten years of research and broadcast interviews Bobbi has conducted in putting together \"The Parent's Journal,\" her award-winning public radio show that reaches 1.4 million parents a week. The Parents Journal Guide identifies the most important things every child needs in order to develop and thrive, and presents easy, everyday opportunities to meet these needs though the ordinary daily routine of parents and children.Through over 700 in-depth interviews on topics ranging from temper tantrums to kids in sports to baby's first words to homework hassles, Bobbi has sifted through a vast assortment of parenting information to find the best tried and true parenting wisdom. Each chapter of The Parents Journal Guide is formatted to include three distinctive, accessible components: What Kids Need, Parent's Job Description, and Everyday Opportunities, and will include information targeting the different stages in your child's life.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Never Deceive a Duke",
        "Authors": "By Carlyle, Liz",
        "Description": "They call her the porcelain princess...    With her fragile beauty and regal bearing, the Duchess of Warneham knows how to keep her admirers at a distance. Twice wed and twice widowed, Antonia has vowed never again to marry; never again to surrender her freedom. But when her husband's death is deemed suspicious, and his long-lost heir returns to seize control of the dukedom, she finds that fate has placed her future in yet another man's hands -- but not just any man.   They call him a cold-hearted bastard...    Deep in London's docklands, Gareth Lloyd runs Neville Shipping with an iron fist. Unrecognizable as the starving orphan who was abandoned by his family and sent an ocean away from home, Gareth has put his troubled past behind him. That is, until the Duke of Warneham is murdered, and Gareth turns out to be the dynasty's last living heir. Wrenched from his solitude, Gareth neither wants nor needs the honors and obligations of nobility -- especially the Duke's all-too-tempting widow.... Or does he?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "A Taste of the West from Coors",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Treasury of Wit & Wisdom: 4,000 of the Funniest, Cleverest, Most Insightful Things Ever Said",
        "Authors": "By Reader's Digest Association (NA)",
        "Description": "",
        "Category": "",
        "Publisher": "Reader's Digest Association",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "God at Your Wits' End: Hope for Wherever You Are",
        "Authors": "By Meberg, Marilyn",
        "Description": "The good news about being at our wits' end is that God meets us there.To be human is to spend some time at our wits' end?in confusion, desperation, pain, and fear. In that difficult place, we long for a tangible, visible sign that God hears our cries and is actively working for good in our lives. But all too often, faulty thinking erodes our faith and alters our beliefs, causing us to ask;If He loves me so much, why do I hurt so much?Am I being punished? I thought I was forgiven.Why is faith so hard? What if I don't have enough?Why does God allow suffering?In God at Your Wits' End, Marilyn Meberg helps us cut through the mental clutter and confusion that lead to faulty thinking and shaky faith. She tenderly acknowledges our trials by revealing her own wits'-end experiences; then she points the way to rescue and respite by sharing the scriptural truths of God's enduring love and sovereign power.",
        "Category": " Religion , Faith",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "1519 All-Natural, All-Amazing Gardening Secrets: Expert Tips for gardens and Yards of All sizes",
        "Authors": "By Reader's Digest Association (COR)",
        "Description": "Did you know that pepper will repel squirrels and coffee grounds leaf-eating insects? That a little liquid soap adds punch to fertilizers and pesticides? Or that the best time to cut roses is early morning or late evening? You'll find lots of secrets from the experts like these in this handy new guide. From rescuing tired tomato plants to keeping lawn weeds at bay, these tricks will have you working magic in your garden--with less effort, less time, and less money! Other hints show you how to select work-saving tools, create invisible stakes, use sawdust and seaweed mulches, and keep the dog from digging up your new flowerbed.",
        "Category": " Gardening , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "2015"
        }
    },
    {
        "Title": "The Heritage of Southern Cooking",
        "Authors": "By Glenn, Camille",
        "Description": "Camille Glen shares the rich heritage of fine Southern cuisine in this lavish collection of 550 delectable recipes. Nostalgically illustrated with over 200 photographs portraying a memorable South, recipes include Washington Waterfront Pickled Shrimp and Very Special Cheese Straws, Sea Island Chowder, Kentucky Burgoo, Piquant Ham with Juniper Berries, Spitted Duck with Kumquats, Fresh Green Pea Pie, Carolina Grits Souffle, and Maryland Crab Cakes. There are scores of breads, including Sour Cream Cornmeal Batter Cakes and the Ultimate Extra-Flaky Biscuit, and 40 recipes for the condiments so dear to the South. Plus, here are no fewer than 90 desserts, including CamilleIs Golden Cointreau Cake, which holds a secret all to itself. Selection of the Book-of-the-Month Club, Book-of-the-Month Cooking & Crafts Club, and main selection of the Quality Paperback Book Club and Better Homes & Gardens Family Book Service. 172,000 copies in print.",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Prevention's Outsmart Diabetes 1-2-3",
        "Authors": "By Editors of Prevention",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale Press, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "759 Secrets for Beating Diabetes",
        "Authors": "By Reader's Digest",
        "Description": "",
        "Category": "",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Bachelor",
        "Authors": "By Phillips, Carly",
        "Description": "After news of his mother's weak heart summons him home, globetrotting journalist Roman Chandler loses a coin toss with his brothers that determines who will relinquish his bachelor status to give their mother a grandchild. Roman decides to \"settle down\" without giving up his travel-intensive job, and as one of the most handsome men in town, he can have his pick of the local women--except for Charlotte Bronson, his high school crush. Thoughts of her parents' miserable long-distance marriage keep Charlotte from accepting Roman's proposal, despite the sexual sparks that fly at their every encounter. Mutual attraction eventually proves too powerful to resist, however, but first Roman must win her trust....",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Fortunes Rocks",
        "Authors": "By Shreve, Anita",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Essentials of Deeper Sport Diving",
        "Authors": "By Lippman, John",
        "Description": "Physiological and practical considerations of scuba diving in easy-to-read format.",
        "Category": " Sports & Recreation , Winter Sports",
        "Publisher": "Aqua Quest Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Walking Magazine The Complete Guide To Walking: for Health, Fitness, and Weight Loss",
        "Authors": "By Fenton, Mark",
        "Description": "A 52-Week Plan for increased energy, reduced stress, improved mood, permanent weight loss, and a longer, healthier life from the experts at Walking Magazine.",
        "Category": " Sports & Recreation , Walking",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Save $20,000 with a Nail: More Than 1,900 Practical Tips for a Problem-Free Home",
        "Authors": "By Reader's Digest",
        "Description": "",
        "Category": "",
        "Publisher": "Reader's Digest Association",
        "Price Starting With ($)": "13.98",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Natural Solution To Diabetes: Featuring The 10 Percent Plan",
        "Authors": "By Harper, Pat, Laliberte, Richard, and Petit, William A.",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Safe Food",
        "Authors": "By Jacobson, Michael F., Lefferts, Lisa Y., and Garland, Anne Witte",
        "Description": "A guide to minimizing exposure to additives and pollutants in foods shows readers how to prepare safer meals, encourage the local supermarket to stock safe food, eat wisely during pregnancy, store foods the smart way, and more. Reprint.",
        "Category": "",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Food Cures: Breakthrough Nutritional Prescriptions for Everything from Colds to Cancer",
        "Authors": "By Reader's Digest Staff",
        "Description": "",
        "Category": "",
        "Publisher": "Reader's Digest Inc.",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Godmother",
        "Authors": "By Adams, Carrie",
        "Description": "Nothing scares Tessa King more than the thought she will never have children. It doesn't matter how good her life is, and it is, it never feels good enough. She has four godchildren and dozens of friends, yet love eludes her. She knows how good a mother she could be, if only she had the chance. And then one terrible day she does, and Tessa learns firsthand that life on the other side of that white picket fence is more complicated than she ever could have imagined.Heartwarming, funny, and genuine, The Godmother speaks to anyone who has wondered about the next step and reminds us that happily-ever-after is just the beginning of the story.",
        "Category": " Fiction , General",
        "Publisher": "Harper-perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Classic American Food Without Fuss:: Over 100 Favorite Recipes Made Easy",
        "Authors": "By McCullough, Frances and Witt, Barbara",
        "Description": "McCullough and Wit have chosen their favorite classics and - in the fine tradition of The 60-Minute Gourmet - streamlined the procedures to fit the needs of today's cooks. The authors point out where a little more effort will make a big difference in taste, and the dishes can be gussied up or dressed down to suit any occasion.Along with each recipe, McCullough and Witt provided, with their inimitable panache, a mini-history of the dish's origins: about Chicken with 40 Cloves of Garlic, they note, \"This dish had a hard time getting out of Provence, its native home. In London in the early part of this century they could scarcely believe a person could eat so much garlic and live.\"In Classic American Food Without Fuss, the authors create an indispensable collection for the home cook, whether novice or accomplished chef.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Just Jane: A Daughter of England Caught in the Struggle of the American Revolution (Great Episodes)",
        "Authors": "By Lavender, William",
        "Description": "When Lady Jane, orphaned daughter of an English earl, arrives in Charlestown, South Carolina, in 1776, she finds herself in the middle of a heated war--a war not only between her former country and her new home but one between the members of her own family, whose loyalties are strongly divided in America's fight for freedom. Torn by family feuds, the war, a secret romance, and her own growing need for independence, Jane struggles for the courage to become the person she wants to be: just Jane. Includes a reader's guide.",
        "Category": " Young Adult Fiction , Family , General",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Country Tea Parties",
        "Authors": "By Bucha, Carolyn (ILT) and Stuckey, Maggie",
        "Description": "From intimate get-togethers to large social events, tea is the perfect excuse for delightful parties of all kinds. Whether you're looking for traditional menus of teas and delicate accoutrements or you want to host a unique party filled with unforgettable personal touches, Country Tea Parties teems with creative, eminently doable ideas to fit any occasion. Fill your house with fragrant rose petals and invite some friends over to cozy up around a fresh warm pot.",
        "Category": " Cooking , Beverages , Coffee & Tea",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Whales on Stilts: M. T. Anderson's Thrilling Tales",
        "Authors": "By Anderson, M. T. and Cyrus, Kurt (ILT)",
        "Description": "What sort of madman would unleash an army of stilt-walking, laser-beaming, thoroughly angry whales upon the world? Who cares! All that matters is that his dastardly plan be foiled. Lucky for Lily Gefelty, her two best friends are the intrepid stars of their own middle-grade series novels: Jasper Dash (better know as the Boy Technonaut) and Katie Mulligan (beloved by millions as the heroine of the Horror Hollow series). It's going to take all their smarts to stop this insane, inane plot from succeeding.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Harcourt Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Such a Long Journey",
        "Authors": "By Mistry, Rohinton",
        "Description": "It is Bombay in 1971, the year India went to war over what was to become Bangladesh. A hard-working bank clerk, Gustad Noble is a devoted family man who gradually sees his modest life unravelling. His young daughter falls ill; his promising son defies his father’s ambitions for him. He is the one reasonable voice amidst the ongoing dramas of his neighbours. One day, he receives a letter from an old friend, asking him to help in what at first seems like an heroic mission. But he soon finds himself unwittingly drawn into a dangerous network of deception. Compassionate, and rich in details of character and place, this unforgettable novel charts the journey of a moral heart in a turbulent world of change.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "The French Lieutenant's Woman",
        "Authors": "By Fowles, John",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1981"
        }
    },
    {
        "Title": "In the Trenches: Selected Speeches and Writings of an American Jewish Activist 2000-2001",
        "Authors": "By Harris, David A.",
        "Description": "",
        "Category": " Religion , Judaism , General",
        "Publisher": "Ktav Pub & Distributors Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Bipolar Disorder: A Guide for Patients and Families (2nd Edition)",
        "Authors": "By Mondimore, Francis Mark",
        "Description": "Bipolar disorder can be devastating. It can disrupt relationships and careers, it can wreak havoc on family life, and, when not properly treated, it can be fatal. Since 1999 this compassionate and comprehensive guide has helped tens of thousands of people cope with this complex disease. This, the second edition of  Bipolar Disorder, is thoroughly updated and discusses promising new options for diagnosis and treatment along with new information on the disease's genetic components.Bipolar disorder is difficult to diagnose. Dr. Mondimore explains how symptoms fluctuate in persons with seasonal affective disorder, how they can lead to a mistaken diagnosis of attention deficit–hyperactivity disorder in children, and how they may be made worse by alcohol or drug addiction. The disease can also be difficult to treat. Dr. Mondimore gives advice about how to pick a psychiatrist and cope with the stigma of psychiatric diagnosis. He provides extensive information on treatment options, including the advantages, disadvantages, and side effects of various drug therapies. He also describes what it is like to live with bipolar disorder and discusses how lifestyle changes can improve quality of life. Throughout, he focuses on the importance of building a support system, planning for emergencies, and giving yourself permission to seek help.",
        "Category": " Psychology , General",
        "Publisher": "Johns Hopkins University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Final Seconds",
        "Authors": "By Lutz, John",
        "Description": "JOHN LUTZ IS. . .\"A MAJOR TALENT.\" –John Lescroart\"ONE OF THE MASTERS.\" –Ridley Pearson\"IN RARE FORM.\" –The New York Times Book Review\"AMONG THE BEST.\" –San Diego UnionTHE HUNT BEGINS. . .AGAINWill Harper was an NYPD hero. Then fate, a fiery blast, and departmental politics burned down his career. Now Will is again in the line of fire as a disgraced FBI profiler pulls him back into the action--on a hunt for a serial killer authorities don't even know about yet.\"Fast-paced. . .Edge-of-your-seat suspense mixes well with a hefty dose of reality.\"--Publishers Weekly\"Lutz always delivers the goods, and this is no exception.\"--Booklist",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Pinnacle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Fodor's Scandinavia, 9th Edition: The Guide for All Budgets, Completely Updated, with Many Maps and Travel Tips (Travel Guide)",
        "Authors": "By Fodor's Travel Publications, Inc. (NA)",
        "Description": "No matter what your budget or whether it's your first trip or fifteenth, Fodor's Gold Guides get you where you want to go.  In this completely up-to-date guide our experts who live in Scandinavia give you the inside track, showing you all the things to see and do -- from must-see sights to off-the-beaten-path adventures, from shopping to outdoor fun.  Fodor's Scandinavia shows you hundreds of hotel and restaurant choices in all price ranges -- from budget-friendly B&Bs to luxury hotels, from casual eateries to the hottest new restaurants, complete with thorough reviews showing what makes each place special.  The Smart Travel Tips A to Z section helps you take care of the nitty gritty with essential local contacts and great advice -- from how to take your mountain bike with you to what to do in an emergency. Your personal supply of Post-it? flags makes it easy to mark your favorite listings.  Plus, web links, costs, and mix-and-match itineraries make planning a snap.",
        "Category": " Travel , Europe , Scandinavia (Finland, Norway, Sweden)",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.38",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "The Art of Teaching",
        "Authors": "By Highet, Gilbert",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1954"
        }
    },
    {
        "Title": "Stat for 21st Century",
        "Authors": "By Duncan, Joseph W. and Gross, Andrew C.",
        "Description": "Deciphers the true meaning behind private and public sector statistical data in productivity, resources, trade, and spending, and explains how to make valid interpretations of current statistics. Recommends improvements in generating meaningful data reflecting rapid changes in global, political, economic, and social structures. Includes numerous b&w tables and charts. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Political Science , General",
        "Publisher": "McGraw-Hill Companies",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Wit's End",
        "Authors": "By Fowler, Karen Joy",
        "Description": "Set in contemporary Santa Cruz, Wit's End opens as Rima Lanisell arrives at her godmother's old Victorian mansion, weary from her recent losses - an inventive if at times irritating father, a beloved brother. (Indeed, Rima seems to loose things habitually - sunglasses and keys, lovers and family members.) At loose ends, she has come to coastal California to regroup and to meet that legendary godmother. She soon finds herself enmeshed in a household of eccentrics: a formerly alcoholic cook and her irksome son, two quirky dog walkers, a mysterious stalker, and of course, godmother Addison Early, a secretive and feisty bestselling mystery writer who once knew Rima's father well. Rima is on a mission to discover just what the relationship was all about.",
        "Category": " Fiction , Literary",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "26.44",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Top Secret Recipes--Sodas, Smoothies, Spirits, & Shakes: Creating Cool Kitchen Clones of America's Favorite Brand-Name Drinks",
        "Authors": "By Wilbur, Todd",
        "Description": "#1 bestselling Top Secret Recipes series!Todd Wilbur shares his best-kept secrets for making knockoffs of your favorite drinks-right in your own kitchen and without spending a lot of money. Readers can re-create the delicious taste of America's best-loved brand-name soft drinks, beverages, dessert drinks, mixers, and liqueurs by following Todd's easy, step-by-step instructions. If it comes in a glass, cup, bottle, or mug, it's here for you to clone at home. Discover how to make your own versions of:* 7-Up® * Starbuck's® Frappuccino® * Nestea® * Sunny Delight® * Dairy Queen® Blizzard® * McDonald's® Shamrock Shake® * 7-Eleven® Cherry Slurpee®",
        "Category": " Cooking , Reference",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The George Foreman Next Grilleration G5 Cookbook: Inviting",
        "Authors": "By George Foreman, Deb Roussou",
        "Description": "",
        "Category": "",
        "Publisher": "Pascoe Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Cream Puff Murder (Hannah Swensen Mystery)",
        "Authors": "By Fluke, Joanne",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Kensington Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "A.A. Milne: The Man Behind Winnie-the-Pooh",
        "Authors": "By Thwaite, Ann",
        "Description": "Portrays the life and career of the successful playwright who was never able to shake the public's idea that he only wrote for children",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Random House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Samurai and Silk: A Japanese and American Heritage",
        "Authors": "By Reischauer, Haru Matsukata",
        "Description": "An account of the author's two grandfathers--a provincial samurai and founder of the Meiji government and an enterprising developer of the silk trade with America",
        "Category": " History , Asia , General",
        "Publisher": "The Belknap Press of the Harvard University Press",
        "Price Starting With ($)": "5.23",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "The Mediterranean Diet: Wine, Pasta, Olive Oil, and a Long, Healthy Life",
        "Authors": "By McConnell, Malcolm and McConnell, Carol",
        "Description": "Provides a specific plan for reducing the chances of heart disease and cancer by adopting the low-stress lifestyle and diet of Mediterranean villagers",
        "Category": " Cooking , General",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "Blue Shoes and Happiness (No. 1 Ladies Detective Agency, Book 7)",
        "Authors": "By McCall Smith, Alexander",
        "Description": "Fans around the world adore the bestselling No. 1 Ladies’ Detective Agency series and its proprietor, Precious Ramotswe, Botswana’s premier lady detective. In this charming series, Mma  Ramotswe—with help from her loyal associate, Grace Makutsi—navigates her cases and her personal life with wisdom, good humor, and the occasional cup of tea.Life is good for Mma Ramotswe as she sets out with her usual resolve to solve people’s problems, heal their misfortunes, and untangle the mysteries that make life interesting. And life is never dull on Tlokweng Road. A new and rather too brusque advice columnist is appearing in the local paper. Then, a cobra is found in the offices of the No. 1 Ladies’ Detective Agency. Recently, the Mokolodi Game Preserve manager feels an infectious fear spreading among his workers, and a local doctor may be falsifying blood pressure readings. To further complicate matters, Grace Makutsi may have scared off her own fiancé. Mma Ramotswe, however, is always up to the challenge. And Blue Shoes and Happiness will not fail to entertain Alexander McCall Smith’s oldest fans and newest converts with its great wit, charm, and great good will.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "The Nation's Choice, Phonics Library Level 1 Theme 9: Houghton Mifflin the Nation's Choice California (Houghton Mifflin Reading: The Nation's Choice)",
        "Authors": "By Read (COR)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "One Potato, Two Potato",
        "Authors": "By Stevens, Molly and Finamore, Roy",
        "Description": "Everyone loves potatoes. This book transports cooks beyond the usual side dishes and introduces them to the secrets and specialties of great chefs and cooks the world over. Finamore shows how to prepare spectacularly simple appetizers, including dips, chips, and showstopping cocktail potatoes made from a few ordinary ingredients.     He presents dozens of soups and salads, including rich Summer Vichyssoise and Herb Garden Potato Salad. There are more than fifty main-dish possibilities, such as Sunday Lamb with Proper Roast Potatoes and Chicken Stuffed with Potatoes and Shiitake Mushrooms — not to mention a sophisticated rendition of Shepherd’s Pie. The potato turns up as the hidden ingredient in such breads as Potato Cheddar Bread with Chives and in such desserts as moist Farmhouse Chocolate Cake.     Finamore shows how to master crisp steak fries, silky mashes,  and sumptuous gratins. A bonus feature of the book is the sweet potato,  in dishes from a delightfully nostalgic Baked Sweet Potatoes with Marshmallow to an urbane Semifreddo with Chocolate Sauce.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Rux Martin/Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.71",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Discover the Stars: Starwatching Using the Naked Eye, Binoculars, or a Telescope",
        "Authors": "By Berry, Richard",
        "Description": "For everyone who has looked up at the stars on a clear night and longed to know more about them, here is the perfect introduction and guide to discovering the stars.Discover the Stars leads you on a tour of all the stars and constellations visible with the naked eye and introduces you to deep-sky objects that can be seen with binoculars or a simple telescope. The tour is conducted by the editor of Astronomy magazine, Richard Berry, whose two-color, computer-plotted sky maps and clear instructions make stargazing fun and productive from your first night out.The heart of Discover the Stars is two sections of big, beautiful sky maps and charts. The first section features twelve maps that show the entire sky overhead as it appears during each month of the year. These outline all the constellations visible anywhere in the Northern Hemisphere, and the accompanying text reveals the rich ancient mythology that surrounds the star groups.The second section is made up of twenty-three star charts that depict smaller regions of the sky in great detail. These charts give the names of key stars and lead you to fascinating features such as stars with unusual colors, double stars, variable stars, nebulae, and galaxies.Separate chapters cover basics, such as how the stars move through the sky, how to find your way around the moon and the planets, making an astronomer's flashlight, and choosing and using a telescope—all in terms that are easy to grasp and remember.Discover the Stars is the perfect introduction to the heavens, simple enough to be useful if you're just starting out but packed with enough information to keep you learning and enjoying the stars for years to come.",
        "Category": " Science , Astronomy",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "Layered Soup Mixes in Jars (Layers of Love Collection)",
        "Authors": "By Jackie Gannaway",
        "Description": "",
        "Category": "",
        "Publisher": "Cookbook Cupboard",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The World's Best Party Games",
        "Authors": "By Barry, Sheila Anne and Anderson, Doug (ILT)",
        "Description": "\"Gr.4-6. A collection of party games that will appeal to a broad age. Requires little or no special equipment.  Covers pre-party activities for early birds, partnering techniques...ice-breaker, action-oriented and humorous games. An age-range chart is enormously helpful. A handy compilation.\"--Booklist.    128 pages, b/w illus. throughout, 5 3/8 x 8 1/4.",
        "Category": " Juvenile Nonfiction , Games & Activities , General",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "Tiny Treats (American Girls Collection Sidelines)",
        "Authors": "By Magruder, Trula and Monroe, Julia A.",
        "Description": "Creative recipes for tasty treats such as tiny pies, cakes, and croissants are easy to make with easy-to-follow instructions and more than one-hundred colorful, step-by-step photographs. Original. 30,000 first printing.",
        "Category": " Juvenile Nonfiction , Cooking & Food",
        "Publisher": "American Girl",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "London Bridges",
        "Authors": "By Stevenson, Jane",
        "Description": "SEVERAL DECEPTIONS, Jane Stevenson's brilliant and highly acclaimed novella collection, was an outstanding literary debut. Now, with her first novel, she again offers readers a work of dazzling intelligence, elegant wit, and keen social observation. An affectionate homage to the classic English detective story, LONDON BRIDGES is set in 1990s London and crafted with a very modern spin. Its plot centers on a treasure lost in the Blitz and newly discovered by an unscrupulous lawyer, who is tempted by greed into a series of crimes leading to murder. A highly contemporary cast of characters assembles to confound him, including a charming and flamboyant gay classicist in hot pursuit of a sixth-century homoerotic poem he hopes will revive his flagging career, a young Indian lawyer fighting British prejudices of race and class, and a very nice dog named Alice. The main character, lovingly depicted, is London itself, in all its rich variousness. Among the novel's themes are the rewards of friendship and community. the imperatives of both preservation and change, and the intertwining, with unexpected effects, of lives in a great city.A lighthearted work shadowed by moments of genuine pathos, LONDON BRIDGES is wonderfully entertaining. It will captivate readers with its high-spirited, stylish storytelling and playful scholarship.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "sTORI Telling",
        "Authors": "By Spelling, Tori and Liftin, Hilary",
        "Description": "The star of Beverly Hills 90210 offers a hilarious, insightful memoir about growing up on America’s favorite teen drama and her life after the show.She was television's most famous virgin -- and, as Aaron Spelling's daughter, arguably its most famous case of nepotism. Portraying Donna Martin on Beverly Hills, 90210, Tori Spelling became one of the most recognizable young actresses of her generation, with a not-so-private personal life every bit as fascinating as her character's exploits. Yet years later the name Tori Spelling too often closed -- and sometimes slammed -- the same doors it had opened.  sTORI telling is Tori's chance to finally tell her side of the tabloid-worthy life she's led, and she talks about it all: her decadent childhood birthday parties, her nose job, her fairy-tale wedding to the wrong man, her so-called feud with her mother. Tori has already revealed her flair for brilliant, self-effacing satire on her VH1 show So NoTORIous and Oxygen's Tori & Dean: Inn Love, but her memoir goes deeper, into the real life behind the rumors: her complicated relationship with her parents; her struggles as an actress after 90210; her accident-prone love life; and, ultimately, her quest to define herself on her own terms.  From her over-the-top first wedding to finding new love to her much-publicized -- and misunderstood -- \"disinheritance,\" sTORI telling is a juicy, eye-opening, enthralling look at what it really means to be Tori Spelling.",
        "Category": " Biography & Autobiography , Rich & Famous",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Your Child: What Every Parent Needs to Know",
        "Authors": "By Pruitt, David B. (EDT) and American Academy of Child and Adolescent Psychiatry (COR)",
        "Description": "What does a typical three-year-old feel and think about? What can you anticipate from your six-year-old as he begins school, or if there is a death in the family? How will your ten-year-old respond to the news that her parents are divorcing? What does it mean that your eight-year-old seems to lie regularly?    By describing the developmental milestones of childhood, discussing specific questions and concerns and examining more troublesome problems, this invaluable book is designed to provide guidance for your day-to-day interactions with your child. It covers a range of practical issues, from choosing your baby&#39;s doctor to dealing with sleep problems, from bolstering a child&#39;s self-esteem to helping a child manage school difficulties, from selecting age-appropriate toys to helping your child cope with divorce, death, or other circumstances disrupting family life.  Your Child also moves beyond the day-to-day quandaries and concerns to those that represent more serious obstacles to a child&#39;s development and family life. The latter sections of the book provide extensive discussion of  the developmental problems that usually require professional intervention, including emotional disorders, disruptive behavior disorders, persistent sleep difficulties, and psychotic disorders. The information provided in these sections will help you to recognize and understand these serious disorders and offers practical advice and useful information to guide you through the who, where, when, and why of getting help for your child.   Written by members of the American Academy of Child and Adolescent Psychiatry, the leading national association of physicians dedicated to the healthy mental development of  children and adolescents, Your Child is the only reference to offer comprehensive and accessible information for parents on the emotional, behavioral, and cognitive development of children from infancy through the preadolescent years. No other book offers such thorough information on:Understanding your child&#39;s developmental achievements in the day-to-day challenges of growing up  Determining when your child&#39;s behavior is normal and when it&#39;s a signal for professional help  Getting help for your child--including practical and reassuring advice on the many aspects of mental health treatment and the professions involved",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "The Third Third: A Physician's Guide to a Healthy, Happy, Longer Life",
        "Authors": "By Connally, N. Thomas",
        "Description": "An award-winning Washington D.C. physician and health policy expert proves that the last third of life can be the best of all. Whether you're approaching middle age, or currently a senior citizen, or caring for someone in the last third of life, you'll find vital topics on how to identify, prevent, and manage the major physical and emotional health issues of life's third third. The latest and best research is presented in a positive yet realistic manner. Practical help comes in three ways. Part One treats the major diseases--heart, diabetes, and cancer--that are most likely to cause premature death. Part Two covers common problems such as osteoporosis, hormone depletion, arthritis, and other conditions seniors face, and how to stay healthy and active while managing these. Part Three suggests ways to continue a high quality of life into the final stages, and to treat death with meaning and dignity. All told, an authoritative handbook on making the best choices to optimize the \"golden years.\" 6",
        "Category": " Family & Relationships , Life Stages , Later Years",
        "Publisher": "Bright Sky Press",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "African Women: Three Generations",
        "Authors": "By Mathabane, Mark",
        "Description": "In African Women, the author of the highly acclaimed and best-selling memoir Kaffir Boy tells the deeply moving, often shocking, but ultimately inspiring stories of his grandmother, mother, and sister. Coping with abuse, gambling, drunkenness, and infidelity from the men they love or have been forced to marry, all three women defy African tradition, and the poverty and violence of life in a modern urban society, to make fulfilling lives for themselves and those they love in the belly of the apartheid beast in South Africa.Granny is sold to her future husband in their homeland - he pays the traditional bride price, lobola, agreed upon by their two families - and after fathering her three children, he deserts her for another woman. When Granny's daughter Geli comes of age, it's not surprising that Granny forces her to marry an older man, Jackson Mathabane, who might be less likely to desert a young wife.The marriage of Geli and Jackson is fraught with drama from the very beginning. Geli and her still-to-be-born first child (the author) are almost victims of witchcraft, saved at the last moment by a relative who discovers the perpetrator and rescues both mother and child. Jackson drinks and gambles, takes a mistress, beats his wife, and when Geli flees with the children to her aunt's house, demands all of them - his property - back with righteous indignation and the weight of African tribal tradition on his side.Mathabane's sister Florah is swept up in the student rebellion against apartheid in the mid-1970s, which left hundreds of young blacks dead. Much later, a single mother looking for love and protection in the dangerous world of Alexandra, a black ghetto of Johannesburg, Florah falls in love with a notorious gangster who proves to be more than she can handle.The stories of Florah, Geli, and Granny are told in their own words in alternating chapters that demonstrate how similar are the problems faced by each generation: all three women discover the need for an independent income in order to care for themselves and for their children; all three are the victims of the traditional assumption that women are property, commodities bought and sold by men; all three suffer from the terrible hardship imposed not only on women but also on black men by the system of apartheid in South Africa.But what stays with the reader of this family saga is the indomitable spirit of these three women - their honesty, faith, and even hopefulness in the face of the intolerable conditions under which they live. African Women is a passionate narrative, as inspiring as it is horrifying, a woman's story for our time. What is most surprising perhaps, and gratifying, is that the stories of Granny, Geli, and Florah are brought to life by the pen of a man, the generously gifted and enormously sympathetic Mark Mathabane.",
        "Category": " Social Science , General",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Delights of the Garden",
        "Authors": "By Hutchins, Imar",
        "Description": "Delights of the garden offers more than a hundred easy-to-prepare recipes from the enormously popular restaurants of the same name, which have won legions of loyal fans with their incomparably delights dishes prepared without the nutrient-destroying effects of heat. Using fruits, vegetables, nuts, grains, and seeds, with no dairy, meat, or eggs - and no cooking - Delights for The Garden includes healthful and delicious recipes for everything from veggie tuna, nori rolls, goulash, and un-pizza to banana cake, un-pancakes, and sweet potato pie. With introductory essays on the psychology of nutrition and the philosophy of vegetarianism, and indexes of nutrients, vitamins, and minerals, Delights of The Garden is an indispensable resource for the experienced vegetarian cook. For the curious cook looking for healthier recipes, and for anyone interested in meals with less fat and more flavor.",
        "Category": " Cooking , Vegetarian",
        "Publisher": "Main Street Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Snowboard Book: A Guide for All Boarders",
        "Authors": "By Hart, Lowell",
        "Description": "Snowboarding, the sport that has generated more excitement -- and caused more controversy -- than any other since Alpine skiing was invented, gives new meaning to fun on the slopes.Learning to snowboard can be surprisingly easy -- with the right instruction. In this complete, fully illustrated guide, beginners gain the know-how to get started, from choosing the right board to becoming familiar with snowboard lingo (do you ride \"goofy\" or \"regular\"?) to transitioning from skis to board. Lowell Hart starts readers off on familiar terrain -- in the living room -- where they practice key movements, the foundation of good riding at all skill levels. These are the moves that let riders tilt the board from front to back edge and carve the turns that only snowboards can scribe.From key moves Hart guides readers through first descents, stopping, first turns, connecting turns, side-slips, and garlands, all the while interjecting tips and predicting trouble spots before they trip up beginners. Then it's on to intermediate, advanced, and freestyle riding: basic halfpipe technique, terrain park tips, airborne spin tricks, rail slides, and even backcountry 'boarding.",
        "Category": " Sports & Recreation , Winter Sports",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "The Millionaire Maker's Guide to Creating a Cash Machine for Life",
        "Authors": "By Langemeier, Loral",
        "Description": "Loral Langemeier first introduced her exclusive Wealth Cycle system in the national bestseller The Millionaire Maker. Now, in The Millionaire Maker's Guide to Creating a Cash Machine for Life, she reveals how you can learn to earn more money by building a viable business. The Cash Machine is simple to start and sustain. You'll use skills you already possess and build a reliable team to help. Whether you want to partner with others or create your own team to start, fix, or buy a business, Langemeier shows you how to turn it into a Cash Machine that makes money from Day One.This book delivers a step-by-step action plan for starting up your Cash Machine, helping you toIdentify your personal skill setBrainstorm a business idea and model it after a similar ventureTest the sales potentialCreate a Cash Machine PlanBuild and manage your teamDevelop short- and long-term marketing strategiesGrow your business-and make more money!Langemeier gets you up to speed on marketing, sales, operations, finance, and management to keep your business operating effectively. She also shares instructive and inspiring real-life examples of successfulCash Machines and explains how to use profits to fuel the Wealth Cycle. In order to be truly wealthy, you need more than a 9-to-5 salary and investments: you need a Cash Machine. The Millionaire Maker's Guide to Creating a Cash Machine for Life gives you the necessary tools to begin your journey to a lifetime of financial happiness-today!",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Og Mandino's University of Success: The Greatest Self-Help Author in the World Presents the Ultimate Success Book",
        "Authors": "By Mandino, Og",
        "Description": "The greatest success authorities in the world share their most treasured success secrets.   Each powerful lesson will bring you closer to your life’s goals: • How to conquer the ten most common causes of failure • How to make the most of your abilities • How to find the courage to take risks • How to stop putting things off • How to build your financial nest egg • How to look like a winner • How to take charge of your life • And much more in fifty memorable presentations by the greatest success authorities.   Dean of this unique University of Success is Og Mandino, the most acclaimed self-help writer of this generation. The faculty he has assembled includes such celebrities as Dr. Wayne W. Dyer, Dale Carnegie, W. Clement Stone, Napoleon Hill, George S. Clason, Nena and George O’Neil, Dr. Joyce Brothers, Michael Korda, Lord Beaverbrook, Dr. Norman Vincent Peale, and many more winners in life.",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1983"
        }
    },
    {
        "Title": "Sudoku (Bk. 4)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Berryland Books Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Sweet Forever",
        "Authors": "By Pelecanos, George P.",
        "Description": "Marcus Clay and Dimitri Karras return from the acclaimed thriller, King Suckerman, as they square off against drug lords and racists on the crime-ridden streets of the nation's capital in the midst of the 1980s. 15,000 first printing. Tour.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "An Occassion to Gather",
        "Authors": "By Nelson, Lynn F.",
        "Description": "",
        "Category": " Cooking , Entertaining",
        "Publisher": "Junior League of Milwaukee",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Everybody Tells Me to Be Myself but I Don't Know Who I Am: Building Your Self-Esteem (Faithgirlz!)",
        "Authors": "By Rue, Nancy",
        "Description": "How many times have you heard grown-ups say, 'Just be yourself'? But how can you be yourself when that self always seems to be different---depending on where you are, who you're with, or what you're doing? Your parents see you as their little girl and your friends think you're a cool chick ... while you feel like a big geek who can't do anything right. And that cute boy in math? Who knows what he's thinking! If you think it's easy to say 'just be yourself' but it's not so easy to do it, then this book is so for you! It will help you figure out who you really are deep down inside. You'll learn to be that person no matter who you're with through surveys, helpful tips, and places to write down your thoughts. You'll learn to be the young women God created you to be!",
        "Category": " Juvenile Nonfiction , Religious , Christian , General",
        "Publisher": "ZonderKidz",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Where Miracles Happen: True Stories of Heavenly Encounters",
        "Authors": "By Anderson, Joan Wester",
        "Description": "The best-selling author of Where Angels Walk presents a collection of real-life experiences of ordinary people whose lives have been touched and changed by God, from miraculous healings to angel encounters to mysterious messages from loved ones. 50,000 first printing. Tour.",
        "Category": " Body, Mind & Spirit , Unexplained Phenomena",
        "Publisher": "Brett Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "The Cat Chronicles: One Cat...Nine Adventurous Lives...Each Lived in a Different Time and Place",
        "Authors": "By Howard, Tom",
        "Description": "Traces the relationship between cats and people from ancient Egypt to the present, and looks at their role in art and literature",
        "Category": " Social Science , General",
        "Publisher": "Running Pr Book Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Fluffy's Field Trip (Hello Reader, Level 3)",
        "Authors": "By Smith, Mavis (ILT) and McMullan, Kate",
        "Description": "Fluffy the guinea pig accidentally accompanies Ms. Day's class on a field trip to the planetarium and, inspired by the constellations Pegasus, The Big Dipper, and The Great Bear, Fluffy dreams up some of his own. Original.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Stealing Home (Matt Christopher)",
        "Authors": "By Mantell, Paul and Christopher, Matt",
        "Description": "Joey Gallagher is sure he will not get along with Jesus, the exchange student from Nicaragua who is staying with his family for a year, but they find common ground on the baseball field. Simultaneous.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The Guideposts Family Topical Concordance to the Bible",
        "Authors": "By Ogilvie, Lloyd J.",
        "Description": "Explains and lists the uses of words, concepts, names, and places in the King James Version of the Old and New Testaments",
        "Category": "",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "Cooking for Friends (Fresh and Simple)",
        "Authors": "By Better Homes and Gardens Books (EDT), Better Homes and Gardens Books (COR), and Holderness, Lisa (EDT)",
        "Description": "Provides recipes that feature fresh produce, seasonings, and flavor combinations that can be made in thirty minutes",
        "Category": " Cooking , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Greg's Microscope",
        "Authors": "By Millicent Selsam",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "The kids in the kitchen cookbook;: How to teach your child the delights of cooking and eating",
        "Authors": "By Lois Levine",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Everyday Japanese: A Basic Introduction to the Japanese Language and Culture",
        "Authors": "By Schwarz, Edward A. and Ezawa, Reiko",
        "Description": "Beginners will find that this complete Japanese language and culture program offers insights into subtle nuances of Japanese as it is used in casual conversations or successful business discussions.",
        "Category": " Foreign Language Study , Japanese",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Lemon Jelly Cake (Prairie State Books)",
        "Authors": "By Smith, Madeline B.",
        "Description": "A surefire cure for the headaches and stomach upsets of the twenty-first century, The Lemon Jelly Cake carries readers back to kinder, gentler times in a small town at the turn of the last century. Evoking a forgotten America of lush lawns, bountiful summer picnics, and shady front porches, the tale is set when the day&#39;s toughest decision might have been what to serve for dinner or which suit or dress to wear.   In this edition, an introduction by longtime Millikin University faculty member and Findlay resident Dan Guillory situates the book and its charming tale firmly in the Central Illinois of 1900.",
        "Category": " Fiction , Historical , General",
        "Publisher": "University of Illinois Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "C. S. Lewis on Faith",
        "Authors": "By Lewis, C. S.",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "God Loves You",
        "Authors": "By Rubon, C. (ILT)",
        "Description": "",
        "Category": "",
        "Publisher": "Concordia Pub House",
        "Price Starting With ($)": "5.9",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Our Children Are Dying",
        "Authors": "By Hentoff, Nat",
        "Description": "Documents a Harlem principal's efforts to provide deprived and disadvantaged students with a meaningful education",
        "Category": " Education , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1967"
        }
    },
    {
        "Title": "The Daily Show and Philosophy: Moments of Zen in the Art of Fake News",
        "Authors": "By Holt, Jason (EDT)",
        "Description": "Holt (philosophy and pop culture, Acadia U.) and fellow contributors stay true to the comic tone of television's prolific fake news series The Daily Show with Jon Stewart while discussing the show in a philosophical context. Nineteen chapters address how fake news can convey truth (as well as its potential harms), how Jon Stewart's taking on of powerful figures pays homage to Socrates and other public intellectuals, The Daily Show's dismantling of political rhetoric, its treatment of religion, and philosophical themes in spin-offs The Colbert Report and America (The Book). Annotation ©2007 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Performing Arts , Comedy",
        "Publisher": "Wiley-Blackwell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "A Lost Lady (Vintage Classics)",
        "Authors": "By Cather, Willa",
        "Description": "A Lost Lady is the portrait of a frontier woman who reflects the conventions of her age even as she defies them. To the people of Sweet Water, a fading railroad town on the Western plains, Mrs. Forrester is the resident aristocrat, at once gracious and comfortably remote. To her aging husband she is a treasure whose value increases as his powers fail. To Niel Herbert, who falls in love with her as a boy and becomes her confidant as a man, Mrs. Forrester is by turns steadfast and faithless, dazzling and pathetic: a woman whose charm is intertwined with a terrifying vulnerability.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Discover the Secrets of Heaven",
        "Authors": "By A Guideposts Book",
        "Description": "",
        "Category": "",
        "Publisher": "Guideposts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Old Macdonald Had a Farm (Classic Books)",
        "Authors": "By Adams, Pam (ILT) and Child's Play (COR)",
        "Description": "An illustrated version of the traditional song describing the inhabitants of Old Macdonald's farm, including some holes, permitting a portion of the next illustration to be seen.",
        "Category": " Juvenile Fiction , Nursery Rhymes",
        "Publisher": "Child's Play International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Complete Conditioning For Tennis",
        "Authors": "By Roetert, Paul, Ph.D. (EDT) and Ellenbecker, Todd S. (EDT)",
        "Description": "Provides training exercises and drills to develop strength, power, agility, flexibility, quickness, and stamina",
        "Category": " Sports & Recreation , Tennis",
        "Publisher": "Human Kinetics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The Last Canyon",
        "Authors": "By Vernon, John",
        "Description": "A novel of one of the most treacherous river expeditions ever undertaken, THE LAST CANYON takes us deep into the heart of the elements, portraying in vivid detail the human quest to understand nature at all costs. In 1869 a one-armed Civil War hero named John Wesley Powell launched four boats on the Green River in Wyoming Territory, undertaking what would be the last major voyage of discovery in American history, through the country's only remaining terra incognita: the remote and barren course of the Colorado River.At the outset of his journey, Powell believed the inaccessible canyons of the Colorado were uninhabited. He was wrong. What he called \"the great unknown\" was in fact well known by a band of Paiute Indians who had lived on the North Rim of the Grand Canyon for centuries. In John Vernon's hands, the story of Powell's voyage of exploration is two converging stories: that of Powell and his crew, and that of a family of Paiute making their own harrowing circuit of the Grand Canyon in an attempt to rescue a kidnapped girl. Told in alternating chapters, THE LAST CANYON deftly leads us into perilous geographical and emotional territory, culminating in Powell's struggle to finish his voyage with only two boats, not four, and five men out of the original nine.Powell's adventure is a story of triumph, hardship, bravery, and ultimate tragedy. THE LAST CANYON traces simultaneously a voyage of discovery and a chronicle of loss, an exploration of both unknown land and the unplumbed human spirit.",
        "Category": " Fiction , Historical",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    }
]