[
    {
        "Title": "Religions in America",
        "Authors": "By Leo Rosten",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "New Home Decorator Creative Quick Decora",
        "Authors": "By Walton, Stewart",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "5.9",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Done Gone Wrong (Thomas Dunne Books)",
        "Authors": "By Pickens, Cathy",
        "Description": "A chance to be a part of a headline-grabbing case against a drug company has lured attorney Avery Andrews back to Charleston, South Carolina. She agrees to meet with Mark Tilman, a young doctor from her hometown who seems to have something on his mind. When he doesn’t show, she figures he stood her up and takes comfort in the stilt restaurant’s she-crab soup. But it turns out he had a fatal car accident. Something about the crash isn’t right, and Mark’s father asks Avery to look into his death. Between that and digging up dirt on the wonder drug Uplift, Avery is coming up with more questions than answers. Of course, Avery isn’t the only one making headlines. Back in Dacus, her mom is on live television confronting a teenager’s dynamite-toting paramour in a hostage crisis at the Burger Hut, Great-Aunt Aletha is mixing it up with the now-toupeeless postman, and the son of a ghost wants vengeance. In short, it’s life as usual back in Dacus, while in Charleston, Avery is forced to face demons from her past.  Cathy Pickens’s first mystery novel established her as a distinctive voice in the cozy tradition. In this second, readers can expect more Southern wit and charm, more courtroom drama, and even crazier antics from the folks back home, all the while falling more and more in love with this endearing heroine.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "The Romance of Country Inns: A Decorating Book for Your Home (Food & Drink)",
        "Authors": "By Greco, Gail and Bagley, Tom (PHT)",
        "Description": "Showcases inns of various parts of the country that carry out decorative themes in early American, country, farmhouse, Victorian, Main Street revival, European, and regional styles. Provides decorating and restoration guidance, with instructions for sewing projects, curtains, and craft projects. Abundantly illustrated. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Cooking , Reference",
        "Publisher": "Rutledge Hill Pr",
        "Price Starting With ($)": "7.24",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Windows on the World Complete Wine Course: 2005 Edition: A Lively Guide",
        "Authors": "By Zraly, Kevin",
        "Description": "MORE THAN 2 MILLION COPIES SOLD!Praise for Windows on the World Complete Wine Course“A visually exciting, intelligently structured reference.”—Bon Appétit  “The top introductory book available.”—Booklist “Are you intimidated by wine stewards? Read Kevin Zraly’s new edition of  Windows on the World Complete Wine Course and order with aplomb”—Playboy  “The liveliest short course on wine ever wrapped between two covers”—Boston Globe“Brims with enthusiasm...breezy, down-to-earth....Reads like an interesting conversation.”—Chicago Tribune“As entertaining as it is informative. A masterful job of simplifying a complex subject and making it fun in the process.”—New York Daily NewsKevin Zraly’s incomparable course (“One of the best start-from-scratch wine books ever written.”—Frank Prial, The New York Times) is still America’s top-selling guide to wine. In this year’s revised edition, Zraly takes a close look at America’s wines and their history, discussing varieties from all 50 states; his tips and guidelines for purchasing them will prove wonderfully invaluable. One thing hasn’t changed: Zraly’s inimitable, irreverent style. He answers every question about wine, offers the most up-to-date recommendations, provides advice on buying wine in stores and on the Internet, takes you on a country-by-country, region-by-region ratings tour of the latest vintages, and starts you on your way to becoming a wine connoisseur. Abundant full-color labels and maps complete the enticing picture. More current, more informative, more concise and precise than ever, this remains the wine guide against which all others are judged.Kevin Zraly is the founder and teacher of the Windows on the World Wine School that has graduated more than 14,000 students. He is the recipient of the Lifetime Achievement Award from the European Wine Council and the James Beard Award, among others. Kevin Zraly has been featured in The New York Times, People magazine, The Wall Street Journal, GQ magazine, Newsweek, and USA Today.• Major National Publicity• Yearlong Advertising in The New Yorker• Features in Food and Wine Publications• Book Reviews in Newspapers Nationwide• Tie-in with Author’s Wine Course and Lectures",
        "Category": " Cooking , Beverages , Alcoholic , Wine",
        "Publisher": "Sterling",
        "Price Starting With ($)": "6.49",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Cardinal Rules",
        "Authors": "By Delinsky, Barbara",
        "Description": "Refusing to repeat the patterns of her unhappy past, Corinne Fremont follows her strict personal policy of remaining on guard and unattached despite any temptation, but her will is challenged by enthusiastic businessman Corey Haraden. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "The Unified Modeling Language User Guide (Addison-Wesley Object Technology Series)",
        "Authors": "By Booch, Grady, Jacobson, Ivar, and Rumbaugh, James",
        "Description": "A tutorial to the core aspects of the UML by the language's original developers.  Begins with a conceptual model of the UML and then progressively applies the UML to a series of increasingly complex modeling problems across a variety of application domains.  Covers structural modeling, behavioral modeling, and architectural modeling. Also includes a learning track focused on applying the UML to advanced modeling systems for more advanced developers.  Appends information on UML notation, standard elements, and rational unified processes. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Computers , Programming , Object Oriented",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Highballs High Heels: A Girls Guide to the Art of Cocktails",
        "Authors": "By Bosker, Gideon, Hellmich, Mittie, Brooks, Karen, and Darmon, Reed",
        "Description": "The authors of Atomic Cocktails strike again, this time with a feminine twist. Highballs High Heels combines '50s cocktail party nostalgia with career girl independence. Order up a Bikinitini when you're feeling sassy, get naughty with a cool Gin and Sin, or a Shirley Temple's Evil Twin, for those times when you just want to be left alone. And for girls with \"inner\" spirit, there's an entire chapter devoted to nonalcoholic drinks. In addition to the 50 fabulous swizzle-stick sensations and an essential essay on women and the art of drinking with style, this guide is also bursting with hip party-planning ideas for cocktail soires, dinners, and summer bashes, including a how-to section for setting up a swanky bar at home. Highballs High Heels is perfect for any woman longing to release her hidden grrrlll.",
        "Category": " Cooking , Beverages , Alcoholic , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Workers' control: A reader on labor and social change",
        "Authors": "By John (Editor) and Hunnius, Gerry (Editor)",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage Books",
        "Price Starting With ($)": "14.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "The Misconception",
        "Authors": "By Gardner, Darlene",
        "Description": "Believing that true love is just a myth, evolutionary scientist Marietta Dalrymple decides to use the Conception Connection to become a mother, but the tables turn when she discovers a rare specimen of the male species in Jax Jackson, a man who believes in monogamy, fatherhood, and love. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Love Spell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Having Faith",
        "Authors": "By Delinsky, Barbara",
        "Description": "Representing opposing clients in a complicated and messy divorce case, Faith Barry and Sawyer Bell find their long-time friendship blossoming into romance, a situation that causes Faith to question everything she ever wanted. Reissue.",
        "Category": " Fiction , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Smile On The Void",
        "Authors": "By Gordon, Stuart",
        "Description": "Tells the story of the world's richest man, Ralph M'Botu Kitaj, who makes himself a mythic figure by vanishing in an act of mystic transformation before a crowd of hundreds of thousands",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "The 3 Most Important Things In Your Life",
        "Authors": "By Murdoch, Mike",
        "Description": "",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Wisdom International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Three Steps Forward, Two Steps Back",
        "Authors": "By Charles R. Swindoll",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Reversing Self-Destructive Patterns",
        "Authors": "By Bell, Steve",
        "Description": "",
        "Category": "",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "The Last Enemy: A Commissario Cenni Investigation",
        "Authors": "By Brophy, Grace",
        "Description": "Rita grew up in Brooklyn, the only child of a narcissistic Italian mother and the GI she married at the end of World War II. After her mother’s death, she quits her teaching job and descends upon her poor but aristocratic relatives, the Count and Countess Casati, in Assisi. It takes a while before they realize, to their chagrin, that Rita has come to stay. When the family assembles to watch the penitentes procession in the town square during Easter Week, a Casati tradition, Rita does not join them as planned. Her corpse is later found in the family mausoleum.  Alessandro Cenni, a commissario in the State Police of Umbria, and a handsome bachelor whose twin brother is about to become a bishop, must penetrate the secrets of the Casati family and their circle if he is to discover who killed Rita and why. But he is blocked by their powerful right-wing connections, and by a superior who prefers to arrest a scapegoat rather than risk political suicide. Aided by a loyal staff in his quest for that rarity—justice—he still must acknowledge that no one can defeat the last enemy, death itself.   Grace Brophy grew up in Queens, New York. She now divides her time between New York and Terni, a village in Umbria, where she lives with her husband, a Uruguayan artist. This is the first in the Commissario Cenni series of investigations set in Italy.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Soho Crime",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Tropical Africa, Volume II: Society and Polity (Abridged Edition)",
        "Authors": "By George H.T. Kimble",
        "Description": "",
        "Category": "",
        "Publisher": "Anchor Books",
        "Price Starting With ($)": "10.31",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "Male Chauvinism",
        "Authors": "By Korda",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "How the Internet Works: Millennium Edition",
        "Authors": "By Gralla, Preston, Adams, Stephen (ILT), Ishida, Sarah (ILT), and Reimer, Mina (ILT)",
        "Description": "Explains how computers connect to the Internet and covers protocols, online services, ISDN, e-mail, newsgroups, chat groups, the World Wide Web, gophers, and audio, video, and virtual reality on the Internet",
        "Category": " Computers , Internet , General",
        "Publisher": "Que",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Way of the Wolf: The Gospel in New Images",
        "Authors": "By Bell, Martin",
        "Description": "Intriguing tales, timeless poetry, enchanting songs . . . Beguiling characters like BarringtonBunny . . . Joggi, the porcupine . . . Lena, the witch . . . Joshua, the boy who has lost his magic . . . and the great silver wolf -- majestic, ever-present, mysterious . . . A book that will inspire you to consider and celebrate such things as love, forgiveness, acceptance, salvation and commitment.",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1983"
        }
    },
    {
        "Title": "Glenn Beck's Common Sense: The Case Against an Out-of-Control Government, Inspired by Thomas Paine",
        "Authors": "By Beck, Glenn and Kerry, Joseph (CON)",
        "Description": "#1 New York Times bestselling author and popular radio and television host Glenn Beck revisits Thomas Paine's Common Sense.In any era, great Americans inspire us to reach our full potential. They know with conviction what they believe within themselves. They understand that all actions have consequences. And they find commonsense solutions to the nation’s problems.  One such American, Thomas Paine, was an ordinary man who changed the course of history by penning Common Sense, the concise 1776 masterpiece in which, through extraordinarily straightforward and indisputable arguments, he encouraged his fellow citizens to take control of America’s future—and, ultimately, her freedom.  Nearly two and a half centuries later, those very freedoms once again hang in the balance. And now, Glenn Beck revisits Paine’s powerful treatise with one purpose: to galvanize Americans to see past government’s easy solutions, two-party monopoly, and illogical methods and take back our great country.",
        "Category": " Political Science , Political Freedom",
        "Publisher": "Threshold Editions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Gilding: Easy Techniques & Elegant Projects With Metal Leaf",
        "Authors": "By Christiansen",
        "Description": "“Transform any conceivable object into one of refined beauty, style, and elegance. All you need is the inspiration of Jane LaFerla’s Gilding....A unique crafts home reference book that will open a whole new area of ‘do-it-yourself’ creativity and artistry.”—The Midwest Book Review.",
        "Category": "",
        "Publisher": "Sterling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The world-peacemaker",
        "Authors": "By Joe Lewis",
        "Description": "",
        "Category": "",
        "Publisher": "Borden Pub Co",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Until We Meet Again",
        "Authors": "By McGuire, Christine",
        "Description": "New York Times bestselling author Christine McGuire packs her riveting legal thrillers with authentic details drawn from her career as a criminal prosecutor. Now McGuire, who \"expertly builds suspense\" (Publishers Weekly), brings back her savvy heroine, Assistant D.A. Kathryn Mackay, in a sensational new page-turner.  Hours after her beloved boss and mentor Harold Benton dies, Kathryn is thrust into her greatest challenge yet -- as the new District Attorney of Santa Rita County, California. Appointed unexpectedly, she is thrown into an explosive series of seemingly connected deaths. Two pregnant teenage girls have committed suicide, and the investigation quickly reveals other cases with disturbing connections. Immersed in political and personal hazards like never before, Kathryn is unprepared to do battle with her shrewd top deputy, who's running a media campaign against her for the upcoming election.  And if Kathryn isn't already overwhelmed with her frenzied career and role as a single mother of a young daughter, her love life heats up when a new man enters the picture. Walking a tightrope of deadly secrets and murderous betrayal, Kathryn must determine whom to trust -- before ore all that she holds dear is destroyed.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "POCKET",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "A Primer of Freudian Psychology",
        "Authors": "By Hall, Calvin S",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1955"
        }
    },
    {
        "Title": "Quasars, Pulsars, and Black Holes",
        "Authors": "By Golden, Frederic",
        "Description": "An account of the great discoveries and breakthroughs of twentieth-century astronomy, including those having to do with radio astronomy, quasars and pulsars, and black holes",
        "Category": " Science , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1977"
        }
    },
    {
        "Title": "Marley & Me Illustrated Edition: Life and Love with the World's Worst Dog",
        "Authors": "By Grogan, John",
        "Description": "Is it possible for humans to discover the key to happiness through a bigger-than-life, bad-boy dog? Just ask the Grogans.John and Jenny were just beginning their life together. They were young and in love, with not a care in the world. Then they brought home Marley, a wiggly yellow furball of a puppy. Life would never be the same.Marley grew into a barreling, ninety-seven-pound streamroller of a Labrador retriever. He crashed through screen doors, gouged through drywall, and stole women's undergarments. Obedience school did no good -- Marley was expelled.But just as Marley joyfully refused any limits on his behavior, his love and loyalty were boundless, too. Marley remained a model of devotion, even when his family was at its wit's end. Unconditional love, they would learn, comes in many forms.Marley & Me is John Grogan's funny, unforgettable tribute to this wonderful, wildly neurotic Lab and the meaning he brought to their lives.",
        "Category": " Pets , Essays & Narratives",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Signs of the Times",
        "Authors": "By Wood, A. Skevington",
        "Description": "",
        "Category": "",
        "Publisher": "Baker Book House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Terrible Swiftsword",
        "Authors": "By Bruce Catton",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Sweethearts",
        "Authors": "By Zarr, Sara",
        "Description": "As children, Jennifer Harris and Cameron Quick were both social outcasts.  They were also one another's only friend.  So when Cameron disappears without warning, Jennifer thinks she's lost the only person who will ever understand her.  Now in high school, Jennifer has been transformed.  Known as Jenna, she's popular, happy, and dating, everything \"Jennifer\" couldn't be---but she still can't shake the memory of her long-lost friend. When Cameron suddenly reappears, they are both confronted with memories of their shared past and the drastically different paths their lives have taken.From the National Book Award nominated author of Story of a Girl, Sweethearts is a story about the power of memory, the bond of friendship, and the quiet resilience of our childhood hearts.",
        "Category": " Young Adult Fiction , Family , Parents",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Collecting Furniture: The Facts at Your Fingertips",
        "Authors": "By Payne, Christopher",
        "Description": "You may be lucky enough to own an antique mahogany highboy, but can you be sure it is 18th-century? How do you know if the handles and feet are original, and there are no replaced parts? Do you know whether it is North American, British or French? How about your favorite chest of drawers? Is it a desirable original 19th-century piece, or a reproduction?Miller's Collecting Furniture: The Facts At Your Fingertips answers all such questions and more. All the major categories of furniture, such as chests, chairs, tables, dining, writing and bedroom furniture, are included, as well as children's furniture, garden furniture and collectible 20th-century pieces by such makers as Charles Eames and Eero Saarinen.",
        "Category": " Antiques & Collectibles , Furniture",
        "Publisher": "Mitchell Beazley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "A Guide to Bird Finding East of the Mississippi",
        "Authors": "By Pettingill, Olin Sewall",
        "Description": "An ornithologist outlines what kinds of birds can be found in each state and the variety due to time of year, migrations, and type of area",
        "Category": " Science , General",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1980"
        }
    },
    {
        "Title": "Quick Sew Quilts: Wallhangings And Coordinating Projects From America's Top Designers (Best-Loved Designers Collection)",
        "Authors": "By Johnston, Becky (EDT)",
        "Description": "Features eleven country and folk art wall quilts with patterns and instructions for each step in the project",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Krause Publ",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Two-Hour Cross-Stitch: 515 Fabulous Designs",
        "Authors": "By Boerens, Patrice",
        "Description": "",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Super Friends: Flying High (DC Super Friends) (Step into Reading)",
        "Authors": "By Eliopulos, Nick (EDT), Wallace, Loston (ILT), and Tanguay, David (ILT)",
        "Description": "SOMETHING STRANGE HAS happened to the birds of GOTHAM CITY. Pigeons are causing traffic jams, seagulls are making trouble at a nearby beach, and ostriches have escaped from the zoo! THE PENGUIN has enlisted his fine feathered friends to distract the DC SUPER FRIENDS while he swoops in and plucks GOTHAM’s biggest bank clean! Will BATMAN, SUPERMAN, and the other DC SUPER FRIENDS get there in time?",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Conran's Habitat: The Complete Home Decorator",
        "Authors": "By Clifton-Mogg, Caroline, Love, Gilly, Mack, Lorrie, and Lott, Jane",
        "Description": "",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Country Decorator",
        "Authors": "By Lawrence, Francine and Page, Hester",
        "Description": "Step-by-step color photographs and detailed directions highlight a complete guide to country-style decorating, encompassing a variety of country styles, from Shaker simplicity to Mediterranean warmth.",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Is This Your Day",
        "Authors": "By Thommen, George",
        "Description": "",
        "Category": "",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Buzzmarketing: Get People to Talk About Your Stuff",
        "Authors": "By Hughes, Mark",
        "Description": "Whether you're a small business owner or an executive at a major corporation, you need to know how to get three to ten times more bang for your marketing dollar. Buzzmarketing will give you the six secrets of getting people to talk about your product or service, and a wealth of captivating stories to illustrate them.",
        "Category": " Business & Economics , Banks & Banking",
        "Publisher": "Portfolio Hardcover",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "The Grouchy Ladybug",
        "Authors": "By Carle, Eric",
        "Description": "From Eric Carle, New York Times bestselling author of The Very Hungry Caterpillar and From Head to Toe, comes the classic story of one very grouchy ladybug. Eric Carle's bright artwork and signature style will charm both ardent fans and new readers alike. As children follow the Grouchy Ladybug on her journey, they will learn the important concepts of time, size, and shape, as well as the benefits of friendship and good manners.For generations, The Grouchy Ladybug has delighted readers of all ages with the story of a bad-tempered bug who won't say \"please\" or \"thank you,\" won't share, and thinks she is bigger and better than anyone else. Readers will love how this testy ladybug introduces them to many new animals and learns that maybe being grouchy isn’t always the best option.",
        "Category": " Juvenile Fiction , Social Themes , Manners & Etiquette",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Great Gifts",
        "Authors": "By Dillon, Heather",
        "Description": "A guide to creating hundreds of unique gifts and home decorations features basic instruction in sewing, applique, embroidery, patchwork, knitting, crochet, cross-stitch, needle-point, and paper mache.",
        "Category": " Art , General",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "8.57",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Handcrafted Journals, Albums, Scrapbooks & More",
        "Authors": "By Browning, Marie",
        "Description": "“Browning...has an artistic touch that sets her book apart....Her projects make good use of handmade paper, natural objects, and currently popular decorative techniques such as thermal embossing. Step-by-step instructions are given for making bindings and lacing entirely from scratch....Excellent addition to public library collections.”—Library Journal.",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Little Book of Early American Crafts and Trades",
        "Authors": "By Stockham, Peter (EDT)",
        "Description": "Charming 1807 children's book explains large variety of crafts and trades, with a full chapter devoted to each: spinner, basketmaker, hatmaker, jeweller, brickmaker and bricklayer, potter, dyer, plumber, apothecary, and others. 23 copperplate illustrations are excellent examples of early commercial art.",
        "Category": " Antiques & Collectibles , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1976"
        }
    },
    {
        "Title": "The Film Experience",
        "Authors": "By Huss, Roy, and Norman Silverstein",
        "Description": "",
        "Category": "",
        "Publisher": "Delta",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "OUR NEIGHBORS ON LA FAYETTE SQUARE: Anecdotes and Reminiscences",
        "Authors": "By Tayloe, Benjamin Ogle",
        "Description": "",
        "Category": "",
        "Publisher": "The Junior League of Washington",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "SCRAPBOOKING WITH MEMORY MAKERS",
        "Authors": "By Michele Gerbrandt, Kerry Arquette",
        "Description": "",
        "Category": "",
        "Publisher": "Beaux Arts Editions",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Soft Child: How Rattlesnake Got its Fangs",
        "Authors": "By Hayes, Joe, Sather, Kay (ILT), and Sather, Kay",
        "Description": "When his warning rattle fails to protect Soft Child from the other desert creatures, the Sky God equips him with a powerful way to defend himself",
        "Category": " Juvenile Fiction , Legends, Myths, Fables , General",
        "Publisher": "Roberts Rinehart",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Sociology of Religion (Penguin modern sociology readings)",
        "Authors": "By Robertson, Roland",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Picasso (Getting to Know the World's Greatest Artists)",
        "Authors": "By Venezia, Mike",
        "Description": "Briefly examines the life and work of the renowned twentieth-century artist, describing and giving examples from his various periods or styles",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Art",
        "Publisher": "Childrens Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "On the Symb-Socket Circuit",
        "Authors": "By Kenneth Bulmer -",
        "Description": "",
        "Category": "",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Sunset: The Baxter Family, Sunrise Series (Book 4) Clean, Contemporary Christian Fiction",
        "Authors": "By Kingsbury, Karen",
        "Description": "2009 Retailer's Choice Award winner!As John Baxter makes plans to marry Elaine, one of the Baxters enters into the most trying season of all. During a time of renewed love and hope for the future, the Baxters try to come together to establish the sacred ground of marriage and to chart a course for the future. Memories of times gone by meet with the changes of today in a story that proves only the support of faith and family can take a person into the sunset years of life.",
        "Category": " Fiction , Christian , Romance , General",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "The Control Freak",
        "Authors": "By Parrott, Les",
        "Description": "They're pushy. Forceful. Impatient. Always in a hurry. And they're usually ready to tell others how to do their jobs “better.” Control freaks. Maybe you know one. Maybe you are one. What are you to do? Psychologist Les Parrott (a recovering control freak) helps readers relate better to the control freaks around them. And if you are a control freak, Les will help you become willing to lose the control you love. The book includes self-tests and a lifelong prescription for healthier relationships.",
        "Category": " Self-help , Mood Disorders , General",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Laughter of Dead Kings (Vicky Bliss, No. 6)",
        "Authors": "By Peters, Elizabeth",
        "Description": "“A royal treat….Welcome back, Vicky Bliss!...For readers new to Vicky’s sassy and distinctively smart stories, The Laughter of Dead Kings will mark the start of a beautiful friendship.”—Tampa Tribune New York Times bestselling Grand Master Elizabeth Peters—author of the thrilling fictional exploits of archaeologist Amelia Peabody in the Land of the Pharaohs—brings back beautiful, brainy art expert and sometime sleuth Vicky Bliss for one last adventure in The Laughter of Dead Kings. The incomparable Peters sends Vicky and her colorful entourage racing across modern-day Egypt to investigate the brazen theft of one the ancient desert land’s most priceless treasures. Smart, funny, evocative, and suspenseful, The Laughter of Dead Kings is a fond and fitting farewell to the ever-delightful Vicky…and a superior mystery fit for a King Tutankhamen.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Legally Safe Mental Health Practice: Psycholegal Questions and Answers",
        "Authors": "By Woody, Robert Henley",
        "Description": "Woody (psychology and social work, U. of Nebraska; practicing attorney) examines mental health reform and its effects on the field. He includes questions posed to the author by clients, and his offered safeguards. The book is intended for educational purposes only, and is not to be construed as offering legal or other professional services.  No index. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Health & Fitness , Health Care Issues",
        "Publisher": "Psychosocial Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Tokens of Affections - Counted Cross Stitch Pattern Book",
        "Authors": "By",
        "Description": "",
        "Category": " Crafts & Hobbies , Needlework , Cross-Stitch",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Super family vacations: Resort and adventure guide",
        "Authors": "By Shirk, Martha, Klepper, Nancy",
        "Description": "Describes resorts, ranches, ski areas, history places, and more",
        "Category": "",
        "Publisher": "Harperperennial",
        "Price Starting With ($)": "9.77",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Backward And Upward: The New Conservative Writing",
        "Authors": "By Brooks, David (EDT)",
        "Description": "The side that is winning the culture wars is the side that is having the most fun. And this lively and elegant anthology strongly suggests that conservatives are having a ball - and that they're terrific writers besides. The pieces collected here show that conservatism is as much about personality as it is about ideology. The wit, acuity, and sheer delight these writers take in slaughtering sacred cows make this collection so appealing that even liberals may find it irresistible.Among the selections: Mark Helprin, admitting (to a class of West Point graduates) that what he did during the war in Vietnam was draft-dodging and wrong; Danielle Crittenden, with a manifesto for unnatural (or, at least, drug-assisted) childbirth; Andrew Ferguson, lampooning the movement to create sensitive men; Joe Queenan, intrepidly pushing the envelope of New York City's anti-smoking laws; and Florence King, on the elitist art of insulting.All this plus contributions by George Gilder, Charles Murray, James Q. Wilson, Rush Limbaugh, Peggy Noonan, Robert Bartley, William Kristol, and many, many more.",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Family Child Care Marketing Guide: How to Build Enrollment and Promote Your Business As a Child Care Professional",
        "Authors": "By Copeland, Tom",
        "Description": "",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Redleaf Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Cathedral Cats",
        "Authors": "By Surman, Richard",
        "Description": "No cat lover will be able to resist Cathedral Cats. Photographer Richard Surman has visited more than twenty cathedrals throughout England, Scotland, Wales and Northern Ireland and has identified a cat that is intimately associated with each of them. He has produced two gorgeous colour pictures of each cat in its typical habitat. These are accompanied by a pen portrait documenting the cat&apos;s life in the cathedral and its particular foibles and eccentricities.  The book is full of humour and insight into the twilight world of the cat.  Biggles, feline tyrant of Westminster Abbey, was born in a mining village and now hunts rats and other cats in the ancient cloisters. His daily promenade takes him right down the centre aisle of the Abbey, and he has been seen both asleep and sharpening his claws on the high altar. He hides in a dense Virginia creeper and surprises passers by, notably dogs and Japanese tourists. He was issued with an official warning by the Westminster police after he mauled a constable&apos;s trousers. Such is the stuff of Cathedral Cats.",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Complete Idiot's Guide to Publishing Children's Books",
        "Authors": "By Rominger, Lynne and Underdown, Harold D.",
        "Description": "Children's book publishing is one of the most difficult fields of publishing for new authors to get into.  \"The Complete Idiot's Guide to Publishing Children's Books\" gives potential authors tips, inside information, and detailed instructions for everything from how to prepare a proposal to how to get an agent.  Detailing the differences between picture books, juvenile fiction, and the young adult novel, the book also covers branding, series, and licensing, discusses writing styles and character development, and explains forming illustrator partnerships.",
        "Category": " Literary Criticism , Children's Literature",
        "Publisher": "Alpha",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "The Professional: Lyndon B. Johnson, a Uniquely Intimate Portrait",
        "Authors": "By White, William S.",
        "Description": "",
        "Category": "",
        "Publisher": "Crest Book",
        "Price Starting With ($)": "6.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Lend Me Your Ears: Great Speeches in History",
        "Authors": "By Safire, William",
        "Description": "Lend Me Your Ears collects, in one immensely rich compendium, some two hundred of history's outstanding instances of oratorical eloquence. They are selected, arranged, and introduced by William Safire, one of America's most influential political columnists, himself a former speechwriter and language scholar. From Demosthenes mounting an angry defense against his attackers in one of his immortal philippics, to Abraham Lincoln consecrating the memory of the Union dead at Gettysburg, to Winston Churchill rallying a beleaguered Britain with a promise of \"blood, toil, sweat and tears,\" to Salman Rushdie unexpectedly electrifying an audience with his paean to the necessity of free speech - this anthology contains the finest examples of the art of speechmaking in human experience.The book is arranged by theme and occasion: Memorials and Patriotic Speeches, War and Revolution Speeches, Tributes and Eulogies, Debates and Argumentation, Trial Speeches, Gallows and Farewell Speeches, Sermons, Inspirational Speeches, Lectures and Instructive Speeches, Speeches of Social Responsibility, Media Speeches, Political Speeches (in Safire's words, \"the anthologist's mother's milk\"), and Commencement Addresses. Each speech is expertly introduced by the editor, who places the speech's occasion in historical context and analyzes the particular techniques that give the speech its force and effect. William Safire enlivens many of these introductions with personal anecdotes of the circumstances of the speechmaker and the speech. His Introduction is a brisk, compact, effective short course in how to make a great speech - with a cornucopia of examples to follow.No one faced with the need to go before an audience of any size to argue, persuade, uplift, introduce, memorialize, or amuse should be without Lend Me Your Ears. It serves equally as a work of permanent reference use and as a treasure-house for the browser in search of inspiration, instruction, and entertainment. In this anthology, editor and subject matter have met to result in a book that draws from the ages - and that will last for decades as the definitive word on human eloquence.",
        "Category": "",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Kite Runner (Riverhead Essential Editions)",
        "Authors": "By Hosseini, Khaled",
        "Description": "The #1 New York Times bestselling debut novel that introduced Khaled Hosseini to millions of readers the world over.   The unforgettable, heartbreaking story of the unlikely friendship between a wealthy boy and the son of his father’s servant, caught in the tragic sweep of history, The Kite Runner transports readers to Afghanistan at a tense and crucial moment of change and destruction. A powerful story of friendship, it is also about the power of reading, the price of betrayal, and the possibility of redemption; and an exploration of the power of fathers over sons—their love, their sacrifices, their lies.   Since its publication in 2003 Kite Runner has become a beloved, one-of-a-kind classic of contemporary literature, touching millions of readers, and launching the career of one of America's most treasured writers.",
        "Category": " Fiction , Literary",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Danger on Thunder Mountain (An American Adventure, Book 3)",
        "Authors": "By Roddy, Lee",
        "Description": "Joining her cousin Ruby on a search for Ruby's missing father leads Hildy to a confrontation with wealthy cattleman Ozzie Kessick",
        "Category": "",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Fabulous Frames: 30 Step-by-Step Projects for Decorating and Personalizing Picture Frames",
        "Authors": "By Schneebeli-Morrell, Deborah",
        "Description": "Fabulous Frames offers more than 30 easy and exciting ways to add creative flair to any picture frame and exhibit your favorite photographs in style. Complete with easy-to-follow instructions and nearly 300 how-to color photographs, Fabulous Frames makes decorating and personalizing picture frames fun and simple.Projects include:Chapter one Bottle tops frame-- Tin can lids frame-- Aluminum shapes frame-- Brass squares frame-- Engraved frame-- Wire and bead frameChapter two Quilled paper frame-- Multi-image flame-- Marbled paper frame-- Music lovers frame-- Matisse-inspired frame-- Postcard frameChapter three Woodland frame-- China mosaic frame-- Patchwork frame-- Ribbon-weave frame-- String frame-- Pressed flowers frame-- Oriental eggshell frame-- Domino frame-- Toy frame-- Folk art frame-- Vacation memento frameChapter four Gesso and gilded frame-- Sunflowers frame-- Cherub frame-- Rococo frameChapter five Dragged frame-- Ragged frame-- Antiqued frame-- Gilded frame-- Crackle glaze frame-- Gold spattering frame-- Stenciled and painted framePlus a comprehensive glossary of terms and techniques.",
        "Category": " Crafts & Hobbies , Framing",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The 106 Common Mistakes Homebuyers Make (and How to Avoid Them)",
        "Authors": "By Eldred, Gary W.",
        "Description": "Everything the first-time buyer needs to know to avoid the 106 most common mistakes in purchasing a home or condo&#133 Written especially for first-timers, this eye-opening guide turns you into an educated consumer, ensuring that the home or condo you buy is both a comfortable place to live and an investment that appreciates in value. Compiled from the experience of hundreds of homebuyers, real estate agents, home builders, and mortgage lenders, it shows you the most common mistakes buyers make and illustrates them in practice so you don?t fall into the same traps. Now revised and expanded, this invaluable resource covers everything from negotiating with sellers and making the down payment to shopping for the best mortgage and handling the closing. The new Third Edition also includes two totally new chapters that offer advice on writing a purchase contract and using the Internet to find a home. Discover how to save time, money, and frustration by avoiding: Mistake No. 35: We looked at selling prices but still overpaid.  Mistake No. 39: My agent told me this was a good school district. Mistake No. 41: We bought into an upscale development that?s moving downscale. Mistake No. 65: We should have looked at the utility bills.  Mistake No. 82: We let our agent negotiate for us.  Mistake No. 105: We didn?t buy. We were afraid of making a mistake Written by one of the nation?s leading real estate experts and packed with hundreds of valuable tips and suggestions, The 106 Common Mistakes Homebuyers Make, Third Edition will give you the confidence?and the wisdom?to buy the right home at the right price",
        "Category": " Business & Economics , Real Estate , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Summerhill Secrets, Volume 1: Whispers Down the Lane/Secret in the Willows/Catch a Falling Star/Night of the Fireflies/A Cry in the Dark (Summerhill Secrets 1-5)",
        "Authors": "By Lewis, Beverly",
        "Description": "Fifteen-year-old Merry Hanson, living amongst the Amish in rural Lancaster County, Pennsylvania, relies on her Christian faith to guide her through such challenging situations as the physical abuse of her schoolmate, an arson investigation, a car accident, and an abandoned baby.",
        "Category": " Young Adult Fiction , Religious , Christian , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Summerhill Secrets, Volume 2: House of Secrets/Echoes in the Wind/Hide Behind the Moon/Windows on the Hill/Shadows Beyond the Gate (Summerhill Secrets 6-10)",
        "Authors": "By Lewis, Beverly",
        "Description": "Sixteen-year-old Merry Hanson, living amongst the Amish in rural Lancaster County, Pennsylvania, relies on her Christian faith to guide her through such challenging situations as the childhood death of her twin sister, the disappearance of a friend's mother, boy troubles, a skating accident, and her Amish friend's newfound interest in the modern world.",
        "Category": " Young Adult Fiction , Religious , Christian , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Pierre Franey's Cooking In France",
        "Authors": "By Franey, Pierre and Flaste, Richard",
        "Description": "The renowned television chef returns to his native France to present a delectable collection of classic French regional specialties, offering two hundred recipes that capture the essence of French culinary traditions. TV tie-in. 50,000 first printing. Tour.",
        "Category": " Cooking , Regional & Ethnic , French",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Peter and the Secret of Rundoon (Peter and the Starcatchers)",
        "Authors": "By Barry, Dave, Pearson, Ridley, and Call, Greg (ILT)",
        "Description": "In this action-packed finale to the Starcatchers series, Peter and Molly find themselves in the dangerous land of Rundoon, ruled by an evil king who enjoys watching his pet snake consume those who displease him. But that’s just the beginning of problems facing our heroes, who once again find themselves pitted against the evil shadow-creature Lord Ombra in a struggle to save themselves, not to mention the planet. It’s a wild desert adventure, with rockets, carpets, and camels all flying through the air, zooming toward an unforgettable climax...",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Disney Editions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Sequence",
        "Authors": "By Andrews, Lori B.",
        "Description": "Dr. Alexandra Blake has the job of a lifetime. As a cutting-edge geneticist at AFIP---the Armed Forces Institute of Pathology in Washington, D.C.---Alex is charged with using her research into the genetics of viruses to find a vaccine against bioterrorism. The AFIP contains the pathology lab for the Department of Defense, manages the DOD blood bank, directs research like Alex’s, and fosters the development of inventions to help the nation’s armed forces. But the institute’s new director, James Wiatt, wants to turn the AFIP into a mini FBI by directing its resources toward crime solving---an effort to rival the Bureau’s forensic department. When a series of related murders falls under his jurisdiction, he gets his chance to prove the AFIP can compete with the Bureau. Alex is forced to put her research on hold so she can cover forensics on the case, which involves a killer who murders women near military bases across the country and then tattoos their corpses. At first she resents being distracted from her lab work, but as she becomes immersed in the case, studying the forensic evidence, viewing the crime scenes, and piecing together the victims’ last moments, Alex resolves to catch the killer. She knows it’s only a matter of time before he leaves some evidence for Alex to trace back to him. But when another murder strikes closer to home for Alex and her colleagues---and her boyfriend, a congressman from Texas---it will take more than forensic science to keep them safe. With its spellbinding mix of suspense, forensics, and romance, Lori Andrews’s debut novel signals the arrival of a powerful new writer on the crime fiction shelf.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Manifold: Time",
        "Authors": "By Baxter, Stephen",
        "Description": "The year is 2010. More than a century of ecological damage, industrial and technological expansion, and unchecked population growth has left the Earth on the brink of devastation. But as the world's governments turn inward, one man dares to gamble on a bolder, brighter future. That man - Reid Malenfant - has a very different solution to the problems plaguing the planet: the exploration and colonization of space.Battling national sabotage and international outcry, Malenfant's bootstrap company builds a spacecraft, plots its course, and trains the genetically enhanced Sheena 5 for her one-way journey. As apocalyptic riots sweep the globe, Malenfant launches the rocket. But Sheena has plans of her own. And even as she sets them in motion, the situation on Earth grows more desperate and violent.Now Malenfant - together with a brilliant but disturbed mathematician, a child prodigy, and his ex-wife - must gamble the very existence of time and space on a single desperate throw of the dice. The odds are a trillion to one against him.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "In Praise of Stay At Home Moms",
        "Authors": "By Schlessinger, Laura",
        "Description": "In In Praise of Stay-at-Home Moms, internationally syndicated radio host Dr. Laura Schlessinger celebrates these essentially important yet overlooked women. The author of eleven New York Times bestsellers—including Stop Whining, Start Living and The Proper Care and Feeding of Marriage—and #1 female radio talk show host in the country, Dr. Laura offers support, guidance, and words of inspiration and wisdom to the more than 6.8 million full-time stay-at-home mothers nationwide.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "6.79",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Interpreter's Concise Commentary Old Testament History (The Interpreter's Concise Commentary, Vol 2)",
        "Authors": "By Laymon, Charles (EDT)",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "The Final Warning: A Maximum Ride Novel (Maximum Ride, 4)",
        "Authors": "By Patterson, James",
        "Description": "Hold on tight for the wildest ride yet as Max and the flock take on global warming -- Earth's biggest threat -- in this #1 New York Times bestselling series. Max returns in a chilling adventure unlike any other. Safe havens for the six highly hunted winged kids have become increasingly hard to find, so the flock takes refuge in Antarctica with a team of environmentalists studying the effects of global warming. In this remote wilderness -- whether pursued by corrupt governments, bioengineered bad-guys, or the harsh forces of nature -- survival of the fittest takes a new twist!",
        "Category": " Young Adult Fiction , Action & Adventure , General",
        "Publisher": "jimmy patterson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Green By Design",
        "Authors": "By Dean, Angela M.",
        "Description": "There is no \"one-size-fits-all\" plan for so-called \"green\" homes; rather, there are universal principles of design that can be applied to individual tastes and needs. Architect Angela Dean offers a variety of ways to incorporate green building into your home, including using healthy building materials such as straw bales and natural flooring, taking advantage of local materials and resources, reusing gray water for landscaping, and incorporating passive solar design. Her goal is to teach people how to think about building sustainable homes. < BR>Green by Design provides a thorough analysis of what it means to build green and offers advice on what to consider when designing a sustainable home. Green by Design features full-color photographs and line drawings of floor plans show different examples of successful sustainable homes. It also includes in-depth case studies of more than a dozen homes so readers planning a green home can see what worked for others. By providing people with knowledge, inspiration, and the ability to ask the right questions (and understand the answers) Green by Design puts home builders and owners on a path to creating beautiful, environmentally responsible homes that they can be proud to live in. < BR>Angela Dean, AIA, is principal architect of AMD Architecture in Salt Lake City. She specializes in environmentally responsible designs to create healthy, comfortable buildings that are in harmony with the environment< BR>",
        "Category": " Architecture , Interior Design , General",
        "Publisher": "Gibbs Smith, Publisher",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "A History of Iraq",
        "Authors": "By Tripp, Charles",
        "Description": "In response to current events, Charles Tripp has updated his incisive book A History of Iraq to include developments as recent as mid-2002. Since its establishment by the British in the 1920s, Iraq has witnessed the rise and fall of successive authoritarian regimes, competing ruthlessly for power and resources. This struggle culminated in the dictatorship of Saddam Husain, who still maintains his grip over a fragmented and increasingly isolated society. Tripp's book traces Iraq's political history from its nineteenth-century roots in the Ottoman empire, to the development of the state, its transformation from monarchy to republic and the rise of the Ba'th party and the ascendancy and current rule of Saddam Husain.     This is a story of social conflict, of power struggles between rival clans, of hostility and wars with neighboring states, as well as of their aftermath, and Iraq's deteriorating relations with the West.  A History of Iraq offers incisive analysis of the making of a modern state and how it creates its own distinctive politics.   Charles Tripp is Senior Lecturer in the Department of Political Studies at the School of Oriental and African Studies, University of London.  He is the co-author of Iran-Saudi Arabia Relations and Regional Order (Oxford, 1997) and Iran and Iraq at War (Westview, 1998).",
        "Category": " History , Asia , General",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Play of the Hand",
        "Authors": "By Grant, Audrey",
        "Description": "Focuses on basic concepts of play of hand. Bidding tactics reviewed.",
        "Category": "",
        "Publisher": "American Contract Bridge League",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Robin Williams Design Workshop",
        "Authors": "By Williams, Robin and Tollett, John",
        "Description": "Robin Williams introduced design and  typographic principles to legions of readers with her best-selling  Non-Designer's book series. Now she and designer/co-author John Tollett  take you to the next level of creative design with practical advice and  lessons in composition, visual impact, and design challenges. Presented  in Robin and John's signature style—writing that is so crystal clear,  it's accessible to absolutely anyone—and illustrated with hundreds of  full-color design examples, the ideas in this book tackle design  theory, visual puns, and layout and graphics strategies for real-world  projects. Developing designers will appreciate the author's imaginative  approach and well-chosen examples.  Discover practical and effective design principles and concept–and how to apply them to virtually any project. Learn why some designs are attention-getting and others are not. Learn  how to choose just the right look—corporate or casual, classic or  trendy—for specific types of projects, such as business cards,  letterhead and envelopes, newsletters and brochures, logos,  advertising, and more. Test your design acumen by comparing before-and-after examples. Find a wealth of inspiration for your own design projects. Gain insight into the design process by studying the works of guest designers, who offer their personal commentary and insights.",
        "Category": " Computers , Computer Graphics",
        "Publisher": "Peachpit Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Gardener's Home Companion",
        "Authors": "By MACKEY, Betty et al.",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Nobles",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Twelve Sharp (Stephanie Plum, No. 12) (Stephanie Plum Novels)",
        "Authors": "By Evanovich, Janet",
        "Description": "Welcome to Trenton, New Jersey, where bounty hunter Stephanie Plum's life is about to implode in Janet Evanovich's wildest, hottest novel yet! FIRST A STRANGER APPEARSWhile chasing down the usual cast of miscreants and weirdos, Stephanie discovers that a crazed woman is stalking her.THEN THE STRANGER REVEALS HER SECRETSThe woman dresses in black, carries a 9mm Glock, and has a bad attitude and a mysterious connection to dark and dangerous Carlos Manoso …street name, Ranger. NEXT, SOMEBODY DIESThe action turns deadly serious, and Stephanie goes from hunting skips to hunting a murderer. SOON, THE CHASE IS ONRanger needs Stephanie for more reasons than he can say. And now, the two are working together to find a killer, rescue a missing child, and stop a lunatic from raising the body count. When Stephanie Plum and Ranger get too close for comfort, vice cop Joe Morelli (her on-again, off-again boyfriend) steps in. Will the ticking clock stop at the stroke of twelve…or will a stranger in the wind find a way to stop Stephanie Plum…forever? Filled with Janet Evanovich's trademark action, nonstop adventure, and sharp humor, Twelve Sharp shows why her novels have been called \"hot stuff\" (The New York Times), and Evanovich herself \"the master\" (San Francisco Examiner).",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "The Glasswrights' Journeyman",
        "Authors": "By Klasky, Mindy",
        "Description": "With Morenia in ruins following a devastating fire, King Hal is desperate to ensure the future of his people by marrying the wealthy princess of Liantine and enlists the aid of Rani Trader to help him negotiate a deal, but the machinations of the Brotherhood are once again threatening the Guild. Original.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Roc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "I Was a Third Grade Science Project",
        "Authors": "By Auch, Mary Jane and Auch, Herm (ILT)",
        "Description": "It sure is handy having Brian the Brain for a best friend—how else would Josh have a shot at first prize in the science fair and winning tickets to Wonderland Lake? But when Brian plans to hypnotize his dog, Arfie, into thinking he’s a cat, Josh knows he can say goodbye to Wonderland Lake—this scheme will never work. The next thing he knows, Josh is climbing trees and craving raw fish sandwiches. What’s going on? Will the real science project please meow?",
        "Category": " Juvenile Fiction , Science & Technology",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Blood Pact",
        "Authors": "By Huff, Tanya",
        "Description": "When she investigates the sudden passing of her mother, Vicki Nelson realizes that the death was no accident, and she discovers that strange things are happening at the hospital where her mother worked. By the author of Blood Price. Original.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "DAW",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Warriors Path",
        "Authors": "By Louis L'Amour",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Doubleday Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The Sacketts # 6 Mojave Crossing",
        "Authors": "By Louis L'Amour",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The Art of Silk Ribbon Embroidery",
        "Authors": "By Montano, Judith Baker",
        "Description": "",
        "Category": " Crafts & Hobbies , Needlework , Embroidery",
        "Publisher": "C&T Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "The Clone Republic",
        "Authors": "By Kent, Steven L.",
        "Description": "Earth, 2508 A.D. Humans have spread across the six arms of the Milky Way Galaxy. The Unified Authority controls Earth’s colonies with an iron fist and a powerful military—a military made up almost entirely of clones…Private first-class Wayson Harris was raised in a U.A. orphanage among thousands of clones born and bred to be the ultimate soldiers. But Harris isn’t like the other Marines: he has a mind of his own. He figures he’s paying for that independent streak when his first assignment out of boot camp is the smallest Marine outpost in the whole U.A.When a rogue general surfaces, the remote desert world Harris thought was a dead-end posting becomes anything but. Fighting off the general’s raid gains Harris a promotion. But it also brings him to the attention of some unfriendly U.A. leaders. They have their own plans for the military—plans Harris disrupts by his very existence. For in an army of clones, the one unforgivable sin is to be different…",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Java in a Nutshell: A Desktop Quick Reference for Java Programmers (Nutshell Handbooks)",
        "Authors": "By Flanagan, David",
        "Description": "Java in a Nutshell is a complete quick-reference guide to Java, the  hot new programming language from Sun Microsystems.  This comprehensive  volume contains descriptions of all of the classes in the Java 1.0 API,  with a definitive listing of all methods and variables.  It also contains  an accelerated introduction to Java for C and C++ programmers who want to  learn the language fast.Java in a Nutshell introduces the Java programming language and contains many practical examples that show programmers how to write Java applications and applets.  It is also an indispensable quick reference designed to wait faithfully by the side of every Java programmer's keyboard.  It puts all the information Java programmers need right at their fingertips.Contents include:An advanced introduction to Java.  The first three chapters will  teach C and C++ programmers everything they need to know to start  programming with Java right away.Practical, real-world examples that show programmers how to write applets; implement smooth animation; create graphical user interfaces; write client and server programs that communicate over the network; use threads; and moreA compact reference to the 211 classes, 1828 methods and 235 variables in the Java 1.0 APIDescriptions of each classA Java keyword and concept glossaryQuick-reference tables of operators, primitives, escape characters, visibility modifiers, doc comment syntax, events, keysyms, fonts, colors,  cursors, system properties, Unicode and Java-related HTML syntaxDocumentation for the Java compiler, interpreter, and other tools in the Java Developer's Kit",
        "Category": " Computers , Programming Languages , General",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Othello (Shakespeare Made Easy)",
        "Authors": "By Shakespeare, William and Holste, Gayle (EDT)",
        "Description": "Here are the books that help teach Shakespeare plays without the teacher constantly needing to explain and define Elizabethan terms, slang, and other ways of expression that are different from our own. Each play is presented with Shakespeare's original lines on each left-hand page, and a modern, easy-to-understand \"translation\" on the facing right-hand page. All dramas are complete, with every original Shakespearian line, and a full-length modern rendition of the text. These invaluable teaching-study guides also include:  Helpful background information that puts each play in its historical perspective. Discussion questions that teachers can use to spark student class participation, and which students can use as springboards for their own themes and term papers.  Fact quizzes, sample examinations, and other features that improve student comprehension of what each play is about.",
        "Category": " Study Aids , Book Notes",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Complete Book of Home Improvement: Ideas and Techniques for Decorating Your Hom",
        "Authors": "By Mike Lawrence",
        "Description": "",
        "Category": "",
        "Publisher": "Hunter Publishing+inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Complete Interior Designer",
        "Authors": "By Niesewand, Nonie",
        "Description": "",
        "Category": "",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "7.46",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "The Tale of Mrs. Tiggy-Winkle",
        "Authors": "By Potter, Beatrix and Atkinson, Allen",
        "Description": "Lucie finds her lost handkerchiefs at a strange washerwoman's house",
        "Category": " Juvenile Fiction , Animals , Mammals",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "Making Your Own Paper",
        "Authors": "By Saddington, Marianne",
        "Description": "A charming little book. Covers papermaking on the cheap using household tools and materials. Some craft projects. Will inculcate some new papermakers (who will demand much more sophisticated equipment). See TS1124 for a scholarly treatment of paper. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Crafts & Hobbies , Seasonal",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Sower's Seeds: One Hundred Inspiring Stories for Preaching, Teaching, and Public Speaking",
        "Authors": "By Cavanaugh, Brian",
        "Description": "",
        "Category": " Religion , Christian Ministry , Preaching",
        "Publisher": "Paulist Pr",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Long Goodbye: Memories of My Father",
        "Authors": "By Davis, Patti",
        "Description": "\"Genuine and heartfelt.\"—San Diego Union-TribuneRonald Reagan’s daughter writes with a moving openness about losing her father to Alzheimer’s disease. The simplicity with which she reveals the intensity, the rush, the flow of her feelings encompasses all the surprises and complexities that ambush us when death gradually, unstoppably invades life.In this moving and illuminating portrait of a woman and her father, Patti Davis describes saying goodbye in stages, helpless against the onslaught of a disease that steals what is most precious—a person’s memory. “Alzheimer’s,” she writes, “snips away at the threads, a slow unraveling, a steady retreat; as a witness all you can do is watch, cry, and whisper a soft stream of goodbyes.”She writes of needing to be reunited at forty-two with her mother, of regaining what they had spent decades demolishing. A truce was necessary to bring together a splintered family, a few weeks before her father released his letter telling the country and the world of his illness. She delves into her memories to touch her father again, to hear his voice, to keep alive the years she had with him.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Granite Shield (Branion series, Book 3)",
        "Authors": "By Patton, Fiona",
        "Description": "Galactic Spectrum Award nomination • Locus Recommended Reading List • Epic fantasy series with character-driven intrigue and spectacular magicMarsellus was the rightful ruler of Branion, by virtue of both birth and the power of the Flame contained within him. Yet he had betrayed his heritage, cleaving to the opposing Essusiate religion and denying the Flame’s power.   But now Llewellynne, a prince and seer in the neighboring kingdom of Gwyneth, has been granted a Flame vision of herself bearing a child of Marsellus—a child who would become the new vessel of the Flame and who can lead Gwyneth forces to victory in Branion.   Llewellynne succeed in transforming the vision into reality, giving birth to a son named Rhys. Gwyneth begins preparations, waiting for the day when Rhys will claim his heritage. For with the power of the Flame and the aid of his younger brother Llewen, is there any doubt that Rhys will triumph?   However, nothing is certain in a struggle fueled by the gods. And though Rhys and Llewen have been raised together, the fortunes of war may well drive them apart.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "DAW",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "You Got to Dance with Them What Brung You",
        "Authors": "By Ivins, Molly",
        "Description": "In her long-awaited new collection, the Colt Peacekeeper of American politicalhumor draws a bead on targets that range from the Libido-in-Chief to NewtGingrich, campaign funny-money to the legislative lunacy of her native Texas--andhits a bull's-eye every time.Whether she's writing about Bill Clinton (\"The Rodney Dangerfield ofpresidents\"), Bob Dole (\"Dole contributed perhaps the funniest line of the yearwith his immortal observation that tobacco is not addictive but that too muchmilk might be bad for us.  The check from the dairy lobby must have been latethat week\"), or cultural trends (\"I saw a restaurant in Seattle that specializedin latte and barbecue.  Barbecue and latte.  I came home immediately\"), Mollytakes on the issues of the day with her trademark good sense and inimitable wit.",
        "Category": " Humor , Topic , Politics",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "The Best American Science Writing 2004",
        "Authors": "By Sobel, Dava (EDT)",
        "Description": "Jennifer Kahn's \"Stripped for Parts\" was selected as the lead story of this year's Best American Science Writing because, as Dava Sobel, best-selling author of Longitude and Galileo's Daughter, reveals, \"it begins with one of the most arresting openings I have ever read.\" In \"Columbia's Last Flight,\" William Langewiesche recounts the February 1, 2003, space shuttle tragedy, along with the investigation into the nationwide complacency that brought the ship down. K. C. Cole's \"Fun with Physics\" is a profile of astrophysicist Janet Conrad that blends her personal life with professional activity. In \"Desperate Measures,\" the doctor and writer Atul Gawande profiles the surgeon Francis Daniels Moore, whose experiments in the 1940s and '50s pushed medicine harder and farther than almost anyone had contemplated. Also included is a poem by the legendary John Updike, \"Mars as Bright as Venus.\" The collection ends with Diane Ackerman's \"ebullient\" essay \"We Are All a Part of Nature.\"Together these twenty-three articles on a wide range of today's most current topics in science -- from biology, physics, biotechnology, and astronomy, to anthropology, genetics, evolutionary theory, and cognition‚ represent the full spectrum of scientific writing from America's most prominent science authors, proving once again that \"good science writing is evidently plentiful\" (Scientific American).",
        "Category": " Science , Essays",
        "Publisher": "Ecco",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "50 Simple Things You Can Do to Save Your Life",
        "Authors": "By Faculty of the UCLA School of Public Health",
        "Description": "A practical manual for healthy living offers advice on preventing accidents, dealing with emotional problems, and preventing a host of illnesses, including AIDS, cancer, and heart disease",
        "Category": " Health & Fitness , General",
        "Publisher": "Bathroom Readers Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    }
]