[
    {
        "Title": "The Complete Horse & Rider",
        "Authors": "By Sarah Muir, Debby Sly",
        "Description": "",
        "Category": "",
        "Publisher": "Anness Publishing Limited",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Wizardborn (The Runelords, Book 3)",
        "Authors": "By Farland, David",
        "Description": "Book Three of The RunelordsCertain works of fantasy are immediately recognizable as monuments, towering above the rest of the category. Authors of those works, such as Stephen R. Donaldson, J.R.R. Tolkien, Robert Jordan and Terry Goodkind, come immediately to mind. Now add David Farland to that list, whose epic fantasy series began with The Runelords.Wizardborn continues the story of the struggle of Gaborn, now the Earth King, who has lost his powers but continues to lead his people. He must contend with the threat of the huge, inhuman Reavers, whose myriads Gaborn and his forces must now pursue across the nation. It has become Gaborn's fate to follow, even into the depths.Raj Ahten, the great warlord endowed with the strength and qualities of thousands of men, once the primary threat to Gaborn, now struggles to retain his own empire. His war of conquest thwarted, his very life is now threatened by the Reaver thousands.And a young girl, Averan, who has eaten a Reaver and absorbed some of its memories, becomes a keystone in the search for the dark Reaver lair.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Tor Fantasy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Discover Your Inner Wisdom: Using Intuition, Logic, and Common Sense to Make Your Best Choices",
        "Authors": "By Margolis, Char and St. George, Margaret",
        "Description": "The world-renowned psychic intuitive shares her special gifts by teaching you how to tap into your intuitive powers to make the wisest choices in life and obtain more money, love, and success.Every day, people are faced with countless decisions, from the trivial to the very important. Yet few are able to truly hear that inner voice that helps them make the wisest choices: their intuition. Char Margolis explains how to do just that. Using her own incredible experiences, she outlines how to use your own inner voice as you learn to develop your intuitive powers in four simple steps. By combining intuition with logic and common sense, you will be able to make better decisions and attract the people and opportunities you most deeply desire into your life. Learn how to: Tune in to your health and use your energy to heal Raise healthy, happy children by nurturing their intuition as well as your own Listen to your instincts in evaluating people and opportunities Attract compatible partners Access your sexual energy Sense the right career opportunities Recognize the messages you are receiving from your deceased loved onesChar also provides helpful instruction on how to prevent potential problems, protect yourself from bad energy, cope with setbacks, and get attuned to the universal plan.With Char's guidance, you will be empowered to begin your own personal journey of discovering  -- and listening to -- your inner wisdom.",
        "Category": " Self-help , Personal Growth , Happiness",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Learning French on Your Own (Complete Idiot's Guides) (French Edition)",
        "Authors": "By Stein, Gail",
        "Description": "The Complete Idiot's Guide to Learning French on Your Own makes French fun and entertaining - so you don't feel bogged down with a \"directory\" of words. Feel confident about speaking the language and communicating with native speakers whether you're planning a vacation or preparing for a business trip. In this Complete Idiot's Guide you get enough of the basics that you can put to use immediately; friendly advice in an easy-to-understand format; tips, definitions, and warnings to help you along the way; and clear illustrations that feature everything you need to know!",
        "Category": " Foreign Language Study , French",
        "Publisher": "Macmillan Distribution",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Angel Animals: Divine Messengers of Miracles",
        "Authors": "By Anderson, Allen (COM), Anderson, Linda C. (COM), and Becker, Marty (FRW)",
        "Description": "Angel Animals is a collection of stories by ordinary people about the spiritual lessons and truths they've learned from animals. Part one focuses on what angel animals teach people about relationships. Part two covers how angel animals provide lessons on handling life's challenges. In part three angel animals impart lessons on death, dying, and the afterlife. Whether these animals are daily companions or creatures observed in nature, they demonstrate gratitude, survival, courage, and forgiveness. The stories are touching, humorous, and remarkably inspiring. Each one includes a meditation or a question or comment to help readers carry the spirit of these angel animals into their own lives.",
        "Category": " Pets , Essays & Narratives",
        "Publisher": "New World Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "The Warrior Generals: Combat Leadership in the Civil War",
        "Authors": "By Buell, Thomas B.",
        "Description": "master historian gives readers a fresh new picture of the Civil War as it really was. Buell examines three pairs of commanders from the North and South, who met each other in battle. Following each pair through the entire war, the author reveals the human dimensions of the drama and brings the battles to life. 38 b&w photos.From the Hardcover edition.",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "St. Petersburg (Eyewitness Travel Guides)",
        "Authors": "By Rice, Melanie, Phillips, Catherine, and Rice, Christopher",
        "Description": "",
        "Category": " Travel , Russia",
        "Publisher": "DK Travel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Tom Cruise: An Unauthorized Biography",
        "Authors": "By Morton, Andrew",
        "Description": "1992: Andrew Morton showed a Princess in a light we had never seen before--Diana: Her True Story became a #1 New York Times bestseller.1999: Andrew Morton revealed the young woman behind the blue dress--Monica’s Story was a #1 New York Times bestseller.January 15, 2008: Andrew Morton uncovers the true story of the biggest celebrity of our age.      Everyone knows Tom Cruise---or at least what he wants us to know. We know that he overcame a difficult childhood to star in astonishing array of blockbusters: Top Gun, Rain Man, Born on the Fourth of July, A Few Good Men, Interview with the Vampire, Jerry Maguire, three Mission: Impossible movies, War of the Worlds, and more. We know he has taken artistic chances, too, and as a result has earned three Academy Award nominations and three Golden Globes, along with the respect of acting legends like Paul Newman and Dustin Hoffman.      After that, the picture becomes a little less clear. We know that Tom is a Scientologist, but not necessarily what that means in his life. We know that, despite persistent rumors about his sexuality, he has been married to Mimi Rogers, Nicole Kidman, and Katie Holmes. But it was not until the spring of 2005, when he jumped on Oprah’s couch to proclaim his love for Katie and denounced Brooke Shields for turning to the “Nazi science” of psychiatry, that we began to realize how much we didn’t know about the charming, hardworking star.      For two years, award-winning biographer Andrew Morton has been tirelessly seeking out everyone from former teachers and girlfriends to Scientology insiders to friends who have watched a once-bullied, “nothing special” outsider transform himself into an icon Forbes has called the most powerful celebrity in the world  Here, with never-seen photos and never-heard revelations, is a riveting, sometimes shocking portrait of the real Tom Cruise---his work, his love life, his marriages, his religion---from a master at uncovering the true story behind the public face of celebrity.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Student Study Guide for Biology",
        "Authors": "By Taylor, Martha R.",
        "Description": "",
        "Category": " Science , Life Sciences , Biology",
        "Publisher": "Benjamin-Cummings Pub Co",
        "Price Starting With ($)": "6.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Best of Gourmet: Featuring the Flavors of Thailand",
        "Authors": "By Yanes, Romulo A. (PHT)",
        "Description": "Nowadays, everyone who entertains is looking for outstanding casual fare that will allow them to spend more time with their guests. Dishes must be quick and easy to prepare (or able to be made ahead) and filled with the purest ingredients for optimum flavor. The Best of Gourmet, Featuring the Flavors of Thailand is filled with twenty-eight such menus-most are very relaxed, all are absolutely delicious.For example, after a chilly day on the slopes, you may want to treat your houseguests to A Ski House Dinner. Begin the evening around the fire with champagne and a large platter of ever-so-tender smoked salmon with cilantro cream. Later, roasted veal chops with shallots, tomatoes, and olive jus nestled on pillows of soft polenta make a rich, indulgent entrée. And before everyone retires, a heavenly warm chocolate raspberry pudding cake, made the day before and reheated, is served with a glass of cognac. When the summer heats up, why not spend A Weekend at the Shore with friends? You'll have three clever menus in hand that take advantage of the season's abundant fresh produce, include plenty of make-ahead dishes, and satisfy hearty seaside appetites. On Saturday morning you can serve Breakfast on the Beach with buttery-rich baked blueberry-pecan French toast. Lunch Indoors includes a serve-yourself composed salad of classic favorites and a lovely rhubarb rice pudding. Then, after a long day in the sun, Dinner on the Deck promises a seafood meal to remember with curry-marinated mussels, followed by grilled lobster with Southeast Asian dipping sauce. Or perhaps a last-minute Beyond Backyard Basics dinner is closer to what you had in mind? This little gem of a menu features ratatouille with penne-a heavenly jumble of roasted eggplants, onions, yellow squash, and red bell peppers, with plum tomatoes, garlic, thyme, parsley, and basil. For dessert, multicolored grapes perched atop pastry cream in puff pastry shells make a scrumptious and ever-so-pretty choice.So which menu will you try first? You'll find more than eighty pages of exquisite full-color photographs to help you decide. Altogether, this volume holds more than 350 recipes-including the very best recipes that appeared in Gourmet's food columns during 1999. There are hundreds of dishes that can be made in forty-five minutes or less (look for the clock symbol ð); plenty of leaner and lighter selections (look for the feather symbol F); seasonal ideas for everything from apples to zucchini; and an impressive array of tempting sweets and snacks.This year's Cuisines of the World section turns to the intriguing flavors of Thailand with a traditional dinner for eight and a collection of Thai snacks. Dishes such as steamed red snapper with ginger, grilled beef salad, fish cakes, and coconut ice cream demonstrate the sweet, sour, hot, and salty tastes of this fascinating country. Informative primers and exquisite full-color photos add further insight.Twenty-four more brand-new recipes appear in a special section featuring Unusual Pastas and Grains. From fresh rice noodles to Israeli couscous to wheat berries, and much more, these unique pantry items will undoubtedly expand your palette of flavors.Just when you thought you had tasted it all, along comes a cookbook that opens up a world of new possibilities-The Best of Gourmet",
        "Category": " Cooking , Methods , Gourmet",
        "Publisher": "Random House",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Terrific 2x4 Furniture: Building Stylish Furniture From Standard Lumber",
        "Authors": "By Henderson, Stevie and Baldwin, Mark",
        "Description": "\"If you're looking for good ideas for projects that you and your family can live with for a long time, this is the right book.\"--WoodworkIf you can fasten two boards together with nails or screws, you can decorate your entire house with great-looking furniture you've constructed yourself! Made with minimal materials (readily available stock lumber and parts), these 20 inexpensive and basic projects cover a variety of tables, benches, stools, shelves, and bookcases--everything you could possibly need. Build a simple cupboard that fits cozily into a corner, an entertainment center to neatly hold your electronic goodies, a spacious desk where you can work comfortably, and a beautiful dining table where family and guests can partake of good food and company. A special section introduces the techniques you'll need, every project includes a precise cutting list and detailed diagrams, and there are ideas for stains, paints, and other embellishments so your furniture will fit your décor precisely.",
        "Category": " House & Home , Furniture",
        "Publisher": "Sterling/Lark",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Biblical Financial Study",
        "Authors": "By small-group-practical-application-wb",
        "Description": "",
        "Category": "",
        "Publisher": "Crown Financial Ministries",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Jerry Baker's Backyard Problem Solver: 2,364 Simple Solutions for Super Soil, Great Grass, Amazing Annuals, Perfect Perennials, Vibrant Vegetables, Terrific Trees, Bad Bugs, Wicked Weeds, a",
        "Authors": "By Baker, Jerry",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Amer Master Products",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The Modern US War Machine: An Encyclopedia of American Military Equipment and Strategy",
        "Authors": "By Bonds, Ray (EDT)",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Crown Publishers Inc.",
        "Price Starting With ($)": "8.78",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The Explosive Child: A New Approach for Understanding and Parenting Easily Frustrated, \"Chronically Inflexible\" Children",
        "Authors": "By Greene, Ross W.",
        "Description": "The groundbreaking “New Approach for Understanding and Parenting Easily Frustrated, Chronically Inflexible Children,” The Explosive Child by Ross W. Greene, Ph.D., has been updated and revised to include the latest research. Dr. Greene is Associate Clinical Professor in the Department of Psychiatry, Harvard Medical School and the originator of the Collaborative Problem Solving approach to the treatment and study of children with social, emotional, and behavioral challenges. With The Explosive Child he offers an indispensable helping hand to parents who may feel overwhelmed by having to deal with children whose reactions to everyday stimuli may be far more extreme than normal.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Powersculpt: The Women's Body Sculpting & Weight Training Workout Using the Exercise Ball",
        "Authors": "By Frediani, Paul",
        "Description": "An exercise ball program designed for women offers workouts for every fitness level and includes tips and techniques for building strength, burning calories, and improving flexibility.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Hatherleigh Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "A Taste of Murder: Diabolically Delicious Recipes from Contemporary Mystery Writers",
        "Authors": "By Grossman, Jo and Weibezahl, Robert",
        "Description": "A collection of recipes created by popular mystery writers features such mysterious and delicious dishes as Kinsey Millhone's Famous Peanut Butter and Pickle Sandwich and Judge Deborah Knott's Aunt Zell's Pecan Pie. Original.",
        "Category": " Cooking , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Uncle John's Triumphant 20th Anniversary Bathroom Reader (Uncle John's Bathroom Reader Annual)",
        "Authors": "By Bathroom Readers' Institute",
        "Description": "At a whopping 600 absorbing pages, Uncle John pulled out all the stops to make the behemoth Triumphant 20th Anniversary Bathroom Reader the epitome of Throne Room entertainment.Happy birthday, Uncle John! This 20th anniversary edition proves that some things do get better with age. Since 1987, the Bathroom Readers’ Institute has led the movement to stand up for those who sit down and read in the bathroom (and everywhere else for that matter). Uncle John’s Triumphant 20th Bathroom Reader is jam-packed with 600 pages of all-new articles (as usual, divided by length for your sitting convenience). In what other single book could you find such a lively mix of surprising trivia, strange lawsuits, dumb crooks, origins of everyday things, forgotten history, quirky quotations, and wacky wordplay? Uncle John rules the world of information and humor, so get ready to be thoroughly entertained as you read about: * The incredible (edible) history of bread* The secret congressional bomb shelter* Farts in the news* The history of the aloha shirt* The real Zorro* The worst city in America* How your taste buds work* It’s the Peanuts story, Charlie Brown And much, much more!",
        "Category": " Reference , Trivia",
        "Publisher": "Portable Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Skeleton Coast (The Oregon Files)",
        "Authors": "By Cussler, Clive and Du Brul, Jack B.",
        "Description": "Chairman of the Corporation Juan Cabrillo and his mercenary crew steer theOregon into battle against a militant leader and his cult-like followers in this #1 New York Times-bestselling series.Juan Cabrillo and the crew of the covert combat ship Oregon have barely escaped a mission on the Congo River when they intercept a mayday from a defenseless boat under fire off the African coast. Still smarting from a weapons-trade gone bad and a double-cross, Cabrillo takes action. He manages to save the beautiful Sloane Macintyre, who's on a mission of her own, looking for a long-submerged ship that may hold a fortune in diamonds. But what surprises Cabrillo is her story about a crazy fisherman who claims to have been attacked on the open sea by giant metal snakes in the same area.What begins as a snake hunt leads Cabrillo onto the trail of a far more lethal quarry—a deranged militant and his followers who plan to unleash the devastating power of nature itself against all who oppose them.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The Expanding Discourse: Feminism And Art History",
        "Authors": "By Broude, Norma and Garrard, Mary D. (EDT)",
        "Description": "A sequel to the pioneering volume, Feminism and Art History: Questioning the Litany, published in 1982, The Expanding Discourse contains 29 essays on artists and issues from the Renaissance to the present, representing some of the best feminist art-historical writing of the past decade. Chronologically arranged, the essays demonstrate the abundance, diversity, and main conceptual trends in recent feminist scholarship.",
        "Category": " Art , General",
        "Publisher": "Routledge",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The Gourmet Garage Cookbook: 200 Everyday Recipes Using Fresh and Exotic Ingredients from Around the World",
        "Authors": "By London, Sheryl, London, Mel, and Skelly-Kurka, Kathleen (ILT)",
        "Description": "From New York's hottest and fastest-growing chain of gourmet food stores, a cookbook bursting with new flavors.Founded in 1992 as a supplier of fresh and exotic ingredients to the chefs and restaurateurs of New York, the Gourmet Garage became a retailing leg when it opened its doors to the public a few years later.  Now, award-winning cookbook authors Sheryl and Mel London and the experts of the Gourmet Garage show you how to select from the dizzying array of both everyday and sometimes unfamiliar ingredients, transforming them into simple, wonderful meals in your own kitchen.Unlike other cookbooks, The Gourmet Garage Cookbook is organized by ingredient and takes you through every section of a specialty food store that is just one step away from the farmer. From the fruit section, papaya and lime combine in a relish for grilled shrimp. Gourmet yams are accompanied by pears, crystallized ginger, and distilled figs. Of particular interest to the home cook are the \"Shop Smart\" tips in each chapter which tell the reader how to choose the best and freshest products in the marketplace, and \"Notes for the Cook,\" containing dozens of helpful hints for making the most out of fresh ingredients.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Henry Holt and Co.",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "The Good Life Small-Group Special Edition",
        "Authors": "By Colson, Charles, Fickett, Harold, and Warren, Rick (FRW)",
        "Description": "The Good Life searches for answers to the questions we all ask: Who am I? Why am I here? How can I make my life count? Reflecting on his own story and the stories of others, Chuck Colson examines the beliefs and assumptions that make up the fabric of our lives. In this edition, there is additional material that relates to a worldview campaign that is presented by both Rick Warren and Chuck Colson called Wide Angle: Framing Your Worldview. Foreword provided by Rick Warren.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Sacred Romance Workbook and Journal: Your Personal Guide for Drawing Closer to the Heart of God",
        "Authors": "By Eldredge, John",
        "Description": "Do you long to recover your heart? To hear the Lord wooing you with untamed love, inviting you to a life of wonder and adventure? The Sacred Romance Workbook and Journal can help you unearth your heart and reveal God as the Author of a magnificent story?one in which you play an important part. Through this book, you will:Realize that the life you've created for yourself may be far too safe and too formulaic compared to the drama God desires for you.Relinquish the pain of inner wounds and enable yourself to more fully embrace the Romancer's love.Understand how Satan tries to distract you from God's \"larger story\" and discover strategies you can use to defeat him.Abide in the Lover and let Him give you dep, supernatural security that's not dependent on external circumstances.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Eat, Drink, and Weigh Less: A Flexible and Delicious Way to Shrink Your Waist Without Going Hungry",
        "Authors": "By Katzen, Mollie and Willett, Walter",
        "Description": "The head of the Department of Nutrition at Harvard and the author of Moosewood Cookbook have teamed up to create a new program that will show you how to shrink your waist and keep pounds off--while still eating everything you love!With so many fad diets telling us to eat only this or none of that, it's no surprise that so many of us believe it's impossible to lose weight while eating a wide variety of delicious foods. But it is possible--and surprisingly simple. Eat, Drink, and Weigh Less presents a medically sound, easy-to-use program that paves the way for lifelong weight loss and good health.This isn't a diet that deprives you of anything. You'll lose weight while eating and drinking the same things you already enjoy, including chocolate and alcohol! The secret is adding delicious food to your diet and making surprisingly simple changes in what you eat throughout the day. These small moves will add up to a big weight loss.The Eat, Drink, and Weigh Less eating plan is flexible, adaptable to your lifestyle, and simple to implement. It even features a powerful new way to chart your progress, called the Body Score: The more you raise your Body Score, the more you will lower your weight!While the concept is simple, the science behind it is not. The plan represents years of research conducted by Walter Willett, M.D., the head of the Harvard School of Public Health's Department of Nutrition, including results from the famous Nurses' Health Study. This study scored each of its more than 84,000 participants on food choices, exercise schedule, and body mass--resulting in a number that accurately determined the nurses' risk of heart disease.Now, for the first time, Dr. Willett has teamed up with bestselling cookbook author Mollie Katzen to adapt this complex study to everyday use. With their Nine Turning Points and more than 100 delicious new recipes, they've created a user-friendly diet plan with fail-safe results. Choose foods according to these nine principles and you'll raise your Body Score--and lower your weight for good!",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Answering Islam: The Crescent in Light of the Cross",
        "Authors": "By Saleeb, Abdul and Geisler, Norman L.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Robert Ludlum's The Bourne Betrayal",
        "Authors": "By Lustbader, Eric",
        "Description": "Already devastated by loss, Bourne is shattered by a report that his last friend in the world, Martin Lindros has gone missing.  A CI deputy director, Lindros was in Ethiopia tracking suspicious shipments of yellowcake uranium and atomic bomb weaponry.    His last lifeline to humanity, Bourne will not let Lindros go.  Despite his hatred for CI, Bourne sets out to rescue his friend and finish the job: dismantling a terrorist network determined to build nuclear armaments by cutting off their source of money.  But Bourne doesn't realize that these men, Islamic supremacists, are leaders of an incredibly dangerous, technologically savvy group with ties from Africa, across the Middle East, and into Eastern Europe and Russia.  They have predicted Bourne's every move, and are counting on his unwitting help in their plans to destroy America.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Post-Modern Pilgrims: First Century Passion for the 21st Century World",
        "Authors": "By Sweet, Leonard",
        "Description": "There is a legend of a Welsh Prince Madoc whose ship became stuck in Chesapeake Bay. After trying unsuccessfully to escape, he had his men row out with the anchor, drop it as far into the sea as they could, and then the ship winched its way forward. The image of the church as a boat and tradition as an anchor is prevalent in Christian art. If we examine the biblical view of an anchor, we find, like Prince Madoc, we are to cast our anchor into the future and pull the church forward.Postmodern pilgrims must strive to keep the past and the future in perpetual conversation so every generation will find a fresh expression of the Gospel that is anchored solidly to “the faith that was once for all delivered.”",
        "Category": " Religion , Christian Living , General",
        "Publisher": "B&H Books",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Building Effective Lay Leadership Teams",
        "Authors": "By George Barna",
        "Description": "",
        "Category": "",
        "Publisher": "Issachar Resources",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Purpose-Driven® Youth Ministry",
        "Authors": "By Fields, Doug",
        "Description": "If you long to reach kids and see their lives changed by God, this comprehensive guide shows you how. Purpose Driven Youth Ministry will do for youth ministry what Rick Warren's Gold Medallion award-winning, The Purpose Driven Church is doing for pastoral ministry. It's an indispensable guide to creating and maintaining youth ministry for the long run. It will help you create a solid spiritual team that builds the foundations of the Christian faith into the hearts and lives of young people. Forged around the fundamental purposes of evangelism, discipleship, fellowship, ministry, and worship, Purpose Driven Youth Ministry uses the experiences of Saddleback Church to illustrate what a healthy Youth ministry can be. Nine transferable principles help you - Connect with the power of God for passionate, committed leadership - Define the purpose of your ministry and communicate it effectively - Identify your potential audience - Create programs that reach your audience and fulfill God's purposes - Implement processes that move students to maturity - Enhance your ministry with clearly defined values - Team up with parents to involve the whole family - Find volunteers and develop them into participating leaders - Persevere through tough times and thrive in an ever-changing environment. Balancing both theory and practice, Purpose Driven Youth Ministry can be applied to any church setting, regardless of size, denomination, facilities, resources, and existing leadership. Purpose-Driven Youth Ministry will help you develop a ministry that equips students rather than a ministry that coordinates events. Doug Fields says, 'My goal for this book is to coach you through a plan to build a healthy youth ministry that isn't dependent on one great youth leader and won't be destroyed when the youth worker leaves the church. It's not a book on how to grow your youth ministry with six easy steps; it's about identifying, establishing, and building health into your church's youth ministry.",
        "Category": " Religion , Institutions & Organizations",
        "Publisher": "Zondervan/Youth Specialties",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Making a Difference: The Peace Corps at Twenty-Five",
        "Authors": "By Viorst, Milton (EDT)",
        "Description": "Describes the formation of the Peace Corps, depicts the experiences of volunteers, and examines the accomplishments of the Corps",
        "Category": " Social Science , General",
        "Publisher": "Grove Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "God, Creation, and Tools for Life (Journey of the Soul Series: Book 1)",
        "Authors": "By Browne, Sylvia, Francine, and Raheim",
        "Description": "The best-selling author of Adventures of a Psychic discusses such topics as reincarnation, healing and nutrition, one's relationship to God, soulmates, and meditation, in the first volume of her new series on the journey of the spirit. Original. 50,000 first printing.",
        "Category": " Body, Mind & Spirit , New Thought",
        "Publisher": "Hay House Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Jim Wilson's Container Gardening: Soils, Plants, Care, and Sites",
        "Authors": "By Wilson, James W.",
        "Description": "Wilson, the former host of PBS' The Victory Garden, brings his expertise to container gardening and includes information on types of containers and instructions on making containers, matching plants to containers, and creating landscaping focal points.",
        "Category": " Gardening , Container",
        "Publisher": "Taylor Trade Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "2 x 4 Projects for Outdoor Living",
        "Authors": "By Henderson, Stevie and Baldwin, Mark",
        "Description": "Increase your joy in outdoor living with this complete guide for building useful, attractive items for backyards, decks, and porches. The 21 projects range from assorted tables, chairs and even couches to a trellis, porch swing, outdoor bar, even an easy-to-make movable deck. A solid chapter on the basics, detailed illustrations, exploded drawings, and step-by-step directions make it all quite simple.",
        "Category": " House & Home , Outdoor & Recreational Areas",
        "Publisher": "Sterling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Job Interviews For Dummies",
        "Authors": "By Kennedy, Joyce Lain",
        "Description": "Appearance. Performance skills. Confidence. All are winning – and attainable – traits that will help you land the job you want. You can acquire these skills by perusing Job Interviews For Dummies. This revised edition incorporates a multitude of updates and covers all the bases in getting employers to say, You're the one!Written for all job seekers – new entrants, midlevel people, very experienced individuals, and technical and non-technical job seekers – Job Interviews For Dummies is packed with the building blocks of show-stopping interviews. These range from strategies and techniques to sample dialogue and research tips. Interviewing for a job is kind of like a stage performance, and if you want metaphorical standing ovations, then follow the guidelines offered in these pages.In this book, you'll explore the basics of interviewing, from how to dress to how to answer all sorts of questions – questions about you, your interest in the company, your experience, you education and training, your skills, your age, and questions they shouldn't ask but sometimes do anyway. You'll also uncover information aboutPracticing for your interview, and why it's so importantRecognizing the mind games of job testingWooing reviewers who give you referencesIdentifying various interviewing scenarios you should expectAnswering questions to sell yourself.Understanding the new interviewing technology, such as telephone interviews and video transmissions.On the stress scale, interviewing for a job ranks with making speeches before a vegetable-throwing crowd. Stress is such a big issue that some interviewees take tranquilizers or beta blockers to reduce it. A better way exists: Master the job-interviewing process. Get the winning ways down pat, and you'll have a special kind of insurance the rest of your working days. This guide can help.",
        "Category": " Business & Economics , Careers , Job Hunting",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "David: A Man of Passion & Destiny (Great Lives from God's Words, Volume 1)",
        "Authors": "By Swindoll, Charles R.",
        "Description": "David, unlike any Bible character before him, had the charisma to inspire a great nation. Yet in other ways he was a most ordinary man-often gripped by destructive passion, rocked by personal tragedy, and motivated by political gain. Yet, he is the one character the Bible describes as a \"man after God's own heart.\" In this first volume of the \"Great Lives\" series Charles Swindoll shows how David proved his love for God many times over in an extraordinary life that left an enduring legacy of faith.",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "ROBERTS RIDGE: A Story of Courage and Sacrifice on Takur Ghar Mountain, Afghanistan",
        "Authors": "By MacPherson, Malcolm",
        "Description": "Afghanistan, March 2002. In the early morning darkness on a frigid mountaintop, a U.S. soldier is stranded, alone, surrounded by fanatical al Qaeda fighters. For the man’s fellow Navy SEALs, and for waiting teams of Army Rangers, there was only one rule now: leave no one behind. In this gripping you-are-there account–based on stunning eyewitness testimony and painstaking research–journalist Malcolm MacPherson thrusts us into a drama of rescue, tragedy, and valor in a place that would be known as...ROBERTS RIDGEFor an elite team of SEALs, the mission seemed straightforward enough: take control of a towering 10,240-foot mountain peak called Takur Ghar. Launched as part of Operation Anaconda–a hammer-and-anvil plan to smash Taliban al Qaeda in eastern Afghanistan –the taking of Takur Ghar would offer U.S. forces a key strategic observation post. But the enemy was waiting, hidden in a series of camouflaged trenches and bunkers–and when the Special Forces chopper flared on the peak to land, it was shredded by a hail of machine-gun, small arms, and RPG rounds.  A red-haired SEAL named Neil Roberts was thrown from the aircraft.  And by the time the shattered helicopter crash-landed on the valley floor seven miles away, Roberts’s fellow SEALs were determined to return to the mountain peak and bring him out–no matter what the cost.Drawing on the words of the men who were there–SEALs, Rangers, medics, combat air controllers, and pilots–this harrowing true account, the first book of its kind to chronicle the battle for Takur Ghar, captures in dramatic detail a seventeen-hour pitched battle fought at the highest elevation Americans have ever waged war. At once an hour-by-hour, bullet-by-bullet chronicle of a landmark battle and a sobering look at the capabilities and limitations of America’s high-tech army, Roberts Ridge is the unforgettable story of a few dozen warriors who faced a single fate: to live or die for their comrades in the face of near-impossible odds.",
        "Category": " History , Military , Other",
        "Publisher": "Bantam Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Heart of Darkness and the Secret Sharer (Signet Classics)",
        "Authors": "By Conrad, Joseph",
        "Description": "Featuring a new introduction by Joyce Carol Oates, the author's two best-known stories tell of encounters with moral depravity in the wilds of the Congo and second selves on a voyage into the Gulf of Siam. Reprint.",
        "Category": " Fiction , Classics",
        "Publisher": "New Amer Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Children of Abraham",
        "Authors": "By Halter, Marek",
        "Description": "The narrator sets out to discover why his cousin Hugo and Hugo's wife Sigrid were gunned down in cold blood in March of 1961",
        "Category": " Fiction , General",
        "Publisher": "Arcade Publishing",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Dinosaur Summer",
        "Authors": "By Bear, Greg and DiTerlizzi, Tony (ILT)",
        "Description": "Peter Belzoni is dreading summer in Manhattan. Then his father, photojournalist Anthony Belzoni, offers the youth a job, a byline in National Geographic...and a trip to South America. For the Lothar Gluck Circus, once the world's foremost dinosaur attraction, has gone bankrupt. Left behind is a menagerie of avisaurs, centrosaurs, and ankylosaurs, as well as one large predatory raptor named Dagger. And now two filmmakers and the circus trainer plan to return the giants to the wild - with Peter and his dad chronicling the odyssey for Geographic. The task seems impossible. Many have died trying to bring beasts out of the Lost World, the plateau of El Grande in Venezuela, but nobody has ever attempted to transport nearly a dozen fullgrown, multiton prehistoric creatures across continents, down rivers, through jungles, and up a mountain that has been isolated for 70,000,000 years...The trek will strain the technologies of trains, cargo ships, barges, trucks...en route lurk robbers and hostile, trigger-happy soldiers...and each mile toward freedom excites Dagger toward an unstoppable, primal killing frenzy. When the unthinkable threatens to strand Peter and the rest of the crew in an uncharted realm, four modern Americans will face all the unknown dangers, mysteries, and terrors of El Grande...",
        "Category": " Fiction , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Century Ended, Century Begun: The Catholic University of America",
        "Authors": "By Maroon, Fred J.",
        "Description": "",
        "Category": " Education , General",
        "Publisher": "Catholic Univ of Amer Pr",
        "Price Starting With ($)": "7.13",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Project Management (Briefcase Books Series)",
        "Authors": "By Heerkens, Gary",
        "Description": "This reader-friendly series is a must read for all levels of managersAll managers, whether brand-new to their positions or well established in the corporate hierarchy, can use a little brushing-up now and then. The skills-based Briefcase Books Series is filled with ideas and strategies to help managers become more capable, efficient, effective, and valuable to their corporations.Project Management reviews the steps in organizing and managing projects, from how to build a realistic schedule to how to measure both success and failure. A concise and accessible, yet authoritative, guide to a topic in which books are more often lengthy and technical, Project Management discusses team building, timing, the planning process, estimating project costs, managing project interfaces, the four stages of risk management, and more.",
        "Category": " Business & Economics , Management",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Big Beefy Book of Bart Simpson (Simpsons Comic Compilations)",
        "Authors": "By Bates, Karen (EDT), Groening, Matt, and Bates, James (EDT)",
        "Description": "The newest comic book compilation in a bestselling series dedicated exclusively to the exhilarating and extraordinary extracurricular exploits of Bart Simpson!   Bart Simpson is back with a brand–new collection of comics and stories loaded with headless dolls, evil aliens, impatient apes, crossing guards, chocolate laxatives, dreadlocks, loincloths, merit badges, computer viruses, juice boxes, bubble gum, greedy gold diggers, school pictures, parking tickets, time machines, Squishees gone bad, obsessive sailors, SWAT teams, and one big ugly fish.   It's all here in one 'beefy' book that is 100% Grade–A Bart Simpson.",
        "Category": " Humor , Form , Jokes & Riddles",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Urgent Message From Mother: Gather The Women, Save The World",
        "Authors": "By Bolen, Jaen Shinoda, M.D.",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Conari Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Pirates of the Caribbean: Dead Man's Chest - The Movie Storybook",
        "Authors": "By McCafferty, Catherine (ADP)",
        "Description": "To get his ship, the Black Pearl, back from the sea's bottom, Jack Sparrow promised his soul to an evil sea spirit, Davy Jones, and now he and his crew fight for their lives as they try to find a chest that will save them from the spirit and his sea monster, Kraken.To get his ship, the Black Pearl, back from the sea's bottom, Jack Sparrow promised his soul to an evil sea spirit, Davy Jones, and now he and his crew fight for their lives as they try to find a chest that will save them from the spirit and his sea monster, Kraken.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Better Homes and Gardens Flower Gardening: Perennials : The Gardener's Collection (BETTER HOMES AND GARDENS THE GARDENER'S COLLECTION)",
        "Authors": "By Jahns, Marsha (EDT)",
        "Description": "Describes different types of perennials, discusses selection, planting, and care of perennials, and lists popular varieties",
        "Category": " Gardening , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Curious George's Dictionary",
        "Authors": "By Young, Mary O'Keefe (ILT) and American Heritage Publishing Company (EDT)",
        "Description": "The world’s most curious monkey investigates new words in this lively picture dictionary for young children.Curious George’s Dictionary is an engaging picture dictionary specially designed for children from preschool through first grade. Both entertaining and educationally sound, it features charming illustrations and reflects recent research in early childhood literacy, setting it apart from other picture dictionaries.The main part of the dictionary is an A-Z section containing approximately six hundred words, six words to a page. Each word is illustrated with a full-color drawing, most of which have been created for this book by the popular illustrator Mary O’Keefe Young. More than half the illustrations include a sample sentence that puts the word in a familiar context.A four-page illustrated story at the front of the book shows George learning how to look up words in his dictionary, drawing children in while introducing them to dictionary skills. At the end of the book, seven one- to two-page illustrations present groups of words related by simple themes such as colors, shapes, and numbers.Developed in collaboration with educational consultants, the word list includes not only concrete objects but many more abstract concepts, like discover and enough, than do other picture dictionaries. Such words are essential for vocabulary development, and Curious George’s antics bring them alive, making them easy and fun for children to learn.",
        "Category": " Juvenile Nonfiction , Reference , Dictionaries",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.57",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Way We Work: Getting to Know the Amazing Human Body",
        "Authors": "By MacAulay, David",
        "Description": "In this comprehensive and entertaining resource, David Macaulay reveals the inner workings of the human body as only he could. In order to present this complicated subject in an accurate and entertaining way, he put in years of research. He sat in on anatomy classes, dissections, and even reached inside the rib cages of two cadavers to compare their spleen sizes. He observed numerous surgeries, including a ten-hour procedure where a diseased pancreas was removed, as well as one where a worn-out old knee was replaced by a brand new one. This hands-on investigation gives Macaulay a unique perspective to lead his readers on a visual journey through the workings of the human body.The seven sections within the book take us from the cells that form our foundation to the individual systems they build. Each beautifully illustrated spread details different aspects of our complex structure, explaining the function of each and offering up-close glimpses, unique cross-sections and perspectives, and even a little humor along the way.This one-of-a-kind book can serve as a reference for children, families, teachers, and anyone who has questions about how his or her body works. When readers see how David Macaulay builds a body and explains the way it works, they will come away with a new appreciation of the amazing world inside them.",
        "Category": " Juvenile Nonfiction , Science & Nature , General",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "6.4",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Treasure Island (Great Illustrated Classics)",
        "Authors": "By Stevenson, Robert Louis",
        "Description": "",
        "Category": " Juvenile Nonfiction , Antiques & Collectibles",
        "Publisher": "Abdo Pub Co",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Around the World in 80 Days (Great Illustrated Classics)",
        "Authors": "By Verne, Jules and Leighton, Marian (ADP)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Antiques & Collectibles",
        "Publisher": "Abdo Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Complete Book of Herbs: A Practical Guide to Cultivating, Drying, and Cooking With More Than 50 Herbs",
        "Authors": "By Callery, Emma",
        "Description": "Features advice on all aspects of growing herbs--from buying and planting them to caring for and harvesting them--and includes a section on designing an herb garden and information on drying herbs and creating potpourri.",
        "Category": " Technology & Engineering , General",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Song Of Love: The Letters of Rupert Brooke and Noel Olivier",
        "Authors": "By Harris, Pippa (EDT)",
        "Description": "Here is a treasure and a revelation: the passionate and inspiring love letters of World War I poet Rupert Brooke and a feisty young woman, Noel Olivier - edited by Noel's granddaughter - that provide a romantic portrait of Edwardian and Bloomsbury England.Rupert Brooke met Noel Olivier in 1908. She was fifteen and he was twenty. The budding poet was captivated on sight by the shy, intelligent schoolgirl and began to shower her with highly charged and exuberant letters, which continued to flow until Rupert's untimely death during World War I. While very much the modern young Englishwoman, Noel was undoubtedly overwhelmed to be the object of the poet's romantic passion and replied with painstaking honesty and astonishing verve. When he's patronizing, \"I can't think of any delightful books you would understand,\" she's reproving and feisty, \"Perhaps you thought I hadn't heard of Shakespeare, but I have.\"Song of Love presents their rich and illuminating exchange. A literary find of rare value, these fascinating letters cast new light on the Fabian and Bloomsbury milieus, allow a deeper understanding of Rupert Brooke's life and writing, and reveal the true nature of the mysterious young woman who was the first and most enduring love of his life and who went on to become the most prominent pediatrician of her era.Handsomely designed and produced, this collection of never-before-published correspondence has been edited by Pippa Harris, the granddaughter of Noel Olivier. Song of Love provides a precious glimpse into the passions and poetry of turn-of-the-century England - and into the hearts of all young lovers who, through words, can make their love magical.",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Younger Next Year for Women",
        "Authors": "By Crowley, Chris, Lodge, Henry S., and Sheehy, Gail (FRW)",
        "Description": "Co-written by one of the country's most prominent internists, Dr. Henry \"Harry\" Lodge, and his star patient, the 73-year-old Chris Crowley, Younger Next Year for Women is a book of hope, a guide to aging without fear or anxiety. This is a book of hope, a guide to aging without fear or anxiety. Using the same inspired structure of alternating voices, Chris and Harry have recast  material specifically for women, who already live longer and take better care of themselves than men. New material covers menopause and post-menopause, as well as cardiac disease, osteoporosis, sexuality, and more. This is the book that can show us how to turn back our biological clocks—how to put off 70% of the normal problems of aging (weakness, sore joints, bad balance) and eliminate 50% of serious illness and injury. The key to the program is found in Harry's Rules: Exercise six days a week. Don't eat crap. Connect and commit to others. There are seven rules all together, based on the latest findings in cell physiology, evolutionary biology, anthropology, and experimental psychology. Dr. Lodge explains how and why they work—and Chris Crowley, who is living proof of their effectiveness (skiing better today, for example, than he did twenty years ago), gives the just-as-essential motivation.Both men and women can become functionally younger every year for the next five to ten years, then continue to live with newfound vitality and pleasure deep into our 80s and beyond.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "7.78",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "The Passion: Photography from the Movie \"The Passion of the Christ\"",
        "Authors": "By Duncan, Ken (EDT), Gibson, Mel (FRW), Antonello, Philippe (EDT), and Steffen, Bonnie (EDT)",
        "Description": "The Passion is a visual portrayal of the last twelve hours in the life of Jesus. Gripping photos taken on the set of Mel Gibson's new film,The Passion of Christ, together with the biblical narratives in the New Living Translation, present the story in vivid detail. A sweeping presentation of the Passion story in powerful images that will enhance the movie experience!“This is a movie about love, hope, faith, and forgiveness. He [Jesus] died for all mankind, suffered for all of us. It's time to get back to that basic message. The world has gone nuts. We could all use a little more love, faith, hope, and forgiveness.” —Mel Gibson, Icon Productions",
        "Category": " Religion , Inspirational",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Perfectly Martha (Martha Speaks)",
        "Authors": "By Meddaugh, Susan",
        "Description": "When Otis Weaselgraft opens his Perfect Pup Institute, promising to train even the most drooling, barking, scratching, squirrel-chasing dog to be perfectly obedient in three easy steps, Martha smells a rat. There’s something very strange about the Perfect Pup graduates, and Martha is determined to find out what it is!",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Indignation",
        "Authors": "By Roth, Philip",
        "Description": "Against the backdrop of the Korean War, a young man faces life’s unimagined chances and terrifying consequences.It is 1951 in America, the second year of the Korean War. A studious, law-abiding, intense youngster from Newark, New Jersey, Marcus Messner, is beginning his sophomore year on the pastoral, conservative campus of Ohio’s Winesburg College. And why is he there and not at the local college in Newark where he originally enrolled? Because his father, the sturdy, hard-working neighborhood butcher, seems to have gone mad -- mad with fear and apprehension of the dangers of adult life, the dangers of the world, the dangers he sees in every corner for his beloved boy.As the long-suffering, desperately harassed mother tells her son, the father’s fear arises from love and pride. Perhaps, but it produces too much anger in Marcus for him to endure living with his parents any longer. He leaves them and, far from Newark, in the midwestern college, has to find his way amid the customs and constrictions of another American world.Indignation, Philip Roth’s twenty-ninth book, is a story of inexperience, foolishness, intellectual resistance, sexual discovery, courage, and error. It is a story told with all the inventive energy and wit Roth has at his command, at once a startling departure from the haunted narratives of old age and experience in his recent books and a powerful addition to his investigations of the impact of American history on the life of the vulnerable individual.",
        "Category": " Fiction , Literary",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Ending The Search For Mr. Right: How to Be Found by the Man You've Been Looking For",
        "Authors": "By McKinney Hammond, Michelle",
        "Description": "",
        "Category": " Religion , Biblical Criticism & Interpretation , Old Testament",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Wild Blue: The Men and Boys Who Flew the B-24s Over Germany 1944-45",
        "Authors": "By Ambrose, Stephen E.",
        "Description": "Stephen E. Ambrose, acclaimed author of Band of Brothers and Undaunted Courage, carries us along in the crowded and dangerous B-24s as their crews fought to destroy the German war machine during World War II.The young men who flew the B-24s over Germany in World War II fought against horrific odds, and, in The Wild Blue, Ambrose recounts their extraordinary heroism, skill, daring, and comradeship with vivid detail and affection. Ambrose describes how the Army Air Forces recruited, trained, and selected the elite few who would undertake the most demanding and dangerous jobs in the war. These are the boys—turned pilots, bombardiers, navigators, and gunners of the B-24s—who suffered over fifty percent casualties. With his remarkable gift for bringing alive the action and tension of combat, Ambrose carries us along in the crowded, uncomfortable, and dangerous B-24s as their crews fought to the death through thick black smoke and deadly flak to reach their targets and destroy the German war machine. Twenty-two-year-old George McGovern, who was to become a United States senator and a presidential candidate, flew thirty-five combat missions (all the Army would allow) and won the Distinguished Flying Cross. We meet him and his mates, his co-pilot killed in action, and crews of other planes. Many went down in flames. As Band of Brothers and Citizen Soldiers portrayed the bravery and ultimate victory of the American soldiers from Normandy on to Germany, The Wild Blue illustrates the enormous contribution that these young men of the Army Air Forces made to the Allied victory.",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Of Dreams and Kings and Mystical Things: A Novel of the Life of King David",
        "Authors": "By Strong, Joyce",
        "Description": "",
        "Category": " Fiction , Religious",
        "Publisher": "Destiny Image Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Organizational Behavior (10th Edition)",
        "Authors": "By Robbins, Stephen P.",
        "Description": "",
        "Category": " Business & Economics , Management",
        "Publisher": "Prentice Hall College Div",
        "Price Starting With ($)": "7.56",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Best American Nonrequired Reading 2008 (The Best American Series ®)",
        "Authors": "By Eggers, Dave (EDT), Blume, Judy (INT), and Bassist, Elissa (EDT)",
        "Description": "\"This great volume highlights the very best of this year’s fiction, nonfiction, alternative comics, screenplays, blogs, and more” (OK!). Compiled by Dave Eggers and students of his San Francisco writing center, it is thoroughly “entertaining and thought-provoking reading” (Library Journal).The Best American Nonrequired Reading 2008 includes MARJORIE CELONA • DAVID GESSNER • ANDREW SEAN GREER • RAFFI KHATCHADOURIAN • STEPHEN KING • EMILY RABOTEAU • GEORGE SAUNDERS • PATRICK TOBIN • LAURA VAN DEN BERG • MALERIE WILLENS • and others",
        "Category": " Literary Collections , American , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Managing Pain Before It Manages You, Revised Edition",
        "Authors": "By Caudill, Margaret A., M.D. and Benson, Herbert (FRW)",
        "Description": "Now in a revised and expanded edition, this popular workbook teaches coping skills proven to decrease the discomfort, depression, and anxiety associated with chronic pain. The information and techniques presented have been used by tens of thousands of people over nearly two decades, and have been demonstrated to empower pain sufferers and decrease pain-related disability and distress. The approach is also valuable for people coping with other chronic illness-related problems, such as fatigue. Through hands-on exercises and homework assignments, readers are helped to understand the pain process, learn about medications and their effects, and recognize factors that exacerbate or relieve symptoms. The revised edition features updated coverage of commonly used pain medications and specific pain disorders, current nutritional recommendations, and a new appendix on complementary alternative medicine. Also included are a wealth of helpful new ideas on coping with pain flare-ups, staying active, accomplishing personal goals, and more.",
        "Category": " Health & Fitness , Pain Management",
        "Publisher": "The Guilford Press",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "The Year of Yes",
        "Authors": "By Headley, Maria Dahvana",
        "Description": "Like many young people everywhere, playwright Maria Headley had had her fill of terrible dates. Discouraged and looking for love, she decided the time had come for her to eliminate her own (clearly not adequately discriminating) taste from the equation. Instead-as she vowed to her roommates one frustrated morning-she would date every person who asked her out for an entire year, regardless of circumstances. It would be her Year of Yes.Leaving her judgment and predispositions at the door, our heroine ventured into a world suddenly brimming with opportunity and found herself saying yes to:l-The Microsoft Millionaire who still lived with his mom.l-An actor she had previously sworn off as gay.l-And finally the significantly older man, divorced with kids, who she never would have looked at twice before the Year of Yes-and to whom she is now happily married.Hilariously funny and ultimately inspirational, The Year of Yes will appeal to every person who has turned down a date for the wrong reason.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "HYPERION",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Darwin Awards 4: Intelligent Design",
        "Authors": "By Northcutt, Wendy and Kelly, Christopher M.",
        "Description": "The first new Darwin Awards book in three years, The Darwin Awards 4: Intelligent Design is the latest addition to one of the most popular and successful humor franchises on bookshelves today.  Named after Charles Darwin, the father of evolution, The Darwin Awards pays homage to those who improve our gene pool by removing themselves from it.  Most of us know instinctively that the phrase ?trust me, light this fuse? is a recipe for disaster. Darwin Award winners do not. Most of us have basic sound judgment that eliminates the need for NO SMOKING signs at gas stations. Darwin Award winners do not. No warning label could have prevented evolution from creeping up on the homeowner who filled his house with natural gas to kill termites, the easy rider who decided to steer his motorcycle with his feet, or the winner who tried to weld a hand grenade onto a chain. Filled with more than one hundred new tales of evolution in action, and complete with essential science and safety discussions, The Darwin Awards 4: Intelligent Design shows that when it comes to common sense, natural selection still has a long way to go.",
        "Category": " Humor , Topic , Politics",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "See You Later Procrastinator!: Get It Done",
        "Authors": "By Verdick, Elizabeth, Espeland, Pamela, and Mark, Steve (ILT)",
        "Description": "Kids today are notorious for putting things off—it’s easy for homework and chores to take a backseat to playing video games, hanging out with friends, watching television, or surfing online. Full-color cartoons and kid-friendly text teach kids how to get motivated, stay motivated, and get things done. Kids learn 12 reasons why people procrastinate and 12 Procrastination Busters that can help; 20 ways to kiss procrastination good-bye; tips for avoiding setbacks like the dreaded Domino Effect; and Mighty Motivators and Fun Rewards to keep them on track. See You Later, Procrastinator! gives kids lots of ways to kick the procrastination habit and feel more in charge of their lives.",
        "Category": " Juvenile Nonfiction , School & Education",
        "Publisher": "Free Spirit Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "The Five Temptations of a CEO",
        "Authors": "By Lencioni, Patrick",
        "Description": "Absorbing, compelling, and utterly memorable, The Five Temptations of a CEO is like no other business book that's come before. Author Patrick Lencioni—noted screenplay writer and sought-after executive coach -- deftly tells the tale of a young CEO who, facing his first annual board review, knows he is failing, but doesn't know why.\"This book provides extraordinary insight into the pitfalls that leaders face when they lose sight of the true measure of success: results. This model is required reading for my staff.\"—Eric Schmidt, chairman of the board and CEO, NovellAny executive can learn how to:recognize the mistakes that leaders can makeavoid errors before they occurand much more!Refreshingly original and utterly compelling, the story of this executive (written to be read in one sitting) will be enjoyed, remembered, and reread for years to come. It serves a timeless and potent reminder that success as a leader can come down to practicing a few simple behaviors—behaviors that are painfully difficult for each of us to master.\"Lencioni delivers a provocative message: CEOs mainly have themselves to blame when things go wrong. If you're a CEO (or any manager for that matter), do you have the courage to face the blame? Doing so could change your future-for the better.\"—Dr. Jerry Porras, coauthor, Built to Last; professor, Stanford School of BusinessYou won't find any dry management rhetoric in this razor-sharp novelette. Apply these riveting lessons in leadership with the self-assessment at the end of the book. It will change your career!",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "How to Study Mathematics",
        "Authors": "By Burrier, H.",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice-Hall",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "The Gates of Hell",
        "Authors": "By Salisbury, Harrison E.",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1975"
        }
    },
    {
        "Title": "The Ultimate Horse Lover: The Best Experts' Guide for a Happy, Healthy Horse with Stories and Photos of Awe-Inspiring Equines",
        "Authors": "By Becker, Marty, Spadafori, Gina, Kline, Carol, and Becker, Mikkel",
        "Description": "The Ultimate Read for Horse Lover's . . .During their professional lives spent caring for, writing about, and riding horses, top equestrian experts Marty Becker, D.V.M., Audrey Pavia, Gina Spadafori, and Mikkel Becker have witnessed some amazing stories about the bonds between people and their beloved equines--true stories of love, loyalty, laughter, courage, connection, and camaraderie. Here these esteemed experts have compiled amazing true stories that will make you laugh and cry as you celebrate how much horses bring to our lives emotionally, physically, and spiritually. And, whether your passion is riding, showing, or racing, life with a horse is never without questions, so you'll find expert advice from top veterinarians, trainers, behaviorists, and other authorities on all manner of equine topics, including nutrition and preventative care, communication and behavior, and so much more. With over sixty pages of photos that capture the awe-inspiring beauty of horses, this is truly the ultimate book that will make any horse lover whinny with delight.",
        "Category": " Pets , Horses",
        "Publisher": "HCI",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Happy Halloween, Curious George tabbed board book",
        "Authors": "By Rey, H. A.",
        "Description": "Halloween is here, and Curious George is getting ready for the big night. There are so many costumes to try on, treats to share, and games to play! George has so much Halloween fun picking out the perfect pumpkin, decorating his house, and celebrating with his friends that he’s not sure he’s ready for the day to end. Follow the little monkey through his fun-filled day with this book of poems. Happy Halloween, Curious George is a sweet treat to help Curious George fans of all ages get in the Halloween spirit.",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Learning Curves: A Novel",
        "Authors": "By Townley, Gemma",
        "Description": "From the dazzling author of Little White Lies and When in Rome . . . comes a rollicking  new novel of love in the boardroom. Jennifer Bell used to travel the planet  with her boyfriend, fighting the good fight for mother Earth. But after the breakup  (not a good fight), Jen moved back to London to work for another mother: her own.  Harriet Bell founded Green Futures, a consulting firm, after splitting up with Jen’ s big-shot father, who runs a rival (and Harriet thinks corrupt) company. But Harriet  can’t expose his crimes without proof. And she wants Jen to find some. Since Jen  hasn’t seen her dad in more than fifteen years, it’s a snap to infiltrate his company  . . . under an assumed name, of course. Soon she’s worming her way into the good  graces of the company’s managers to find evidence of wrongdoing. What she discovers  is that her father’s world is a whole lot different from her own–filled with Palm  Pilots, MBAs, martini lunches, designer suits, and Daniel Peterson, a guy who puts  the gorge in gorgeous. Suddenly Jen is torn between Birkenstocks and Jimmy Choos,  tree-hugging and air-kissing. Could it be that her Big Bad Dad isn’t the monster  her mom made him out to be? Or is Jen simply being seduced by the power of hard deals,  hot nights, and wads of cash? Only time will tell–preferably from a Cartier watch  on the wrist of Daniel Peterson. . . .",
        "Category": " Fiction , Women",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "The Godbearing Life: The Art of Soul Tending for Youth Ministry",
        "Authors": "By Dean, Kenda Creasy and Foster, Ron",
        "Description": "Specifically designed to nurture the spiritual life of the youth leader. The Godbearing Life is a lively spiritual primer and practical guide for those who pastor young people. With soul-searing honesty, the authors rechart a course for youth ministry through the classical spiritual disciplines of the church, identifying the ways that young people are most likely to encounter God.",
        "Category": " Religion , Institutions & Organizations",
        "Publisher": "Upper Room",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Reframing Organizations: Artistry, Choice, and Leadership (Jossey Bass Business & Management Series)",
        "Authors": "By Bolman, Lee G. and Deal, Terrence E.",
        "Description": "In this third edition of their best-selling classic, authors Lee Bolman and Terrence Deal explain the powerful tool of \"reframing.\" The authors have distilled the organizational literature into a comprehensive approach for looking at situations from more than one angle. Their four frames view organizations as factories, families, jungles, and theaters or temples: The Structural Frame: how to organize and structure groups and teams to get resultsThe Human Resource Frame: how to tailor organizations to satisfy human needs, improve human resource management, and build positive interpersonal and group dynamicsThe Political Frame: how to cope with power and conflict, build coalitions, hone political skills, and deal with internal and external politicsThe Symbolic Frame: how to shape a culture that gives purpose and meaning to work, stage organizational drama for internal and external audiences, and build team spirit through ritual, ceremony, and story",
        "Category": " Business & Economics , Organizational Behavior",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "The Debt Collector",
        "Authors": "By Hightower, Lynn S.",
        "Description": "On a warm March evening in Cincinnati, detective Sonora Blair says good-bye to her two teenage children, drives to a neat suburban neighborhood, and walks through the door of a \"home invasion\"--a shocking mass murder scene. Thus begins Lynn Hightower's latest novel, a masterpiece of suspense that combines meticulous procedural detail with page-turning storytelling. From its opening scene to its stunning climax, The Debt Collector is at once chilling, thought-provoking, and utterly impossible to put down.\"No survivors,\" Sonora Blair said to herself when she and her partner, Sam, arrived at the crime scene. A typical American family lived here. In the driveway, a car is left behind in a hurry, its door open, its battery nearly dead. Before she followed Sam inside, Sonora knew what was waiting. She just didn't know how bad it would look, how bizarre the evidence would be, and how powerfully a dying woman's last words would echo in her mind: \"The Angel.\"Within hours Sonora had gotten over the shock. She'd gone home, checked on her kids, and washed the blood off her nice white blouse. Before long she'd be setting off to find a killer--or maybe two. That's when the case takes a sudden, strange turn. A retired cop, legendary to those who worked with him, practically hands Sonora the suspects on a plate: their names, histories, even where they can be found. But among her fellow cops Sonora alone believes there is something more to this case. A third man. Or an angel...In The Debt Collector, Lynn Hightower chillingly captures the collision of a horrific crime with the ordinary lives of its victims. But another life is at stake here. The life of a woman who can't mother her children the way she wishes she could, who misses people she once loved, and who even longs quietly for another chance at romance. And while one family has been wiped out by savage killers, the life of this good cop is at risk now. Because as Sonora moves further and further down a trail full of shocking surprises, bitter revelations, and unpaid debts, she now knows one thing for sure: how close she is getting to the edge.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Ultimate Christmas: The Best Experts' Advice for a Memorable Season with Stories and Photos of Holiday Magic",
        "Authors": "By Bice, Jeanne",
        "Description": "Create a Magical Holiday Season for You and Yours . . . You know the moment when it feels like Christmas—when you make your annual pilgrimage to the tree lot and the 'blue spruce or pine' debate commences, when you share favorite memories over a second helping of your mother's stuffing, or when you feel the tug in your throat during the holiday pageant.Now you can revel in the true meaning and spirit of the season with Ultimate Christmas, an entertaining, touching, and uplifting collection of true stories and awe-inspiring photographs of holiday magic (and a little mania!). From the kindness and generosity of strangers to the turkey that got away, from the innocence and pure joy of a child to the tree that really was too tall to fit, this Yuletide treasury will make you laugh and cry, and help you celebrate everything that is delightful—and perhaps slightly dysfunctional—about the holidays. And, if you're searching for some holiday inspiration, fashion and decorating guru Jeanne Bice, the founder of The Quacker Factory, shares must-know info for making things merry, including eco-friendly ways to deck the halls, a simple, sensational open house menu, homemade crafts, and etiquette rules for regifting, holiday 'brag' letters, and the dreaded fruitcake.This is the ultimate Christmas volume you'll want to bring out year after year to help create lasting memories and savor the warmth of the season.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "HCI",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Whatever It Takes: Geoffrey Canada's Quest to Change Harlem and America",
        "Authors": "By Tough, Paul",
        "Description": "What would it take?That was the question that Geoffrey Canada found himself asking. What would it take to change the lives of poor childrennot one by one, through heroic interventions and occasional miracles, but in big numbers, and in a way that could be replicated nationwide? The question led him to create the Harlem Children’s Zone, a ninety-seven-block laboratory in central Harlem where he is testing new and sometimes controversial ideas about poverty in America. His conclusion: if you want poor kids to be able to compete with their middle-class peers, you need to change everything in their livestheir schools, their neighborhoods, even the child-rearing practices of their parents.Whatever It Takes is a tour de force of reporting, an inspired portrait not only of Geoffrey Canada but also of the parents and children in Harlem who are struggling to better their lives, often against great odds. Carefully researched and deeply affecting, this is a dispatch from inside the most daring and potentially transformative social experiment of our time.",
        "Category": " Social Science , Ethnic Studies , African American Studies",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Nolo's Essential Guide to Divorce",
        "Authors": "By Doskow, Emily",
        "Description": "The divorce process is often confusing, difficult and expensive, with the average contested divorce costing up to $70,000 in attorney fees. But now people can turn to Nolo's Essential Guide to Divorce for clear answers that can help make divorce as simple and inexpensive as humanly possible. With compassion and understanding, Nolo's Essential Guide to Divorce will help readers: • understand the divorce process • work with mediators or lawyers • avoid expensive and painful court battles • figure out alimony • establish child custody and visitation • determine child support • divide money and property fairly • draft a marital settlement agreement • deal with divorce emergencies • address post-divorce issues The 2nd edition of this 50-state book is completely updated to provide the latest laws and resources. The book now covers divorce and the military and expanded information on custody schedules and parenting plans.",
        "Category": " Law , Family Law , Divorce & Separation",
        "Publisher": "Nolo",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The drama of democracy: American government and politics",
        "Authors": "By McKenna, George",
        "Description": "",
        "Category": "",
        "Publisher": "The Dushkin Publishing Group",
        "Price Starting With ($)": "7.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Turning Points in Physics (Series of Lectures at Oxford University in Trinity Term), pb, 1961",
        "Authors": "By Blin-Stoyle",
        "Description": "",
        "Category": "",
        "Publisher": "New York: Harper & Row 1961. (Torchbooks)",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Teaching Styles & Strategies (Unity in Diversity Series, Manual No. 2)",
        "Authors": "By Harvey Silver, J. Robert Hanson, Richard W. Strong, Patricia B. Schwartz",
        "Description": "",
        "Category": "",
        "Publisher": "Silver Strong & Associates",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1900"
        }
    },
    {
        "Title": "Russell the Sheep",
        "Authors": "By Scotton, Rob",
        "Description": "This is Russell.Sometimes Russell is just a little bit out of step with the rest of the flock.All the sheep are falling asleep -- except Russell.What's a sheep to do?Russell tries everything ... until, at last, he falls asleep.",
        "Category": " Juvenile Fiction , Bedtime & Dreams",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "The Overachievers: The Secret Lives of Driven Kids",
        "Authors": "By Robbins, Alexandra",
        "Description": "The bestselling author of Pledged returns with a groundbreaking look at the pressure to achieve faced by America's teens In Pledged, Alexandra Robbins followed four college girls to produce a riveting narrative that read like fiction. Now, in The Overachievers, Robbins uses the same captivating style to explore how our high-stakes educational culture has spiraled out of control. During the year of her ten-year reunion, Robbins goes back to her high school, where she follows heart-tuggingly likeable students including \"AP\" Frank, who grapples with horrifying parental pressure to succeed; Audrey, whose panicked perfectionism overshadows her life; Sam, who worries his years of overachieving will be wasted if he doesn't attend a name-brand college; Taylor, whose ambition threatens her popular girl status; and The Stealth Overachiever, a mystery junior who flies under the radar. Robbins tackles teen issues such as intense stress, the student and teacher cheating epidemic, sports rage, parental guilt, the black market for study drugs, and a college admissions process so cutthroat that students are driven to suicide and depression because of a B. With a compelling mix of fast-paced narrative and fascinating investigative journalism, The Overachievers aims both to calm the admissions frenzy and to expose its escalating dangers.",
        "Category": " Social Science , Anthropology , Cultural & Social",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Verdi: A Life in the Theatre",
        "Authors": "By Osborne, Charles",
        "Description": "Includes letters written by Verdi and his acquaintances that illuminate the personal side of the innkeeper's son turned successful composer",
        "Category": " Music , General",
        "Publisher": "Fromm Intl",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "The Price of Privilege: How Parental Pressure and Material Advantage Are Creating a Generation of Disconnected and Unhappy Kids",
        "Authors": "By Levine, Madeline",
        "Description": "In this ground-breaking book on the children of affluence, a well-known clinical psychologist exposes the epidemic of emotional problems that are disabling America’s privileged youth, thanks, in large part, to normalized, intrusive parenting that stunts the crucial development of the self.In recent years, numerous studies have shown that bright, charming, seemingly confident and socially skilled teenagers from affluent, loving families are experiencing epidemic rates of depression, substance abuse, and anxiety disorders&#8212;rates higher than in any other socioeconomic group of American adolescents. Materialism, pressure to achieve, perfectionism, and disconnection are combining to create a perfect storm that is devastating children of privilege and their parents alike.In this eye-opening, provocative, and essential book, clinical psychologist Madeline Levine explodes one child-rearing myth after another. With empathy and candor, she identifies toxic cultural influences and well-intentioned, but misguided, parenting practices that are detrimental to a child's healthy self-development. Her thoughtful, practical advice provides solutions that will enable parents to help their emotionally troubled \"star\" child cultivate an authentic sense of self.",
        "Category": " Psychology , Developmental , Adolescent",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "My Very First Snow White and the Seven Dwarfs Storybook",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Playmore, Inc., Waldman Publishing, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Jasper's Beanstalk",
        "Authors": "By Nick Butterworth, Mick Inkpen",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Alaska's Three Bears (PAWS IV)",
        "Authors": "By Gill, Shelley and Cartwright, Shannon (ILT)",
        "Description": "One of the most beloved Alaskan children's picture books of all time, Alaska' Three Bears is a classic retelling of the three bears fairy tale, Alaska-style. Readers young and old will meet Alaska's three bears in this one-of-a-kind adventure. Join the polar, grizzly, and black bears as they travel across Alaska's vast wilderness. Author Shelley Gill and illustrator Shannon Cartwright bring young readers the real story of the three bears, filled with facts on America's best-loved bruins. Perfect story time reading plus nonfiction facts about bears for children ages 3 and up.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Little Bigfoot",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Kipper",
        "Authors": "By Inkpen, Mick",
        "Description": "Tired of his smelly and disgusting blanket and old and worn basket, Kipper the dog searches among the animals outside for a new place to sleep. Original. TV tie-in. 50,000 first printing.",
        "Category": " Juvenile Fiction , Bedtime & Dreams",
        "Publisher": "Red Wagon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "The Johns Hopkins Complete Home Encyclopedia of Drugs",
        "Authors": "By Margolis, Simeon (EDT)",
        "Description": "",
        "Category": " Medical , Pharmacology",
        "Publisher": "Rebus, Inc.",
        "Price Starting With ($)": "8.93",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "When I Was Little: A Four-Year-Old's Memoir of Her Youth",
        "Authors": "By Curtis, Jamie Lee and Cornell, Laura (ILT)",
        "Description": "“Exuberant—a winsome, upbeat work.” —Publishers WeeklyJamie Lee Curtis and Laura Cornell perfectly capture a little girl's simple, joyous celebration of herself, as she looks back on her childhood from the lofty height of four and a half years.This spirited view of growing up is perfect to share at home or in a classroom, as kids will respond to the exuberant pleasures of growing freedom and independence.\"When I was little, I could hardly do anything. But now I can do lots of things, like braid my own hair and go to nursery school. I'm not a baby anymore. I'm me!\"",
        "Category": " Juvenile Fiction , Family , Siblings",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Sandcastle (Little Kippers)",
        "Authors": "By Inkpen, Mick",
        "Description": "While playing on the beach, Kipper the dog finds the finishing touches to his sandcastle in an unlikely place, in a picture book based on an episode of the new Kipper television show on Nickelodeon. Original. TV tie-in. 75,000 first printing.",
        "Category": " Juvenile Fiction , Animals , Horses",
        "Publisher": "Red Wagon Books",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "The Secret Between Us",
        "Authors": "By Delinsky, Barbara",
        "Description": "Nothing will break this mother-daughter bond. Not even the truth.Deborah Monroe and her daughter, Grace, are driving home from a party when their car hits a man running in the dark. Grace was at the wheel, but Deborah sends her home before the police arrive, determined to shoulder the blame for the accident. Her decision then turns into a deception that takes on a life of its own and threatens the special bond between mother and daughter. The Secret Between Us is an unforgettable story about making bad choices for the right reasons and the terrible consequences of a lie gone wrong. Once again, Barbara Delinksy has delivered a riveting study of family and a superbly crafted novel, perfectly targeted to reading groups and fans of provocative fiction.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "New Mexico Handbook Edition Nb (Moon Handbooks New Mexico)",
        "Authors": "By Metzger, Stephen",
        "Description": "",
        "Category": "",
        "Publisher": "moon travel handbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "You Read to Me, I'll Read to You",
        "Authors": "By Ciardi, John",
        "Description": "‘Thirty-five imaginative and humorous poems for an adult and a child to read aloud together. . . . The entertaining verses are varied as to length, rhythm, and subject and are illustrated with harmoniously amusing drawings.’ —BL.",
        "Category": " Juvenile Nonfiction , Poetry , Humorous",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Crafty Ideas from Nature",
        "Authors": "By Daitz, Myrna, Chapman, Gillian (ILT), and Williams, Shirley",
        "Description": "",
        "Category": " Juvenile Nonfiction , Crafts & Hobbies",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "AIR, LIGHT AND WATER (Tell Me About)",
        "Authors": "By Forsey, Chris (ILT) and Wilkins, Mary-Jane",
        "Description": "Questions and answers introduce air, light, and water and the scientific principles involving them.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Creepy Creatures (Eyes on nature)",
        "Authors": "By Jane Resnick",
        "Description": "",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Kidsbooks",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Worl War II Remembered 1943: Turning The Tide",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "United States Postal Service",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Eye of the Beholder",
        "Authors": "By Krentz, Jayne Ann",
        "Description": "Jayne Ann Krentz has crafted \"romantic suspense of the highest order\" (Amazon.com) in twenty-two New York Times bestsellers, including her recent blockbuster, Flash. Now, she unearths secrets at a New Age resort, where a hard-edged businessman and a beautiful art expert make a tantalizing mind-body connection -- and where a killer threatens their piece of paradise.  Alexa Chambers has a flair for style, an eye for art -- and a reputation in tatters. An expert in Art Deco, she blew the whistle on an employer who was selling fakes to wealthy clients. Her payoff? No job and no prospects. Now she runs a shop in her hometown of Avalon, Arizona -- a hot spot for crystal devotees and sunset gazers. But gutsy, energetic Alexa has no intention of sitting still. She's ready to take risks to rebuild her career...and she secretly consults on an exquisite deco collection being installed at the new Avalon Resorts. Her scheme might just work -- if she can steer clear of the resort's owner, the enigmatic and possibly dangerous J. L. Trask.  Alexa was a scared teenager the last time she saw Trask, the man who accused her stepfather of murder. Insisting his dad's fatal car crash had been no accident, Trask vowed one day he'd come back to Avalon for revenge. Now, twelve years later, their meeting is inevitable. Their attraction is immediate. And their chances of bliss are infinitesimal.  Trask wants to piece together the past with Alexa's help -- and get closer to this dazzling deco diva. Alexa wants to protect her family -- and figure out Trask's real motivations. But when a killer emerges from the shadows, they have no choice but to team up to solve a deadly crime from long ago. As they trade sizzling sparks and snappy repartee loaded with sensual suggestion, their trail leads to a trendy spa called the Dimensions Institute, whose flaky denizens and strange atmosphere suggest there is more hidden there than meets the eye. They don't need a crystal ball to see that their survival -- and relationship -- depends on more than tantric breathing or a heavenly passion. They need a little help from a higher power: a true and trustworthy love.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Wrong Hostage: A Novel",
        "Authors": "By Lowell, Elizabeth",
        "Description": "The latest masterwork from one of the leading writers of suspense . . . New York Times bestselling author Elizabeth Lowell returns with a chilling tale of the law gone wrong and a kidnapping that threatens more than one life.The Wrong HostageOrphaned at thirteen, Grace Silva clawed her way out of poverty and violence to become one of the most respected judges on the federal bench. Grace believes in the rule of law -- lives it, breathes it. She has always been buttoned up and buttoned down.Except once. Joe Faroe has learned that laws are made by politicians, and politicians are all too human. He believes in the innocents, the ones getting ground up by governments that are too polarized or too corrupt to protect their own citizens. He's been through the political meat grinder himself. It cost him his career, his freedom, and the woman who still haunts him. Since then Faroe has worked outside the rules and politics of government as a kidnap specialist for St. Kilda Consulting, a Manhattan-based global business that concentrates on the shadow world where governments can't go. He is good at his work -- intelligent, confident, ruthless. Until a friend dies trying to kill him. Now Faroe is out of the business. Retired. He's through trying to save a world that doesn't want to be saved. Then Grace comes to him, past and present collide, and Faroe finds himself sucked back into the shadows, tracking a violent killer who holds the life of Grace's son in his bloody hands.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Miles of Smiles: 101 Great Car Games & Activities",
        "Authors": "By Meyers, Carole Terwilliger",
        "Description": "A collection of 101 games and activities for children and adults to share while traveling.",
        "Category": " Travel , Special Interest , Family",
        "Publisher": "Carousel Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2016"
        }
    }
]