[
    {
        "Title": "The Mystery of the Cupboard",
        "Authors": "By Banks, Lynne Reid and Newsom, Tom (ILT)",
        "Description": "In the fourth book in Bank's acclaimed INDIAN IN THE CUPBOARD saga, Omri and his family move to an old farmhouse, where he finds an ancient notebook that reveals a family secret-and the mysterious origins of his magical cupboard.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The Lives of the Saints for Boys (Catholic Classics (Paperback))",
        "Authors": "By Savary, Louis M.",
        "Description": "",
        "Category": "",
        "Publisher": "Regina Press Malhame & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Stormy, Misty's Foal",
        "Authors": "By Henry, Marguerite and Dennis, Wesley (ILT)",
        "Description": "A raging storm slashes across Assateague and Chincoteague islands. Water is everywhere! The wildponies and the people must battle for their lives.  In the midst of the storm, Misty-the famous mare of Chincoteague-is about to give birth. Paul and Maureen are franticwith worry as the storm rages on... will Misty and her colt survive?  This is the thrilling story of the hurricane that destroyed the wild herds of Assateague, and howstrength and love helped rebuild them.",
        "Category": " Juvenile Fiction , Animals , Horses",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "The One Year Bible NIV",
        "Authors": "By Tyndale House Publishers (COR)",
        "Description": "The best-selling One Year Bible, which helps you read the entire Bible in as little as 15 minutes a day, has been updated in a new look and comes in both portable compact size and full size.The One Year Bible divides God's Word into daily readings from the Old Testament, New Testament, Psalms, and Proverbs, creating an achievable, unforgettable devotional experience.",
        "Category": " Bibles , New International Version , General",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "The Useful Proverbs",
        "Authors": "By Kathy Collard Miller",
        "Description": "",
        "Category": "",
        "Publisher": "World Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Under the Influence: A Guide to the Myths and Realities of Alcoholism",
        "Authors": "By Milam, James Robert",
        "Description": "Ten of millions Americans suffer from alcoholism, yet most people still wrongly believe that alcoholism is a psychological or moral problem, and that it can be cured by psychotherapy or sheer will power. Based on groundbreaking scientific research, Under The Influence examine the physical factors that set alcoholics and non-alcoholics apart, and suggests a bold, stigma-free way of understanding and treating the alcoholic.How to tell if someone you know is an alcoholic.The progressive stages of alcoholism.How to get an alcoholic into treatment—and how to choose a treatment program.Why frequently prescribed drugs can be dangerous—even fatal—for alcoholics.How to ensure a lasting recovery.Praise for Under the Influence\"The most important breakthrough in alcoholism since the founding of Alcoholics Anonymous in 1935.\"—Ron Fagan, founder & director, Ceder Hills Alcoholism Treatment Center\"A landmark . . . A must for anyone concerned about drinking.\"—Alcoholism, Journal of the American Medical Society on Alcoholism and the Research Society on Alcoholism\"Vital, simple, world-changing information.\"—Co-Evolution Quarterly \"Under The Influence will advance by light years the understanding of alcoholism and the recovery process.\"—Mel Schulstad, Cofounder, National Association of Alcoholism Counselors",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1984"
        }
    },
    {
        "Title": "The Universe in a Nutshell",
        "Authors": "By Hawking, Stephen W.",
        "Description": "Stephen Hawking’s phenomenal, multimillion-copy bestseller, A Brief History of Time, introduced the ideas of this brilliant theoretical physicist to readers all over the world. Now, in a major publishing event, Hawking returns with a lavishly illustrated sequel that unravels the mysteries of the major breakthroughs that have occurred in the years since the release of his acclaimed first book.The Universe in a Nutshell• Quantum mechanics• M-theory• General relativity• 11-dimensional supergravity• 10-dimensional membranes• Superstrings• P-branes• Black holesOne of the most influential thinkers of our time, Stephen Hawking is an intellectual icon, known not only for the adventurousness of his ideas but for the clarity and wit with which he expresses them. In this new book Hawking takes us to the cutting edge of theoretical physics, where truth is often stranger than fiction, to explain in laymen’s terms the principles that control our universe.Like many in the community of theoretical physicists, Professor Hawking is seeking to uncover the grail of science — the elusive Theory of Everything that lies at the heart of the cosmos. In his accessible and often playful style, he guides us on his search to uncover the secrets of the universe — from supergravity to supersymmetry, from quantum theory to M-theory, from holography to duality. He takes us to the wild frontiers of science, where superstring theory and p-branes may hold the final clue to the puzzle. And he lets us behind the scenes of one of his most exciting intellectual adventures as he seeks “to combine Einstein’s General Theory of Relativity and Richard Feynman’s idea of multiple histories into one complete unified theory that will describe everything that happens in the universe.”With characteristic exuberance, Professor Hawking invites us to be fellow travelers on this extraordinary voyage through space-time. Copious four-color illustrations help clarify this journey into a surreal wonderland where particles, sheets, and strings move in eleven dimensions; where black holes evaporate and disappear, taking their secret with them; and where the original cosmic seed from which our own universe sprang was a tiny nut.The Universe in a Nutshell is essential reading for all of us who want to understand the universe in which we live. Like its companion volume, A Brief History of Time, it conveys the excitement felt within the scientific community as the secrets of the cosmos reveal themselves.",
        "Category": " Science , Physics , Quantum Theory",
        "Publisher": "Bantam",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "The Bible Almanac: A Comprehensive Handbook of the People of the Bible and How They Lived",
        "Authors": "By Packer, James I. (EDT), Tenney, Merrill C. (EDT), and White, William (EDT)",
        "Description": "The environment, religions, cultures, agriculture, trade, transportation, warfare, government, family relationships, clothing, architecture, and music of the peoples living in the Middle East during Biblical times are described",
        "Category": " Religion , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "March",
            "Year": "1980"
        }
    },
    {
        "Title": "Postcards from Heaven",
        "Authors": "By Cloninger, Claire",
        "Description": "",
        "Category": "",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Brainfood",
        "Authors": "By Morgan, Brian L. G. and Morgan, Roberta",
        "Description": "Discusses insomnia, depression, lethargy, stress, hyperactivity, memory loss, eating disorders, and premenstrual syndrome, and explains the nutritional needs of the human brain",
        "Category": " Health & Fitness , General",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Baseball Hall of Shame 3",
        "Authors": "By Nash, Bruce and Zullo, Allan",
        "Description": "",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Outdoor Structures",
        "Authors": "By Time-Life Books",
        "Description": "Home improvement projects such as fencing, wall-building and frame construction for outdoor living structures are presented with illustrated diagrams and instructions",
        "Category": " House & Home , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "August",
            "Year": "1978"
        }
    },
    {
        "Title": "Walls and Ceilings (Home Repair and Improvement)",
        "Authors": "By Time-Life Books",
        "Description": "Decorating ideas both traditional and modern enhance a guide to finishing and resurfacing walls and ceilings with a variety of materials including tiles, wallboard, brick veneer, wood paneling, and beams",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "July",
            "Year": "1980"
        }
    },
    {
        "Title": "The World of Placido Domingo",
        "Authors": "By Snowman, Daniel",
        "Description": "The animal performers in a circus have many adventures",
        "Category": " Music , General",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Taking Charge of ADHD: The Complete Authoritative Guide for Parents",
        "Authors": "By Barkley, Russell A.",
        "Description": "Raising a child with attention-deficit/hyperactivity disorder is not easy. Bombarded with conflicting medical advice and worn down by the daily frustrations of child care, parents are likely to feel exhaused, confused, and helpless. This much-needed, authoritative book empowers parents of children with ADHD with the knowledge and the confidence they need to ensure their child receives the best care possible. Features include step-by-step methods for managing a child with ADHD in a variety of everyday situations; the latest information on available medications; numerous techniques for enhancing a child's school performance; and a special section devoted to the needs of the parents.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "The Guilford Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Compassionate Visitor: Resources for Ministering to People Who Are Ill",
        "Authors": "By Becker, Arthur H.",
        "Description": "",
        "Category": " Religion , Christian Ministry , Pastoral Resources",
        "Publisher": "Fortress Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "M. Butterfly: With an Afterword by the Playwright",
        "Authors": "By Hwang, David Henry",
        "Description": "Winner of the Tony Award for Best Play, nominated for the Pulitzer Prize for Drama, and soon to be back on Broadway in a revival directed by the Lion King's Julie Taymor, starring Clive Owen\"A brilliant play of ideas… a visionary work that bridges the history and culture of two worlds.\"—Frank Rich, New York TimesBased on a true story that stunned the world, and inspired by Giacomo Puccini's opera Madama Butterfly, M. Butterfly was an immediate sensation when it premiered in 1988. It opens in the cramped prison cell where diplomat Rene Gallimard is being held captive by the French government—and by his own illusions. He recalls a time when Song Liling, the beautiful Chinese diva, touched him with a love as vivid, as seductive—and as elusive—as a butterfly.How could he have known that his true love was, in fact, a spy for the Chinese government—and a man disguised as a woman? The diplomat relives the twenty-year affair from the temptation to the seduction, from its consummation to the scandal that ultimately consumed them both.M. Butterfly is one of the most compelling, explosive, and slyly humorous dramas ever to light the Broadway stage, a work of unrivaled brilliance, illuminating the conflict between men and women, the differences between East and West, racial stereotypes—and the shadows we cast around our most cherished illusions.The original cast included John Lithgow as Gallimard and BD Wong as Song Liling. During the show's 777-performance run, David Dukes, Anthony Hopkins, Tony Randall, and John Rubinstein were also cast as Gallimard. Hwang adapted the play for a 1993 film directed by David Cronenberg, starring Jeremy Irons and John Lone.TEXT OF THE ORIGINAL BROADWAY PRODUCTION",
        "Category": " Drama , American , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "The Complete Greek Tragedies: Sophocles I",
        "Authors": "By Grene, David, Sophocles, and Lattimore, Richard (EDT)",
        "Description": "\"These authoritative translations consign all other complete collections to the wastebasket.\"--Robert Brustein, The New Republic\"This is it. No qualifications. Go out and buy it everybody.\"--Kenneth Rexroth, The Nation\"The translations deliberately avoid the highly wrought and affectedly poetic; their idiom is contemporary....They have life and speed and suppleness of phrase.\"--Times Education Supplement\"These translations belong to our time. A keen poetic sensibility repeatedly quickens them; and without this inner fire the most academically flawless rendering is dead.\"--Warren D. Anderson, American Oxonian\"The critical commentaries and the versions themselves...are fresh, unpretentious, above all, functional.\"--Commonweal\"Grene is one of the great translators.\"--Conor Cruise O'Brien, London Sunday Times\"Richmond Lattimore is that rara avis in our age, the classical scholar who is at the same time an accomplished poet.\"--Dudley Fitts, New York Times Book Review",
        "Category": " Poetry , Ancient & Classical",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Becoming a Father: How to Nurture and Enjoy Your Family (Growing Family)",
        "Authors": "By Sears, William",
        "Description": "",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "La Leche League International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Oneness and Separateness: From Infant to Individual",
        "Authors": "By Kaplan, Louise J.",
        "Description": "Provides insight into the process by which an infant is separated from oneness with its mother, revealing the impact of this separation on human behavior throughout life",
        "Category": "",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "How to Say It: Choice Words, Phrases, Sentences & Paragraphs for Every Situation",
        "Authors": "By Maggio, Rosalie",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Making the \"Terrible\" Twos Terrific (Volume 4)",
        "Authors": "By Rosemond, John",
        "Description": "A child psychologist emphasizes the importance of understanding--understanding a parent's task and a child's breakthrough--during a difficult time in childhood development. By the author of Parent Power! Original.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "How to Play Piano",
        "Authors": "By Evans, Roger",
        "Description": "Illustrated with charts and diagrams throughout, this guide teaches the fundamentals of piano--from buying a piano and understanding its mechanisms to reading music and playing chords",
        "Category": " Music , Musical Instruments , Piano & Keyboard",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1981"
        }
    },
    {
        "Title": "The Simon & Schuster Listener's Guide to Opera (The Simon and Schuster listener's guides)",
        "Authors": "By Rich, Alan",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1980"
        }
    },
    {
        "Title": "Golf rules in pictures",
        "Authors": "By United States Golf Association",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Junie B. Jones and a Little Monkey Business (Junie B. Jones, No. 2)",
        "Authors": "By Brunkus, Denise (ILT) and Park, Barbara",
        "Description": "Barbara Park’s New York Times bestselling chapter book series, Junie B. Jones, is a classroom favorite and has been keeping kids laughing—and reading—for more than twenty years. Over 60 million copies in print and now with a bright new look for a new generation!   Meet the World’s Funniest Kindergartner—Junie B. Jones! In the second Junie B. Jones book, it’s pooey on B-A-B-I-E-S until Junie B. finds out that her new dumb old baby brother is a big fat deal. Her two bestest friends are giving her everything they own just to see him. And guess what else? Maybe she can bring him to school on Pet Day.   USA Today:“Junie B. is the darling of the young-reader set.”   Publishers Weekly: “Park convinces beginning readers that Junie B.—and reading—are lots of fun.”    Kirkus Reviews: “Junie’s swarms of young fans will continue to delight in her unique take on the world. . . . A hilarious, first-rate read-aloud.”    Time: “Junie B. Jones is a feisty six-year-old with an endearing penchant for honesty.”",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "The Falcon and the Flower (Medieval Plantagenet Trilogy)",
        "Authors": "By Henley, Virginia",
        "Description": "Astride her white palfrey, surrounded by a nimbus of silver-blond hair, Jasmine was a vision to strike a man mute with desire.  But the violet-eyed love child of King Richard's half brother had vowed that no man would ever rule her heart.  Until she saw the face of the Devil himself in her crystal ball--the dark, brooding knight who would kill to make her his own.  She would risk a dissolute court and a maddened, lustful king to keep destiny at bay, anything to keep her from the hypnotic eyes and burning caresses of...The Falcon.A wickedly handsome warrior who lived by blood and the sword, Falcon de Burgh wanted to wed no woman--until he laid eyes on the exquisite Jasmine, and he vowed to possess her, to teach her all the wondrous ways a man could love a woman, no matter what it might take to conquer her fiery, unyielding heart. Falcon knew only blind, reckless passion as he swore to tame, at the risk of his life...The Flower.",
        "Category": "",
        "Publisher": "DELL",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Escape Not My Love",
        "Authors": "By Coffman, Elaine",
        "Description": "A woman who does as she pleased, heedless of any man's will, Jennifer Baxter runs into dangerous territory south of the border, sending U.S. Deputy Marshall Jay Culhane, an arrogant man who learns to be humbled, after her. Reprint.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Ivy Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "When Things Start to Think",
        "Authors": "By Gershenfeld, Neil",
        "Description": "This is a book for people who want to know what the future is going to look like and for people who want to know how to create the future. Gershenfeld offers a glimpse at the brave new post-computerized world, where microchips work for us instead of against us. He argues that we waste the potential of the microchip when we confine it to a box on our desk: the real electronic revolution will come when computers have all but disappeared into the walls around us. Imagine a digital book that looks like a traditional book printed on paper and is pleasant to read in bed but has all the mutability of a screen display. How about a personal fabricator that can organize digitized atoms into anything you want, or a musical keyboard that can be woven into a denim jacket? Gershenfeld tells the story of his Things that Think group at MIT's Media Lab, the group of innovative scientists and researchers dedicated to integrating digital technology into the fabric of our lives.",
        "Category": " Technology & Engineering , Electronics , Digital",
        "Publisher": "Henry Holt and Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Act of Treason (9) (A Mitch Rapp Novel)",
        "Authors": "By Flynn, Vince",
        "Description": "#1 New York Times bestselling author of American Assassin—now a major motion picture  The fallout from a horrific Washington explosion has just begun—and so has CIA superagent Mitch Rapp’s hunt for a killer with a personal agenda—in this explosive thriller from #1 New York Times bestselling author Vince Flynn.In the final weeks of a fierce presidential campaign, a motorcade carrying candidate Josh Alexander is shattered by a car bomb. Soon after the attack, Alexander is carried to victory by a sympathy vote, but his assailants have not been found. When CIA director Irene Kennedy and Special Agent Skip McMahon receive damaging intelligence on Washington’s most powerful players, they call on Mitch Rapp—the one man reckless enough to unravel a global network of contract killers on an explosive mission that leads back to the heart of our nation’s capital…and the inner sanctum of the Oval Office.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Crescent City: A Novel",
        "Authors": "By Plain, Belva",
        "Description": "“Well written, fascinating, rich in plot and characters . . . presents [not only an interesting story, but] a portrait of the Jewish community in the 19th-century South.”—Newark Sunday Star-LedgerShe was the exquisite daughter of a wealthy  Jewish merchant. From a charmed girlhood in opulent New  Orleans, she would be swept into the cataclysm of  the Civil War. Forced to choose between her duties  as a Southern wife and mother and her love for a  forbidden man, a forbidden cause, Miriam Raphael is at the center of the whirlwind in a spellbinding  novel of divided loyalties and divided hearts.“Seductive . . . moves along briskly through the kind of territory her avid readers most appreciate.”—Publishers Weekly “As a romance, Crescent City can’t miss!”—The New York Times Book Review",
        "Category": " Fiction , General",
        "Publisher": "DELL",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "The Personality Self-Portrait: Why You Think, Work, Love and Act the Way You Do",
        "Authors": "By Oldham, John M. and Morris, Lois B.",
        "Description": "Offers an in-depth questionnaire, a personality self-portrait chart, profiles of each type, exercises for change, and clues to recognizing a personality disorder",
        "Category": " Self-help , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Everything Bad Is Good for You: How Today's Popular Culture Is Actually Making Us Smarter",
        "Authors": "By Johnson, Steven",
        "Description": "From the author of the New York Times bestseller Mind Wide Open comes a groundbreaking assessment of popular culture as it's never been considered before: through the lens of intelligence.  The $10 billion video gaming industry is now the second-largest segment of the entertainment industry in the United States, outstripping film and far surpassing books. Reality television shows featuring silicone-stuffed CEO wannabes and bug-eating adrenaline junkies dominate the ratings. But prominent social and cultural critic Steven Johnson argues that our popular culture has never been smarter.  Drawing from fields as diverse as neuroscience, economics, and literary theory, Johnson argues that the junk culture we're so eager to dismiss is in fact making us more intelligent. A video game will never be a book, Johnson acknowledges, nor should it aspire to be-and, in fact, video games, from Tetris to The Sims to Grand Theft Auto, have been shown to raise IQ scores and develop cognitive abilities that can't be learned from books. Likewise, successful television, when examined closely and taken seriously, reveals surprising narrative sophistication and intellectual demands.  Startling, provocative, and endlessly engaging, Everything Bad Is Good for You is a hopeful and spirited account of contemporary culture. Elegantly and convincingly, Johnson demonstrates that our culture is not declining but changing-in exciting and stimulating ways we'd do well to understand. You will never regard the glow of the video game or television screen the same way again.",
        "Category": " Psychology , General",
        "Publisher": "Riverhead Hardcover",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Promise Me Tomorrow (Mira)",
        "Authors": "By Camp, Candace",
        "Description": "Promise Me Tomorrow by Candace Camp released on Jul 25, 2000 is available now for purchase.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Touching the Void: The True Story of One Man's Miraculous Survival",
        "Authors": "By Simpson, Joe",
        "Description": "Joe Simpson and his climbing partner, Simon Yates, had just reached the top of a 21,000-foot peak in the Andes when disaster struck. Simpson plunged off the vertical face of an ice ledge, breaking his leg. In the hours that followed, darkness fell and a blizzard raged as Yates tried to lower his friend to safety. Finally, Yates was forced to cut the rope, moments before he would have been pulled to his own death.The next three days were an impossibly grueling ordeal for both men. Yates, certain that Simpson was dead, returned to base camp consumed with grief and guilt over abandoning him. Miraculously, Simpson had survived the fall, but crippled, starving, and severely frostbitten was trapped in a deep crevasse. Summoning vast reserves of physical and spiritual strength, Simpson crawled over the cliffs and canyons of the Andes, reaching base camp hours before Yates had planned to leave.How both men overcame the torments of those harrowing days is an epic tale of fear, suffering, and survival, and a poignant testament to unshakable courage and friendship.",
        "Category": " Travel , Special Interest , Adventure",
        "Publisher": "Perennial",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Political Science Research Methods",
        "Authors": "By Johnson, Janet Buttolph and Joslyn, Richard A.",
        "Description": "An introduction to the basic tools of political science research. Six case studies highlight important aspects of the research process, and illustrate how scholars employ research methods in their studies of politics. New material includes studies of Western media influence on print news in non-Western countries, and political control of federal bureaucracies. The volume concludes with a new research report from the international relations field and demonstrates, step-by-step, the ways in which the report follows the standard research process. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "CQ Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "North to the Night: A Spiritual Odyssey in the Arctic",
        "Authors": "By Oaks, Suzanne (EDT) and Simon, Alvah",
        "Description": "In June 1994 Alvah Simon and his wife, Diana, set off in their 36-foot sailboat to explore the hauntingly beautiful world of icebergs, tundra, and fjords lying high above the Arctic Circle. Four months later, unexpected events would trap Simon alone on his boat, frozen in ice 100 miles from the nearest settlement, with the long polar night stretching into darkness for months to come.With his world circumscribed by screaming blizzards and marauding polar bears and his only companion a kitten named Halifax, Simon withstands months of crushing loneliness, sudden blindness, and private demons. Trapped in a boat buried beneath the drifting snow, he struggles through the perpetual darkness toward a spiritual awakening and an understanding of the forces that conspired to bring him there. He emerges five months later a transformed man.Simon's powerful, triumphant story combines the suspense of Into Thin Air with a crystalline, lyrical prose to explore the hypnotic draw of one of earth's deepest and most dangerous wildernesses.",
        "Category": " Travel , Polar Regions",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Creating Motion Graphics with After Effects, Volume 1: The Essentials (2nd Edition, Version 5.5)",
        "Authors": "By Meyer, Trish and Meyer, Chris",
        "Description": "Demonstrates motion graphics and visual effects programming techniques, including basic animation and key framing, layers, masks, mattes, effects, renderings, and the integration of After Effects with Photoshop and Illustrator.",
        "Category": " Computers , Computer Graphics",
        "Publisher": "Cmp Books",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Beyond Belief to Convictions (Beyond Belief Campaign)",
        "Authors": "By McDowell, Josh and Hostetler, Bob",
        "Description": "Josh McDowell's Beyond Belief message is the foundation to launch a spiritual revolution among youth. This is a revolution to equip churches and families to raise up a generation of the cross—young people who have been transformed by Christ and the cross, who are empowered to live crossgrain to the culture and are committed to share Christ across all cultures. Sixteen stand-alone products make up an entire family of resources that churches need to launch a church-wide revolution. These products are directed to every age group from 5 to 105, and help equip church groups and families with the tools to lead their children and youth to become transformed, passionate followers of Christ. Already a best seller, this book lays the foundations for the CrossCulture Revolution. Every product within this family of resources finds its root here. Beyond Belief to Convictions offers a revolutionary blueprint to raise up a generation of transformed followers of Christ with deepened convictions who knows why they believe what they believe.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Provence",
        "Authors": "By Bonechi",
        "Description": "",
        "Category": "",
        "Publisher": "E P Dutton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "The Foundation Center's Guide to Proposal Writing (Foundation Center's Guide to Proposal Writing, 3rd ed)",
        "Authors": "By Geever, Jane C.",
        "Description": "The chairman of a development consulting firm and long-time fundraising expert provides thorough instructions on the basics and more esoteric aspects of writing proposals for nonprofits.  Includes some 40 recent interviews with the people who review proposals, along with sample proposals and pre-proposal research and planning tips. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Business & Economics , Business Writing",
        "Publisher": "Foundation Center",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Amazing Buildings",
        "Authors": "By Wilkinson, Philip and Donati, Paolo (ILT)",
        "Description": "Looks at twenty-one famous buildings, including the Palace of Minos, the Colosseum, the Alhambra, Chartres Cathedral, the Taj Mahal, Brighton Pavilion, the Houses of Parliament, the Paris Opera, and the Toronto SkyDome",
        "Category": " Technology & Engineering , Construction , General",
        "Publisher": "Dorling Kindersley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "One Man's Way",
        "Authors": "By Gordon, Arthur",
        "Description": "",
        "Category": "",
        "Publisher": "Foundation Publications",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Capricorn Rhyming",
        "Authors": "By Redfield, Bessie G.",
        "Description": "",
        "Category": " Reference , Dictionaries",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Fresh Power: Experiencing the Vast Resources of the Spirit of God",
        "Authors": "By Cymbala, Jim and Merrill, Dean",
        "Description": "Pastor Jim Cymbala of the Brooklyn Tabernacle Church has taught the people of his church about believing in God and his mighty power for their present-day lives and the mission of their church.  He continued that teaching nationally in his best-selling books, Fresh Wind, Fresh Fire and Fresh Faith, which told about the transforming power of God’s love to convert prostitutes, addicts, the homeless, black people, white people, professional people, and working people.  Now Cymbala continues to spread the word about the power of God’s Holy Spirit in the lives of people who seek Him.  Fresh faith is available to His church as God’s people desire the Holy Spirit’s constant infilling.  Cymbala’s newest book talks about what it really means to be Spirit filled, both as individuals and as the church.  The Book of Acts is the basis for his study as Cymbala delves into what it was like for Christians back in the first century—and what it can be like for them today.  The first century church believed in God’s Word, in the constant infilling of His Spirit, and in the clear and direct responses of obedience to the scripture which defined the norm for their daily and spiritual lives.  Cymbala shows that same life in Christ through the power of the Holy Spirit is available to us today for pastors, leaders, and lay people who are longing for revival.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Gettysburg (Landmark Books)",
        "Authors": "By Kantor, MacKinlay",
        "Description": "When troops entered Gettysburg, Pennsylvania, the South seemed to be winning the Civil War. But Gettysburg was a turning point. After three bloody days of fighting, the Union finally won the battle. Inspired by the valor of the many thousands of soldiers who died there, President Lincoln visited Gettysburg to give a brief but moving tribute. His Gettysburg Address is one of the most famous speeches in American history.",
        "Category": " Young Adult Nonfiction , History , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Space, Stars, Planets and Spacecraft (See & Explore Library)",
        "Authors": "By Becklake, Sue, Delf, Brian (ILT), and Corbella, Luciano (ILT)",
        "Description": "Discusses planets, the solar system, satellites, comets and meteors, black holes, and the life and death of stars",
        "Category": " Juvenile Nonfiction , Science & Nature , Astronomy",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "100 Great Operas And Their Stories: Act-By-Act Synopses",
        "Authors": "By Simon, Henry W.",
        "Description": "An invaluable guide for both casual opera fans and aficionados, 100 Great Operas is perhaps the most comprehensive and enjoyable volume of opera stories ever written.   From La Traviata to Aïda, from Carmen to Don Giovanni, here are the plots of the world’s best-loved operas, told in an engaging, picturesque, and readable manner. Written by noted opera authority Henry W. Simon, this distinctive reference book contains act-by-act descriptions of 100 operatic works ranging from the historic early seventeenth century masterpieces of Monteverdi to the modern classics of Gian-Carlo Menotti.   In addition to highlighting the most important aspects of each opera, the author discusses the main characters, the famous turnings of plot, and the most significant arias. Here, too, is a wealth of anecdotes concerning literary background, past performances and stars, and production problems of the great operas.",
        "Category": " Music , Genres & Styles , Opera",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "The Last Don",
        "Authors": "By Puzo, Mario",
        "Description": "The last don is Domenico Clericuzio, a ferocious old man who is determined to secure his family's future in an era of legalized gambling, motion picture investments, and the threat of government informers. The Don is close to achieving his vision when secrets buried in his family's past threaten to undermine his plan and spark a war between two blood cousins.Only a two-time Academy Award winner with an insider's knowledge of Hollywood could write such a sizzling and scathing portrait of the movie business and show how a film really gets made. Only a writer who has gambled in the private rooms of the best casinos could reveal the secrets of business in Las Vegas. And only a writer who understands the hearts of thieves could describe Mafia life with such sparkling authenticity.",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Curious George Rides a Bike",
        "Authors": "By Rey, H. A.",
        "Description": "George helps a little boy with his paper route and gets into all sorts of trouble.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1973"
        }
    },
    {
        "Title": "If You Made a Million",
        "Authors": "By Schwartz, David M. and Kellogg, Steven (ILT)",
        "Description": "If You Made a MillionHave you ever wanted to make a million dollars? Marvelosissimo the Mathematical Magician is ready, willing, and able to explain the nuts and bolts --  as well as the mystery and wonder -- of earning money, investing it, accruing dividends and interest, and watching savings grow. Hey, you never know!An ALA Notable Book A Horn Book Fanfare Selection A School Library Journal Best Book of the Year A Teachers' Choices Selection",
        "Category": " Juvenile Fiction , Concepts , Counting & Numbers",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Dazzling Division: Games and Activities That Make Math Easy and Fun",
        "Authors": "By Long, Lynette",
        "Description": "Don't Just Learn Division . Master It! Brimming with fun and educational games and activities, the Magical Math series provides everything you need to know to become a master of mathematics! In each of these books, Lynette Long uses her own unique style to help you truly understand mathematical concepts as you play with everyday objects such as playing cards, dice, coins, paper, and pencil. Inside Dazzling Division, you'll learn the basics of division and then quickly begin to solve division problems. You'll find out what divisors, dividends, and quotients are and how to look at division as simply putting items into groups. Once you've grasped these basics, you'll practice your skills with such fun games and activities as Division Tic-Tac-Toe, Off to the Races, and Three-in-a-Row Bingo. Finally, you can move on to become truly dazzling at division by mastering the mysteries of remainders, prime numbers, and long division while playing Prime Mania and Shout It Out! So why wait? Jump right in and find out how easy it is to become a mathematics master!",
        "Category": " Juvenile Nonfiction , Mathematics , Arithmetic",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "This Is Our Faith: A Catholic Catechism for Adults",
        "Authors": "By Pennock, Michael Francis",
        "Description": "",
        "Category": " Religion , Institutions & Organizations",
        "Publisher": "Ave Maria Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "I Can Print",
        "Authors": "By Brighter Child (COR)",
        "Description": "Children will enjoy learning to print with this fun and colorful I Can Print tablet!  This 128 page handwriting workbook features exercises that focus on an individual letter.  By following the instructions and examples provided, children will soon gain confidence in letter  formation.  Then, using the activities featured, they can practice writing words, phrases and full sentences.The I Can series is dedicated to helping children practice  and perfect important early-learning skills.  Featuring 10 titles for children in preschool to fourth grade, these workbook/tablets cover printing, cursive, addition, subtraction, time, spelling, and much more!",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "Brighter Child",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Christmas All Through the House (Better Homes & Gardens)",
        "Authors": "By Better Homes and Gardens Books (EDT)",
        "Description": "A feature book for the holiday season.Book-of-the-Month Club Feature Selection.Captures the holiday spirit with hundreds of make-it-yourself crafts and decorating ideas.Better Homes and Gardens kitchen-tested recipes from casual munchies to just-for-company dishes.",
        "Category": " Crafts & Hobbies , Seasonal",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Holy Humor: Inspirational Wit & Cartoons",
        "Authors": "By Samra, Cal",
        "Description": "",
        "Category": "",
        "Publisher": "Guideposts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Muzzled: From T-Ball to Terrorism--True Stories That Should Be Fiction",
        "Authors": "By Smerconish, Michael A.",
        "Description": "Sick of the total BS of rampant PC?This brazen, furiously funny book is the antidote to today's poison of political correctness. With humor and chutzpah, attorney, commentator, and popular radio host Michael Smerconish takes on today's oversensitive culture with a collection of entertaining, outlandish anecdotes about PC gone wild-stories that are hilarious, horrifying, and unbelievably true.Why are sports leagues handing out trophies to losers? Why are little old grandmas hired to guard 200-pound prisoners? Why are newborn babies and old men with walkers singled out at the airport while likely terrorists are ushered through security with ease? This book shows through these absurdities that today's atmosphere of censorship and multiculturalism is paving the way for serious threats to our cultural identity and national security: \"It's one thing for the forces of political correctness to muzzle our day-to-day lives here at home in the US, quite another when that same cancer metastasizes into the war on terror.\"We must eradicate the PC disease. Our sanity-and our very lives-depend on it.   \"Michael Smerconish talks the talk: If you say unpopular things, watch out! Using vivid examples of PC rubbish, Muzzled will lead you into a world that would terrify Rod Serling. An entertaining and provocative book.\"-Bill O'Reilly\"Reads like fiction, too bad it's true.\"-Nelson DeMille, novelist, author of Night Fall and The General's Daughter\"The PC virus is out of control . . . and it's worse than you think! In this entertaining and important book, Michael Smerconish chronicles just how mindless things have gotten in politically correct America. He tells fascinating stories that will make you laugh . . . right up until the time they make you scream. Thanks to the PC crowd, we are all living in The United States of the Absurd.\"-Bernard Goldberg, journalist and author of 100 People Who Are Screwing Up America, Arrogance, and Bias\"I really squirm whenever I find myself agreeing with Smerconish. (I know the feeling is mutual.) I did a lot of squirming while reading this provocative book. All true liberals and conservatives must agree with Smerconish that the PC muzzles must be removed so that people can decide based on the marketplace of ideas.\"-Alan Dershowitz, Felix Frankfurter Professor of Law, Harvard and author of Preemption\"I don't often find myself on the same side of the political barricades as Michael Smerconish. But Muzzled is a witty, provocative, and timely book. Even when Michael is wrong, which is often, he draws you in and keeps you reading.\"-Arianna Huffington, author of Pigs at the Trough and Fanatics and Fools\"By proving the link between America's political correctness at home and its looming defeat abroad, Smerconish performs a great and courageous public service. Citizens should take this book to heart . . . and then vote to defeat the rogue multiculturalists who value 'ethnic and racial sensitivities' far more than America's survival.\"-Michael F. Scheuer, author of Imperial Hubris and Through Our Enemies' Eyes, former chief of the CIA's Osama bin Laden Unit\"In Muzzled, my American Blood Brother of status-quo-obliterating defiance, Michael Smerconish, once again smokes out the cockroaches of political correctness . . . Muzzled is a great title for a book that I am convinced every American school kid should read and be tested on. If a new generation doesn't grow some intellectual balls, our Once Great Nation will continue to repeat horrific mistakes and pay the price . . . Read it. Live it.\"-Ted Nugent, rock star, author, television personality, and hunter extraordinaire",
        "Category": " Political Science , General",
        "Publisher": "Nelson Current",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Nostradamus: The Millennium & Beyond: The Prophecies to 2016",
        "Authors": "By Greene, Liz and Lorie, Peter",
        "Description": "Nostradamus is still seen in the late 20th century as perhaps the most successful of all history's prophets. His bizarre writings have been interpreted during the last four centuries in many different ways. The verses or \"quatrains,\" written in old French, contain a number of key words which have never been quite understood until now. Words such as \"Mabus\" and \"Hieron\" have baffled commentators, who have presumed that they refer to events in our future.Peter Lorie, in this new volume of predictions for the next two decades, has successfully provided a completely new insight into the prophet's methods, basing them on events contemporary to Nostradamus' lifetime. The solutions that emerge cast a completely fresh light on the predictions and give us a powerful and positive view of our near and more distant future.In addition, with the help of Dr. Liz Greene, a worldrenowned astrologer and Jungian psychoanalyst, the book contains a complete astrological analysis of the years from 1996 to 2016, using national birth charts for the United States, Germany, the United Kingdom, and other major countries around the world. Although working as a clairvoyant and \"seer\" of his future, Nostradamus also used the celestial science of astrology to confirm his work, and would have access to similar astrological information that is now weaved into this original and penetrating study of the future.The result is a convincing partnership between magic and science which reveals, year by year, the political and social development of America, Europe, The Baltic States, Japan, and other parts of the world scene, and examines the grand schemes of war, government, power, natural disaster, and other important events.",
        "Category": " Body, Mind & Spirit , Prophecy",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Aerobics Way",
        "Authors": "By Kenneth H. Cooper MD",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The Empowered Manager: Positive Political Skills at Work",
        "Authors": "By Block, Peter",
        "Description": "This is one of the most useful and clearly written books on the leading edge of management that I have read.--Warren BennisPeter Block, the author of the classic Flawless Consulting, is a true visionary. And here he turns his sights on management. Managers and other employees who feel powerless to control their own destinies, who feel stifled by bureaucracy, who feel sapped of creativity--will feel invigorated by Block's legAndary insight.Offers practical advice to help your managers:* Empower themselves to help shape the organization* Develop positive political skills in their dealings with all levels of employees* Take responsibility for their own actions* Negotiate with their allies and adversaries* Face failure courageously...and much more!Block presents ways to treat all members of the organization as entrepreneurs so that employees feel that their units are their own businesses and that they, and they alone, are in the process of creating an organization of their own choosing. Managers and other employees who pick up The Empowered Manager won't just be reading about management. They'll be harvesting timeless tips from a master of business thinking. And they'll be uncovering a road map that leads to enhanced effectiveness and job satisfaction.This is a liberating book that cuts through our rationalizations and self-deceptions to help us think about both work and life from a new perspective.--Geoff Bellman, author of The Consultant's CallingHelp your managers become more confident, contributing members of your organization with guidance from a famed consultant. This guide is a perfect addition to your management and leadership development programs.Winner of the Society for Human Resource Management (SHRM) Book Award",
        "Category": " Business & Economics , Human Resources & Personnel Management",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The River Knows",
        "Authors": "By Quick, Amanda",
        "Description": "From New York Times bestselling author Amanda Quick comes a delightful romp filled with breathtaking suspense, dazzling wit, and steamy Victorian passion...   The first kiss occurred in a dimly-lit hallway on the upper floor of Elwin Hastings’s grand house. Louisa Bryce never saw it coming. Of course, handsome, wealthy Anthony Stalbridge couldn’t possibly have had romantic intentions. The kiss was merely meant to distract the armed guard about to catch the two unlikely sleuths. After all, the only thing these two interlopers have in common is a passionate interest in uncovering the dastardly secrets of Mr. Hastings—a prominent member of Society whom they suspect of murder.     Brought together by their desire for the truth, Anthony and Louisa finally discover the incriminating evidence they’re looking for. But bringing Hastings to justice will be more perilous than they anticipate, especially since their thrilling attraction to danger—and, it turns out, to each other—might very well get in the way...",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Second Sight (The Arcane Society, Book 1)",
        "Authors": "By Quick, Amanda",
        "Description": "In financial straits and on a sure path to spinsterhood, Venetia Milton thought her stay at the remote, ramshackle Arcane House, far from society's prying eyes, would be a once in a lifetime opportunity to engineer her own ravishment. She was there to photograph the relics and artifacts collected by a highly secretive organization, founded two centuries earlier by an eccentric alchemist. And the alchemist's descendant - her employer, Mr. Gabriel Jones - had the eyes of a sorcerer ...After a night to remember, Venetia is prepared to cherish the memories of her romantic encounter and move on, but she is shattered when, shortly after their night together, she reads of Jones's death in the paper. As a private tribute to her one-time lover, she adopts the name \"Mrs. Jones\" and the guise of a respectable widow, and embarks on a new career as a fashionable photographer in London, where her unique ability to \"see\" beyond her subjects and capture that quality in her photography makes her photographs highly prized.But her romantic whim causes unexpected trouble. For one thing, Mr. Jones is about to stride, living and breathing, back into her life. And the bonds that tie them together include more than just the memory of passion; Venetia's special \"double vision\" has caught the attention of someone Mr. Jones is tracking - someone who will go to any lengths, even murder, to possess an ancient, extraordinary secret that has been lost for centuries. Someone who believes that as the \"wife\" of Mr. Jones, Venetia is the key.Now, as she introduces Gabriel about town as her miraculously back-from-the-dead \"husband,\" Venetia must join him in a perilous quest to track down a dangerous opponent who manages to stay one step ahead. As they explore the darker, wilder underbelly of the modern, scientific Victorian world, they must see through society's illusions - or this time, Gabriel Jones may not be rising from the dead, and neither may Mrs. Jones.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.63",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Day of the Dragon King (Magic Tree House (R))",
        "Authors": "By Murdocca, Sal (ILT) and Osborne, Mary Pope",
        "Description": "The #1   bestselling chapter book series of all time celebrates 25 years with new   covers and a new, easy-to-use numbering system! Who would burn books? Jack and Annie find out when the Magic Tree House   whisks them back to ancient China. There, a powerful emperor called the   Dragon King has ordered that all books be burned. Will Jack and Annie be able   to save at least one book? Or will they be captured by the emperor's   soldiers? Did you know that there’s a Magic Tree House book for every kid? Magic Tree House: Adventures with Jack and Annie,   perfect for readers who are just beginning chapter books Merlin Missions: More challenging adventures for the experienced   reader Super Edition: A longer and more dangerous adventure Fact Trackers: Nonfiction companions to your favorite Magic Tree House   adventures Have more fun with Jack and Annie at MagicTreeHouse.com!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Portfolio Of Deck Ideas",
        "Authors": "By Hgome How-To Institute",
        "Description": "Describes the keys to designing a useful deck, looks at fences, arbors, trellises, and accessories, and shows designs for ground-level, raised, and multilevel decks",
        "Category": " House & Home , Outdoor & Recreational Areas",
        "Publisher": "Random House Canada",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Patios and Decks",
        "Authors": "By Sunset",
        "Description": "Guidelines for designing, planning, constructing, or remodeling patios accompany ideas for decks and patios utilizing a variety of structural elements and decorative features",
        "Category": " Architecture , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "Shade Gardening",
        "Authors": "By Ortho Book Editors",
        "Description": "Describes more than a hundred shade-loving plants, lists their care requirements, and suggests creative ways to use them in landscaping",
        "Category": "",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1982"
        }
    },
    {
        "Title": "Jacob: The Fools God Chooses",
        "Authors": "By Roper, David",
        "Description": "",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Discovery House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Lipstick Jihad: A Memoir of Growing Up Iranian in America and American in Iran",
        "Authors": "By Moaveni, Azadeh",
        "Description": "As far back as she can remember, Azadeh Moaveni has felt at odds with her tangled identity as an Iranian-American. In suburban America, Azadeh lived in two worlds. At home, she was the daughter of the Iranian exile community,  serving tea, clinging to tradition, and dreaming of Tehran. Outside, she was a California girl who practiced yoga and listened to Madonna. For years, she ignored the tense standoff between her two cultures. But college magnified the clash between Iran and America, and after graduating,  she moved to Iran as a journalist. This is the story of her search for identity, between two cultures cleaved apart by a violent history. It is also the story of Iran, a restive land lost in the twilight of its revolution.    Moaveni's homecoming falls in the heady days of the country's reform movement, when young people demonstrated in the streets and shouted for the Islamic regime to end. In these tumultuous times, she struggles to build a life in a dark country, wholly unlike the luminous, saffron and   turquoise-tinted Iran of her imagination. As she leads us through the drug-soaked, underground parties of Tehran, into the hedonistic lives of young people desperate for change, Moaveni paints a rare portrait of Iran's rebellious next generation. The landscape of her Tehran — ski slopes, fashion shows, malls and cafes — is populated by a cast of young people whose exuberance and despair brings the modern reality of Iran to vivid life.",
        "Category": " Social Science , Ethnic Studies , General",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Lockout: Why America Keeps Getting Immigration Wrong When Our Prosperity Depends on Getting It Right",
        "Authors": "By Wucker, Michele",
        "Description": "We are essentially a nation of people who once belonged  elsewhere, yet have long been deeply ambivalent about this  part of our history. After World War I, the fear of the  stranger overwhelmed America's confidence in our ability  to create one nation out of many peoples. We slammed the  door shut, only to realize our error and re-open it four  decades later.  Today, a record-high foreign-born population,  global instability, and economic uncertainty have once  again pushed America to a tipping point in our attitudes  not only toward immigration but toward our role in the  world?and the stakes have risen dramatically. Our economy  depends more than ever on immigrants, not only for  stereotypical low-skilled jobs, but much more so for  maintaining our technological edge and promoting  American products and services abroad. So far, America  has reaped the lion's share of the gains of globalization. Yet  for the first time ever, the world's best and brightest no  longer see this country as the only destination of choice.  In Lock Out, Michele Wucker documents the mistakes  that led to our predicament today, and clarifies why it  would be a catastrophic error of judgment, as well as a  demonstration of a colossal lack of self-knowledge, if  America attempted to turn its back on rest of the world and  in so doing on the best of itself.",
        "Category": " Law , Emigration & Immigration",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "30-Minute Meals",
        "Authors": "By Ray, Rachael",
        "Description": "See where it all started with the original 30-Minute Meals. This classic Rachael Ray collection will help you get dinner on the table in no time, with easy-to-follow directions and budget-friendly ingredients. With over 120 recipes to choose from, you’ll never get stuck in a boring dinner routine again! Over 900,000 sold!",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Lake Isle Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "The Glorious Cause: The American Revolution, 1763-1789 (Oxford History of the United States) (Oxford History of the United States, Vol. 3)",
        "Authors": "By Middlekauff, Robert",
        "Description": "This outstanding narrative history, the first volume to appear in the Oxford History of the United States, offers an intimate view of the development of the Revolutionary War, the battle between the colonies and the motherland, and the establishment of the American republic. Beginning with the Treaty of Paris in 1763 and continuing to the election of George Washington as the first president, Robert Middlekauff charts the growing conflict between England and America and portrays the drama and anguish of the colonies' struggle for independence.",
        "Category": " History , United States , Revolutionary Period (1775-1800)",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "Romantic Lovers: The Intimate Marriage",
        "Authors": "By Hocking, David and Hocking, Carole",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "How to Have a Whole Heart in a Broken World",
        "Authors": "By Lutzer, Erwin W.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Victor Books",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Billy Budd and Other Stories (Penguin Classics)",
        "Authors": "By Melville, Herman",
        "Description": "Brilliant short stories and a novella by the author of Moby-Dick\"Billy Budd, Sailor,\" a classic confrontation between good and evil, is the story of an innocent young man unable to defend himself from wrongful accusations. Other selections include \"Bartleby,\" \"The Piazza,\" \"The Encantadas,\" \"The Bell-Tower,\" \"Benito Cereno,\" \"The Paradise of Bachelors,\" and \"The Tartarus of Maids.\"For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "University, Inc.: The Corporate Corruption of Higher Education",
        "Authors": "By Washburn, Jennifer",
        "Description": "Jennifer Washburn, a scholar and journalist, reveals how the growing influence of corporations over universities compromises the future of all those whose careers depend on a university education, and all those who will be employed, governed, or taught by the products of American universities.",
        "Category": " Education , Evaluation & Assessment",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The Associated Press Stylebook",
        "Authors": "By Associated Press",
        "Description": "More people write for the Associated Press than for any newspaper in the world, and writers have bought more copies of The AP Stylebook than of any other journalism reference. With this essential guide in hand, any writer can learn to communicate with the clarity and professionalism for which the Associated Press is famous. Fully revised and updated, this edition contains over 5,000 A to Z entries--including more than 50 new ones--laying out the AP's rules on grammar, spelling, punctuation, capitalization, abbreviation, and word and numeral usage. Comprehensive and easy to use, The AP Stylebook provides the facts and references necessary to write accurately about the world today: correct names of countries and organizations, Internet language and search techniques, language to avoid, common trademarks, and the unique guidelines for business and sports reporting. The final word on media law, The AP Stylebook also includes an invaluable section dedicated to crucial advice on how writers can guard against libel and copyright infringement. The veritable \"journalist's bible,\" this is the one reference that working writers cannot afford to be without.With more than 50 new entries plus updates of more than 100 others, The AP Stylebook includes such features as:An A to Z listing of guides to capitalization, abbreviation, spelling, numerals, and usage* Internet guidelines* Sports guidelines and style* Business guidelines and style* A guide to punctuation* Supreme Court decisions regarding libel law* Summary of First Amendment rules* The right of privacy* Copyright guidelines* Proofreaders' marks",
        "Category": " Reference , Writing Skills",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "The Mitford Snowmen: A Christmas Story",
        "Authors": "By Karon, Jan",
        "Description": "It's Christmastime in Mitford, and everyone's favorite characters are filled with holiday spirit. In The Mitford Snowmen, a swirling snowfall brings them to Main Street for a snowman-building contest complete with doughnuts, hot chocolate, and contagious good cheer. A charming small trim size and enchanting four-color illustrations make this the perfect way to visit Mitford?and gather a heart full of Christmas joy.",
        "Category": " Fiction , Religious",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Lost In Place: Growing Up Absurd in Suburbia",
        "Authors": "By Salzman, Mark",
        "Description": "From the author of Iron & Silk comes a charming and frequently uproarious account of an American adolescence in the age of Bruce Lee, Ozzy Osborne, and Kung Fu. As Salzman recalls coming of age with one foot in Connecticut and the other in China (he wanted to become a wandering Zen monk), he tells the story of a teenager trying to attain enlightenment before he's learned to drive.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Growing Up: It's a Girl Thing: Straight Talk about First Bras, First Periods, and Your Changing Body",
        "Authors": "By Jukes, Mavis and Tilley, Debbie (ILT)",
        "Description": "The author follows up her best-seller It's a Girl Thing: How to Stay Healthy, Safe, and in Charge with a light-hearted book of advice for girls ages eight to eleven on menstruation, puberty, and other concerns.",
        "Category": " Juvenile Nonfiction , Girls & Women",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The Art of Loving (Complete and Unabridged)",
        "Authors": "By Fromm, Erich",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Firehouse",
        "Authors": "By Halberstam, David",
        "Description": "One of America's most distinguished reporters and historians offers the deeply moving personal story of Engine 40, Ladder 35 -- located on the West Side of Manhattan near Lincoln Center -- and the absolute sacrifice its firefighters made on September 11, 2001. On the morning of September 11, 2001, two rigs carrying thirteen men set out from this firehouse: twelve of them would never return.Firehouse takes us to the epicenter of the tragedy. Through the kind of intimate portraits that are Halberstam's trademark, we watch the day unfold--the men called to duty while their families wait anxiously for news of them. In addition, we come to understand the culture of the firehouse itself: why gifted men do this; why, in so many instances, they are eager to follow in their fathers' footsteps and serve in so dangerous a profession; and why, more than anything else, it is not just a job, but a calling.This is journalism-as-history at its best, the story of what happens when one small institution gets caught in an apocalyptic day. Firehouse is a book that will move readers as few others have in our time. More than 6 years after his death David Halberstam remains one of this country's most respected journalists and revered authorities on American life and history in the years since WWII. A Pulitzer Prize-winner for his groundbreaking reporting on the Vietnam War, Halberstam wrote more than 20 books, almost all of them bestsellers. His work has stood the test of time and has become the standard by which all journalists measure themselves.",
        "Category": " Political Science , Terrorism",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Brazilian World (The World of Latin America series)",
        "Authors": "By Hayes, Robert A.",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Forum Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Cable Car",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Couple Skills: Making Your Relationship Work",
        "Authors": "By McKay, Matthew, Fanning, Patrick, and Paleg, Kim",
        "Description": "Following an easy-to-use format that explains the issues and the techniques that can be used to resolve them, this valuable guide teaches the communication skills that couples need to thrive together using real-life examples and practical exercises. Simultaneous.",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "New Harbinger Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Jumbled",
        "Authors": "By Betty Neal",
        "Description": "",
        "Category": "",
        "Publisher": "Waterford Institute, Inc.",
        "Price Starting With ($)": "5.5",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Deadly Truth: A Novel Based Upon Actual Events in South Africa Under Apartheid",
        "Authors": "By Heller, Israel, Heller, Zelda, and Blumberg, Janice Rothschild",
        "Description": "",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "1st Book Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Roget\u0092s Super Thesaurus (Rogets)",
        "Authors": "By McCutcheon, Marc",
        "Description": "Roget's Superthesaurus is a perennial favorite among writers, and this revised third edition has more than 1,000 new and expanded entries. Users of this treasury of words will be able to find the perfect synonym--or antonym--to give their writing preciseness and color. To help pinpoint le bon mot, this book also offers: *The popular \"Word Find\" reverse dictionary  *Tips for vocabulary building  *Clear sample sentences that clarify meanings  *Famous quotations that can be used as synonyms  With more features than any other word reference, Roget's Superthesaurus is a must-have for every writer's desk!",
        "Category": " Reference , Thesauri",
        "Publisher": "Writers Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Jesus Wants All of Me (MY UTMOST FOR HIS HIGHEST)",
        "Authors": "By Smouse, Phil A. (ADP) and Smouse, Phil A. (ILT)",
        "Description": "A devotional calendar based on \"My utmost for his highest\" provides a Bible verse and a brief meditation for each day of the year.",
        "Category": " Juvenile Nonfiction , Religious , Christian , Devotional & Prayer",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "A Man, a Can, a Plan : 50 Great Guy Meals Even You Can Make",
        "Authors": "By Joachim, David",
        "Description": "A Man, A Can, A Plan, inspired by an article in the most popular mens magazine, Men's Health, is a cookbook that presents 50 simple, inexpensive recipes featuring ingredients guys have right in their cupboards--canned food. Great and healthy food can be had for a low price and minimum effort, and A Man, A Can, A Plan lays it all out, in pictorial, easy-to-follow steps, for the culinary-challenged. It features special sections on cooking for her and cooking for the morning after for dudes with a lady on their minds. Author David Joachim received the 1999 James Beard Award for Steven Raichlen's Healthy Latin Cooking, so he knows his stuff and makes it accessible to beginners and experienced guys as well. Get your can openers ready to rumble!",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Oxford Color French Dictionary Plus",
        "Authors": "By Chalmers, Marianne (EDT), Combley, Rosalind (EDT), Roux, Catherine (EDT), and Wedgeworth, Laura (EDT)",
        "Description": "Fully revised and updated, this dictionary covers all the essential French vocabulary of everyday life. With extensive coverage, it presents over 100,000 words, phrases, and translations for those first learning French or for those simply needing a quick reference. It includes specialtreatment of key words--the frequently-used words that are the building blocks to learning the language. These words are given a special layout and usage notes to help learners access them easily and correctly. New warning symbols are provided to make slang and informal words and expressionsinstantly identifiable, and a glossary of grammatical terms as well as a short grammar guide offer extra help in communicating effectively. Additional features include a letter-writing guide, information on using e-mail, and games for developing dictionary skills, making this the ideal reference foranyone curious about the French language.",
        "Category": " Reference , Dictionaries",
        "Publisher": "Oxford University Press, USA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Berenstains' A Book (Bright and Early Books for Beginning Beginners)",
        "Authors": "By Berenstain, Stan and Berenstain, Jan",
        "Description": "Now joining forces with The B Book and The C Book is the reissue of The Berenstains' A Book--an astonishing album with almost any A word children can say. It's guaranteed to make learning to read a bundle of fun!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "9.48",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "YOU: The Owner's Manual",
        "Authors": "By Oz, Lisa, Roizen, Michael F., M.D., Oz, Mehmet, M.D., Spiker, Ted, and Hallgren, Gary (ILT)",
        "Description": "Between your full-length mirror and high-school biology class, you probably think you know a lot about the human body. While it's true that we live in an age when we're as obsessed with our bodies as we are with celebrity hairstyles, the reality is that most of us know very little about what chugs, churns, and thumps throughout this miraculous, scientific, and artistic system of anatomy. Yes, you've owned your skin-covered shell for decades, but you probably know more about your cell-phone plan than you do about your own body. When it comes to your longevity and quality of life, understanding your internal systems gives you the power, authority, and ability to live a healthier, younger, and better life.        You: The Owner's Manual challenges your preconceived notions about how the human body works and ages, then takes you on a tour through all of the highways, back roads, and landmarks inside of you. After taking a quiz that tests your body of knowledge, you'll learn about all of your blood-pumping, food-digesting, and keys-remembering systems and organs.      Just as important, you'll get the facts and advice you need to keep your body running long and strong. You'll find out how diseases start and how they affect your body -- as well as advice on how to prevent and beat conditions that threaten your quality of life. Complete with exercise tips, nutritional guidelines, simple lifestyle changes, and alternative approaches, You: The Owner's Manual gives you an easy, comprehensive, and life-changing how-to plan for fending off the gremlins of aging. To top it off, you'll also get the great-tasting and calorie-saving Owner's Manual Diet -- a thirty-recipe eating plan that's designed with only one goal in mind: to help you live a younger life.     Welcome to your body. Why don't you come on in and take a look around?",
        "Category": " Science , Life Sciences , Human Anatomy & Physiology",
        "Publisher": "WilliamMr",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Family First Workbook: Specific Tools, Strategies, and Skills for Creating a Phenomenal Family",
        "Authors": "By McGraw, Phillip C., Ph.D.",
        "Description": "In Dr. Phil's #1 New York Times bestseller Family First: Your Step-by-Step Plan for Creating a Phenomenal Family, he gives parents courage and a solid understanding of the principles for making your family phenomenal. Now, with The Family First Workbook: Specific Tools, Strategies and Skills for Creating a Phenomenal Family, Dr. Phil puts you to work practicing purposeful parenting, walking you through scenarios and exercises in which you and your family will act on these proven principles to build pride, unity and hope for the future. You'll master a host of concrete, in-depth tools for raising happy children who approach the world with integrity, honesty and respect.  Dr. Phil wants to help parents get their priorities back in order by putting family at the center of their lives. Families don't have to suffer through mediocrity because of parents who don't communicate and children who act out because they aren't receiving the right balance of guidance and discipline. You can shape your household into a functional, supportive, stimulating and safe place -- a place that you and your kids are happy to call home.  With innovative individual and group exercises, challenging self-appraisals, a Daily Intention Journal, specific guidelines on managing conflict, special material for divorced and blended families, and much more, the workbook will show you how to be the best role model, guide and advocate for your child.  Dr. Phil makes you ask yourself the hard questions, and he reveals the hard truths. You are raising America's future; you must invest the time and energy to do it right. The reward -- a happy, fulfilled home life that lets your children thrive -- will be well worth the work.",
        "Category": " Family & Relationships , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "How to Get Your Point Across in 30 Seconds or Less",
        "Authors": "By Frank, Milo O.",
        "Description": "A noted business communications consultant demonstrates how readers can focus their thinking, writing, and speaking; present themselves and their ideas more effectively; and capture a listener's attention by keeping communicated messages brief",
        "Category": " Business & Economics , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "Aging Slowly (Prevention Total Health System)",
        "Authors": "By Brenton, Myron",
        "Description": "Clears up misconceptions about aging, offers advice on nutrition and exercise, and tells how to prepare for some of the problems one will face in retirement",
        "Category": " Social Science , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Whale Done!: The Power of Positive Relationships",
        "Authors": "By Blanchard, Kenneth H. (EDT), Ballard, Jim, Lacinak, Thad, and Tompkins, Chuck",
        "Description": "A compendium of straightforward techniques on how to accentuate the positive and redirect the negative, increasing productivity at work and at home.What do your people at work and your spouse and kids at home have in common with a five-ton killer whale? Probably a whole lot more than you think, according to top business consultant and mega-bestselling author Ken Blanchard and his coauthors from SeaWorld. In this moving and inspirational new book, Blanchard explains that both whales and people perform better when you accentuate the positive. He shows how using the techniques of animal trainers -- specifically those responsible for the killer whales of SeaWorld -- can supercharge your effectiveness at work and at home. When gruff business manager and family man Wes Kingsley visited SeaWorld, he marveled at the ability of the trainers to get these huge killer whales, among the most feared predators in the ocean, to perform amazing acrobatic leaps and dives. Later, talking to the chief trainer, he learned their techniques of building trust, accentuating the positive, and redirecting negative behavior -- all of which make these extraordinary performances possible. Kingsley took a hard look at his own often accusatory management style and recognized how some of his shortcomings as a manager, spouse, and father actually diminish trust and damage relationships. He began to see the difference between \"GOTcha\" (catching people doing things wrong) and \"Whale Done!\" (catching people doing things right). In Whale Done!, Ken Blanchard shows how to make accentuating the positive and redirecting the negative the best tools to increase productivity, instead of creating situations that demoralize people. These techniques are remarkably easy to master and can be applied equally well at home, allowing readers to become better parents and more committed spouses in their happier and more successful personal lives.",
        "Category": " Business & Economics , Management",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "The Anxiety Cure for Kids: A Guide for Parents and Children",
        "Authors": "By Dupont, Robert L., Spencer, Elizabeth Dupont, and Dupont, Caroline M., M.D.",
        "Description": "The up-to-date, practical guide for helping your child deal with anxiety     Fear, worry, stomach pains, self-doubt—these are classic symptoms of anxiety in children. Using kid-friendly concepts and real-life examples, this reassuring guide helps adults and children understand the powerful ways in which anxiety works and how to overcome its negative effects. This revised edition includes all-new chapters on food phobia; the relationship between anxiety and other illnesses and problems such as ADHD, depression, and autism; and anxiety in teens.          The lessons in The Anxiety Cure for Kids have helped many children break free from anxiety. By making changes little by little, any child with anxiety can get well and stay well.            Provides up-to-date, practical guidance for helping both younger children and teenagers deal with anxiety issues          Shows how to recognize the symptoms of anxiety, evaluate a child's need for medication and/or therapy, assess the role of the family in anxiety disorders, and take concrete steps to find solutions          Explains how to communicate effectively with your child, help him or her confront fear, and boost your child's feelings of accomplishment and self-esteem          Addresses a range of anxiety disorders, such as food phobia and anxieties about terrorism, as well as the relationship between anxiety and other illnesses          Also includes advice that can be used by teachers, coaches, doctors, therapists, school nurses, and others who work with anxious kids",
        "Category": " Psychology , Psychotherapy , Child & Adolescent",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "The Millionaire's Unit: The Aristocratic Flyboys who Fought the Great War and Invented American Airpower",
        "Authors": "By Wortman, Marc",
        "Description": "The Millionaires' Unit is the story of a gilded generation of young men from the zenith of privilege: a Rockefeller, a Taft, the son of the head of the Union Pacific Railroad, a son of J.P. Morgan's leading partner, and several who counted friends and relatives among presidents and statesmen of the day. Most were students at Yale in 1916, striving for rewards on the athletic fields, in school organizations, and in Skull & Bones. They had it all and, remarkably by modern standards, they were prepared to risk it all to fight a distant war in France.Driven by the belief that their membership in the American elite required certain sacrifices, schooled in heroism and the nature of leadership, they were determined to be first into the conflict, leading the way ahead of America's declaration that it would join the Great War in Europe. At the heart of the group was the Yale flying club, six of whose members are the heroes of this book. They would share rivalries over girlfriends, jealousies over membership in Skull & Bones, and fierce ambition to be the most daring young man over the battlefields of France, where the casualties among flyers were chillingly high.One of the six would go on to become the principal architect of America's first strategic bomber force. Another became the navy's only Air Ace. Others would bring home decorations and tales of the high life in Paris. Some would not return, having made the greatest sacrifice of all. The members of the Millionaires' Unit shared a stirring, romantic adventure - together growing from boys into leaders in the first terrible, modern war, putting their lives on the line because they believed in the cause and in the idea that it was their duty to do so.",
        "Category": " History , Military , United States",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Commodore Perry in the Land of the Shogun",
        "Authors": "By blumberg, rhoda",
        "Description": "In 1853, few Japanese people knew that a country called America even existed.For centuries, Japan had isolated itself from the outside world by refusing to trade with other countries and even refusing to help shipwrecked sailors, foreign or Japanese. The country's people still lived under a feudal system like that of Europe in the Middle Ages. But everything began to change when American Commodore Perry and his troops sailed to the Land of the Rising Sun, bringing with them new science and technology, and a new way of life.",
        "Category": " Juvenile Nonfiction , History , United States , 19th Century",
        "Publisher": "Lothrop Lee & Shepard",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "The Legend Of Sleepy Hollow & Rip Van Winkle (Treasury of Illustrated Classics)",
        "Authors": "By Irving, Washington (EDT)",
        "Description": "",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Modern Pub.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    }
]