[
    {
        "Title": "NEW ENGLAND: Indian Summer.",
        "Authors": "By Van Wyck Brooks",
        "Description": "",
        "Category": "",
        "Publisher": "E. P. Dutton",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1940"
        }
    },
    {
        "Title": "Bronze Mirror",
        "Authors": "By Larsen, Jeanne",
        "Description": "A blend of fantasy and history describes how a young maid in twelfth-century China is fascinated by the betrayal, cunning, and affairs of the wealthy family she serves, while the Yellow Emperor watches her through his magical bronze mirror. Reprint.",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Mazel",
        "Authors": "By Goldstein, Rebecca",
        "Description": "A novel of three generations of Jewish women begins with Sasha, the matriarch, who has learned of Mazel, the great confounder of order and predictability, from her experiences in pre-war Warsaw and her current life in New York, as she passes this knowledge onto her daughter and granddaughter. Reprint.",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Cuisine of California",
        "Authors": "By Worthington, Diane Rossen",
        "Description": "Founded on the freshest possible ingredients and influenced by the vibrant culinary traditions of Thailand, Mexico, China, the Middle East, Japan, France, and Italy, California cuisine launched more than a revolutionary style of cooking - it spawned an entirely new appreciation for food. Of course you don't need to live on the West Coast to revel in these simple, healthful dishes. From appetizers of Spicy Lemon Shrimp and colorful salads such as Orange, Kiwi, and Jicama with Lime Dressing to savory entrees of Scallops with Fresh Tomatoes, Herbs, and White Wine and indulgent desserts such as Chocolate-Caramel Walnut Torte, here is a complete collection of impeccable favorites.",
        "Category": " Cooking , Regional & Ethnic , American , California Style",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1977"
        }
    },
    {
        "Title": "Forged in Battle: The Civil War Alliance of Black Soldiers and White Officers",
        "Authors": "By Glatthaar, Joseph T.",
        "Description": "A history of the United States Colored Troops during the American Civil War",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "Free Pr",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Basket Fever",
        "Authors": "By Robert Sidney Bowen",
        "Description": "",
        "Category": "",
        "Publisher": "Western Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Explaining Hitler: The Search for the Origins of His Evil",
        "Authors": "By Rosenbaum, Ron",
        "Description": "Expanding on his lead essay in The New Yorker magazine, the author presents a literary investigation of the heated controversies among historians, psychologists, philosophers, and theologians about the life and nature of Adolf Hitler. 40,000 first printing. Tour.",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Entertaining For Dummies",
        "Authors": "By Smith, Linda, Williamson, Suzanne, and Pollak, Suzanne Williamson",
        "Description": "From small dinner parties to big-time shindigs, Entertaining For Dummies shows you how to impress and pamper your guests no matter what the occasion. It’s full of fresh, creative ideas and proven tips for creating an unforgettable experience — at your daughter’s sweet sixteen birthday party, a fancy dinner in honor of your boss, or any other get-together.Whether you’re a homemaker in need of creative ideas for your next big party, or a busy professional who needs to impress the boss without spending a bundle, Entertaining For Dummies covers all the bases — from planning, to decorating, to cooking, to hosting. Regardless of the size of the event or its purpose, you’ll find helpful tips on these topics and more:Planning large or small eventsDesigning distinctive invitations and a balanced menuCreating a comfortable atmosphere in any spaceMaking your guests feel welcomeHosting a business gathering in your homeTreating the family to special events like picnics, birthday parties, and Sunday dinnersHosting theme events like costume partiesRenowned entertaining speaker Suzanne Williamson offers all the expert advice you need to make every event a success — from black-tie parties to backyard barbecues. She’ll give you all the tools and tips you need to get organized and get your party off the ground. Whether you’re entertaining for a dozen or a thousand, you’ll find everything you need right here:Organize a last-minute partyUse your imagination to create a unique atmosphereDrinks—from cocktails to coffeeTable settings and food presentationHire a disc jockey or bandCope with accidents, emergencies, and unplanned occurrencesEntertain during the holidaysParties for children from tots to teensEntertain for business associates or government officialsSolutions for common cooking disastersIf you want step-by-step help on getting your party off the ground, or just a reliable reference for trouble-shooting those unforeseen emergencies, Entertaining For Dummies is the only book you need. It’s full of creative ideas that making throwing your next party a blast — and a breeze.",
        "Category": " Cooking , Entertaining",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Chambersburg: Its Record and Its Prospect",
        "Authors": "By The Chambersburg Community Development Committee",
        "Description": "",
        "Category": "",
        "Publisher": "The Chambersburg Chamber of Commerce",
        "Price Starting With ($)": "53.43",
        "Publish Date": {
            "Month": "January",
            "Year": "1945"
        }
    },
    {
        "Title": "Favorite Brand Name Recipe Cookbook: Ov 200",
        "Authors": "By Consumer Guide",
        "Description": "Compiles more than two thousand popular recipes that originally appeared on brand-name food product labels",
        "Category": " Cooking , General",
        "Publisher": "Crescent",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "Heartstrings of Laughter & Love: A Tribute to Mothers",
        "Authors": "By Gibbs, Terri A. (EDT)",
        "Description": "This beautiful tribute puts love and admiration into words - for a mother's priceless investment of her love and life that can never be repaid, yet can be honored and cherished. With a page in back to write your tribute to your mother.",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "General Foods Kitchens Cookbook",
        "Authors": "By WOMEN OF GENERAL FOODS KITCHENS,",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "Uncle Arthur's Art Studio (The Spiderwick Chronicles)",
        "Authors": "By Forrester, Emma",
        "Description": "The Spiderwick Stained Glass Book features intricate black line art on trasparent paper. Color in the pictures and them hang them up on your window. You'll be mesmerized by the sight!",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Simon Scribbles",
        "Price Starting With ($)": "11.69",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Eloise Takes a Bawth",
        "Authors": "By Knight, Hilary (ILT), Thompson, Kay, and Crowley, Mart (ILT)",
        "Description": "It's bath time for Eloise in this picture book starring everyone's favorite precocious Plaza Hotel resident.ELOISE has been celebrated at the PLAZA, in PARIS, at CHRISTMASTIME, in MOSCOW. Now ELOISE takes a plunge in the BAWTH.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "How to Bake an American Pie",
        "Authors": "By Wilson, Karma and Colon, Raul (ILT)",
        "Description": "How do you bake an American pie?   Preheat the world until fiery hot with a hunger and thirst to be free. Now find a giant melting pot on the shores of a great shining sea.   From the bestselling author of Bear Snores On comes a remarkable recipe for America.   Including a dash of purple mountain majesties, cupfuls of courage, and a pinch of liberty, this beautifully illustrated combination of ingredients yields an irresistible treat that promises plenty of servings for children everywhere.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Patriotic Holidays",
        "Publisher": "Margaret K. McElderry Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Wicked Lovely (Wicked Lovely, 1)",
        "Authors": "By Marr, Melissa",
        "Description": "Fans of Sarah J. Maas and Holly Black won’t be able to resist the world of Melissa Marr's #1 New York Times bestselling series, full of faerie intrigue, mortal love, and courtly betrayal.Rule #3: Don't stare at invisible faeries.Aislinn has always seen faeries. Powerful and dangerous, they walk hidden in mortal world. Aislinn fears their cruelty—especially if they learn of her Sight—and wishes she were as blind to their presence as other teens.Rule #2: Don't speak to invisible faeries.Now faeries are stalking her. One of them, Keenan, who is equal parts terrifying and alluring, is trying to talk to her, asking questions Aislinn is afraid to answer.Rule #1: Don't ever attract their attention.But it's too late. Keenan is the Summer King who has sought his queen for nine centuries. Without her, summer itself will perish. He is determined that Aislinn will become the Summer Queen at any cost—regardless of her plans or desires.Suddenly none of the rules that have kept Aislinn safe are working anymore, and everything is on the line: her freedom, her best friend Seth, her life—everything.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Mama and Little Joe",
        "Authors": "By McAllister, Angela and Milne, Terry (ILT)",
        "Description": "When two well-loved, hand-me-down toys named  Mama Ruby and Little Joe arrive at their new home, they're given an unfriendly welcome by the fine, expensive toys already there. But Mama Ruby and Little Joe have something much more valuable than fancy stuffing inside -- they're filled with the warmth and compassion that come from having a heart.",
        "Category": " Juvenile Fiction , Toys, Dolls & Puppets",
        "Publisher": "Margaret K. McElderry Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Once Upon a Banana",
        "Authors": "By Armstrong, Jennifer and Small, David (ILT)",
        "Description": "Such a little banana causing such a big pile of trouble! How could it be? First the grocer, then the painter, next the bicycle messenger, and then -- oh, no -- not the baby in the carriage! An entire town turned upside down, all by a banana peel!   Caldecott Medal-winning artist David Small and award-winning author Jennifer Armstrong have created a roller-coaster ride of a picture book told in rhyming street signs that will tickle and delight readers from beginning to end and over and over again.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Simon & Schuster/Paula Wiseman Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Teaching Kids to Love the Earth",
        "Authors": "By Marina, Lachecki, Schimpf, Ann, Passineau, Joseph, and Truer, Paul",
        "Description": "Provides 186 earth-caring activities designed for use with children of all ages to help them experience and appreciate the earth",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Pfeifer-Hamilton Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Under the Quilt of Night",
        "Authors": "By Ransome, James E. (ILT) and Hopkinson, Deborah",
        "Description": "When night falls, and all is quiet, a slave girl starts to run. She follows the moon into the woods, leading her loved ones away from their master. There's only one place where he might not find them, and it's under the quilt of night.  Guided by the stars, they head north in the direction of freedom. At last, the girl sees a quilt -- the quilt with a center square made from deep blue fabric -- and knows it's a signal from friends on the Underground Railroad, welcoming her into their home. And so she steps forward...  Deborah Hopkinson and James E. Ransome team up again, in this stunning companion to Sweet Clara and the Freedom Quilt. Ransome's rich, powerful illustrations elicit all the emotion and suspense of Hopkinson's words, in a story that's sure to make your heart race and leave you breathless.",
        "Category": " Juvenile Fiction , Historical , United States , 19th Century",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Character Makeover: 40 Days with a Life Coach to Create the Best You",
        "Authors": "By Brazelton, Katie and Leith, Shelley",
        "Description": "Get the kind of makeover that will transform your life!Bestselling author and life coach Katie Brazelton takes you on a deeply personal forty-day journey of developing your character. Discover how to close the gap between understanding God’s purpose for your life and carrying it out as you put an end to well-worn patterns of defeat, woundedness, insecurity, unworthiness, and self-centeredness.Teaming up with coauthor Shelley Leith, who is a highly sought-after speaker on strengthening marriages and family, Brazelton focuses on eight character traits essential to living a purpose-filled life: humility, confidence, courage, self-control, patience, contentment, generosity, and perseverance.  Step-by-step you’ll experience a complete character makeover—and become the best “you” God intended you to be.Ideal for small groups, women’s church ministry, and one-on-one study.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "The Number: What Do You Need for the Rest of Your Life and What Will It Cost?",
        "Authors": "By Eisenberg, Lee",
        "Description": "Do you know your Number? What happens if you don't make it to your Number? Do you have a plan? The Number is no ordinary finance book—it offers an intriguing and entertaining tour of weath gurus, life coaches, and financial advisers, and our hopes and fears for the future. The result is a provocative field guide to your psyche and finances and an urgently useful book for anyone over thirty.The often-avoided, anxiety-riddled discussion about financial planning for a secure and fulfilling future has been given a new starting point in The Number by Lee Eisenberg. The buzz of professionals and financial industry insiders everywhere, the Number represents the amount of money and resources people will need to enjoy the active life they desire, especially post-career. Backed by imaginative reporting and insights, Eisenberg urges people to assume control and responsibility for their standard of living, and take greater aim on their long-term aspirations. From Wall Street to Main Street USA, the Number means different things to different people. It is constantly fluctuating in people’s minds and bank accounts. To some, the Number symbolizes freedom, validation of career success, the ticket to luxurious indulgences and spiritual exploration; to others, it represents the bewildering and nonsensical nightmare of an impoverished existence creeping up on them in their old age, a seemingly hopeless inevitability that they would rather simply ignore than confront. People are highly private and closed-mouthed when it comes to discussing their Numbers, or lack thereof, for fear they might either reveal too much or display ineptitude. In The Number, Eisenberg describes this secret anxiety as the “Last Taboo,” a conundrum snared in confusing financial lingo. He sorts through the fancy jargon and translates the Number into commonsense advice that resonates just as easily with the aging gods and goddesses of corporate boardrooms as it does with ordinary people who are beginning to realize that retirement is now just a couple of decades away. Believing that the Number is as much about self-worth as it is net worth, Eisenberg strives to help readers better understand and more efficiently manage all aspects of their life, money, and pursuit of happiness.",
        "Category": " Social Science , Reference",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "G Is for One Gzonk!: An Alpha-number-bet Book",
        "Authors": "By DiTerlizzi, Tony",
        "Description": "Welcome to my silly dilly take on ABC It's lots of fun and really odd, as you will quickly see For they're no \"leaping lizards\" here No \"bears that bounce a ball\" In fact, these zany critters have never been seen at all! So turn the page and cast a gaze on this menagerie, but don't forget the beasts within were all made up by me! -- Tiny DiTerlooney",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "16.2",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "House of Bush, House of Saud: The Secret Relationship Between the World's Two Most Powerful Dynasties",
        "Authors": "By Unger, Craig",
        "Description": "Newsbreaking and controversial -- an award-winning investigative journalist uncovers the thirty-year relationship between the Bush family and the House of Saud and explains its impact on American foreign policy, business, and national security.  House of Bush, House of Saud begins with a politically explosive question: How is it that two days after 9/11, when U.S. air traffic was tightly restricted, 140 Saudis, many immediate kin to Osama Bin Laden, were permitted to leave the country without being questioned by U.S. intelligence?  The answer lies in a hidden relationship that began in the 1970s, when the oil-rich House of Saud began courting American politicians in a bid for military protection, influence, and investment opportunity. With the Bush family, the Saudis hit a gusher -- direct access to presidents Reagan, George H.W. Bush, and George W. Bush. To trace the amazing weave of Saud- Bush connections, Unger interviewed three former directors of the CIA, top Saudi and Israeli intelligence officials, and more than one hundred other sources. His access to major players is unparalleled and often exclusive -- including executives at the Carlyle Group, the giant investment firm where the House of Bush and the House of Saud each has a major stake.  Like Bob Woodward's The Veil, Unger's House of Bush, House of Saud features unprecedented reportage; like Michael Moore's Dude, Where's My Country? Unger's book offers a political counter-narrative to official explanations; this deeply sourced account has already been cited by Senators Hillary Rodham Clinton and Charles Schumer, and sets 9/11, the two Gulf Wars, and the ongoing Middle East crisis in a new context: What really happened when America's most powerful political family became seduced by its Saudi counterparts?",
        "Category": " Political Science , Reference",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "365 Ways To Change the World: How to Make a Difference-- One Day at a Time",
        "Authors": "By Norton, Michael",
        "Description": "You want to make a difference in the world, but don't know where to begin. Now you can. Here is just the guide to lots of exciting ways that are more personal and fun than merely writing a check. For every day of the year, 365 Ways to Change the World is packed with information and ideas that don't take a lot of special skills to put into action, but will achieve something positive:    Observe a \"Buy Nothing Day\" Plant a \"peace pole\" Sew a panel for an AIDS memorial quilt Collect rainwater to water your plants    The suggestions cover twelve important areas in which you can influence change, including in your local community, as a consumer, making a cultural contribution, and addressing problems such as the environment, health, and human rights. You can go through the book day by day or use the index to flip to the issues that concern you most; to help you take action, a complementary website links straight to many of the sources listed in the book. Great to give as well as to keep, this is an inspiring, practical resource for making the world a better place -- one day at a time.",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Chaos and Fractals: The Mathematics Behind the Computer Graphics (Proceedings of Symposia in Applied Mathematics)",
        "Authors": "By Devaney, Robert L. and Keen, Linda (EDT)",
        "Description": "",
        "Category": " Mathematics , General",
        "Publisher": "Amer Mathematical Society",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Dutch Sneakers and Flea Keepers: 14 More Stories",
        "Authors": "By Brown, Calef",
        "Description": "In the tradition of Edward Lear, Calef Brown has fashioned fourteen nonsense poems so wacky that both young and old will be unable to suppress their laughter. Invented words and sounds and their visual counterparts create both an audible and a visual feast. This is the kind of silliness children (and many adults) relish.",
        "Category": " Juvenile Nonfiction , Poetry , Humorous",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Graffiti Girl",
        "Authors": "By Parra, Kelly",
        "Description": "Graffiti art. It's bold. It's thrilling. And it can get a girl into serious trouble....   Raised by her single mom (who's always dating the wrong kind of man) in a struggling California neighborhood, Angel Rodriguez is a headstrong, independent young woman who channels her hopes and dreams for the future into her painting. But when her entry for a community mural doesn't rate, she's heartbroken. Even with winning artist Nathan Ramos -- a senior track star and Angel's secret crush -- taking a sudden interest in Angel and her art, she's angry and hurt. She's determined to find her own place in the art world, her own way.   That's when Miguel Badalin -- from the notorious graffiti crew Reyes Del Norte -- opens her eyes to an underground world of graf tags and turf wars. She's blown away by this bad boy's fantastic work and finds herself drawn to his dangerous charm. Soon she's running with Miguel's crew, pushing her skills to the limit and beginning to emerge as the artist she always dreamed she could be. But Nathan and Miguel are bitter enemies with a shared past, and choosing between them and their wildly different approaches to life and art means that Angel must decide what matters most before the artist inside of her can truly break free.",
        "Category": " Young Adult Fiction , School & Education , General",
        "Publisher": "MTV Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The Big Year: A Tale of Man, Nature, and Fowl Obsession",
        "Authors": "By Obmascik, Mark",
        "Description": "Every January 1, a quirky crowd storms out across North America for a spectacularly competitive event called a Big Year -- a grand, expensive, and occasionally vicious 365-day marathon of birdwatching. For three men in particular, 1998 would become a grueling battle for a new North American birding record. Bouncing from coast to coast on frenetic pilgrimages for once-in-a-lifetime rarities, they brave broiling deserts, bug-infested swamps, and some of the lumpiest motel mattresses known to man. This unprecedented year of beat-the-clock adventures ultimately leads one man to a record so gigantic that it is unlikely ever to be bested. Here, prize-winning journalist Mark Obmascik creates a dazzling, fun narrative of the 275,000-mile odyssey of these three obsessives as they fight to win the greatest -- or maybe worst -- birding contest of all time.",
        "Category": " Nature , Birdwatching Guides",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "One Billion Customers: Lessons from the Front Lines of Doing Business in China",
        "Authors": "By McGregor, James",
        "Description": "Companies from around the globe are flocking to China to buy, sell, manufacture, and create new products, but as former Wall Street Journal China bureau chief turned successful corporate executive James McGregor explains, business in China is never quite what it seems. One Billion Customers offers compelling narratives of personalities, business deals, and lessons learned, creating a coherent pictures of China's emergence as a global economic power with a dog-eat-dog business climate that has turned bureaucrats into billionaires and left many foreign business executives with their pockets turned inside out.",
        "Category": " Business & Economics , International , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "More Tales of Mrs. Hedgehog",
        "Authors": "By Rh Value Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Grown Folks Business: A Novel",
        "Authors": "By Murray, Victoria Christopher",
        "Description": "Sheridan's husband wanted to stop living a lie, but how was she going to live her life knowing the truth?  \"There's no other way to say this. I'm in love with someone else.\" With these words, Sheridan Hart's life as she knows it comes to a crashing halt. She thought she was living every woman's dream: for the past seventeen years of marriage, Quentin had been a model husband, father, and business partner. But for all those years, he'd been hiding a secret from her. In fact, he had kept his secret from everyone. His startling confession is a lifelong attraction to men, and he is leaving her to be with his lover.  While coming to grips with the destruction of her marriage, Sheridan must also deal with the emotional reactions of her sixteen-year-old son and ten-year-old daughter. When word gets out about Quentin, everybody has something to say -- her family, her friends, and her church community all have advice to give and judgment to dole out. But at the end of the day, Sheridan must lean on her faith and her heart to decide what's best for her family.",
        "Category": " Fiction , African American , Christian",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Public Relations on the Net: Winning Strategies to Inform and Influence the Media, the Investment Community, the Government, the Public, and More!",
        "Authors": "By Holtz, Shel",
        "Description": "",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Prisoners of Twilight",
        "Authors": "By Robertson, Don",
        "Description": "As the Civil War winds down in April 1865, a band of Confederate soldiers journeys south, unaware that they are on a collision course with another group of equally frightened soldiers",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Tales from the Maryland Terrapins",
        "Authors": "By Ungrady, David",
        "Description": "The most profound memories from more than a century of athletics at Maryland are relived through first-person anecdotes reflecting the joys and challenges of big-time college sports.",
        "Category": " Sports & Recreation , History",
        "Publisher": "Sports Publishing LLC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Bringing up a Moral Child: A New Approach for Teaching Your Child to Be Kind, Just, and Responsible",
        "Authors": "By Michael and Mekler, Eva Schulman",
        "Description": "Identifies three key processes by which children develop moral values and encourages parents to foster such values in a family setting from their child's earliest years",
        "Category": "",
        "Publisher": "Addison Wesley Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Thimbletack's Mission (Ready-to-Read Level 3: Spiderwick Chronicles)",
        "Authors": "By Frazer, Rebecca",
        "Description": "Thimbletack is angry. His quiet home has been turned upside down, invaded by several noisy, troublesome creatures - a family, in fact, known as the Graces. The one who's causing the most trouble is a boy named Jared. And when Jared takes the book that Thimbletack has spent his whole life guarding, the house brownie decides that it's time to take action.",
        "Category": " Juvenile Fiction , Readers , Intermediate",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Wealth and Poverty of Nations: Why Some Are So Rich and Some So Poor",
        "Authors": "By Landes, David S.",
        "Description": "The Wealth and Poverty of Nations is David S. Landes's acclaimed, best-selling exploration of one of the most contentious and hotly debated questions of our time: Why do some nations achieve economic success while others remain mired in poverty? The answer, as Landes definitively illustrates, is a complex interplay of cultural mores and historical circumstance. Rich with anecdotal evidence, piercing analysis, and a truly astonishing range of erudition, The Wealth and Poverty of Nations is a \"picture of enormous sweep and brilliant insight\" (Kenneth Arrow) as well as one of the most audaciously ambitious works of history in decades.For the paperback edition, Landes has written a new epilogue, in which he takes account of Asian financial crisises and the international tension between overconfidence and reality.",
        "Category": " Business & Economics , Economic History",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Class President (An Apple Paperback)",
        "Authors": "By Hurwitz, Johanna",
        "Description": "When Julio's interest shifts from managing his best friend's class election campaign to becoming a candidate himself, he has to figure out how he can enter the contest and keep his friendship",
        "Category": "",
        "Publisher": "Apple",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Sandpebbles/Stranded in Paradise/The Pearl (Women of Faith Fiction Collection)",
        "Authors": "By Copeland, Lori (EDT), Women Of Faith, Hickman, Patricia (EDT), and Hunt, Angela Elwell (EDT)",
        "Description": "Women of Faith fiction titles have sold hundreds of thousands of copies. Now, we've combined three favorite titles into one book.SandpebblesA young widow discovers a new lease on life, but only after allowing God to work miracles in her soul.Stranded in ParadiseIn this comedy of errors, Tess's tropical getaway is thwarted by a storm and she discovers that while she can't control everything that goes on around her, God certainly can!The PearlShe had the perfect life...until the accident. Now science offers her the opportunity to replace what she lost, but at what cost?",
        "Category": " Fiction , Religious",
        "Publisher": "Westbow Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Best Friends in the Snow (My First Hello Reader!)",
        "Authors": "By Medearis, Angela Shelf and Wilson-Max, Ken (ILT)",
        "Description": "This MFHR of friends at play on a wintery afternoon highlights the fun, easy-to-read rhyming text and kid-pleasing art of best-selling author and illustrator, Angela Shelf Medearis and Ken Wilson-Max.On a bright, winter day, two friends bundle up in hats, coats, and mittens and head outdoors to play in the snow. Among other things, they go sledding down a hill, make a snowman and snow angels, have a snowball fight, and catch snowflakes in the air. Readers discover, as these two friends do, that sharing good times together with friends is  very special. Included in the book are six pages of puzzle activities and an insert of eight pairs of picture/word game cards that add to the fun and learning experience.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Complete Idiot's Guide to Choosing, Training, & Raising a Dog (The Complete Idiot's Guide)",
        "Authors": "By Hodgson, Sarah",
        "Description": "The Complete Idiot's Guide to Choosing, Training, and Raising a Dog helps you build the skills you need to have a healthy, happy, well-trained canine companion. Feel confident about managing your dog, even when you have to teach him or her a better way to behave. In this Complete Idiot's Guide you get solid information about the responsibilities and pleasures of dog ownership, friendly advice in an easy-to-understand format, tips, definitions, and warnings to help you along; and clear illustrations that show you exactly what to do!",
        "Category": " Pets , Dogs , General",
        "Publisher": "Alpha",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Where's Thena? I Need a Poem About...: Insightful and Witty Poems",
        "Authors": "By Smith, Thena",
        "Description": "The poems are arranged by easy to use topics and include choices from the serious to the downright silly! There are poems about adult subjects as well as for and about children. Other subjects include Nature, Pets and Teddy Bears, Babies and Boys and Girls. Also included are some hard to find subjects for Special Needs Children and Memorial poems and Poems of loss. Thena has been encouraged for years by ladies on the message boards to put her poems in book form.",
        "Category": " Crafts & Hobbies , Scrapbooking",
        "Publisher": "BLUEGRASS PUBLISHING",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "The Dinosaur Alphabet Book (Jerry Pallotta's Alphabet Books)",
        "Authors": "By Masiello, Ralph (ILT) and Pallotta, Jerry",
        "Description": "The perfect way to introduce children to the fascinating world of dinosaurs. Full of interesting facts--did you know some dinosaurs had sharp front teeth while others had no front teeth at all? This alphabet book explores both the known and the not-so-well known dinosaurs.Meet the heterodontosaurus (one of the smallest known to exist), the megalosaurus (the first dinosaur ever discovered), the iguanodon, the ultrasaurus, and more!Once again, Jerry Pallotta and Ralph Masiello have combined their talents to create a unique children's book that will inform and entertain young readers.",
        "Category": " Juvenile Nonfiction , Animals , Dinosaurs & Prehistoric Creatures",
        "Publisher": "Charlesbridge",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "Impulse",
        "Authors": "By Hopkins, Ellen",
        "Description": "Sometimes you don't wake up. But if you happen to, you know things will never be the same.  Three lives, three different paths to the same destination: Aspen Springs, a psychiatric hospital for those who have attempted the ultimate act -- suicide.  Vanessa is beautiful and smart, but her secrets keep her answering the call of the blade.  Tony, after suffering a painful childhood, can only find peace through pills.  And Conner, outwardly, has the perfect life. But dig a little deeper and find a boy who is in constant battle with his parents, his life, himself.  In one instant each of these young people decided enough was enough. They grabbed the blade, the bottle, the gun -- and tried to end it all. Now they have a second chance, and just maybe, with each other's help, they can find their way to a better life -- but only if they're strong and can fight the demons that brought them here in the first place.",
        "Category": " Young Adult Fiction , Social Themes , Friendship",
        "Publisher": "Margaret K. McElderry Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "10,001 Food Facts, Chef's Secrets & Household Hints",
        "Authors": "By Bader, Myles H.",
        "Description": "",
        "Category": "",
        "Publisher": "Northstar Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Our Bodies, Ourselves: A New Edition for a New Era",
        "Authors": "By Boston Women's Health Book Collective",
        "Description": "America's best-selling book on all aspects of women's health  With more than four million copies sold, Our Bodies, Ourselves is the classic resource that women of all ages can turn to for information about every aspect of their well-being. Completely revised for the first time in a decade, these pages give women everything they need for making key decisions about their health -- from definitive information from today's leading experts to personal stories from other women just like them. This updated edition of Our Bodies, Ourselves includes the latest on:  ? Nutrition and exercise  ? Relationships, sexuality, and sexual health  ? Complementary health practices  ? Reproductive choices, pregnancy, and childbearing  ? Growing older  ? Medical testing and procedures  Together with its companion website (www.ourbodiesourselves.org), Our Bodies, Ourselves is a one-stop resource for women of all generations.  Plus: The rearranged food pyramid, a chapter about sexual orientation and gender identity, advice for making safer sex more fun, the latest on breast-feeding, support for women experiencing pregnancy loss, and a section devoted to getting the best care in today's complicated health care system.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Over Sea, Under Stone (The Dark Is Rising Sequence)",
        "Authors": "By Cooper, Susan",
        "Description": "\"I DID NOT KNOW THAT YOU CHILDREN WOULD BE THE ONES TO FIND IT. OR WHAT DANGER YOU WOULD BE PUTTING YOURSELVES IN.\"   Throughout time, the forces of good and evil have battled continuously, maintaining the balance. Whenever evil forces grow too powerful, a champion of good is called to drive them back. Now, with evil's power rising and a champion yet to be found, three siblings find themselves at the center of a mystical war.   Jane, Simon, and Barney Drew have discovered an ancient text that reads of a legendary grail lost centuries ago. The grail is an object of great power, buried with a vital secret. As the Drews race against the forces of evil, they must piece together the text's clues to find the grail -- and keep its secret safe until a new champion rises.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Margaret K. McElderry Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Robert E. Lee, the Man and the Soldier: A Pictorial Biography",
        "Authors": "By Stern, Philip Van Doren",
        "Description": "",
        "Category": "",
        "Publisher": "Bonanza Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "The Book of Film Biographies: A Pictorial Guide of 1000 Makers of the Cinema",
        "Authors": "By Morgan, Robin (EDT) and Perry, George (EDT)",
        "Description": "",
        "Category": " Performing Arts , Film , General",
        "Publisher": "Fromm Intl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Greek Islands (Eyewitness Travel Guides)",
        "Authors": "By Mosesson, Marc",
        "Description": "DK Eyewitness Travel Guide: Greek Islands is your indispensable guide to this beautiful part of the world. The fully updated guide includes unique cutaways, floor plans, and reconstructions of the must-see sights, plus street-by-street maps of cities and towns.DK's insider travel tips and essential local information will help you discover the best of the Greek Islands, from local festivals and markets to day trips around the countryside. Detailed listings will guide you to hotels, restaurants, bars and shops for all budgets, while practical information will help you to get around by train, bus, or car.With hundreds of full-color photographs, hand-drawn illustrations, and custom maps that brighten up every page,DK Eyewitness Travel Guide: Greek Islands truly shows you around this destination as no one else can.",
        "Category": " Travel , Europe , Greece",
        "Publisher": "DK Eyewitness Travel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Positive Words, Powerful Results: Simple Ways to Honor, Affirm, and Celebrate Life",
        "Authors": "By Urban, Hal",
        "Description": "Although we live in an ocean of words, we rarely acknowledge their power to uplift or put down, to inspire or discourage, to help or hurt. But in this jewel of a book, Hal Urban -- parent, award-winning teacher, and author of the classic Life's Greatest Lessons -- shows us simple and immediate ways that we can use language to change lives -- both our own and those around us.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Beans of Egypt Maine",
        "Authors": "By Chute, Carolyn",
        "Description": "There are families like the Beans all over America. They live on the wrong side of town in mobile homes strung with Christmas lights all year around. The women are often pregnant, the men drunk and just out of jail, and the children too numerous to count. In the 'Beans of Egypt', Maine, we meet the God-fearing Earlene Pomerleau and experience her obsession for the whole swarming Bean tribe. Therecousin Rubie, a boozer and a brawler, tall Aunt Roberta, the earth mother surrounded by countless, clinging babies, and Beal, sensitive, often gentle, but doomed by the violence within him.",
        "Category": " Fiction , Literary",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1986"
        }
    },
    {
        "Title": "The Bastard Prince (Heirs of Saint Camber)",
        "Authors": "By Kurtz, Katherine",
        "Description": "THE PRINCES IN THE TOWERThe power-hungry former Regents of the three Haldane princes were pleased. They controlled Gwynedd once more, now that Rhys Michael was king--malleable, wine-loving, and soft. Or so they thought...Unbeknownst to the Regents, Rhys Michael was coming into his birthright. With secret Deryni aid, he struggled to grasp the magic bequeathed to all anointed kings. And when Marek--heir to Gwynedd's last degenerate deposed Deryni despots--marched into Gwynedd at the head of an army, even the Regents had to admit that Rhys Michael must take to the field himself as king to repel the pretender.Rhys Michael saw his chance at last. He swore that the power of the throne--from now on and for all time to come--was to be held by Gwynedd's rightful king. For this, for his sons, and for his country, the king would risk all...FIRST PAPERBACK PUBLICATION",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "William Tecumseh Sherman, defender of the Union (Hall of Fame books)",
        "Authors": "By Wyatt Blassingame",
        "Description": "A biography of General Sherman, commander of the Union troops, examining the controversial personality that still puzzles many historians and Civil War buffs.",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Star of the sea: farewell to old Ireland",
        "Authors": "By O'Connor, Joseph",
        "Description": "Thrilling and full of suspense, this is a novel of Ireland set on a New York-bound ocean liner.In the spring of 1847, from an Ireland torn by disaster and injustice, the Star of the Sea sets sail for New York. On board are hundreds of hopeful emigrants, some brimming with optimism, many more desperate to get away and start afresh in the New World. Among them are a maidservant nursing a devastating secret; the bankrupt Lord Merridith and his family; an aspiring novelist; a writer of revolutionary ballads -- all braving the Atlantic in search of a new beginning. Each is connected more deeply than they can possibly know. Also stalking the decks is a killer, hungry for the vengeance that alone will bring absolution.The voyage of almost four weeks will see some lives end and others begin anew, and so much time to reflect on the life left behind; passionate loves tenderly recalled, ducked responsibilities now regretted, the shocking realization of a deep relationship where once it seemed there was nothing. In this spellbinding story of tragedy and mercy, love and healing, the further the ship sails towards the Promised Land, the more her passengers seemed moored to a past which will not let them go. This is a novel that is both urgently contemporary in its preoccupations, and historically revealing. It is a gripping and compassionate tale, building with the pace of a thriller to an unforgettable conclusion.From the Hardcover edition.",
        "Category": " Fiction , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Hester Roon",
        "Authors": "By Lofts, Norah",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Mambo: A Novel",
        "Authors": "By Armstrong, Campbell",
        "Description": "Inspector Frank Pagan of Scotland Yard seeks out a deranged terrorist who intends to hijack a cruise missle and blow up Cuba",
        "Category": " Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "The Western Wizard (Renshai Trilogy)",
        "Authors": "By Reichert, Mickey Zucker",
        "Description": "Book two in the acclaimed, bestselling epic fantasy Renshai Trilogy—an intricate world of Norse mythology, slashing swordplay, and devastating sorcery.   When Odin breathed life into the mortal realms, he also created the Cardinal Wizards: the Northern Wizard as the representative of Good, the Southern as master of Evil, and the Western and Eastern as the keepers of the balance between Good and Evil, each neutral, both sharing the burden of holding their fellow magic wielders in check.   But now the days decreed in ancient prophecy have come upon the mortal realms. The Great War has been fought and a Renshai has proven its Champion.    Yet even as the war’s heroes struggle to place the rightful king of Bearn upon his throne, and the also true Renshai seeks to train a new generation of his warrior race, the word is carried forth on falcon’s wings that the Western Wizard is no more.    And unless Shadimar, the Wizard of the East, can find the one mortal with any hope of surviving the challenge of the Seven Tasks of Wizardry, the worlds of gods and mortals alike will fall....",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "DAW",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Masks of the Martyrs (Rings of the Master)",
        "Authors": "By Chalker, Jack L.",
        "Description": "Although the pirates have gathered all five of the rings necessary to bring down the Master System, Hawks, the historian of the group, must figure out how to activate them",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "The Broken Branch: How Congress Is Failing America and How to Get It Back on Track (Institutions of American Democracy Series)",
        "Authors": "By Ornstein, Norman J. and Mann, Thomas E.",
        "Description": "Congress is the first branch of government in the American system, write Thomas E. Mann and Norman J. Ornstein, but now it is a broken branch, damaged by partisan bickering and internal rancor. The Broken Branch offers both a brilliant diagnosis of the cause of Congressional decline and a much-needed blueprint for change, from two experts who understand politics and revere our institutions, but believe that Congress has become deeply dysfunctional.       Mann and Ornstein, two of the nations most renowned and judicious scholars of government and politics, bring to light the historical roots of Congress's current maladies, examining 40 years of uninterrupted Democratic control of the House and the stunning midterm election victory of 1994 that propelled Republicans into the majority in both House and Senate. The byproduct of that long and grueling but ultimately successful Republican campaign, the authors reveal, was a weakened institution bitterly divided between the parties. They highlight the dramatic shift in Congress from a highly decentralized, committee-based institution into a much more regimented one in which party increasingly trumps committee. The resultant changes in the policy process--the demise of regular order, the decline of deliberation, and the weakening of our system of checks and balances--have all compromised the role of Congress in the American Constitutional system. Indeed, Speaker Dennis Hastert has unabashedly stated that his primary responsibility is to pass the president's legislative program--identifying himself more as a lieutenant of the president than a steward of the house.  From tax cuts to the war against Saddam Hussein to a Medicare prescription drug benefit, the legislative process has been bent to serve immediate presidential interests and have often resulted in poorly crafted and stealthily passed laws.  Strong majority leadership in Congress, the authors conclude, led not to a vigorous exertion of congressional authority but to a general passivity in the face of executive power.       A vivid portrait of an institution that has fallen far from the aspirations of our Founding Fathers, The Broken Branch highlights the costs of a malfunctioning Congress to national policymaking, and outlines what must be done to repair the damage.",
        "Category": " Political Science , American Government , Legislative Branch",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Gericault",
        "Authors": "By Gericault, Theodore",
        "Description": "",
        "Category": "",
        "Publisher": "Los Angeles County Museum of Art",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Economy (Israel Pocket Library)",
        "Authors": "By Israel Pocket Librar",
        "Description": "",
        "Category": "",
        "Publisher": "Keter Publishing House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Climbing Vines: Simple Secrets for Glorious Gardens (A Garden Style Book)",
        "Authors": "By Echtermeyer, Faith (PHT) and Luebbermann, Mimi",
        "Description": "Cover a wall or a fence with an elegant, evergreen curtain. Cultivate a trailing garden in a window box. Harvest the fruits of climbing gourds and grapevines. Hardy and flexible, vines are the problem-solvers of the plant world, and this valuable guide suggests abundant ways to both utilize them creatively and show them off. Page after page of easy, practical instructions for choosing and growing vines of every conceivable shape, color, and variety invite even the beginning gardener to enjoy the satisfaction that these rewarding plants can provide.",
        "Category": " Gardening , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The Man Who Used the Universe",
        "Authors": "By Foster Alan",
        "Description": "",
        "Category": "",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1985"
        }
    },
    {
        "Title": "Wonder Boys: A Novel",
        "Authors": "By Chabon, Michael",
        "Description": "Grady Tripp is a pot-smoking middle aged novelist who has stalled on a 2611 page opus titled Wonder Boys. His student James Leer is a troubled young writer obsessed by Hollywood suicides and at work on his own first novel. Grady's bizarre editor Terry Crabtree and another student, Hannah Green, come together in his wildly comic, moving, and finally profound search for an ending to his book and a purpose to his life.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Picador",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Starfire Down (Questar Science Fiction)",
        "Authors": "By McKeone, Lee",
        "Description": "",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "An Unkindness of Ravens",
        "Authors": "By Meaney, Dee",
        "Description": "In a time of struggle between the Vikings and the Saxons, Branwen, a young Saxon lady, tries to discover the secret of her magic powers",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1983"
        }
    },
    {
        "Title": "From My Heart to Yours: Life Lessons on Faith, Family, & Friendship",
        "Authors": "By Mcgraw, Robin",
        "Description": "Gentle peer-to-peer counsel from the heart of Robin McGraw.Whether dealing with our faith, our family, or our friendships, we create the life we long for through the integrity of our choices. In the beautiful gift book, From My Heart to Yours, Robin McGraw shares from her heart, with simple but powerful doses of “life lessons” that will encourage and inspire women from all walks of life. “We are defined not by the station in life into which we are born, nor by our pedigree, but by the choices we make. And it is through the integrity of our choices that we create the life we long for.”Robin’s peer-to-peer advice, presented in beautiful four-color imagery, will help women embrace their feminine selves, to accept nothing less than being their best (no matter what they do), and to proactively choose how they will live rather than take life as it comes along.",
        "Category": " Religion , Christian Living , Women's Interests",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "I Know Many Songs, but I Cannot Sing",
        "Authors": "By Kiteley, Brian",
        "Description": "Brian Kiteley has chosen as backdrop for this mesmerizing tale the ancient city of Cairo. An American known only as Ib encounters an Armenian named Gamal-Leon, who begins to follow Ib as a practical joke one evening toward the end of Ramadan, the period when Muslims fast during the day and feast most of the night.As the two strangers roam the streets in the deepening night, we swim with Ib against a tide of mistranslations, misunderstanding, and rumor, and are submerged with him in a heady, almost hallucinatory experience of foreignness.",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Washington Star Garden Book: The Encyclopedia of Gardening for the Chesapeake & Potomac Region",
        "Authors": "By Deborah Fialka",
        "Description": "",
        "Category": "",
        "Publisher": "Washington Book Trading Co",
        "Price Starting With ($)": "15.33",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "A Swiftly Tilting Planet (The Time Quartet)",
        "Authors": "By L'Engle, Madeleine",
        "Description": "In this companion volume to A Wrinkle In  Time (Newbery Award winner) and  A Wind In The Door fifteen-year-old  Charles Wallace and the unicorn Gaudior undertake a  perilous journey through time in a desperate  attempt to stop the destruction of the world by the  mad dictator Madog Branzillo. They are not alone in  their quest. Charles Wallace's sister, Meg--grown  and expecting her first child, but still able to  enter her brother's thoughts and emotions by  \"kything\"--goes with him in  spirit.But in overcoming the challenges, Charles  Wallace must face the ultimate test of his faith and  will, as he is sent within four people from  another time, there to search for a way to avert the  tragedy threatening them all.  \"L'Engle's  gifts are at their most impressive here.\" --  Publisher's Weekly",
        "Category": "",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "The Working Woman's Guide to Managing Stress",
        "Authors": "By George-Warren, Holly and Powell, J. Robin",
        "Description": "Getting married ... buying a home ... career problems ... receiving a promotion ... having a baby ... all of these events cause stress. And working women - who often need to balance family, motherhood, and a variety of other responsibilities - are faced with even more of life's draining stressors.While you can't always control your world, you can influence your response to it. Here's a practical stress-management guide designed specifically to help working women cope with these stressors and start living a happier and healthier life.The Working Woman's Guide to Managing Stress gives you scores of proven-effective stress-reduction techniques that are fast, simple to do, and easy to integrate into your hectic lifestyle. You'll find dozens of natural treatments for stress-related physical problems including headaches, backaches, neck/shoulder discomfort, fatigue, irritability, and insomnia. You'll also discover how to custom-design your own stress-reduction plan; teach yourself to relax with such methods as Progressive Relaxation, Autogenic Training, Affirmations, and Creative Visualization; use the power of Aerobic Exercise and Body Awareness Techniques to help relieve stress, with tips on finding the right exercise program for your specific needs; avoid on the job burnout and design a comfortable, stress-free work environment; and plan a stress-fighting nutritional program, with weekly menu plans and quick-to-prepare recipes.Plus, you get a special section on Mastering the Work-Home Balance that examines the unique problems confronted by single women, married women with and without children, and single mothers ... as well as easy-to-use worksheets, checklists, and other proven-effective tools.With The Working Woman's Guide to Managing Stress, you'll find hundreds of practical stress-management techniques that are not only easy to do, but also simple to integrate into your busy life.",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Power of Six Sigma",
        "Authors": "By Chowdhury, Subir",
        "Description": "Never before has a business initiative transformed corporations so dramatically. While it has been credited with improving productivity, slashing costs, and improving profit margins, it can cause much angst among employees who need to change the way they currently work and adhere to a new philosophy.  That's where characters Joe and Larry step in to deliver The Power of Six Sigma. This fictionalized tale simplifies a complicated topic through the lives of two typical business professionals. Contrary to other books on the subject, The Power of Six Sigma explains the overall philosophy of Six Sigma effectively in a nonthreatening way, taking no more than two hours to read.",
        "Category": " Business & Economics , Management",
        "Publisher": "Kaplan Business",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "12 Choices... That Lead to Your Success",
        "Authors": "By David Cottrell",
        "Description": "",
        "Category": "",
        "Publisher": "CornerStone Leadership Institute",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Flash, Crash, Rumble, and Roll",
        "Authors": "By branley, franklyn",
        "Description": "",
        "Category": "",
        "Publisher": "Crowell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Green This! Volume 1: Greening Your Cleaning",
        "Authors": "By Imus, Deirdre",
        "Description": "Change the way you clean and keep your family's home wholesome and healthy with the help of expert and activist Deirdre Imus.   We all grew up thinking chemical smells like bleach and ammonia signaled \"clean.\" But as Deirdre Imus reveals, some of the chemicals we use to maintain our homes are doing us and our families much more harm than good. In Greening Your Cleaning, the first in her Green This! series, Deirdre shows how cleaning house the environmentally responsible way can be as effective and often cheaper than the more traditional, toxic, means. This volume includes:    Simple, efficient cleaning methods for every room of the house Spotlights on everyday products (all purpose cleaner, glass/window cleaner, laundry detergent) and the toxic ingredients you should be wary of Summaries of the latest research on the toxic effects of ordinary chemicals Resource lists of widely available \"green cleaning\" products and retailers    Filled with tips and testimonials, Greening Your Cleaning will show you how to streamline your cleaning products and practices, and how easy it is to make \"living green\" your way of life.",
        "Category": " Nature , Ecology",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Birds in the Land of the Bible",
        "Authors": "By Paz, Uri and Eshbol, Yossi (PHT)",
        "Description": "",
        "Category": " Nature , Animals , General",
        "Publisher": "Palphot",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Backlash",
        "Authors": "By Russell, Martin",
        "Description": "Albert Hall awakens his partner Steven Cassell in the dead of night and amazingly reports he thinks he has just killed an attractive woman he met at a concert, and needs Steve's help",
        "Category": " Fiction , General",
        "Publisher": "Walker & Co",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1983"
        }
    },
    {
        "Title": "Have You Felt Like Giving Up Lately?: Finding Hope and Healing When You Feel Discouraged",
        "Authors": "By Wilkerson, David",
        "Description": "Everyone experiences times of sadness, trials, and pain. But what happens when grief and depression seem so overwhelming that we feel like giving up? As the founder of World Challenge, Inc., David Wilkerson worked with troubled people of every type: students, parents, alcoholics, delinquents, businessmen, pastors, teachers, and drug addicts. In this hopeful and encouraging book, Wilkerson examines the universal problem of discouragement. He shows readers how to let God heal their wounds, restore their faith, and give them genuine, lasting peace.",
        "Category": " Religion , Christian Life , Personal Growth",
        "Publisher": "Revell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2012"
        }
    },
    {
        "Title": "Today Matters: 12 Daily Practices to Guarantee Tomorrow's Success (Maxwell, John C.)",
        "Authors": "By Maxwell, John C.",
        "Description": "Most of us look at our days in the wrong way: We exaggerate yesterday. We overestimate tomorrow. We underestimate today. The truth is that the most important day you will ever experience is today.  Today is the key to your success. Maxwell offers 12 decisions and disciplines-he calls it his daily dozen-that can be learned and mastered by any person to achieve success.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Center Street",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Organize or Agonize",
        "Authors": "By Larry Aikens",
        "Description": "",
        "Category": "",
        "Publisher": "",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Never Say Oops! The Complete Do-It-Yourself Guide to Cutting, Perming, and Hair Care",
        "Authors": "By Author Unknown",
        "Description": "",
        "Category": "",
        "Publisher": "K-W Institute of California",
        "Price Starting With ($)": "5.93",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Hello, Calico!",
        "Authors": "By Wilson, Karma and Erdogan, Buket (ILT)",
        "Description": "Meet Calico --   a fluffy, puffy, itty-bitty   kitten who can't wait   to discover the world around her.   Follow Calico as she jumps, climbs,   and frolics her way through   a very adventurous day!",
        "Category": " Juvenile Fiction , Social Themes , New Experience",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Seven Tears for Apollo",
        "Authors": "By Phyllis A. Whitney",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Crest Book",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Ancient Shores",
        "Authors": "By McDevitt, Jack",
        "Description": "It turned up in a North Dakota wheat field: a triangle, like a shark's fin, sticking up from the black loam. Tom Lasker did what any farmer would have done. He dug it up. And discovered a boat, made of a fiberglass-like material with an utterly impossible atomic number. What it was doing buried under a dozen feet of prairie soil two thousand miles from any ocean, no one knew. True, Tom Lasker's wheat field had once been on the shoreline of a great inland sea, but that was a long time ago -- ten thousand years ago.A return to science fiction on a grand scale, reminiscent of the best of Heinlein, Simak, and Clarke, Ancient Shores is the most ambitious and exciting SF triumph of the decade, a bold speculative adventure that does not shrink from the big questions -- and the big answers.",
        "Category": "",
        "Publisher": "Harper Voyager",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Transition",
        "Authors": "By McIntyre, Vonda",
        "Description": "The second novel in the Starfarers series continues the adventures of the crew of the Starfarer spacecraft as they search for alien civilizations while coping with a hidden saboteur. Reissue. LJ.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Spectra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "Helping the Stork: The Choices and Challenges of Donor Insemination",
        "Authors": "By Moss, Robert, Vercollone, Carol Frost, and Moss, Heidi",
        "Description": "Helping the Stork The sourcebook for all the information parents-to-be need to know about the choices and challenges of donor insemination Each year donor insemination (DI) offers a pathway to parenthood for the hundreds of thousands who turn to family-building alternatives. Although DI is considered as often as adoption, couples facing male infertility, as well as single women and lesbian couples, have had few places to turn for information about this method, which has been shrouded in secrecy. In Helping the Stork, parents-to-be, as well as friends and family, doctors, and counselors, can explore the choices and challenges raised by this alternative to overcoming childlessness. This comprehensive handbook moves through each step of the process: reaching a solid decision about whether donor insemination is the best choice for a family's future; handling the difficult issue of privacy; selecting a donor and getting started; and learning to thrive as a family meeting DI's added challenges. Full of wisdom from medical and mental health experts, Helping the Stork is also enriched with stories from many families who share their insights and experiences. This book is a reassuring, supportive, and helpful guide that no one considering or going through the process of donor insemination should be without. Visit us online at http://www.mcp.com/mgr",
        "Category": " Medical , Reproductive Medicine & Technology",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "An Unsuitable Job for a Woman (Cordelia Gray Mysteries, No. 1)",
        "Authors": "By James, P. D.",
        "Description": "An Unsuitable Job for a Woman introduces bestselling mystery author P.D. James’s courageous but vulnerable young detective, Cordelia Gray, in a “top-rated puzzle of peril that holds you all the way” (The New York Times).Handsome Cambridge dropout Mark Callender died hanging by the neck with a faint trace of lipstick on his mouth. When the official verdict is suicide, his wealthy father hires fledgling private investigator Cordelia Gray to find out what led him to self-destruction. What she discovers instead is a twisting trail of secrets and sins, and the strong scent of murder.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Begin It Now",
        "Authors": "By Hayward, Susan",
        "Description": "",
        "Category": " Self-help , Personal Growth , Happiness",
        "Publisher": "In-Tune Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Into Thin Air: A Personal Account of the Mt. Everest Disaster",
        "Authors": "By Krakauer, Jon",
        "Description": "When Jon Krakauer reached the summit of Mt. Everest in the early afternoon of May 10,1996, he hadn't slept in fifty-seven hours and was reeling from the brain-altering effects of oxygen depletion. As he turned to begin the perilous descent from 29,028 feet (roughly the cruising altitude of an Airbus jetliner), twenty other climbers were still pushing doggedly to the top, unaware that the sky had begun to roil with clouds...Into Thin Air is the definitive account of the deadliest season in the history of Everest by the acclaimed Outside journalist and author of the bestselling Into the Wild. Taking the reader step by step from Katmandu to the mountain's deadly pinnacle, Krakauer has his readers shaking on the edge of their seat. Beyond the terrors of this account, however, he also peers deeply into the myth of the world's tallest mountain. What is is about Everest that has compelled so many poeple--including himself--to throw caution to the wind, ignore the concerns of loved ones, and willingly subject themselves to such risk, hardship, and expense? Written with emotional clarity and supported by his unimpeachable reporting, Krakauer's eyewitness account of what happened on the roof of the world is a singular achievement.",
        "Category": " Sports & Recreation , Mountaineering",
        "Publisher": "Anchor",
        "Price Starting With ($)": "129.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "South By Java Head",
        "Authors": "By MacLean, Alistair",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Gold Medal",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1958"
        }
    },
    {
        "Title": "Floodgate",
        "Authors": "By MacLean, Alistair",
        "Description": "When terrorists bomb dikes in an attempt to force Holland's government to prod the British to withdraw from Northern Ireland, Detective Lieutenant Peter van Effen must try to rescue two kidnapped women, as well as foil the terrorists",
        "Category": " Fiction , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Remodeling a Basement: Expert Advice from Start to Finish (Taunton's Build Like a Pro)",
        "Authors": "By German, Roger",
        "Description": "If you're interested in expanding the usable living space in your home —and boosting its value — finishing your basement is a smart way to make it happen. In this new and revised edition of Remodeling a Basement, you'll find a wide range of inspiring design ideas for turning your basement into a comfortable, functional space the whole family can enjoy. From cover to cover, you'll get all the expert advice, inside tips, and step-by-step instructions you'll need to make your vision a reality. All brought to you in clear, accessible language — and lots of valuable photos and drawings — by a consummate professional. In this comprehensive volume—the latest in our popular Build Like A Pro series —professional contractor Roger German takes you through the entire process of remodeling a basement. From family rooms, bathrooms and laundry rooms to workshops and hobby rooms, he shows you how to build a whole new level of comfort into your house. Here's an example of the timely, in-depth information you'll find:Every construction detail is updated to reflect the latest building codeAll the basic construction techniques you'll need are hereNuts and bolts information about wiring, plumbing, windows and doorsBrand new content about egress windowsHow to tackle common basement building challenges, like framing on concrete, evacuating water, and working around heating and plumbing fixturesFor proactive homeowners and contractors alike, this updated reference book is the only resource you'll need to get the job done right the first time.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "All Sevilla",
        "Authors": "By Editorial Escudo de Oro",
        "Description": "",
        "Category": "",
        "Publisher": "Editorial Escudo de Oro",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Our Big, Big God",
        "Authors": "By Graef, Renee (ILT) and Atwood, Jeff",
        "Description": "Who made the birds and the bees, the flowers and the trees, the rivers, mountains, oceans, and the sky?Our Big, Big, Big God made all of these things. Most importantly, he made you! From the tiniest bug to the tallest mountain, the pages get bigger as we realize that God createdand takes care of everything and everybody.That's Big!",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "Little Simon Inspirations",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Unforgettable Things to Do Before You Die",
        "Authors": "By Watkins, Steve and Jones, Clare",
        "Description": "The world's best ways to spend your time.    There are a host of thrilling and exciting things to do in this world. For inspiration and help finding the best, turn to Unforgettable Things to Do Before You Die.     This splendidly illustrated book gives forty amazing locations and experiences. Each can be enjoyed in a regular two-week holiday or less.     International travel writers Steve Watkins and Clare Jones draw on years of experience and select forty personal favorite adventures:   Pony trek through Patagonia   Safari in the Serengeti   Ride an elephant in Chitwan, Nepal   Track spirit bears on Princess Royal Island   Learn warrior skills in Naadom, Mongolia   Taste wine in vineyards in Bordeaux   Walk on            the Great Wall of China   And thirty-three more unforgettable journeys for the adventurous traveler looking for new experiences.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "The Spiderwick Chronicles Movie Storybook",
        "Authors": "By West, Tracey (ADP)",
        "Description": "Looking for a fresh start, Helen Grace and her three kids leave New York City and move into the old, abandoned Spiderwick Estate that great uncle, Arthur Spiderwick, has left her. One day nine-year-old Jared discovers Arthur Spiderwick's Field Guide to the Fantastical World Around You in the upstairs attic, and his life changes forever. Despite the numerous warnings, Jared reads the book, and now he must keep the field guide out of harm's way, or else suffer the consequences. With a house brownie named Thimbletack to help him along, Jared, his twin brother, Simon, and their sister, Mallory, take on a world of fantastical creatures!",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Bay of Pigs: The Untold Story",
        "Authors": "By Peter Wyden",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Happy Hour at Casa Dracula",
        "Authors": "By Acosta, Marta",
        "Description": "Latina Ivy League grad Milagro de Los Santos can't find her place in the world or a man to go with it. Then one night, at a book party for her pretentious ex-boyfriend, she meets an oddly attractive man. After she is bitten while kissing him, she falls ill and is squirreled away to his family's estate to recover. Vampires don't exist in this day and age -- or do they? As Milagro falls for a fabulously inappropriate man, she finds herself caught between a family who has accepted her as one of their own and a shady organization that refuses to let the undead live and love in peace.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    }
]