[
    {
        "Title": "THE GREAT DINOSAUR ATLAS (A Pictorial Guide to the Prehistoric World)",
        "Authors": "By Lindsay, William",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Project Jennifer",
        "Authors": "By Rosenblatt, Jill Amy",
        "Description": "Having the worst week ever due to a woman named Jennifer, plain, uptight, career-challenged Joan Benjamin decides to unleash her own inner Jennifer, a beautiful take-charge woman, which leads to a life-changing transformation. Original.",
        "Category": " Fiction , Women",
        "Publisher": "Kensington Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Thinking Through the Past: A Critical Thinking Approach to U.S. History Since 1865",
        "Authors": "By Hollitz, John",
        "Description": "This reader for the U.S. history survey course contains both primary and secondary sources concerned with motivation, causation, and the role of ideas and economic interests in history. The text's historiographical approach gives students the opportunity to strengthen their critical-thinking skills through the comparison of historical sources. Each chapter includes an introduction to the historical problem, information on the setting and the investigation, questions to consider, sources, and a conclusion.",
        "Category": " History , General",
        "Publisher": "Houghton Mifflin College Div",
        "Price Starting With ($)": "7.57",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Better Homes and Gardens Bulbs for All Seasons",
        "Authors": "By Better Homes & Gardens",
        "Description": "Offers advice on planting bulb gardens, describes varieties of sping, summer, and fall bulbs, and explains how to force bulbs",
        "Category": " Gardening , Flowers , Bulbs",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Debt Cures \"\"They\"\" Don't Want You to Know About",
        "Authors": "By Trudeau, Kevin",
        "Description": "Are YOU getting deeper and deeper into debt while THEY make bigger and bigger profits? Not after you read...Debt Cures \"They\" Don't Want You to Know About!In this new book, Kevin Trudeau blows the lid off the banking and credit card industries, exposing the greatest rip off of our citizens in this nation's history. The credit card industry is one of the most profitable industries in this country, but they don't want you to know it. You can fight back! You can apply Kevin's solutions to your debt problems and keep more money in your pocket today. You can learn how to use credit to build wealth! Read Debt Cures and cure your debt forever.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Vanguard Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Building Your Child's Faith",
        "Authors": "By Chapin, Alice",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Bold Commitment",
        "Authors": "By Evans, Louis Evans Colleen",
        "Description": "",
        "Category": "",
        "Publisher": "Cook, David C.",
        "Price Starting With ($)": "7.27",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "What to Do After You Turn Off the TV",
        "Authors": "By Lappe, Frances Moore",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "Marketing Magic: Innovative and Proven Ideas for Finding Customers, Making Sales, and Growing Your Business (An Adams Business Advisor)",
        "Authors": "By Debelak, Don",
        "Description": "Tells how to determine the right product and right market, create a product advantage, find new customers, and make the sale",
        "Category": "",
        "Publisher": "Adams Media Corp",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "The London Eye Mystery",
        "Authors": "By Dowd, Siobhan",
        "Description": "A five-star mystery now in paperback!Ted and Kat watched their cousin Salim board the London Eye, but after half an hour it landed and everyone trooped off—except Salim. Where could he have gone? How on earth could he have disappeared into thin air? Ted and his older sister, Kat, become sleuthing partners, since the police are having no luck. Despite their prickly relationship, they overcome their differences to follow a trail of clues across London in a desperate bid to find their cousin. And ultimately it comes down to Ted, whose brain works in its own very unique way, to find the key to the mystery. This is an unput-downable spine-tingling thriller—a race against time.★ “Everything rings true here, the family relationships, the quirky connections of Ted’s mental circuitry, and, perhaps most surprising, the mystery.”—Booklist, Starred★ “The best mysteries have at their centers gifted but very human sleuths—their abilities balanced by equally significant flaws or idiosyncrasies. This one is no exception.”—The Horn Book Magazine, Starred",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "ALL POSSIBLE WARS? TOWARD A CONSENSUS VIEW OF THE FUTURE SECURITY ENVIRONMENT 2001-2025 McNair Paper 63",
        "Authors": "By Tangredi, Sam J.",
        "Description": "",
        "Category": "",
        "Publisher": "Institute For National Strategic Studies/National Defense University",
        "Price Starting With ($)": "10.49",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Geocaching, 2nd Edition",
        "Authors": "By Geocaching. com (EDT)",
        "Description": "The ultimate global game revealed! The Complete Idiot's Guide(r) to Geocaching, Second Edition is a comprehensive, yet entertaining and easy-to-understand book for getting started and having fun with geocaching-the high-tech version of hide-and-seek for global positioning system (GPS) users. In this edition, two new tools of the game-Waymarking and Wherigo-are included. ? The Geocaching website, which began operating in 2000 and is owned by Groundspeak, Inc., is the first and currently the largest website devoted to Geocaching ? Today, well over 800,000 geocaches are registered on various websites devoted to the pastime ? Geocaches are currently placed in over 100 countries around the world and on all seven continents, including Antarctica",
        "Category": " Sports & Recreation , Extreme Sports",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Williams-Sonoma The Best of the Kitchen Library: Meats & Poultry",
        "Authors": "By Williams, Chuck (EDT) and Rosenberg, Allan (PHT)",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Poultry",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Essential Swedish Grammar (Dover Language Guides Essential Grammar)",
        "Authors": "By Granberry, Julian",
        "Description": "Designed for those with limited learning time, this book is not a condensed outline of all aspects of Swedish grammar. Rather, it focuses on simple everyday communication, helping students use previously learned phrases and vocabulary more effectively and with great versatility.After introductory discussions of vocabulary building, word order and the formation of negative sentences and questions, the author offers concise, easy-to-follow coverage of the parts of speech. Numerous examples are included to demonstrate each rule of grammatical usage with the emphasis throughout on simple constructions rather than complicated ones. A selection of useful expressions and a glossary of grammatical terms round out this excellent, inexpensive guide, perfect for self-study or as an adjunct to a language course.Whether you are just beginning the study of Swedish or wish to review the fundamentals, Essential Swedish Grammar enables you to learn in a systematic way, at your own rate, guided by your own requirements and interests.",
        "Category": " Foreign Language Study , Scandinavian Languages (Other)",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "By the Time You Read This",
        "Authors": "By Jaye, Lola",
        "Description": "Already a national bestseller in the U.K., Lola Jaye’s By the Time You Read This is a profoundly beautiful story of a father’s abiding love for the daughter he will never see grow up—and his determination to help guide her through the difficult crossroads and crises of her life even after his own passing. Poignant and unforgettable, evoking in part The Pursuit of Happyness and The Last Lecture, By the Time You Read This celebrates a remarkable bond of love that can never be broken, not even by death.",
        "Category": " Fiction , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "A Concise History of China",
        "Authors": "By Roberts, J. A. G.",
        "Description": "The centuries-long complexity of China's political experience, the richness of its culture, and the drama of its economic unfolding are the hallmarks of this short but sweeping history. China's own history is entwined with its response to the West in a rich tapestry depicting its peoples, rulers, and society. More than a nuanced history of a vast continent, this study is sensitive to the multifaceted and changing interpretations of China that have been offered over the years. In this overarching book, J. A. G. Roberts refers to recent archeological finds--the caches of bronze vessels found at Sanxingdui--and to new documentary reevaluations--the reassessment of Manchu documentation. The first half of the book provides an up-to-date interpretation of China's early and imperial history, while the second half concentrates on the modern period and provides an interpretive account of major developments--the impact of Western imperialism, the rise of Chinese Communism, and the record of the People's Republic of China since 1949.Concise and direct, this book is a compelling narrative and handy companion for those interested in China.",
        "Category": " History , Asia , China",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "The Book of Love",
        "Authors": "By Kingma, Daphne Rose and Ryan, M. J. (FRW)",
        "Description": "A series of short essays about love invites readers to shed their inhibitions and reservations so they can enjoy romance and intimacy more fully. By the author of A Lifetime of Love. 25,000 first printing.",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Conari Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Brain Candy: Science, Paradoxes, Puzzles, Logic, and Illogic to Nourish Your Neurons",
        "Authors": "By Sundem, Garth",
        "Description": "Feed Your Brain   Tastier than a twizzler yet more protein-packed than a spinach smoothie, Brain Candy is guaranteed to entertain your brain—even as it reveals hundreds of secrets behind what’s driving that electric noodle inside your skull.     These delicious and nutritious pages are packed with bits of bite-sized goodness swiped from the bleeding edge of brain science (including the reason why reading these words is changing your hippocampus at this very moment!) Shelved alongside these succulent neurological nuggets are challenging puzzles and paradoxes, eye-opening perception tests and hacks, fiendish personality quizzes and genius testers, and a grab bag of recurring treats including Eye Hacks, Algebraic Eight Ball, iDread, Wild Kingdom, and Logic of Illogic.      Should you look between these covers and inhale the deliciously cherry-flavored scents of knowledge within, you will grow your grey matter while discovering:   • Why you should be writing bad poetry• The simple keys to brain training• What trust smells like  • The origins of human morality• Why expensive wine always tastes better• The truth about brain sweat • How your diet might be making you dumb• The secrets of game theory• Why economists hate psychology • The mental benefits of coffee and cigarettes • How to really spot a liar• Why you can’t make me eat pie• The benefits of daydreaming • Four simple secrets to persuasion• Why your barin’s fzzuy ligoc alowls you to raed this• How to brainwash friends and family• The science of body language• What pigeons know about art   …And much, much more.",
        "Category": " Games & Activities , Puzzles",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "How to Get the Most Out of Trade Shows",
        "Authors": "By Miller, Steve",
        "Description": "Proper planning and effective management of your trade show presence are the keys to trade shows uccess for every business.  Loaded with real-lifeexamples and brimming with practical guidance on how top Ian and execute a trade show marketing effort, How to Get the Most Out of Trade Shows includes expert advice on:   Selecting the right trade shows to attend Setting show objectives Designing effective booth displays Attracting prospects to your booth SelIing on the floor Following upon leads   Plus, this new edition offers powerful information on the importance of effective promotion both before and at the show, tips on how to develop promotions and where to get promotional ideas, and lots of examples of successful promotions conducted by a wide array of companies. You'll also find coverageof relationship buildingwith new clients and booth etiquette.  Let How to Get the Most Out of Trade Shows teach you how to maximize your company's return on a trade show investment.   Steve Miller has advised, consulted, and trained associations, trade show management companies, and corporations all over the world for nearly three decades. The principal of The Adventure of the Trade Shows, he offers his clients consulting services, seminars, and keynote speeches as well as educational products. He resides in Federal Way, Washington.",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "Ntc Business Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Thin Is the New Happy: A Memoir",
        "Authors": "By Frankel, Valerie",
        "Description": "You've heard the phrase \"the mirror is not your friend.\" For Valerie Frankel, the mirror was so much more than \"not a friend.\" It was the mean girl who stole her lunch money, bitch-slapped her in the ladies' room, and cut the hair off her Barbie.             Like most women, Valerie spent most of her conscious life on a diet, thinking about a diet, ignoring a diet, or failing on a diet. At age eleven, her mother put Val on her first weight-loss program. As a teen, she was enrolled in Weight Watchers (for which she invented creative ditching methods). As a young woman, her world felt right only when she was able to zip a certain pair of jeans. Not wanting to pass this legacy on to her own daughters, Valerie set out to cleanse herself of her obsession. Thin Is the New Happy is the true story of one woman's quest to exorcise her bad body-image demons, to uncover the truths behind what put them there, and to learn how to truly love herself.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Why It's Great to Be a Girl: 50 Things You Can Tell Your Daughter to Increase Her Pride in Being Female",
        "Authors": "By Shannon, Jacqueline",
        "Description": "",
        "Category": " Family & Relationships , General",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Les Misérables: A Novel",
        "Authors": "By Hugo, Victor",
        "Description": "Few novels ever swept across the world with such overpowering impact as Les Misérables. Within 24 hours, the first Paris edition was sold out. In other great cities of the world it was devoured with equal relish.Sensational, dramatic, packed with rich excitement and filled with the sweep and violence of human passions, Les Misérables is not only superb adventure but a powerful social document. The story of how the convict Jean-Valjean struggled to escape his past and reaffirm his humanity, in a world brutalized by poverty and ignorance, became the gospel of the poor and the oppressed.",
        "Category": " Fiction , Classics",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1982"
        }
    },
    {
        "Title": "Tell The Truth, Tyler! (Happy Day Books)",
        "Authors": "By Ring, Laura (EDT) and McConnaughhay, Jodee (EDT)",
        "Description": "",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Standard Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Diego's Safari Rescue (Go Diego Go!)",
        "Authors": "By Villalobos, Ligiah (ADP) and Maher, Alex (ILT)",
        "Description": "Diego is headed to Africa for a safari! But someone has turned all the elephants into rocks! Join Diego on an exciting safari rescue mission as he saves the elephants and meets all kinds of other animals along the way.",
        "Category": " Juvenile Fiction , Interactive Adventures",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Wills and Estates",
        "Authors": "By Maple, Stephen M.",
        "Description": "",
        "Category": "",
        "Publisher": "Alpha Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Homer Book: The Simpsons Library of Wisdom",
        "Authors": "By Groening, Matt (EDT), Delegeane, Terry (EDT), and Morrison, Bill (EDT)",
        "Description": "In a collection of philosophical musings, Homer Simpson shares quips, diatribes, insults, dialogues, and quotes on such topics as religion, modern life, humankind's role in the universe, health, and other topics both sacred and profane. Original. 100,000 first printing.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Teaching Your Child the Language of Social Success",
        "Authors": "By Nowicki, Stephen, Duke, Marshall P., Martin, Elisabeth A., and Holifield, Vicky (ILT)",
        "Description": "Help your child master the language of nonverbal communication.Do you know what nonverbal language is? Even if you can’t define it, you speak it every day through your postures, gestures, facial expressions, and tone of voice, and you must constantly read these same signals from others. In fact, nonverbal messages can carry up to 90% of the meaning of human interaction and contribute significantly to social, academic, and professional success.Yet even though we recognize the importance of nonverbal communication, we have generally left the teaching of this essential language to chance. Now parents and teachers can help children develop nonverbal skills so that they will be able to communicate more effectively and to interact with others more successfully.In Teaching Your Child the Language of Social Success, clinical psychologists Marshall Duke and Stephen Nowicki and educator Elixabeth Martin describe and explain the methods and rules of nonverbal communication. Together they have created an easy-to-use guide which offers definitions and techniques for assessing a child’s strengths and weaknesses in this unspoken realm, as well as case studies, illustrations, and exercises for teaching or improving nonverbal skills at home or in the classroom.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Peachtree",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Bed and Breakfast Guide: East Coast : New England and the Mid-Atlantic",
        "Authors": "By Black, Naomi, Berger, Terry, and Gardner, Roberta Homan",
        "Description": "",
        "Category": " Travel , Food, Lodging & Transportation , Bed & Breakfast",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "14.44",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Joy of Cooking: All About Vegetarian Cooking",
        "Authors": "By Rombauer, Irma von Starkloff, Becker, Marion Rombauer, Becker, Ethan, Tucker (PHT), and Hossler (PHT)",
        "Description": "The book that taught America how to cook, now illustrated with glorious color photographyALL ABOUTVEGETARIAN COOKINGA fresh and original way to put the classic advice of Joy of Cooking to work -- illustrated and designed in a beautiful and easy-to-use new book.     Organized by subject, including stocks and soups, salads, beans and tofu, pasta and grains, and more     More than 100 of Joy's recipes, including Grilled Ratatouille Salad, Tuscan-Style Stuffed Artichokes, and Winter Root Vegetable Braise     Invaluable tips and techniques for buying, storing, and preparing vegetablesSixty years after Irma Rombauer advised new cooks to \"Stand facing the stove,\" America's love affair with Joy of Cooking continues unabated. And why not? Joy in hand, tens of millions of people -- from novices to professionals -- have learned to do everything from make a meat loaf to clean a squid to frost a wedding cake. For decades, Joy of Cooking has taught America how to cook, serving as the standard against which all other cookbooks are judged.All About Vegetarian Cooking upholds that standard. While keeping the conversational and instructional manner of the flagship book, All About Vegetarian Cooking is organized by ingredient and type of dish. Chapters include stocks and soups, salads, vegetables, beans and tofu, pastas and grains, and eggs, and incorporate more than 100 of Joy's bestloved vegetarian recipes, from Roasted Vegetable Lasagne to Greek Spinach and Cheese Pie. You'll also find information on nutrition for vegetarians, planning menus, and rules for serving sizes, as well as tips and techniques for buying, storing, and preparing fresh vegetables. Add to that more than 150 original photographs, specially commissioned for this volume, presented in the most easy-to-use design imaginable.Whether you belong to one of the millions of American households that already own a copy (or two) of Joy, or you have never cracked the spine of a cookbook before, Joy of Cooking: All About Vegetarian Cooking is for you. It is a spectacular achievement, worthy of its name. Joy has never been more beautiful.The Indispensable Kitchen Resource...All-New, All-Purpose, and now All-in-Color",
        "Category": " Cooking , Vegetarian",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Night Awakens: A Mystery Writers of America Anthology",
        "Authors": "By Clark, Mary Higgins (EDT)",
        "Description": "The crowned Queen of Suspense, #1 New York Times bestselling author Mary Higgins Clark, has no peer in the realm of stylish, sophisticated thrillers -- brilliant, breathtaking tales that delve into the deepest affairs of the heart, the darkest crimes of passion. Now, in that same haunting tradition, she invites a star-studded cast of authors to share original stories of men and women joined in love...and driven to murder.  Sara Shankman puts a chilling new spin on payback...Joseph Hansen slaps a rancher with a cold wake-up call out on the trail...Loren D. Estleman cuts a honeymoon short when a bride learns she's married to the mob...Brendan DuBois drives a brother to distractionon the road to revenge...Sally Gunning pushes jealousy to a murderous extreme...Nancy Pickard exposes the truth behind the headlines as a young love leads to old-fashioned homicide...and a panoply of other renouned writers spellbind us with the seductive charms of love, lust, and other lethal attractions.",
        "Category": " Fiction , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Life 101 , Basics for Life",
        "Authors": "By Colleen L. Reece and Julie Reece",
        "Description": "",
        "Category": "",
        "Publisher": "Barbour Publishing, Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Things Might Go Right: Prospects for Peace and a Better Life in an Age of Globalization and Specialization",
        "Authors": "By Davison, W. Phillips and Davison, Phillips W.",
        "Description": "",
        "Category": " Social Science , Discrimination & Race Relations",
        "Publisher": "iUniverse, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "More: Population, Nature, and What Women Want",
        "Authors": "By Engelman, Robert",
        "Description": "In the capital of Ghana, a teenager nicknamed “Condom Sister” trolls the streets to educate other young people about contraception. Her work and her own aspirations point to a remarkable shift not only in the West African nation, where just a few decades ago women had nearly seven children on average, but around the globe. While world population continues to grow, family size keeps dropping in countries as diverse as Switzerland and South Africa. The phenomenon has some lamenting the imminent extinction of humanity, while others warn that our numbers will soon outgrow the planet’s resources. Robert Engelman offers a decidedly different vision—one that celebrates women’s widespread desire for smaller families. Mothers aren’t seeking more children, he argues, but more for their children. If they’re able to realize their intentions, we just might suffer less climate change, hunger, and disease, not to mention sky-high housing costs and infuriating traffic jams. In More, Engelman shows that this three-way dance between population, women’s autonomy, and the natural world is as old as humanity itself. He traces pivotal developments in our history that set population—and society—on its current trajectory, from hominids’ first steps on two feet to the persecution of “witches” in Europe to the creation of modern contraception. Both personal and sweeping, More explores how population growth has shaped modern civilization—and humanity as we know it. The result is a mind-stretching exploration of parenthood, sex, and culture through the ages. Yet for all its fascinating historical detail, More is primarily about the choices we face today. Whether society supports women to have children when and only when they choose to will not only shape their lives, but the world all our children will inherit.",
        "Category": " Nature , Ecology",
        "Publisher": "Island Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Our Own Worst Enemy: Asking the Right Questions About Security to Protect You, Your Family, and America",
        "Authors": "By Larsen, Randall J.",
        "Description": "OUR OWN WORST ENEMY provides a solid, practical, logical approach to personal security for all Americans and explains why the government is not prepared to help us in a time of crisis (Katrina, 9/11, etc.).  Leading homeland security expert Randall J. Larsen details what we must do as citizens to protect ourselves, our families and our assets.  The key, Larsen argues, is finally asking the right questions about homeland security, such as:-\"How do we prevent a terrorist organization from becoming a nuclear power?\"  The media frequently poses the question: \"What can we do to ensure that al Qaeda does not smuggle a nuclear weapon into the U.S. through one of our ports?\"  But the right question should focus on prevention -- and the answer is far different from the discussion that dominates the debate and the spending priorities of the Bush Administration and Congress.-\"Who should be in charge of logistics during a major disaster?\"  Larsen says that it's not the military. The fact is, no one is better at logistics than American businesses such as FedEx, UPS, and Target.  OUR OWN WORST ENEMY states that the government should encourage citizens and businesses to be active and learn to \"posse up\" while looking to the private sector to provide food, water, shelter, and transportation during a natural or man-made crisis.Larsen offers a strong combination of practical advice (Did you know a $1 mask can save your life in the event of a dirty bomb?) and wise examination of such key issues as the economy, borders and immigration, national health care, personal security, and more.",
        "Category": " Political Science , American Government , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Civil War Ghosts and Legends",
        "Authors": "By Roberts, Nancy",
        "Description": "The countless horrible deaths and bloody strife of the Civil War have always haunted America--as these eerie stories reveal, and sometimes literally. The turbulence of that era has left us with extraordinary tales that serve as a reminder of the heroism displayed and the torture endured by the soldiers of both sides. A man from Harper's Ferry, bearing a striking resemblance to John Brown, is often asked to pose for photographs; but his image never appears when they are developed. The ghost of a murdered captain appears before his colonel and reveals who did the killing. A reenactment of J. E. B. Stuart's famous ride becomes a frightening reality as one man witnesses his great grandfather's fall in battle a hundred years prior. These, and other legends, uniquely blend suspense, mystery, and history.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Why Didn't Noah Swat Both Mosquitoes?",
        "Authors": "By Rupert, Hoover",
        "Description": "",
        "Category": " Religion , Sermons , General",
        "Publisher": "CSS Publishing Company",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "BLA BLA 600 Incredibly Useless Facts: Something to Talk About When You Have Nothing Else To Say",
        "Authors": "By NICOTEXT",
        "Description": "",
        "Category": " Humor , Form , Essays",
        "Publisher": "Nicotext",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2015"
        }
    },
    {
        "Title": "The Fortune Encyclopedia of Economics",
        "Authors": "By Henderson, David R. (EDT)",
        "Description": "The science of economics is as fascinating complex, and diverse as the human animal from which it arises - and economic history, theories, and practices touch every aspect of our existence. The Fortune Encyclopedia of Economics, the only work of its kind, lifts the veil of mystery from economics and takes you on a user-friendly journey through this fascinating and important field.Respected economist David R. Henderson has brought together the most brilliant minds in economics, including Nobel Prize winners, scholars, presidential advisors, and financial columnists. Each expert addresses issues within his or her field in essays that are colorful as well as instructive.Chapters range from \"Basic Concepts\" to \"Economic Regulation\" and \"Corporations and Financial Markets.\" Within each chapter are alphabetically arranged topics such as advertising, benefit-cost analysis, federal deficit, entrepreneurship, inflation, junk bonds, property rights, rent control, and electric utility regulation. Essays are cross-referenced to other relevant chapters. In addition, an extensive biographical section has detailed profiles of the men and women who shaped economic thinking throughout history.From Thomas W. Hazlett's review of apartheid to Gerald W. Scully's discussion of the special market of sports, from a lucid description of protectionism to an explanation of what moves stock prices the more than 150 topics are surprising in their range and broad relevance. And from the theories of John Maynard Keynes to current controversies about Clinton's economics, the issues examined in this book will both answer specific questions quickly and provide a lifetime of rewarding reading.",
        "Category": " Business & Economics , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "7.41",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Beware False Profits (Ministry is Murder Mystery)",
        "Authors": "By Richards, Emilie",
        "Description": "There's no rest for the weary Aggie Sloan-Wilcox and her minister husband, who were praying for a relaxing weekend until a member of their flock went missing.  Joe Wagner, president of Emerald Springs's food bank, disappears, and Aggie discovers his secret life-as a female impersonator. Meanwhile, the murder of the mayor's wife at the annual food bank fundraiser puts Joe on top of the suspect list. If Aggie doesn't get to the bottom of things fast, she'll be leading a choir singing the blues.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Abarat: Days of Magic, Nights of War",
        "Authors": "By Barker, Clive",
        "Description": "Candy Quackenbush's adventures in the Abarat are getting stranger by the hour. Why has the Lord of Midnight sent his henchman after her? Why can she suddenly speak words of magic? Why is the world familiar?Candy and her companions must solve the mystery of her past before the forces of Night and Day clash and Absolute Midnight descends upon the islands. A final war is about to begin. . . .",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Harpercollins Childrens Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Der Payatz: Around the World with Yiddish Theater",
        "Authors": "By Yablokoff, Herman",
        "Description": "Herman Yablokoff was a master of his craft. He was an actor, singer, songwriter, playwright, director and producer in a world that has virtually disappeared. In Der Payatz, his autobiography, Yablokoff the showman stages a vivid recreation of his times. The result is breathtaking and captivating as Yablokoff, with genuine theatrical style offers the story of his life. He introduces himself in 1960. In Warsaw, Poland for a concert tour, Yablokoff attempts to enter the Soviet Union to visit his father's grave. He then relates the story of growing up in Grondo early in this century. With fascinating detail he reconstructs the vibrant Jewish life of the city. The synagogues, schools, people and his family's struggle for existence all come to life again. Yablokoff's love for the theater began at an early age as he became acquainted with the visiting Yiddish troupes that came to town. He soon began to perform in children's roles. Restricted from performing in Yiddish, these groups would deliver their lines in that language until warned by a lookout to revert to Russian. After a stint in the Polish Army, as a musician, Yablokoff, still a teenager, joined a group of Yiddish performers traveling in Lithuania. In 1924, he arrived in America. Immigration had recently been restricted. On Ellis Island, officials, amazed at his youth, greeted with skepticism his claim that he was an accomplished actor. Remarkably, a board of inquiry invited him to audition and his performance was awarded with entrance to the United States. He toured with stock companies in the U.S. and Canda and struggled to gain entrance to the tightly controlled Hebrew Actors Union. Herman Yablokoff was not an instant success, but he eventually began his climb to the top of his profession. Songs like \"Papirossen\" became international standards. Another of his well-known Yiddish melodies, \"Shveig Mein Hartz\" was plagiarized into the popular hit \"Nature Boy.\" And Yablokoff went on the radio, known only as the mysterious \"Der Payatz\" -- the Clown. His original compositions and unique story telling in song became widely popular and proved to be the turning point in his career. Soon he was not only starring, but producing, directing and writing his own shows, showcasing Yiddish performers such as Aaron Lebedeff, Maurice Schwartz and Menasha Skulnik. In 1947, in the midst of a hectic schedule, he sought and obtained permission to entertain the remnants of European Jewry, still in the \"Displaced Persons\" camps. For months he traveled from camp to camp offering a song, some laughter and tears, to lighten the hearts of those who had suffered so much. He considered it the most gratifying experience of his life. It was in one of the camps that he discovered his niece, Dora, the only survivor of his family in Grodno. Yablokoff's travels continued to take him around the world, wherever Jews were found. He entertained in South America, Israel, Scandinavia, even in Cuba. All the lush details of these places, the sights, sounds and people are here to savor. Originally published in Yiddish, Der Payatz was translated by Bella Mysell, Yablokoff's wife and herself a star of the Yiddish stage. They were a popular team for many years. Herman Yablokoff died in 1981, and the Yiddish culture in which he thrived had already largely vanished. But he leaves an enduring look at that culture. The master showman captures all the drama and excitement of the world in which he lived, giving us a riveting picture of a time that no longer exists. So have a seat, turn the page, the curtain is going up on another Yablokoff production.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Bartleby Press",
        "Price Starting With ($)": "18.77",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Gates of Dawn: Volume II of the Chronicles of Blood and Stone",
        "Authors": "By Newcomb, Robert",
        "Description": "Epic fantasy found an exhilarating new voice in Robert Newcomb, whose monumental   debut novel, The Fifth Sorceress, was hailed by readers and critics alike. And now,   for all those spellbound by the tale of Prince Tristan, heir to the throne of Eutracia,   his twin sister Princess Shailiha, the ancient wizard Wigg, and the fate of their   enchanted land, there is indeed more—much more—to be told. . . . For three centuries, Eutracia was a kingdom at peace, ruled by a benevolent monarchy   and guided by a council of wizards. But a horror from the past, long believed vanquished,   returned with devastating fury. And when the battle against the bloodthirsty Sorceresses   of the Coven was finally won, victory was not without its price. Now, the royal palace   lies in ruins; the king and queen, the royal guard, and the Directorate of Wizards   are dead; the land is lawless; and Prince Tristan— forced by the Coven to murder   his father, the King—is a wanted man. In a cavernous underground labyrinth, once   headquarters of the wizards’ council, Tristan has taken refuge with his sister, Shailiha,   her infant daughter, the wizard Wigg—the lone surviving member of the Directorate—and   the crippled wizard Faegan, returned from self-imposed exile in the forest of Shadowood.   Together they face the daunting task of restoring order to Eutracia and winning back   the allegiance of her subjects. But suddenly, even these challenges pale beside a   truly terrifying turn of events. The sacred jewel that is the source of all magic   has inexplicably begun to lose its power. Without its age-old enchantment to sustain   their spells, the immortal wizards will perish . . . and magic will vanish from Eutracia   forever. At the same time, a mysterious and ruthless mercenary has declared a bounty   upon the head of Prince Tristan. And an army of wizards on a mission to rid Eutracia   of monsters created by the Coven has fallen prey to an insidious breed of creatures—beings   that can only have sprung from forbidden use of malevolent magic. With time and their   powers dwindling, Wigg and Faegan desperately seek to discover who, or what, has   succeeded the dead Sorceresses in laying siege to Eutracia. But when the shocking   truth is revealed, and an evil that transcends life itself is made known, it is Tristan,   more than any other, who will be stunned to his very soul. And it is Tristan who   will be thrust into the ultimate battle—for his life, his land, and the course of   his destiny.",
        "Category": " Fiction , Fantasy , Historical",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Designing and Planning Bedrooms: Lighting, Furnishing, and Decorating Bedrooms for the Whole Family",
        "Authors": "By Bedrooms",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "Creative Homeowner Pr",
        "Price Starting With ($)": "5.77",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Gardener to Gardener Almanac & Pest Control Primer: A Month-by-Month Journal for Planning, Planting, and Tending Your Organic Garden (Rodale Organic Gardening Book)",
        "Authors": "By Bradley, Fern Marshall (EDT) and Mattern, Vicki (EDT)",
        "Description": "Combining the intimacy of journal writing with the fact-filled acumen of an almanac, this unique guide to fighting off pests in the garden arms readers with everything they will need to grown lush, beautiful plants in any season. Original. 15,000 first printging.",
        "Category": " Gardening , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Gospel Hour",
        "Authors": "By Pearson, T. R.",
        "Description": "When Donnie Huff survives a fatal logging accident, his ambitious mother-in-law insists that he has returned from the dead, and he embarks on a Pentecostal revival trail and a discovery of his own faith",
        "Category": " Fiction , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "The Chocolate Cookbook (Little Kitchen Collection)",
        "Authors": "By Lousada, Patricia and Adams, Aislinn (ILT)",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Chocolate",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Masters of Fantasy",
        "Authors": "By Greenberg, Martin Harry (EDT) and Carr, Terry",
        "Description": "Gathers stories by H.P. Lovecraft, Ray Bradbury, James Blish, Joanna Russ, Fritz Leiber, Shirley Jackson, Zenna Henderson, and Robert Bloch",
        "Category": " Fiction , General",
        "Publisher": "Galahad Books",
        "Price Starting With ($)": "9.38",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Peter Piper and Other Busy-Time Rhymes",
        "Authors": "By X",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "7.63",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Ramu and Chennai, brothers of the wild",
        "Authors": "By Fox, Michael W.",
        "Description": "",
        "Category": "",
        "Publisher": "Coward, McCann & Geoghegan",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Divine Madness",
        "Authors": "By Jackson, Melanie",
        "Description": "When her immortal life is threatened by the Dark Man, Seraphina Sandoval is guided by fate to a sensual vampire whose past is stranger than her own. Original.",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Love Spell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Travels With Gannon and Wyatt: Botswana",
        "Authors": "By Wheeler, Patti and Hemstreet, Keith",
        "Description": "the first book in an exciting new travel adventure series for children, will be released nationwide on Tuesday, June 1, 2010. The novel follows twin brothers Gannon and Wyatt, who arrive in Botswana for an African safari and get much more adventure than they bargained for when they set off into the wild in the hopes of saving a lioness and her cubs from a poacher. While on this journey, they encounter all of Africa’s Big Five—elephants, rhinos, Cape buffaloes, leopards and lions—only to discover that the most dangerous predator in the African bush is not the king of beasts, but man himself.",
        "Category": " Young Adult Fiction , Interactive Adventures",
        "Publisher": "Claim Stake Pub Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Everything Feng Shui Book (Everything Series)",
        "Authors": "By Jones, Katina Z.",
        "Description": "",
        "Category": " Body, Mind & Spirit , Parapsychology , General",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Un Long Dimanche De Fiançailles (French Edition)",
        "Authors": "By Japrisot, Sebastien",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Assimil Gmbh",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Scuttle's last flight (The Little Mermaid's treasure chest)",
        "Authors": "By Walt Disney Productions Staff",
        "Description": "",
        "Category": "",
        "Publisher": "Disney Books by Mail",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Five Centuries of Music in Venice",
        "Authors": "By Norwich, John Julius and Landon, H. C. Robbins",
        "Description": "Music pervades the soul of Venice as surely as its canals penetrate the heart of the city. From Gabrieli, Monteverdi, Vivaldi, and Rossini to Verdi, Wagner, and Stravinsky, this great city has inspired and sheltered genius. Venice is a city in which music has accompanied every aspect of life, from religious and state ceremony to late-night revelry. This lavishly illustrated book examines the unique relationships between the life of Venice and the history of music.",
        "Category": " Music , History & Criticism",
        "Publisher": "Schirmer Trade Books",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Williams Sonoma Kitchen Companion : The A to Z Guide to Everyday Cooking, Equipment, and Ingredients",
        "Authors": "By Williams, Chuck (EDT), Goodbody, Mary, Miller, Carolyn, Tran, Thy, and Harth, Alice (ILT)",
        "Description": "Arranged alphabetically to provide guidance when buying, preparing, and making substitutions for ingredients and cooking tools; explains ingredient and equipment terms; and provides illustrated instructions for cooking techniques.",
        "Category": "",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Dictionary of the American Indian",
        "Authors": "By Stoutenburgh, John",
        "Description": "An alphabetical listing of basic information on the people, places, and ideas relevant to an understanding of Native American heritage",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Mandie and the Abandoned Mine (Mandie, Book 8)",
        "Authors": "By Leppard, Lois Gladys",
        "Description": "Mandie and her friend Joe find a mystery at her Uncle John's old mine at Rose Creek, as Mandie continues to develop her Christian faith",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "JavaServer Pages, 3rd Edition",
        "Authors": "By Bergsten, Hans",
        "Description": "JavaServer Pages (JSP) has built a huge following since the release of JSP 1.0 in 1999, providing Enterprise Java developers with a flexible tool for the development of dynamic web sites and web applications. While new point releases over the years, along with the introduction of the JSP Standard Tag Library (JSTL), have incrementally improved the rough areas of the first version of the JSP specification, JSP 2.0 takes this technology to new heights.JavaServer Pages, Third Edition, is completely revised and updated to cover the JSP 2.0 and JSTL 1.1 specifications. It includes detailed coverage of the Expression Language (EL) incorporated into JSP 2.0, the JSTL 1.1 tag libraries and the new function library, the new tag file format that enables custom tag library development without Java code, the simplified Java tag library API, improvements in the JSP XML syntax, and more. Further, it details setup of the Apache Tomcat server, JSP and JSTL syntax and features, error handling and debugging, authentication and personalization, database access, XML processing, and internationalization.This book recognizes the different needs of the two groups of professionals who want to learn JSP: page authors interested in using JSP elements in web pages, and programmers concerned with learning the JSP API and using JSP effectively as a part of an enterprise application. If you're in the first group, you'll learn from the practical web application examples in the second part of the book. If you're in the latter group, you'll appreciate the detailed coverage of advanced topics in the third part, such as how to integrate servlets and JavaBeans components with JSP using the popular Apache Struts MVC framework, and how to develop custom tag libraries using the JSP API, with realistic examples that you can use as a springboard for your own libraries.\"Hans Bergsten, a JSP expert group veteran and one of our most active contributors, has thoroughly and accurately captured the new features of JSP 2.0 and JSTL 1.1 in a way that is well-organized and easy to understand. With excellent, to-the-point examples, this book is a 'must have' for any serious JSP 2.0 developer.\"--Mark Roth, JSP 2.0 Specification Lead, Sun Microsystems, Inc.Hans Bergsten is the founder of Gefion Software, a company focused on Java services and products based on J2EE technologies. Hans has been an active participant in the working groups for both the servlet and JSP specifications since their inception and contributes to other related JCP specifications, such as JSP Standard Tag Library (JSTL) and JavaServer Faces (JSF), and, as one of the initial members of the Apache Jakarta Project Management Committee, helped develop the Apache Tomcat reference implementation for the servlet and JSP specifications.",
        "Category": " Computers , Programming , General",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Smoking and Politics; Policymaking and the Federal Bureaucracy",
        "Authors": "By Fritschler, A. Lee",
        "Description": "",
        "Category": "",
        "Publisher": "Appleton-Century-Crofts",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "A Chaucer Reader",
        "Authors": "By Edited By Charles W Dunn",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt, Brace And Company, INC.",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1952"
        }
    },
    {
        "Title": "Planet Earth: As You’ve Never Seen It Before",
        "Authors": "By Attenborough, David (FRW), Fothergill, Alastair, Berlowitz, Vanessa, Brownlow, Mark, and Cordey, Huw",
        "Description": "A visual odyssey that will change the way we see our planet, this remarkable book, companion to the acclaimed Discovery Channel/ BBC series, is an enduring and awe-inspiring record of one of the most ambitious natural history projects ever undertaken. Using the latest aerial surveillance, state-of-the-art cameras, and high definition technology, the creators of Planet Earth have assembled more than 400 stunning photographs of wondrous natural landscapes from around the globe, including incredible footage of the rarely spotted, almost mythical creatures that live in these habitats. Many of the images reveal inaccessible places that few have seen and record animal behavior that has never been filmed or photographed before. With the help of this highly advanced technology and the world's premier wildlife photographers, the book takes us on a spectacular journey from the world's greatest rivers and impressive gorges, to its mightiest mountains, hidden caves and caverns, and vast deserts. Planet Earth captures breathtaking sequences of predators and their prey, lush vistas of forests viewed from the tops of towering trees, the oceans and their mysterious creatures viewed from beneath the surface, and much more&#151;in a magnificent adventure that brings unknown wonders of the natural world into our living rooms.Copub: BBC Worldwide Americas",
        "Category": " Photography , Collections, Catalogs, Exhibitions , General",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "7.37",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Wrestling with reality",
        "Authors": "By Weber, Martin",
        "Description": "",
        "Category": "",
        "Publisher": "Pacific Press Pub. Association",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Craft Lessons",
        "Authors": "By Fletcher, Ralph J. and Portalupi, Joann",
        "Description": "Craft is the cauldron in which the writing gets forged.Ralph Fletcher and JoAnn Portalupi argue that too often we concentrate on the beginning and ending of the writing process&#151;conceiving and correcting&#151;while leaving students on their own to make a thousand critical decisions in their writing about crafting leads, voice, structure, supporting detail, setting, mood, and character.What elements of craft can we teach student writers, and at what age are they ready to learn them? This book answers both questions. Craft Lessons is the practical text for the over-scheduled writing teacher who wants to give students fresh challenges for their writing but doesn't have time to pore over dozens of trade books to do so.There are three main sections in the book: one geared for teachers of primary students, one for teachers of grades 3-4, and one for teachers of middle school writers. This developmental structure allows teachers to go directly to those craft lessons most applicable and adaptable to their own students. Each of the 78 lessons is presented on a single page in an easy-to-read format. And every lesson features three teaching guidelines:Discussion&#151;A brief look at the reasons for teaching the particular element of craft.How to Teach It&#151;Concrete language showing exactly how a teacher might bring this craft element to students in individual writing conferences or a small-group setting.Resource Material&#151;A listing of the book or text referred to in the craft lesson plus additional texts you can use and references to a passage, a poem, or a piece of student writing in the Appendixes.Craft Lessons also explores the context&#151;the crucial classroom conditions&#151;for successfully bringing rich ideas to young writers. It will appeal to both experienced writing teachers seeking new horizons for their writers and teachers who are relatively new to teaching writing.Be sure to take a look at Nonfiction Craft Lessons: Teaching Information Writing K-8 and the When Students Write videotapes.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Stenhouse Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Effective Teaching Methods, Fifth Edition",
        "Authors": "By Borich, Gary D. and Stollenwerk, Debra A.",
        "Description": "",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Prentice-Hall",
        "Price Starting With ($)": "6.09",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Midlife Manual for Men: Finding Significance in the Second Half (Life Transitions)",
        "Authors": "By Arterburn, Stephen and Shore, John",
        "Description": "\"Written for men in midlife, to help them first examine the roles they have in life, including husband, father, and provider, and then give them the tools to make the rest of their lives matter\"--Provided by publisher.",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Much Ado About Anne (The Mother-Daughter Book Club)",
        "Authors": "By Frederick, Heather Vogel",
        "Description": "The mother-daughter book club is back!  This year the mothers have a big surprise in store for Emma, Jess, Cassidy, and Megan: They've invited snooty Becca Chadwick and her mother to join the book club!   But there are bigger problems when Jess finds out that her family may have to give up Half Moon Farm. In a year filled with skating parties, a disastrous mother-daughter camping trip, and a high-stakes fashion show, the girls realize that it's only through working together -- Becca included -- that they can save Half Moon Farm.   Acclaimed author Heather Vogel Frederick captures the magic of friendship and the scrapes along the way in this sequel to The Mother-Daughter Book Club, which will enchant daughters and mothers alike.",
        "Category": " Juvenile Fiction , Books & Libraries",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Whitney Museum of American Art: Selected works from the permanent collection",
        "Authors": "By Whitney Museum of American Art",
        "Description": "",
        "Category": "",
        "Publisher": "The Museum in association with W.W. Norton",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Historical and Cultural Atlas of African Americans",
        "Authors": "By Mattson, Mark T. and Asante, Molefi K.",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Living Language, German Dictionary",
        "Authors": "By Kleinmann, Walter",
        "Description": "Dictionary included in the Living Language Complete Basic Course.",
        "Category": "",
        "Publisher": "Living Language",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Disney Bunnies: I Love You, My Bunnies",
        "Authors": "By Pickens, Charles (ILT), Driscoll, Laura, Tyminski, Lori (ILT), and Naggi, Maria Elena (ILT)",
        "Description": "This heartwarming picture book follows Thumper and his sisters as they, enjoying a beautiful spring day, decide to make their mama the perfect gift--a twig basket filled with flowers.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Flea Market Trader",
        "Authors": "By Sharon Huxford",
        "Description": "",
        "Category": "",
        "Publisher": "Collector Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "My Dad Is Great",
        "Authors": "By Goldsack, Gaby and Walker, Sara (ILT)",
        "Description": "A girl tells about the qualities that make her father great in her eyes.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Michigan and the Cleveland Era, Sketches of University of MichiganStaff Members and Alumni Who Served the Cleveland.",
        "Authors": "By Babst, Earl D. and Lewis G. Vander Velde, eds.",
        "Description": "",
        "Category": "",
        "Publisher": "Univesity of Michigan Press",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1948"
        }
    },
    {
        "Title": "Garden Spells",
        "Authors": "By Allen, Sarah, Addison",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Discovery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Don't Retire, REWIRE!",
        "Authors": "By Sedlar, Jeri and Miners, Rick",
        "Description": "A practical career handbook for those planning to continue to work in some form after the age of sixty-five explains how to find a work situation that is mentally, emotionally, and financially rewarding, with updated suggestions on how to define the type of work suited to individual interests and how to go through the process of obtaining such work. Original.",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Alpha",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Hope When You're Hurting: Answers to Four Questions Hurting People Ask",
        "Authors": "By Crabb, Lawrence J. and Allender, Dan B.",
        "Description": "In Hope When You're Hurting, Drs. Larry Crabb and Dan Allender consider four key questions hurting people ask: What's wrong? Who can help? What will the helper do? What can I hope for?",
        "Category": " Religion , Christian Life , Personal Growth",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Apocalypse 2012",
        "Authors": "By Podrug, Junius and Gleason, Robert",
        "Description": "Today’s world leaders and those of 1,000 years ago face the world’s end. The Mayan “End-Time Codex” predicts the end of the world in 2012. A young Aztec-Mayan slave tells the story of its creation: gifted in math and astronomy, Coyotl advises the god-king, Quetzalcoatl.  Gathering artists, scientists, and architects, this ruler builds the great, golden city of Tula but soon faces war, disastrous drought, death-cult priests who rip the hearts out of thousands of people. . . and an epic catastrophe threatening all humanity.Meanwhile, thousand years later, scientists have rediscovered the End-Time Codex and learned that their own time mirrors Tula’s golden age.  Can they crack the 2012 code and save their world from Tula’s deadly fate?  The countdown begins.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Africa Explored: Europeans in the Dark Continent, 1769-1889",
        "Authors": "By Hibbert, Christopher",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "What They Don't Teach You at Film School: 161 Strategies For Making Your Own Movies No Matter What",
        "Authors": "By Landau, Camille and White, Tiare",
        "Description": "Two filmmakers who've beaten the system give the real dope on what it takes to get your movie made.Do you have to go to film school to get your movies made? No, say two young entrepreneurs who survived the grind. Here they offer 140 strategies for making movies no matter what. Amateurs as well as seasoned veterans can pick up this entertaining and incredibly useful guide in any place--at any point of crisis--and find tactics that work. Whether it's raising money or cutting your budget; dealing with angry landlords or angry cops; or jump-starting the production or stalling it while you finish the script, these strategies are delivered with funny, illustrative anecdotes from the authors' experiences and from veteran filmmakers eager to share their stories. Irreverent, invaluable, and a lot cheaper than a year's tuition, this friendly guide is the smartest investment any future filmmaker could make.Strategies from the book include: Love your friends for criticizing your work--especially at the script stage; Shyness won't get you the donuts; Duct tape miracles; Don't fall in love with cast or crew (but if you do...).",
        "Category": " Performing Arts , Film , Reference",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Never Say Diet: Make Five Decisions and Break the Fat Habit for Good",
        "Authors": "By Hobbs, Chantel and Jacobsen, Rowan (CON)",
        "Description": "Chantel Hobbs lost two hundred pounds without the help of surgery, pills, point systems, or a trendy diet. And just as important, she kept the weight off. Her dramatic turnaround began with five decisions–personal, no-excuses commitments that kept her from losing sight of her goals. It worked for Chantel and it will work for you. Once you unconditionally change your mind your body will follow, and your life will never be the same. In this book you will discover: ·How to move beyond past failures and get over your old excuses  ·How changing your eating patterns can break food’s hold over you·Why winning the weight-loss battle must come from the inside out ·The simple workouts that deliver lasting results and are fun to do·How to overcome the naysayers, the diet police, and your own nagging doubts·How to prioritize your health, juggle family and career, and stay motivated when life takes  unexpected turns·Why the diet industry wants you to keep coming back ·And much more! You will find straight talk on developing the determination, commitment, and personal responsibility it takes to achieve weight loss that lasts. It’s time to stop getting ready for the event and start getting ready for life!",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "WaterBrook",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "30 Days to Experiencing Spiritual Breakthroughs",
        "Authors": "By Wilkinson, Bruce H. (EDT)",
        "Description": "This thirty-day tool for spiritual growth presents thirty practical articles that show readers how to experience breakthroughs in their Christian lives, marriages, families, and walks with God. In addition to an introduction and conclusion, each of the four sections contains seven articles written by some of the nation's best-known Christian authors. Their contributions, a combination of helpful insights from the Bible and personal experience, will touch readers who may be struggling and looking for life-transforming change. The book also serves as a resource guide for Dr. Bruce Wilkinson's new release, Experiencing Spiritual Breakthroughs, based on the internationally renowned Three Chairs series.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "The Gratitude of Kings",
        "Authors": "By Bradley, Marion Zimmer",
        "Description": "",
        "Category": "",
        "Publisher": "Roc Hardcover",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "The Little Book Of Warfare; 50 Key Battles That Trace The Evolution Of Conflict",
        "Authors": "By David Owen",
        "Description": "",
        "Category": "",
        "Publisher": "Fall River Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "The Secret to a Happy Home",
        "Authors": "By Kennedy, D. James",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Whitaker House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Tawny scrawny lion (A little golden book)",
        "Authors": "By Kathryn Jackson",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press/ Western Pub Co",
        "Price Starting With ($)": "8.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Christmas Feasts (Great American cooking schools)",
        "Authors": "By Sass, Lorna J.",
        "Description": "",
        "Category": " Cooking , Holiday",
        "Publisher": "Irena Chalmers Cookbooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "This Will Change Everything: Ideas That Will Shape the Future (Edge Question Series)",
        "Authors": "By Brockman, John (EDT)",
        "Description": "“This Will Change Everything offers seemingly radical but actually feasible ideas with the potential to change the world.”—Jared Diamond, Pulitzer Prize-winning author of Guns, Germs, and Steel Editor John Brockman continues in the same vein as his popular compilations What Are You Optimistic About and What Have You Changed Your Mind About with This Will Change Everything. Brockman asks 150 intellectual superstars “what game-changing scientific ideas and developments do you expect to live to see?” Their fascinating responses are collected here, from bestselling author of Atonement Ian McEwan to Nobel Prize-winning physicist Frank Wilczek to electronic music pioneer Brian Eno to writer, actor, director, and activist Alan Alda.",
        "Category": " Social Science , Future Studies",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "The Beauty of Friendship",
        "Authors": "By Gibran, Kahlil",
        "Description": "",
        "Category": "",
        "Publisher": "Hallmark Cards",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Complete Idiot's Guide to Adoption (The Complete Idiot's Guide)",
        "Authors": "By Adamec, Christine A.",
        "Description": "You're no idiot, of course.  You've applied for jobs, colleges, and even a driver's license.  But when it comes applying for adoption, you don't know where to begin. Start here!  The Complete Idiot's Guide to Adoption makes the adoption process easy.  In sensitive, straight-forward language, adoption expert Chris Adamec shows you how to prepare for adoption, survive the adoption process, and raise a happy, healthy, adopted child.  In this Complete Idiot's Guide you get:",
        "Category": " Social Science , Human Services",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Vegetables: Amazing Tips, Tricks & Tonics! (New Garden Line Series, Vol. 7)",
        "Authors": "By Baker, Jerry",
        "Description": "",
        "Category": "",
        "Publisher": "The YardenCare Co",
        "Price Starting With ($)": "11.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Dear Mr. President: Theodore Roosevelt Letters from a Young Coal Miner",
        "Authors": "By Armstrong, Jennifer",
        "Description": "Fifteen-year-old Frank Kovacs, a Polish immigrant working in the coal mines of eastern Pennsylvania, begins a correspondence with Theodore Roosevelt after he assumes the presidency on September 14, 1901.",
        "Category": " Juvenile Fiction , Historical , United States , 20th Century",
        "Publisher": "Winslow Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "The Romancipation of Maggie Hunter (Red Dress Ink Novels)",
        "Authors": "By Sigaloff, Jane",
        "Description": "Maggie Hunter is living the life she's always wanted.Her career is taking off and, thanks to Japanese straighteningtechnology, her hair is lying down. The commitment-phobicMaggie even has a serious boyfriend, Max. Smart, caring andfunny, Max is practically perfect. There's just one problem:he's adamant that it's time for Maggie to move in.Maggie's not sure she's ready to go from 'me' to 'we,' or if shecan cope with putting all her eggs in one basket (or all her shoesin one closet)! If only she could be more like Eloise, her bestfriend who's dying to start nesting. Except Eloise is with Jake,who has an apparent allergy to forward planning. He'll barelycommit to an entire weekend at her place, let alone a joint lease.So—Maggie wants a man like Jake, and Eloise wants a man likeMax. At least that's how it seems to Maggie. She knows thatsomehow someone will have to make a switch, but as sheexamines the relationships around her, she can't help butwonder, can you really make someone change?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Red Dress Ink",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Eyewitness Top 10 Travel Guide to Las Vegas (Eyewitness Travel Top 10)",
        "Authors": "By Emerson, Connie",
        "Description": "With a new design and unbeatable price, DK raises the bar on travel guides with its new Top 10 Travel Guide series. Whether on business or vacation, take the work out of planning any trip with DK's Top 10 Travel Guides. Building on the success of the Eyewitness Travel Guides, DK has created a new series that makes finding the best every destination has to offer even easier than before. Whether searching for the finest cuisine or cheapest places to eat, the most luxurious hotels or best deals on places to stay, the coolest family destination or hottest nightspot, the Top 10 format allows travelers to use the insights of experts to make the most of their vacation. Accompanied by a companion website, readers can share their experiences and vote for their own personal Top 10s.",
        "Category": " Travel , United States , West , Mountain (AZ, CO, ID, MT, NM, NV, UT, WY)",
        "Publisher": "DK Eyewitness Travel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Pie Pie Pie: Easy Homemade Favorites",
        "Authors": "By Carroll, John Phillip and Rupp, Tina (PHT)",
        "Description": "Nothing says home sweet home like the aroma of a freshly baked pie. And with the voice of an old friend, author John Phillip Carroll teaches foolproof methods for making the delicious tried-and-true favorites that top every pie lover's list, plus some exciting new flavor sensations. The buttery golden streusel on the Apricot Crumble Pie will give Grandma's a run for her money. For a new twist on an old classic, drop a fork in a chilled slice of Butterscotch Cream Quince Pie with its spicy gingersnap crust. Fudge Brownie Pie takes the cake as a hip new treat for a kid's bithday party. Recipes for seven different types of crust ('cause one just isnt enough) plus simple toppings like meringue and chocolate fudge sauce ensure that each pie is perfect, from bottom to top. Apple or Key Lime, Caramel Custard or Mile-High Strawberrythey're all as easy as Pie Pie Pie.",
        "Category": " Cooking , Courses & Dishes , Pies",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "6.8",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The Everything College Survival Book: From Social Life To Study Skills--all You Need To Fit Right In",
        "Authors": "By Malone, Michael S.",
        "Description": "",
        "Category": " Education , Student Life & Student Affairs",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The Dance Workshop: A Guide to the Fundamentals of Movement",
        "Authors": "By Cohan, Robert",
        "Description": "Recommends a variety of exercises and stretches, covers balance, posture, gesture, rhythm, breathing, and movement, and demonstrates basic, intermediate, and jazz movements",
        "Category": " Performing Arts , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "Reagan's War: The Epic Story of His Forty-Year Struggle and Final Triumph Over Communism",
        "Authors": "By Schweizer, Peter",
        "Description": "Reagan’s War is the story of Ronald Reagan’s personal and political journey as an anti-communist, from his early days as an actor to his years in the White House. Challenging popular misconceptions of Reagan as an empty suit who played only a passive role in the demise of the Soviet Union, Peter Schweizer details Reagan’s decades-long battle against communism.Bringing to light previously secret information obtained from archives in the United States, Germany, Poland, Hungary, and Russia—including Reagan’s KGB file—Schweizer offers a compelling case that Reagan personally mapped out and directed his war against communism, often disagreeing with experts and advisers. An essential book for understanding the Cold War, Reagan’s War should be read by open-minded readers across the political spectrum.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Victorians: British Painting in the Reign of Queen Victoria, 1837-1901",
        "Authors": "By Warner, Malcolm, Helmreich, Anne, and Brock, Charles",
        "Description": "",
        "Category": "",
        "Publisher": "Natl Gallery of Art",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "In the Eye of the Storm: Swept to the Center by God",
        "Authors": "By Robinson, Gene",
        "Description": "Gene Robinson is bishop of the tiny, rural Episcopal Diocese of New Hampshire, but he's at the center of a storm of controversy raging in the Episcopal Church and throughout the worldwide Anglican Communion involving homosexuality, the priesthood, and the future of the Communion.  This book offers an honest, thoughtful portrait of Robinson, the faith that has informed his life, and the controversy that continues to rock his Church.",
        "Category": " Religion , Christianity , Episcopalian",
        "Publisher": "SEABURY BOOKS",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    }
]