[
    {
        "Title": "MLA Style Manual and Guide to Scholarly Publishing, 2nd Edition",
        "Authors": "By Gibaldi, Joseph",
        "Description": "The standard reference for academic writing, presenting the formats, styles, punctuation, abbreviations, and other forms that scholarly publishers expect. First published in 1985 and here updated with guidelines for electronic works and sources from the Internet. The chapters outlining the publication process from manuscript to published work and reviewing legal issues have also been revised to reflect current conditions. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Language Arts & Disciplines , Style Manuals",
        "Publisher": "Modern Language Assn of Amer",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "About Face: Commissario Guido Brunetti Mystery (The Commissario Guido Brunetti Mysteries, 18)",
        "Authors": "By Leon, Donna",
        "Description": "In About Face, Guido Brunetti and his wife, Paola, are on their way to a dinner party at Palazzo Falier, home of Paola's parents, the rich and powerful Conte and Contessa Falier, While Paola stops to examine a bookstore window, Brunetti's eye is caught by a couple ahead of them in the nearly deserted streets; a woman in an impossibly expensive fur coat on the arm of a much older man. He is intrigued when they turn out to be fellow dinner guests, and even more so when he sees the woman's face, which has been disfigured by excessive plastic surgery. She is Franca Marinello, La Superliftata, whom he's heard of but never met.This intelligent, mysterious woman entrances Brunetti. When she visits him later at the Questura and asks a favor, he is troubled. Her request seems to land near his investigation into a suspicious death that looks like murder, and the illegal hauling of garbage. In Italy, the environment has reached a crisis. Incinerators across the south are at full capacity, burning who-knows-what, the polluted waters of Venice's canals sit in the shadow of a major chemical complex, and in Naples, enormous piles of garbage grow in the streets.As Brunetti delves into this shadowy, toxic world, he comes face to face with violence as dangerous as he's ever seen, and corruption that touches on his influential father-in-law, as well as the fascinating Franca Marinello.",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "Atlantic Monthly Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Daddy and Me (Karen Katz Lift-the-Flap Books)",
        "Authors": "By Katz, Karen",
        "Description": "Daddy is making a special project. Help him find the tools he needs by looking under the oversized flaps. Working with Daddy is so much fun!",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Little Quack Loves Colors",
        "Authors": "By Thompson, Lauren and Anderson, Derek (ILT)",
        "Description": "Join Little Quack and his sister Piddle as they explore the colorful world around them! Children will love learning their colors as Little Quack encounters bright red ladybugs, oozy brown mud, sweet, yellow buttercups, and much more! The padded board book is a perfect format for young readers!",
        "Category": " Juvenile Fiction , Concepts , Colors",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "The Toddler Owner's Manual: Operating Instructions, Troubleshooting Tips, and Advice on System Maintenance",
        "Authors": "By Kuhn, Brett R., Ph.D. and Borgenicht, Joe",
        "Description": "At Last! A Beginner’s Guide to Toddler Technology   Just when you’ve mastered your infant’s maintenance routine, he begins to malfunction, refusing fuel, crying inexplicably, and resisting your attempts to clothe him. Your infant has upgraded to a toddler! But how can you master your toddler’s changing technology?   Through step-by-step instructions and helpful schematic diagrams, The Toddler Owner’s Manual explores hundreds of frequently asked questions: How should I react when my toddler throws a tantrum? How do I train my toddler for self–waste disposal? Whatever your concerns, you’ll find the answers here—courtesy of pediatric psychologist Dr. Brett R. Kuhn and co-author Joe Borgenicht. Together, they provide plenty of useful advice for anyone who wants to learn the basics of toddler care.",
        "Category": " Family & Relationships , Life Stages , Infants & Toddlers",
        "Publisher": "Quirk Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Business of Business",
        "Authors": "By Shilling, Dana",
        "Description": "",
        "Category": "",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "The House at Riverton: A Novel",
        "Authors": "By Morton, Kate",
        "Description": "From the #1 internationally bestselling author of The Forgotten Garden comes a gorgeous novel set in England between World War I and World war II. Perfect for fans of Downton Abbey, it is the story of an aristocratic family, a house, a mysterious death and a way of life that vanished forever, told in flashback by a woman who witnessed it all and kept a secret for decades.Grace Bradley went to work at Riverton House as a servant when she was just a girl, before the First World War. For years her life was inextricably tied up with the Hartford family, most particularly the two daughters, Hannah and Emmeline. In the summer of 1924, at a glittering society party held at the house, a young poet shot himself. The only witnesses were Hannah and Emmeline and only they—and Grace—know the truth. In 1999, when Grace is ninety-eight years old and living out her last days in a nursing home, she is visited by a young director who is making a film about the events of that summer. She takes Grace back to Riverton House and reawakens her memories. Told in flashback, this is the story of Grace's youth during the last days of Edwardian aristocratic privilege shattered by war, of the vibrant twenties and the changes she witnessed as an entire way of life vanished forever. The novel is full of secrets—some revealed, others hidden forever, reminiscent of the romantic suspense of Daphne du Maurier. It is also a meditation on memory, the devastation of war and a beautifully rendered window into a fascinating time in history. Kate Morton’s first novel, originally published to critical acclaim in Australia, and quickly becoming a #1 bestseller in England, The House at Riverton is a vivid, page-turning novel of suspense and passion, with characters—and an ending—readers won't soon forget.",
        "Category": " Fiction , Sagas",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Secrets of Successful Web Sites",
        "Authors": "By Siegel, David",
        "Description": "Explains the process of Web development from both the client's and the contractor's point of view, with 15 detailed case studies of Web sites and the teams who put them together, and 11 chapters on methods for designing sites. Describes phases of the Web design process including partnering, content development and design, production, and launch and maintenance, with emphasis on design and business aspects rather than technical how-tos.  Each pages is visually exciting, with color illustrations, photos, and many examples of Web pages. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Computers , Internet , General",
        "Publisher": "Hayden Books",
        "Price Starting With ($)": "5.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Modern Grill Pan Cooking : 100 Innovative Recipes for Perfect Results",
        "Authors": "By Steer, Gina",
        "Description": "Introduces one hundred delicious, healthful recipes for quick and easy cooking, including a wide variety of fish, meat, poultery, vegetable, and fruit dishes, as well as tips on cooking with a grill pan. Original.",
        "Category": " Cooking , Specific Ingredients , Meat",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Wet Cats",
        "Authors": "By Garza, Mario",
        "Description": "What's funnier than cats with stuff on them? Wet Cats. When Stuffonmycat.com (a Yahoo! Top 25 Web site featured on \"The Daily Show with Jon Stewart\") launched in 2005, some of the first images posted were of adorable, laugh-out-loud funny, somewhat pathetic cats that for one reason or another were soaked to the bone. Whether they were caught outside in a rainstorm, rolled around in something foul and required a good scrubbing, or enjoyed bathing for fun, these cats got wet. Good thing their owners had a camera handy. This refreshingly clean addition to the Stuff on My Cat series features 200 of the best photographs of wet cats from the ever-popular Web site, and is the only book of its kind in the world.",
        "Category": " Pets , Cats , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "7.03",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Holiday Hero: A Man's Manual for Holiday Lighting",
        "Authors": "By Finkle, Brad",
        "Description": "Be the brightest star on the block when holiday season rolls around. In this easy-to-use outdoor decorating guide, \"Mr. Christmas\" himself helps transform any home into a sparkling winter wonderland. For everyone from electrical project wizards to people who have never used an extension cord, here is a step-by-step guide to planning, shopping for, and installing a dazzling house and yard display for the holidays. This book turns complex technical tasks into easy and affordable do-it-yourself projects that will impress the wife, enchant the kids, and make the neighbors green with envy. With detailedillustrations and handy packing and storage tips, Holiday Hero eliminates the holiday headaches of untangling lights year after year. Things are looking brighter already.",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Baby Signs for Bedtime (Baby Signs (Harperfestival))",
        "Authors": "By Gentieu, Penny (PHT), Gentieu, Penny, Acredolo, Linda P., Goodwyn, Susan, and Gentieu, Penny (ILT)",
        "Description": "It's as easy as waving bye-bye!Babies have a lot to say, even before they can actually speak familiar bedtime words like \"sleepy\" and \"quiet.\" Baby Signs are simple gestures that allow babies and toddlers to communicate what they see, what they need, and even how they feel. Research has shown that Baby Signs decrease frustration and tantrums and help your baby talk sooner.When to begin: When your child starts to wave bye-bye.How to do it: Show your baby the sign and point to the picture. Always say the word as you make the sign.Improvise: Make up your own signs -- your baby probably will too!",
        "Category": " Juvenile Fiction , Bedtime & Dreams",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Marilyn Merlot and the Naked Grape: Odd Wines from Around the World",
        "Authors": "By May, Peter F.",
        "Description": "Fat Bastard Chardonnay, Lazy Lizard Shiraz, White Trash White. These three wines?and more than 100 others?can be found in Marilyn Merlot and the Naked Grape, a celebration of the oddest wines in the world. Some have strange names, like Cat's Pee on a Gooseberry Bush. Others have bizarre artwork, like the Magritte-inspired UFO invasion. Still others have unusual production features (Braille typography, heat-sensitive inks, lenticular art, and more). Along with brilliant reproductions of the original labels, we'll feature brief stories about the origins of the wines, plus tasting notes from the author. Readers will learn about unusual vineyards (like Cleavage Creek, which donates its proceeds to breast cancer research) as well as the most innovative artists working in the wine label medium. Finally, there's an appendix of resources that will help you buy these wines?so you can try them for yourself!",
        "Category": " Cooking , Beverages , Alcoholic , General",
        "Publisher": "Quirk Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Macaroni And Cheese",
        "Authors": "By Barnhurst, Noel and Spieler, Marlene",
        "Description": "From the kitchen that brought us the I-have-never-seen-anything-yummier Grilled Cheese comes the it-just-got-yummier Macaroni & Cheese. The kid-friendly favorite is now being spotted at the trendiest restaurants around town, and this fantastic cookbook has it all. More than 50 classics range from the tried-and-true Yankee Doodle Dandy Baked Macaroni and Cheese and quick to prepare specialties such as the yodel-worthy Alpine Macaroni with Appenzeller and Crme Frache to international specialties like Giuvetchi, a Greek dish of orzo in a cinnamon tomato sauce with lamb and kasseri, myzithra, and feta cheeses. There are even a few dessert versions like Falooda, a traditional Indian treat, this one using ricotta and sweet vermicelli, with cherries and a touch of cardamom. Recipes for side salads and soups help round out a balanced meal. Mac & cheeseit'll always please.",
        "Category": " Cooking , Specific Ingredients , Pasta",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Seriously Simple: Easy Recipes for Creative Cooks",
        "Authors": "By Worthington, Diane Rossen and Barnhurst, Noel (PHT)",
        "Description": "The subtitle says it all. One of the biggest challenges for the good home cook is creating delicious, healthy meals using just a few ingredients and simple steps. And good cooks know that Diane Worthington is an expert at finding the one strong flavor component that will turn a ho-hum dish into something memorable-without spending the whole day in the kitchen. In Seriously Simple: Easy Recipes for Creative Cooks she does it again. Here are over 90 recipes for everything from Butternut Squash Soup with Chipotle Creme to Lemon-Lime Pound-cake that come together in a snap. Gorgeously photographed, Seriously Simple is full of practical tips for saving time without sparing the savor, such as advice on developing a busy cooks pantry, making one-pot meals, and creating sauces, rubs, and marinades that will spice up any dish in a flash. Guaranteed to cut down on the prep time, streamline techniques, and pump up the flavor, heres a new kitchen standby thats seriously fast, seriously delicious...Seriously Simple.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.83",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Bethlehem Steel",
        "Authors": "By Garn, Andrew",
        "Description": "Many of America's most impressive structures?from the Chrysler Building to the George Washington Bridge to the Panama Canal?as well as its battleships, railroads, and automobiles had their origins in the Bethlehem Steel plant in eastern Pennsylvania. Although still in operation, much of the plant, which stretches nearly five miles and comprises hundreds of interlinked buildings, is now being torn down. Photographer Andrew Garn has been documenting this industrial leviathan for more than five years. His photographs, reproduced here in duotone, capture the essential quality of this potent symbol of our industrial heritage. Also included are archival images and drawings, and a brief history by Lance Metz, the foremost authority on the plant. This is the third title in our series on icons of industrial America, following Wood Burners and Grain Elevators.",
        "Category": " Architecture , Buildings , Public, Commercial & Industrial",
        "Publisher": "Princeton Architectural Press",
        "Price Starting With ($)": "39.4",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Campfire Cuisine: Gourmet Recipes for the Great Outdoors",
        "Authors": "By Donovan, Robin",
        "Description": "No more hot dogs and baked beans!   Finally, a guide for lovers of both good food and the great outdoors. Campfire Cusine is a cookbook for the growing number of hikers, campers, and backpackers who are making healthy, tasty, and satisfying food a high priority in their lives. It offers more than 100 simple but inspired recipes for meals that can be cooked at a campsite or in any other outdoor setting—all made from fresh foods, never relying on ready-made food products. Enjoy Spicy Orange Chicken, Grilled Steak Tacos, Bourbon-Glazed Salmon, Lemony Couscous Salad, Cinnamon Baked Bananas, and more!   Armed with Campfire Cusine’s step-by-step, practical guidance on meal planning, shopping, and equipment selection, everyone from die-hard gourmets to novice cooks will be fully prepared to eat well in the outdoors.",
        "Category": " Cooking , Methods , Outdoor",
        "Publisher": "Quirk Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Lost: Lost and Found Pet Posters from Around the World",
        "Authors": "By Phillips, Ian",
        "Description": "One of the first impulses of an owner who's lost a pet is to canvas the neighborhood with quickly made posters. And even if we haven't seen the wanderer in question, many of us stop to read these notices, which are often charming combinations of heartfelt pleas, humor, and handmade art.For the last decade, Ian Phillips has collected lost pet posters from around world. In Lost, Phillips selects from his vast collection those posters notable for their cleverness, humor, sorrow, entreaties, rewards, and-in several instances-sheer outlandishness (\"Lost Lost Lost: one brown and white 'mottled' street duck. Does not answer to the name of Neither Norman\"). For designers, artists, or anyone who wants to tap into the human and creative side of our everyday lives under stress, Lost is a book that tells a story on every page.As a collection, the posters represent an authentic folk art that expresses a commonality between the readers and the makers from the United States to China. For pet owners everywhere, and for anyone who has very stopped to read a lost pet poster, Lost is a heart-warming tribute.",
        "Category": " Humor , Topic , Animals",
        "Publisher": "Princeton Architectural Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Chef's Secrets: Insider Techniques from Today's Culinary Masters",
        "Authors": "By Bates, Harry (ILT) and Maroukian, Francine (CON)",
        "Description": "Chef’s Secrets—Revealed!   In Chef’s Secrets, more than 80 renowned chefs share the tricks, timesaving techniques, and kitchen wisdom they’ve learned through years of experience.        •  Steven Raichlen on Building a Three-Zone Fire on a Charcoal Grill      •  Charlie Palmer on Roasting a Perfect Turkey      •  Bruce Aidells on the Secret to Flavorful Pork      •  Gary Guitard on Tempering Chocolate      •  Plus techniques from Sara Moulton, Marcus Samuelsson, Norman Van Aken, Roxanne Klein, James Peterson, Emily Luchetti, and dozens of other top-notch chefs!   Each technique is explained in the chef’s own words, along with a short, revealing interview and a detailed profile of the chef’s accomplishments. With tips stretching from the basics (how to peel ginger with a teaspoon) to the extreme (how to peel a tomato with a blow-torch), Chef’s Secrets is an essential reference for any food lover’s bookshelf!",
        "Category": " Cooking , Methods , Professional",
        "Publisher": "Quirk Books",
        "Price Starting With ($)": "12.96",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Official Cat Codependents Handbook: For People Who Love Their Cats Too Much",
        "Authors": "By Sellers, Ronnie and Reinhardt, Jennifer Black (ILT)",
        "Description": "Humorously describes the symptoms and treatment of cat codependency",
        "Category": " Pets , Dogs , General",
        "Publisher": "Sellers Pub Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Too Many Kangaroo Things to Do! (Great Source Mathstart)",
        "Authors": "By Murphy, Stuart J. and O'Malley, Kevin (ILT)",
        "Description": "It’s Kangaroo’s birthday, but no one will play with him: not the emu, the platypuses, the koalas, or even the dingos.  They all have too many things to do.  What exactly are they doing?  They’re using multiplication to figure out just how many things they have to do to plan a big surprise for Kangaroo!   Best Children’s Science Books 1997 (Science Books and Films)",
        "Category": " Juvenile Nonfiction , Mathematics , General",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "The Road of Lost Innocence: The Story of a Cambodian Heroine (Random House Reader's Circle)",
        "Authors": "By Mam, Somaly and Marshall, Ruth (CON)",
        "Description": "A riveting and beautiful memoir of tragedy and hope–by a woman named to Time magazine’s list of the 100 most influential people in the worldBorn in a village deep in the Cambodian forest, Somaly Mam was sold into sexual slavery by her grandfather when she was twelve years old. For the next decade she was shuttled through the brothels that make up the sprawling sex trade of Southeast Asia. She suffered unspeakable acts of brutality and witnessed horrors that would haunt her for the rest of her life–until, in her early twenties, she managed to escape. Unable to forget the girls she left behind, Mam became a tenacious and brave leader in the fight against human trafficking, rescuing sex workers–some as young as five and six–offering them shelter, rehabilitation, healing, and love and leading them into new life.Written in exquisite, spare, unflinching prose, The Road of Lost Innocence is a memoir that will leave you awestruck by the courage and strength of this extraordinary woman and will renew your faith in the power of an individual to bring about change.",
        "Category": " Social Science , Developing & Emerging Countries",
        "Publisher": "Spiegel & Grau",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Jesse Bear, What Will You Wear?",
        "Authors": "By Degen, Bruce (ILT) and Carlstrom, Nancy White",
        "Description": "In lilting verse and exuberant paintings, the first of Nancy White Carlstrom’s and Bruce Degen’s celebrated Jesse Bear books creates a special day not only for Jesse Bear, but for young children everywhere.What does a little bear wear while he romps through a bright and sunny day? In the morning, his pants that dance, a rose between his toes, and the sun on his legs that run. At lunchtime, an apple to bite and a moustache of white, and juice from a pear and rice in his hair. And at night, his pjs with feet and face on the seat, and sleep in his eyes and stars in the skies, as he dreams of the fun he’ll have tomorrow.",
        "Category": " Juvenile Fiction , Clothing & Dress",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Ranching Traditions ~ Legacy of the American West",
        "Authors": "By Ryan, Kathleen Jo (PHT)",
        "Description": "Essays by some of the West's most distinguished writers and three hundred photographs chronicle the history and lore of ranching, describing the life of the working cowboy, the business of ranching, and more.",
        "Category": "",
        "Publisher": "Artabras",
        "Price Starting With ($)": "7.92",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "National Geographic Beginners World Atlas Updated Edition",
        "Authors": "By National Geographic Society (U. S.)",
        "Description": "All the political maps and statistics have been updated in this award-winning book. The society's world-renowned cartographers, working with education consultants and geographers have created a state-of-the-art world atlas for children ages 5 to 8. Large, easy-to-read maps introduce youngsters to the world and each of its continents. Full-color photographs, carefully selected for their appeal to young children, supplement the maps and make people, places, and natural wonders come to life. Through simple but fact-filled text, children begin exploring the world by learning about maps and how to read them. Then they begin their continent-by-continent tour. Each continent begins with a welcome from a young native child, followed by an illustrated physical map with brief bulleted discussions of land regions, water, climate, plants, and animals. Similar treatment is given to the political map except the topics are countries, cities, people, languages, and products. Each spread features full-color images that are keyed to the maps. Backmatter includes a map keyed to a chart of geographic superlatives, a glossary, a pronunciation guide, and an index.",
        "Category": " Juvenile Nonfiction , Reference , Atlases",
        "Publisher": "National Geographic Children's Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Getting Started in Drama Ministry: A Complete Guide to Christian Drama",
        "Authors": "By Litherland, Janet",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Meriwether Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "So - You Want to Be an Innkeeper",
        "Authors": "By Hardy, Pat, Bell, Jo Ann M., Davies, Mary E., and Brown, Susan (EDT)",
        "Description": "With over 70,000 copies sold, this must-have guide has proven itself the best and most reliable source of information for aspiring innkeepers. Highly recommended by the Professional Association of Innkeepers International, it presents the facts from the insiders on how to start, operate, and promote a successful establishment. Now completely revised and updated,So - You Want to Be an Innkeeper also includes new information on cottages, luxury properties, and spa services - a reflection of recent trends in innkeeping. Charts and worksheets for financial planning, property evaluation, and cash flow projection keep potential innkeepers' feet planted firmly on the ground. For anyone who has ever dreamed of opening their own cozy little B&B, here is the inn-side scoop from those who've been there.",
        "Category": " Travel , Food, Lodging & Transportation , Bed & Breakfast",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Wind and Sand : The Story of the Wright Brothers at Kitty Hawk",
        "Authors": "By Lynanne Wescott & Paula Degen",
        "Description": "",
        "Category": "",
        "Publisher": "Eastern National",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Pillows: Stylish accents you can make (Waverly at Home)",
        "Authors": "By Ingham, Vicki L. (EDT), Waverly (COR), and Meredith Books (COR)",
        "Description": "Provides directions to create more than twenty pillows, bolsters, and cushions.",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "Waverly",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Practical Herb Garden: A Comprehensive A-Z Directory and Gardener's Guide to Growing Herbs Successfully",
        "Authors": "By Houdret, Jessica",
        "Description": "",
        "Category": "",
        "Publisher": "HERMES HOUSE",
        "Price Starting With ($)": "13.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Italian Kitchen Bible",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "1923849",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Stanley Complete Step-by-Step Book of Home Repair and Improvement",
        "Authors": "By Hufnagel, James A. and Broecker, William L. (EDT)",
        "Description": "The ultimate home-improvement guide features instructions on how to do thousands of maintenance tasks, renovations, and repairs, as well as two thousand four-color, easy-to-follow diagrams. 150,000 first printing. $200,000 ad/promo. Rodale & BH&G Main. Lit Guild & Doubleday Alt.",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "7.56",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "The Knot Guide For The Mother of the Bride",
        "Authors": "By Roney, Carley and Luu, Cindy (ILT)",
        "Description": "Leave it to The Knot, the most prestigious name in the bridal industry, to create a wise and heartwarming book for the second most important woman in the wedding. The Knot Guide for the Mother of the Bride explains the bridal planning process from start to finish, with special attention given to the responsibilities of the mother of the bride, such as engagement announcements and parties, interacting with the groom's family, and managing finances. Every aspect of the wedding tradition is covered from the mother's point of view, whether the etiquette of gift registries or how to organize a receiving line. Tips on the perfect form-flattering dress and camera-ready hair and make-up will help Mom create her perfect wedding look. Thoughtful suggestions give her ideas for supporting and encouraging her daughter, and for keeping perspective in high-pressure situations. Pretty illustrations and a lovely silvery jacket make this petite hardcover a special treasure. A great self-purchase for Moms or a cherished gift from the bride, The Knot Guide for the Mother of the Bride will help mothers and daughters enjoy the weddingand each other.",
        "Category": " Reference , Weddings",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Thimbleberries Christmas Cottage: Country-Cottage Style Decorating, Entertaining, Collecting, and Quilting Inspirations for Creating Your Dream",
        "Authors": "By Jensen, Lynette",
        "Description": "",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Landauer Books",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Simpsons Beyond Forever!: A Complete Guide to Our Favorite Family...Still Continued",
        "Authors": "By McCann, Jesse Leon and Groening, Matt",
        "Description": "Finally, the follow–up to the phenomenal episodes guides The Simpsons: A Complete Guide to Our Favorite Family and The Simpsons Forever! 埔he Simpsons Beyond Forever! covering seasons 11\\'912612.  Join Matt Groening for the next instalment of the The Simpsons: A Complete Guide to Our Favorite Family. Picking up where The Simpsons Forever! left off, this new volume will tell you everything thing you want to know and more than you think you know about ⓨe Simpsons➱1th and 12th Seasons. Complete with plot synopses, quotes, new characters, things you might have missed,along with addendums to all the lists from the first two volumes, this new guide offers and exhaustingly funny look at ⓨe Simpsons⟦or the most detail–oriented fan, the casual viewer, and everyone in–between..",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Harper Design",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Babushka's Doll",
        "Authors": "By Polacco, Patricia",
        "Description": "Natasha isn't really a bad girl. It's just that she wants to play on the swing now, not after the wash has been hung up to dry. And she wants her soup now, not after the goats have been fed. Looking after Natasha keeps Babushka, Natasha's grandmother, very busy. Then, after lunch, Natasha notices a doll sitting on Babushka's shelf...a doll Babushka tells Natasha she played with just once when she was a little girl. When Natasha plays with the doll while Babushka goes to the store for groceries, she discovers why once is enough with Babushka's doll...and finds out just how tiring it can be to take care of a child who wants everything now.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Simon & Schuster/Paula Wiseman Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "40 Great Rail-Trails in New York and New England",
        "Authors": "By Ryan, Karen-Lee",
        "Description": "",
        "Category": " Travel , United States , Northeast , New England (CT, MA, ME, NH, RI, VT)",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Front Yard & Backyard Idea Book",
        "Authors": "By White, Lee Anne and Webber, Jeni",
        "Description": "Front Yard and Backyard Idea Bookis the ultimate idea folder of more than 500 innovative ways to transform every part of your outdoor land into personal and livable space. Fresh ideas on topics large and small, from the front entry and driveway to the back deck, kids’ recreation areas, lighting, decorating the outdoors, and safety, are featured.Today’s front and backyards are much more than just lawns. Outdoor kitchens make cooking a treat for the senses while backyard fireplaces create a natural gathering place for friends and family. Decks, patios and porches can be transformed into fully furnished outdoor rooms with floors, walls and ceilings.Front Yard & Backyard Idea Bookhelps readers unlock the extraordinary possibilities of these incredibly flexible areas, and showcases a huge array of cutting-edge ideas for turning yards into personal, satisfying spaces. New twists on old themes are offered, as well as some of the freshest ideas from the brightest talent in landscape design. An effective combination of stylistic concepts and hands-on advice helps you select specific projects, while hundreds of color photos inspire and delight.Two books in one, Front Yard & Backyard Idea Book will show you how to make full use of unlimited outdoor possibilities for lounging, dining, playing, and communing with nature.",
        "Category": " Gardening , Landscape",
        "Publisher": "Taunton",
        "Price Starting With ($)": "8.35",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Charlie the Caterpillar",
        "Authors": "By Santoro, Christopher (ILT) and Deluise, Dom",
        "Description": "As Charlie the Caterpillar meets one group of animals after another playing together and having fun, he asks if he can join in. But each time he's told not welcome -- because he's ugly. As winter approaches, Charlie spins himself a cocoon. When spring arrives, the cocoon opens and out comes Charlie -- now a beautiful butterfly. Everyone wants him to be part of their group. But Charlie puts these fair-weather friends properly in their place in this heartwarming story about the meaning of true friendship.",
        "Category": " Juvenile Fiction , Animals , Insects, Spiders, etc.",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Country Home: An Old Fashioned Christmas",
        "Authors": "By Lemmon, Jean (EDT)",
        "Description": "Presents recipes for holiday pies, scones, tarts, and candy, shows folk art and antique holiday decorations and ornaments, and describes how Christmas is celebrated at Williamsburg and other historic settings",
        "Category": " House & Home , Decorating",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Christmas With Mary Engelbreit : Here Comes Santa Claus",
        "Authors": "By Poplar, Vitta, Engelbreit, Mary, and Bessler, John Gould (PHT)",
        "Description": "The author-artist shares her famous good taste with readers hungry for holiday tips, instructing them in how to set their table, welcome guests, prepare meals, and much more. 100,000 first printing.",
        "Category": " House & Home , Decorating",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Pil History of the American Auto",
        "Authors": "By Consumer Guide (EDT)",
        "Description": "",
        "Category": " Transportation , Automotive , General",
        "Publisher": "Omnigraphics Inc",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "American Visions: The Epic History of Art in America",
        "Authors": "By Hughes, Robert",
        "Description": "The companion volume to a eight-part, PBS series traces the history of art in America, from the early works of Native Americans, through its richly varied evolution, to the present day, including critical commentaries, anecdotes, profiles, and hundreds of illustrations. TV tie-in. 100,000 first printing.",
        "Category": " Art , History , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "6.55",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Happy animals' ABC",
        "Authors": "By Wing, Helen",
        "Description": "",
        "Category": "",
        "Publisher": "Rand McNally and Company",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Happy Birthday, Danny and the Dinosaur! (I Can Read Level 1)",
        "Authors": "By Hoff, Syd",
        "Description": "Readers first fell in love with Danny and his prehistoric pal in the I Can Read classic Danny and the Dinosaur, created by Syd Hoff in 1958. Now the popular pair are together again in an adventure sure to please beginning readersWhat would happen if a dinosaur came to a birthday party? Come to Danny's house and find out. His friend the dinosaur helps make this one party you'll never forget!Happy Birthday, Danny and the Dinosaur! is a Level One I Can Read book that is perfect for children learning to sound out words and sentences.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Birthdays",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "How Many Feet in the Bed?",
        "Authors": "By Hamm, Diane Johnston and Palmer, Kate Salley (ILT)",
        "Description": "Here is a fresh new counting book, filled with the happy helter-skelter of family life. \"How many feet are in the bed?\" Two -- until more members of the family jump into the bed.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Aladdin/Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Passion flowers in Italy",
        "Authors": "By Erskine, Rosalind",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "18.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "The Complete Perennials Book",
        "Authors": "By Rogers, Marilyn (EDT)",
        "Description": "This book combines in-depth information on using, selecting, and growing perennials with inspiring photographs in one easy-to-navigate package. From start to finish, this is the handbook on creating beautiful perennial beds:Design inspirationColorful garden plansIn-depth care instructionsAt-a-glance charts simplify buying decisions:Plants by size and shapeFlower color and bloom seasonMaterials for mulchingAn all-new edition written for gardeners from novice to expert:Comprehensive plant-selection guideTechniques for growing successPlanning a garden for year after year of beauty",
        "Category": " Gardening , Flowers , Perennials",
        "Publisher": "Ortho",
        "Price Starting With ($)": "5.86",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Musical Instruments of the World: An Illustrated Encyclopedia",
        "Authors": "By Diagram Group",
        "Description": "Examines the history and mechanical structure of wind, percussion, string, and electronic instruments, discusses ancient and foreign instruments, and offers brief profiles of composers, performers and inventors responsible for new developments",
        "Category": " Music , General",
        "Publisher": "Facts on File",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Santa's Holiday Treats: A Wilton Book of Recipes & Ideas",
        "Authors": "By Wilton Enterprises",
        "Description": "",
        "Category": "",
        "Publisher": "Wilton Industries Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Easter Eggs: 40 Fabulous Projects for the Whole Family",
        "Authors": "By Mead, Matthew",
        "Description": "Give the Easter bunny a few good eggs to work with this year. Easter Eggs features 40 fantastic decorating projects from kid-friendly sticker-dyed eggs to festive egg garlands and elegant eggshell candleholders. Matthew Mead, style editor at Country Home, pulls out all the stops withgorgeous color combinations and entirely original ideas. Each project features a beautiful photograph and easy-to-follow, directions. And to finish it off, we've included a deliciousand very necessaryegg salad recipe. Happy Easter!",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Quilting: A practical guide to quilting and patckwork with techniques, charts & beautiful projects",
        "Authors": "By Isabel Stanley, Jenny Watson",
        "Description": "",
        "Category": "",
        "Publisher": "HERMES HOUSE",
        "Price Starting With ($)": "7.19",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Tra Vigne Cookbook",
        "Authors": "By Chiarello, Michael and Wisner, Penelope",
        "Description": "People the world over come to California's wine country for a taste of the good life. They find it in abundance at Napa Valley's celebrated Tra Vigne restaurant (the name is Italian for \"among the vines\"), where an enchanting vineyard setting and chef Michael Chiarello's robust Italian dishes make for an unforgettable dining experience. Now, Chiarello takes readers behind the scenes at the restaurant, sharing recipes and reminiscences inspired by his years at Tra Vigne and the good Italian cooking of his family. The Tra Vigne Cookbook celebrates the natural beauty and abundance of the Napa Valley with a passionate gastronomic journey through the changing seasons. In addition to seasonal delights like roasted asparagus, lemon-braised artichokes, and pumpkin polenta, home cooks will discover the secrets for Tra Vigne classics such as herb gnocchi with braised lamb shanks and wild mushrooms, crunchy fritto misto with tomato vinegar, rich and crumbly Italian holiday cookies, and a decadent chocolate tiramis. With lush photographs and a strikingly contemporary design, The Tra Vigne Cookbook is a must-have cookbook this fall.",
        "Category": " Cooking , Regional & Ethnic , American , California Style",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "9.98",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "New Decorating Book (Better Homes & Gardens)",
        "Authors": "By Better Homes and Gardens Books and Caringer, Denise L. (EDT)",
        "Description": "12 whole-house tours from coast to coast8 before-and-after room makeoversTwo distinctly different decorating solutions for five different rooms8 pages of quick solutions to common dilemmas of decor A decorating taste test to define personal style18 pages of decorating projects, complete with instructionsOffers special tips on maximizing storage in bedrooms, baths, kitchens, dining rooms, and family roomsMultiple window treatments for typical window typesBuymanship tips and chartsURLs direct readers to additional decorating information and photosBonus Room Arranging Kit with templates and graph paper",
        "Category": " House & Home , Decorating",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Collector's Style (Better Homes & Gardens)",
        "Authors": "By Better Homes and Gardens Books",
        "Description": "Helps collectors arrange, enjoy, and perpetuate their hobbies.Photo tours of entire homes offer ideas on room-to-room flow using color, fabrics, and accessories.Shows how real-life collectors use decorative flair and ordinary products to carry out schemes for traditional, modern, and contemporary styles.Dozens of fun projects will inspire both novice and expert home decorators.Well-placed sidebars add informative tips on shopping, caring, and displaying collections.",
        "Category": " House & Home , Decorating",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Murder, She Wrote: Blood on the Vine",
        "Authors": "By Fletcher, Jessica and Bain, Donald",
        "Description": "Jessica Fletcher must solve a wine country caper when she takes a trip to Napa Valley in this mystery in in the long-running series.Jessica Fletcher is visiting California wine country while doing research for her next book, and invites her old friend, Scotland Yard detective George Sutherland to join her at a cozy Bed and Breakfast. No sooner do they arrive than they find the valley abuzz over the murder of a waiter at the restaurant owned by infamous ex-Hollywood heavyweight Bill Ladington. Ladington’s blatant womanizing and involvement in a bitter vineyard land dispute have already marked him as a dubious character—and a possible suspect.But when Ladington turns up dead himself from a supposed “suicide,” Jessica knows that a murderer is on the loose—and with a little help from George, she must try and bottle up a motive for murder from an extensive list of less-than-vintage suspects...",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Walls Came Tumbling Down: Joshua 1-6 for Children (Arch Books)",
        "Authors": "By Hill, Dave",
        "Description": "",
        "Category": "",
        "Publisher": "Concordia Publishing House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1967"
        }
    },
    {
        "Title": "Noodles: I'm Not Scared! (Hello Reader, Level 1)",
        "Authors": "By Wilhelm, Hans",
        "Description": "Noodles the dog searches for the perfect Halloween costume in this Level One Scholastic Reader!This adventure about everyone's favorite mischievous white puppy is now a Scholastic Reader!It's Halloween, and puppy wants to dress up. Should he be a big black bat? Or maybe a wise wizard? How about a funny clown?As he is getting ready, a bunch of scary ghosts are at the door! Boo! Puppy is scared, until he recognizes his friends underneath the costumes. Happy Halloween!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Pizza All Around",
        "Authors": "By Colgan, Dorothy R.",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Parachute Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Tyrants",
        "Authors": "By Foss, Clive",
        "Description": "The stories of 50 of the most evil tyrants in world history are presented here in chronological order, providing an intriguing look at man’s inhumanity to man.",
        "Category": " History , Reference",
        "Publisher": "Quercus",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Go, Dog. Go!: P.D. Eastman's Book of Things That Go",
        "Authors": "By Eastman, P. D.",
        "Description": "Whether by foot, boat, car, or unicycle, P. D. Eastman's lovable dogs demonstrate the many ways one can travel in this condensed, board-book version perfect for babies and toddlers.",
        "Category": " Juvenile Fiction , Animals , Dogs",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Power Surge: Six Marks of Discipleship for a Changing Church",
        "Authors": "By Foss, Michael W.",
        "Description": "",
        "Category": " Religion , Christianity , Lutheran",
        "Publisher": "Fortress Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Penguin State of the World Atlas, Seventh Edition",
        "Authors": "By Smith, Dan and Braein, Ane",
        "Description": "The completely up-to-date edition of this invaluable classic reference allows the reader a global overview of the elements that define the opening of the twenty-first century.  * The World at War  * The Rise of Globalization * Control of the Seas  * Control of Space * Superpowers  * Population Growth  * Urbanization * Traffic   * Energy Use * Global Warming  * Biodiversity * Stock Markets  * Human Rights * Children's Rights  * The Internet and Digital Media * Investment   * Health and Disease  Using a mainly visual analysis of data in full-color maps and graphics, Dan Smith gives shape and meaning to the statistics.",
        "Category": " Reference , Atlases, Gazetteers & Maps",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Dutchman's Flat: Stories",
        "Authors": "By L'Amour, Louis",
        "Description": "TURN HOME, RIDER   In this land, the place you leave behind might not be there when you get back. At least not the way you knew it. Tack Gentry of the G Bar, Chat Lock of Dutchman’s Flat, and Ward McQueen of the Tumbling K knew how it felt to struggle against men who were trying to take from them what they believed in. For the bad rush in when the good leave, and men will choose to fight, not just over drunken threats, gambling losses, and honor, but for land, friendships, family, and even love—a struggle magnificently captured in these eleven great stories written and handpicked by the incomparable Louis L’Amour himself.",
        "Category": " Fiction , Westerns",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Clay Cookery",
        "Authors": "By Consumer Guides",
        "Description": "",
        "Category": "",
        "Publisher": "IPCG",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The Busy Mom's Guide to Wisdom - A Guided Journal",
        "Authors": "By Whelchel, Lisa",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Howard Publishing Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Mouse's Christmas",
        "Authors": "By Baker, Alan",
        "Description": "",
        "Category": "",
        "Publisher": "Ben's Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "God's Best For Your Success",
        "Authors": "By jack-countryman",
        "Description": "For Ingest Only - Data needs to be cleaned up for all products being loaded",
        "Category": "",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Catholics, A Novel",
        "Authors": "By Brian Moore",
        "Description": "",
        "Category": "",
        "Publisher": "Holt, Rinehart and Winston",
        "Price Starting With ($)": "20.85",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "The Power and the Passion",
        "Authors": "By Christina Nicholson",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1978"
        }
    },
    {
        "Title": "The Warrior Trainer (Stones of Destiny, Book 1)",
        "Authors": "By Russell, Gerri",
        "Description": "When fierce warrior Scotia, the protector of the Stone of Destiny, which is the key to Scotland's salvation, falls in love with Ian MacKinnon, a clansman driven by revenge who seeks to learn her skills, she must choose between love and duty. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "A Well Pleasured Lady: Well Pleasured #2 (Well Pleasured Series, 1)",
        "Authors": "By Dodd, Christina",
        "Description": "Prim, plain, desperately virtuous Lady Mary Fairchild stared at the seductive gentleman and wondered -- did he remember the elements of the night they met? Surely not. In the ten years since, she had abandoned her youthful impetuousness and transformed herself into a housekeeper -- disguising her beauty beneath a servant's dour clothing determined to conquer the passions of the past.But Sebastian Durant, Viscount Whitfield, did recognize her as a Fairchild, one of his family's bitter enemies. When he demanded her help recovering a stolen diary, she dared not refuse him. When he proposed they masquerade as a betrothed couple, loyalty forced her to agree. And when the restraint between them shattered and pleasure became an obsession, Mary had to trust a powerful man who could send her to the gallows ... or love her through eternity.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Boys Will Put You on a Pedestal (So They Can Look Up Your Skirt): A Dad's Advice for Daughters",
        "Authors": "By Van Munching, Philip and Couric, Katie (FRW)",
        "Description": "Life can be pretty tricky when you're a teenage girl.  New things matter: Clothes. Parties. Boys. Suddenly being liked and being popular don't mean the same thing. Your parents get completely bizarre when the subject of dating comes up. A friend you've had forever stabs you in the back for no good reason. Everybody you know seems to feel free to comment on your constantly changing body. Drugs and alcohol go from being what you see \"bad\" kids doing on television shows to what you see your friends doing when no adults are around. How are you supposed to deal?  Since life doesn't come with a set of instructions, it helps to turn to people who have been through the stuff that you're facing. Even parents can help. (Really!) In Boys Will Put You on a Pedestal (so they can look up your skirt), former teenage boy -- and current dad of two daughters -- Philip Van Munching helps guide you through some of life's most confusing topics. From Beauty to Grief, from Sex to Fate, Van Munching covers the things you most want to know about and, in his wise, warm, and funny way, offers advice on how you can become the young woman you most want to be.",
        "Category": " Juvenile Nonfiction , Girls & Women",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Cycling For Women",
        "Authors": "By Rodale",
        "Description": "Advises women how to select a bicycle with the proper fit, discusses training and nutrition, and offers tips on touring",
        "Category": " Sports & Recreation , Cycling",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Interface Culture: How New Technology Transforms the Way We Create & Communicate",
        "Authors": "By Johnson, Steven",
        "Description": "Drawing on his own expertise in the humanities and on the Web, Steven Johnson not only demonstrates how interfaces - those buttons, graphics, and words on the computer screen through which we control information - influence our daily lives, but also tracks their roots back to Victorian novels, early cinema, and even medieval urban planning. The result is a lush cultural and historical tableau in which today’s interfaces take their rightful place in the lineage of artistic innovation. With a distinctively accessible style, Interface Culture brings new intellectual depth to the vital discussion of how technology has transformed society, and is sure to provoke wide debate in both literary and technological circles.",
        "Category": " Computers , Computer Science",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "A Perfect Bride (Avon Historical Romance)",
        "Authors": "By James, Samantha",
        "Description": "The incomparable USA Today bestseller Samanth James cordially invites you to Regency England for a Sterling affair . . .Perfectly MarvelousDevon St. James must surely be dreaming! She closes her eyes    in London's poorest slum, and awakens wrapped in fine linens . . . staring into the eyes of the most gorgeous man she has ever seen!  Sebastian Sterling, marquess of Thurston, is clearly shocked to have a girl from the streets in his bed, though the heat of the desire burning in his gaze is unmistakable. But if he believes Devon will easily submit, he is quite mistaken!What the devil has he done? It's bad enough their family is already mired in scandal, now Sebastian has to deal with the exquisite young beauty in rags he had impetuously carried into his home! Worse still, the lady is driving the serious, responsible marquess to distraction with her fiery spirit and breathtaking sensuality. But perhaps, just perhaps, with some of Sebastian's private schooling, this low-born enchantress can learn refinement and manners—and be miraculously transformed from merely his passionate obsession into . . .A Perfect Bride",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Cat Hiss-Tory: A Feline Tour Through the Ages",
        "Authors": "By Bell, Bill (ILT), Bell, Bill, and Templeton, Frederica",
        "Description": "A humorous illustrated survey of the role of cats in world hiss-tory.",
        "Category": " Juvenile Nonfiction , Humor , Comic Strips & Cartoons",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Bridget (The Women of Primrose Creek)",
        "Authors": "By Miller, Linda Lael",
        "Description": "They are the women of Primrose Creek, and their strength and passion is a match for the Nevada frontier they call home. Linda Lael Miller masterfully captures the hardships and dangers of a country swept by the winds of war -- and the daring and determination, the hopes and dreams of four unforgettable women -- in a thrilling new series.  When Bridget McQuarry comes to settle in Primrose Creek, she has nothing to lose; her husband, Mitch, was killed in the Civil War, and she has lost her family farm to ruinous Reconstruction taxes. With her baby son and a sister to care for, Bridget vows to make a new start out West. But when Mitch's best friend reappears in her life, he sparks a forbidden passion she thought was forever buried.  Trace Qualtrough grew up with Bridget and Mitch -- three happy childhood friends. But the attraction that fluttered between him and Bridget was silenced when she married Mitch. Now, Trace has come to fulfill Mitch's final wish -- to watch over the lovely, spirited Bridget. And now, Bridget and Trace must discover if their restless desire is a shattering betrayal -- or something sweeter the second time around.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Michael Michael - Why Do You Hate Me? - A Rabbi Meets The Messiah",
        "Authors": "By Michael Esses",
        "Description": "",
        "Category": "",
        "Publisher": "Logos International",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Full Cry: A Novel (\"Sister\" Jane)",
        "Authors": "By Brown, Rita Mae",
        "Description": "In the third novel of her captivating foxhunting series, Rita Mae Brown welcomes readers back for a final tour of a world where most business is conducted on horseback–and stables are de rigueur for even the smallest of estates. Here, in the wealth-studded hills of Jefferson County, Virginia, even evil rides a mount.The all-important New Year’s Hunt commences amid swirling light snow. It is the last formal hunt of the season; therefore, participation is required no matter how hungover riders are from toasting the midnight before. On this momentous occasion, “Sister” Jane Arnold, master of the foxhounds, announces her new joint master and the new president of the Jefferson Hunt. And her choices will prove to be no less than shocking.The day’s festivities are quickly marred, though, by what appears on the surface to be an unrelated tragedy. Sam Lorillard, former shining star and Harvard Law School alum, lies dead of a stab wound on a baggage cart at the old train station, surrounded by the outcasts and vagabonds who composed his social circle at the end of life. No one can remember when Sam started drinking, but the downward spiral was swift–and seemingly deadly. Murder is followed by scandal when Sister Jane discovers dishonest hunting practices going on in a neighboring club. Unsure whether to turn a blind eye or report the infringement to the proper authority, Sister and her huntsman, Shaker Crown, decide to investigate a little further, with the help of their trusty hounds. But when they come a little too close to the staggering truth–and uncover an unforeseen connection to Lorillard’s murder–they realize they might not survive to see the next New Year’s Hunt.Intricate, witty, and full of the varied voices of creatures both great and small, Full Cry is an astute reminder that even those with the bluest of blood still bleed red.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "The story of the Hare and the Tortoise and other tales (Great fairy tale classics)",
        "Authors": "By Holeinone, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "Tormont Publications Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "A Moon for the Misbegotten: A Play in Four Acts",
        "Authors": "By O'Neill, Eugene",
        "Description": "",
        "Category": "",
        "Publisher": "Samuel French",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Golf Essentials For Dummies: A Reference For The Rest Of Us",
        "Authors": "By Huggan, John and McCord, Gary",
        "Description": "Our hardcover editions of the best-selling For Dummies how-to guides feature stunning full-color photography and a handsome format that makes a great gift! This classic title is sure to be appreciated by anyone trying to learn the popular sport or improve his or her game. The authors, both noted golf commentators, provide a comprehensive guide to all elements of the sport, from proper stance to aiming, swinging, and scoring. They discuss special shots, conditions, and considerations, accompanied by explicit illustrations with clear, concise captions.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Mothers, Sons, and Lovers: How a Man's Relationship with His Mother Affects the Rest of His Life",
        "Authors": "By Gurian, Michael",
        "Description": "Through exercises and guided meditations, the author provides the means to uncover the influence of the primal bond between a man and his mother and to facilitate healing there—as well as in marriage, parenthood, friendship, and all other relationships of love.",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "Shambhala",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Relaxing on the Porch",
        "Authors": "By Megan Fulweiler",
        "Description": "",
        "Category": "",
        "Publisher": "780161",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "A Dictionary of Dance",
        "Authors": "By Murphy, Liz",
        "Description": "Dance is not just an art, it's a whole different language! In A Dictionary of Dance, readers will learn about arabesques, break dancing, choreographers, and the zones of the bodyeverything that comes together to make a dance, whether it's ballet or the polka. Liz Murphy's dynamic and expressive artwork is sure to inspire readers of all ages to get up and dance!",
        "Category": " Juvenile Nonfiction , Performing Arts , Dance",
        "Publisher": "Blue Apple Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Butt Rot & Bottom Gas",
        "Authors": "By Groves, Eric, Sr.",
        "Description": "butt rot /b@t rät/ n. a fungal disease affecting the butt, or base, of a tree bot•tom gas /bä2-t@m gas/ n. a type of breathing gas carried in portable tanks and inhaled by under-water divers   The English language is full of words that sound obscene but aren’t. Words like arsole (an organic chemical compound), crack spread (a calculation showing theoretical market values of petroleum), cunctator (a person who procrastinates, delays, or wastes time), and spotted dick (a traditional English dessert made with hot, thick custard).   Seventh-grade English teacher Eric Groves, Sr., has spent years listening to his students giggle after he used terms like thespian, coccyx, and masticate. Now he has compiled hundreds of these so-called “dirty” words into a delightful glossary, complete with illustrated definitions of their true meanings. From air cock (a valve on a boiler) and bushmaster (a large venomous snake) to cummingtonite (a mineral) and beyond, Butt Rot and Bottom Gas is a hilarious reference for word lovers and the snickering seventh grader in all of us.",
        "Category": " Reference , Dictionaries",
        "Publisher": "Quirk Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Addicted to War: Why the U.S. Can't Kick Militarism",
        "Authors": "By Andreas, Joel (ILT)",
        "Description": "Addicted to War takes on the most active, powerful and destructive military in the world. Hard-hitting, carefully documented and heavily illustrated, it reveals why the United States has been involved in more wars in recent years than any other country. Read Addicted to War to find out who benefits from these military adventures, who paysand who dies. Over 120,000 copies of the previous edition are in print. This new edition is substantially reworked and fully updated through the War in Iraq. A witty and devastating portrait of U.S. military policy.”Howard ZinnJoel Andreas wrote and illustrated The Incredible Rocky, the biting satire that introduced over 100,000 people to the unsavory activities of the Rockefeller family.In Oakland, California on March 24, 2015 a fire destroyed the AK Press warehouse along with several other businesses. Please consider visiting the AK Press website to learn more about the fundraiser to help them and their neighbors.",
        "Category": " Political Science , General",
        "Publisher": "AK Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Coffee Cakes: Simple, Sweet, and Savory",
        "Authors": "By Caruso, Maren (PHT) and Pappas, Lou Seibert",
        "Description": "Trust the author of Biscotti (over 200,000 sold) to deliver the secrets of great kuchen in the kitchen! Traditional coffee cakes, delicious new flavors, quick recipes, and more elaborate yeast breadsthey're all here, and they're all perfect for breakfast, brunch, picnics, and desserts. From sweet morning surprises such as Strawberry Coffee Cakes or Sticky Caramel Pinwheels to savories such as Ruby Grape Focaccia or Gruyre Cheese Brioche Braid and treats such as Dark Chocolate-Almond Cake, here are more than 50 simply-can't-go-wrong pleasers. Tips for baking techniques including preferred ingredients, how to manage dough, and how to store and serve coffee cakes are included in this gorgeously photographed collection. Bringing comfort to the table is made easyall it takes is Coffee Cakes!",
        "Category": " Cooking , Courses & Dishes , Cakes",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The Anti-War Quote Book",
        "Authors": "By Groves, Eric, Sr. (EDT)",
        "Description": "With words of wisdom by everyone from Socrates and Thomas Jefferson to Anne Frank, Alice Walker, Martin Luther King, Jr., and Bono, The Anti-War Quote Book features more than 250 inspiring and thought-provoking arguments for peace. Here's just a small sample: On propaganda: 'The first casualty, when war comes, is truth.'—Hiram Johnson On empires: 'Government is a tool, like a hammer. You can use a hammer to build with or you can use a hammer to destroy with.'—Molly Ivins On victory: 'One is left with the horrible feeling that war settles nothing, that to win a war is as disastrous as to lose one.'—Agatha Christie On peace: 'I think that people want peace so much that one of these days governments had better get out of the way and let them have it.'—Dwight D. Eisenhower Featuring a big, bold graphic design, archival photographs of peace rallies, and images of classic protest posters from around the world, The Anti-War Quote Book is guaranteed to fuel conversations as the election of 2008 unfolds.",
        "Category": " Reference , Quotations",
        "Publisher": "Quirk Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Marinades: The Secrets of Great Grilling",
        "Authors": "By Barnard, Melanie",
        "Description": "What&#39;s the secret to perfect barbecues? Marinate, marinate, marinate. Unmarinated food is never as tender, juicy and mouthwateringly delicious as food that has been soaked in a subtle sauce before being seared over open coals.  In Marinades, grill master Melanie Barnard provides 75 recipes to enhance the flavor of meat, poultry, seafood, vegetables and even fruits. Internationally inspired, these recipes include such delectable marinades as Adobo, Jamaican Jerk, Sake Teriyaki and Polynesian Passi on Fruit and Rum to tickle palates up and down the taste spectrum. In addition to the recipes, Barnard also offers practical grilling advice and tips on pairing foods with marinades.   Grilling is one of the best ways to add flavor to food without adding fat. As evidenced by the explosive demand for fancy grills, fuels and flammable additives such as mesquite and hickory, today&#39;s backyard barbecuing has outgrown shriveled hotdogs and charred chicken. For the legions of Americans hungry for the perfect barbecue, Marinades is the final, most important ingredient.",
        "Category": " Cooking , Specific Ingredients , Meat",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Does a Baboon Sleep in a Bed? (Early Experiences)",
        "Authors": "By Bolam, Emily (ILT) and Ehrlich, Fred",
        "Description": "Who sleeps in a bed? Does a polar bear? Does a beaver? Does a bumblebee? Do you? Bedtime is one of the most important times of the day for young children, and this latest addition to the informative Early Experiences series explains to children why only some animals have beds, but everybody goes to sleep. The perfect bedtime book! Written by Dr. Fred Ehrlich, a pediatrician and child psychiatrist, the fact-filled, question-and-answer Early Experiences books engage young children through humorous comparisons right at their level of comprehension.",
        "Category": " Juvenile Nonfiction , Health & Daily Living , General",
        "Publisher": "Blue Apple Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "West of the Sun",
        "Authors": "By Edgar Pangborn",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1953"
        }
    },
    {
        "Title": "Exploring Science and Belief (Questions of Faith)",
        "Authors": "By Poole, Michael",
        "Description": "Some scientists have religious beliefs…“… we must ourselves be prepared and willing to make a reasoned presentation of our faith, especially to young scientists, who have all too often concluded that a serious faith in a personal God and objective pursuit of scientific truth are incompatible.”—Professor Francis Collins, Director, National Human Genome Research Institute… some do not“… the beliefs of most popular religions… by scientific standards… are based on evidence so flimsy that only an act of blind faith can make them acceptable.”—Dr Francis Crick (co-discoverer of DNA’s structure)However, science and belief are both very important for us. Do we have to choose between them? The view that science and belief are in conflict is a major stumbling block for many people today. Michael Poole addresses this issue in Exploring Science and Belief.Is science the ultimate test of what to believe?Do its laws make belief in miracles impossible?Has Darwin’s work ruled out the idea of a creating God?How did the universe develop?Was it accidental or planned?What will happen to it eventually?Do we have any significance in it?These are some of the questions addressed in Exploring Science and Belief. Although he “… start(s) from what is for the theist the conviction, for the agnostic the hypothesis, and for the atheist the delusion that God exists,” Michael Poole also dicusses evidence for God’s existence.Table of ContentsIntroduction1 God’s “Two Books”2 Watch Your Language!3 Explaining Explanations4 Belief, Faith and Evidence5 Miracles6 First and Last Things7. The Galileo Affair8. Enemies or Allies?9. Creation and Evolution10. Accident or Design?EndnotesGlossary",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Hendrickson Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "The Windchime Legacy",
        "Authors": "By A.W. Mykel",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Road Taken",
        "Authors": "By Jaffe, Rona",
        "Description": "A richly textured chronicle of the twentieth century follows the century-long life story of Rose Smith, who is born in 1900, loses her mother in childhood, and witnesses firsthand the remarkable history-making events, changes, and advances taking place in America. Reprint.",
        "Category": " Fiction , Literary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Blizzard",
        "Authors": "By Mattie Lamb Curtis",
        "Description": "",
        "Category": "",
        "Publisher": "Dutton",
        "Price Starting With ($)": "11.08",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Agent Of Byzantium",
        "Authors": "By Harry Turtledove",
        "Description": "Agent Of Byzantium by Harry Turtledove released on Sep 23, 1988 is available now for purchase.",
        "Category": "",
        "Publisher": "Worldwide Library",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "All Talking! All Singing! All Dancing! : A Pictorial History of the Movie Musical",
        "Authors": "By John Springer",
        "Description": "",
        "Category": "",
        "Publisher": "Cadillac Publishing",
        "Price Starting With ($)": "24.27",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "The Handbook of Style: Expert Fashion and Beauty Advice",
        "Authors": "By Maroukian, Francine (CON) and Woodruff, Sarah (CON)",
        "Description": "Expert Advice for Improving Your Look   The Handbook of Style is packed with fashion and beauty techniques every woman should know—straight from today’s top hair stylists, skin specialists, fashion designers, and makeup artists. Learn how to:        •  Make a smoky eye, from Jeanine Lobell of Stila Cosmetics      •  Become Your Own Makeup Artist ®, from Paula Dorf of Paula Dorf Cosmetics      •  Buy a bra that fits, from Michael Rabinowitz of Le Mystère      •  Spot a comfortable and sexy shoe, from Donald J Pliner of the Donald J Pliner Collection   With its accessible, step-by-step instructions, The Handbook of Style is the ultimate crash course in personal presentation.",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "Quirk Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    }
]