[
    {
        "Title": "Frank Lloyd Wright: A gatefold portfolio",
        "Authors": "By Sommer, Robin Langley",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "How to Photograph Works of Art",
        "Authors": "By Collins, Sheldan",
        "Description": "The cover declares this is \"A practical guide for photographers, artists, private collectors, gallery owners, antique dealers ...\". Lucid instructions and mouth-watering examples (we must overlook the caption identifying a Navajo squash-blossom necklace as \"Tibetan\"-pl.11). Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Photography , General",
        "Publisher": "Amphoto",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Architecture Is Elementary - Visual Thinking Through Architectural Concepts",
        "Authors": "By Winters, Nathan B.",
        "Description": "",
        "Category": " Architecture , Criticism",
        "Publisher": "Gibbs Smith, Publisher",
        "Price Starting With ($)": "5.65",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Mastering Wine",
        "Authors": "By Maresca, Thomas",
        "Description": "A noted wine expert offers a step-by-step guide to the wines of the world and discusses such concepts as tannin, acid, bouquet, fruit, varietals, body, texture, and balance while explaining how individuals can educate their palate",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Golf Games Within the Game: 200 fun ways players can add variety and challenge to their game",
        "Authors": "By Valentine, Linda, Hubbard, Margie, and Boyd, Ben (ILT)",
        "Description": "Describes more than two hundred games suggested by members of golf clubs across the country and includes a listing of golf terminology",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Perigee Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Miracle Sugars: The Glyconutrient Link to Disease Prevention and Improved Health (Woodland Health)",
        "Authors": "By Elkin, Rita M. H.",
        "Description": "Putting the terms \"sugar\" and \"health\" together seems almost like a paradox, but emerging evidence shows that certain types of sugars-commonly called saccharides or glyconutrients-are responsible for fighting off disease and maintaining overall health. In MIRACLE SUGARS, author Rita Elkins explains how eight essential sugars are at the core of our cells' ability to communicate and cooperate in the maintenance and balance of our bodies. The book outlines how these essential saccharides, which are found naturally in food and in available supplements, can fight infection, enhance immune function and battle an impressive variety of health disorders. These sugars have been shown to reverse autoimmune disorders and diabetes, ease allergy symptoms, lower risk of heart disease, and improve overall function of the body's immune processes. Infections respond well to use of saccharides, as do symptoms of fibromyalgia, chronic fatigue and lupus. Even cancer patients have found glyconutrients to enhance traditional treatments while lessening their side effects. Glyconutrients can provide a world of benefits when it comes to your health.",
        "Category": " Health & Fitness , Nutrition",
        "Publisher": "Woodland Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Cleaning Encyclopedia, The",
        "Authors": "By Aslett, Don and Otteson, Kerry (ILT)",
        "Description": "The ultimate guide to the art of cleaning, this reference is packed with professional secrets for getting maximum results through minimum results through minimum effort. Discover how to save time, money, and elbow grease on every cleaning problem, as well as how to prevent housework with surprising tricks of the trade. From aluminum siding to zoom lenses, this alphabetical index covers every job, big and small.",
        "Category": " House & Home , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Improve your memory: Nutrients, lifestyle tips, and strategies",
        "Authors": "By Turkington, Carol",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Make-It-Simple Entertaining: Fabulous Menus for Festive Celebrations",
        "Authors": "By Nestle Food Corporation, Better Homes and Gardens",
        "Description": "Features recipes and menu ideas for special occasions ranging from Thanksgiving and wedding shower luncheons to a celebration of chocolate and wine-and-cheese parties",
        "Category": " Cooking , Entertaining",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "The Two Faces of Islam: The House of Sa'ud from Tradition to Terror",
        "Authors": "By Schwartz, Stephen",
        "Description": "Journalist and author Schwartz has worked for the Jewish  Forward  and the Voice of America, and been an interfaith activist in Bosnia-Herzegovina and Kosovo as well as writing books on history and culture. He challenges the hegemony of Saudi-backed extremism in the Muslim world, but also rejects the simplistic crusader polemics now so prevalent in western intellectual life. Annotation (c) Book News, Inc., Portland, OR (booknews.com)",
        "Category": " History , Middle East , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Seven Steps to Nirvana: Strategic Insights into eBusiness Transformation",
        "Authors": "By Zabin, Jeff, Tapscott, Don (FRW), and Sawhney, Mohanbir S.",
        "Description": "Today¿s most successful companies never sit still. Even as they introduce their newest e-business initiatives, their next generation of improvements is already near completion. Traditional organizations¿especially larger, low-tech businesses¿must reinvent themselves if they are to hold their positions against these new business competitors.   The Seven Steps to Nirvana leads managers through the systematic stages needed to transform traditional businesses¿regardless of their industries¿into fierce competitors. Combining hard-hitting analyses with case studies of businesses that made the transition, this concrete, practical tour de force opens readers¿ minds to:   Essential differences between e-commerce and e-business The evolutionary stages of e-business intervention Strategies to overcome inertia and organize for speed   Written by one of BusinessWeek's 25 most influential e-business innovators, The Seven Steps to Nirvana is a trove of innovative techniques for brick-and-mortar businesses to meet--and overcome--the challenges of today's faster, nimbler e-upstarts.",
        "Category": " Computers , Electronic Commerce",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.84",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Beer Enthusiast's Guide: Tasting & Judging Brews from Around the World",
        "Authors": "By Smith, Gregg",
        "Description": "",
        "Category": " Cooking , Beverages , Beer",
        "Publisher": "Storey Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "The Age of Calamity: Time Frame AD 1300-1400",
        "Authors": "By Time-Life Books (EDT)",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Empires Ascendant: Time Frame 400 Bc-Ad 200",
        "Authors": "By Time-Life Books",
        "Description": "Examines the different cultures that were emerging between 400 BC and AD 200",
        "Category": " History , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Winds of Revolution: Time Frame AD 1700-1800 (Time Frame)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "The European Emergence: Time Frame AD 1500-1600 (Time Frame)",
        "Authors": "By Editors of Time-Life Books",
        "Description": "Describes events of the sixteenth century, including the Reformation, Elizabeth's reign over England, the discovery of the New World, and Russia under Ivan the Great",
        "Category": " History , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Bridge: Improve Your Defence",
        "Authors": "By Sowter",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins Distribution Services",
        "Price Starting With ($)": "8.34",
        "Publish Date": {
            "Month": "August",
            "Year": "1981"
        }
    },
    {
        "Title": "The Anatomy & Physiology Learning System",
        "Authors": "By Applegate, Edith J.",
        "Description": "This popular text takes a dynamic and accessible approach to a complex and often intimidating subject. Colorful and eye-catching, it cuts straight to the basics readers need to know, emphasizing medical terminology and clinical applications in an easy-to-grasp fashion. 595 illustrations (280 in full color) make anatomy and physiology come alive.",
        "Category": " Medical , Physiology",
        "Publisher": "Saunders",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Cooking Class Chicken Cookbook",
        "Authors": "By Publications International",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Poultry",
        "Publisher": "Pubns Office-Fenni",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Management 21C",
        "Authors": "By Chowdhury, Subir",
        "Description": "Not a textbook for the third quarter of a business course, but a synthesis of what some two-dozen management specialists think the direction of management and business will be in the 21st century. Among the topics are leadership as collective genius, ultra-rapid management processes, and the customized workplace. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Business & Economics , Management",
        "Publisher": "Financial Times/ Prentice Hall",
        "Price Starting With ($)": "5.54",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Thicker than Oil: America's Uneasy Partnership with Saudi Arabia",
        "Authors": "By Bronson, Rachel",
        "Description": "For fifty-five years, the United States and Saudi Arabia were solid partners.  Then came the 9/11 attacks, which sorely tested that relationship.  In Thicker than Oil, Rachel Bronson reveals why the partnership became so intimate and how the countries' shared interests sowed the seeds of today's most pressing problem--Islamic radicalism.        Drawing on a wide range of archival material, declassified documents, and interviews with leading Saudi and American officials, Bronson chronicles a history of close, and always controversial, contacts.  She argues that contrary to popular belief the relationship was never simply about \"oil for security.\"   Saudi Arabia's geographic location and religiously motivated foreign policy figured prominently in American efforts to defeat \"godless communism.\"   From Africa to Afghanistan, Egypt to Nicaragua, the two worked to beat back Soviet expansion. But decisions made for hardheaded Cold War purposes left behind a legacy that today enflames the Middle East.  In this landmark work, Bronson exposes the political calculations that drove this secretive relationship.  Her lively narrative is interwoven with colorful stories of diplomatic adventures and misadventures--including details of high-level backchannel conversations, awkward cross-cultural encounters, and a bizarre American request for the Saudi government to subsidize Polish pork exports, a demand the U.S. Ambassador refused to deliver.  Looking forward, she outlines the challenges confronting the relationship. The Saudi government faces a zealous internal opposition bent on America's and Saudi Arabia's destruction. Yet from the perspective of both countries, the status quo is clearly unsustainable.  This book shows how this crucial relationship evolved, and suggests ways to chart its future course.",
        "Category": " Political Science , International Relations , Diplomacy",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.61",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "All-American Low-Fat Meals in Minutes: Recipes and Menus for Special Occasions or Every Day",
        "Authors": "By Smith, M. J.",
        "Description": "Discusses the advantages of a low fat diet, suggests ways to achieve one, and shares seasonal menus and recipes",
        "Category": "",
        "Publisher": "Chronimed Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Reconstructed Yankee",
        "Authors": "By Maples, Jack",
        "Description": "Follows Caleb Parker, a free black man in North Carolina, as he and his white friend Tom join the Union militia and later transfer to the Confederate Army after witnessing Union atrocities, and Caleb's later disappointment with Reconstruction.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Corinthian Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Successful Project Management (with Microsoft Project 2003, 120 Day Version and InfoTrac) (Available Titles CengageNOW)",
        "Authors": "By Gido, Jack and Clements, James P.",
        "Description": "With an emphasis on effective communication, this textbook for students and practitioners describes the fundamental concepts and techniques of project management. Sample topics include schedule control, cost planning, team building, and project documentation. The third edition features real-world project management vignettes in each chapter as well as new material on risk management and ethics. The CD-ROM contains a trial version of Microsoft's Project Professional 2003. Annotation ©2006 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Business & Economics , Management",
        "Publisher": "South-Western College Pub",
        "Price Starting With ($)": "6.72",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Home to Big Stone Gap: A Novel",
        "Authors": "By Trigiani, Adriana",
        "Description": "Millions of readers around the world have fallen in love with the novels of the New York Times bestselling author Adriana Trigiani. In Home to Big Stone Gap, she tells her most powerful story yet, full of humor and heart, wisdom and hope.Nestled in the lush Blue Ridge Mountains of Virginia, the town of Big Stone Gap has been home for Ave Maria Mulligan Machesney and her family for generations. She’s been married to her beloved Jack for nearly twenty years, raised one child and buried another, and run a business that binds her community together, all while holding her tight circle of family and friends close. But with her daughter, Etta, having flown the nest to enchanting Italy, Ave Maria has reached a turning point. When a friend’s postcard arrives with the message “It’s time to live your life for you,” Ave Maria realizes that it’s time to go in search of brand-new dreams. But before she can put her foot on the path, her life is turned upside down. Ave Maria agrees to helm the town musical, a hilarious reunion of local talent past and present. A lifelong friendship collapses when a mysterious stranger comes to town and reveals a long-buried secret. An unexpected health crisis threatens her family. An old heartthrob reappears, challenging her marriage and offering a way out of her troubles. An opportunistic coal company comes to town and threatens to undermine the town’s way of life and the mountain landscape Ave Maria has treasured since she was a girl. Now she has no choice but to reinvent her world, her life, and herself, whether she wants to or not. Trigiani is at her best in this exquisite page-turner. Home to Big Stone Gap is an emotional and unforgettable journey that reminds us that you can go home again and again. From BOOKLIST*STAR* Trigiani, Adriana. Home to Big Stone Gap. Nov. 2006. 301p. Random, $25.95 (1-4000-6008-7). Tucked in the Blue Ridge Mountains of Virginia is Big Stone Gap, the bucolic backdrop for Trigiani’s popular series. In this fourth entry, Ave Maria Mulligan MacChesney and her husband, Jack, must come to terms with the absence of daughter Etta, newly married and living in Italy. (The country holds a special place in Ave Maria’s heart: her biological father, Mario, whom she learned of and met only after her mother’s death, is Italian). Ave Maria has plenty to keep her mind off missing her only child (the MacChesney’s son, Joe, died of leukemia at age four). She’s a full-time pharmacist and the newly appointed director of the town’s annual musical. Then comes news that her longtime friend, glamorous librarian Iva Lou, has been keeping a startling secret for nearly 20 years. Other developments, including a health scare for Jack and a Christmas visit from a colorful former resident, move the plot along briskly. With her original cast of characters, playwright and television writer Trigiani blends playfulness and pathos in this evocative portrait of a small southern town. Fans of the Big Stone Gap series can look forward to a feature film; Trigiani has written the screenplay and is slated to direct. –Allison Block\"Is there ever trouble for Ave Maria Mulligan MacChesney, heroine of Trigiani's beloved Big Stone Gap novels, starting with her married daughter's move to Italy and leading right up to a stranger's disturbing appearance in town.\"–Library JournalPraise for the Big Stone Gap novels:“Delightfully quirky . . . chock-full of engaging, oddball characters and unexpected plot twists.”–People (Book of the Week)“Funny, charming, and original.”–Fannie Flagg“Satisfying reading . . . As skillfully as Ms. Trigiani makes us laugh, she makes us cry.”–Richmond Times-Dispatch“Heartwarming . . . Everything that really matters is here: humor, romance, wisdom, and drama.”–The Dallas Morning NewsFrom the Hardcover edition.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "World Religions and Cults 101: A Guide to Spiritual Beliefs (Christianity 101®)",
        "Authors": "By Bickel, Bruce and Jantz, Stan",
        "Description": "Why are there so many religions? Do they basically teach the same thing? Bruce and Stan address these questions and more as they take a close look at some of the world's major religions and belief systems. From Islam to Jehovah's Witnesses and from New Age Spirituality to Atheism, Darwinism, and Naturalism, World Religions and Cults 101 features—key teachings of each religionquick-glance belief chartsbrief biographies of leadersstudy questions for group or individual usesuggested readingReaders will also discover why spiritual searching is universal, how each religion compares to Christianity, the characteristics of cults, and what makes Christianity unique.Formerly titled Bruce & Stan's® Guide to Cults, Religions, and Spiritual Beliefs",
        "Category": " Religion , Cults",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The Buck Stops Here: The Presidents of the United States",
        "Authors": "By Provensen, Alice",
        "Description": "Surveys the presidents of the United States, examining the events that marked each administration including key historical events, battles, discoveries, inventions, and more",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Decorating with Color Inside and Out",
        "Authors": "By Sally Walton, Richard Rosenfeld",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Cooking Light: Dessert",
        "Authors": "By Averett, Heather (EDT)",
        "Description": "This volume is specially created as part of The Cooking Light Cook’s Essential Recipe Collection. When we say essential, we mean necessary, indispensable, even crucial. These are the recipes our staff simply can’t do without. They are our own tried-and-true favorites, and we hope they’ll soon be yours, too. When you take the time to cook, you want to trust in top-rated, kitchen-tested, healthful dishes that promise success and great flavor. In this volume you’ll find: Over 60 essential kitchen-tested dessert recipes! From New York Cheesecake to Gingersnaps, and from Easy Lemon Squares to vibrant Blueberry Gelato, Cooking Light Dessert offers you over 60 of Cooking Light magazine’s best-of-the-best dessert recipes. Spoon into a thick and creamy parfait glass filled with chocolaty Mocha Pudding  Over 100 bold and bright full-color photos! Each essential recipe is accompanied by a beautifully vivid full-page color photograph, along with an additional image and information on a particular ingredient or technique that’s crucial to the recipe. Complete nutritional information for each recipe! In your quest to eat smart, be fit, and live well, you’ll find the complete nutritional analysis for each recipe amazingly helpful. Looking for a low-cal dessert? Try Strawberries and Oranges with Vanilla-Scented Wine. Need less sodium? Lemon-Ginger Sorbetto is ideal. Or maybe you want to increase your calcium intake. If so, Vanilla Bean Crème Brûlée  is a good choice. A complete guide to all things dessert! Have a question about how to measure ingredients accurately? Or are you in search of the proper way to make the perfect pastry? Then check out our Cooking Class. This section is devoted to the ins and outs of making delicious and dependable desserts. You’ll learn how to make perfect layer cakes and low-fat cookies, and we’ll show you the best tools for your kitchen. It’s everything you need to make great desserts!",
        "Category": " Cooking , Courses & Dishes , Desserts",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The Ultimate Golf Book: The Essential Guide to Playing Better Golf",
        "Authors": "By Newell, Steve (EDT)",
        "Description": "With such notable contributors as Jack Nicklaus, Greg Norman, and Nick Faldo, this indispensable how-to manual can help any golfer identify and correct his weaknesses, improve his game, and lower his score.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Debbie Travis' Decorating Solutions: More Than 65 Paint and Plaster Finishes for Every Room in Your Home",
        "Authors": "By Travis, Debbie and Dingle, Barbara",
        "Description": "Presents a rich array of innovative paint and plaster finishes intended to transform a room's drawbacks into a unique design, offering full-color, step-by-step photographs to help readers create their own individual decorating solutions. 65,000 first printing. Tour.",
        "Category": " House & Home , Decorating",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Satisfying Soups: Homemade Bisques, Chowders, Gumbos, Stews & More",
        "Authors": "By Hobson, Phyllis",
        "Description": "From entr,e soups using meats, fish, and vegetables to sweet soups using fruits, cooks will find delightful variety in Hobson's 214 traditional and unusual recipes.",
        "Category": " Cooking , Reference",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Energy-Efficient Houses (Great Houses)",
        "Authors": "By Fine Homebuilding Magazine (EDT)",
        "Description": "Energy-efficient houses have more than just cost savings going for them. They can be stunningly beautiful and individualistic and fit into their surroundings with grace and style. The 31 articles from FINE HOMEBUILDING magazine collected here show how designers and builders have incorporated energy considerations into both traditional and modern houses, built for hot and cold and wet climates.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Economics Level 1 2009 (CFA Programa Curriculum Vol. 2, Volume 2 - Economics)",
        "Authors": "By Pearson Custom Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Pearson Custom Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Roasting: A Simple Art",
        "Authors": "By Kafka, Barbara",
        "Description": "When you're hungry, roast.  When you're in a rush, roast.  When you're in doubt, roast.  When you're entertaining, roast.  Crank up the oven and throw in a chicken; roasting is simply the easiest and best way to concentrate and deepen flavor, to seal in succulence, and make robust, crusty, and sweet all kinds of meats, birds, fish, fruits, and vegetables. Roasting offers more flavor on its own than any other cooking technique. Everything you need for a lifetime of happy roasting can be found here in the pages of Barbara Kafka's ground-breaking new book. Even baby goat, a suckling pig, and loin of buffalo make it into this bible of roasting.   Roasting is absolutely essential, whether you're planning to roast a potato or leg of lamb, a turkey or a tomato, a pepper or a red snapper. Barbara's fussless high-temperature method caramelizes the surface of meat, the skin of birds or fish, or the outside of vegetables, transforming them into such savory sweet dishes as Roast Chicken with Pomegranate Glaze and Fresh Mint, aromatic Garlic Roast Pork Loin, moist and sweet Roasted Striped Bass with Fennel, and Whole Roasted Peaches with Ginger Syrup.  Nearly one hundred stellar recipes for roasted vegetables attest to the fact that Barbara Kafka's new book is not for meat eaters alone. The recipes for roasted vegetables begin where other books leave off. Try the Roasted Sliced Fennel Bulb and the Roasted Chinese Eggplant with Balsamic Marinade, the Roasted Portobello Mushrooms with Garlic Marinade, and more.   Roasting is packed with indispensable tips, techniques, and innovative cooking ideas. There are great recipes for marinades, salsas, vinaigrettes, and stuffings. You'll also find an inspiring assortment of simple but original recipes for sauces that will lift your everyday roasts into perfect party fare. You'll discover, too, the many joys of \"companion roasting,\" learning when to add the carrots or the onions so they don't over- or undercook, and guaranteeing everything comes out at the same time.  Never a believer in unnecessary work, Barbara Kafka is a cook's best friend. Barbara never follows; she blazes new trails, challenging the sacred rules of roasting by never trussing a chicken or basting a turkey. She proves you can actually walk away from your oven and enjoy your food and your guests. It's all so quick and easy, most dishes don't need to go into the oven until your guests walk in the door.  Often the best part of the roast is the leftovers, and  Roasting is overflowing with possibilities. In Barbara's knowing hands leftover onions become a smoky-flavored Roasted Onion Soup with Cannellini Beans; last night's roasted cod and boiled potatoes are transformed into a scrumptious Best Cod Hash; a deeply flavored Roast Duck Pasta Sauce is a rich reward to the cook for having made last night's duck dinner. Nearly one hundred recipes for leftovers show you how to build them into new meals of soups, salads, pasta sauces, hashes, fritters, fish cakes, and more.  Replete with all the tables, timing charts, and the encyclopedic wisdom that are hallmarks of every Barbara Kafka book,  Roasting: A Simple Art is a dream of a cookbook, one that will soon bear the soils, stains, and well-worn pages of constant and creative use.",
        "Category": " Cooking , Methods , Baking",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Sunday Suppers Classic Recipes",
        "Authors": "By Publications International",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Photography & The Art of Seeing",
        "Authors": "By Freeman Patterson",
        "Description": "",
        "Category": "",
        "Publisher": "Van Nostrand Reinhold",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Bicycling the Blue Ridge: A Guide to the Skyline Drive and the Blue Ridge Parkway",
        "Authors": "By Skinner, Elizabeth and Skinner, Charlie",
        "Description": "",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Menasha Ridge Press, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Understanding Nanotechnology (Science Made Accessible)",
        "Authors": "By Fritz, Sandy and Roukes, Michael L. (FRW)",
        "Description": "Reprints ten articles published in  Scientific America  during 2000 and 2001 that explore the possibilities offered by the next generation of miniaturized technologies.  The contributors discuss obstacles to fully functioning nanomachines, applications for drug delivery and genetic testing, and the creation of nanometer-scale electronic components from organic molecules. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Science , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Top Management Strategy: What It Is and How to Make It Work",
        "Authors": "By Tregoe, Benjamin B. and Zimmerman, John W.",
        "Description": "Identifying the nine basic strategic areas that influence the goals of any organization, Tregoe argues that only one of these areas should serve as the decisive factor in making basic product and market choices",
        "Category": " Business & Economics , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "Low-calorie cookbook",
        "Authors": "By Crocker, Betty",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "The American People",
        "Authors": "By Kahn, E. J.",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Web Services, Service-Oriented Architectures, and Cloud Computing (The Savvy Manager's Guides)",
        "Authors": "By Barry, Douglas K.",
        "Description": "Web services are leading to the use of more packaged software either as an internal service or an external service available over the Internet. These services, which will be connected together to create the information technology systems of the future, will require less custom software in our organizations and more creativity in the connections between the services. This book begins with a high-level example of how an average person in an organization might interact with a service-oriented architecture. As the book progresses, more technical detail is added in a \"peeling of the onion\" approach. The leadership opportunities within these developing service-oriented architectures are also explained. At the end of the book there is a compendium or \"pocket library\" for software technology related to service-oriented architectures. · Only web services book to cover both data management and software engineering perspectives, excellent resource for ALL members of IT teams · Jargon free, highly illustrated, with introduction that anyone can read that then leads into increasing technical detail · Provides a set of leadership principles and suggested application for using this technology.",
        "Category": " Computers , Information Technology",
        "Publisher": "Morgan Kaufmann",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "The Super Power Golfer",
        "Authors": "By Romatowski, Michael",
        "Description": "",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Pierpoint-Martin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Blind Spot: The Secret History of American Counterterrorism",
        "Authors": "By Naftali, Timothy",
        "Description": "In this revelatory new account, national security expert Timothy Naftali relates the full story of America's decades-long attempt to fight terrorism. On September 11, 2001, a long history of failures and missteps came to a head, with tragic results. But, explains Naftali, it didn't have to be so. Blind Spot traces the long history of American efforts to thwart terrorism, from World War II to the Munich Games hostage-taking to the first attack on the World Trade Center in 1993. In riveting detail, based on original research and interviews with the key participants, Naftali describes why our early successes in counterterrorism did not translate into success against Osama bin Laden later in the 1990s, and why, until 9/11, the domestic threat of terrorism was the largest blind spot in United States national security.",
        "Category": " History , World",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Chinese Brush Painting Workstation (Workstations)",
        "Authors": "By Holt, Rod and I-Ching",
        "Description": "An introduction to a six-thousand-year-old art includes four ink palettes, two special brushes, an inkstone and ink, a spoon and mixing dish, Chinese painting paper, and step-by-step instructions to basic styles, symbols, and brush techniques.",
        "Category": " Juvenile Fiction , Sports & Recreation , General",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "UML DISTILLED: APPLYING THE STANDARD OBJECT MODELLING LANGUAGE (OBJECT TECHNOLOGY SERIES)",
        "Authors": "By Fowler, Martin and Scott, Kendall",
        "Description": "",
        "Category": " Computers , Programming , Object Oriented",
        "Publisher": "Addison Wesley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Life in the Fabulous Fifties",
        "Authors": "By Bettina Miller",
        "Description": "",
        "Category": "",
        "Publisher": "Reminisce",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Biochemistry (Lippincott Illustrated Reviews Series)",
        "Authors": "By Champe, Pamela C., Harvey, Richard A., Ph.D., and Ferrier, Denise R., Ph.D.",
        "Description": "Lippincott’s Illustrated Reviews: Biochemistry has been the best-selling medical-level biochemistry review book on the market for the past ten years. The book is beautifully designed and executed, and renders the study of biochemistry enormously appealing to medical students and various allied health students. It has over 125 USMLE-style questions with answers and explanations, as well as over 500 carefully-crafted illustrations. The Third Edition includes end-of-chapter summaries, illustrated case studies, and summaries of key diseases.",
        "Category": " Medical , Biochemistry",
        "Publisher": "LWW",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "The Traveling Photographer",
        "Authors": "By ann and Carl Purcell",
        "Description": "",
        "Category": "",
        "Publisher": "Watson Guptill Publications",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Kingsford Best Barbecues (Favorite All Time Recipes Series)",
        "Authors": "By Products, Kingsford (Other Contributor)",
        "Description": "",
        "Category": "",
        "Publisher": "Pubns Intl Ltd",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Digital Moviemaking: The Filmmaker's Guide to the 21st Century",
        "Authors": "By Billups, Scott",
        "Description": "In this hip, irreverent book, readers will learn exactly what they need to make their own digital movie and become a hot filmmaker of tomorrow. Billups, an accomplished digital effects artist, provides updates on the latest equipment, techniques, and formats through links to custom Web sites. 28 color photos.",
        "Category": " Performing Arts , Film & Video , General",
        "Publisher": "Michael Wiese Productions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Unlimited Real Estate Profit",
        "Authors": "By Garrison, Marc Stephan and Tripp-Garrison, Paula",
        "Description": "A guide to creating wealth through real estate investments covers such topics as investment analysis, real estate market analysis, negotiation strategies, managing and selling properties, and domestic absorption markets.",
        "Category": " Business & Economics , Real Estate , General",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "The Promise of Sleep: A Pioneer in Sleep Medicine Explores the Vital Connection Between Health, Happiness, and a Good Night's Sleep",
        "Authors": "By Dement, William C. and Vaughan, Christopher",
        "Description": "Sleep better, live longer with the groundbreaking information and step-by-step program in this revolutionary book.Healthful sleep has been empirically proven to be the single most important factor in predicting longevity, more influential than diet, exercise, or heredity. And yet we are a sleep-sick society, ignorant of the facts of sleep--and the price of sleep deprivation. In this groundbreaking book, based on decades of study on the frontiers of sleep science, Dr. William Dement, founder and director of the Stanford University Sleep Research Center, explains what happens when we sleep, when we don't, and how we can reclaim the most powerful--and underrated--health miracle of all. Taking us on a fascinating tour of our sleeping body and mind, Dr. Dement reveals the price we have paid for ignoring sleep--an epidemic of heart disease, 33 percent of traffic-fatigue-related accidents, and immeasurable mental and psychological disadvantages. And he offers a hands-on prescription for vibrant good health and longevity, including...self-tests to determine how much sleep you really need...the role of prescription and over-the-counter sleeping aids...the latest research on how sleep affects the immune system...how to combat insomnia, snoring, and jet lag...plus information on sleep disorder clinics nationwide, Web sites, and more.Taking readers on a fascinating tour of our sleeping body and mind, Dr. William C. Dement reveals the price paid for ignoring sleep--an epidemic of heart disease, traffic-fatigue-related accidents (responsible for a full third of all traffic accidents), and immeasurable mental and psychological disadvantages. Offering a hands-on prescription for vibrant good health and longevity, THE PROMISE OF SLEEP includes self-tests to determine how much sleep you really need, full information on the role of prescription and over-the-counter sleeping aids, the latest research on how sleep affects the immune system, helpful methods for combating insomnia, snoring, and jet lag, plus information on sleep disorder clinics nationwide, sleep disorder Web sites, and more. -->",
        "Category": " Health & Fitness , Reference",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Painting Murals: Images, Ideas, and Techniques",
        "Authors": "By Seligman, Patricia",
        "Description": "Briefly looks at the history of murals, discusses paints, brushes, composition, and perspective, and shows a variety of decorative and surreal murals",
        "Category": " Art , Techniques , General",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Object Life Cycles: Modeling the World In States",
        "Authors": "By Shlaer, Sally and Mellor, Stephen J.",
        "Description": "A companion handbook to Shalaer and Mellor's popular  Object-Oriented Systems Analysis, this book explains how to  formalize the dynamic behavior and interaction of objects using  state models, and how then to derive the system's required  operations from the action of the state models. Extensive guidelines  are provided for partioning of processes through data flow diagrams  in order to maximize process reuse. Advanced topics  include:layering, timers, contention problems, failure analysis,  threads of control, alternative models of time, simulation, domain  partioning, and transformation of object-oriented analysis into an  object-oriented design.",
        "Category": " Computers , Programming , Object Oriented",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Van Gogh's Van Goghs",
        "Authors": "By Van Gogh Museum, Amsterdam (COR), Gogh, Vincent Van, National Gallery of Art (U. S.) (COR), Kendall, Richard, Leighton, John, Los Angeles County Museum of Art (COR), and Heugten, Sjraar Van",
        "Description": "A collection of Vincent Van Gogh's many paintings, drawings, and letters is accompanied by an essay that addresses Van Gogh's major artistic themes and the different phases of his artistic career. 30,000 first printing.",
        "Category": " Art , Collections, Catalogs, Exhibitions , General",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The Clue of the Broken Blade (The Hardy Boys, No. 21)",
        "Authors": "By Dixon, Franklin W.",
        "Description": "Frank and Joe Hardy become involved in an intriguing mystery which revolves around their fencing master, Ettore Russo. Proof that Russo is the rightful heir to his grandfather’s estate hinges on retrieving the guard end of a broken saber lost many years ago in California. The young investigators’ quest is complicated by a bank robbery during which some of their father’s important records are stolen. A chase ensues in the grape-growing region of California as the boys engage in a dangerous game of hide-and-seek with the bank robbery gang.",
        "Category": " Young Adult Fiction , Mysteries & Detective Stories",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1942"
        }
    },
    {
        "Title": "The Papacy and the Empire in the Age of Terror",
        "Authors": "By Giancarlo Zizola",
        "Description": "",
        "Category": "",
        "Publisher": "Instituto Italioano di Cultura",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Spinning the Semantic Web: Bringing the World Wide Web to Its Full Potential",
        "Authors": "By Fensel, Dieter (EDT), Hendler, James (EDT), Lieberman, Henry (EDT), and Wahlster, Wolfgang (EDT)",
        "Description": "As the World Wide Web continues to expand, it becomes increasingly difficult for users to obtain information efficiently. Because most search engines read format languages such as HTML or SGML, search results reflect formatting tags more than actual page content, which is expressed in natural language. Spinning the Semantic Web describes an exciting new type of hierarchy and standardization that will replace the current \"web of links\" with a \"web of meaning.\" Using a flexible set of languages and tools, the Semantic Web will make all available information -- display elements, metadata, services, images, and especially content -- accessible. The result will be an immense repository of information accessible for a wide range of new applications.This first handbook for the Semantic Web covers, among other topics, software agents that can negotiate and collect information, markup languages that can tag many more types of information in a document, and knowledge systems that enable machines to read Web pages and determine their reliability. The truly interdisciplinary Semantic Web combines aspects of artificial intelligence, markup languages, natural language processing, information retrieval, knowledge representation, intelligent agents, and databases.",
        "Category": " Computers , Web , General",
        "Publisher": "The MIT Press",
        "Price Starting With ($)": "6.74",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Casual Cookouts (Fresh & Simple)",
        "Authors": "By Better Homes and Gardens Books (EDT) and Holderness, Lisa (EDT)",
        "Description": "Collects recipes for grilled entrees, side dishes, and desserts",
        "Category": " Cooking , Methods , Barbecue & Grilling",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.54",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Clean Your Clothes with Cheez Whiz: And Hundreds of Offbeat Uses for Dozens More Brand-Name Products",
        "Authors": "By Green, Joey and joey-green",
        "Description": "Did you know that Baby Magic Baby Powder repels ants and Campbell's Tomato Soup prevents blond hair from turning green in a chlorinated swimming pool? Many of the foods and household items on the shelves of your kitchen and bathroom cabinets have properties and near-magical powers never indicated by what's printed on their labels. In Clean Your Clothes with Cheez Whiz, bestselling author Joey Green reveals hundreds of quirky uses for brand-name products. With dozens of items to choose from, you'll discover how to:-Clean a toilet bowl with Country Time Lemonade-Relieve morning sickness with Gatorade-Remove scruff marks from patent-leather shoes with Noxema-Give yourself a facial with Cheerios-Soothe sunburn pain with Cool Whip-Relieve insect-bite itching with A.1 Steak Sauce-Clean your clothes with Cheez Whiz (It's great for removing grease!)But it doesn't stop there. Clean Your Clothes with Cheez Whiz also presents short histories, strange facts, and other tidbits about your favorite products.",
        "Category": " House & Home , Reference",
        "Publisher": "Renaissance Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Rueful Death (China Bayles Mystery)",
        "Authors": "By Albert, Susan Wittig",
        "Description": "Herbalist China Bayles must solve a mother of a murder in this mystery from New York Times bestselling author Susan Wittig Albert.In search of respite, China takes off to St. Theresa's Monastery with her friend Maggie, a former nun. The goal is a brief, tranquil retreat—but there's a conflict at the convent. The mother superior has recently died, and a battle over the future of St. Theresa's suggests that her sudden demise might not have been accidental. Now, China's quest for a replenished spirit takes second place to a more earthbound pursuit: catching a killer...",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Pasta (101 Essential Tips)",
        "Authors": "By Willan, Anne (EDT)",
        "Description": "Shows how to prepare, serve, store, and reheat pasta and presents recipes for soups, salads, fillings, and sauces",
        "Category": " Cooking , Specific Ingredients , Pasta",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Baseball: An Illustrated History Of America's Game",
        "Authors": "By Honig, Donald",
        "Description": "Uses photographs to trace the development of America's national sport, identify key players, describe the highlights of each season, and show how baseball has changed",
        "Category": " Sports & Recreation , Baseball , History",
        "Publisher": "Crown",
        "Price Starting With ($)": "6.62",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Pepperidge Farm Easy Entertaining: Recipes for Family and Friends",
        "Authors": "By Pepperidge Farm",
        "Description": "",
        "Category": " Cooking , Entertaining",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Classic Home Cooking Appetizers",
        "Authors": "By Publications International Ltd",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Inc",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Heroes of the Hall : Baseball's Greatest Players",
        "Authors": "By Smith, Ron",
        "Description": "As of July 2001, there are 253 players enshrined in Baseball's Hall of Fame. From Hank Aaron to Robin Yount, from the initial class (1933), to the latest (2002), from Tom Seaver--with the highest percentage of votes--to Al Simmons, who received the lowest percentage, Heroes of the Hall  has them all. It combines vivid color and black-and-white photography, vivid biographies, and random tidbits in the one book that captures all the skills of every Hall of Famer in a single volume.",
        "Category": " Sports & Recreation , Baseball , Essays & Writings",
        "Publisher": "Sporting News",
        "Price Starting With ($)": "8.41",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "The Original Cook Like a Man Cookbook - The Last Male Art Form: Grill It. Smoke It. BBQ the Heck Out of It.",
        "Authors": "By TABASCO/McIlhenny Company",
        "Description": "",
        "Category": "",
        "Publisher": "Phillip Morris USA",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Smooth Talking Stranger: A Novel (The Travis Family)",
        "Authors": "By Kleypas, Lisa",
        "Description": "Jack Travis leads the uncomplicated life of a millionaire Texas playboy. He makes no commitments, he loves many women, he lives for pleasure. But no one has ever truly touched his heart or soul. Until one day, a woman appears on his doorstep with fury on her face and a baby in her arms. It seems Jack is the father and this woman is the baby's aunt. The real mother has abandoned the child to her more responsible sister. And now, Jack is being called upon to take responsibility for the first time in his life. With delicious romantic tension, characters so real they walk onto the page and into your heart, Lisa Kleypas delivers the kind of novel that makes you laugh, love; cry and cheer ...in Smooth Talking Stranger.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "The Chronicle Of Baseball: A Century of Major League Action",
        "Authors": "By Mehno, John",
        "Description": "This celebration of a century of the sport chronicles each year of baseball'shistory, covering every major event, and includes a special section on the 40greatest baseball players of all time. 900 photos, 500 in color.",
        "Category": " Sports & Recreation , Baseball , History",
        "Publisher": "Carlton Books Ltd",
        "Price Starting With ($)": "13.7",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Total Baseball: The Official Encyclopedia of Major League Baseball (Total Baseball, 6th ed)",
        "Authors": "By Gershman, Michael (EDT), Thorn, John (EDT), Palmer, Pete (EDT), Silverman, Matthew (EDT), Pietrusza, David (EDT), and Lahman, Sean (EDT)",
        "Description": "The complete encyclopedia of baseball includes fully updated stats, records, rosters, registers, team histories, and insightful new essays on everything from Sammy Sosa to the history of the home run. Original. 75,000 first printing. IP.",
        "Category": " Sports & Recreation , Reference",
        "Publisher": "Total Sports",
        "Price Starting With ($)": "9.88",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Vanishing Act (Sisterhood)",
        "Authors": "By Michaels, Fern",
        "Description": "When You're Lost, The Sisterhood Will Find YouFor the women of the Sisterhood, planning a lavish reception for their longtime ally, attorney Lizzie Fox, at their lux mountain retreat is the ideal way to unwind after their latest successful mission. The only cloud over the happy occasion is that their mentor, Charles, is still mysteriously absent.But amid the friendly bickering about floral arrangements, cake tiers, and wedding favors, the ladies of Pinewood receive a frantic phone call from Nikki's fiancé, Jack Emery. Harry Wong--Yoko's true love and a staunch supporter of the Sisterhood--has become the victim of a ruthless identity theft ring. Harry's bank accounts have been closed out, his beloved dojo is being foreclosed, and he's being evicted. Distraught, Yoko is about to rush down the mountain to Harry's aid when the Sisters intercept her. A situation like Harry's requires finesse, careful planning, and the Sisterhood's distinctive brand of vigilante justice. . .Praise for Fern Michaels and her Sisterhood novels. . .\"Delectable. . .deliver[s] revenge that's creatively swift and sweet, Michaels-style.\" --Publishers Weekly on Hokus Pokus",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "The Law of Torts: Examples & Explanations, Third Edition",
        "Authors": "By Glannon, Joseph W.",
        "Description": "Glannon (law, Suffolk U., Massachusetts) offers an introductory textbook for law students explaining the principles of each section of tort law and providing examples illustrating how they apply in typical cases. Three chapters new to the fifth edition contain advice on taking an exam on tort law, including some sample questions and answers. No dates are cited for previous editions. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Law , General Practice",
        "Publisher": "Aspen Publishers",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Civil Procedure, 6th Edition (Examples & Explanations)",
        "Authors": "By Glannon, Joseph W.",
        "Description": "Glannon (law, Suffolk University Law School) demystifies civil procedure by providing concrete examples of procedural doctrines and rules in operation, together with full explanations of how these abstract concepts apply to each example. Each chapter (except for the pleading chapters in Part VI) includes an introduction that gives a basic explanation of the relevant procedural concepts, followed by a series of examples. The 'Explanations' section of each chapter presents the author's analysis of the examples in that chapter. Readers are encouraged to answer questions based on case examples and compare their answers with the author's. Chapters are in sections on choosing a proper court, state law in federal courts, the scope of the action, steps in the litigation process, the effect of the judgment, and thinking procedurally. Annotation ©2008 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Law , Civil Procedure",
        "Publisher": "Aspen Publishers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "1,001 Ingenious Gardening Ideas: New, Fun and Fabulous That Will Change the Way You Garden - Forever! (Rodale Garden Book)",
        "Authors": "By Cunningham, Sally Jean (EDT) and Martin, Deborah L. (EDT)",
        "Description": "How can you keep from dragging your garden hose over newly planted seedling? Where can you find cheap garden stakes? What can you use to keep the family cat out of your freshly tilled flower beds? This book answers these questions and hundreds more with unique new tips. Plentiful illustrations make for great browsing, while subject-area organization leads you to specific problem solutions. This book is sure to spur you on to improve the bloom and beauty of your garden.",
        "Category": " Gardening , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "The Field Guide to Early Man",
        "Authors": "By Lambert, David and Diagram Group",
        "Description": "An illustrated introduction to the evolution of man, from the early hominids to the present day",
        "Category": "",
        "Publisher": "Facts on File",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Deadly Resolutions",
        "Authors": "By Collins, Anna Ashwood",
        "Description": "",
        "Category": "",
        "Publisher": "Worldwide Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Descendants (By the Female Branches) of Joseph Loomis, Who Came From Braintree, England, in the Year 1638, and Settled in Windsor, Connecticut, in 1639 - Volume I",
        "Authors": "By Elias Loomis",
        "Description": "",
        "Category": "",
        "Publisher": "New Haven: Tuttle, Morehouse and Taylor",
        "Price Starting With ($)": "137.44",
        "Publish Date": {
            "Month": "January",
            "Year": "1880"
        }
    },
    {
        "Title": "Man Who Wasnt There",
        "Authors": "By Roderick  MacLeish",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1977"
        }
    },
    {
        "Title": "Infinite Grace: Where the Worlds of Science and Spiritual Healing Meet",
        "Authors": "By Goldner, Diane",
        "Description": "This study traces the mystery of spiritual healing and other phenomena, once solely in the arena of the New Age devotees, into modern-day laboratories where researchers are studying the secrets of ancient healing and the power of the mind.",
        "Category": " Medical , Alternative Medicine",
        "Publisher": "Hampton Roads Pub Co Inc",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Dutchman's Dilemma, The",
        "Authors": "By Meyers, Maan",
        "Description": "It's 1675 and eleven years have passed since Pieter Tonneman brought a brutal murderer to justice ... and married the beautiful widow Racqel Mendoza. Although the marriage made her an outcast in the city's small, close-knit Jewish community, it has been a happy one for Racqel and Pieter. Former sheriff of the island, Tonneman has now settled into life as husband, father, and businessman. But suddenly the air is filled with terror, an old debt has come due, and events have compelled the Dutchman back to duty.From the taverns and into the streets, the whispers grow louder by the hour - talk of devil worship and of witchcraft, dark tales of a conspiracy among the Jews. And when the killer trades horseflesh for human flesh, his knife slashing with deadly sacrificial precision, the city's simmering hatreds and superstitions threaten to boil and burn. Ostracized, distrusted, too independent for her own good, no one is more at risk than Tonneman's wife. A murderer is on the loose in New-York, and many are ready to blame Racqel. But someone is ready to make her the next victim.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Betty Crocker's Bisquick Cookbook",
        "Authors": "By Crocker, Betty (EDT)",
        "Description": "The 150 best Bisquick recipes, collected for the first timeIntroduced in 1930, Bisquick quickly became a kitchen staple in a convenient shortcut to great biscuits, pancakes, waffles, cobblers, and other baked treats. In fact, it's now found in more than half of American kitchens. For the last 70 years, Betty Crocker has been refining Bisquick recipes as well as creating new recipes that reflect current tastes. Now, the best Bisquick recipes are collected here in one great book. No more shuffling through loose clippings, just turn to that favorite recipe! You'll find:* A full-color photograph of every recipe* Step-by-step illustrated instructions for such classics as waffles, biscuits and strawberry shortcake* Concealed wiro binding that allows the book to open flat for convenient cooking* All-time favorite Bisquick recipes flagged* Individual chapters on low-fat recipes and kid-friendly recipes* High-altitude directions with every recipeFrom Pancakes and Biscuits to Blueberry Muffins and Impossible Pies, this beautiful full-color cookbook is just what the millions of Bisquick fans have been waiting for.",
        "Category": " Cooking , Methods , Baking",
        "Publisher": "Betty Crocker",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Harper's Biochemistry",
        "Authors": "By Harold A. Harper",
        "Description": "",
        "Category": "",
        "Publisher": "Appleton & Lange",
        "Price Starting With ($)": "6.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Why Us? When Bad Things Happen to God's People",
        "Authors": "By Wiersbe, Warren W.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "The Dain Curse",
        "Authors": "By Hammett, Dashiell",
        "Description": "Dashiell Hammett virtually invented the hardboiled crime novel, and his creation the Continental Op is a short, squat, and utterly unsentimental tank of a private detective. Miss Gabrielle Dain Leggett is young, wealthy, and a devotee of morphine and religious cults. She has an unfortunate effect on the people around her: they have a habit of dying violently. Is Gabrielle the victim of a family curse? Or is the truth about her weirder and infinitely more dangerous? The Dain Curse is one of the Continental Op's most bizarre cases, and a tautly crafted masterpiece of suspense.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Vintage Crime/Black Lizard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Photoshop 7 Artistry: Mastering the Digital Image (Voices (New Riders))",
        "Authors": "By Haynes, Barry, Crumpler, Wendy, and Duggan, Sean",
        "Description": "Photoshop 7 Artistry is the book for serious professional photographers and digital artists who need to create expert imagery. This book will help you master the relationship between Photoshop tools and traditional photography. Photoshop Artistry is probably the most successful advanced-level Photoshop book available. It's initial appeal for photographers has been transcended; the basic principles the authors teach apply to all Photoshop users-particularly more-advanced users-and the advent of digital photography has further boosted the book's popularity. Covers creation and output of museum-quality art prints, images for high-end advertising, as well as GIFs, JPEGs, and Web Photo Galleries",
        "Category": " Photography , Techniques , Equipment",
        "Publisher": "New Riders Pub",
        "Price Starting With ($)": "7.16",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The Fury (A Henry Parker Novel, 4)",
        "Authors": "By Pinter, Jason",
        "Description": "Am I my brother's keeper?If I'd known I had a brother, I might have been. But he's dead&#151;shot point-blank in a rat-hole apartment, wasted by hunger and heroin. Stephen Gaines, a man with whom I shared nothing&#133;except a father. For some reason this stranger who shared my blood came to me for help, and I blew him off thinking he was just some junkie. Now I'm forced to question everything I ever knew&#133;and figure out why this man was murdered in cold blood.All I can do for Stephen Gaines now is find his killer&#151;and with the help of Amanda Davies uncover the whole, hard truth. If it means tracking down a vicious drug kingpin&#151;who may or may not exist&#151;then so be it&#133;.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "The Pocket Idiot's Guide to America's Golf Course",
        "Authors": "By Mintzer, Richard",
        "Description": "Do you have to hit the links no matter where you are?  Have you resorted to Putt-Putt on trips because you didn't think you could afford the local green fees?  The Pocket Idiot's Guide to America's Golf Courses helps you find the best courses for your budget and your handicap--no matter where you are.  Now you can get a tee time before you even leave home!  In this Pocket Idiot's Guide, you'll get:",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Alpha",
        "Price Starting With ($)": "7.21",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Heart of Darkness: An Anthology (Lords of the Underworld)",
        "Authors": "By Showalter, Gena, Krinard, Susan, and Shayne, Maggie",
        "Description": "From the masters of paranormal romance, three brand-new tales of seduction…The Darkest Angel by Gena ShowalterA Lords of the Underworld taleAn iron-willed demon assassin, the angel Lysander has never known lust—until he meets Bianka. Spawned from the bloodline of Lucifer, the beautiful but deadly Harpy is determined to lead the pure-hearted Lysander into temptation….Love Me to Death by Maggie ShayneTwenty-two years ago four teenage boys were convicted of a young girl's murder. Now, in the form of a beautiful woman, the \"victim\" is seeking vengeance. And only one man dares to dig into the past to uncover its secrets… and set her free.Lady of the Nile by Susan KrinardLady Tameri believes herself to be the reincarnation of an ancient Egyptian princess, and Leo Erskine has set out to prove her wrong…never dreaming that the two  of them are about to discover a prophecy that will bind them together forever.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "But What of Earth?",
        "Authors": "By Anthony, Piers",
        "Description": "Science-fiction, autobiography, and a candid, witty send-up of the publishing industry combine in a wild adventure of a novel that winds up in the wrong hands",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Heroes United!/Attack of the Robot  Super Friends (Pictureback)",
        "Authors": "By Random House",
        "Description": "JOIN SUPERMAN, BATMAN, THE FLASH, and all the DC SUPER FRIENDS as they battle an evil robot and use teamwork to save the day! This deluxe Pictureback features two action-packed stories, plus four pages of punchout characters and backgrounds for kids to create their very own DC SUPER FRIENDS adventures!",
        "Category": " Juvenile Fiction , Boys & Men",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "The Bike Lesson",
        "Authors": "By Berenstain, Stan and Berenstain, Jan",
        "Description": "Literary legends Stan and Jan Berenstain take readers for a ride in this classic Beginner Book edited by Dr. Seuss. Small Bear has a new bike, but before he can ride it, his dad insists on a teaching him about bike safety. From learning how to stop and turn to going down a hill and traveling roads you know, Small Bear has a lot to learn. And Father Bear has an unforgettable way of showing his son all the tricks of biking. The second in the beloved Berenstain Bears series, The Bike Lesson is the Tour de France of funny tales for early readers. Originally created by Dr. Seuss, Beginner Books encourage children to read all by themselves, with simple words and illustrations that give clues to their meaning.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1964"
        }
    },
    {
        "Title": "Panicking Ralph: A Harpur & Iles Mystery",
        "Authors": "By James, Bill",
        "Description": "Ralph Ember, owner of the shady drinking club The Monty, longs to be respectable. The trouble is, his money comes from big-time drug dealing, where fortunes are made but reputations are dubious and the risks truly murderous. No wonder he's nicknamed \"Panicking Ralph,\" because of the terrors that seize him at times of high danger - though when a dead body turns up, he's far off and all innocence.Right now Ember is out to get his hands on the syndicate of the recently murdered Oliphant Kenward Knapp, who ruled what envious competitors called the best drug operation in Britain. Whom does he dare approach as a partner? The ambitious Keith Vine? Top banana Mansel Shale and his sidekick Alfie Ivis? In this city, alliances shift fast, but it's even riskier to set up as an independent. Was too much independence what caused the death of Ralph's girlfriend Christine Turner, gunned down at the beach while she and Ralph tried to run for cover? Were the bullets meant for him?Meanwhile Detective Chief Superintendent Colin Harpur, bypassing his jealous superior ACC Desmmond Iles, is developing his own secret plan to trap the drug barons. As Harpur enters a dark and sometimes seductive world of greed, betrayal, and vengeance, there is no one who can pull him out if things go wrong.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Silly putty, and other children's sermons",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "10.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Democracy in America: Abridged Edition (Penguin Books for History: U.S.)",
        "Authors": "By Tocqueville, Alexis de",
        "Description": "A French aristocrat's account of the ways in which democratic ideals were applied in America during the nineteenth century",
        "Category": " Political Science , General",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1956"
        }
    },
    {
        "Title": "The Speaking Stones",
        "Authors": "By Sara Cardiff",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Crest Books",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1978"
        }
    },
    {
        "Title": "Story of Baseball, The (2nd edition)",
        "Authors": "By Ritter, Lawrence S.",
        "Description": "\"This solid, absorbing introduction to the history, mechanics, and magic of baseball has been expanded and updated, with the addition of several chapters incorporating new baseball lore and current faces. A winner in any season.\"--Horn Book.\"A splendid volume for fans of all ages.  a solid hit.\" --The New York Times\"A grand slam all the way!\" --School Library Journal",
        "Category": " Juvenile Nonfiction , History , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "101 Activities for Kids in Tight Spaces: At the Doctor's Office, on Car, Train, and Plane Trips, Home Sick in Bed . . .",
        "Authors": "By Kranowitz, Carol Stock",
        "Description": "You can never have enough space. And if you can't, just think of your kids--all the time they have to spend in tight spaces--like cars, planes, trains, the doctor's office, the grocery store, being sick or housebound, waiting in line. Kids need room to move around, but there are many times when they just plain can't have it.While raising two exuberant boys, teaching preschool, leading Cub Scouts, and running a birthday party business, Carol Kranowitz came up with savvy, creative ways to keep kids content in tight spaces. Her activity ideas combine old standbys with new ones born of desperation and cramped quarters. They follow a philosophy that helps kids develop their different skills and abilities while entertaining themselves and interacting.You'll find great projects for every imaginable small space parents and children encounter:Fun Food for Tiny Kitchens:  Ants on a Log, Footprints in the Snow, and Aiken Drum FacesIn the Urban Community:  Windowsill Garden, Bug Jar, and Corn-on-the-SpongeWhen the Walls Seem to Be Closing In:  Pillow Crashing, People Sandwich, and Teeter-TotterWhen what you've got is a small space and a restless child, what you need are 101 ingenious solutions--right away. Here they are--easy to implement, creative fun for the three to seven-year-old--activities that can turn tough moments into teachable, terrific ones.",
        "Category": " Family & Relationships , Activities",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Princeton Review: Research Paper Smart: Where to Find It, How to Write It, How to Cite It",
        "Authors": "By Buffa, Liz",
        "Description": "A comprehensive, introductory manual leads students through the stages of research and writing a college-level term paper, explaining how to choose a topic, document sources, write in the proper style, create a bibliography, and use the Internet. Original.",
        "Category": " Reference , General",
        "Publisher": "Princeton Review",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    }
]