[
    {
        "Title": "Africana",
        "Authors": "By Harrison, William",
        "Description": "",
        "Category": "",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "32 Elephant Reminders: A Book of Healthy Rules",
        "Authors": "By McKee, Mary M.",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Hci",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Bloodstream: A Novel of Medical Suspense",
        "Authors": "By Gerritsen, Tess",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Alexandra - The Last Tsarina",
        "Authors": "By Erickson, Carolly",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "All About Lawns",
        "Authors": "By MacCaskey, Michael, Haas, Cathy, and Goldenberg, Janet (EDT)",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Upgrading & Repairing PCs",
        "Authors": "By Mueller, Scott",
        "Description": "Already in the fourth printing of its updated third edition, clearly a popular reference. For simple users of computers who want to learn to update and repair IBM-type personal computers for themselves or their companies, not only explains the details of specific procedures, but also provides the background information needed to become technically informed enough to perform them. Not advanced enough to prepare readers to become professionals. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Computers , General",
        "Publisher": "Que Pub",
        "Price Starting With ($)": "8.34",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Mencken: A study of his thought",
        "Authors": "By Fecher, Charles A.",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf; [distributed by Random House",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Memos From/to Management: There's Nothing Wrong With Serving a Lousy Cup of Coffee If",
        "Authors": "By Mescon, Michael H., Mescon, Timothy S., and Harte, Susan",
        "Description": "Successful business leaders offer insight and ideas such as the small room concept, the real value of compensation, listening with three ears, shopping your own business, and more.",
        "Category": "",
        "Publisher": "Longstreet Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Barking At a Fox-fur Coat",
        "Authors": "By Davis, Donald",
        "Description": "Highly acclaimed, award winning author Donald Davis wants us all to remember and share our family stories. In this collection, Davis offers seventeen vintage family stories, including “Rainy Weather,” “The Southern Bells,” and “Old Man Hawkins&#39; Lucky Day.”",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "August House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Apples, How They Grow",
        "Authors": "By McMillan, Bruce",
        "Description": "Close-up photographs revealing each stage of an apple's growth alternate with pages of descriptive text detailing the development of an apple from velvety bud to ripe fruit",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1979"
        }
    },
    {
        "Title": "Digger",
        "Authors": "By Flynn, Joseph",
        "Description": "Once in a lifetime, a man may find himself in a desperate battle for everything he holds dear.  But in this powerful, explosive, utterly  unforgettable new thriller, that all-out war has come twice for John  Fortunato.  Once for his country--and now to save his hometown and the woman he loves.Twenty-five years ago John Fortunato was a soldier in Vietnam, fighting in  the crushing darkness of the tunnels of Cu Chi, from which the Vietcong  launched their deadliest operations.  When he got back to his hometown of Elk  River, Illinois, he secretly re-created those hellish tunnels.  Partly a memorial, partly a kind of exorcism, they now lie hidden  beneath the town's  peaceful streets.  John traded his M-16 rifle for a Nikon camera and built a  career as a successful photographer.  He thought he had put the war and the  bloodshed behind him, but a powerful new enemy has other plans for John Fortunato.On a quiet April night, Fortunato witnesses the brutal sidewalk shooting of  an innocent man.  The vicious crime is but the first assault in a struggle  that will erupt into a full-scale battle for control of Elk River, a struggle  that will divide neighbors and tear families apart.On one side is a tough, beautiful labor lawyer; on the other is a man who  will stop at nothing to control the entire town.  And on the front line is  John Fortunato, whose secret tunnels will provide the battleground for his  own war, a war that revives the killing grounds of Cu Chi in a way he could  never have imagined.  But as everyone is about to learn, when this veteran warrior goes down, he's just begun to fight.From the terrible intimacy of tunnel combat below the steaming jungles of  Vietnam, to the brutal battles on the streets of the American heartland, to  the unyielding courage of a man and woman prepared to sacrifice everything to  make a dream come true, Digger is a harrowing, powerfully written novel that breaks all the rules.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.65",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Slay Your Own Dragons: How Women Can Overcome Self-Sabotage in Love and Work",
        "Authors": "By Good, Nancy",
        "Description": "Offering the advice and understanding that women need to attain happiness, a psychotherapist analyzes the history and behavioral patterns of women who sabotage their chances of success, in a comprehensive, usable guide for developing new patterns of behavior",
        "Category": " Psychology , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "The Talmud and the Internet: A Journey Between Worlds",
        "Authors": "By Rosen, Jonathan",
        "Description": "The Talmud and the Internet, in which Jonathan Rosen examines the contradictions of his inheritance as a modern American and a Jew, is a moving and exhilarating meditation on modern technology and ancient religious impulses. Blending memoir, religious history and literary reflection Rosen explores the remarkable parallels between a page of Talmud and the homepage of a web site, and reflects on the contrasting lives and deaths of his American and European grandmothers.",
        "Category": " Religion , Judaism , General",
        "Publisher": "Farrar Straus & Giroux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "In Her Defense",
        "Authors": "By Horn, Stephen",
        "Description": "A lawyer with an appetite for risk. A gorgeous socialite accused of murder. It's the case of a lifetime--if only she were innocent.Following in the blockbuster tradition of Scott Turow and Richard North Patterson comes Stephen Horn and In Her Defense, and intense, riveting debut thriller with a twist.Frank O'Connell's need to live on the edge cost him his family, his home, and a partnership in his father-in-law's prestigious Washington firm. Now he combs the cell blocks for clients and wonders if he's sunk too low ever to come back. His ex-wife wants to see less of him, his therapist wants to see more, and his last link to professional survival just gave him an ultimatum.Then into his office walks Ashley Bronson. The murder of a former cabinet official has just propelled her from the society column to the front page, and, inexplicably, she wants Frank to defend her. She hands him her case, followed by her confession and some damning physical evidence. Frank thinks his biggest challenge is her guilt. He's got a lot to learn.Ashley's admission proves just another detail in a defense in which ethics are bent and morals compromised. As the trial date looms closer, the goverment's case seems insurmountable. A desperate Frank hits upon an inspired strategy--and unwittingly becomes a threat to people in high places when he unravels a tangled web of events that began a generation ago.Their personal lives in tatters and confronted by forces they don't understand, besieged lawyer and client have only each other as the courtroom battle begins.In this fast-paced legal thriller, former federal prosecutor Stephen Horn brings his knowledge of law and government to stunning life with this absorbing tale of love, betrayal, and murder that is sure to be one of the most entertaining and engrossing stories of the year.",
        "Category": " Fiction , Legal",
        "Publisher": "Harper",
        "Price Starting With ($)": "15.41",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Shadow Men: A Max Freeman Novel",
        "Authors": "By King, Jonathon",
        "Description": "A gripping new chapter in the Max Freeman series, from the critically acclaimed, Edgar Award?winning author of The Blue Edge of Midnight.  It begins with an 80-year-old mystery. Three men?a father and his two sons?vanished while working as laborers on a dangerous project to build the first road through the Florida Everglades. Now, years later, a series of letters are unexpectedly discovered by a descendant of these men. Driven by the need to know what happened to these lost members of his family, he starts asking questions?and is quickly stonewalled. With nowhere else to turn, he enlists the help of former Philadelphia police officer Max Freeman.  Living in his isolated shack in the Glades, Max starts his longshot investigation into the fate of the men. A newly minted private investigator working with his friend and attorney, Billy Manchester, Max is surprised to meet resistance immediately at every turn. The search for the truth quickly turns violent?and Max finds he has more to worry about than just 80-year-old ghosts. For there are powerful interests that want to make sure that the shadows of the past remain undisturbed?including some who will kill to make sure that they do.  Combining powerful storytelling and rich characters, Shadow Men establishes Jonathon King as a new master of modern crime fiction.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Karma",
        "Authors": "By Smith, Mitchell",
        "Description": "In a world ruled by fate, there are moments that are beyond any one person's control. For Evan Scott, that moment comes high atop a half-finished skyscraper under a starlit Manhattan night, when he witnesses a woman plunging thirty stories to her death. Their eyes meet briefly and suddenly Evan's comfortable world has been irretrievably shattered.And his is a comfortable world. A successful architect with New York savvy, a handsome husband and father who enjoys the country-club lifestyle afforded by his Greenwich, Connecticut, address, Evan is the American Dream with a picture-postcard setting. Yet even he has his demons. His nights are haunted by Vietnam nightmares. His days are spent in the arms of his plain and passionate mistress, who offers a love his stunning wife, Catherine, cannot or will not give. Yet he cannot forget the woman who died, and in whose eyes he glimpsed utter fear.Officially her death is ruled an accident, but Evan has questions. Questions about the silence of the woman's father, the construction foreman on the site. Questions about Rao Electrical, a company with a multimillion-dollar wiring contract for the building. Questions about the NYPD detective, who tells Evan to forget his questions. Questions that begin to yield horrifying answers with the hideous slaying of someone close to Evan - a death too personal to leave unavenged.Determined to uncover the truth about the woman's death - at a price he feels has already been paid - Evan realizes he's become a one-man army, battling the police, his friends and family, and an enemy unseen by everyone but him. As the stakes rise, the carnage climbs, and Evan must track down and somehow destroy a powerful crime family that even the Mafia fears, a crime family that is the master of every means of murder.",
        "Category": " Fiction , General",
        "Publisher": "DUTTON BOOK",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Age Wave: How The Most Important Trend Of Our Time Will Change Your Future",
        "Authors": "By Dychtwald, Ken and Flower, Joe",
        "Description": "Based on fifteen years of research by a leading expert on aging, this is the first comprehensive analysis of the consequences of the aging baby-boomer population on society. Examining the choices and challenges for the future, Age Wave discusses topics such as the cyclic lifestyle, reinventing the family, elder power at the polls, and redesigning America.  Praise for Age Wave “Provides a glimpse into the future like nothing we’re ever seen.”—USA Today   “Age Wave raises questions and consequences we never dreamed of. It will change your view of the future.”—John Naisbitt, author of Megatrends",
        "Category": " Social Science , Gerontology",
        "Publisher": "Random House Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Academic License: The War on Academic Freedom",
        "Authors": "By Csorba, Les (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Distributed by Kampmann & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Vector",
        "Authors": "By Cook, Robin",
        "Description": "New York City cab driver Yuri Davydov wants to lash out at the adoptive nation that lured him with what he believes was the hoax of the American Dream, only to deny him contentment, opportunity, and personal property.As a former technician for the vast Soviet biological weapons industry Biopreparat, Yuri possesses the technical knowledge to carry out his vengeance on a horrific scale, especially after teaming up with a pair of far-right survivalists who share his abhorrence of the United States. Working together they launch Operation Wolverine.Dr. Jack Stapleton and Dr. Laurie Montgomery are confronted with two seemingly disparate cases in their work as forensic pathologists in the city's medical examiner's office. They hardly suspect that the cases could be related, but soon they begin to connect the dots, and the question then becomes whether or not they will solve the puzzle before Yuri and his comrades unleash the ultimate terror: a modern bioweapon.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Ansel Adams: Miniature Art Book",
        "Authors": "By Adams, Ansel",
        "Description": "Ansel Adams is best known for a series of photographs he produced of America's natural heritage known collectively as the National Park Service Photographs, representative examples of which are reproduced here.  This assignment was especially commissioned in 1941 by Harold Ickes of the United States Department of the Interior and the aim was to record for posterity areas that had been designated national parks, as well as portraying the Native American homelands and other monuments and areas of reclamation of the great American wilderness.  These would also be used as photo-murals to decorate the walls of the Department of the Interior.  Ickes was already familiar with Ansel's work having seen detailed studies of leaves and ferns which featured in an exhibition of 1936.  Indeed, he liked them so much that he hung one in his own office.  He eventually made Ansel's acquaintance when the photographer came to lobby Congress, seeking to have Kings River Canyon, California designated a national park.  Originally, only painted murals by established artists were thought suitable for inclusion in the Mural Project, as it came to be known, as photography had yet to be considered worthy of being regarded as an art form, rather than a way of recording or documenting reality; but Ickes was convinced that Ansel's work was artistically valid and would make its own inimitable contribution to the scheme.The collection of works commissioned in 1941 was intermixed with earlier studies of the Kings Canyon area dating back to 1936, and these and the new prints were offered as part of the commission.  The photographs are a pictorial testament to the majesty of the American West, captured with technical accuracy and imbued with sheer inventiveness and a deep empathy for the regions which Ansel sought to protect and maintain intact. They range from rivers and canyons, close-ups of plant life, Native American villages and their inhabitants, the mysterious and enigmatic underworld of the Carlsbad Caverns and the geysers and twisted forms of Yellowstone National Park.  Together, they offer a visual feast and a source of delight and nourishment for the spirit.",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Complete Book of Baby and Child Care",
        "Authors": "By Ketterman, Grace",
        "Description": "",
        "Category": "",
        "Publisher": "Fleming H. Revell Company",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "BODY COUNT: Moral Poverty...And How to Win America's War Against Crime and Drugs",
        "Authors": "By Bennett, William J., Diiulio, John J., and Walters, John P.",
        "Description": "Body Count diagnoses America's plague of violent crime. Its authors - William Bennett, John DiIulio, and John Walters - define the epidemic's size, its range, and its scope. Through stories and anecdotes they present the very real human tragedies behind the numbers. Most important, they describe the source of violent crime: abject moral poverty, the destitution visited upon children raised without loving, capable, responsible adults who teach right from wrong. Though dozens of other explanations have been offered for America's horrifying rates of violent crime - from academics and clinicians, cops and social workers, politicians on the right and the left - they are, at best, proxies for the real cause. It is not prisons (or their scarcity), guns (or their excess), the death penalty, the exclusionary rule, or even material impoverishment. Look to the root of a criminally twisted tree, the authors argue, and you will find only moral poverty and its parasite: drug abuse.And argue they do, with both powerful rhetoric and rigorous analysis. Bennett, DiIulio, and Walters demolish such myths as economic poverty causes crime; the United States imprisons a disproportionate number of its citizens; drug abuse is a victimless crime...and nothing useful can be done about it anyway; the death penalty is today a major deterrent of crime; and incarceration doesn't work.Each and every one of these myths is not merely wrong but tragically mistaken. The authors draw upon an immense fund of hard data and offer some of the most serious analysis ever given to America's criminal justice system - a system designed to protect America from violent crime, a system that has, for all practical purposes, failed, with one in three violent crimes committed by a person on either probation, parole, or pre-trial release. Body Count offers a radically new reading of the problem, proposes controversial but necessary policies at every level of government, profiles cities that are making progress against violent crime, and appeals to responsible citizens from all points on the political compass to join forces in the battle against moral poverty. It is certain to be one of the most read, discussed, and argued about books of the year.",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Lighthouse Trivia",
        "Authors": "By Costopoulos, Nina",
        "Description": "",
        "Category": " Travel , Museums, Tours, Points of Interest",
        "Publisher": "Crane Hill Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Brothers and Sisters",
        "Authors": "By Campbell, Bebe Moore",
        "Description": "Brothers and Sisters is set in the white-hot center of racially troubled Los Angeles, still healing from the deep scars of riot, violence, and suspicion. At the story's heart is Esther Jackson, an African-American who has built a promising career at a downtown bank. When a black man is hired as a senior vice-president, Esther is heartened - until his interest in a white officer at the bank percolates into sexual harassment. Esther is forced to choose between commitment to the friend who is being harassed and loyalty to a person of her own race. When a looting of bank accounts creates suspicions along racial lines, Esther must rethink her life even further, and her vision of the American dream.",
        "Category": " Fiction , Sagas",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Speaking Frankly : What's Wrong with the Democrats and How to Fix It",
        "Authors": "By Frank, Barney",
        "Description": "",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Midnight in Ruby Bayou",
        "Authors": "By Lowell, Elizabeth",
        "Description": "“Romantic suspense is her true forte.”—Minneapolis Star-Tribune New York Times bestselling author Elizabeth Lowell creates suspense and emotional intensity with her classic Midnight in Ruby Bayou, a riveting romantic thriller in her popular four-book series featuring the remarkable Donovan family. A recipient of the Romance Writers of America Lifetime Achievement Award, Lowell delivers a treasure of a story that seamlessly blends passion and peril as a beautiful artist and a dashing adventurer join forces on a hunt for a legendary fortune in gems. Midnight in Ruby Bayou is a treat for Linda Howard, Nora Roberts, and Jayne Ann Krentz fans.",
        "Category": " Fiction , Romance , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The Essential Over 35 Pregnancy Guide",
        "Authors": "By Kaser, R. T.",
        "Description": "",
        "Category": " Body, Mind & Spirit , Prophecy",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Honor Among Thieves",
        "Authors": "By Archer, Jeffrey",
        "Description": "Here, from the author of such monumental bestsellers as Kane and Abel and As the Crow flies, is an ingeniously plotted thriller that is as up-to-the-minute as today's headlines.In Washington, D.C., in the spring of 1993, it is the dawn of a new political era - but six thousand miles away in the impoverished streets of Baghdad, there is a growing disillusionment with the unelected president. Sensing the mood of the people, Saddam Hussein moves boldly to settle scores with the United States.Using $100 million as bait, Saddam gathers into his web three key players: a powerful American Mafia boss; the world's greatest forger; and, most crucially a special assistant to the President of the United States, Bill Clinton.Saddam's goal is to embarrass the U.S. by stealing part of its history - then destroying that symbol in front of the world's media. With the help of a sophisticated criminal underworld that exhibits Swiss-watch timing, and a skilled actor who is transformed through plastic surgery into a stand-in for Bill Clinton, he sets about his brilliant scheme.As the countdown begins to July 1993 - potentially the most humiliating day in U.S. history - two lovers, a beautiful Mossad agent and a dashing American professor who advises the CIA, turn out to be a far more formidable weapon than any Patriot missile.In what is sure to be hailed as the suspense novel of the year, master storyteller Jeffrey Archer reminds us that the things worth dying for are sometimes to be found in the words that define our historic values.",
        "Category": " Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Kaisha The Japanese Corp",
        "Authors": "By Abegglen, James C. and Stalk, George",
        "Description": "Examines Japanese corporations, including Honda, Canon, Toyota, and NEC, looks at how they have changed over the last twenty years, and identifies the Japanese competitive edge",
        "Category": " Business & Economics , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "Memnoch the Devil (Vampire Chronicles, Book 5)",
        "Authors": "By Rice, Anne and Ferraro, Clare (EDT)",
        "Description": "\"STARTLING. . . FIENDISH. . . MEMNOCH'S TALE IS COMPELLING.\"--New York Daily NewsLike Interview With the Vampire, Memnoch has a half-maddened, fever-pitch intensity. . . Narrated by Rice's most cherished character, the vampire Lestat, Memnoch tells a tale as old as Scripture's legends and as modern as today's religious strife.--Rolling Stone\"SHOCKING. . . A BRILLIANT BOOK.\"--St. Louis Post Dispatch\"Rice has penned an ambitious close to this long-running series, as well as a classy exit for a classic horror character. . Fans will no doubt devour this last visit with Lestat.\"--The Washington Post Book World\"MEMNOCH THE DEVIL OFFERS PASSAGES OF POETIC BRILLIANCE.\"--Playboy\"[Memnoch] is one of Rice's most intriguing and sympathetic characters to date. . . Rice ups the ante, taking Lestat where few writers have ventured: into heaven and hell itself. She carries it off in top form.\"--The Seattle Times\"RICHLY DESCRIPTIVE. . . A HORRIFIC TOUR OF HELL.\"--Kirkus Reviews (starred)A MAIN SELECTION OF THE BOOK-OF-THE-MONTH CLUB AND THE QUALITY PAPERBACK BOOK CLUB",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "6.89",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Mondo Elvis: A Collection of Stories and Poems about Elvis",
        "Authors": "By Ebersole, Lucinda and Peabody, Richard (EDT)",
        "Description": "Elvis is, and always will be, The King. Even as he (probably) lies in his grave at Graceland, he lives on in his music, his movies, on the Vegas stage, through the U.S. Mail, and on these pages.Mondo Elvis is a compilation of Elvis dreams, Elvis desires, and Elvis nightmares. This collection of stories and poems by, among others, Greil Marcus, Nick Cave, Mark Childress, Diane Wakoski, and Janice Eidus, track the Elvis legend from beginning to end. They depict Elvis the man, as well as the myth, they reflect on the life that was, and ponder the life that might have been.Elvis will never die. We can't let him. We need him too much.",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Julie and Romeo: A Novel",
        "Authors": "By Ray, Jeanne",
        "Description": "A deliciously funny and wickedly sexy novel of love found (finally!) and love threatened (inevitably) by the families who claim to love us best. Romeo Cacciamani and Julie Roseman are rival florists in Boston, whose families have hated each other for as long as anyone can remember (what they can't remember is why). When these two vital, lonely people see each other across a crowded lobby at a small business owners' seminar, an intense attraction blooms that neither tries to squelch. They're not sure what fate has in store for them, but they're not about to let something as silly as a generations-long feud stand in the way of finding out. That is, not until Romeo's octogenarian mother, Julie's meddling ex-husband, and a cast of grown Cacciamani and Roseman children begin to intervene with a passionate hatred that matches their newly found love, stroke for stroke. Think Montagues and Capulets, think wise and witty and thoroughly modern. Julie and Romeo is a love story for the ages. All ages.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Providence",
        "Authors": "By Wolff, Geoffrey",
        "Description": "A series of violent, life-threatening events disturbs the equilibrium of at least five lives in the port town of Providence",
        "Category": " Fiction , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "Why Climb the Corporate Ladder When You Can Take the Elevator?:: 500 Secrets for Success in Business",
        "Authors": "By Capozzi, John M.",
        "Description": "It's a rare book that can command a position on one's desk next to the dictionary and the thesaurus, but as Robert Crandall, chairman of American Airlines, has said, \"Capozzi's book is a must for speech writers.\" It's also a must for anyone who wishes to succeed in business.Successful entrepreneur John M. Capozzi has collected five hundred priceless axioms that will amuse and instruct anyone in business - whether corporate CEO, independent entrepreneur, rising corporate executive, or college student with major ambitions. Here are maxims drawn from solid common sense (\"Know how to use a computer\"), philosophical musings (\"Success is a journey, not a destination\"), and business acumen (\"Even if your entire board of directors votes for a dumb idea, it is still a dumb idea\").These aphorisms are based on principles that helped Capozzi earn thirteen corporate promotions in as many years, then go on to make millions in his own ventures. Throughout the book, Capozzi elaborates with anecdotes that illustrate such varied points as why you should never let personal setbacks distract you, how reading the newspaper can result in surprising opportunities, and why you should always carry a yellow pad, \"the ultimate corporate fashion accessory, and much more.\"The result is an uncommon collection of friendly advice and well-learned lessons, an essential handbook for those on their way to the top and those who want to stay there.",
        "Category": " Business & Economics , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Love: A Novel",
        "Authors": "By Schaeffer, Susan Fromberg",
        "Description": "A story of two Jewish immigrant families brought together by marriage describes their complex lives in Brooklyn, centering on Esheal Luria, who has struggled all his life to love and be loved",
        "Category": " Fiction , General",
        "Publisher": "Dutton",
        "Price Starting With ($)": "9.37",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Unconditional Life: Discovering the Power to Fulfill Your Dreams",
        "Authors": "By Chopra, Deepak",
        "Description": "Deepak Chopra, M.D., has emerged as one of the most powerful leaders in the revolutionary field of mind/body medicine. His extraordinary bestseller Quantum Healing explored the mind's connection to seemingly miraculous cures for cancer and other serious illnesses. Now, in Unconditional Life, he undertakes an even greater challenge: to explain how consciousness can lead the way to total freedom and perfect health. Unconditional Life brings together disciplines ranging from modern physics and neuroscience to the ancient traditions of Indian wisdom to show how our perceptions create our reality for good or ill--and how the outside world can be shaped by altering the world within. In a book filled with hope and inspiration, Dr. Chopra offers compelling proof of the power of consciousness and a daring new vision of our own unlimited potential.",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "When Words Are Not Enough",
        "Authors": "By Raskin, Valerie D.",
        "Description": "One in four women will experience clinical depression, anxiety, or premenstrual depression in her lifetime. The good news is that popular new prescription drugs like  Prozac and Xanax bring much needed relief. The bad news is that many physicians and therapists are unaware of common issues for women. As medical treatment for depression and anxiety has become simpler, more and more general practitioners are prescribing antidepressants, often with little background in the nonmedical alternatives or complex mind-body interactions.Emphasizing women's family roles as well as their unique biological/hormonal sensitivities, Dr. Raskin explains contemporary integrated treatment options. Raskin pays special attention to how birth control, menstrual cycles, childbearing, and menopause impact treatment choices. Raskin empowers women to take an active approach in dealing with common side effects, including weight gain and diminished sexual responsiveness. Using revealing case studies, Raskin offers a wealth of hands-on advice.At a time when trends in health care have led to less personalized contact between doctor and patient, When Words Are Not Enough provides the facts and reassurance women need to be in control of their own health.",
        "Category": " Psychology , Psychopathology , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "The Ghost-Eye Tree (Owlet Book)",
        "Authors": "By Martin, Bill",
        "Description": "One dark and windy autumn night when the sun has long gone down, a young boy and his older sister are sent to the end of town to get a bucket of milk. As they walk down the lonely road, bathed in eerie moonlight, all the boy can think about is the ghost-eye tree.Oooo...I dreaded to go...I dreaded the tree....Why does Mama always choose meWhen the night is so darkAnd the mind runs free?What will happen when they come to the tree? Can they run past it or will it reach out and grab them?Any child who has been frightened of the dark will enjoy this scary book, which is meant to be read aloud. Bill Martin, Jr., and John Archambault developed the story as a reader's theater piece, which they have performed in schools across the country. Now, with Ted Rand's stunning illustrations, the ghost-eye tree comes to life. Watch out!",
        "Category": " Juvenile Fiction , Horror",
        "Publisher": "Square Fish",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "The Arab World: Personal Encounters",
        "Authors": "By Fernea, Elizabeth Warnock and Fernea, Robert A.",
        "Description": "Beyond considering the history, religion, leadership, and current social trends in the Arab world, the authors closely examine the lives of its people to portray the realities of daily life in the Arab nations",
        "Category": " History , Middle East , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "The Mary Kay Guide to Beauty: Discovering Your Special Look",
        "Authors": "By Beauty Experts at Mary Kay Cosmetics",
        "Description": "Drawing on the expertise of the staff of a leading cosmetic company, this thoroughly illustrated guide provides step-by-step instruction on skin care and makeup, with numerous tips on enhancing individual beauty",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "Addison-Wesley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "The Hunchback of Notre Dame: Illustrated Classic",
        "Authors": "By Cuddy, Robbin (ILT), Walt Disney Productions (COR), Hugo, Victor (EDT), and Ingoglia, Gina (EDT)",
        "Description": "In medieval Paris, Quasimodo, the hunchbacked bellringer of Notre Dame Cathedral, struggles to save the beautiful gypsy dancer Esmeralda from being unjustly executed.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Fear of Wine: An Introductory Guide to the Grape",
        "Authors": "By Brenner, Leslie and Teague, Lettie (ILT)",
        "Description": "In this friendly introductory guide, food and wine writer Leslie Brenner tells how to:  Pour and taste wine Develop a taste memory Order from a wine list Select a wine at the store Match food with wineIn addition, helpful sidebars illuminate such subjects as: How--and why--to swirl without sloshing Disarming a snotty waiter Ten great wines to bring to a dinner party Going beyond California Chardonnay Starting your own cellar for under $100Along the way, Lettie Teague's funny and informative cartoons enhance the text and make great devices for remembering the most important facts. Before long,your old standby, Chateau Screwtop, will be a distant memory. Accessible and concise, Fear of Wine will appeal to anyone who wants to know a little bit about a subject that can bring great pleasure. At last, a guide that is as fun to read as wine is to drink!",
        "Category": " Cooking , Beverages , Alcoholic , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "A Midsummer Night's Dream (Oxford School Shakespeare Series)",
        "Authors": "By Shakespeare, William and Gill, Roma (EDT)",
        "Description": "The 1600 First Quarto edition of A Midsummer Night's Dream is the only text of the play to have been printed in Shakespeare's lifetime and has served as the source for virtually all subsequent editions. It has many features suggesting that it was printed from Shakespeare's 'foul papers' - his manuscript draft - and that this draft had undergone revision before reaching the publishing house.",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "The Patriarchs and Moses (The Bible and its story)",
        "Authors": "By Pierre Talec",
        "Description": "Recounts the stories of Abraham and his descendants, who became the founding fathers of God's chosen people, and the story of Moses in Egypt.",
        "Category": "",
        "Publisher": "Winston Press",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Hold Me Up a Little Longer, Lord",
        "Authors": "By Holmes, Marjorie",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Making the Cisco Connection: The Story Behind the Real Internet Superpower",
        "Authors": "By Brandt, Richard, Bunnell, David, and Brate, Adam",
        "Description": "Cisco Systems is known among the technology elite in Silicon Valley as one of the most successful companies to emerge from the Valley in many years. It has been dubbed computing's next Superpower.Just as Intel and Microsoft soared to lofty heights with the rise of the personal computer, Cisco Systems is flying on the spectacular updraft of the Internet. The company, which makes specialized computers that route information through a network--acting as a sort of data traffic cop--has captured 85 percent of the market for routers used as the backbone of the biggest network of them all, the Internet. As a result, over the last five years, the value of Cisco's total outstanding stock has risen over 2,000 percent--twice the increase of Microsoft Corp. stock in the same period. Beginning as a tale of two college sweethearts at Stanford University who cofounded the company fifteen years ago, the often-told Cisco legend has all the makings of a great novel--love, money, a villain or two, corporate coups, and the sweet taste of victory. But mostly, the Cisco story is a very unusual tale of corporate success. Despite the struggle of passing through several regimes, Cisco managed to hit all the crucial spots of its business. Cisco consistently bested competitors like 3Com and IBM with insight, innovation, customer focus, and one of the biggest corporate buying sprees in history. Making the Cisco Connection deftly traces the networking giant's path to success, from its founding couple, Sandra Lerner and Leonard Bosack, to current CEO John Chambers. It highlights the company's astounding knack for buying other businesses and making them part of a huge conglomerate; its own highly developed use of technology; and its unusually tight-knit culture. Featuring the perspective of top Cisco executives and competitors, this book reveals how Cisco's technology, employees, and even its competition have blended to make Cisco possibly the most important company shaping the future of communications. Next to ruthless competitors Microsoft and Intel, Cisco shines with a kinder, gentler image, emphasizing happy customers and employees. You'll see how Cisco built its impressive culture by cultivating community, boosting morale, whittling down bureaucracy, and saving money to boot. This book also explains how Cisco is positioning itself to enter a new competitive playing field, moving beyond Internet routers in an attempt to build a single, giant, global communications system--based on the Internet--that would make the current telephone system obsolete. Cisco wants to be the company that delivers the infrastructure of this new network, which will combine computer networks with telephones, television, radio, and satellite communications. To do that, it is now challenging global giants such as Lucent Technologies and Fujitsu. Cisco plans to become the backbone of the entire communications industry, making it a corporation of incredible power as the Internet Age blossoms in the new millennium.Provocative and instructive, Making the Cisco Connection traces the unique history of one of the most profitable and enduring technology companies in business today.Acclaim for Making the CISCO Connection\"If you want to learn the whole scoop about the first Internet-Age company, and one of the most successful firms of any age, you've come to the right place. Bunnell's treatment of Cisco's rise--and continued rise--is fascinating and full of human detail. It's clear that Cisco is not just a firm with great technology, but also great leaders and managers.\"--Thomas H. Davenport, Director, Andersen Consulting Institute for Strategic Change; Professor, Boston University School of Management\"Cisco has emerged as a twenty-first century leader. David Bunnell captures the ongoing story of the Cisco executive team exploiting IT, structuring a unique organization, and creating a dynamic strategy for this breakaway dot com company",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "The Country Decorative Painting Companion (Country Companion)",
        "Authors": "By Miller, Judith and Miller, Martin",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "Collins Pub San Francisco",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Test Your Countercultural Literacy",
        "Authors": "By Zahler, Diane and Zahler, Kathy A.",
        "Description": "Tests the reader's knowledge of life in the 1960s and includes ten self-quizzes on the civil rights movement, the women's movement, the New Left, and rock 'n' roll",
        "Category": " History , General",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Pain Gain",
        "Authors": "By Carr, John F.",
        "Description": "",
        "Category": "",
        "Publisher": "Major Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The Anti-Coronary Cookbook",
        "Authors": "By HAVENSTEIN, Nathalie and Elizabeth Richardson",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Arthritis For Dummies (For Dummies (Computer/Tech))",
        "Authors": "By Fox, Barry and Taylor, Nadine",
        "Description": "Whether it’s a bit a creaky stiffness in the hip, aching knees that make walking from room to room a chore, or inflammation that settles in several joints, arthritis knocks on just about everyone’s door sooner or later. While there’s no definitive cure for arthritis, there’s no reason for you to spend your days sitting at home in an easy chair. You can take charge of your condition, control your symptoms, and get on with your life through a combination of medical care, simple lifestyle changes, and good old common sense.Arthritis For Dummies is for anyone who suffers from the various forms of arthritis or arthritic symptoms. In this easy-to-understand guide, you’ll discover how to recognize the signs of arthritis, what the major causes are, who is most likely to get it, and what to expect from your doctor. Whether you have osteoarthritis (the most common form), rheumatoid arthritis, infectious arthritis, bursitis, scleroderma, or one of the other forms of the disease, you'll see how to:Choose the right doctor for youRecognize the myths and scamsFight the pain with foods and supplements“Oil” your joints with exerciseControl your stress, aggression, and depressionDetermine whether or not you need surgeryLike the millions of others living with arthritis, you want to take an active part in managing your disease and improving day-to-day living. In this book, you’ll find the most up-to-date information on the latest treatments—from physical therapy and magnets to surgical and homeopathic options—as well as hands-on diet and exercise plans that can help reduce your symptoms. You’ll explore the best-of-the-best of many different healing systems, ranging from standard Western medicine to Eastern healing methods to more unconventional therapies, including:AcupunctureAromatherapyAyurvedic medicineBee venom therapyFolk medicineHerbs and homeopathyHypnotherapyReflexologyFeaturing special sections on preventing arthritis, super foods for fighting symptoms, and ten crackerjack new treatments, as well as a handy weight loss and management guide, Arthritis For Dummies provides the step-by-step guidance you need to control your pain, keep yourself on the move, and improve your overall health and quality of life.",
        "Category": " Medical , Rheumatology",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Even Eagles Need a Push: Learning to Soar in a Changing World",
        "Authors": "By McNally, David",
        "Description": "Discover your strengths, live your dreams! Let go of fear. Discover your true sense of purpose. Live the life you've only imagined!Why does the thrill of soaring begin with the fear of falling? How can you overcome that fear and dare to live? Let David McNally lead you on an extraordinary journey of discovery that takes you from motivation to inspiration to action. Be prepared to work! In this book, you write the ending. Read fascinating anecdotes, stories, personal revelations; practice the meditations, self-assessment exercises, affirmations, and keep track in your journal as you discover the power of your potential and begin to soar. Learn how to Choose your attitude and transform your life Practice positive affirmations to overcome self-doubt Radiate confidence as you discover the power of purpose Use language to help shape your thoughts Achieve what you truly want from lifeMaximize your creative potential. Find success with dignity. Deal with personal crises. Discover your answers in the book that will forever change the way you feel about your work, your dreams, and yourself, as it helps put your own personal powers to work.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Prayers and Devotions: 365 Daily Meditations; from John Paul II",
        "Authors": "By Lierde, Peter Canisius Johannes Van (EDT)",
        "Description": "Here is a treasury of selected passages from the writings and addresses of perhaps the most forceful, charismatic leader of the Catholic Church the world has ever known. This book is, as its editor, Bishop Peter Canisius Johannes van Lierde, suggests, \"a harvest from the mind and heart of Pope Wojtyla.\"And so you will spend a few moments with the Pope each day of the liturgical year through these pages of his reflections. This devotional was prepared to offer the modern reader, engaged with various daily tasks, the opportunity to know and to enter into the heart and mind of Pope John Paul II.His concerns as expressed in these passages include such topics as \"Sharing with Others,\" \"To Be in Peace,\" \"Consumer Society\" (\"Man is created for happiness. Yes! But man's happiness is not identified with enjoyment! In such enjoyment the consumer-oriented man loses the full dimension of his humanity\"), \"The Great Divine Trial,\" about the meaning of his near-assassination, \"The Christian Family in the Modern World,\" and \"Family Prayer.\" Through these pages of calm reflection each day, all will find a moment of peaceful repose from the occupations of life.",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "So You Think You Know Jane Austen?: A Literary Quizbook (Oxford World's Classics)",
        "Authors": "By Sutherland, John, Faye, Deirdre Le, and Le Faye, Deirdre",
        "Description": "How well do you really  know your favorite author? In this new book, ace literary detective turned quizmaster John Sutherland and Austen buff Deirdre Le Faye challenge you to find out. Starting with easy, factual questions that test how well you remember a novel and its characters, the quiz progresses to a level of greater difficulty, demanding close reading and interpretative deduction. What really motivates the characters, and what is going on beneath the surface of the story? Designed to amuse and divert, the questions and answers take the reader on an imaginative journey into the world of Jane Austen, where hypothesis and speculation produce fascinating and unexpected insights. The questions are ingenious and fun, and the answers (located in the back of the book), in Sutherland's inimitable style, are fascinating. Completing the book guarantees a hugely improved knowledge and appreciation of Austen. Whether you are an expert or enthusiast, So You Think You Know Jane Austen? guarantees you will know her much better after reading it.",
        "Category": " Literary Criticism , European , English, Irish, Scottish, Welsh",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "The Thirty-Nine Steps (Oxford World's Classics)",
        "Authors": "By Buchan, John and Harvie, Christopher T. (EDT)",
        "Description": "In The Thirty-Nine Steps (1915), the best-known of his thrillers (made into a popular movie by Alfred Hitchcock), John Buchan introduces his most enduring hero, Richard Hannay, who, despite claiming to be an \"ordinary fellow,\" is caught up in the dramatic and dangerous race against a plot to devastate the British war effort. In this, the only critical edition available, Christopher Harvie's introduction interweaves the writing of the tale with the equally fascinating story of how John Buchan, publisher and lawyer, came in from the cold and, via The Thirty-Nine Steps, ended the war as spy-master and propaganda chief.",
        "Category": " Literary Criticism , Semiotics & Theory",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Favorite Songs of the 1890s (Dover Song Collections)",
        "Authors": "By Fremont, Robert A. (EDT)",
        "Description": "Eight-eight favorites. After the Ball; Asleep in the Deep; The Band Played On; Dear Old Girl; Down Went McGinty; The Sidewalks of New York; Give My Regards to Broadway; Hello! Ma Baby; Meet Me in St. Louis, Louis; My Wild Irish Rose; more.",
        "Category": " Music , Printed Music , General",
        "Publisher": "Dover",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2012"
        }
    },
    {
        "Title": "The Greatest Treason: The Untold Story of Munich",
        "Authors": "By Thompson, Laurence Victor",
        "Description": "",
        "Category": "",
        "Publisher": "W. Morrow",
        "Price Starting With ($)": "14.55",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Old Boys",
        "Authors": "By McCarry, Charles",
        "Description": "Charles McCarry is considered by many to be the master of American spy fiction, brilliantly staking his claim with such international bestsellers as The Tears of Autumn and The Miernik Dossier. A spy writer’s spy writer, he has been lauded extravagantly by the critics and his peers. George V. Higgins wrote “Charles McCarry is the Lord's best combination of spellbinding storyteller and silken prose writer.” “Intelligent and enthralling,” said Eric Ambler, and Jeffrey Archer praised writing that “makes one put the book down and gasp.” In his magnificent new novel, with rights sold in six countries before publication, McCarry returns to the world of his legendary character, Paul Christopher, the crack intelligence agent who is as skilled at choosing a fine wine as he is at tradecraft, at once elegant and dangerous, sophisticated and rough-and-ready. As the novel begins, Paul Christopher, now an aging but remarkably fit 70ish, is dining at home with his cousin Horace, also an ex-agent. Dinner is delicious and uneventful. A day later, Paul has vanished. The months pass, Paul’s ashes are delivered by a Chinese official to the American consulate in Beijing and a memorial service is held in Washington. But Horace is not convinced that Paul is dead and, enlisting the support of four other retired colleagues—a sort of all-star backfield of the old Outfit—Horace gets the “Old Boys” back in the game to find Paul Christopher. Harassed by American intelligence, hunted by terrorists, Horace Christopher and the Old Boys travel the globe, from Xinjiang to Brazil, from Rome to Tel Aviv, Budapest to Moscow, in search of Paul and the unspeakably dangerous truth.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Overlook Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "God's Spirit: Transforming a World in Crisis",
        "Authors": "By Muller-Fahrenholz, Geiko",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Continuum Intl Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Consider Love: Its Moods and Many Ways",
        "Authors": "By Boynton, Sandra",
        "Description": "Consider Love Its Moods and Many Ways  From the sentimental to the soulful, this book explores in no depth whatsoever (but with a number of lively illustrations) the many and curious modes of love.  For one's own True Love, Consider Love is a present as varied and delightful as a fine box of chocolates, yet with the decided advantage that there aren't any of those icky little pineapple jelly things.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Valentine's Day",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The National Archives of the United States",
        "Authors": "By Viola, Herman J. and Bicla, Herman J.",
        "Description": "Features more than 250 illustrations documenting the Declaration of Independence, Constitution, Bill of Rights, and other treasures enshrined in The National Archives",
        "Category": " Language Arts & Disciplines , Library & Information Science , General",
        "Publisher": "Harry N Abrams Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "The Well Adjusted Child: How to Nurture the Emotional Health of Your Children",
        "Authors": "By Quinn, Phil E.",
        "Description": "Explains how parents can give their children emotional support, identifies common mistakes in child rearing, and tells the stories of troubled children",
        "Category": " House & Home , General",
        "Publisher": "Thomas Nelson Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "American Antiques, 1800-1900; A Collector's History and Guide",
        "Authors": "By Butler, Joseph T.",
        "Description": "",
        "Category": "",
        "Publisher": "THE ODYSSEY PRESS",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "A Visual Dictionary of Art",
        "Authors": "By Hill, A.",
        "Description": "",
        "Category": "",
        "Publisher": "NEW YORK GRAPHIC SOCIETY",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Charles Worthen: Silicone",
        "Authors": "By Rivet, Gabriele (EDT)",
        "Description": "",
        "Category": " Art , Individual Artists , General",
        "Publisher": "Hatje Cantz Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Art, Style and History; A Selective Survey of Art",
        "Authors": "By Longaker, Jon D.",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Scott Foresman & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1970"
        }
    },
    {
        "Title": "Descartes in 90 Minutes (Philosophers in 90 Minutes Series)",
        "Authors": "By Strathern, Paul",
        "Description": "In Descartes in 90 Minutes, Paul Strathern offers a concise, expert account of Descartes's life and ideas, and explains their influence on man's struggle to understand his existence in the world. The book also includes selections from Descartes's work; a brief list of suggested reading for those who wish to push further; and chronologies that place Descartes within his own age and in the broader scheme of philosophy.",
        "Category": " Philosophy , Movements , Rationalism",
        "Publisher": "Ivan R. Dee",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Landoll's Success With Gardening Collection",
        "Authors": "By Landolls",
        "Description": "",
        "Category": "",
        "Publisher": "Landoll",
        "Price Starting With ($)": "8.61",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Traditional Christmas Cooking, Crafts & Gifts",
        "Authors": "By Cy Decosse Inc, Decosse, Cy",
        "Description": "Demonstrates how to make Christmas decorations and ornaments, wreaths, garlands, table runners, placemats, and centerpieces, and shares recipes for cookies, candy, beverages, and holiday dinners",
        "Category": " Cooking , Reference",
        "Publisher": "Creative Pub Intl",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Counseling the Culturally Different: Theory and Practice",
        "Authors": "By Sue, David and Sue, Derald Wing",
        "Description": "Continuing the work started in the highly successful original edition, this revised and updated major work explores issues relevant to the culturally different in the United States and cuts across all ethnic/racial minorities. It is divided into three parts covering issues and concepts in cross-cultural counseling, counseling individual populations and critical incidents in cross-cultural counseling. Specifically, the conceptual framework is provided to aid in understanding the minority experience in the U.S., the role counseling has played with respect to larger societal forces, and the practice of cross-cultural counseling in mental health agencies, industries, public schools and correctional settings. Additionally, specific minority groups are given individual treatment to contrast similarities and differences. One note—major revisions to this edition (approximately 80%) are the result of current changes in the field and the authors' rethinking of earlier models of multicultural counseling.",
        "Category": " Psychology , Clinical Psychology",
        "Publisher": "Wiley-Interscience",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Take Time for Paradise: Americans and Their Games",
        "Authors": "By Giamatti, A. Bartlett",
        "Description": "The late scholar and commissioner of major league baseball explores the American fascination with sports and discusses baseball as a metaphor for America",
        "Category": " Sports & Recreation , General",
        "Publisher": "Summit Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Technical writing: A reader-centered approach",
        "Authors": "By Anderson, Paul V.",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt Brace Jovanovich",
        "Price Starting With ($)": "6.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Herblock: A Cartoonist's Life",
        "Authors": "By Block, Herbert",
        "Description": "Herblock: A Cartoonist's Life tells of the remarkable career that has spanned the era from Roosevelt to Clinton. Herb Block opposed isolationism before World War II; warned of nuclear hazards in the '40s; opposed McCarthyism in the '50s and racism in the '50s and '60s; and zeroed in on Watergate in the '70s and Iran-contra and other Reagan-Bush scandals in the '80s.He coined the word \"McCarthyism\" and describes that time of fear. He also writes engagingly about personal incidents and meetings with public figures.Herbert Block has been using the pen name \"Herblock\" since the age of thirteen, when he started contributing quips and comments to a humor column in the Chicago Tribune and apprenticed himself to the columnist. He dropped out of college to take his first cartooning job with the Chicago Daily News at age 19.In 1946, after a wartime stint in the Army, he moved to The Washington Post - then a comparatively small paper.He is the only cartoonist to win the Elijah Parish Lovejoy Award for contributions to the cause of freedom of speech and the press, the National Press Club Fourth Estate Award and the Franklin Roosevelt Freedom Medal. He is also the only living cartoonist whose work is in the National Gallery of Art.",
        "Category": " Biography & Autobiography , Artists, Architects, Photographers",
        "Publisher": "Scribner",
        "Price Starting With ($)": "9.88",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "The War of 1812 (The Chicago History of American Civilization)",
        "Authors": "By Coles, Harry L.",
        "Description": "This compact history of the war attempts to separate myth from reality. Professor Coles narrates the main operations on both land and sea of the three-year struggle. He examines the conflict from the British (and Canadian) as well as the American point of view, relating events in America to the larger war going on in Europe. \"A balanced analysis of tactics and strategy, this book also summarizes succinctly and clearly recent scholarship on causes and describes briefly the war's military, economic, and political consequences. Coles has surveyed thoroughly the existing literature but arrives at a number of independent judgments. It is the best single-volume account of the war in all its aspects. In recounting sea battles, Coles puts aside the patriotic blinders that have for so long prevented a sensible understanding of American capabilities and strategic necessities; thus American naval victories are put in a proper perspective. And in dealing with land engagements, he has shunned the mocking and amused attitude which has so often passed for historical judgment. Undergraduates will be stimulated by the hints of modern parallels and will find useful the excellent annotated bibliography and simple maps.\"—Choice",
        "Category": " History , United States , 19th Century",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1966"
        }
    },
    {
        "Title": "The Germans",
        "Authors": "By Craig, Gordon A.",
        "Description": "This analysis of the evolution of West Germany into a true democracy traces the antecedents of contemporary German institutions in the country's paradoxical past and examines the structure of the institutions and their prospects",
        "Category": " Social Science , Anthropology , Cultural & Social",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "Caldecott Award: The Winners and the Honor Books",
        "Authors": "By Woolman, Bertha and Litsey, Patricia",
        "Description": "",
        "Category": "",
        "Publisher": "T. S. Denison & Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Illusion of Peace: 2",
        "Authors": "By Szulc, Tad",
        "Description": "",
        "Category": "",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "May",
            "Year": "1978"
        }
    },
    {
        "Title": "The Social Lives of Dogs",
        "Authors": "By Thomas, Elizabeth Marshall and Williams, Jared Taylor (ILT)",
        "Description": "In her absorbing bestseller, The Hidden Life of Dogs, Elizabeth Marshall Thomas provided fascinating answers to the question \"What do dogs want?\" It turns out that more than anything, they want the company of other dogs. Now, in this frank and moving sequel, she explores how, despite this desire, they have beautifully adapted to life with their human owners. If they can't belong to a group with similar dogs, they will establish or join one with other members of the household, whether those members are men, women, children, other dogs of different ages and breeds, cats, or birds. And, contrary to our assumptions that we wield the power in our relationships with our dogs, it is they who are teaching us new behaviors -- even settling disputes in ways we are unaware of.  No one writing today about dogs and people has Elizabeth Marshall Thomas's skills as a classically trained anthropologist and popularizer. What she has observed and analyzed will be illuminating to all of us who have wondered about our pets' behavior. Do dogs have different barks that mean different things? How does Snoopy recognize as family people he sees only once a year? And why does Misty bark at strangers she sees every day? What factors contribute to making a dog difficult to house-train? Why do certain dogs and cats get along so well? How do animals train each other?  Thomas explores these questions by taking us into the mixed-species groups of her own household, particularly the lives of her remarkable dogs, with their differences in breeding, early training, and personality. Misty, a purebred, had been kept in a crate, alone, for most of her first year; lonely and insecure, she was afraid of grass and stairs, which she had never seen. Ruby was abandoned, having been pronounced untrainable. Pearl had lived with Thomas's son in his large household, and on her arrival at Thomas's house, she behaved like the well-mannered, self-possessed being she was. And Sundog, the most loyal, self-confident, courageous of all, accepted the arrival of each of these new dogs, but had made a group consisting of himself and Thomas's husband, so the others sorted themselves out without him. Each of these dogs, like any other, wanted more than anything to belong to a group, and how they organized themselves into felicitous relationships without any input from their owners is the most compelling of Elizabeth Thomas's many findings.  Few dogs get to live with their chosen loved ones; they are slaves to our desires. We convince ourselves, however wrongly, that we know what's best for them. The Social Lives of Dogs presents marvelous evidence of the power of the group. And those of us fortunate enough to be given the trust of any honorable dog will have our lives enlarged.  In her absorbing bestseller, The Hidden Life of Dogs, Elizabeth Marshall Thomas provided fascinating answers to the question \"What do dogs want?\" It turns out that more than anything, they want the company of other dogs. Now, in this frank and moving sequel, she explores how, despite this desire, they have beautifully adapted to life with their human owners. If they can't belong to a group with similar dogs, they will establish or join one with other members of the household, whether those members are men, women, children, other dogs of different ages and breeds, cats, or birds. And, contrary to our assumptions that we wield the power in our relationships with our dogs, it is they who are teaching us new behaviors -- even settling disputes in ways we are unaware of.  No one writing today about dogs and people has Elizabeth Marshall Thomas's skills as a classically trained anthropologist and popularizer. What she has observed and analyzed will be illuminating to all of us who have wondered about our pets' behavior. Do dogs have different barks that mean different things? How does Snoopy recognize as family people he sees only once a year? And why does Misty bark at strangers she sees every day? What factors contribute to making a dog difficult to house-train? Why do certain dogs and cats get along so well? How do animals train each other?  Thomas explores these questions by taking us into the mixed-species groups of her own household, particularly the lives of her remarkable dogs, with their differences in breeding, early training, and personality. Misty, a purebred, had been kept in a crate, alone, for most of her first year; lonely and insecure, she was afraid of grass and stairs, which she had never seen. Ruby was abandoned, having been pronounced untrainable. Pearl had lived with Thomas's son in his large household, and on her arrival at Thomas's house, she behaved like the well-mannered, self-possessed being she was. And Sundog, the most loyal, self-confident, courageous of all, accepted the arrival of each of these new dogs, but had made a group consisting of himself and Thomas's husband, so the others sorted themselves out without him. Each of these dogs, like any other, wanted more than anything to belong to a group, and how they organized themselves into felicitous relationships without any input from their owners is the most compelling of Elizabeth Thomas's many findings.  Few dogs get to live with their chosen loved ones; they are slaves to our desires. We convince ourselves, however wrongly, that we know what's best for them. The Social Lives of Dogs presents marvelous evidence of the power of the group. And those of us fortunate enough to be given the trust of any honorable dog will have our lives enlarged.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "African America: Portrait of a People",
        "Authors": "By Estell, Kenneth",
        "Description": "A timeless almanac to a legacy of pride, struggle, and triumph spanning nearly 400 years, African America is a fascinating mix of biography, little-known or understood history, enlightening essays on significant legislation and movements, rare photography, and illuminating storytelling. With a unique focus on people, it presents biographies of 500 influential figures in all walks of life as well as more than 300 photographs and illustrations. Eighteen topical chapters, each written by an expert in the field, cover current and historic issues and events surrounding the civil rights movement, African American literature, art, and music, religion within the black community, advances in science and medicine, and many other topics of key interest to students of African American culture.",
        "Category": " Social Science , Anthropology , Cultural & Social",
        "Publisher": "Visible Ink Press",
        "Price Starting With ($)": "7.74",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Bernice Chesler's Bed & Breakfast in the Mid-Atlantic States: Fifth Edition--Delaware, Maryland, New Jersey, New York, North Carolina, Pennsylvania, ... AND BREAKFAST IN THE MID-ATLANTIC STATES)",
        "Authors": "By Chesler, Bernice",
        "Description": "The most comprehensive, best-selling guide to mid-Atlantic bed and breakfasts, with yearly sales of 18,000 copies, is now fully updates in this fifth edition. Including over 450 inns, Bernice Chesler's Bed and Breakfast in the Mid-Atlantic States provides all the information needed for planning a memorable overnight or extended stay. Each entry details room sizes and rates, breakfast times and suggested menus, amenities and attractions, and architecture and decor, along with host profiles and comments from past guests. This definitive volume sets the standard for bed-and-breakfast guides.",
        "Category": " Travel , Food, Lodging & Transportation , Bed & Breakfast",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Whither ? and Other Stories (Masters of Modern Hebrew Literature)",
        "Authors": "By Feuerberg, Mordecai Zeev",
        "Description": "",
        "Category": "",
        "Publisher": "Jewish Publication Society of America",
        "Price Starting With ($)": "8.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Seasons of the Mind",
        "Authors": "By Rosenthal, Norman E.",
        "Description": "",
        "Category": " Psychology , Mental Health",
        "Publisher": "The Guilford Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Catholic Girls",
        "Authors": "By Reed, Kit",
        "Description": "In this story of Catholic guilt, ambition, and confrontation, a group of college friends--Georgia, Agnes, Kath, and Mickey--come together twenty years later to save one of their own",
        "Category": " Fiction , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "10.42",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Easy PC Maintenance and Repair",
        "Authors": "By Laplante, Phillip A.",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Windcrest",
        "Price Starting With ($)": "5.74",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The French-kosher cookbook",
        "Authors": "By Grossman, Ruth",
        "Description": "",
        "Category": "",
        "Publisher": "Galahad Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Weaving the Net: Conditional Engagement with China",
        "Authors": "By Council on Foreign Relations (COR) and Shinn, James (EDT)",
        "Description": "China is emerging as a new great power in Asia. But what kind of power will China become--a wealthy trading partner or a belligerent adversary? Will expanding economic links between China and the world community bring about political moderation in Beijing? Or will it endow the Chinese leadership with all the money it needs to create a modern and even more dangerous People's Liberation Army?Weaving the Net argues for an American strategy that acknowledges and is fully prepared to deal with the vast uncertainty about China's future trajectory.\"Tough minded logic.... Weaving the Net ought to, and probably will, serve as the definitive guide to how and why American policy towards China will and should toughen.\" The Economist\"Weaving the Net is a hard-hitting, well-reasoned argument for a sustainable U.S. policy toward China, and a stimulating exploration of an issue that will dominate the early 21st century.\" Robert A. Scalapino, University of California, Berkeley\"... makes the case that conditional engagement is better than conditional containment. To succeed, America has to persuade the Chinese that it is engagement, not containment, which is conditional.\" Lee Kuan Yew, Senior Minister, Republic of Singapore\"... a major contribution to the current debate on China policy. It identifies...ten principles to guide China policy and analyzes China's underlying economic and security trends.... The result is a very informative, terse book that should inform policymakers and opinion leaders.\" Michael Oksenberg, Stanford University",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Council on Foreign Relations Press",
        "Price Starting With ($)": "5.15",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Beneath the Mask",
        "Authors": "By Monte, Christopher F.",
        "Description": "",
        "Category": " Psychology , Personality",
        "Publisher": "Harcourt College Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The Old Farmer's Almanac Book of Everyday Advice",
        "Authors": "By Hale, Judson D., Sr. (EDT)",
        "Description": "Since 1792 The Old Farmer's Almanac has offered advice, both practical and esoteric. From the best times to plant peas to concocting elixirs for prophetic dreams, Judson Hale, twelfth editor of The Old Farmer's Almanac, brings together in this collection two centuries of research, experience, and American ingenuity. Hundreds of questions are answered in this lavishly illustrated volume packed with hundreds of photographs, etchings, and fascinating American folklore.",
        "Category": " Reference , Almanacs",
        "Publisher": "Random House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Wild Card",
        "Authors": "By Galvin, Martin",
        "Description": "",
        "Category": " Poetry , General",
        "Publisher": "Washington Writers Pub House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "The One Year Josh McDowell's Youth Devotions",
        "Authors": "By Hostetler, Bob and McDowell, Josh D.",
        "Description": "Aimed directly at the needs and interests of preteens and teens, The One Year Josh McDowell’s Youth Devotions is a Right From Wrong devotional that helps young people apply the Scriptures in daily decision making. Covering a host of topics that are relevant to today’s teens, this devotional encourages teens to think through difficult choices, enabling them to discover why certain choices are right or wrong.",
        "Category": " Religion , Prayerbooks , Christian",
        "Publisher": "Tyndale Kids",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Stocking Stuffer Crafts",
        "Authors": "By Publications International",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Discoveries: Forbidden City (Discoveries Series)",
        "Authors": "By Beguin, Giles and Morel, Dominque",
        "Description": "Traces the history of the Chinese palace that was reserved exclusively for the Emperor and his court",
        "Category": " History , Asia , China",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Independent School Guide for Washington, D.C. and Surrounding Area",
        "Authors": "By Zacharie, Jill (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Lift Hill Pr",
        "Price Starting With ($)": "15.95",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Baseball Days: From the Sandlots to \"the Show\"",
        "Authors": "By Horenstein, Henry (PHT) and Littlefield, Bill (CON)",
        "Description": "A photographic chronicle of America's favorite pastime captures the ritual and romance of the game, from stickball on the streets of Caracas to the Big Leagues. By the author of Racing Days. Tour.",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Bulfinch Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Faith in the Valley: Lessons for Women on the Journey to Peace",
        "Authors": "By Vanzant, Iyanla",
        "Description": "“The most powerful spiritual healer, fixer, teacher on the planet.” —Oprah Winfrey In this companion volume to her bestselling book Acts of Faith, bestselling author and star of “Iyanla: Fix My Life” discusses the “valleys” that cause stress and imbalance for women and explains how women can cleanse their minds and promote a healthy foundation for living in the modern world.A Note from Iyanla Vanzant Beloved friend, When this little book was first published many years ago, it became a beacon of light for many people who found themselves time and time again in one valley or another. Valleys are nothing new for any of us. Some of you may be in a valley right now, or, since you never know what’s around the corner, you may be on the brink of tottering into yet another valley. Or maybe you’ve just survived a valley that you swear you’ll never revisit—but guess what? That’s precisely the valley you’ll probably see again. And again.  Being in a valley can be a lonely and bewildering experience. This book was written to help you feel less lonely by reminding you that you really aren’t ever alone since God is always by your side, but more important, you are always by your own side. No matter how dire the situation may seem, no matter how dark and bleak the valley may be, you have all you need within you to survive the valley—any valley. Even though you may not know how you got into the valley in the first place, you do know, deep inside yourself, how to get through and out and free. You just need a little faith in yourself and a little guidance to find that faith within yourself.  When you are at your wit’s end, take this little book and let it guide you toward the ever-present but often elusive light at the end of the tunnel. Faith in the Valley is designed to help you find the light when you need it most—when you’re in that damn tunnel. When you’re most confused and in the dark and clueless as to how you got there (again!) and when you’re trying to figure out not just how to get out, but stay out. For good.  Faith in the Valley has helped so many through so much that we felt it only fitting to issue this lovely gift edition to acknowledge the special place it holds in many hearts. Please share it with a friend who has served as your beacon in the past, or offer it to yourself as a reminder of the strength and wisdom you possess and can offer to others.  Iyanla",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Who Will Be My Teacher?",
        "Authors": "By Ward, Marjory Goldfinch",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Seeing Mary Plain: A Life of Mary McCarthy",
        "Authors": "By Kiernan, Frances",
        "Description": "At last, a biography absorbing enough to do justice to one of the most controversial American intellectuals of this century. Beautiful, reckless, and endlessly maddening, Mary McCarthy (1912-1989) never failed to leave an impression. From her Partisan Review days as the embattled \"dark lady of American letters\" to her stormy marriage to (and even stormier divorce from) critic Edmund Wilson, from her huge but controversial success with her best-selling novel The Group to her epic libel battle with Lillian Hellman, she brought an almost nineteenth-century scope and drama to her emblematic twentieth-century life. Time called her \"quite possibly the cleverest woman America has ever produced,\" and she moved in a circle of the most intellectually combative and sharpest tongued Americans of this century--all of whom had plenty to say (some of it complimentary, some distinctly not) about this vibrant woman in their midst. Frances Kiernan has interviewed dozens of McCarthy's good friends, former lovers, literary and political comrades-in-arms, awestruck admirers, amused observers, and bitter adversaries to produce a definitive biography rich in delicious gossip, ironic judgment, and eloquent testimony.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "The Pilgrims' Way: Shrines and Saints in Britain and Ireland",
        "Authors": "By Adair, John Eric",
        "Description": "",
        "Category": "",
        "Publisher": "Thames & Hudson",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "July",
            "Year": "1978"
        }
    },
    {
        "Title": "Learning disabilities: Concepts and characteristics",
        "Authors": "By Wallace, Gerald",
        "Description": "",
        "Category": "",
        "Publisher": "Merrill",
        "Price Starting With ($)": "5.28",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The Home Remodeler: Plans & Ideas for Thirty-One Outstanding Remodeling Projects",
        "Authors": "By Farnsworth, Christina B.",
        "Description": "",
        "Category": "",
        "Publisher": "Home Planners",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    }
]