[
    {
        "Title": "Teach Yourself Web Publishing With Html in a Week",
        "Authors": "By Lemay, Laura",
        "Description": "If you want to create a home page, present information about products on the World Wide Web, or combine text, images, sound, and video in online Web creations, this book is for you. It's the easiest way to learn how to produce attractive, well-designed Web pages - and more - using HyperText Markup Language (HTML). With Teach Yourself Web Publishing with HTML in a Week, you'll quickly master HTML fundamentals and discover the best way to present information in this exciting new medium.Similar to other Teach Yourself books, this tutorial and reference is organized on a day-by-day basis and uses a variety of teaching elements. You'll learn how to develop your own Web pages and link them together, as well as discover how to set up your own Web server and use it to manage forms and create special programs to process them.",
        "Category": "",
        "Publisher": "Sams Publishing",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "The Incredible Truth about Mothers",
        "Authors": "By Greive, Bradley Trevor",
        "Description": "Motherhood is the world's most demanding--and rewarding--job. It's a calling that comes with incredible highs and gut-wrenching lows. How to express both the joys and challenges inherent in parenting the next generation in a way that is guaranteed to leave your audience smiling with tears in their eyes? Leave it to the one and only, Bradley Trevor Greive.  In this moving and yet often side splittingly funny homage to mothers everywhere, the best-selling author has masterfully paired his insightful prose with humorous animal photography that quickly and succinctly sums up his narrative's loving nuances. A mother tiger nuzzling her cub. A basset hound with an ice bag on her head. All are fodder and focus for BTG's unique wit and wisdom.  From birth to toddlers to teenagers, The Incredible Truth About MothersÂ covers the many stops and starts children make on their journey to adulthood and describes how devoted mothers are both teacher and student. Of course, the book ends with a heartfelt \"I love you, Mom!\" on behalf of the hundreds of thousands of readers who will buy it as a Mother's Day present.",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Windows 98 Simplified (Idg's 3-D Visual Series)",
        "Authors": "By Maran, Ruth",
        "Description": "With more than five million satisfied users, the acclaimed IDG Books' 3-D Visual® Series has become synonymous with introductory computer book publishing excellence. Windows® 98 Simplified®, with full color graphics on every page, is simply the easiest way to learn Windows 98.  Windows 98 Simplified shuttles you through the taskbar, the Active Desktop, e-mail, Web integration, channels, shortcuts, custom features, and more with step-by-step instructions and helpful illustrations. The maranGraphics team, using the latest technological advances, delivers remarkably sharp screen renderings that take you into the Windows desktop and demonstrate specific tasks. With Windows 98 Simplified, you'll become a PC whiz faster than you ever thought possible!",
        "Category": " Computers , Operating Systems , Windows Workstation",
        "Publisher": "Visual",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Cooking Secrets of the CIA: Favorite Recipes from the Culinary Institute -- America's Most Celebrated Cooking SchoolCompanion to the PBS Series",
        "Authors": "By Culinary Institute of America and Eccless, Pavlina (PHT)",
        "Description": "The secret's out! The C.I.A.?the Culinary Institute of America?has lifted the lid on its best-kept secrets in this gorgeously illustrated, major new cookbook of over 60 stunning seasonal and holiday recipes. Companion to this Fall's much-anticipated PBS series of the same name, Cooking Secrets of the C.I.A.is the book food and cooking enthusiasts will turn to again and again. With recipes for Christmas, Hanukkah, Valentine's Day, and even Super Bowl Sunday, Cooking Secrets of the C.I.A. will help cooks everywhere score points with family and friends. Whatever the occasion, let this essential volume be your secret ingredient for success in the kitchen.",
        "Category": " Cooking , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Healing Foods: The Ultimate Authority on the Curative Power of Nutrition",
        "Authors": "By Hausman, Patricia and Hurley, Judith Benn",
        "Description": "",
        "Category": " Health & Fitness , Healing",
        "Publisher": "Rodale Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Argument Culture Moving From Debate to Dialogue",
        "Authors": "By Tannen, Deborah",
        "Description": "",
        "Category": "",
        "Publisher": "Random House~trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Truth About Money: \"Because Money Doesn't Come With Instructions\"",
        "Authors": "By Edelman, Ric",
        "Description": "Provides comprehensive personal financial planning and discusses adapting to today's financial environment",
        "Category": " Business & Economics , Personal Finance , Money Management",
        "Publisher": "Georgetown Univ Pr",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Pasta and Garlic: Low-Fat Recipes..... That Work",
        "Authors": "By Gluck, Chris and Molenaar, John",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Pasta",
        "Publisher": "Pasta Pr Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Literary Dog: Great Contemporary Dog Stories",
        "Authors": "By Schinto, Jeanne (EDT)",
        "Description": "The Literary Dog: Great Contemporary Dog Stories. A superlative collection of contemporary stories written by some of the most important writers of our time. These stories, selected by short-story writer Jeanne Schinto, are for lovers of good fiction - with a healthy side interest in dogs. The Literary Dog features good dogs, bad dogs, but only great fiction.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Atlantic Monthly Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Herbcrafts: Practical Inspirations for Natural Gifts, Country Crafts and Decorative Displays",
        "Authors": "By Evelegh, Tessa and Wreford, Polly (PHT)",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Lorenz Books",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Guppies in Tuxedos: Funny Eponyms",
        "Authors": "By Terban, Marvin and Maestro, Giulio (ILT)",
        "Description": "A person or place that becomes a word is an eponym, and here we have the surprising stories behind more than a hundred eponymous words.",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "Sandpiper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "The Head Game: Baseball Seen from the Pitcher's Mound",
        "Authors": "By Tinkelman, Murray (ILT) and Kahn, Roger",
        "Description": "Beyond the techniques and training, baseball begins with one player facing another and the psychological battle that they wage-the head game. In his critically acclaimed and bestselling new book, Roger Kahn presents the story of this supreme war of wits and the people who changed the course of baseball by playing, what he calls, chess at 90 miles an hour. In The Head Game, Kahn investigates not only grips, tactics, and physics, but also the intelligence, maturity, and competitive fire that has inspired some of the greatest hurlers in history.By covering renowned pitchers and pitching minds-from Christy Mathewson, Cy Young, Don Drysdale, Bob Gibson, and Bruce Sutter to today's reigning pitching coach, Leo Mazzone-Roger Kahn sheds new light on baseball's most pivotal contest. A delightful and edifying tour of America's favorite pastime seen through the pitcher's eyes, The Head Game \"is as lively and familiar and old-shoe as the game itself, even today\" (Los Angeles Times).",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Read & Listen: Pinocchio (DK Read & Listen)",
        "Authors": "By Fior, Jane (ADP), Bartram, Simon (ILT), and Lindsay, Robert (NRT)",
        "Description": "Pinocchio -- the wooden puppet that yearns to be a real boy -- is loved by children everywhere; this edition of Pinocchio's story is exciting and accessible. Pinocchio -- the wooden puppet who yearns to be a real boy -- is loved by children everywhere. As he bungles his way through life from one escapade to another, will he finally realize his heart's desire? Children love to listen to stories, and their favorite DK books are available in book and tape packages--perfect for the car, or anywhere! These timeless, classic stories have been gloriously illustrated and made accessible for younger children to read alone, or for all the family to enjoy together, as they listen along with the cassette tape. This fresh approach brings the stories and their characters to life. There are also special pages dedicated to background detail, setting the scene of each story.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "DK CHILDREN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Don't Do That!: A Child's Guide to Bad Manners, Ridiculous Rules, and Inadequate Etiquette (Rainbow Morning Music Picture Books)",
        "Authors": "By Polisar, Barry Louis and Clark, David (ILT)",
        "Description": "This funny and fun loving guide to misbehaving properly is perfect for introducing kids to manners. Topics include: \"How to Play with your Food,\" \"Family Trips and Riding in the Car,\" and many more. Kids get the ideas and enlightened adults will see right through them to the warm-hearted sense underneath.",
        "Category": " Juvenile Nonfiction , Social Topics , Manners & Etiquette",
        "Publisher": "Rainbow Morning Music",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Official Handbook of the Vast Right Wing Conspiracy",
        "Authors": "By Smith, Mark W.",
        "Description": "Smith, a trial lawyer and former professor of law, provides the ammunition every conservative needs to shoot down liberals. He outlines arguments for conservative opinions on everything from the United Nations (\"Let's tear it down and put up a Starbucks\") to capital punishment (\"Forget the electric chair, bring on the electric bleachers.\") Each opinion is supported by references to political commentators, professors, print sources, and Web sites. A detachable color membership card for the Vast Right-Wing Conspiracy is included. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , General",
        "Publisher": "Regnery Publishing, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The Organization Map",
        "Authors": "By McClellan, Pam",
        "Description": "Offers advice on time management, storage solutions, meal planning, and work schedules, and explains how to reduce clutter and get family members to help with housework",
        "Category": " Business & Economics , General",
        "Publisher": "Betterway Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Handbook of Computer Communication Stds Volume 2",
        "Authors": "By Stalings, Willam",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Computer Professional's Quick Reference",
        "Authors": "By Vassiliou. Marius S.",
        "Description": "Fast access to the basic commands, statements and functions for UNIX, VAX/VMS, VM/CMS, MVS-TSO, MS-DOS, and Macintosh systems. Also includes information on standards organizations and procedures, conversion, ISO alphabets, floating-point formats, typography, and other topics. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Computers , General",
        "Publisher": "Computing McGraw-Hill",
        "Price Starting With ($)": "9.93",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "The Reader's Companion to Mexico",
        "Authors": "By Ryan, Alan (EDT)",
        "Description": "Mexico has long held sway over the passions of travelers and has been featured in the writings of such keen observers as Katherine Anne Porter, Paul Bowles, Langston Hughes, Elizabeth Borton de Trevino, and John Steinbeck. Their eyewitness accounts are gathered with those of a score of other writers in this remarkable collection of some of the best travel writing ever about some of the most popular destinations for travelers, from Cabo San Lucas to Mexico City to Yucatan.Says editor Alan Ryan about this collection, \"I wanted a book that would be like a trunk filled with letters from a branch of the family that's lived and traveled for many years in Mexico. Some of these imaginary relatives loved the country and made it their own. Some visited briefly, saw what there was to see, and left. A few disliked it, complained about everything, and couldn't wait to get away. All of them sent back reports.\" These personal \"reports\" accentuate Mexico's diversity and provide an incomparably richer perspective of this complex country than could possibly be offered by any standard guidebook. As Booklist commented in an exultant boxed review, this is a \"sometimes startling collection that would indeed make a fine traveling companion.\"",
        "Category": " Travel , Mexico",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Who's Looking Out for You?",
        "Authors": "By O'Reilly, Bill",
        "Description": "From the mega-bestselling author of The O'Reilly Factor and The No Spin Zone, a no-holds-barred exposé of the people and institutions who are letting Americans down – and what we should do about it.Bill O’Reilly is mad as hell – and he’s not going to let you take it anymore.  In his most powerful and personal book yet, this media powerhouse and unstoppable truth-teller takes on those individuals and institutions in American life who are failing in their duties – big-time.  In his inimitable style, mixing wit, pugnacity, and plain common sense, O’Reilly kicks butt and takes (and also names) names – from crooked corporate weasels to venal politicians to lazy and/or politically correct bureaucrats to sexually predatory priests and the Church hierarchy that protects them to a media establishment rife with political bias and economically hooked on violence and smut.  At the same time that he calls the famous and powerful to account, he dares to get personal, questioning just how much our closest friends, families, and lovers do look out for us, and delivering a powerful message about personal responsibility and self-reliance in an uncertain world.  He forces us to ask just how much genuine altruism is left in a society that thrives on self-indulgence and ruthless competition.Who’s Looking Out for You? is a book that boldly confronts our worst fears and biggest problems in a post-9/11, post-corporate-meltdown world.  Its sage, candid advice on regaining control and trust in these troubled times will resonate with the millions of readers and viewers who have come to believe in Bill O’Reilly as the man who speaks for them.",
        "Category": " Political Science , American Government , General",
        "Publisher": "Crown Archetype",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Banana Republicans: How the Right Wing is Turning America Into a One-Party State",
        "Authors": "By Stauber, John C. and Rampton, Sheldon",
        "Description": "The bestselling authors of Weapons of Mass Deception expose how the \"right-wing conspiracy,\" as represented by the GOP and its mouthpieces in media, lobbying groups, and the legal system, is undermining dissent and squelching pluralistic politics in America.  The U.S. economy is on the ropes, fear grips the nation, and we are embroiled in two overseas military quagmires with no end in sight. Outside its borders, the United States is hated and feared as never before.  For the first time in living memory, a single party-the Republicans-controls every major institution of the federal government: the White House, the Supreme Court, the Senate and House of Representatives-not to mention the \"fourth branch of government,\" the mass media. How did this come to pass?  Banana Republicans reveals how the national GOP maintains its hold on power through the systematic manipulation of the electoral system, the courts, the media, and the lobbying establishment. The book examines:  * The legacy of the Florida ballot scandal, and how it has played out in the recall movement in California-and other states, where recall efforts are under way-and in the redistricting controversy in Texas. * How a GOP echo chamber systematically spreads its views through conservative media giants-e.g., Clear Channel, Fox-and highly placed columnists, journalists, and opinion makers. * How the Bush administration is loading the federal courts with a generation of demagogues, and smearing the names of legislators who attempt to stand in its way. * How House Majority Leader Tom DeLay has strong-armed traditional lobbying firms into exclusively hiring Republicans, so that even K Street is political, rather than merely opportunistic. * How the GOP has equated dissent with treason-e.g., Defense Secretary Donald Rumsfeld accusing war critics of abetting terrorism. * How the Bush administration uses its power to punish dissent, such as the leaking of a CIA agent's name to the press, and unprecedented lawsuits against activist organizations such as Greenpeace.",
        "Category": " Political Science , American Government , General",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Crossing California",
        "Authors": "By Langer, Adam",
        "Description": "Set in Chicago's Jewish neighborhood of West Rogers Park, this is the story of three families--adults and children alike--coming of age during the tumultuous, turbulent days of the Iran hostage crisis. At the close of the 1970s, the Rovners, the Wasserstroms, and the Wills-Silvermans will have to shed their pasts to cross into that new, shining decade of hope: the 80s.",
        "Category": " Fiction , Sagas",
        "Publisher": "Riverhead Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Fuzzy Logic: The Revolutionary Computer Technology that Is Changing Our World",
        "Authors": "By McNeill, Daniel and Freiberger, Paul",
        "Description": "Explains the concept of fuzzy logic, tells how it was developed in the United States, but only exploited in Japan so far, and describes products of the future that will feature fuzzy logic",
        "Category": " Business & Economics , General",
        "Publisher": "Touchstone / Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Hacking Exposed: Network Security Secrets & Solutions (Hacking Exposed)",
        "Authors": "By McClure, Stuart, Scambray, Joel, and Kurtz, George",
        "Description": "Analyzes recent attacks on computer networks and discusses security, auditing, and intrusion detection procedures",
        "Category": " Computers , Security , General",
        "Publisher": "Computing McGraw-Hill",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Step-by-Step Tiling Projects",
        "Authors": "By Better Homes and Gardens Books (EDT) and Marshall, Paula (EDT)",
        "Description": "Presents a variety of tile options, practical tips for choosing tile, and step-by-step guidance for installing tile indoors and out.More than 40 inviting, inspirational photographs of tile installed in a variety of environments.Thorough instructional copy and more than 200 illustrations.Tips from the experts on properly installing tile floors, walls, backsplashes, and patios.Simply and clearly explains tile composition, grouting, and sealing.Tips for properly fitting tiles in difficult places and choosing the right accent tiles.",
        "Category": " House & Home , Do-It-Yourself , Masonry",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The Cat Who Covered the World: The Adventures Of Henrietta And Her Foreign Correspondent",
        "Authors": "By Wren, Christopher S.",
        "Description": "Henrietta was an ordinary New York City cat until she ventured overseas with foreign correspondent Christopher S. Wren and his wife and children. Over seventeen years and tens of thousands of miles, she became a plucky, indispensable companion for the reporter as he covered world events in Moscow, Cairo, Beijing, Ottawa, and Johannesburg.  Wren's often hilarious and sometimes poignant account of an American family's adventures crisscrossing the globe shows them coping with chaos in faraway places -- always with the help of their ever-resourceful feline. The result is a charming tale about a spunky, curious pet who earned the right to be ranked among the world's most widely traveled cats.",
        "Category": " Pets , Cats , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Prisoners of Hope: The Story of Our Captivity and Freedom in Afghanistan",
        "Authors": "By Mattingly, Stacy, Curry, Dayna, and Mercer, Heather",
        "Description": "The gripping and inspiring story of two extraordinary women--from their imprisonment by the Taliban to their rescue by U.S. Special Forces. When Dayna Curry and Heather Mercer arrived in Afghanistan, they had come to help bring a better life and a little hope to some of the poorest and most oppressed people in the world. Within a few months, their lives were thrown into chaos as they became pawns in historic international events.  They were arrested by the ruling Taliban government for teaching about Christianity to the people with whom they worked.  In the middle of their trial, the events of September 11, 2001, led to the international war on terrorism, with the Taliban a primary target.  While many feared Curry and Mercer could not survive in the midst of war, Americans nonetheless prayed for their safe return, and in November their prayers were answered.In Prisoners of Hope, Dayna Curry and Heather Mercer tell the story of their work in Afghanistan, their love for the people they served, their arrest, trial, and imprisonment by the Taliban, and their rescue by U.S. Special Forces. The heart of the book will discuss how two middle-class American women decided to leave the comforts of home in exchange for the opportunity to serve the disadvantaged, and how their faith motivated them and sustained them through the events that followed.  Their story is a magnificent narrative of ordinary women caught in extraordinary circumstances as a result of their commitment to serve the poorest and most oppressed women and children in the world. This book will be inspiring to those who seek a purpose greater than themselves.",
        "Category": " Political Science , Reference",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Controlling Your Fat Tooth",
        "Authors": "By Piscatella, Joseph C. and Piscatella, Bernie (CON)",
        "Description": "Doing for fat what he did for cholesterol in the bestsellers Don-Yt Eat Your Heart Out and Choices for a Healthy Heart, lay expert Joe C. Piscatella presents a wealth of medically sound information on the dangerous American high-fat diet and what can be done to avoid it.   He shows how our fast-paced modern lifestyle has created a pro-fat culture that relies on frozen meals, fast foods, and snacks for nutrition. He reveals how advertising regularly misleads consumers about the fat content of foods (2% milk, for example, is really 38% fat). He makes known information about the biological basis for the -_fat tooth-\"-Xwhy so many of us crave chocolate, cheesecake, and ice cream. And he provides specific, practical, usable advice on striping fat from our diets by employing a special fat tooth budget.   With menus, tips, and 200 delicious, low-fat recipes from Bernie Piscatella-Xeach with a nutritional breakdown-XCONTROLLING YOUR FAT TOOTH is every American-Ys antidote to a national epidemic. Selection of the Book-of-the-Month Club, Better Homes & Gardens Family Book Service, and Rodale Book Club. 450,000 copies in print.",
        "Category": " Cooking , Reference",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Turbulent Souls",
        "Authors": "By Dubner, Stephen J.",
        "Description": "Turbulent Souls is a luminous memoir, crafted with the eye of a journalist and the art of a novelist by New York Times Magazine writer and editor Stephen J. Dubner. By turns comic and heartbreaking, it tells the story of a family torn apart by religion, sustained by faith, and reunited by truth.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Choices for a Healthy Heart (Comb Binding)",
        "Authors": "By Piscatella, Joseph C. and Piscatella, Bernie",
        "Description": "From the author of Don't Eat Your Heart Out and other bestselling books on diet and healthy living that together have over 1.8 million copies in print, here is a \"how-to\" book providing information and motivation for readers to take control of their cardiac health. In CHOICES FOR A HEALTHY HEART, Piscatella broadens his focus to the major lifestyle factors-diet, exercise, stress, and smoking-which affect cardiac fitness, whether as rehabilitation for heart patients or preventive action for people at risk.  His information gives new insight into how healthy choices and changes can be made to control heart disease, which is a culturally induced epidemic affecting 5.5 million Americans. He reveals why people under stress have difficulty ridding themselves of cholesterol. He examines how poor exercise habits have contributed to heart disease in adults-and in children. He investigates the effect of smoking in real terms: one pack of cigarettes a day produces as much strain on the heart as being 100 pounds overweight. And, he continues to provide solid dietary principles for reducing cholesterol, keeping blood pressure in line, and controlling weight.  Exploding the myths asserted by the $12-billion weight-loss industry, Piscatella thoroughly and refreshingly affirms that a heart-healthy diet and exercise program is the most effective way to lose excess fat and keep it off forever.  Bernie Piscatella's 200 new easy-to-follow recipes have been calculated for calorie counts and fat content and include such zesty dishes as Fettucini with Scallops and Pesto, Veal Chops with Lemon and Pepper, and Banana Cream Pudding. 440,000 copies in print.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The Coma",
        "Authors": "By Garland, Alex",
        "Description": "When Carl awakens from a coma after being attacked on a subway train, life around him feels unfamiliar, even strange. He arrives at his best friend's house without remembering how he got there; he seems to be having an affair with his secretary, which is pleasant but surprising. He starts to notice distortions in his experience, strange leaps in his perception of time. Is he truly reacting with the outside world, he wonders, or might he be terribly mistaken? So begins a dark psychological drama that raises questions about the the human psyche, dream versus reality, and the boundaries of consciousness. As Carl grapples with his predicament, Alex Garland - author of The Beach and the screenplay for 28 Days Later, plays with conventions and questions our assumptions about the way we exist in the world, even as it draws us into the unsettling and haunting book about a lost suitcase and a forgotten identity.",
        "Category": " Fiction , Literary",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "The Kidnapping Of Christina Lattimore",
        "Authors": "By Nixon, Joan Lowery",
        "Description": "She spots the masked man in the dark, lonely parking lot--but too late. Grabbed and drugged, Christina is kidnapped and held for ransom. When her family pays, she thinks her ordeal is over. But then she realizes that her family thinks she planned the kidnapping! How will Christina prove her innocence?",
        "Category": " Young Adult Fiction , Law & Crime",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The Book on Bush: How George W. (Mis)leads America",
        "Authors": "By Alterman, Eric and Green, Mark",
        "Description": "The Book on Bush is the first comprehensive critique of a president who is governing on a right wing and a prayer. In carefully documented detail, Eric Alterman and Mark Green, two of the leading progressive authors/advocates in the country, not only trace the guiding ideology that runs through a wide range of W's policies but also expose a presidential decision-making process that, rather than weighing facts to arrive at conclusions, begins with conclusions and then searches for supporting facts.While other commentators and authors have plumbed a particular policy (or policies) or chronicled his provable deceptions, Alterman and Green connect the dots of what's behind all the policies and prevarications. The Book on Bush reveals a president who, while determinedly uninformed, uncurious, and unyielding, is messianic in pursuing the goals of his three leading constituencies: the religious right, big business, and neoconservatives. With few exceptions, the interests of these groups have been served so effectively that the result for America is nothing less than the attempted rolling back of the progressive gains of the past century.",
        "Category": " Political Science , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "The Pursuit (Sherring Cross)",
        "Authors": "By Lindsey, Johanna",
        "Description": "It was to be a grand adventure for Melissa MacGregor -- an escape from the wilds of her Scottish home into the whirl of the London social season, and far from the stifling protectiveness of her mother's sixteen strapping, somewhat bumbling brothers, six of whom are named Ian. There the bewitching lass is sure to find a suitable husband who will not be intimidated by her suspicious uncles and who is more appealing than the many local suitors whom her uncles have already deemed unworthy. But before she begins her pursuit of a new life, Melissa is distracted by an intriguing gentleman stranger she encounters on her grandfather's lands.Lincoln Ross Burnett is no stranger to Scotland, however. The seventeenth Viscount Cambury, Lincoln once called this fair land home -- until as a boy of twelve he was sent away to live with relatives in London after his father's death. To stay would surely have meant his own demise, for a bitter feud was raging around him, marking young Lincoln as a target of a brutal gang of \"savages\" who went by the name MacFearsons.Now as he restlessly roams the countryside he so loved as a child, Lincoln can feel the anger and bitterness returning -- only to be dispelled by the beauty of the lady who stands before him. Though they part after but a few spoken words, the damage has been done: Lincoln's heart has been claimed forever, and he will never be complete again until Melissa MacGregor is his bride.Though destiny is carrying them along separate paths, Lincoln knows he will pursue Melissa to London ... and to the ends of the earth, if necessary. But ties of blood and duty have made his heart's obsession with the enchanting beauty not only desperate but quite dangerous. For the woman Lincoln must have is the niece of those who, even now, are sworn to his destruction, and who are willing to dog his every step, even following two yearning souls fated to be lovers into the glittering world of the London ton. The longtime feud is raging hotter than ever before -- and even the irresistible shared passion of Lincoln and Melissa may not be powerful enough to withstand its devastating fire.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Blue Ridge",
        "Authors": "By Pearson, T. R.",
        "Description": "In Blue Ridge, Ray Tatum is the new deputy sheriff of Hogarth, Virginia, located in the middle of nowhere with \"nothing too awful gaudy afoot\" until the discovery of a nearly complete set of human bones on the Appalachian Trail. Ray's cousin Paul is an actuary summoned to New York to identify a fresher and rather less complete body: that of his son, sired in the free and ardent seventies, whom he scarely knew.",
        "Category": " Fiction , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Unless: A Novel",
        "Authors": "By Shields, Carol",
        "Description": "I'm not interested, the way some people are, in being sad. I've had a look, and there's nothing down that road. Well now! What about the ripping sound behind my eyes, the starchy tearing of fabric, end to end; what about the need I have to curl up my knees when I sleep? For all of her life, 44 year old Reta Winters has enjoyed the useful monotony of happiness: a loving family, good friends, growing success as a writer of light 'summertime' fiction. But this placid existence is cracked wide open when her beloved eldest daughter, Norah, drops out to sit on a gritty street corner, silent but for the sign around her neck that reads 'GOODNESS.' Reta's search for what drove her daughter to such a desperate statement turns into an unflinching and surprisingly funny meditation on where we find meaning and hope. Warmth, passion and wisdom come together in Shields' remarkably supple prose. Unless, a harrowing but ultimately consoling story of one family's anguish and healing, proves her mastery of extraordinary fictions about ordinary life.",
        "Category": " Fiction , Literary",
        "Publisher": "Fourth Estate / HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "The Wicked Game: Arnold Palmer, Jack Nicklaus, Tiger Woods, and the Story of Modern Golf",
        "Authors": "By Sounes, Howard",
        "Description": "Golf is sometimes referred to as \"the wicked game\" because it is fiendishly difficult to play well. Yet in the parlance of the Tiger Woods generation, it's also a wickedly good game -- rich, glamorous, and more popular than ever.When we think about golf -- as it is played at its highest level -- we think of three names: Tiger Woods, the most famous sports figure in the world today, Arnold Palmer, the father of modern golf, and Jack Nicklaus, the game's greatest champion.In this penetrating, forty-year history of men's professional golf, acclaimed author Howard Sounes tells the story of the modern game through the lives of its greatest icons. With unprecedented access to players and their closest associates, Sounes reveals the personal lives, rivalries, wealth, and business dealings of these remarkable men, as well as the murky history of a game that has been marred by racism and sex discrimination. Among the many revelations, the complete and true story of Tiger Woods and his family background is untangled, uncovering surprising new details that inspire the golfer's father to exclaim, \"Hell, you taught me some things about my life I never knew about!\"Earl Woods and other members of Tiger Woods's family, his friends, girlfriends, caddies, coaches, and business associates were among the 150 people interviewed over two years of research. Others included Arnold Palmer and Jack Nicklaus, fellow champions such as Ernie Els, Gary Player, Tony Jacklin, and Tom Watson, and golf moguls such as Mark H. McCormack, billionaire founder of the sports agency IMG.The Wicked Game is a compelling story of talent, fame, wealth, and power. Entertaining for dedicated golfers, and accessible to those who only follow the game on television, this may be the most original and exciting sports book of the year.",
        "Category": " Sports & Recreation , History",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Walkers on the Sky",
        "Authors": "By Lake, David J.",
        "Description": "",
        "Category": "",
        "Publisher": "DAW",
        "Price Starting With ($)": "6.23",
        "Publish Date": {
            "Month": "December",
            "Year": "1976"
        }
    },
    {
        "Title": "D.N.Angel, Vol. 4",
        "Authors": "By Sugisaki, Yukiru and Dyer, Sarah",
        "Description": "Life becomes complicated for Daisuke when he transforms into the phantom thief Dark whenever he sees Risa, the girl he likes.",
        "Category": " Young Adult Fiction , Comics & Graphic Novels , Manga",
        "Publisher": "Tokyopop",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Wrap It Up: 99 Gift-Wrapping Ideas for Birthdays, Anniversaries, and Other Occasions",
        "Authors": "By Van Der Westen, Peter and De Jong, Aad",
        "Description": "Offers creative suggestions for wrapping gifts and includes step-by-step instructions, and tips on papers, ribbons, and bows",
        "Category": "",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "My First Mother Goose",
        "Authors": "By McCue, Lisa",
        "Description": "",
        "Category": " Juvenile Fiction , Nursery Rhymes",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The Truth Behind A Series of Unfortunate Events: Eyeballs, Leeches, Hypnotism and Orphans --- Exploring Lemony Snicket's World",
        "Authors": "By Gresh, Lois H.",
        "Description": "The ultimate companion guide to A Series of Unfortunate Events--a must for fans of Lemony Snicket.A Series of Unfortunate Events is one of the most popular children's series in the world and will be a major motion picture starring Jim Carrey and Meryl Streep coming this 2004 holiday season.  Now comes The Reader's Guide to Lemony Snicket, the ultimate companion guide to these fun and wildly successful novels.  Digging beneath the surface, Lois Gresh uses science, history and little known facts to dig deep into the world of A Series of Unfortunate Events and provide young readers everywhere with how-to hints and tips, quizzes, cool anecdotes, fun facts and information on everything Lemony.  Including:*Facts about handwriting analysis and forgery*Killer leeches, crabs, fungi and peppermint--all you need to know*The truth about hypnosis--and how to use it!*Real child inventors and their amazing inventions*How to build a telephone, a hot air balloon and an automatic harmonica*Are you as smart as Violet & Claus--the ultimate quiz*And much more!The ultimate renegade book report on A Series of Unfortunate Events, this reader's guide is a must for millions of young fans everywhere.",
        "Category": " Juvenile Nonfiction , Reference , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Howard Hughes: The Secret Life: The Secret Life",
        "Authors": "By Higham, Charles",
        "Description": "His wealth was legendary.  His passions were bizarre.  Now, the truth about the money, the madness, and the man behind the enigma.  Howard Hughes is one of the best known and least understood men of our times--famed for his wealth, his daring, and his descent into madness.  Bestselling biographer Charles Higham goes beyond the enigma to reveal the incredible private life of Howard Hughes:* his romances with the great stars of Hollywood--Katharine Hepburn, Bette Davis, Cary Grant, Tyrone Power, and numerous others* his forays into sadomasochism* his involvement with Richard Nixon and Watergate* his bizarre final yearsThis is a compelling portrait of a unique American figure--in a story as revealing as it is unforgettable.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "American Soldier",
        "Authors": "By McConnell, Malcolm and Franks, Tommy",
        "Description": "\"When war comes, you look for certain special qualities in the people you'll be working with. General Tom Franks embodies those qualities: strength, experience, a keen mind, energy, honor, good humor, and a deep loyalty to his troops and to his country. \"Tom Franks is truly a soldier's soldier.\"-- Secretary of Defense Donald Rumsfeld  The Commander in Chief of the United States Central Command from July 2000 through July 2003, General Tommy Franks made history by leading American and Coalition forces to victory in Afghanistan and Iraq -- the decisive battles that launched the war on terrorism.  In this riveting memoir, General Franks retraces his journey from a small-town boyhood in Oklahoma and Midland, Texas, through a lifetime of military service -- including his heroic tour as an Artillery officer in Vietnam, where he was wounded three times. A reform-minded Cold War commander and a shrewd tactician during Operation Desert Storm, Franks took command of CENTCOM at the dawn of what he calls a \"crease in history\" -- becoming the senior American military officer in the most dangerous region on earth.  Now, drawing on his own recollections and military records declassified for this book, Franks offers the first true insider's account of the war on terrorism that has changed the world since September 11, 2001. He puts you in the Operations Center for the launch of Operation Enduring Freedom just weeks after 9/11, capturing its uncertain early days and the historic victory that followed. He traces his relationship with the demanding Donald Rumsfeld, as early tensions over the pace of the campaign gave way to a strong and friendly collaboration.  When President Bush focused world attention on the threat of Iraq, Franks seized the moment to implement a bold new vision of joint warfare in planning Operation Iraqi Freedom. Rejecting Desert Storm–style massive troop deployment in favor of flexibility and speed, Franks was questioned by the defense establishment -- including Secretary of State Colin Powell. Yet his vision was proven on the ground: Within three weeks, Baghdad had fallen.American Soldier is filled with revelation. Franks describes the covert diplomacy that helped him secure international cooperation for the war, and reveals the role of foreign leaders -- and a critical double agent code-named \"April Fool\" -- in the most successful military deception since D-Day in 1944. He speaks frankly of intelligence shortcomings that endangered our troops, and of the credible WMD threats -- including eleventh-hour warnings from Arab leaders -- that influenced every planning decision. He offers an unvarnished portrait of the \"disruptive and divisive\" Washington bureaucracy, and a candid assessment of the war's aftermath. Yet in the end, as American Soldier demonstrates, the battles in Afghanistan and Iraq remain heroic victories -- wars of liberation won by troops whose valor was \"unequalled,\" Franks writes, \"by anything in the annals of war.\" Few individuals have the chance to contribute so much of themselves to the American story as General Tommy Franks. In American Soldier, he captures it all.",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "The Caddie Was a Reindeer: And Other Tales of Extreme Recreation",
        "Authors": "By Rushin, Steve",
        "Description": "A collection of columns from the critically acclaimed sportswriter and author of Road Swing journeys around the world to provide an eating tour of America's baseball stadiums, an account of ice golf with a reindeer caddy above the Arctic Circle, a description of the world's wildest roller coasters, and other entertaining tales. 25,000 first printing.",
        "Category": " Sports & Recreation , Essays",
        "Publisher": "Atlantic Monthly Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "First Ladies: The Saga of the Presidents' Wives and Their Power, 1789-1961",
        "Authors": "By Anthony, Carl Sferrazza",
        "Description": "In this previously untold story of a unique role and its evolving definitions, Carl Sferrazza Anthony has produced \"an entirely new take on the first ladyship\" and \"an awesome work of scholarship\" (Library Journal). Opening with a historic trip made in 1789 by Martha Washington from Mount Vernon to New York, then the capital city, First Ladies brings these women alive as never before in a saga of intertwining lives, friends, rivals, and allies. Among the women profiled in this first of a definitive two-volume history: Dolley Madison, Julia Tyler, Mary Lincoln, Julia Grant, Nellie Taft, Edith Wilson, Grace Coolidge, Eleanor Roosevelt, and Mamie Eisenhower. From the Federalist to the Antebellum periods, through the Gilded and Jazz ages, from the Great Depression to the Fabulous Fifties, thirty-four women confronted the towering events of American history. They also helped establish its course. We also glimpse the early years of the living First Ladies, from Jacqueline Kennedy to Barbara Bush.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Emily's Reasons Why Not: A Novel",
        "Authors": "By Gerlach, Carrie",
        "Description": "Hollywood publicity pro extraordinaire Emily Sanders is hitting thirty –– hard –– and she wants the life her best friends seem to have: house, kids, perfect man. But finding true love isn't easy in L.A., where image is everything, and where every beauty pageant winner is an eight in a sea of nines, who all wish they were Julia Roberts. For Emily, boyfriend material has always come in many strange shapes and incarnations –– beautiful young surfer god, aging music executive, boss's boss's boss, and a baseball player with two cell phones (one of which she does not have the number to). With her confidence rapidly heading due south (like everything else on her body), it's time to find a smart, sharp–eyed psychotherapist to help her get past her surefire method for choosing the absolute worst man. With a little help, maybe Emily can learn to narrow her focus from looking for Mister Right to looking out for Mister Wrong. Because she knows that, eventually, \"the one\" comes for every woman ... even for a disarming, unflappable player in the mad, mad world of entertainment, with the edge of an insider and the heart of a dreamer.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Ladies with Prospects: A Novel",
        "Authors": "By Hartwick, Cynthia",
        "Description": "The Larksdale Ladies are back. They've made some money. Okay, a lot of money. And now, ten years later, at the height of the tech boom, their investment club is about to witness firsthand the peaks of small-town Silicon Valley-and the valleys...  When Larksdale's biggest company, PMT Software, is sold to a multimedia giant, locals become instant millionaires. But when the giant proves to be a sham and PMT's inflated stock tanks, the whole town faces ruin. It's up to the Ladies--and some new friends--to save the day.",
        "Category": " Fiction , Humorous",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Tales From the Ballpark : More of the Greatest True Baseball Stories Ever Told",
        "Authors": "By Shannon, Mike",
        "Description": "Now in paperback, Mike Shannon's newest collection of memorable anecdotes from the game's past and present will appeal to all generations of baseball fans. It includes priceless stories from such legends as Ted Williams and Bob Gibson as well as from modern-day stars such as Mo Vaughn and David Wells. These humorous and touching tales will delight fans for many years to come.",
        "Category": " Sports & Recreation , Baseball , History",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "NICK AT NITE'S CLASSIC TV COMPANION: The All Night, Every Night Guide to Better Living Through Television",
        "Authors": "By Hill, Tom (EDT)",
        "Description": "Nick at Nite's Classic TV Companion offers capsule descriptions of every episode of The Mary Tyler Moore Show, The Dick Van Dyke Show, I Love Lucy, Bewitched, The Bob Newhart Show, I Dream of Jeannie, The Munsters, Taxi, and Welcome Back, Kotter. Featured are such vital nuggets as classic guest stars: cameos by famous actors; classic quotes: TV's classic catchphrases and unforgettable one-liners; and awards and critical comments.",
        "Category": " Performing Arts , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Black Beauty Promo (Puffin Classics)",
        "Authors": "By Sewell, Anna",
        "Description": "",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Puffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Wipe-Off Activity Books : Letters",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Learning Horizons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Devil's Arithmetic (Puffin Modern Classics)",
        "Authors": "By Yolen, Jane",
        "Description": "\"A triumphantly moving book.\"  'Kirkus Reviews, starred reviewHannah dreads going to her family's Passover Seder'she's tired of hearing her relatives talk about the past. But when she opens the front door to symbolically welcome the prophet Elijah, she's transported to a Polish village in the year 1942. Why is she there, and who is this \"Chaya\" that everyone seems to think she is? Just as she begins to unravel the mystery, Nazi soldiers come to take everyone in the village away. And only Hannah knows the unspeakable horrors that await. A critically acclaimed novel from multi-award-winning author Jane Yolen. \"[Yolen] adds much to understanding the effects of the Holocaust, which will reverberate throughout history, today and tomorrow.\" 'SLJ, starred review\"Readers will come away with a sense of tragic history that both disturbs and compels.\" 'BooklistWinner of the National Jewish Book AwardAn American Bookseller \"Pick of the Lists\"",
        "Category": " Young Adult Fiction , Historical , General",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "A Father's Book of Wisdom",
        "Authors": "By Brown, H. Jackson",
        "Description": "\"A few weeks after Dad passed away,\" says H. Jackson Brown, Jr., the compiler of A Father's Book of Wisdom, \"we found eight shoeboxes in his closet filled with scraps of paper all covered with ideas Dad thought were profound, interesting, or merely amusing.\"The result is one father's view of life and what he thought about the importance of self-reliance, commitment, love, generosity, and success. It contains 159 quotes from Socrates, Eleanor Roosevelt, Andrew Jackson, Mother Teresa, and many others covering such topics as achievement,courage, happiness, parenting, success, and values.Quotations such as \"If you're looking for a big opportunity, seek out a big problem\" and \"Life doesn't come with an instruction book - that's why we have fathers\" communicate an upbeat, positive view of the world that will inspire and charm the reader. It is the perfect gift book for Father's Day, graduation, or any time of the year, and may even inspire you to jot down a few notes of your own.",
        "Category": " Self-help , Affirmations",
        "Publisher": "Rutledge Hill Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Oxford Book of Comic Verse (Oxford Books of Verse)",
        "Authors": "By Gross, John (EDT)",
        "Description": "\"Comic verse,\" writes editor John Gross, \"is verse that is designed to amuse--and perhaps that is as far as any attempt at a definition ought to go.\" In The Oxford Book of Comic Verse, Gross has combed the annals of literature in English from the middle ages to the present, gathering poems that provoke laughter, smiles, and even reflections on the human condition--but always poems that amuse.    From limericks to social satire, The Oxford Book of Comic Verse offers a remarkable collection of outstanding light poetry. Gross has brought together the finest writers in the history of the English language--from Chaucer and Skelton to Shakespeare and Swift, Lord Byron to Robert Browning, Emily Dickinson to John Updike--offering delightful examples of their comic verse.  Many of these lines dance with whimsy, such as John Skelton's Colin Clout (\"For though my rhyme be ragged,/ Tattered and jagged,/ Rudely rain-beaten,/ Rusty and moth-eaten,/ If ye take well therewith,/ It hath in it some pith\"); others float heavier thoughts on light rhymes--as in Matthew Prior's succinct Human Life (\"What trifling coil do we poor mortals keep;/ Wake, eat, and drink, evacuate and sleep.\").  The range of writers who have composed comic verse is astonishing, as is the delight of the poems themselves. Here we read T.S. Eliot mocking himself (\"How unpleasant to meet Mr. Eliot!/ With his features of clerical cut\"); poet and Soviet historian Robert Conquest, mingling his two professions in a limerick (\"There was a great Marxist called Lenin/ Who did two or three million men in/ --That's a lot to have done in/ --But where he did one in/ That grand Marxist Stalin did ten in\"); and Wendy Cope commenting on her disillusionment with poets (\"I used to think all poets were Byronic./ They're mostly wicked as ginless tonic/ And wild as pension plans\"). And along the way, we are treated to witty song lyrics as well, from First World War soldiers' tunes, to Irving Berlin, to Cole Porter, to Lorenz Hart (\"When love congeals/It soon reveals/ the faint aroma of performing seals/The double-crossing of a pair of heels/I wish I were in love again!\").  Whether it comes from anonymous popular culture or the icons of the literary canon, comic verse has been a source of pleasure and diversion through the ages--a combination of wit, verbal artistry, and even serious contemplation. This collection, compiled by one of our finest critics and anthologists, brings this tradition into the hands of today's readers, offering hours of delight.",
        "Category": " Science , Chemistry , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "What Dreams May Come",
        "Authors": "By Kenyon, Sherrilyn, York, Rebecca, and Owens, Robin D.",
        "Description": "An all-new paranormal romance anthology headlined by a New York Times bestselling author.  This is an exquisite trio of stories by three beloved authors skilled at making the most impossible dreams come true. All new, original novellas of fantastic romance by:  New York Times bestselling author Sherrilyn Kenyon. A bare-chested hunk on the cover of a paperback romance literally comes to life to fulfill a lonely woman's fantasies in Knightly Dreams.  Award-winning author Robin D. Owens With other-worldly assistance, two unlucky lovers are given one more chance to prove that romance is possible in Road of Adventure.  USA Today bestselling author Rebecca York A woman's life depends on the psychic visions of her ex-lover which could reunite them--or plunge them into danger--in Shattered Dreams.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Fat Man Fed Up: How American Politics Went Bad",
        "Authors": "By Germond, Jack W.",
        "Description": "For more than forty years, Jack Germond has been covering politics for Gannett newspapers, the Washington Star, and the Baltimore Sun, and talking politics on the Today show, The McLaughlin Group, and Inside Washington. Now, in Fat Man Fed Up, Germond confronts the most critical issues raised by our election process and offers a scathing but wry polemic about what’s wrong with American politics.Is there any connection between what happens in campaigns and what happens in government? And if not, where does the blame for the discontent lie? Was Tocqueville right? Do we get the leaders we deserve? Indeed, according to Germond, the politicians aren’t the only ones to blame, or even the chief culprits. He describes how he and his colleagues in the news media have been guilty of dumbing-down the political process–and how the voters are too apathetic to demand better coverage and better results. Instead, they simply turn away and too often end up enduring third-rate presidents.This no-sacred-cows manifesto faces the problems many are reluctant to address:• Polls and how they are used and abused by politicians and press to mislead gullible voters.• The critical failure of the press to accurately portray figures in the political realm, from Eugene McCarthy to Barbara Bush to Al Sharpton.• How the complaints about liberal bias in the press miss the real point: whether that bias, if it exists, colors the way editors and reporters work.• The staggering influence of television, and the networks’ inability to provide anything but the most simplistic coverage of politics.• The “big lie” school of campaigning. From “Where’s the beef?” to “compassionate conservatism,” the politics of empty slogans has always placed noise above nuance: Say anything loudly enough and long enough, and voters are bound to mistake it for the truth.Along the way, Germond illustrates his arguments by drawing from his war chest of priceless anecdotes from decades in the business. With his inimitable combination of incisive journalism and sardonic and witty straight talk, Germond guides us through the fog created by candidates and the media. In this timely, outrageous, and compulsively readable book, no one is let off the hook. Fat Man Fed Up is a bracing look at how we never seem to get the truth about the people we’re electing.",
        "Category": " Political Science , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "The Sorority: Samantha",
        "Authors": "By Tamara Thorne",
        "Description": "",
        "Category": "",
        "Publisher": "Pinnacle Books",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Revenge: A Story of Hope",
        "Authors": "By Blumenfeld, Laura",
        "Description": "In 1986, Laura Blumenfeld's father was shot in Jerusalem by a member of a rebel faction of the PLO responsible for attacks on several tourists in the Old City. Her father lived, but Blumenfeld's desire for revenge haunted her. This is her story. Traveling to Europe, America, and the Middle East, Blumenfeld gathers stories and methods of avengers worldwide as she plots to infiltrate the shooter's life. Through interviews with Yitzhak Rabin's assassin; with members of the Albanian Blood Feud Committee; the chief of the Iranian judiciary; the mayor of Palermo, Sicily; an Egyptian heroin smuggler; the Israeli prime minister and the military chief of staff; priests; sports fans; fifth-grade girls; and prostitutes, among others, she explores the mechanics and the psychology of vengeance.  But ultimately it is a journey that leads her back home -- where she is forced to confront her childhood dreams, her parents' failed marriage, and her ideas about family. In the end, her target turns out to be more complex -- and in some ways more threatening -- than the stereotypical terrorist she'd long imagined.  A rare, ambitious, personal, and intellectual tour of dark urges often denied, Revenge: A Story of Hope is a beautifully written story about family, loyalty, and home, about the personal passions behind public events, and about the thin line between love and hate.",
        "Category": " Political Science , Reference",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "The Promise of a Lie",
        "Authors": "By Roughan, Howard",
        "Description": "Nothing can prepare Dr. David Remler for the shocking phone call he receives from a patient named Samantha Kent. Stunned and anxious to help, he rushes out into the Manhattan night to keep a bloody act of violence from spinning further out of control.He knows he is too involved, that he's crossed a line, and that his professional reputation is at stake. But he has no idea what awaits him at his destination... that he's become a pawn in a very deadly game of revenge.Suddenly the focus of a criminal case that flares into an out-of-control media circus, David has only one shot to clear his name. But first he has to clear up the mystery of his patient, \"Samantha Kent.\" Just who is she? And why did she choose to involve David? Little by little, the outlines of a brilliant plot emerge - and, with it, the horrifying power of a single lie.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "I Like Being Catholic",
        "Authors": "By Leach, Michael (EDT) and Borchard, Therese Johnson (EDT)",
        "Description": "A celebration of the treasured traditions, rituals, and stories that run through the bloodstream of American Catholics For Andrew Greeley, it is the reverence of Christmas night and the exultation of Easter morn. Martin Scorsese, like many others, remains grateful for the nuns who rapped his knuckles but built his self-esteem.  Mary Gordon recalls the sense of lightness that follows confession; Vince Lombardi, the strength he derived from Mass; and Christopher Buckley, the role St. Thomas More plays in his writing.I Like Being Catholic brings together the memories, thought, and hopes of famous Catholics and ordinary parishioners, lapsed and \"good-enough\" Catholics, and those who have devoted their lives to the faith.  It captures their abiding ties to and deep affection for the Church and offers the wide-ranging, sometimes surprising views on the good things that come with being Catholic.This is not a book of theology. It is about the beauty at the heart of Catholicism. It is about what Teilhard de Chardin called \"the chosen part of things.\" It is about family and community, the value of Catholic education, the significance of sacraments and milestones, and the cultural impact of Catholicism—there are lists of the ten best Catholic novels, the ten best Catholic movies, ten Catholic heroes of the twentieth century, ten good reasons to raise your kids Catholic, fifty things Catholics like best about being Catholic, and much more ...I Like Being Catholic is a book for all those who have ever called themselves Catholic. It is a book of warmth, affection, humor, and love.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Eyewitness Travel Guide to Naples",
        "Authors": "By DK Publishing",
        "Description": "Describes the major sights and attractions of the Naples area and provides information on hotels, restaurants, museums, and historic buildings",
        "Category": " Travel , Europe , Italy",
        "Publisher": "DK Eyewitness Travel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "A New Baby at Koko Bear's House (Lansky, Vicki)",
        "Authors": "By Lansky, Vicki and Prince, Jane (ILT)",
        "Description": "Mama and Papa Bear share their exciting news--there's going to be a new baby bear. This delightful, illustrated story shares KoKo's experiences during pregnancy, birth, and Mama's homecoming--even a bit of jealousy. Full-color illustrations.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Book Peddlers, The",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Little Witch's Big Night (Step into Reading)",
        "Authors": "By Brown, Marc Tolon (ILT) and Hautzig, Deborah",
        "Description": "Illus. in full color. Forced to stay at home on Halloween because she's been too good, Little Witch gives three trick-or-treaters high-flying broomstick rides.",
        "Category": " Juvenile Fiction , Horror",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "Gender at the Crossroads of Knowledge: Feminist Anthropology in the Postmodern Era",
        "Authors": "By Di Leonardo, Micaela (EDT)",
        "Description": "Gender at the Crossroads of Knowledge brings feminist anthropology up to date, highlighting the theoretical sophistication that characterizes recent research. Twelve essays by outstanding scholars, written with the volume's concerns specifically in mind, range across the broadest anthropological terrain, assessing and contributing to feminist work on biological anthropology, primate studies, global economy, new reproductive technologies, ethno-linguistics, race and gender, and more. The editor's introduction not only sets two decades of feminist anthropological work in the multiple contexts of changes in anthropological theory and practice, political and economic developments, and larger intellectual shifts, but also lays out the central insights feminist anthropology has to offer us in the postmodern era. The profound issues raised by the authors resonate with the basic interests of any discipline concerned with gender, that is, all of the social sciences and humanities.",
        "Category": " Social Science , Anthropology , Cultural & Social",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Coming of Age in America: A Multicultural Anthology",
        "Authors": "By Frosch, Mary (EDT)",
        "Description": "By turns touching and hilarious, Coming of Age in America gathers together writers from fifteen different ethnic groups who, through their fiction, explore the terrain we all traverse as we come of age, no matter our race, ethnicity, gender, or class.With over twenty short stories and fiction excerpts by noted authors such as Julia Alvarez and Frank Chin, Dorothy Allison and Adam Schwartz, Reginald McNight and Tobias Wolff, Coming of Age in America shows that our common experiences are more binding than our differences are divisive. Since its initial publication in 1994, Coming of Age in America has evolved from a groundbreaking collection of underrepresented voices into a timeless album of unforgettable literature. A wonderfully readable collection, this is a marvelous resource for those looking for stories that illustrate the convergence of cultural experience and literature.",
        "Category": " Literary Collections , General",
        "Publisher": "The New Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Democracy: A Play",
        "Authors": "By Frayn, Michael",
        "Description": "A brilliant exploration of character and conscience from the author of COPENHAGEN, set amid the tensions of 1960s BerlinIn Democracy, Michael Frayn once again creates out of the known events of twentieth-century history a drama of extraordinary urgency and subtlety, reimagining the interactions and motivations of Willy Brandt as he became chancellor of West Germany in 1966 and those of his political circle, including Günter Guillaume, a functionary who became Brandt's personal assistant-and who was eventually exposed as an East German spy in a discovery that helped force Brandt from office. But what circumstances allowed Brandt to become the first left-wing chancellor in forty years? And why, given his progressive policies, did the East German secret police feel it necessary to plant a spy in his office and risk bringing down his government? Michael Frayn writes in his postscript to the play, \"Complexity is what the play is about: the complexity of human arrangements and of human beings themselves, and the difficulties that this creates in both shaping and understanding our actions.\"",
        "Category": " Drama , European , English, Irish, Scottish, Welsh",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Relationships: The Art of Making Life Work",
        "Authors": "By Roger, John",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Mandeville Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "Balance of Power (Star Trek The Next Generation, No 33)",
        "Authors": "By Hugh, Dafydd Ab",
        "Description": "When a famous Federation scientist dies, his son puts his inventions up for sale to the highest bidder, be they Federation, Klingon, Romulan, or Cardassian. Among the items at auction is a photon pulse canon capable of punching through a starship's shields with a single shot. Meanwhile, Wesley Crusher is kidnapped from the Academy by renegade Ferengi who have set their sights on the photon canon as well, and Captain Picard must outmaneuver enemies on every side to save Wesley and protect the EnterpriseTM from the deadly fire of the new canon.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Shared Heart: Relationship Initiations and Celebrations",
        "Authors": "By Vissell, Barry and Vissell, Joyce",
        "Description": "",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "Ramira Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Hormones of Youth: Grow 10 years younger in 10 weeks with the new therapeutics of Anti-Aging Medicine",
        "Authors": "By Klatz, Ronald",
        "Description": "",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Mdm Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "A G-Man's Journal: A Legendary Career Inside the FBI- FROM The Kennedy Assassination to the Oklahoma City Bombing",
        "Authors": "By Williams, Dwight Arnan and Revell, Oliver",
        "Description": "From 1964 to 1994, Buck Revell directed or participated in virtually every major FBI investigation -- including the JFK assassination, Watergate, the Iran hostage crisis, and Gulf War antiterrorist operations. As the former Associate Deputy Director in charge of investigations, the Bureau's number-two career post, he sealed his reputation as a legendary maverick in federal law enforcement. Now, in a landmark autobiography, Revell candidly reveals the brilliance and deep-rooted flaws behind thirty years of FBI investigations.  Known early on for his street-smart, proactive, and hard-hitting style inside J. Edgar Hoover's Bureau, Revell hunted down Mafia hit men, Ku Klux Klan-type terrorist groups, and Eastern Bloc spies. Quickly rising in a system that was often its own worst enemy, he discloses why, after Hoover's death in 1972, he and other reform-minded agents moved to modernize the FBI both tactically and technologically -- and how he developed investigative strategies, innovated specific surveillance methods, and championed special FBI units, such as Special Events Management and Hostage Rescue.  As skilled at advising heads of state as collaring criminals, Revell was often summoned to the White House Situation Room. As the senior FBI representative to the National Security Council, he emerged as one of our leading authorities on terrorism and national security issues. He recounts how he persuaded Congress to enact Federal laws regarding fugitive apprehension abroad, and how he directed all international operations -- including tracking the kidnappers and killers of hostages in Beirut, international mafias weapons smuggling, and French and Japanese industrial espionage. He also demonstrates why it is vital for the FBI to become a global nerve center for the world's law enforcement agencies.  On the home front, Buck Revell continues to advise the National Security Council, the Pentagon, and the Justice Departments on matters of organized crime, drug enforcement, white-collar crime and terrorism. In A G-Man's Journal, he proposes drastic reforms for improving the current system of law enforcement and justice, and bluntly analyzes what went wrong at incidents like the Branch Davidian tragedy in Waco, and the World Trade Center and Oklahoma City bombings.  A riveting chronicle of an extraordinary career amid history-shaping events, A G-Man's Journal lays bare the varied criminal threats facing America today, and sets the crimefighting agenda for the next century.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Atria",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Waiting for the Dark, Waiting for the Light",
        "Authors": "By Klima, Ivan and Wilson, Paul (TRN)",
        "Description": "Ivan Klima was in the United States when Russian tanks entered Prague in 1968 but, against the advice of friends and colleagues, he returned home. He became a dissident, writing books (never officially published) that were invariably inspired by Czechoslovakia's repressive regime. But what happens to a rebel artist when there is nothing left to rebel against? This question indirectly informs Klima's powerful new novel - his most important and far-reaching fiction to date.Waiting for the Dark, Waiting for the Light describes life before, during, and after the Velvet Revolution of 1989. It is the story of Pavel, a middle-aged television cameraman working uneasily within the boundaries set by the regime, who dreams of one day making a film - a searing portrait of his times - that the authorities will never allow. But after the collapse of communism, Pavel finds he is unprepared for this new world of supposedly unlimited freedoms. He never quite gets around to making that searing portrait of his times; his time, his day, is taken up instead with lucrative small jobs - a TV spot, a commercial, a porn film ...Waiting for the Dark, Waiting for the Light is a masterful novel that focuses on the most pressing issue confronting the individual in the former Soviet bloc countries today: how to live one's life when one is truly free. Written with humor and compassion, it is powerful, provocative, and certain to further the reputation of Ivan Klima as a brilliant and original writer of international stature.",
        "Category": " Fiction , General",
        "Publisher": "Grove Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "A Flask of Fields: Verbal and Visual Gems from the Films of W.C. Fields",
        "Authors": "By Anobile, Richard J.",
        "Description": "",
        "Category": "",
        "Publisher": "Darrien House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Crisis Time! Love, Marriage, and the Male at Midlife",
        "Authors": "By Nolen, William A.",
        "Description": "Offers a study of the male mid-life crisis phenomenon, discussing the symptoms and consequences of the problem and arguing that it is not only a psychological problem, but also a change caused by alterations in brain chemistry",
        "Category": " Psychology , General",
        "Publisher": "Dodd, Mead & company",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Whos Who In Mythology",
        "Authors": "By Murray, Alexander",
        "Description": "",
        "Category": "",
        "Publisher": "Bracken Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "A New Life: Pregnancy, Birth, and Your Child's First Year : A Comprehensive Guide",
        "Authors": "By Queenan, John T. and Queenan, Carrie Neher",
        "Description": "A guide to surviving pregnancy, birth, and the child's first year of life debunks many of the myths surrounding this time in a woman's life and discusses the related physiological, emotional, psychological issues. 30,000 first printing.",
        "Category": " Family & Relationships , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Widow's Walk: A Spenser Novel (Spenser Mysteries)",
        "Authors": "By Parker, Robert B.",
        "Description": "\"Sometimes you have to wonder how Robert B. Parker keeps his mojo working. . . . There is a trick to keeping the faith with an old hero. In an age of shifty heroes with shaky values, he has created a hero who can still stand up for himself-and us.\" (The New York Times Book Review)  When fifty-one-year-old Nathan Smith, a once-confirmed bachelor, is found in his bed with a hole in his head made by a .38-caliber slug, it's hard not to imagine Nathan's young bride as the one with her finger on the trigger. Even her lawyer thinks she's guilty. But given that Mary Smith is entitled to the best defense she can afford-and thanks to Nathan's millions, she can afford plenty-Spenser hires on to investigate Mary's bona fides. Mary's alibi is a bit on the flimsy side: She claims she was watching television in the other room when the murder occurred. But the couple was seen fighting at a high-profile cocktail party earlier that evening, and the prosecution has a witness who says Mary once tried to hire him to kill Nathan. What's more, she's too pretty, too made-up, too blonde, and sleeps around-just the kind of person a jury loves to hate.  Spenser's up against a wall; leads go nowhere, no one knows a thing. Then a young woman, recently fired from her position at Smith's bank, turns up dead. Mary's vacant past suddenly starts looking meaner and darker-and Spenser's suddenly got to watch his back.  With lean, crackling dialogue, crisp action, and razor-sharp characters, Widow's Walk is another triumph.",
        "Category": " Fiction , Psychological",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Express Yourself with Color",
        "Authors": "By Better Homes and Gardens Books",
        "Description": "Unique, interactive handbook combines color preference quizzes, inspiring photography, and how-to advice and tips.Helps readers create fresh, new color schemes based on their existing furnishings.Teaches reader how to choose background colors that transform existing furnishings into lively new schemes.Teaches the reader how to create a personal palette, how to use the color wheel for real life situations, and how to work with today's most popular, pretty, and classic palettes.Offers specific how-to painting projects, plus a bonus tip selection on paint choices, techniques, advice, and insider pro tips.",
        "Category": " House & Home , Decorating",
        "Publisher": "Better Homes and Gardens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The Scarlet Letter (Bantam Classics)",
        "Authors": "By Hawthorne, Nathaniel",
        "Description": "Hailed by Henry James as \"the finest piece of imaginative writing yet put forth in the country,\" Nathaniel Hawthorne's The Scarlet Letter reaches to our nation's historical and moral roots for the material of great tragedy. Set in an early New England colony, the novel shows the terrible impact a single, passionate act has on the lives of three members of the community: the defiant Hester Prynne; the fiery, tortured Reverend Dimmesdale; and the obsessed, vengeful Chillingworth.With The Scarlet Letter, Hawthorne became the first American novelist to forge from our Puritan heritage a universal classic, a masterful exploration of humanity's unending struggle with sin, guilt and pride.",
        "Category": "",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1981"
        }
    },
    {
        "Title": "Jackie Under My Skin: Interpreting an Icon",
        "Authors": "By Koestenbaum, Wayne",
        "Description": "Jackie Under My Skin is a richly original and fascinating investigation into how Jacqueline Kennedy Onassis transformed our definitions of personal identity and style. For thirty years we have lived with our internalized images of \"Jackie,\" but until now no writer has definitively explored what it feels like to exist in imaginative and heartfelt connection to this ubiquitous icon. In an elegiac gallery of fantasies and tableaux, Wayne Koestenbaum explains the late First Lady's mesmeric hold on America by anatomizing the myths and metaphors that have attached to her. Analyzing her iconography with both passion and precision, he places stories about Jackie - and photos of Jackie - within the context of literature, film, and the idiosyncratic imagination. Following her into America's dreamwork, far from pious \"family values,\" Wayne Koestenbaum dares to see her as an embodiment of pleasure, a figure of Circean extravagance, and a unique and necessary emblem of that most exhilarating of pursuits: freedom without responsibility.",
        "Category": " History , General",
        "Publisher": "Farrar Straus Giroux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The Pieces from Berlin",
        "Authors": "By Pye, Michael",
        "Description": "The Pieces From Berlin is inspired by a true story from secret criminal files, about a woman who made her fortune trafficking stolen art in wartime Berlin - and the fearsome price other people paid for her crimes.Lucia Muller-Rossi is the grandest of Zurich antique dealers, still flourishing and still respectable in her nineties. Her past is unknown, or conveniently ignored, until the day Sarah Freeman looks into her shop window and sees a delicate inlaid table that she and her husband once owned before the war. It is a \"piece from Berlin,\" and because of it, decades of lies and silence are about to end.Michael Pye brings to life the devastating legacy that shadows the Holocaust. The Pieces from Berlin is the graphic story of survivors finding the courage to face a buried past, as Lucia's son, Nicholas, patches his memories of wartime Berlin into a true picture of his mother's life and crimes, and Sarah Freeman tries to exorcise her ghosts by involving an Englishman who has his own wartime scars.",
        "Category": " Fiction , Historical",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Jem (and Sam): A Novel",
        "Authors": "By Mount, Ferdinand",
        "Description": "Although Jeremiah Mount receives only passing notice in the celebrated diary of Samuel Pepys, in Jem's own memoirs Sam figures significantly and large -- not as a fellow clerk in Oliver Cromwell's government but as an ill-natured, galling colleague and measly mouse of a man who sets the professionally envious Jem on a hapless path of revenge. Their personal destinies criss-crossing to wildly ironic ends, Jem (and Sam) not only pursue worldly successes and their erotic whims in a bustling, boisterous city of London. They also survive war, rebellion, pestilence, and the Great Fire. Less fortunately, in his final bid for literary fame, Jem falls into a fatal vat of boiling ink, but not before recounting the adventures in this rollicking novel's marvelous fabrication of a man and his times.",
        "Category": " Fiction , Literary",
        "Publisher": "Carroll & Graf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "They Whisper: A Novel",
        "Authors": "By Butler, Robert Olen",
        "Description": "This may be the sexiest book you've ever read. It is also, at turns, among the funniest and the most harrowing and the most moving and the most lyrically beautiful of books. And it is also a book of uncompromising artistic integrity. They Whisper is an astonishingly rare thing in this sex-conscious age: a serious-work of literary art that directly and unflinchingly addresses the subject of modern heterosexuality.Butler's narrator is Ira Holloway, who as he moves into middle age is driven to examine his sexuality and its profound hold on him. Ira is, in many respects, an ordinary man: son of a steelworker, he is a husband and father; a Vietnam Vet, he works now as public relations man. But the details of Ira's quotidian life are of little real importance in his story. He lives - as so many men do - in an ongoing internal landscape populated by all the many women he has loved. And continues to love - instinctively, comprehensively, creatively, deeply. So deeply, in fact, that as he relives the moments of intimacy with them, Ira often speaks in the voices of these women. This weaving of the inner voices of both a man and the women he's loved creates a narrative driven by intuition and sensuality and free of theories and cant intellectualizing. The result is a compelling, profound, and timely examination of human sexuality and, not incidentally, one of the most rapturously erotic books of our time.",
        "Category": "",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "24.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Milo and the Mysterious Island",
        "Authors": "By Pfister, Marcus and Martens, Marianne",
        "Description": "This exciting sequel to Marcus Pfister's best-selling Milo and the Magical Stones picks up where the happy resolution to that alternate-ending book left off. Winter is over and Milo sets out to explore. But Milo knows every nook and cranny of his small island and he is restless and bored. How wonderful it would be, he thinks, to see what lies over the horizon. He shares his dream with the other cliff mice, and together they build a giant raft and set out on a voyage of discovery. Their voyage takes them to a lush tropical island inhabited by friendly striped mice. What kind of explorers will the cliff mice be? Will their discovery lead to good or evil? It's up to the reader to decide. Halfway through the story, the book splits into two sections, each offering a different ending. From Marcus Pfister, creator of \"The Rainbow Fish,\" comes a thought-provoking story that, with the book's unique format, actively involves children in the decision-making process.",
        "Category": " Juvenile Fiction , Social Themes , New Experience",
        "Publisher": "NorthSouth",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Kingdom of the Grail",
        "Authors": "By Tarr, Judith",
        "Description": "Centuries following the fall of Camelot and the disappearance of King Arthur, Roland, a descendant of Merlin, vows to free the imprisoned wizard and resumes the quest for the Holy Grail, taking on one of Arthur's historic enemies in the process. Original.",
        "Category": " Fiction , Fantasy , Historical",
        "Publisher": "Roc Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Attitude is Everything Rev Ed: 10 Life-Changing Steps to Turning Attitude into Action",
        "Authors": "By Harrell, Keith D.",
        "Description": "In the world of professional speakers, Keith Harrell is making adifference. Clients such as IBM, Coca-Cola, and Boeing know it -- that'swhy Keith is one of the most in-demand speakers on the circuit. Here,in Attitude Is Everything, he shares the secrets that got him where he is today and provides you with a program for developing a healthier,happier, more productive attitude.This is an enlightening, inspiring, and practical guide for gainingcontrol of your career and your life by ridding yourself of negativebaggage, building positive attitudes, and then turning them into actionsto help you achieve your dreams.Now, along with the Attitude Is Everything workbook, you willhave all the tools for developing and maintaining a powerful positiveattitude in order to get ahead.",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Papers of Samuel Marchbanks",
        "Authors": "By Davies, Robertson",
        "Description": "Presents three collections of newspaper columns by the novelist's mischievous alter ego, Samuel Marchbanks, with extensive commentary in Davies' own voice",
        "Category": " Fiction , General",
        "Publisher": "Viking",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1986"
        }
    },
    {
        "Title": "San Francisco in the 1850s: 33 Photographic Views",
        "Authors": "By Fardon, G. R.",
        "Description": "",
        "Category": "",
        "Publisher": "Dover Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1977"
        }
    },
    {
        "Title": "The Armchair Angler (Armchair Library)",
        "Authors": "By Terry Brykczynski~David Reuther",
        "Description": "Gathers stories, articles, and essays about fishing, trout, salmon, pickerel, fly casting, bait, and fishing etiquette",
        "Category": "",
        "Publisher": "Collier Books",
        "Price Starting With ($)": "5.83",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Waiting for Winter to End: An Extraordinary Journey Through Soviet Central Asia",
        "Authors": "By Geyer, Georgie Anne",
        "Description": "Soviet Central Asia: an exotic region of harsh deserts and rugged mountains shut off by communism since 1917, mysterious lands that still evoke images of the ancient Silk Road caravans. Kazakhstan, Kyrgyzstan, Uzbekistan, Tatarstan, and Azerbaijan are primarily inhabited by Muslim peoples of whom we know very little.Now that the long winter of communism has ended and these new republics slowly open to the West, syndicated columnist and television personality Georgie Anne Geyer has taken it upon herself to learn more. A modern-day Marco Polo, she shares her eye-opening personal experiences in Waiting for Winter to End. Join her as she sets out from Moscow for Kazan and Alma-Ata, Bishkek and Tashkent, Samarkand and Baku. Sit in on her interviews with nascent political leaders about the post-Soviet situation, in which possible dangers for the United States are revealed. Travel with a witty, observant, and knowledgeable companion to a resources-rich region that will become more and more important for the world. Georgie Anne Geyer's latest book is a lively, multifaceted account of her adventures in places to which few Westerners have gone before. Part travelogue, part history, part insider's political briefing - an entirely enjoyable and entertaining read.",
        "Category": " Travel , Asia , Central",
        "Publisher": "Brassey's Inc",
        "Price Starting With ($)": "8.62",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "The Justice from Beacon Hill: The Life and Times of Oliver Wendell Holmes",
        "Authors": "By Baker, Liva",
        "Description": "Surveys the life and work of Justice Oliver Wendell Holmes, and describes his influence as the champion of the idea that the law should be flexible enough to adapt to the changes of society",
        "Category": " Law , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Augustus John: A biography",
        "Authors": "By Holroyd, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Holt, Rinehart and Winston",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Antique Country Furniture of North America and Details of Its Construction",
        "Authors": "By Shea, John G.",
        "Description": "",
        "Category": "",
        "Publisher": "Van Nostrand Reinhold",
        "Price Starting With ($)": "6.25",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "AN Introduction to Lettering",
        "Authors": "By Greer, Alan, Greer, Rita",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "6.23",
        "Publish Date": {
            "Month": "May",
            "Year": "1978"
        }
    },
    {
        "Title": "It's Your Money: The E*TRADE Step-by-Step Guide to Online Investing",
        "Authors": "By Cotsakos, Christos M.",
        "Description": "It's your money -- why not take control of it?  Here's the definitive guide to investing and managing your money online.  This easy-to-use guide covers everything from getting online to Wall Street fundamentals to researching and investing in stocks, bonds, mutual funds, options, and IPOs online.  It's a must-read starter kit for anyone who's thought about managing his or her money online.",
        "Category": " Business & Economics , Personal Finance , Investing",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Social Change and Revolution In England 1540-1640 (Problems and perspectives in History)",
        "Authors": "By Lawrence Stone",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes and Noble, Inc.",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "This Vast External Realm",
        "Authors": "By Acheson, Dean",
        "Description": "",
        "Category": "",
        "Publisher": "Norton*(ww Norton Co",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "April",
            "Year": "1973"
        }
    },
    {
        "Title": "Twilight of the Old Order, 1774-1778 (The French Revolution, Vol 1)",
        "Authors": "By Manceron, Claude",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "9.08",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Shrapnel in the Heart: Letters and Remembrances from the Vietnam Veterans Memorial",
        "Authors": "By Palmer, Laura",
        "Description": "More than one hundred letters left at Washington's Vietnam Veterans Memorial are accompanied by interviews with the authors of the letters, families of soldiers killed in the war",
        "Category": " History , Military , Vietnam War",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    }
]