[
    {
        "Title": "Darlington Woods: Something Evil is Drawing Them Here…",
        "Authors": "By Dellosso, Mike",
        "Description": "Rob Shields has just lost his wife and son. Battling depression, denial, and an irrational fear of darkness, Rob travels to the small town of Mayfield, MD to check out a house he has inherited from his great aunt Wilda, a woman he has never even met. There in Mayfield strange things begin to happen that lead Rob to believe his son, Jimmy, is not really dead. After a restless night and eerie dream, Rob is convinced the answer to the mystery surrounding Jimmy’s disappearance and alleged death is to be found in a village called Darlington, a town found on no map.Teaming up with a quirky local waitress who insists she has been there, Shields begins his quest to find the truth about the town and his son. In Darlington, Rob and Juli come face to face with the town’s secret, creatures called Darklings inhabit the night and instill paralyzing fear in Darlington’s citizens. Their search for Jimmy leads them into the woods surrounding Darlington where, once in, there seems to be no way out.",
        "Category": " Fiction , Christian , Suspense",
        "Publisher": "Realms",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "A Life's Work: Fathers and Sons",
        "Authors": "By Bradlee, Ben and Bradlee, Quinn",
        "Description": "Ben Bradlee’s all-American football player father lost his well-paying job in the Depression and never recovered his income but also never lost his balance and energy. Living on a borrowed estate, he undertook to clear the property, and his young son bonded with his father as they worked alongside each other in the woods. When thirteen-year-old Ben contracted polio, his father nursed him back to health until they could go to work again. Ben Bradlee tells the story of how this lifelong love of working outdoors enabled him to forge an intimate connection with his own son, Quinn, who was born with a heart defect and is learning disabled. Quinn Bradlee writes about how his father gave him courage and confidence, about what it is like not just to be the son of the Ben Bradlee but his father’s best pal. He tells wistfully how their roles have reversed and how he has become his father’s protector. Sally Quinn, wife and mother, offers her observation on fathers and sons in this joyous celebration of a special relationship.",
        "Category": " Family & Relationships , Parenting , Fatherhood",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "The Creed Room: A Novel of Ideas",
        "Authors": "By Spiro, Daniel",
        "Description": "",
        "Category": " Fiction , Religious",
        "Publisher": "Aegis Press",
        "Price Starting With ($)": "6.79",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "The Ring in the Rubble: Dig Through Change and Find Your Next Golden Opportunity",
        "Authors": "By Bradt, Gary",
        "Description": "“Bradt's message in this excellent and inspiring book is a 'golden ring' itself amidst the rubble often permeating our lives. It not only speaks true but makes you strive for more.”--Stephen R. Covey, author,The 7 Habits of Highly Effective People and The 8th Habit: From Effectiveness to Greatness“Beautifully written and full of wisdom, The Ring in the Rubble is a gem.”--Ken Blanchard, co-author ofThe One Minute Manager and Leading at a Higher LevelChange always creates hidden opportunities. A leader's job is unearthing them. InThe Ring in the Rubble, change authority Gary Bradt reveals the secrets to moving beyond the rubble of disruption, fear, and uncertainty that change often creates, to finding the golden ring of opportunity that always lies beneath.Each chapter of this breakthrough book delivers a powerful principle for leading change, supported by engaging real-life experiences of the author and other well-known business executives that illustrate how to put principles into action. Bradt asks penetrating questions that help you “dig deeper” and pinpoint the best ways for applying these principles to your specific change effort.You will discover how Richard Schulze weathered a devastating event that threatened to destroy everything he'd worked so hard to build-and became the founder of Best Buy in the process. You'll see how a 65-year-old man, nearly broke after having suffered a string of disastrous setbacks, dug through the rubble to emerge as Colonel Harland Sanders, who remains the face of Kentucky Fried Chicken to this day. Change itself doesn't dictate the eventual outcome of your situation; how you think about and handle change is what makes all the difference. You'll never find the ring if you don't start digging!",
        "Category": " Business & Economics , Management",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Tampa Treasures",
        "Authors": "By Junior League of Tampa",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Seaside Pub",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Ortho's All About Storage Solutions (Ortho's All About Home Improvement)",
        "Authors": "By Ortho Books, Ehrlich, Paul, Toht, David, and Sanders, Jim",
        "Description": "An idea book with solutions to one of homeowners’ largest problems— where to put all their stuff—by showing how to be truly organized about storage.Solutions to storage problems range from closet organizers readers can buy to cabinetry they can build.One chapter devoted to storage basics and remaining chapters focus on different areas of the house and garage.",
        "Category": " House & Home , Cleaning, Caretaking & Organizing",
        "Publisher": "Ortho",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Ortho's All About Painting and Wallpapering",
        "Authors": "By Santos, Brian",
        "Description": "Offers information on techniques and materials used for decorative wall treatments, including tips on preparing surfaces, painting trim, installing wallpaper, and creating a color scheme.",
        "Category": " House & Home , Decorating",
        "Publisher": "Ortho",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Symphonic music: Its evolution since the Renaissance",
        "Authors": "By Homer Ulrich",
        "Description": "",
        "Category": "",
        "Publisher": "Columbia University Press",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "MAKE IT WORK SOUND (A CREATIVE HANDS ON APPROACH TO SCIENCE)",
        "Authors": "By Parsons, Alexandra, Barnes, Jon (PHT), Baker, Wendy, Haslam, Andrew, and Barnes, Jon (ILT)",
        "Description": "Experiments and activities explore the world of sound",
        "Category": " Juvenile Nonfiction , Science & Nature , Experiments & Projects",
        "Publisher": "Simon & Schuster Children's Publishing",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "The Count of Monte Cristo (Cliffs Notes)",
        "Authors": "By Roberts, James L.",
        "Description": "The original CliffsNotes study guides offer a look into critical elements and ideas within classic works of literature.CliffsNotes on The Count of Monte Cristo takes you into a rollicking yarn of adventure, wit, and revenge.Following the story of a man imprisoned for 14 years who escapes by outsmarting his captors, this study guide shows through its expert commentaries just how the Count works justice with a vengeance on his enemies. Other features that help you figure out this important work includeLife and background of the author, Alexandre DumasCharacter sketches on the novel's vast array of personalitiesPlot synopsis and summaries for each chapterSuggested essay topics and a select bibliographyClassic literature or modern-day treasure — you'll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "John Wiley &Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "The Canadian Rockies",
        "Authors": "By Action Communications",
        "Description": "",
        "Category": "",
        "Publisher": "High Country Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "At the Auto Repair Center (Tonka, Trucks Storybooks)",
        "Authors": "By Petruccio, Steven James (ILT), Korman, Justine, and Tonka Corporation (COR)",
        "Description": "In a storybook that shows the many different jobs auto mechanics perform, young Drew goes to work at the auto repair center with his dad and learns about replacing brakes, changing flats, and more. Original.",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Once Dead, Twice Shy (Madison Avery, Book 1)",
        "Authors": "By Harrison, Kim",
        "Description": "My name is Madison Avery, and I'm here to tell you that there's more out there than you can see, hear, or touch. Because I'm there. Seeing it. Touching it. Living it.  Madison's prom was killer?literally. For some reason she's been targeted by a dark reaper?yeah, that kind of reaper?intent on getting rid of her, body and soul. But before the reaper could finish the job, Madison was able to snag his strange, glowing amulet and get away.  Now she's stuck on Earth?dead but not gone. Somehow the amulet gives her the illusion of a body, allowing her to toe the line between life and death. She still doesn't know why the dark reaper is after her, but she's not about to just sit around and let fate take its course.  With a little ingenuity, some light-bending, and the help of a light reaper (one of the good guys! Maybe . . . ), her cute crush, and oh yeah, her guardian angel, Madison's ready to take control of her own destiny once and for all, before it takes control of her.  Well, if she believed in that stuff.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Certain Victory: The U.S. Army in the Gulf War (Ausa Book)",
        "Authors": "By Scales, Robert H., Jr.",
        "Description": "The official U.S. Army account of Army performance in the Gulf War, Certain Victory was originally published by the Office of the Chief of Staff, U.S. Army, in 1993.  Brig. Gen. Scales, who headed the Army's Desert Storm Study Project, offers a highly readable and abundantly illustrated chronicle.",
        "Category": " History , Military , General",
        "Publisher": "Potomac Books",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Building a Successful Palestinian State",
        "Authors": "By Rand Palestinian State Study Team, Green, Jerrold D., Neu, C. Richard, Ribinson, Glenn E., Shine, Kenneth I., Simor, Steven N., and Gompert, David C. (EDT)",
        "Description": "A critical mass of Palestinians and Israelis, as well as the United States, Russia, the European Union, and the United Nations, remain committed to the establishment of a Palestinian state. The authors, examine in objective fasion the requirements for creating and maintaining successful statehood during the first decade of Palestine's independence.",
        "Category": " Political Science , American Government , National",
        "Publisher": "RAND Corporation",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Biogeochemistry, Second Edition: An Analysis of Global Change",
        "Authors": "By Schlesinger, William H.",
        "Description": "For the past 4 billion years, the chemistry of the Earth's surface, where all life exists, has changed remarkably. Historically, these changes have occurred slowly enough to allow life to adapt and evolve. In more recent times, the chemistry of the Earth is being altered at a staggering rate, fueled by industrialization and an ever-growing human population. Human activities, from the rapid consumption of resources to the destruction of the rainforests and the expansion of smog-covered cities, are all leading to rapid changes in the basic chemistry of the Earth.The Second Edition of Biogeochemistry considers the effects of life on the Earth's chemistry on a global level. This expansive text employs current technology to help students extrapolate small-scale examples to the global level, and also discusses the instrumentation being used by NASA and its role in studies of global change. With the Earth's changing chemistry as the focus, this text pulls together the many disparate fields that are encompassed by the broad reach of biogeochemistry. With extensive cross-referencing of chapters, figures, and tables, and an interdisciplinary coverage of the topic at hand, this text will provide an excellent framework for courses examining global change and environmental chemistry, and will also be a useful self-study guide.* Emphasizes the effects of life on the basic chemistry of the atmosphere, the soils, and seawaters of the Earth* Calculates and compares the effects of industrial emissions, land clearing, agriculture, and rising population on Earths chemistry* Synthesizes the global cycles of carbon, nitrogen, phosphorous, and sulfur, and suggests the best current budgets for atmospheric gases such as ammonia, nitrous oxide, dimethyl sulfide, and carbonyl sulfide* Includes an extensive review and up-to-date synthesis of the current literature on the Earths biogeochemistry",
        "Category": " Science , Earth Sciences , Geology",
        "Publisher": "Academic Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Jefferson the President Second Term 1805",
        "Authors": "By MALONE, DUMAS",
        "Description": "",
        "Category": "",
        "Publisher": "LITTLE BROWN & CO @",
        "Price Starting With ($)": "15.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "When No One Understands: Letters to a Teenager on Life, Loss, and the Hard Road to Adulthood",
        "Authors": "By Sachs, Brad, Ph.D.",
        "Description": "When Amanda first came to Dr. Sachs for treatment, she had attempted suicide more than once. Withdrawn and cynical, she refused to speak during her therapy sessions. Determined to connect, Dr. Sachs tried something unconventional: he wrote letters to Amanda between sessions and invited her to write back, thinking she might feel more comfortable opening up in this way—and indeed she did. This correspondence gradually built trust between them, helping her to survive and ultimately to heal.When No One Understands consists of twenty letters that Dr. Sachs wrote to Amanda over the course of her therapy. In these letters, Sachs reaches out to Amanda with the core message that there is nothing wrong with her—that adolescence is painful, complex, and challenging for everyone and that her emotional pain deserves to be honored, openly explored, and viewed with compassion. Dr. Sachs also addresses many of the common questions and concerns shared by all teens on such topics as relationships, breakups, drugs and alcohol, parents, family dynamics, and more. Along the way, Dr. Sachs offers adults an inspiring image of a truly open, human-to-human relationship between an adult and a teenager. Parents, mental health professionals, guidance counselors, educators, and others who work with teens will see how they might also bring honesty, compassion, and humility to bear in their interactions with young people in order to create truly healing and supportive relationships.",
        "Category": " Family & Relationships , Life Stages , Adolescence",
        "Publisher": "Shambhala",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Boxer (Sunburst Book)",
        "Authors": "By Karr, Kathleen",
        "Description": "Hard-hitting historical fictionEver since his father ran off two years before, fifteen-year-old Johnny Woods has struggled to help support his ma and five siblings, sacrificing his own schooling in the process. Still, there's been hardly enough money each month to make the rent, and Johnny's dream of a house in Brooklyn, away from the tenement slums, is out of reach. Then Johnny discovers boxing. He is a natural-born fighter, with street smarts, determination, and an explosive uppercut. Although boxing is illegal in 1885 New York, Johnny powers his way through every obstacle, believing he has found the means to raise himself and his family out of poverty. But as he moves closer to his biggest fight yet, Johnny must reconcile his need to help his loved ones with a sharpening desire to achieve something outside the ring, starting with his education. In bringing to life Johnny's struggle and ultimate success, Kathleen Karr offers readers a compelling portrait of an appealing young champion.",
        "Category": " Young Adult Fiction , Historical , United States , 19th Century",
        "Publisher": "FSG",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Indie Kidd: How to Be Goodish",
        "Authors": "By McCombie, Karen",
        "Description": "Meet Indie Kidd, who is celebrating her 10th birthday. Or she would be celebrating if it weren't for a horrible school project. Indie's teacher loves making lists and wants the students to list their top three talents. Never mind three talents, Indie can hardly think of one. Her super-talented best friends, Soph and Fee, have quickly finished their lists. Now, there's no time to lose as the girls team up to help Indie find her special talents. She tries just about everything from hair wrapping to magic tricks. There's got to be something Indie's good at—or at least good(ish).",
        "Category": " Juvenile Fiction , Family , Blended Families",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "New York Times Crossword Puzzle Dictionary Second Edition",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Hudson Group Times Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Look & See: Wheels on the Go!",
        "Authors": "By Sterling Children's",
        "Description": "Wheeeee!—these vehicles will capture the imagination of car and truck-loving toddlers everywhere. With die-cut, eye-catching, wonderful wheels on every page, this appealing board book takes kids fingertips on a great ride. The dynamic rhyming text tells them about such favorites as big steamroller, a bulldozer, a zipping zooming red race car, a siren-blaring fire engine, and a jeep ready to handle any challenge, from desert to jungle. Kids adore things that go, so this book is sure to become an instant favorite.",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "Union Square Kids",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Taste of Home's Contest Winning Annual Recipes 2005",
        "Authors": "By Taste of Home",
        "Description": "",
        "Category": "",
        "Publisher": "Reiman Media",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Third Secret (The Chapman Files, 3)",
        "Authors": "By Quinn, Tara Taylor",
        "Description": "Rick Thomas stole drug-cartel evidence from a government facility. And spent three years in a federal prison.Attorney Erin Morgan has a rule: never defend the bad guys. But Rick Thomas, quiet and self-assured, doesn&#39;t seem bad. That&#39;s why she agrees to defend him against what he swears is a trumped-up murder charge. She&#39;s ignoring her experience and listening to her instincts instead.But psychologist and expert witness Kelly Chapman is listening to her instincts, too. And they&#39;re saying that Rick Thomas is lying to Erin. That he&#39;s keeping secrets. That he&#39;s a dangerous man. And that, despite everything, maybe he&#39;s one of the good guys&#133;.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Combat the War with Germany",
        "Authors": "By Congdon, Don",
        "Description": "",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Fifty Years of American Poetry: Anniversary Volume for the Academy of American Poets",
        "Authors": "By Warren, Robert Penn (EDT)",
        "Description": "This anthology offers a definitive overview of the past five decades of American poetry, encompassing works by Aiken, Auden, Sandburg, Ashbery, Updike, Gilpin, and others",
        "Category": " Poetry , General",
        "Publisher": "Harry N. Abrams, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "The Word Eater",
        "Authors": "By Amato, Mary and Ryniak, Christopher (ILT)",
        "Description": "Life is miserable for sixth grader Lerner Chanse at her new shool, where the MPOOE (Most Powerful Ones On Earth) Club ruthlessly rules over the SLUGs (Sorry Losers Under Ground). It looks as if Lerner is destined to be a SLUG, until she finds a magical worm that eats printed words instead of dirt. If Fip eats a word, that item simply disappears from the world -- forever.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Holiday House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Silas Marner (Dover Thrift Editions)",
        "Authors": "By Eliot, George",
        "Description": "As a young man, Silas Marner shut himself off from the world after being wrongly accused of theft and losing the girl he loved. Much later in life, the lonely, embittered weaver experiences two jolting events: he is robbed of his meager hoard of gold and he becomes the guardian of Eppie, a little orphan girl who makes her way to his cottage one wintry night. Eppie grows into a charming young woman who cares for the alienated Silas, helping him find love and hope in his life.First published in 1861, this classic English novel by George Eliot (pen name of Mary Anne Evans) is widely admired for its brevity and perfection of form. It has also long delighted students of literature and general readers alike with its masterly portrait of moral and psychological behavior in Victorian England, and with its mystery, intrigue, and heartwarming denouement.",
        "Category": " Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Fragile Eternity (Wicked Lovely, Book 3)",
        "Authors": "By Marr, Melissa",
        "Description": "In the third mesmerizing tale in Melissa Marr’s #1 New York Times bestselling Wicked Lovely series, old friends become new enemies—and one wrong move could plunge the Earth into chaos.Seth never expected he would want to settle down with anyone, but that was before Aislinn. She is everything he'd ever dreamed of, and he wants to be with her forever. Forever takes on new meaning, though, when your girlfriend is an immortal faery queen.Aislinn never expected to rule the very creatures who'd always terrified her, but that was before Keenan. He stole her mortality to make her a monarch, and now she faces challenges and enticements beyond any she'd ever imagined.Seth and Aislinn struggle to stay true to themselves and each other—all while navigating the shadowy rules and shifting allegiances of the Faery Courts.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Wizards of the Game",
        "Authors": "By Lubar, David",
        "Description": "Short, if the ancient maps were correct, I’d face my sworn enemy. Soon, I’d discover whether the sword of Calandra was a magical weapon capable of defeating an army, or a worthless piece of iron I’d been tricked into buying. Not much longer, I told myself, trying to control the excitement that buzzed through my nerves. Soon, revenge would be mine. Soon, the head of Maraku would dangle from my belt, and his heart would nourish the wolves who followed my trail.   But first, I had to make it through the rest of my third-period geography class.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "PUFFIN BOOKS",
        "Price Starting With ($)": "12.11",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "101 Cost-Effective Ways to Increase the Value of Your Home",
        "Authors": "By Berges, Steve",
        "Description": "A 25-year veteran of the real estate industry and principal of a residential construction company, Berges provides homeowners with a clear and practical guide to the impact that making certain improvements--both minor and major--has on the value of a home. Coverage includes the process of getting started, including the benefits of doing it yourself versus hiring a subcontractor, building inspectors, and the building permit process; exterior improvements to a home and its landscaping; interior alterations; and specific structural and mechanical improvements. This text will appeal to both homeowners planning to sell and those who simply want to make sound decisions about their home improvements. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Business & Economics , Real Estate , General",
        "Publisher": "Kaplan Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "The Season of Second Chances: A Novel",
        "Authors": "By Meier, Diane",
        "Description": "A world of possibilities opens up for Joy Harkness when she sets out on a journey that’s going to show her the importance of friendship, love, and what makes a house a home Coming-of-age can happen at any age. Joy Harkness had built a university career and a safe life in New York, protected and insulated from the intrusions and involvements of other people. When offered a position at Amherst College, she impulsively leaves the city, and along with generations of material belongings, she packs her equally heavy emotional baggage. A tumbledown Victorian house proves an unlikely choice for a woman whose family heirlooms have been boxed away for years. Nevertheless, this white elephant becomes the home that changes Joy forever. As the restoration begins to take shape, so does her outlook on life, and the choices she makes over paint chips, wallpaper samples, and floorboards are reflected in her connection to the co-workers who become friends and friendships that deepen. A brilliant, quirky, town fixture of a handyman guides the renovation of the house and sparks Joy’s interest to encourage his personal and professional growth. Amid the half-wanted attention of the campus’s single, middle-aged men, known as “the Coyotes,”and the legitimate dramas of her close-knit community, Joy learns that the key to the affection of family and friends is being worthy of it, and most important, that second chances are waiting to be discovered within us all.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "Henry Holt and Co.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "The Buzzards Are Circling, But God's Not Finished With Me Yet",
        "Authors": "By Toler, Stan",
        "Description": "Who couldn't use a little encouragement from time to time? In this delightful collection of stories and life lessons, you'll discover how you can experience hope, joy, and peace even in life's most trying times. In chapters such as \"When the Fountain of Youth Has Rusted\" and \"I Know I'm Lost, but the Scenery Is Spectacular,\" you'll find the encouragement you need to shoo away any buzzards and face life's difficulties with the security of knowing that God is in control. By mixing humor with poignant truths and practical methods for finding hope when life gets tough, Stan Toler will have you boldly laughing in the face of difficult circumstances.",
        "Category": " Religion , Meditations",
        "Publisher": "David C Cook",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "The Comet & the Tornado: Reflections on the Legacy of Randy Pausch",
        "Authors": "By Marinelli, Don",
        "Description": "An intimate look at Randy Pausch (author of the blockbuster The Last Lecture) from his friend and colleague It is impossible to pinpoint the moment Randy Pausch became a household name, but when he died, millions of people who either read or watched his last lecture on YouTube felt as if they had lost a friend.One man who actually did lose a close friend that day was Donald Marinelli. Affectionately referred to as ?the Tornado” in the last lecture, Donald was the whirlwind of energy and creativity who co-founded the Entertainment Technology Center (ETC) at Carnegie Mellon University with Randy. Donald recounts his remarkable journey from Carnegie Mellon’s drama department, through the years building the ETC with Randy, to today, as he helms the center on his own and leads its worldwide expansion. Central to his story are the six years he and Randy shared an office, their differences and commonalities (they both fought cancer), and their priorities, as well as the philosophy of the ETC. Most poignantly, Don reveals what he learned from Randy, whom he describes as ?a comet who burst upon the scene like an astral body . . . illuminating his secrets for living life to the fullest for millions of folks who needed such guidance.”",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Union Square & Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Build Your Own Farmyard",
        "Authors": "By Stewart Walton, Sally Walton",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "9.7",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Grotto (Candleglow)",
        "Authors": "By Rogers, Evelyn",
        "Description": "Arriving at the Villa Falcone in Belmare, which is plagued by a strange aura, Kate encounters an enigmatic stranger whose skills of seduction make her ache with desire, but a sinister force lurks in the Villa, threatening to destroy them both. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Love Spell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Jackie Robinson: An American Hero (Townsend Library)",
        "Authors": "By Anne E. Schraff",
        "Description": "",
        "Category": "",
        "Publisher": "Townsend Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Quiet Guys Can Do Great Things Too",
        "Authors": "By Frank K. Ross",
        "Description": "",
        "Category": "",
        "Publisher": "Writing Our World Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Donovan: America's Master Spy",
        "Authors": "By Dunlop, Richard",
        "Description": "Details the extraordinary exploits of William J. Donovan--war hero, presidential advisor, and founder of the Office of Strategic Services--based on Donovan's personal papers, the recollections of co-workers, and recently declassified government documents",
        "Category": "",
        "Publisher": "Rand McNally",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1982"
        }
    },
    {
        "Title": "Rock Movers and Shakers: An A-Z of the People Who Made Rock Happen",
        "Authors": "By Watson-Guptill (COR)",
        "Description": "",
        "Category": " Biography & Autobiography , Composers & Musicians",
        "Publisher": "Billboard Books",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Naked Cruelty: A Carmine Delmonico Novel (Carmine Delmonico Novels)",
        "Authors": "By McCullough, Colleen",
        "Description": "Carmine Delmonico returns in another riveting page-turner by international bestselling author Colleen McCullough. America in 1968 is in turmoil and the leafy Holloman suburb of Carew is being silently terrorized by a series of vicious and systematic rapes. When finally one victim finds the courage to speak out and go to the police, the rapist escalates to murder. For Captain Carmine Delmonico, it seems to be a case with no clues. And it comes as the Holloman Police Department is troubled: a lieutenant is out of his depth, a sergeant is out of control, and into this mix comes the beautiful, ruthlessly ambitious new trainee, Helen MacIntosh, daughter of the influential president of Chubb University. As the killer makes his plans, Carmine and his team must use every resource at their disposal—including a highly motivated neighborhood watch, the Gentlemen Walkers.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "Managing Artists in Pop Music: What Every Artist and Manager Must Know to Succeed",
        "Authors": "By Weiss, Mitch and Gaffney, Perri",
        "Description": "Discover the real story through a “week in the life of a music manager” in this guide to successful talent management!  Through entertaining, real-life stories of famous artist-manager teams, Managing Artists in Pop Music analyzes, criticizes, and details what a talent manager must know in order to become an effective advisor and representative. Readers will learn scores of insider secrets for acquiring clients; negotiating fair contracts; avoiding career manipulation; and dealing with promoters, media, attorneys, and even unions. Packed with surefire career tips, industry guidelines, and sample contracts, here is the perfect springboard to success for music managers, recording artists, singers, and rock bands!• Provides a complete course in music management from the point of view of both artist and manager• Includes artist-management agreements, booking agreements, independent contractor forms, and booking summaries with clear explanations of each",
        "Category": " Music , Business Aspects",
        "Publisher": "Allworth Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "To Improve Health and Health Care: The Robert Wood Johnson Foundation Anthology (Public Health/Robert Wood Johnson Foundation Anthology)",
        "Authors": "By Isaacs, Stephen L. and Knickman, James R.",
        "Description": "Since 1972, the Robert Wood Johnson Foundation has been the nation's largest philanthropy devoted exclusively to health. To further its mission of improving the health and health care of all Americans, the Foundation strives to foster innovation, develop ideas, disseminate information, and enable committed people to devote their energies to improving the nation's well-being. As part of the Foundation's efforts to inform the public, To Improve Health and Health Care, the ninth volume in the Robert Wood Johnson Foundation Anthology series, provides an in-depth look into the programs it funds. Written for policymakers and practitioners, as well as interested members of the public, the series offers valuable lessons for leaders and educators developing plans for the coming years.",
        "Category": " Medical , Public Health",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "GREAT SOUL: Mahatma Gandhi and His Struggle with India",
        "Authors": "By Lelyveld, Joseph",
        "Description": "A highly original, stirring book on Mahatma Gandhi that deepens our sense of his achievements and disappointments—his success in seizing India’s imagination and shaping its independence struggle as a mass movement, his recognition late in life that few of his followers paid more than lip service to his ambitious goals of social justice for the country’s minorities, outcasts, and rural poor.Pulitzer Prize–winner Joseph Lelyveld shows in vivid, unmatched detail how Gandhi’s sense of mission, social values, and philosophy of nonviolent resistance were shaped on another subcontinent—during two decades in South Africa—and then tested by an India that quickly learned to revere him as a Mahatma, or “Great Soul,” while following him only a small part of the way to the social transformation he envisioned. The man himself emerges as one of history’s most remarkable self-creations, a prosperous lawyer who became an ascetic in a loincloth wholly dedicated to political and social action. Lelyveld leads us step-by-step through the heroic—and tragic—last months of this selfless leader’s long campaign when his nonviolent efforts culminated in the partition of India, the creation of Pakistan, and a bloodbath of ethnic cleansing that ended only with his own assassination. India and its politicians were ready to place Gandhi on a pedestal as “Father of the Nation” but were less inclined to embrace his teachings. Muslim support, crucial in his rise to leadership, soon waned, and the oppressed untouchables—for whom Gandhi spoke to Hindus as a whole—produced their own leaders. Here is a vital, brilliant reconsideration of Gandhi’s extraordinary struggles on two continents, of his fierce but, finally, unfulfilled hopes, and of his ever-evolving legacy, which more than six decades after his death still ensures his place as India’s social conscience—and not just India’s.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "knopf",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "The New Oxford Book of Romantic Period Verse (Oxford Books of Verse)",
        "Authors": "By McGann, Jerome J. (EDT)",
        "Description": "",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "The Immortal Life of Henrietta Lacks",
        "Authors": "By Skloot, Rebecca",
        "Description": "Now an HBO® Film starring Oprah Winfrey and Rose Byrne#1 NEW YORK TIMES BESTSELLERHer name was Henrietta Lacks, but scientists know her as HeLa. She was a poor black tobacco farmer whose cells—taken without her knowledge in 1951—became one of the most important tools in medicine, vital for developing the polio vaccine, cloning, gene mapping, and more. Henrietta's cells have been bought and sold by the billions, yet she remains virtually unknown, and her family can't afford health insurance. This phenomenal New York Times bestseller tells a riveting story of the collision between ethics, race, and medicine; of scientific discovery and faith healing; and of a daughter consumed with questions about the mother she never knew.",
        "Category": " Biography & Autobiography , Cultural, Ethnic & Regional , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "Orange Is the New Black: My Year in a Women's Prison",
        "Authors": "By Kerman, Piper",
        "Description": "#1 NEW YORK TIMES BESTSELLER • NOW A NETFLIX ORIGINAL SERIES   With a career, a boyfriend, and a loving family, Piper Kerman barely resembles the reckless young woman who delivered a suitcase of drug money ten years before. But that past has caught up with her. Convicted and sentenced to fifteen months at the infamous federal correctional facility in Danbury, Connecticut, the well-heeled Smith College alumna is now inmate #11187–424—one of the millions of people who disappear “down the rabbit hole” of the American penal system. From her first strip search to her final release, Kerman learns to navigate this strange world with its strictly enforced codes of behavior and arbitrary rules. She meets women from all walks of life, who surprise her with small tokens of generosity, hard words of wisdom, and simple acts of acceptance. Heartbreaking, hilarious, and at times enraging, Kerman’s story offers a rare look into the lives of women in prison—why it is we lock so many away and what happens to them when they’re there.   Praise for Orange Is the New Black   “Fascinating . . . The true subject of this unforgettable book is female bonding and the ties that even bars can’t unbind.”—People (four stars)    “I loved this book. It’s a story rich with humor, pathos, and redemption. What I did not expect from this memoir was the affection, compassion, and even reverence that Piper Kerman demonstrates for all the women she encountered while she was locked away in jail. I will never forget it.”—Elizabeth Gilbert, author of Eat, Pray, Love   “This book is impossible to put down because [Kerman] could be you. Or your best friend. Or your daughter.”—Los Angeles Times   “Moving . . . transcends the memoir genre’s usual self-centeredness to explore how human beings can always surprise you.”—USA Today   “It’s a compelling awakening, and a harrowing one—both for the reader and for Kerman.”—Newsweek   Look for special features inside. Join the Random House Reader’s Circle for author chats and more.",
        "Category": " Social Science , Penology",
        "Publisher": "Random House Publishing Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "A Better Country: Preparing for Heaven",
        "Authors": "By Schaeffer, Dan",
        "Description": "This transforming book will change the way you think about heaven and the way you live on earth. An understanding of heaven is not a spiritual luxury or escapism; it is a spiritual necessity. Author Dan Schaeffer offers insight into that heavenly desire, the heavenly location, the heavenly life, and heavenly preparation, showing how God wants that \"better country\" to be the passion and purpose of our present life. Includes a helpful study guide for each chapter.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Discovery House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Man from Beijing (Vintage Crime/Black Lizard)",
        "Authors": "By Mankell, Henning and Thompson, Laurie (TRN)",
        "Description": "From the dean of Scandinavian noir, Henning Mankell, the internationally bestselling and universally acclaimed Kurt Wallander series, an incredible stand-alone masterpiece: a bone-chilling mystery that spans two centuries and four continents. In the far north of Sweden a small, quiet village has been almost entirely wiped out by a mass murderer. The only clue left at the scene is a red ribbon. Among the victims are the grandparents of Judge Birgitta Roslin, who sets out to find the killer. Despite being brushed off by the police, Birgitta is determined to prove that the murders were not a random act of violence but are part of something far more dark and complex. Her investigation leads to the highest echelons of power and into the recesses of history where the seeds of evil deeds were planted.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Vintage Crime/Black Lizard",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "Every Day in Tuscany: Seasons of an Italian Life",
        "Authors": "By Mayes, Frances",
        "Description": "#1 NEW YORK TIMES BESTSELLER AND A TIMELESS CLASSIC FROM THE AUTHOR OF UNDER MAGNOLIA Frances Mayes—widely published poet, gourmet cook, and travel writer—opnes the door to a wondrous new world when she buys and restores an abandoned villa in the spectacular Tuscan countryside. In evocative language, she brings the reader along as she discovers the beauty and simplicity of life in Italy. Mayes also creates dozens of delicious seasonal recipes from her traditional kitchen and simple garden, all of which she includes in the book. Doing for Tuscany what M.F.K. Fisher and Peter Mayle did for Provence, Mayes writes about the tastes and pleasures of a foreign country with gusto and passion.",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "The Money Class: Learn to Create Your New American Dream",
        "Authors": "By Orman, Suze",
        "Description": "What does it take to create your New American Dream? Suze Orman, the woman millions of Americans have turned to for financial advice, says it’s time for a serious reconsideration of the American Dream—what promise it still holds, what aspects are in need of revision, and how it must be refashioned to fit our lives so that we can once again have faith that our hard work will pay off and that a secure and hopeful future is within our reach. In nine electrifying chapters, Orman delivers a master class on personal finance for this pivotal moment in time. She addresses every aspect of the American Dream—home, family, career, retirement. She teaches us that in order to create lasting security we must learn to stand in our truth. We must recognize, embrace, and be honest about what is real for us today and allow that understanding to inform the choices we make.  The New American Dream is not the things we accumulate, says Orman, but the confidence that comes from knowing that which we’ve worked so hard for cannot be taken away from us. In THE MONEY CLASS, Orman teaches us how to take control over our present—right here, right now—in order to build the future of our dreams.  Whether navigating the complicated mix of money and family, offering the most comprehensive retirement resource available today, or delivering a bracing dose of reality when it comes to recalibrating our expectations and our goals, Orman educates us with her signature no-nonsense approach and laser-like clarity. She empowers us to live a life of integrity and honesty that will create an enduring legacy for future generations—a New American Dream that lies in truth, security, financial freedom, and peace of mind.",
        "Category": " Business & Economics , Personal Finance , Money Management",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "The Social Animal: The Hidden Sources of Love, Character, and Achievement",
        "Authors": "By Brooks, David",
        "Description": "With unequaled insight and brio, David Brooks, the New York Times columnist and bestselling author of Bobos in Paradise, has long explored and explained the way we live. Now, with the intellectual curiosity and emotional wisdom that make his columns among the most read in the nation, Brooks turns to the building blocks of human flourishing in a multilayered, profoundly illuminating work grounded in everyday life.This is the story of how success happens. It is told through the lives of one composite American couple, Harold and Erica—how they grow, push forward, are pulled back, fail, and succeed. Distilling a vast array of information into these two vividly realized characters, Brooks illustrates a fundamental new understanding of human nature. A scientific revolution has occurred—we have learned more about the human brain in the last thirty years than we had in the previous three thousand. The unconscious mind, it turns out, is most of the mind—not a dark, vestigial place but a creative and enchanted one, where most of the brain’s work gets done. This is the realm of emotions, intuitions, biases, longings, genetic predispositions, personality traits, and social norms: the realm where character is formed and where our most important life decisions are made. The natural habitat of The Social Animal. Drawing on a wealth of current research from numerous disciplines, Brooks takes Harold and Erica from infancy to school; from the “odyssey years” that have come to define young adulthood to the high walls of poverty; from the nature of attachment, love, and commitment, to the nature of effective leadership. He reveals the deeply social aspect of our very minds and exposes the bias in modern culture that overemphasizes rationalism, individualism, and IQ. Along the way, he demolishes conventional definitions of success while looking toward a culture based on trust and humility.The Social Animal is a moving and nuanced intellectual adventure, a story of achievement and a defense of progress. Impossible to put down, it is an essential book for our time, one that will have broad social impact and will change the way we see ourselves and the world.",
        "Category": " Psychology , Social Psychology",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "The Doctor Digs a Grave",
        "Authors": "By Hathaway, Robin",
        "Description": "When the somewhat unfashionable physician Andrew Fenimore spots a teenage boy trying unsuccessfully to bury his beloved cat in Philadelphia's posh Society Hill, he befriends the lonely youth and leads him to what is rumored to be an ancient Indian burial ground of the Lenape Indians.The two stumble across a body while digging, but this is not what surprises them. The young woman who is buried there is sitting in an upright position and facing east, as is customary with the Lenape, but her death is obviously a very recent one.When the identity of the woman is discovered to be that of the fiancee of an old colleague's son, Fenimore quickly finds himself buried in the investigation to uncover the cause of the woman's untimely death.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Live Long Live Rich: Creating Your Retirement Paycheck with Award Winning Retirement Planning",
        "Authors": "By Rappaport, H. Craig",
        "Description": "Live Long Live Rich is the first guide for people who want to know how to invest to create retirement income. Retirement is a new chapter in your life and should be a time free from worry. Live Long Live Rich provides the tools and practical advice you'll need to enjoy this time of your life like no other. Every word of this book was written with that in mind. For 20 years H Craig Rappaport has been helping individuals with retirement income planning. Rappaport is a graduate of Northeastern University with a degree in Finance and an Accredited Wealth Management Advisor from the University of Pennsylvania, Wharton School. He is a Financial Planning Specialist, A Guided Portfolio Manager, and a National Football League Players Association Advisor. Specializing in retirement, Rappaport has appeared in the Wall Street Journal, Fox News, CNN Headline News, The Dow Jones News Service as well as many television shows, magazines and newspapers. He has created the Rappaport Retirement Index with guidance from the U.S. Bureau of Labor and Statistics for use as a guide to income planning. Rappaport's unique ability to explain complex investments in simple, easy to understand terms has kept the media coming back time and time again and is why he has written Live Long Live Rich, which is quickly becoming the investors' \"Income Bible.\" The included software has won the following awards from PC World and Readers Digest, who included it in their list of \"Best Retirement Planning Software\" . Family PC Magazine calls it \"a top notch product\" Bloomberg Personal Finance says it's an \"easy to use retirement planner\" Barrons refers to it as \"a good simple tool\" Life Insurance Magazine describes it as \"fastand intuitive.\" Retirement Planner is a snap to use and may represent the leading edge in a new kind of illustrative software. The user will \"get\" everything right away.\"",
        "Category": " Business & Economics , Personal Finance , Retirement Planning",
        "Publisher": "Dog Ear Publishing, LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Grassland",
        "Authors": "By Sayre, April Pulley",
        "Description": "Explores the physical characteristics, climate, plants and animals of the world's grasslands, details the effect of human activity, and features hands-on projects and information on preservation",
        "Category": " Juvenile Nonfiction , Science & Nature , General",
        "Publisher": "21st Century",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "The Company We Keep: A Husband-and-Wife True-Life Spy Story",
        "Authors": "By Baer, Robert and Baer, Dayna",
        "Description": "Robert Baer was known inside the CIA as perhaps the best operative working the Middle East. Over several decades he served everywhere from Iraq to New Delhi and racked up such an impressive list of accomplishments that he was eventually awarded the Career Intelligence Medal.  But if his career was everything a spy might aspire to, his personal life was a brutal illustration of everything a spy is asked to sacrifice. Bob had few enduring non-work friendships, only contacts and acquaintances. His prolonged absences destroyed his marriage, and he felt intense guilt at spending so little time with his children. Sworn to secrecy and constantly driven by ulterior motives, he was a man apart wherever he went. Dayna Williamson thought of herself as just an ordinary California girl -- admittedly one born into a comfortable lifestyle.  But she was always looking to get closer to the edge.  When she joined the CIA, she was initially tasked with Agency background checks, but the attractive Berkeley graduate quickly distinguished herself as someone who could thrive in the field, and she was eventually assigned to “Protective Operations” training where she learned to handle weapons and explosives and conduct high-speed escape and evasion. Tapped to serve in some of the world's most dangerous places, she discovered an inner strength and resourcefulness she'd never known -- but she also came to see that the spy life exacts a heavy toll.  Her marriage crumbled, her parents grew distant, and she lost touch with friends who'd once meant everything to her. When Bob and Dayna met on a mission in Sarajevo, it wasn't love at first sight. They were both too jaded for that. But there was something there, a spark. And as the danger escalated and their affection for each other grew, they realized it was time to leave “the Company,” to somehow rediscover the people they’d once been. As worldly as both were, the couple didn’t realize at first that turning in their Agency I.D. cards would not be enough to put their covert past behind.  The fact was, their clandestine relationships remained.  Living as “civilians” in conflict-ridden Beirut, they fielded assassination proposals, met with Arab sheiks, wily oil tycoons, terrorists, and assorted outlaws – and came perilously close to dying.  But even then they couldn’t know that their most formidable challenge lay ahead. Simultaneously a trip deep down the intelligence rabbit hole – one that shows how the “game” actually works, including the compromises it asks of those who play by its rules -- and a portrait of two people trying to regain a normal life, The Company We Keep is a masterly depiction of the real world of shadows.",
        "Category": " Political Science , Intelligence & Espionage",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "Rehnquist: A Personal Portrait of the Distinguished Chief Justice of the United States",
        "Authors": "By Obermayer, Herman",
        "Description": "\"This book is a final act of posthumous loyalty. Without it, history will have an incomplete -- and I believe unbalanced -- picture of the remarkable man who was the sixteenth chief justice of the United States, a man I was proud to call my friend.\"  ? ? ?   The impact of Chief Justice William Rehnquist -- who served as a Supreme Court justice for a third of a century and headed the federal judiciary under four presidents -- cannot be overstated. His dissenting opinion in Roe v. Wade, and his strongly stated positions on issues as various as freedom of the press, school prayer, and civil rights, would guarantee his memory on their own. Chiefly, though, William Rehnquist will always be remembered for his highly visible role in two of the most important and contentious political events of recent American history: the impeachment trial of President Bill Clinton in 1999 and the Supreme Court's decision that made George W. Bush the victor in the presidential election of 2000.   Despite his importance as a public figure, however, William Rehnquist scrupulously preserved his private life. And while his judicial opinions often inflamed passions and aroused both ire and praise, they were rarely personal. The underlying quirks, foibles, and eccentricities of the man were always under wraps.   Now, however, journalist Herman J. Obermayer has broken that silence in a memoir of their nineteen-year friendship that is both factually detailed and intensely moving, his own personal tribute to his dearest friend. In these pages, we meet for the first time William Rehnquist the man, in a portrait that can only serve to enhance the legacy of a Chief Justice who will be remembered in history as being among America's most influential.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Threshold Editions",
        "Price Starting With ($)": "26.96",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "All the Time in the World: New and Selected Stories",
        "Authors": "By Doctorow, E. L.",
        "Description": "From Ragtime and Billy Bathgate to World’s Fair, The March, and Homer & Langley, the fiction of E. L. Doctorow comprises a towering achievement in modern American letters. Now Doctorow returns with an enthralling collection of brilliant, startling short fiction about people who, as the author notes in his Preface, are somehow “distinct from their surroundings—people in some sort of contest with the prevailing world”. A man at the end of an ordinary workday, extracts himself from his upper-middle-class life and turns to foraging in the same affluent suburb where he once lived with his family. A college graduate takes a dishwasher’s job on a whim, and becomes entangled in a criminal enterprise after agreeing to marry a beautiful immigrant for money. A husband and wife’s tense relationship is exacerbated when a stranger enters their home and claims to have grown up there. An urbanite out on his morning run suspects that the city in which he’s lived all his life has transmogrified into another city altogether. These are among the wide-ranging creations in this stunning collection, resonant with the mystery, tension, and moral investigation that distinguish the fiction of E. L. Doctorow. Containing six unforgettable stories that have never appeared in book form, and a selection of previous Doctorow classics, All the Time in the World affords us another opportunity to savor the genius of this American master.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "Search: Winning Strategies to Get Your Next Job in the Nonprofit World",
        "Authors": "By Slesinger, Larry",
        "Description": "",
        "Category": " Business & Economics , Strategic Planning",
        "Publisher": "Piemonte Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Every Last One: A Novel (Random House Reader's Circle)",
        "Authors": "By Quindlen, Anna",
        "Description": "Mary Beth Latham has built her life around her family, around caring for her three teenage children and preserving the rituals of their daily life. When one of her sons becomes depressed, Mary Beth focuses on him, only to be blindsided by a shocking act of violence. What happens afterward is a testament to the power of a woman’s love and determination, and to the invisible lines of hope and healing that connect one human being to another. Ultimately, as rendered in Anna Quindlen’s mesmerizing prose, Every Last One is a novel about facing every last one of the things we fear the most, about finding ways to navigate a road we never intended to travel.",
        "Category": " Fiction , Literary",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "Fodor's The Carolinas & Georgia (Full-color Travel Guide)",
        "Authors": "By Bigner, Melissa, Anderson, Christine, Bevington, Elizabeth Rickey, Biro, Liz, and Coy, Mary",
        "Description": "Customize your trip with simple planning tools • Convenient overview of each region and its highlights • Top experiences and attractions • Easy-to-read color regional mapsExplore Atlanta, Charleston, the Outer Banks, and beyond • Discerning Fodor’s Choice picks for hotels, restaurants, sights, and more • “Word of Mouth” tips from fellow Fodor’s travelers • Illustrated features on plantations, architecture in Charleston, the Great Smoky Mountains, and the Civil War • Best beaches, scenic drives, and barbecue joints. Opinions from destination experts • Fodor’s writers reveal their favorite local haunts • Frequently updated to provide the latest information",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "April",
            "Year": "2011"
        }
    },
    {
        "Title": "The Godfather of Kathmandu: A Royal Thai Detective Novel (4) (Royal Thai Detective Novels)",
        "Authors": "By Burdett, John",
        "Description": "John Burdett's famed Royal Thai detective Sonchai Jitpleecheep is put to the test both as a Buddhist and as a cop as he confronts the most shocking crime of his career. A rich American film director has been murdered. It is an intriguing case, and solving it could lead to a promotion for Sonchai, but, as always, he is far more concerned with the state of his karma than he is with his status in the earthly realm. To complicate matters his boss, Colonel Vikorn, has decided to make Sonchai his consigliere in a heroin smuggling operation. Sonchai travels to Kathmandu to meet Vikorn's connection Tietsin, a Tibetan Buddhist monk, and falls under the sway of this dark and charismatic guru.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Vintage Crime/Black Lizard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2011"
        }
    },
    {
        "Title": "The Bird Sisters: A Novel",
        "Authors": "By Rasmussen, Rebecca",
        "Description": "When a bird flies into a window in Spring Green, Wisconsin, sisters Milly and Twiss get a visit. Twiss listens to the birds' heartbeats, assessing what she can fix and what she can't, while Milly listens to the heartaches of the people who've brought them. These spinster sisters have spent their lives nursing people and birds back to health. But back in the summer of 1947, Milly and Twiss knew nothing about trying to mend what had been accidentally broken. Milly was known as a great beauty with emerald eyes and Twiss was a brazen wild child who never wore a dress or did what she was told. That was the summer their golf pro father got into an accident that cost him both his swing and his charm, and their mother, the daughter of a wealthy jeweler, finally admitted their hardscrabble lives wouldn't change. It was the summer their priest, Father Rice, announced that God didn't exist and ran off to Mexico, and a boy named Asa finally caught Milly's eye. And, most unforgettably, it was the summer their cousin Bett came down from a town called Deadwater and changed the course of their lives forever. Rebecca Rasmussen's masterfully written debut novel is full of hope and beauty, heartbreak and sacrifice, love and the power of sisterhood, and offers wonderful surprises at every turn.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2011"
        }
    },
    {
        "Title": "Celebrating Silence",
        "Authors": "By Shankar, Sri Sri Ravi",
        "Description": "",
        "Category": "",
        "Publisher": "Art of Living Foundation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Hearts Touched by Fire: The Best of Battles and Leaders of the Civil War (Modern Library)",
        "Authors": "By Holzer, Harold (EDT), McPherson, James M. (ADP), Robertson, James I. Jr (ADP), Sears, Stephen W. (ADP), and Symonds, Craig L. (ADP)",
        "Description": "In July 1883, just a few days after the twentieth anniversary of the Battle of Gettysburg, a group of editors at The Century Magazine engaged in a lively argument: Which Civil War battle was the bloodiest battle of them all? One claimed it was Chickamauga, another Cold Harbor. The argument inspired a brainstorm: Why not let the magazine’s 125,000 readers in on the conversation by offering “a series of papers on some of the great battles of the war to be written by officers in command on both sides.”  The articles would be written by generals, Union and Confederate alike, who had commanded the engagements two decades earlier—“or, if he were not living,” by “the person most entitled to speak for him or in his place.” The pieces would present both sides of each major battle, and would be fair and free of politics. In commemoration of the 150th anniversary of the Civil War, the most enduring entries from the classic four-volume series Battles and Leaders of the Civil War have now been edited and merged into one definitive volume. Here are the best of the immortal first-person accounts of the Civil War originally published in the pages of The Century Magazine more than a hundred years ago. Hearts Touched by Fire offers stunning accounts of the war’s great battles written by the men who planned, fought, and witnessed them, from leaders such as General Ulysses S. Grant, General George McClellan, and Confederate captain Clement Sullivane to men of lesser rank. This collection also features new year-by-year introductions by esteemed historians, including James M. McPherson, Craig L. Symonds, and James I. Robertson, Jr., who cast wise modern eyes on the cataclysm that changed America and would go down as the bloodiest conflict in our nation’s history. No one interested in our country’s past will want to be without this collection of the most popular and influential first-person Civil War memoirs ever published.",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "Modern Library",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "April",
            "Year": "2011"
        }
    },
    {
        "Title": "Unlimited: How to Build an Exceptional Life",
        "Authors": "By Michaels, Jillian",
        "Description": "Imagine. Believe. Achieve.Many self-help books offer a lot of new age platitudes and sappy mantras: Just love yourself. See the glass as half full. Believe it and it will come.Really? That’s not how it works, and you know it. A lifetime’s worth of struggle is not overturned in a small moment of positive thinking. But if you have the right attitude—attitude and skills—you can and will accomplish anything and everything you want. This book gives you both, attitude and action. By its end you will have all the tools you need to change your life. No hype. No false promises. You will learn to:• Cultivate your passion and embrace your uniqueness to create a purpose-filled life . . .on your own terms. • Transform your suffering into peace, wisdom, and strength.• Work through fear, worry, shame, and negative self-talk to blast through obstacles and create self-confidence, self-esteem, and a healthy self-image. • Take powerful, informed, deliberate actions to make your dreams a reality.Forget surviving: it’s your time to thrive. You do have the ability and potential to achieve unlimited health, wealth, and happiness. Getting there won’t all be easy—nothing worthwhile ever is—but take this journey and your life will change dramatically. Your possibilities are unlimited, and your life is waiting for you to break free and claim it",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2011"
        }
    },
    {
        "Title": "The Joy of Laziness: Why Life Is Better Slower -- and How to Get There",
        "Authors": "By Axt, Peter and Axt-Gadermann, Michaela",
        "Description": "This surprise bestseller in Germany will change work and play habits -- and lives. It contradicts much popular thinking about how to lead a long, healthy and happy life, and it does so based on scientifically grounded arguments and research which shows that the key to good health, success and longevity is the CONSERVATION of life energy.On the basis of the scientifically recognized Metabolic Theory, this book develops a program that can work for everyone. It explains the scientific correlation between life energy and longevity in an easy-to-understand way. The authors have found through their research that older but hearty and active people often do not follow the regimen we have believed was the secret to a long life. They are calm in every situation; they enjoy life, play sports in moderation, eat little and do not waste their valuable life energy. They are not excessively ambitious. All this seems to be the secret to vitality and good health.The book contains valuable tips and advice for everyone who wants to stay healthy and live longer, energy-saving suggestions about eating, working and exercising, and quizzes to test your stress level, life energy and physical well-being.",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Hunter House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "44 Charles Street: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "A magical transformation takes place in Danielle Steel’s luminous new novel: strangers become roommates, roommates become friends, and friends become a family in a turn-of-the-century house in Manhattan’s West Village. The plumbing was prone to leaks, the furniture rescued from garage sales. And every square inch was being devotedly restored to its original splendor—even as a relationship fell to pieces. Now Francesca Thayer, newly separated from her lawyer boyfriend Todd, is desperate. The owner of a struggling art gallery, and suddenly the sole mortgage payer on her Greenwich Village townhouse, Francesca does the math and then the unimaginable. She puts out an advertisement for boarders. Soon her house becomes a whole new world.First comes Eileen, a fresh, pretty L.A. transplant, now a New York City schoolteacher. Then there’s Chris, a young father struggling with a troubled ex-wife and the challenge of parenting a seven-year-old son who visits every other weekend. The final tenant is Marya, a celebrated cookbook author hoping to start a new chapter in her life after the death of her husband. As Francesca’s art gallery begins to find its footing and Todd moves on to another woman, she discovers that her accidental tenants have become the most important people in her life. As the roommates bond, and the house fills with the aroma of Marya’s exquisite cuisine, there are shadows as well as light. Naïve Eileen explores the precarious boundaries of online dating with a series of strangers. Chris’s custody fight for his son escalates to devastating levels. Marya faces an unexpected choice that will take her into untested waters. And Francesca herself will contemplate what had seemed impossible: opening her heart once more.Over the course of one amazing, unforgettable, ultimately life-changing year, the house at 44 Charles Street fills with laughter, heartbreak, and, always, hope. In the hands of master storyteller Danielle Steel, it’s a place those who visit will never want to leave.",
        "Category": " Fiction , Women",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2011"
        }
    },
    {
        "Title": "Pythons (Complete Pet Owner's Manuals)",
        "Authors": "By Bartlett, Patricia Pope and Wagner, Ernie",
        "Description": "There are approximately two dozen different varieties of this large, nonpoisonous constrictor snake, and the most important collectors' breeds are shown and described in this book. Information for owners includes instructions on safe handling, maintaining a healthful environment, feeding, protection against parasites, and general health care.",
        "Category": " Pets , Reptiles, Amphibians & Terrariums",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Out of Thin Air: The Origin of Species",
        "Authors": "By Shawn Boonstra",
        "Description": "",
        "Category": "",
        "Publisher": "It is written",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Microsoft? Office for Windows? For Dummies?: Quick Reference",
        "Authors": "By Lowe, Doug",
        "Description": "Fun, Fast & Cheap!®A Quick Reference for the Rest of Us!® Looking for the fastest, easiest way to remember all those Microsoft Office features and commands? Your search has ended! Just keep Microsoft® Office For Windows® 95 For Dummies® Quick Reference by your side and watch as the answers to everyday questions appear at your fingertips. This easy-to-use reference guides you through all the features of Microsoft Office for Windows 95, including Word, Excel, PowerPoint, Access, and Schedule+, as well as all those Applet programs that come with Office ? WordArt, OrgChart, Equation Editor, and ClipArt Gallery. As a bonus, Doug devotes a section to demystifying the steps that make Office programs work together! Now you can find what you need even faster with our ?For Dummies® Quick References! The design features tasks and commands in alphabetical order, step-by-step instructions, and easy-to-follow advice. Get \"in and out\" quickly and get the information you really need without reading lots of material! Look for IDG Books Worldwide's Microsoft® Office For Windows® 95 For Dummies® for even more information on using Microsoft Office! ?For Dummies Quick References® and ?For Dummies® books are available on all your favorite or not-so-favorite hardware and software products. Look for them wherever computer books are sold!",
        "Category": " Computers , Enterprise Applications , General",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "A Father's Reward",
        "Authors": "By MacGregor, Jerry and Downer, Phil",
        "Description": "",
        "Category": " Religion , Christianity , General",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "A Chef's Tale: A Memoir of Food, France and America",
        "Authors": "By Franey, Pierre, Miller, Bryan, and Flaste, Richard",
        "Description": "Pierre Franey: embodiment of the art and the pleasures of French cookery, and for four decades one of the most influential and beloved of America's culinary figures. His memoir reflects his relish for life as well as his mastery of his profession.Before he created his \"60-Minute Gourmet\" column in the New York Times, before he wrote his celebrated (and best-selling) cookbooks, and before he entered our homes via television, Pierre Franey presided over the cuisine at two of the greatest French restaurants ever to be opened in America - as executive chef first of the legendary Le Pavillon, then of La Cote Basque.And now, with style, charm and affection for his native France and adopted America, Franey takes us into his life in the world of food, interweaving his story with irresistible recipes and, here and there, impulsively giving away a chef's secrets.He takes us into his childhood in Burgundy, where the bountiful produce and the high respect accorded to the preparation of food grounded Franey in a tradition that would serve him well when he began his apprenticeship at age fourteen in Paris restaurants - the first level of his classical training.The lessons he learned there - the simple artistry that results in a fine omelette, the importance of a well-organized kitchen, the esthetics of texture and color and combination of flavors - are as valuable today as ever. And as Franey reveals the essence of French country food - civet de lapin, boeuf en daube, sole meuniere - we begin to understand cooking fundamentals as the masters do.Franey escorts us around prewar Paris as he tells the story of his coming of age in (and out of) the kitchen, and of his true professional beginnings at the fabled Drouant. He shows us the great 1939 New York World's Fair, where Le Pavillon was born. He relives the days of America's French food revolution and speaks with gusto about such celebrated culinary figures as the incomparable Henri Soule, and Craig Claiborne, his longtime collaborator. He has written a book that charms while it adds immeasurably to our sophistication about the great world of French cooking - and about cooking itself.",
        "Category": " Cooking , Regional & Ethnic , French",
        "Publisher": "knopf",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Ideals of Beauty: Asian and American Art in the Freer and Sackler Galleries (World of Art)",
        "Authors": "By Thames & Hudson Inc. (COR)",
        "Description": "\"For admirers of Asian and American art or visitors to the Smithsonian museums, this beautifully illustrated book offers an enticing taste of the Galleries' rich and diverse holdings - a curator-led tour through more than one hundred masterworks: American, Ancient Near East, Chinese, Indian, Islamic, Japanese, Korean and Southeast Asian, including ceramics, biblical manuscripts, photography and other works of art. The Freer Gallery of Art and Arthur M. Sackler Gallery in Washington, DC, comprise the Smithsonian Institution's national museums of Asian art. The two museums are physically linked and also ideologically linked in their commitment to the study, exhibition and preservation of Asian art. The Freer Gallery also contains an important collection ofnineteenth-century American art, featuring James McNeill Whistler's fantastic blue-and-gold Peacock Room, perhaps one of the earliest art installations on record. Sections on the museums' conservation and scientific research activities, archives and libraries highlight the Galleries' scholarly undertakings.\"--Publisher's description.",
        "Category": " Art , Collections, Catalogs, Exhibitions , General",
        "Publisher": "Thames & Hudson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "The Dark Ascent",
        "Authors": "By Hunt, Walter H.",
        "Description": "Walter Hunt's debut novel The Dark Wing was favorably compared to Ender's Game, Babylon 5, Honor Harrington, and C.S. Forester. The publication of the second volume The Dark Path was heralded by Analog as \"a quest that may well prove science fiction's version of The Lord of the Rings.\"     The Dark Ascent  The war with the zor is long over, and Admiral Marais, the legendary \"Dark Wing\" is long dead, though some of his companions on that campaign of xenocide still remain, and in the alien philosophies of the past their might exist man's hope for salvation in the very near future. The Dark Path introduced a new alien force into the delicate balance of power ¿ one that was the actual puppetmaster of the human-zor war and now wishes to bring both worlds under its madness inducing shadow. But the same ancient philosophy of the zor race that prophesized \"the Dark Wing\" has also foreseen a hero that will meet the new menace - a hero now mystically embodied in a rebellious space commodore by the name of Jackie Lappierre. As armadas clash and outposts fall, the overly confident alien menace is forced to confront a zor human alliance that has been warned, their covert and insidious plans of infiltration now exposed. ¿ though victory is hardly ascertained for either side in The Dark Ascent.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "24.33",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Tree Witch",
        "Authors": "By Viereck, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "Charles Scribner's Sons",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Dancing Teepees",
        "Authors": "By Gammell, Stephen (ILT) and Sneve, Virginia Driving Hawk (EDT)",
        "Description": "A selection of native American poems stemming from the oral tradition incorporates contemporary tribal poetry and poems of the elders--all of which focus on the theme of youth from birth through adolescence",
        "Category": " Juvenile Fiction , People & Places , United States , General",
        "Publisher": "Holiday House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Improve Your Writing",
        "Authors": "By Fry, Ronald W.",
        "Description": "Improve Your Writing, now in an updated and expanded edition that covers online research, walks students step-by-step through the process of creating effective research papers and oral reports. Every element of the writing process is covered including selecting a topic, library and online research, developing an outline, writing from the first draft to the final draft, proofreading and much, much more.",
        "Category": " Language Arts & Disciplines , Writing , General",
        "Publisher": "Delmar Cengage Learning",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "French: How to Speak and Write It: An informal conversational method for self study with 400 illustrations (English and French Edition)",
        "Authors": "By Lemaitre, J.",
        "Description": "Probably the most delightful, useful, and comprehensive elementary book available for learning spoken and written French, either with or without a teacher. Working on the principle that a person learns more quickly by example then by rule, Lemaître has assembled colloquial French conversations on a variety of subjects, as well as grammar, vocabulary, and idiom studies. Index.",
        "Category": " Foreign Language Study , French",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1962"
        }
    },
    {
        "Title": "Nail Decorating",
        "Authors": "By bettina-grabis-paul-maassen-andrea-leupers",
        "Description": "",
        "Category": "",
        "Publisher": "Mud Puddle Books, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Lower Your Taxes - Big Time! 2007-2008 Edition",
        "Authors": "By Botkin, Sandy",
        "Description": "Lower Your Taxes-Big Time! helps you to legally and dramatically cut taxes by establishing yourself as independent contractors or businessperson-writing off everything from vacations to movies and plays, and receiving a subsidy of $5,000 or more from the IRS every year.“Will put thousands of dollars in your pocket every year.”-Mark Victor Hansen, Co-creator,Chicken Soup for the Soul®Updated to reflect recent and upcoming changes in the U.S. tax lawOne of the top best tax books according to Entrepreneur magazine",
        "Category": " Business & Economics , Personal Finance , Taxation",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Virginia Wine Country III",
        "Authors": "By Hilde Gabriel Lee",
        "Description": "",
        "Category": "",
        "Publisher": "Hildesigns Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "A Little Light Magic",
        "Authors": "By Nash, Joy",
        "Description": "Longing for a family and someone to share her life with, Tori Morgan, a tarot card reader, finds love with the most unlikely of prospects--a hardheaded contractor who believes that family is more like a curse due to his kleptomaniac grandmother, menopausal mother, and boy-crazy daughter. 175,000 first printing. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Timpson's Other England",
        "Authors": "By JOHN TIMPSON",
        "Description": "",
        "Category": "",
        "Publisher": "Jarrold",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Blessings of the Cross",
        "Authors": "By Billy Graham",
        "Description": "",
        "Category": "",
        "Publisher": "J. Countryman",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Online Poker: Your Guide to Playing Online Poker Safely & Winning Money",
        "Authors": "By Brunson, Doyle",
        "Description": "A fast and powerful way to win money online or play for free. Ten compelling chapters show you how to get started, explain the safety features which lets you play worry-free, and lets you in on the strategies that Doyle himself uses to beat players in cyberspace. Poker is poker, as Doyle explains, but there are also strategies that only apply to the online version, where the players are weaker!-and Doyle reveals them all in this book.",
        "Category": " Games & Activities , Card Games , Poker",
        "Publisher": "Cardoza",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Flowers Are Almost Forever",
        "Authors": "By Oliver, Libbey",
        "Description": "Presents tips and techniques on ways to extend the life of cut flowers",
        "Category": " Crafts & Hobbies , Flower Arranging",
        "Publisher": "Brandylane",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Grandpa and Me: Grandpa and Me (Lift-The-Flap Book (Little Simon))",
        "Authors": "By Katz, Karen",
        "Description": "Everyone is excited when Grandpa comes for a visit, in a special tribute to grandfathers and their bond with their grandchildren that includes numerous lift-the-flaps, bold illustrations, and simple text.",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Caleb's Story (Sarah, Plain and Tall, 3)",
        "Authors": "By MacLachlan, Patricia",
        "Description": "The third book in the series that began with the Newbery Medal–winning Sarah, Plain and Tall by Patricia MacLachlan.Anna has done something terrible. She has given me a journal to fill.\"It's your job now,\" Anna says as she hands Caleb her journals, asking him to continue writing the family story. But Sarah, Jacob, Anna, Caleb, and their new little sister, Cassie, have already formed a family, and Caleb fears there will be nothing left to write about. That is, before Cassie discovers a mysterious old man in the barn, and everything changes. Everyone is excited about the arrival of a new family member—except for Jacob, who holds a bitter grudge. Only the special love of Caleb, and the gift he offers, can help to mend the pain of the past.",
        "Category": " Juvenile Fiction , Family , Blended Families",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Readings on Catholics in Political Life",
        "Authors": "By TAASK FORCE ON CATHOLIC BISHOPS",
        "Description": "",
        "Category": "",
        "Publisher": "USCCB Publishing",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Raising Financially Fit Kids",
        "Authors": "By Godfrey, Joline",
        "Description": "Is your child a spendthrift? A hoarder? Or maybe, downright oblivious? Are there family money dramas you can do without? In RAISING FINANCIALLY FIT KIDS, Joline Godfrey, one of the country?s leading experts on kids, parents, and money, gives parents the secrets and knowledge she has gleaned from a decade of working with kids on financial literacy and business. At the heart of the book lies a defined set of values:Money is a tool for achieving and maintaining independence. Saving is good; accumulation for its own sake is not. Spending is best done wisely and within one?s means (though a bold purchase or investment may also be an act of wisdom). Greed is not good. Giving generously is part of one?s responsibility to the human family; shepherding wealth is an act of respect?to the past and the future. Money is an energy (not a commodity) that can be used for evil or for good.Designed for adults?parents, grandparents, mentors, advisors, and educators?concerned about raising children ages 5 to 18, RAISING FINANCIALLY FIT KIDS is centered around a developmental map covering ten specific money skills each child can master by the age of 18 to become a financially secure adult. This map gives parents a step-by-step approach to helping their kids become habitual savers, smart money mangers, and responsible decision makers. More than just a money book, RAISING FINANCIALLY FIT KIDS will help parents send their children into the world as balanced, financially stable individuals and contributing members of both their family and community.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "The Passover Journey: A Seder Companion",
        "Authors": "By Waldman, Neil (ILT) and Goldin, Barbara Diamond",
        "Description": "The author of Cakes and Miracles uses a question-and-answer format to place Passover Seder rituals in their historical context, while songs, games, and other activities make the story of the Israelites' journey accessible.",
        "Category": " Juvenile Nonfiction , Religion , General",
        "Publisher": "Viking Juvenile",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Becoming a Mother",
        "Authors": "By Theodore R. Seidman, M.D., Marvin H. Albert",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "7.07",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "A Hard Man Is Good To Find",
        "Authors": "By Blackwood, Jane",
        "Description": "When renowned but stern editor Harry Crandall arrives at the small-town newspaper of Jamie McClane, the enterprising young reporter sets out to discover why her boss has landed in the boondocks, and whether he intends to get the scoop on her heart. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Zebra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Country Living Decorating Style",
        "Authors": "By Soriano, Nancy Mernit (FRW) and Murphy, Rhoda Jaffin",
        "Description": "The fusion of beauty and function is the new approach to sophisticated country style.  It incorporates design elements from a variety of heritages and trends, expanding the notion of country to include different national and ethnic fashions.  Along with “traditional” elements like baskets and flowers are fresh suggestions and restorations that bring us up to date: think of a U.S. flag draped over a wooden bench in a foyer, or a large vase of sunflowers on a cherry table.",
        "Category": " House & Home , Decorating",
        "Publisher": "Hearst",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Diabetes Danger: What 200 Million Americans at Risk Need to Know",
        "Authors": "By Bortz, Walter M., II",
        "Description": "This comprehensive book provides much-needed information on the horrifying dangers of uncontrolled diabetes. This is an essential guide for diabetics, their caregivers or anyone who has diabetes in their family. Diabetes Danger also provides crucial advice for those seeking to prevent a diabetes outbreak of epidemic proportions.Among the important questions Dr. Bortz addresses in Diabetes Danger:. What is diabetes, and how did it grow from an almost unknown disease to today's epidemic?. How does our genetic makeup combined with the modern lifestyle almost guarantee that an American will contract diabetes?. Why doctors don't prescribe the best treatment for the disease?. Why can't drugs cure it? . Can watching television increase diabetes risk?. What steps can you take to save your body from physical ruin?Dr. Bortz's book offers hope, showing steps that should be taken to quench the fire of diabetes. He also gives potential strategies to reverse diabetes' symptoms once the dreaded disease has struck. Often, health maintenance rather than medical intervention is more effective in reining in this horrible disease.",
        "Category": " Health & Fitness , Diseases , Diabetes",
        "Publisher": "Select Books Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Jacey's Reckless Heart (Lawless Women)",
        "Authors": "By Porter, Cheryl Anne",
        "Description": "Fighting their desire from the start, Jacey Lawless and the dark, dashing Zant Chapelo are doomed by their fathers' rivalry, a family's vengeance, and a secret that can make them enemies forever, unless Zant transforms his life to claim Jacey's love. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Nat the crab (Collections for young scholars)",
        "Authors": "By Cary, Alice",
        "Description": "Nat can tap and snap and spin, but will he nap and play baseball?",
        "Category": "",
        "Publisher": "Open Court Pubg.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Night Before Summer Camp",
        "Authors": "By Wing, Natasha and Pierce, Mindy (ILT)",
        "Description": "The first day of summer camp is almost here, and one little camper doesn’t know what to expect. For a while everything is hunkydory . . . until rest time rolls around and he gets a bad case of nervous butterflies. But an unlikely friend appears out of the crowd and reassures him that the best cure for the summertime blues is tons of summertime fun! A sweetly reassuring story, once again told in verse to the meter of Clement Moore’s classic.",
        "Category": " Juvenile Fiction , Social Themes , New Experience",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Care-Free Plants",
        "Authors": "By Reader's Digest Association (EDT)",
        "Description": "A comprehensive and practical guide, perfect for any gardener, simplifies the gardening process by revealing the right plants for any situation and showing how to combine them to create a lush, flourishing garden with minimum maintenance.",
        "Category": " Gardening , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    }
]