[
    {
        "Title": "In Defense of American Liberties: A History of the ACLU",
        "Authors": "By Walker, Samuel",
        "Description": "Throughout the 1988 Presidential campaign, George Bush drew cheers from supporters by attacking Michael Dukakis's membership in the American Civil Liberties Union (ACLU), an organization that he charged was out of the \"mainstream\" of American life.  Indeed, throughout its history, the organization has championed some decidedly unpopular causes, including free speech rights for racist groups and due process for even the most vicious criminals.       But as Samuel Walker argues in his provocative new book--the first comprehensive history of the ACLU--the organization has played a leading role in shaping principles of individual freedom that are now a cornerstone of American law and the way all of us conceive of personal liberty.  It has been involved in most of the Supreme Court's landmark cases expanding individual rights, and today argues more cases before the Court than anyone but the federal government. In fact, as American Liberties makes clear, the organization has played a central role in creating that mythical American \"mainstream\" that its opponents so often invoke.       In fascinating detail, Walker recounts the ACLU's stormy history since its founding in 1920 to fight for free speech.  He explores its involvement in some of the most famous causes in American history, including the Scopes \"Monkey Trial,\" the internment of Japanese-Americans during World War II, the Cold War anti-Communist witch hunts, and the civil rights movement. And he examines its most famous personalities, such as its puritan and autocratic founder Roger Baldwin; Felix Frankfurter, a long-time member who later voted against many ACLU cases while a Supreme Court justice; and Morris Ernst, who won the landmark case involving James Joyce's Ulysses and led the ACLU to take up the cause of free expression for sexually-frank publications.       Walker deals candidly with the ACLU's less praiseworthy episodes--such as the expulsion of Elizabeth Gurley Flynn from the Board during the ACLU's anti-Communist phase, and he dissects the organization's constant struggle within itself to define the proper scope of civil liberties, revealing facts that will surprise even members of the ACLU.       As Walker's engrossing story demonstrates, the history of the ACLU embodies some of the most important changes in American society in the twentieth century.  The principles for which the organization has fought--such as free speech, fair play, equality, and privacy--are now accepted and cherished by Americans from all walks of life.",
        "Category": " Political Science , Civil Rights",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Dick Francis Treasury of Great Racing Stories",
        "Authors": "By Francis, Dick and Welcome, John",
        "Description": "Fourteen stories of horse racing spotlight the works of Beryl Markham, Arthur Conan Doyle, J.P. Marquand, Sherwood Anderson, and John Galsworthy",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "The E-Bomb: How America's New Directed Energy Weapons Will Change the Way Future Wars Will Be Fought",
        "Authors": "By Beason, Doug",
        "Description": "In science fiction, futuristic soldiers are often shown wielding light emitting weapons-Flash Gordon used a ray gun, Captain Kirk carried a phaser, and Darth Vader brandished a light saber. But, today, the imagined future of science fiction is soon to be a reality. After more than two decades of research, the United States is on the verge of deploying a new generation of weapons that discharge light-wave energy, the same spectrum of energy found in your microwave, or in your TV remote control. They're called \"directed-energy weapons\"-lasers, high-powered microwaves, and particle beams-and they signal a revolution in weaponry, perhaps, more profound than the atomic bomb. The first directed-energy (DE) weapons are being tested right now, and their deployment is planned in the very near future. In The E-Bomb, author J. Douglas Beason, Ph.D. and a leading U.S. expert in directed-energy research, will explain in clear and non technical prose these exotic new weapons and answer the questions that all Americans will ask: What is Directed Energy? How do DE weapons work? What can these DE weapons do? And are these weapons safe to use? As the once-imagined weapons of the future begin to appear on today's battlefields, the timely publication of The E-Bomb will help explain how and why the future is now.",
        "Category": " History , Military , Weapons",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Power and the Wisdom; an Interpretation of the New Testament",
        "Authors": "By John L. McKenzie.",
        "Description": "",
        "Category": "",
        "Publisher": "Bruce Publ.",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Worse Than Watergate: The Secret Presidency of George W. Bush",
        "Authors": "By Dean, John W.",
        "Description": "The former cousel to President Nixon provides a stinging critique of the current Bush administration, its obsession with secrecy, and its willingness to deceive the American people, emphasizing the president's emphasis on image over substance, mistrustful personality, imperial governing  and flawed decision making, and his abuses of national security secrecy. 75,000 first printing.",
        "Category": " Political Science , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Decline and Fall",
        "Authors": "By Waugh, Evelyn",
        "Description": "Subtitled \"A Novel of Many Manners, \" Evelyn Waugh's notorious first novel lays waste the \"heathen idol\" of British sportsmanship, the cultured perfection of Oxford, and the inviolable honor codes of the English gentleman.",
        "Category": " Fiction , Literary",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Shadow Warriors (Study in Command)",
        "Authors": "By Clancy, Tom, Koltz, Tony, and Stiner, Carl",
        "Description": "In his first two Commanders books, Tom Clancy teamed with armor and infantry General Fred Franks, Jr., and Air Force General Chuck Horner to provide masterful blends of history, biography, you-are-there narrative, insight into the practice of leadership, and plain old-fashioned storytelling. Shadow Warriors is all of that, and more, for in the words of Lieutenant General Bill Yarborough, \"There are itches that only Special Forces can scratch.\"  The training, resourcefulness, and creativity of the SF soldier make him capable of jobs that few other soldiers could handle, in situations where traditional arms and movement don't apply. Carl Stiner was only the second commander of SOCOM, the U.S. Special Operations Command, responsible for the readiness   of all the Special Operations forces of the Army, Navy, and Air Force, including the Green Berets, Navy SEALS, Rangers, Delta Force, Air Force Special Operations, PsyOps, and Civil Affairs.  Together, he and Clancy trace the transformation of the Special Forces from the small core of outsiders of the 1950s through the cauldron of Vietnam and to the rebirth of the SF in the late 1980s and 1990s as the bearer of the largest, most mixed, and most complex set of missions in the U.S. military. From Vietnam and Laos to Panama and El Salvador to Lebanon, Saudi Arabia, Kuwait, and Iraq, these are stories of raids, counterterrorism, hostage rescues, reconaissance, counterinsurgency and psychological operations ?and also of building settlements, teaching civilians, cleaning up water supplies, and saving lives. It is a front-row seat to a man, an institution, and a way both of war and peace that together make this an instant classic of military history.",
        "Category": " History , Military , Wars & Conflicts (Other)",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "8.78",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Baby Einstein: Sweet Dreams, Mimi",
        "Authors": "By Zaidi, Nadeem (ILT) and Aigner-Clark, Julie",
        "Description": "Children will delight in hearing and imagining all the wonderful sleepytime images Mimi's mama recites while tucking Mimi in for a night filled with the sweetest of dreams.",
        "Category": " Juvenile Fiction , Bedtime & Dreams",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Islamic Values in the United States: A Comparative Study",
        "Authors": "By Haddad, Yvonne Yazbeck and Lummis, Adair T.",
        "Description": "The religion of Islam is now an American phenomenon.  Once thought to be primarily a way of life of the Arabs and a faith alien to the Judeo-Christian heritage of this country, it has grown to be one of the most prominent and rapidly-growing religious movements in America.  This ethnography of immigrant Muslims considers five Northeastern communities in detail. Including numerous interviews with members of these communities, this investigation provides a highly personal look at what it means to be a believing, practicing Muslim in America at a time when Islam is under the critical scrutiny of international news.  The authors describe the institutions and leadership of American Islam, Muslim law, and its applications in the American context, examining the kinds of problems that beset Muslims trying to observe the elements of their faith in a potentially difficult environment. Family life and the roles and relationships of men and women are thoroughly detailed as well.",
        "Category": " Religion , Islam , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "The Iron Ring",
        "Authors": "By Alexander, Lloyd",
        "Description": "When Tamar, the young king of Sundari, loses a dice game, he loses everything--his kingdom, its riches, and even the right to call his life his own. His bondage is symbolized by the iron ring that appears mysteriously on his finger. To Tamar, born to the warrior caste, honor is everything. So he sets out on a journey to make good on his debt--and even to give up his life if necessary. And that journey leads him into a world of magic, where animals can talk, the foolish are surprisingly wise, and danger awaits...",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Immaculate Deception",
        "Authors": "By Pears, Iain",
        "Description": "From the acclaimed author of An Instance of the Fingerpost (\"may well be the best 'historical mystery' ever written,\" said The Boston Globe) comes a luminous new Jonathan Argyll/Flavia di Stefano crime novel set against the richly evocative backdrop of Rome and Tuscany.  In his first new novel since An Instance of the Fingerpost became an international bestseller, Iain Pears transports us to Rome, where an impudent thief has stolen a politically sensitive painting on loan from a foreign museum.  Summoned to see the prime minister, Flavia di Stefano, acting head of Italy's Art Theft Squad, is told to retrieve the painting without publicity or payment of ransom. But does the prime minister mean what he says? And why was this particular painting stolen? Faced with a case sure to cause her grief, Flavia turns to her mentor, General Taddeo Bottando, who has a wholly unexpected view of the situation.  Flavia's husband of four weeks, art historian Jonathan Argyll, is busy, meanwhile, with a mission of his own. As a gift to the soon-to-retire Bottando, Jonathan will track down the provenance of a small Renaissance painting, an Immaculate Conception, now hanging on Bottando's wall. Who owned the painting over the years, and how did it come into Bottando's hands?  Flavia's search for an art thief soon becomes a hunt for a killer, while Jonathan's probe uncovers some startling secrets and an unlikely alliance as poignant as it is surprising. Absorbing, witty, ingeniously plotted, The Immaculate Deception is stylish entertainment from a justly celebrated author.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "D Is for Dreidel",
        "Authors": "By Stone, Tanya Lee and Apperley, Dawn (ILT)",
        "Description": "D is for Dreidel Just twist it and spin If it stops on gimel Shout \"hooray,\" you win!  Children will love learning about Hanukkah in this dreidel-shaped alphabet book! Every page contains a letter of the alphabet along with sweet, rhyming text and words that correspond with that letter. And as an added bonus, at the end of the book is the complete story of Hanukkah! This is a fantastic introduction to the holiday!",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Hanukkah",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Great American wreaths: The best of Martha Stewart living",
        "Authors": "By Stewart, Martha",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Something Dangerous: A Novel",
        "Authors": "By Redmond, Patrick",
        "Description": "Kirkston Abbey is no place for weak or sensitive boys. Unsupervised bullies wreak their vengeance in the dormitories at night; cold, exacting professors reduce their students to tears in class. So Jonathan Palmer can't believe his good fortune when Richard Rokeby seeks out his friendship. Rokeby is everything Jonathan is not: wealthy, strong, handsome, aloof; even the teachers can't touch him. With Rokeby as his protector, for the first time since arriving at the school, Jonathan feels safe.But as the two boys grow closer and Rokeby's demands on the relationship intensify, Jonathan comes to realize that there is something not quite right about his new friend. Something a bit off-kilter. Something slightly unnatural. Something... dangerous.",
        "Category": " Fiction , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Secrets of Entertaining, 3rd: Pamper Your Guests, Your Home, and Yourself",
        "Authors": "By Greco, Gail",
        "Description": "",
        "Category": " Cooking , Entertaining",
        "Publisher": "Globe Pequot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Casa Rossa: A Novel",
        "Authors": "By Marciano, Francesca",
        "Description": "As Alina packs up the family belongings at their home, a magnificent farmhouse in Puglia, in preparation for its sale, she uncovers clues to her family's past, revealing the lives of three extraordinary Strada women--Grandmother Renee, who left her husband to flee to Nazi Germany; her mother Alba; and her sister Isabelle, who joined the Red Brigades in the 1970s. 35,000 first printing.",
        "Category": " Fiction , Literary",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Kitchens (Style to Go)",
        "Authors": "By Garskof, Josh",
        "Description": "Taunton's Best of Fine Homebuilding series collects and organizes the most useful articles from FINE HOMEBUILDING magazine by subject. Each book is filled with step-by-step articles written by professional builders who share their expertise to help readers achieve quality results. Here 27 articles by kitchen specialists give readers professional ideas and techniques for designing, building and remodeling the most complex room in a house.",
        "Category": " House & Home , Do-It-Yourself , Carpentry",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Saddam's Iraq: Face-Off in the Gulf",
        "Authors": "By Journalists of Reuters",
        "Description": "Reuters correspondents offer arguments for and against a United States-led war against Iraq, discussing likely outcomes, known risks, and the possible disruption of the balance of power in the Middle East.",
        "Category": " History , Military , Persian Gulf War (1991)",
        "Publisher": "Pearson P T R",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "The Possible Human",
        "Authors": "By Houston, Jean",
        "Description": "Provides a comprehensive program of exercises to arouse neglected or abused physical, mental, and creative abilities, to improve visual and auditory perception and memory and to engage unused inner resources",
        "Category": "",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1982"
        }
    },
    {
        "Title": "Phedre",
        "Authors": "By collectif",
        "Description": "",
        "Category": "",
        "Publisher": "Larousse",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Hidden History: Exploring Our Secret Past",
        "Authors": "By Boorstin, Daniel J. and Boorstin, Ruth Frankel",
        "Description": "In this provocative new collection, the Pulitzer Prize-winning author Daniel J. Boorstin explores the essential \"hidden history\" of the American experience that is overlooked by most historians. In twenty-four essays -- divided into five sections, \"The Quest for History,\" \"A By-Product Nation,\" \"The Rhetoric of Democracy,\" \"Unsung Experiments,\" and \"The Momentum of Technology\" -- Daniel J. Boorstin examines significant rhythms, patterns, and institutions of everyday American life: from his intimate portraits of such legendary figures as Paul Revere, Abigail Adams, and Thomas Jefferson, to more expansive discussions of historical phenomena, such as the Therapy of Distance and the Law of Survival of the Unread.",
        "Category": " History , United States , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Comet Halley: Once in a Lifetime",
        "Authors": "By Littmann, Mark and Yeomans, Donald K.",
        "Description": "",
        "Category": "",
        "Publisher": "Amer Chemical Society",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Bangkok (The Great Cities)",
        "Authors": "By Slafeld, John",
        "Description": "Moves beyond the colorful exterior of Bangkok's Buddhist temples, festivals, massage parlors, pleasure girls, masked ballets, and exotic cooking to reveal the tranquil face of a timeless Siam that coexists with modern Bangkok",
        "Category": " Travel , Asia , General",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "Among the Believers: An Islamic Journey",
        "Authors": "By Naipaul, V. S.",
        "Description": "Naipaul's controversial account of his travels through the Islamic world was hailed by The New Republic as \"the most notable work on contemporary Islam to have appeared in a very long time.\"",
        "Category": " Travel , Asia , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1982"
        }
    },
    {
        "Title": "Marathon: The Pursuit of the Presidency 1972-1976 by Jules Witcover (1977-07-18)",
        "Authors": "By Witcover, Jules",
        "Description": "",
        "Category": "",
        "Publisher": "Viking Press",
        "Price Starting With ($)": "24.94",
        "Publish Date": {
            "Month": "July",
            "Year": "1977"
        }
    },
    {
        "Title": "European Master Paintings from Swiss Collections: Post-impressionism to World War II",
        "Authors": "By Elderfield, John",
        "Description": "",
        "Category": "",
        "Publisher": "Museum of Modern Art",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Night Light for Parents: A Devotional",
        "Authors": "By Dobson, James C. and Dobson, Shirley",
        "Description": "Turn on the Light! Immediate Guidance for Parents  Night Light for Parents offers moms and dads the daily serving of hope, common sense, and biblical insights they’re looking for. The Dobsons once again include the features that made their first devotional together, Night Light, a bestseller and ECPA Gold Medallion award winner: twenty-six weekly themes, Scripture excerpts, thoughtful questions, prayers, and personal commentary, as well as delightful short stories from a host of popular authors. Every evening, in ten minutes or less, mothers and fathers will find sage advice on raising their kids covering diverse topics such as confidence, respect, learning, discipline, and integrity. Night Light for Parents will help parents point their kids toward the path leading to eternity. Inspiration for Every Mom and Dad  Raising healthy children is one of life’s greatest challenges, yet you can do it effectively. Dr. James Dobson and his wife, Shirley, show you how in Night Light for Parents, a daily devotional filled with encouraging insights and spiritual wisdom. Whether you’re married or single, with kids in diapers or almost grown, this book is for you. It offers heartwarming stories, biblical truth, and the practical parenting advice that has guided the Dobsons for more than three decades and inspired families around the world.  Let Night Light for Parents brighten your family life—starting tonight.  FRONT FLAP:  Hope for Your Home  Frustrated? Discouraged? Trying to remember why you wanted kids in the first place?  Parenting is one of the toughest jobs in the world—yet it can also be the most joyful and fulfilling experience in living. In Night Light for Parents, Dr. James Dobson, America ’s most trusted authority on the family, and his wife, Shirley, bring you the practical and biblical parenting concepts that have encouraged millions through the ministry of Focus on the Family.  This daily devotional features twenty-six weekly themes, Scripture excerpts, provocative questions, prayers, and personal commentary from the Dobsons, as well as uplifting short stories from a host of talented authors. With weary moms and dads in mind, each devotional reading is designed to be completed in just ten minutes or less.  Night Light for Parents will improve your relationships at home. It will renew your confidence in your ability to parent. Most important of all, it will deepen your family’s faith, lighting the way to eternity for those precious souls under your roof—your children.  Story Behind the BookWhat parents today are not constantly rushed on a daily basis—striving to meet demands coming from every direction? Dr. James and Shirley Dobson, America’s trusted source for practical and godly family guidance, recognized this tremendous need and wrote Night Light for Parents in response. In just ten minutes or less per day, couples can easily come together to read this devotional and seek God’s guidance.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Prophecies of Nostradamus",
        "Authors": "By Cheetham, Erika",
        "Description": "The predictions of the sixteenth-century French physician and astrologer are accompanied by notes interpreting their meaning and significance",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1975"
        }
    },
    {
        "Title": "Killing the Shadows",
        "Authors": "By McDermid, Val",
        "Description": "A killer is on the loose, blurring the line between fact and fiction. His prey - the writers of crime novels who have turned psychological profilers into the heroes of our times. But this killer is like no other. His bloodlust shatters all the conventional wisdom surrounding the motives and mechanics of how serial killers operate. And for one woman, the desperate hunt to uncover his identity becomes a matter of life and death.Professor Fiona Cameron is an academic psychologist who uses computer technology to track serial offenders. She used to help the police, but vowed never to work with them again when they went against her advice and subsequently botched an investigation. Still smarting from the experience, she's working a case in Spain when her lover, thriller writer Kit Martin, tells her a fellow crime novelist has been murdered. It's not her case, but Fiona can't help taking an interest. When the killer strikes again Fiona finds herself caught in a race against time - not only to save a life but also to find redemption, both personal and professional.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Good Housekeeping 2002 Annual Recipes",
        "Authors": "By Good Housekeeping Editors",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Minimal Art",
        "Authors": "By Battcock, Gregory (COM)",
        "Description": "",
        "Category": " Art , Criticism & Theory",
        "Publisher": "E. P. Dutton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1968"
        }
    },
    {
        "Title": "Bordeaux: A Consumer's Guide to the World's Finest Wines",
        "Authors": "By Parker, Robert M., Jr.",
        "Description": "Discusses more than one hundred chateaux, offers tasting notes for one thousand wines, and presents detailed maps of wine-making regions",
        "Category": " Cooking , Reference",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "7.23",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Scandals in the highest office;: Facts and fictions in the private lives of our Presidents",
        "Authors": "By Miller, Hope Ridings",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Abandoned: The Betrayal of the American Middle Class since World War II",
        "Authors": "By Quirk, William J. and Bridwell, R. Randall",
        "Description": "Do you consider yourself a member of the middle class? Eighty percent of Americans describe themselves in those terms; working-class citizens who are neither rich nor poor. Has the government addressed the needs of the middle class to your satisfaction?William J. Quirk and R. Randall Bridwell argue that the fundamental interests of the middle class have been ignored and undermined since WWII. This provocative book chronicles the events which have defined the post-WWII political and economic period, and shows how the middle class has been compromised in the process. From the New York City fiscal crisis of the 70s, to the rise of the new judicial activism, to the looming economic influence of Japan, the authors show for the first time how these developments are interrelated.The authors provide a novel interpretation of the constitutional meaning of the events leading to the abandonment of the middle class, as well as a new interpretation of the condition of the American Constitution as it is applied today. By analyzing the constitutional source of problems which our political system has had in recent years, the authors provide a new theory as to why the federal system is not working, and they offer novel solutions for the future.",
        "Category": " Political Science , General",
        "Publisher": "Madison Books",
        "Price Starting With ($)": "6.87",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Illustrated History of Helicopters",
        "Authors": "By Heatly, Michael",
        "Description": "",
        "Category": " History , United States , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "The Gold of Troy: Searching for Homer's Fabled City",
        "Authors": "By Tolstikov, Vladimir, Treister, Michail Yu, Antonova, Irina (INT), Easton, Donald F. (EDT), Sever, Christina (TRN), Bonnichsen, Mila (TRN), and Gosudarstvennyi Muzei Izobrazitelnykh Iskusstv Imeni A. S. Pushkina (COR)",
        "Description": "Thought to have been lost, dispersed, or even melted down during World War II, the marvelous ancient artifacts known as the \"Gold of Troy,\" or \"Priam's Treasure,\" are among the most important antiquities in existence. The two hundred fifty pieces in this fabulous golden trove were unearthed more than a century ago by the German amateur archaeologist Heinrich Schliemann and have been the subject of endless fascination ever since. In this lavish volume, the official catalogue of the \"Gold of Troy\" exhibition at the Pushkin State Museum of Fine Arts, Moscow, these spectacular objects are reproduced in full color for the first time, and the tale of how they came to light after fifty years in hiding is told in compelling detail.The story begins with Schliemann (1822-1890), a wealthy businessman whose passion was to find the lost world of Homer. Guided by The Iliad to a site in northern Turkey that he \"knew\" was ancient Troy, he excavated goblets, coins, jewelry, and other treasures of inestimable value, won great fame, and gave the most important finds - \"Priam's Treasure\" among them - to the Berlin Museum. There they remained until the last days of World War II, when the collection was placed in three crates and hidden in an anti-aircraft installation near the Berlin Zoo. As the Red Army overran the city, the Soviets were the first to reach this cache of gold, immediately realized its historical importance, and shipped the hoard to Russia.In The Gold of Troy are superb color photographs of all 259 artifacts in the Pushkin exhibition, accompanied by extensive individual commentaries. The objects - now generally thought to date from 2600 to 2450 B.C., a thousand years earlier than the fabled city Schliemann was seeking - are from thirteen separate sites excavated by Schliemann from 1872 to 1890, and include priceless jewelry such as diadems, rings, bracelets, earrings, pendants, and brooches, as well as anthropomorphic figures, vessels, axes, beads, and more.",
        "Category": "",
        "Publisher": "Harry N Abrams Inc",
        "Price Starting With ($)": "8.14",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "An Adult Child's Guide to What's 'Normal'",
        "Authors": "By Friel, John C. and Friel, Linda D.",
        "Description": "You have begun to deal with the pain and trauma of being raised in a dysfunctional family and now you are ready to lead a healthy life.  But:Do you know what healthy people do?Do you know what is \"normal\"?Do you know how to ask unwanted guests to leave?In An Adult Child's Guide to What's \"Normal\",  John and Linda Friel have written a practical guide to living a healthy life.  Your parents may not have been able to teach you social skills but it is not too late to learn them now.Read this  guide and learn how to respond to the challenges, problems and traps that we are faced with daily.",
        "Category": " Self-help , Codependency",
        "Publisher": "Health Communications Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "How to Form Your Own Corporation Without a Lawyer for Under $50.00",
        "Authors": "By Nicholas, Ted",
        "Description": "",
        "Category": "",
        "Publisher": "Enterprise Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Sewing Express",
        "Authors": "By Zieman, Nancy Luedtke",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Cakes, Cookies, Pies & Tarts",
        "Authors": "By Williams-Sonoma",
        "Description": "",
        "Category": "",
        "Publisher": "Weldon Owen",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Safe Harbor",
        "Authors": "By Rice, Luanne",
        "Description": "Readers across the country have embraced the moving, magical novels of Luanne Rice, among them her acclaimed bestsellers Firefly Beach, Follow the Stars Home, and Cloud Nine. The New York Times Book Review has called Rice's work \"exciting, emotional, terrific,\" and praises her \"rare combination of realism and romance.\" Now from this gifted writer comes a new novel -- the story of two generations of sisters and the indelible bonds among them, set on the timeless New England coastline she has made her own. Dana Underhill's artistic gift has led her all over the world in search of new oceanscapes. Her breathtaking underwater canvases evoke all the beauty and romance of the seas she and her beloved sister, Lily, have sailed since childhood. But when a shattering event takes Lily from her forever, Dana must leave her nomadic artist's life for the salt marshes and tidal creeks of her childhood home at Hubbard's Point, Connecticut, to become a mother to Lily's two young daughters, Quinn and Allie.Twelve-year-old Quinn may be Dana's toughest challenge. With a mass of wiry braids as uncontrollable as she is, Quinn hides her secret diary in a remote cove and clings fiercely to private mementos of her parents. Already an expert sailor herself, Quinn is convinced their deaths at sea were no accident. Dana, too, is troubled by the puzzle of what could have gone so terribly wrong on that clear, moonlit night. Support comes to Dana with the unexpected reappearance of an old friend, marine biologist Sam Trevor, whom readers will remember from Firefly Beach. When Sam was eight years old, Dana taught him to sail and unlocked his dreams of the undersea world. Now he's a tall, laughing-eyed pro, researching dolphins. And he's been in love with Dana for all the years that have passed between them.Dana cannot begin to contemplate opening her heart again, especially now, especially to a man she can only allow herself to see as a young student. But together, she and Sam begin to discover that Hubbard's Point is the center of endless mysteries, and that many of the answers lie in the blue-purple depths that surge through Dana's paintings and into all of their lives, revealing the transcendence of love even in the face of grief and death. Haunting and powerful, Safe Harbor is an unforgettable story of family bonds, love lost and found, and of a painter's unfolding vision of herself, as an artist -- and as a woman.",
        "Category": " Fiction , Literary",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Fatal",
        "Authors": "By Palmer, Michael",
        "Description": "From The Sisterhood, Michael Palmer's first New York Times bestseller, to The Patient, his ninth, reviewers have proclaimed him a master of medical suspense. Recognized around the world for original, topical, nail-biting suspense, emergency physician Palmer'swork has been translated into more than thirty-five languages.  Now he reaches controversial and startling new heights in a terrifying tale of cutting-edge microbiology, unbridled greed, and murder, where either knowing too little or trusting too much can be FATAL.In Chicago, a pregnant cafeteria worker suffering nothing more malevolent than flulike symptoms begins hemorrhaging from every part of her body.  In Boston, a brilliant musician, her face disfigured by an unknown disease, rapidly descends into a lethal paranoia.  In Belinda, West Virginia, a miner suddenly goes berserk, causing a cave-in that kills two of his co-workers.  Finding the link between these events could prove FATAL.Five years ago, internist and emergency specialist Matt Rutledge returned to his West Virginia home to marry his high-school sweetheart and open a practice.  He also had a score to settle.  His father died while working for the Belinda Coal and Coke Company, and Matt swore to expose the mine’s health and safety violations.  When his beloved Ginny succumbed to an unusual cancer, his campaign became even more bitterly personal.  Now Matt has identified two bizarre cases of what he has dubbed the Belinda Syndrome--caused, he is certain, by the mine’s careless disposal of toxic chemicals.  All he needs is proof.Meanwhile, two women, unknown to one another, are drawn inexorably to Belinda, into Matt’s life--and into mortal danger.  Massachusetts coroner Nikki Solari comes to attend the funeral of her roommate, killed violently on a Boston street.  Ellen Kroft, a retired schoolteacher from Maryland, seeks the remorseless killer who has threatened to destroy her and her family.Three strangers--Rutledge, Solari, and Kroft--each hold one piece of a puzzle they must solve, and solve quickly.  If they don’t, it will be far more than just their own lives that are at risk.Michael Palmer has crafted a novel of breathtaking speed and medical intricacy where nothing is as it seems and one false step could be FATAL.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "I Have Feelings, Too! (Little Angels Board Book)",
        "Authors": "By Nancy Parent",
        "Description": "",
        "Category": "",
        "Publisher": "Paradise Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Photographic History of the Civil War, Volume 4: Soldier Life; Prisons and hospitals",
        "Authors": "By Oppel, Frank (EDT)",
        "Description": "Volume IV.The Photographic History of the Civil War was first published in 1911 to commemorate the fiftieth anniversary of the great conflict. Extremely popular then, it has become a rare book. Here, in five double volumes, is the complete and unabridged original edition, text and photographs carefully reproduced in the original format and full size.The thousands of photographs contained within are remarkable in their immediacy, spontaneity, and authenticity. They demonstrate the power of the camera as well as the importance of the photographer.   They are a unique record of one of the greatest conflicts in the history of mankind. These pictures can be viewed as art, as history and as journalism. Covering every aspect of the war --from the front to weapons, from tactics to the wounded, from everyday life to grief, from victory to defeat—these volumes are a testament to a mighty conflict and to the great nation which emerged from it.This volume describes in detail the lives of soldiers on both sides of the conflict, and the secret service. It also contains photographs, diagrams, and text about the prisons and hospitals used during the Civil War.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Blue & Gray Press",
        "Price Starting With ($)": "8.46",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Point Deception",
        "Authors": "By Muller, Marcia",
        "Description": "Rhoda Swift, sheriff's deputy in California's Soledad County, lives with her haunting dreams of an unsolved mass murder thirteen years earlier. In a remote spot on the rocky Pacific coast two families were found riddled with bullets. Two children lay among the dead. And rookie Rhoda Swift was first at the scene. Unjustly blamed for losing the blood samples that might have cracked the case, Rhoda watched her reputation and marriage crumble. It's taken her all this time to prove herself a damn good cop.But another death is about to shake Rhoda's world. The body of a young woman, pretty in a way that says trouble, is found in the sea off Point Deception. Coming almost on the anniversary of the massacre, the new killing revives a community's fears and suspicions that a monster still walks among them. Further stirring the brew is Guy Newberry, a best-selling New York author and journalist determined to write about the unsolved crime and its dark legacy.Soon Newberry's digging is dividing a town between those who want the truth and those who want to forget it. Like an incendiary device, the new Point Deception murder is inflaming memories and strong feelings for both Rhoda and Newberry, a man with secrets of his own. They cautiously join forces during the investigation, sharing leads and troubling conclusions.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Mysterious Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The Best Ever Chocolate",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Stolen Lives: Twenty Years in a Desert Jail",
        "Authors": "By Oufkir, Malika, Fitoussi, Michele, and Schwartz, Ros (TRN)",
        "Description": "The daughter of a former aide to the king of Morocco, who was executed after a failed assassination attempt on the ruler, describes how she, her five younger siblings, and her mother were imprisoned in a desert penal colony for twenty years. 35,000 first printing.",
        "Category": " Social Science , Penology",
        "Publisher": "Miramax Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Book For People Who Do Too Much",
        "Authors": "By Greive, Bradley Trevor",
        "Description": "New York Times best-selling author Bradley Trevor Greive, creator of the modern classic The Blue Day Book, is now a household name in more than 30 countries.Hard work never killed anybody. This conviction built our great nation and made it the star-spangled superpower that it is. But Bradley Trevor Greive (BTG) wants us to know when enough's enough! Funny and perceptive, The Book for People Who Do Too Much reminds us that, in fact, hard work has killed a whole bunch of people. It has also caused premature aging, unsightly baldness, and explosive indigestion and is responsible for a lot of very questionable fashion statements.Too many people drive themselves beyond reasonable limits to do more, have more, and be more. BTG points out that ironically, they actually end up with a lot less. \"It's like climbing mountain after mountain and never taking the time to look at the view,\" he says.With his trademark combination of engaging animal photos, gentle humor, and priceless insights, BTG urges us to have the courage to say No, and to learn to use this liberating two-letter word in a way that is amusing and empowering, but never offensive. Saying no can sound selfish, but by saving time to enjoy our lives and pursue our true passions, we'll ultimately have a lot more of ourselves to share with those who are most special to us.",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The Beloved Land (Song of Acadia #5)",
        "Authors": "By Oke, Janette and Bunn, T. Davis",
        "Description": "Book 5 of Song of Acadia. In their own incomparable style, Janette Oke and T. Davis Bunn paint a portrait both lavish and poignant of the colorful, chaotic world of the American Revolution, where danger is rife and political views run deep. And once drawn into that world, readers will be reluctant to reemerge until the last triumphant chapter has drawn to a close.  Learning of their beloved father's precariously ill health, Anne and Nicole make separate plans to visit him in Georgetown, in spite of the dangerous instability of the times. Nicole travels from Massachussetts with her fiancé, while Anne and her husband must brave an arduous transatlantic crossing from England. But the hazards of travel are not to be compared to the events or struggles with which each of these \"sisters of the heart\" must ultimately come to terms.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Right Thing",
        "Authors": "By Abraham, Ken and Waddle, Scott",
        "Description": "When a U.S. nuclear submarine collided with a Japanese fishing vessel in the spring of 2001, the story made national headlines. Navy Commander Scott Waddle, former captain of the U.S.S. Greeneville, was at the center of the controversy. This is the first-hand, never-before-published account of that fatal moment and the heart-breaking avalanche of events that followed.",
        "Category": " History , Military , Naval",
        "Publisher": "Integrity Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Cast Again: Tales of a Fly-Fishing Guide",
        "Authors": "By Olsson, Jennifer",
        "Description": "A bold new voice in fly-fishing literature.",
        "Category": " Sports & Recreation , Fishing",
        "Publisher": "Lyons Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Sea Dragon Heir",
        "Authors": "By Constantine, Storm",
        "Description": "The Palindrake family ruled the rocky kingdom of Caradore, their right ordained by their allegiance to the power of the Sea. But war came to them, and defeat at the hands of the king of Fire. He had coveted this high, feral land, and now it was his. Caradore, and its guardian family, the Palindrakes, had once belonged to the sea. Their flags were adorned with the ocean's brutal, yet fragile, monsters: sea dragons, proud, attenuated, and coral-frail. If the mournful cries of their shattered ghosts echoed from the ocean now, no one heard them.The flags had fallen and were burned. The elements had clashed and fire reigned triumphant. And now, five lifetimes later, the Palindrake heir, Valraven V, has a twin sister, a woman who embodies their inheritance of power in a way that no wife ever could. Valraven is obedient to his oath to serve the Magravandian Emperor in war and peace, and Pharinet is resigned to her duty as a woman to marry. But the tidal power in their blood draws them to each other, into a forbidden passion that could sweep away bonds of fire placed upon the oceanic magic of the sea.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Everyone is Special (Lessons From the Hundred Acre Wood, No. 2 / Disney's Winnie The Pooh)",
        "Authors": "By Nancy Parent",
        "Description": "",
        "Category": "",
        "Publisher": "Advance Publishers LLC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The Hundredth Man",
        "Authors": "By Kerley, Jack",
        "Description": "Bizarre and cryptic messages found on a pair of corpses in Mobile, Alabama, launch junior police detective Carson Ryder and veteran cop Harry Nautilus into a desperate search for a mysterious killer. With the body count rising, Ryder descends into his family's terrifying past by seeking advice from his brother, a violent, taunting psychopath convicted of similarly heinous crimes. Ryder soon confronts not only his past fears and nightmares, but also the knowledge that someone he knows is the next target. And time is running out.",
        "Category": " Fiction , General",
        "Publisher": "Dutton",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "A Change Is Gonna Come",
        "Authors": "By Thomas, Jacquelin",
        "Description": "",
        "Category": "",
        "Publisher": "Bet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Monticello a Guidebook",
        "Authors": "By Nichols, Frederick D. And Bear, James A. Jr.",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Jefferson Memorial Foundation",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Revolt Amid the Darkness / Fifty Years Ago : 1993 Days of Remembrance Sunday, April 18 through Sunday, April 25",
        "Authors": "By U.S. Holocaust Memorial Museum",
        "Description": "",
        "Category": "",
        "Publisher": "United States Holocaust Memorial Museum, 1993",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Building Communities of Learners",
        "Authors": "By McCaleb, Sudia P.",
        "Description": "This popular text shows how teachers can create partnerships with parents and students that facilitate participation in the schools while also validating home culture and family concerns and aspirations. It reflects current research and theory in several areas related to literacy development, including family literacy, bilingual and multicultural education, critical pedagogy, participatory research, cooperative learning, and feminist perspectives. Teachers of students who are immigrants, non-native speakers of English, and members of marginalized groups will find this book especially pertinent.",
        "Category": " Education , Bilingual Education",
        "Publisher": "Routledge",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Beyond the Grave (And Other)",
        "Authors": "By Condon, Gerald M. and Condon, Jeffrey L.",
        "Description": "A loved one's death is painful enough. Why should your survivors suffer more by squabbling over their inheritance? Beyond the Grave is the first book to show you how to:Prevent common family bickering that arises when parents dieProtect your child's inheritance from an ex-spouse, creditor, cult, or addictionCompel your children to share their inheritance when they couldn't share their toysDivide the family home without dividing your familyProtect your surviving spouse from pushy kids, greedy caretakers, and charming cheatsLeave more to your family and less to Uncle SamPrevent a charity from using your donation to buy Cadillacs for its executivesBeyond the Grave factors human nature into estate planning, with common sense and \"tough love\" advice for making tough but loving decisions concerning the welfare of our survivors through life -- and beyond death. It's a must-have, before it's too late.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "HarperPb",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Aloft",
        "Authors": "By Lee, Chang-Rae",
        "Description": "",
        "Category": "",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Therapist disclosure: The use of self in psychotherapy",
        "Authors": "By Weiner, Myron F.",
        "Description": "",
        "Category": "",
        "Publisher": "Butterworths",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Lacrosse: Technique and Tradition",
        "Authors": "By Scott, Bob",
        "Description": "The director of athletics at Johns Hopkins University traces the history of lacrosse and offers detailed explanations of the sport's techniques and strategies, presenting line drawings and action photographs to illustrate aspects of play",
        "Category": " Sports & Recreation , Lacrosse",
        "Publisher": "Johns Hopkins University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Magic Eye II: Now You See it",
        "Authors": "By Magic Eye Inc.",
        "Description": "You need to see it to believe it! Exercise your eyes and imagination with 29 new mind-bending 3D illusions. 2D illustrations will magically morph before your eyes to reveal what is secretly hidden in 3D. The images will not simply appear to be 3D, they will become 3D! Viewing instructions and a solution key are included. The longer you look, the clearer the hidden 3D image will become. The further away you hold the page, the deeper it becomes!",
        "Category": " Design , Graphic Arts , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Italy in Color",
        "Authors": "By Cathay Books",
        "Description": "",
        "Category": "",
        "Publisher": "Cathay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The great Bible question & answer book: From the Old and New Testaments",
        "Authors": "By Claudia Vurnakes",
        "Description": "",
        "Category": "",
        "Publisher": "Waldman Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Ortho's Guide to Creative Home Landscaping",
        "Authors": "By Clough, Eric (EDT) and Ortho Books (COR)",
        "Description": "",
        "Category": " Antiques & Collectibles , Reference",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "6.84",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Of War & Weddings: A Legacy of Two Fathers",
        "Authors": "By Yellen, Jerry",
        "Description": "",
        "Category": "",
        "Publisher": "Sunstar Pub Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Reinvent Your Kids' Rooms",
        "Authors": "By Barnes, Christine E.",
        "Description": "",
        "Category": " House & Home , Decorating",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Sing a New Song: A Book of Psalms",
        "Authors": "By Le Tord, Bijou (EDT)",
        "Description": "Watercolor illustrations accompany these retellings of psalms arranged for daily reading.",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "Eerdmans Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The pleasures of cigar smoking,",
        "Authors": "By Back, Joseph B",
        "Description": "",
        "Category": "",
        "Publisher": "Rutledge Books",
        "Price Starting With ($)": "7.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Clifford's Happy Mother's Day (Clifford 8x8)",
        "Authors": "By Bridwell, Norman",
        "Description": "With more than 74 million books in print and an all-new TV show this fall, this new title will be a welcome addition to the Clifford 8x8 line.Mother's Day is coming, and Emily Elizabeth is gathering together some surprises for her mom: candy, flowers, and a card she'll make herself.Uh-oh! Clifford accidentally knocks over the ink and tracks pawprints over the card and Emily's sweater!No problem! The card and sweater make a special present for Clifford's mom. Emily makes another card--and all is well!",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Wave",
        "Authors": "By Mosley, Walter",
        "Description": "Errol Porter is awakened by a strange prank caller, one who asks for him by name and claims to be his father. But Errol's father has been dead for years. Late one night, curious and a little unnerved, Errol sneaks into the graveyard where his father is buried. The man he finds there will change his life.Soon Errol's on the run from mad scientists and homeland security death squads, and befriended by creatures that are the stuff of nightmares. Plunging into a series of stunning revelations, he must uncover the hidden tragedy of his family's past and penetrate the depths of an earth-shaking, ancient enigma to determine the fate of the entire world.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Aspect",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Gettin' Place",
        "Authors": "By Straight, Susan",
        "Description": "Straight's brilliant story of the effects of violence in America on three generations of a family is told through the lives of the Thompsons, a large, independent clan who live in Treetown, above downtown Rio Seco, California, and operate a car towing and repair business. Patriarch Hosea is a proud man, and a hardened one, whose father was killed in the violence that erupted in Tulsa many years earlier. All Hosea's memories come flooding back with ferocious force when the bodies of two white women are found engulfed in flames in an abandoned car on his property. These are the first signs that someone wants Hosea off his land; it is up to his son Marcus, the only one of the six children of Hosea and his half-Mexican wife who can negotiate with the white world, to help the family hold on to their home and their livelihood.But it is only when Marcus' nephew Mortrice - a young man infatuated with guns and the power that they bring - comes back to Rio Seco from gang-ridden Los Angeles that the real secrets of the bodies found on Thompson land are revealed, as Rio Seco erupts in the same wave of trashing and looting that has engulfed the nearby metropolis.",
        "Category": " Fiction , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "How to Call Wildlife",
        "Authors": "By Byron W Dalrymple",
        "Description": "",
        "Category": "",
        "Publisher": "Outdoor Life Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Grandmother Remembers Family Recipes",
        "Authors": "By Levy, Judith",
        "Description": "",
        "Category": "",
        "Publisher": "Stewart Tabori & Chang",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "Frommer's Walking Tours: Washington, D.C. (Frommer's Memorable Walks in Washington, D. C.)",
        "Authors": "By Bulkin, Rena",
        "Description": "Suggestions for excursions to notable city sites include the National Zoo, historic and government buildings, and the locations of scandalous events",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Frommer",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "I Am Becoming the Woman I've Wanted",
        "Authors": "By Martz, Sandra (EDT)",
        "Description": "I Am Becoming the Woman I?ve Wanted, the latest in the series of best-selling anthologies (When I Am an Old Woman I Shall Wear Purple and If I Had My Life to Live Over I would Pick More Daisies), delves into the sometimes hidden and always powerful feelings that women have about their bodies. In the emotionally evocative style that characterizes Martz?s previous collections, this book explores coming of age, sexuality, child-birth, physical power, menopause, aging, and much more.   This is more than just another book about body image. Using her talent for bringing together extraordinary stories, poems, and photographs about women?s lives, editor Sandra Martz explores the broader question of how the physical aspects of being female affect women?s experiences. This best-selling anthology will have women reading and thinking and sharing for a long time.",
        "Category": " Family & Relationships , Life Stages , Later Years",
        "Publisher": "Papier-Mache Press",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Flowers of Youth: Images of Children from the National Gallery of Art",
        "Authors": "By National Gallery of Art (U. S.) (COR)",
        "Description": "Children represent innocence and hope, and great artists throughout history have given us works that capture childhood's special magic. This charming book celebrates childhood by featuring more than forty pictures of children from the renowned collections of the National Gallery of Art in Washington, D.C. Included are portraits of children with parents, siblings, playmates, pets, and toys by such distinguished European and American artists as Mary Cassatt, John Singleton Copley, Sir Anthony van Dyck, Paul Gauguin, Winslow Homer, Claude Monet, Pablo Picasso, and Auguste Renoir. The pictures are accompanied by some of the most memorable poems written for or about children, including favorites by Emily Dickinson, Eugene Field, Henry Wadsworth Longfellow, Edna St. Vincent Millay, and Robert Louis Stevenson. This compilation of paintings and poems provides an appealing and refreshing look at the pleasures of childhood through the ages and will be treasured by children and adults alike.",
        "Category": " Art , General",
        "Publisher": "Bulfinch Pr",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Saints: Who They Are and How They Help You",
        "Authors": "By Hallam, Elizabeth (EDT)",
        "Description": "For all the times when you need someone to call on -- for help, inspiration, or celebration -- this authoritative, readable, and entertaining book will tell you which saint you can invoke for the occasion. Whether you're looking for love, hoping for success at work, or needing to get well soon, Saints can help you find the answer to your prayers.  The perfect gift book for anyone interested in history or legend, religion or selfhelp, this unique reference book of more than 150 saints is the first to group them by their patronages and specialties and to illustrate their relevance to the modern world. Saints contains a wealth of invaluable information about the lives of early and contemporary saints and answers many questions, including: Why is Saint Christopher invoked by travelers? Why is Saint Elmo's fire so called? And why is Saint Jude the patron saint of lost causes?  From the wealth of artistic material that saints have inspired throughout the ages in painting, stained glass, and photography, more than 170 beautiful full-color and black-and-white photographs have been chosen to illustrate this gloriously rich celebration of saints. With special spreads focusing on the best-known and most intriguing saints, shrines and pilgrimage sites shown in their modern context, a calendar of feast days, an illustrated index of saints, and an alphabetical list of patronages and specialties, this comprehensive survey will be sure to intrigue, enlighten, and delight all who sense a saintly presence in",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Land an Rhein und Ruhr =: Rhein and Ruhr country = Le Rhin auprÃ¨s de Cologne et la Ruhr (Die Deutschen Lande farbig)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Umschau Verlag",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "U.S.A.: A Picture Memory",
        "Authors": "By Harris, Bill",
        "Description": "",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Buzzword",
        "Authors": "By Cook, Walton",
        "Description": "",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Public Policy Pr",
        "Price Starting With ($)": "9.69",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Between a Rock and a Hard Place",
        "Authors": "By Ralston, Aron",
        "Description": "THE NEW YORK TIMES BESTSELLER AND BASIS FOR THE MAJOR MOTION PICTURE 127 HOURS One of the most extraordinary survival stories ever told—Aron Ralston's searing account of his six days trapped in one of the most remote spots in America, and how one inspired act of bravery brought him home.It started out as a simple hike in the Utah canyonlands on a warm Saturday afternoon. For Aron Ralston, a twenty-seven-year-old mountaineer and outdoorsman, a walk into the remote Blue John Canyon was a chance to get a break from a winter of solo climbing Colorado's highest and toughest peaks. He'd earned this weekend vacation, and though he met two charming women along the way, by early afternoon he finally found himself in his element: alone, with just the beauty of the natural world all around him. It was 2:41 P.M. Eight miles from his truck, in a deep and narrow slot canyon, Aron was climbing down off a wedged boulder when the rock suddenly, and terrifyingly, came loose. Before he could get out of the way, the falling stone pinned his right hand and wrist against the canyon wall. And so began six days of hell for Aron Ralston. With scant water and little food, no jacket for the painfully cold nights, and the terrible knowledge that he'd told no one where he was headed, he found himself facing a lingering death -- trapped by an 800-pound boulder 100 feet down in the bottom of a canyon. As he eliminated his escape options one by one through the days, Aron faced the full horror of his predicament: By the time any possible search and rescue effort would begin, he'd most probably have died of dehydration, if a flash flood didn't drown him before that. What does one do in the face of almost certain death? Using the video camera from his pack, Aron began recording his grateful good-byes to his family and friends all over the country, thinking back over a life filled with adventure, and documenting a last will and testament with the hope that someone would find it. (For their part, his family and friends had instigated a major search for Aron, the amazing details of which are also documented here for the first time.) The knowledge of their love kept Aron Ralston alive, until a divine inspiration on Thursday morning solved the riddle of the boulder. Aron then committed the most extreme act imaginable to save himself. Between a Rock and a Hard Place -- a brilliantly written, funny, honest, inspiring, and downright astonishing report from the line where death meets life -- will surely take its place in the annals of classic adventure stories.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Make It a Winning Life: Success Strategies for Life, Love and Business",
        "Authors": "By Rinke, Wolf J.",
        "Description": "",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Achievement Pub",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "The Final Prophecies of Nostradamus",
        "Authors": "By Cheetham, Erika",
        "Description": "",
        "Category": " Body, Mind & Spirit , Divination , General",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Weather: Air Masses, Clouds, Rainfall, Storms, Weather Maps, Climate, (Golden Guides)",
        "Authors": "By Zim, Herbert Spencer, Lehr, Paul E, McNaught, Harry (ILT), and Burnett, R. Will",
        "Description": "An illustrated guide to the atmospheric causes and major phenomena of weather including instruments used to forecast and plot it",
        "Category": " Young Adult Nonfiction , Science & Nature , Earth Sciences",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "The Remnant: On the Brink of Armageddon (Left Behind)",
        "Authors": "By LaHaye, Tim F. and Jenkins, Jerry B.",
        "Description": "Street date: July 2, 2002 The Great Tribulation unfolds as the forces of evil and the armies of God prepare for mankind's ultimate battle. Millions of Christians are protected by God as the anger of the Antichrist, Nicolae Carpathia, burns against them. The biggest novel of 2002 is highly anticipated by consumers worldwide.",
        "Category": " Fiction , Religious",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Big Bang: The Origin of the Universe",
        "Authors": "By Singh, Simon",
        "Description": "We've all heard of the Big Bang, and yet few of us truly know what it is.Renowned for making difficult ideas much less difficult than they might first appear, Simon Singh is our perfect guide to explaining why cosmologists believe that the Big Bang is an accurate description of the origin and evolution of the universe.This highly readable and entertaining book tells the story of the many brilliant, often eccentric scientists who fought against the establishment idea of an eternal and unchanging cosmos. From such early Greek cosmologists as Anaximander to recent satellite measurements taken deep in space, Big Bang is a narrative full of anecdotes and personal histories. With characteristic clarity, Simon Singh tells the centuries-long story of mankind's attempt to understand how the universe came to be, a story which itself begins some 14 billion years ago (give or take a billion years). Simon Singh shows us that it is within the capability of all of us -- in his expert hands -- to understand the Big Bang: the fundamental theory in all of science, and a high point -- perhaps the high point -- of human achievement.",
        "Category": " Science , Cosmology",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "6.03",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The pathology of leadership",
        "Authors": "By L'Etang, Hugh",
        "Description": "",
        "Category": "",
        "Publisher": "Hawthorn Books",
        "Price Starting With ($)": "7.24",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Family Scrapbooks: Yesterday, Today, and Tomorrow",
        "Authors": "By Gerbrandt, Michele and Cannarella, Deborah",
        "Description": "",
        "Category": " Photography , General",
        "Publisher": "Universe",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Above All: He Took the Fall and Thought of Me",
        "Authors": "By Manning, Brennan and Smith, Michael W. (FRW)",
        "Description": "The worship song \"Above All,\" performed by Michael W. Smith, went quickly from its #1 spot on radio playlists to a cherished place in hearts, homes, and worship services everywhere. Now the words that millions have been singing will bear fresh fruit as one of Christianity's most insightful and trusted authors personalizes the biblical truths in each phrase of the song.",
        "Category": " Religion , Biblical Reference , General",
        "Publisher": "Integrity Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "One Pot (Cook's Library)",
        "Authors": "By n/a",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Shetland Sheepdog",
        "Authors": "By Pisano, Beverly, editor",
        "Description": "",
        "Category": "",
        "Publisher": "Thomasson Grant & Howell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1981"
        }
    },
    {
        "Title": "Tiggers don't climb trees (Winnie-the-Pooh, the pop-up collection)",
        "Authors": "By Milne, A. A.",
        "Description": "",
        "Category": "",
        "Publisher": "Dutton Childrens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Eleventh Hour: A Curious Mystery",
        "Authors": "By Base, Graeme",
        "Description": "An elephant's eleventh birthday party is marked by eleven games preceding the banquet to be eaten at the eleventh hour; but when the time to eat arrives, the birthday feast has disappeared. The reader is invited to guess the thief.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Last Days Of The Confederacy",
        "Authors": "By Hoehling, Mary and Hoehling, A. H.",
        "Description": "Recalls the tragic realities of civil war through eyewitness accounts of the Confederate states, including observations by Lincoln, Lee, Grant, news correspondents, and ordinary citizens",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "13.98",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "Vendetta: American Express and the Smearing of Edmond Safra",
        "Authors": "By Burrough, Bryan",
        "Description": "The author of Barbarians at the Gate uncovers the secret operation involving spies, private eyes, double agents, and dragon ladies that American Express put into motion in order to harm one reclusive billionaire. 250,000 first printing. $250,000 ad/promo. Tour.",
        "Category": " Political Science , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Straight Parents, Gay Children: Inspiring Families to Live Honestly and with Greater Understanding",
        "Authors": "By Bernstein, Robert",
        "Description": "This is a personal account by a father who came to terms with his daughter's homosexuality and discovered that his life was not diminished, as he had originally thought, but enriched by it. In Straight Parents / Gay Children, Robert Bernstein tells about his own and others' experiences with P FLAG, an organization that helps parents to achieve a fuller understanding and appreciation of human diversity.",
        "Category": " Social Science , LGBT Studies , Gay Studies",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Soviet Crucible: Soviet Government in Theory and Practice",
        "Authors": "By Samuel (Edited by) Hendel",
        "Description": "",
        "Category": "",
        "Publisher": "D. Van Nostrand Co",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "Living History",
        "Authors": "By Clinton, Hillary Rodham",
        "Description": "Hillary Rodham Clinton is known to hundreds of millions of people around the world. Yet few beyond her close friends and family have ever heard her account of her extraordinary journey. She writes with candor, humor and passion about her upbringing in suburban, middle-class America in the 1950s and her transformation from Goldwater Girl to student activist to controversial First Lady. Living History is her revealing memoir of life through the White House years. It is also her chronicle of living history with Bill Clinton, a thirty-year adventure in love and politics that survives personal betrayal, relentless partisan investigations and constant public scrutiny.  Hillary Rodham Clinton came of age during a time of tumultuous social and political change in America. Like many women of her generation, she grew up with choices and opportunities unknown to her mother or grandmother. She charted her own course through unexplored terrain -- responding to the changing times and her own internal compass -- and became an emblem for some and a lightning rod for others. Wife, mother, lawyer, advocate and international icon, she has lived through America's great political wars, from Watergate to Whitewater.  The only First Lady to play a major role in shaping domestic legislation, Hillary Rodham Clinton traveled tirelessly around the country to champion health care, expand economic and educational opportunity and promote the needs of children and families, and she crisscrossed the globe on behalf of women's rights, human rights and democracy. She redefined the position of First Lady and helped save the presidency from an unconstitutional, politically motivated impeachment. Intimate, powerful and inspiring, Living History captures the essence of one of the most remarkable women of our time and the challenging process by which she came to define herself and find her own voice -- as a woman and as a formidable figure in American politics.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    }
]