[
    {
        "Title": "Sheer Abandon: A Novel",
        "Authors": "By Vincenzi, Penny",
        "Description": "A number-one bestseller from one of Britain’s most popular novelists, Sheer Abandon  is an all-consuming story revolving around the consequences of a desperate act . . . Martha, Clio, and Jocasta meet by chance at Heathrow airport in 1985 as they are starting off on separate backpacking adventures, and they decide to spend the first few days of their trips together in Thailand. When they go their separate ways, they vow to get together in London the following year. But many years pass before the three cross paths again, and the once-capricious, carefree girls now all have thriving careers. One of them, however, harbors a terrible secret: On her return from her pre-college excursion, she abandoned her just-born daughter at Heathrow.  Clio has fulfilled her ambition of becoming a doctor, only to find herself trapped in a marriage to an arrogant surgeon who belittles her and her professional achievements. Martha is a highly paid corporate lawyer, just embarking on a political career. Dedicated to her job, she has had little time for personal relationships and lives a busy, but lonely life. Jocasta, a tabloid newspaper reporter with an infallible instinct  for the big story, is in love with a charming colleague who can’t make the permanent commitment she longs for. The infant abandoned at Heathrow has grown up under the loving care of her adoptive family. Now a beautiful teenager named Kate, she sets out to find her birth mother—a quest that unexpectedly brings the women together and exposes the secret buried so many years before.  Impossible to put down, Sheer Abandon is top-notch women’s fiction.",
        "Category": " Fiction , Sagas",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Philadelphia Off the Beaten Path: A Guide to Unique Places (Off the Beaten Path Series)",
        "Authors": "By Ivory, Karen",
        "Description": "In a city this big, there are lots of hidden nooks that hold wonderful, uniquely Philadelphian treasures. By all means, visit the Liberty Bell and Independence Hall -- the historic district can still inspire even the most jaded Philadelphian. But this guide will also help you uncover houses that still have bullet holes and bloodstains from the Revolutionary War; churches where the graveyards out back hold statuary worthy of a museum; and an abandoned prison that's become a venue for the arts. It's these odds and ends that this book explores, along with worthy restaurants, shops, collections, and gardens often missed by those who stick to the trail well trod.",
        "Category": " Travel , United States , Northeast , Middle Atlantic (NJ, NY, PA)",
        "Publisher": "Globe Pequot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Renewed Hearts, Changed Lives: Stories of Faith from Everyday Women (Renewing the Heart)",
        "Authors": "By Holt, Betsy (EDT) and Harper, Lisa (EDT)",
        "Description": "A Muslim American woman who came to Christ and is now evangelizing her family and friends . . . a woman battling cancer and yet ministering Christ's love and joy to others . . . and a woman struggling with bitterness and anger over her husband's affair. These are the stories of faith from everyday women in America today. Their struggles and victories can minister to others in need. These women are just three of thousands who have found hope, renewal, and healing at Focus on the Family's Renewing the Heart conferences. Their stories, along with seven others, will encourage and better equip women to live as godly wives, mothers, and members of their communities. Lisa Harper, conference founder and mistress of ceremonies, provides a general introduction and commentary to each story.",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Focus on the Family",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Harbor",
        "Authors": "By Adams, Lorraine",
        "Description": "We first meet Aziz Arkoun as a twenty-four-year-old stowaway - frozen, hungry, his perceptions jammed by a language he can't understand or speak. After fifty-two days in the hold of a tanker from Algeria, he jumps into the icy waters of Boston harbor and swims to shore. Seemingly rescued from isolation by Algerians he knew as a child, he instead finds himself in a world of disillusionment, duplicity, and stolen identities, living a raw comedy of daily survival not unlike what he fled back home.As the story of Aziz and his friends unfolds - moving from the hardscrabble neighborhoods of East Boston and Brooklyn to a North African army camp - Harbor makes vivid the ambiguities of these men's past and present lives: burying a murdered girl in the Sahara, reading medieval Persian poetry on a bus, passing for Mexican, shoplifting Versace for clubbing, succumbing to sex in a public library, impersonating a double agent. But when Aziz begins to suspect that he and his friends are under surveillance, all assumptions - his and ours - dissolve in an urgent, mesmerizing complexity. And as Harbor races to its explosive conclusion, it compels us to question the questions it raises: Who are the terrorists? Can we recognize them? How do they live?",
        "Category": " Fiction , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Book for Children",
        "Authors": "By Taylor, Kenneth Nathaniel",
        "Description": "Retells over two hundred Bible stories from the Creation and the Flood to the Resurrection and the work of Jesus's disciples",
        "Category": " Religion , General",
        "Publisher": "Tyndale House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "The Gondola Scam (Lovejoy Mystery)",
        "Authors": "By Gash, Jonathan",
        "Description": "Antiques expert Lovejoy is up against a powerful criminal, scheming to steal some priceless Venetian art, as well as the encroaching sea under which Venice and its treasures are sinking",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Penguin Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Tahiti & French Polynesia (Lonely Planet)",
        "Authors": "By Wheeler, Tony and Carillet, Jean-Bernard",
        "Description": "",
        "Category": " Travel , Australia & Oceania",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The Lost Gospel: The Quest for the Gospel of Judas Iscariot",
        "Authors": "By Krosney, Herbert and Ehrman, Bart D. (FRW)",
        "Description": "Judas Iscariot.He’s been hated and reviled through the ages as Jesus Christ’s betrayer–the close friend who sells him out for 30 pieces of silver.  But history also records other information about Judas Iscariot. One such reference was written in 180 by an influential Church Father named St. Irenaeus who railed against the Gospel of Judas for depicting the last days of Jesus from the perspective of the disgraced apostle. In its pages, Judas is Christ’s favorite. It’s a startlingly different story than the one handed down through the ages. Once it was denounced as heresy, the Gospel of Judas faded from sight. It became one of history’s forgotten manuscripts. Until now.In this compelling and exhaustively researched account, Herbert Krosney unravels how the Gospel of Judas was found and its meaning painstakingly teased from the ancient Coptic script that had hid its message for centuries. With all the skills of an investigative journalist and master storyteller, Krosney traces the forgotten gospel’s improbable journey across three continents, a trek that would take it through the netherworld of the international antiquities trade, until the crumbling papyrus is finally made to give up its secrets. The race to discover the Gospel of Judas will go down as one of the great detective stories of biblical archaeology.",
        "Category": " Religion , Biblical Criticism & Interpretation , General",
        "Publisher": "National Geographic Society",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "101 Ways to Say Merry Christmas for Less Than $25",
        "Authors": "By Malone, John and Balwin, Paul",
        "Description": "A guide to affordable Christmas gifts includes both handmade and store-bought items, Christmas recipes, and a list of mail-order catalogs",
        "Category": " Social Science , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Bronislava Nijinska: Early Memoirs (English and Russian Edition)",
        "Authors": "By Nijinska, Bronislava, Nijinska, Irina, Rawlinson, Jean, and Kisselgoff, Anna",
        "Description": "The early memoirs of ballet dancerchoreographer Bronislava Nijinska, sister of Nijinsky, recall their experiences and dancing careers from the early 1890s through the prewar years with Diaghilev's Ballets Russes",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "HOLT, RINEHART AND WINSTON",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Keepsakes for a Mother's Heart: Creating Cherished Moments for a Lifetime",
        "Authors": "By Gray, Alice and Wales, Susan",
        "Description": "Families-especially mothers-are longing for more connectedness, deeper family purpose and meaning, and unforgettable treasured times. There is a natural hunger for finding and preserving the pure and innocent moments with their children-where first prayers and teddy bear picnics are woven together with a golden thread of keepsake moments. On ordinary days as well as special ones, Keepsakes for a Mother&apos;s Heart celebrates motherhood at its best by helping to create and preserve occasions to reminisce and enjoy long after the children have grown. From toddler to preteen years, the authors provide a menagerie of creative ideas, fun activities, stories, and special ways for treasuring the keepsakes of a mother&apos;s heart.",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Mastering the Requirements Process",
        "Authors": "By Robertson, Suzanne and Robertson, James",
        "Description": "She specializes in systems analysis and requirements modeling and specifications; he advises companies on requirements. They set out an industry-tested and adaptable template for gathering and verifying requirements for software products, errors in which they estimate account for up to 60% of the failures. The provide techniques and insights for discovering precisely what the customer wants and needs. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Computers , Software Development & Engineering , General",
        "Publisher": "Addison-Wesley Pub (Sd)",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The Panic-Free Pregnancy: An OB-GYN Separates Fact from Fiction on Food, Exercise, Travel, Pets, Coffee, Medications, and Concerns You Have When You Are Expecting",
        "Authors": "By Broder, Michael S.",
        "Description": "While most pregnancy books only address the stages of the baby's development, The Panic-Free Pregnancy comprehensively covers the lifestyle issues and questions that confront every mom-to-be. Dr. Broder separates fact from fiction, media hype from old wives tales, and drawing on the latest scientific research offers an accessible, comprehensive reference book that answers questions about... * Caffeine* Exercise* Flying* Prescription and over-the-counter medications* Sex* Cosmetics* Alcohol* Herbal remedies* and moreOrganized in an easy-to-use question-and-answer format, this book will help women have the safest, healthiest, most anxiety-free pregnancy possible.",
        "Category": " Health & Fitness , Pregnancy & Childbirth",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Bird owner's home health and care handbook",
        "Authors": "By Gallerstein, Gary A.",
        "Description": "",
        "Category": "",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Shining City: A Novel",
        "Authors": "By Greenland, Seth",
        "Description": "Average guy Marcus Ripps has been an honest, hardworking man all his life: good to his wife and son, never in trouble. And all he has to show for it is a house in a third-rate Los Angeles suburb, troubled finances, and a boring marriage. But when his dead brother's dangerous world catches up with him, Marcus finds himself in a moral quandary.His criminal sibling has bequeathed him - of all things - a dry cleaning business. But Marcus wonders how such a small, empty dry cleaner seems to be generating so much cash. The answer soon presents itself. Before he knows it, the former philosophy major finds himself pimp to a coterie of upscale international \"companions.\" Setting up 401(k)s for his employees and buying a new Mercedes, Marcus transforms himself into a high roller. But is he ready for the lifestyle he's adopted? Can he revitalize his marriage, arrange pole-dancing classes for his mother-in-law, and spring for a spectacular bar mitzvah for his son? When Marcus's conscience - and the law - start to catch up with him, he will have to scramble to save his assets, his employees, and his life.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Funeral Games : The Combat of Alexander's Heirs",
        "Authors": "By Renault, Mary",
        "Description": "After the death of Alexander the Great, an extraordinary power struggle, involving intrigue and a series of murders, takes place among the various successors to his reign",
        "Category": " Fiction , Historical",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1981"
        }
    },
    {
        "Title": "God Things Come in Small Packages",
        "Authors": "By Weiss, Leann, Duke, Susan, Carden, Judy, and Loveless, Caron",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Starburst Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Things Pondered: From the Heart of a Lesser Woman",
        "Authors": "By Moore, Beth",
        "Description": "Just as Mary treasured her memories as the mother of Jesus and pondered them in her heart, this book celebrates treasured moments in the life of every woman, wife, and mother. Told from a fresh, personal perspective, these stories and poems form a warm, inspiring collection of remembrances of children,Christmas, marriage, trials, friendship, the seasons, grace, and above all, God’s love for us. Things Pondered proves Beth Moore not only to be an effective speaker and author of popular Bible studies, but also show her to be a gifted, sensitive writer and poet.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "B & H Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "See How She Runs: Marion Jones and the Making Of a Champion",
        "Authors": "By Rapoport, Ron",
        "Description": "She has been called \"the next great sports superstar.\" She's a world-champion sprinter and a national-champion basketball player. She has been considered the next great hope for American track and field since she was fourteen. At sixteen, she made the U.S. Olympic team. Nike has created a shoe for her, Annie Leibovitz has photographed her, and the world is watching to see if she'll be the first person ever to win five gold medals in track at the Olympics.  Marion Jones is faster than any woman alive, but where did she come from and where is she going?  Ron Rapoport's biography of the woman the New York Times called \"the most prominent track athlete on the planet\" is a remarkable profile of a woman not at the end of her athletic career, but at the beginning. It's the story of a season at the highest level of sport, and the triumphs and tragedies of Jones's quest to win four gold medals at the 1999 World Championships, the gateway to the 2000 Olympics in Sydney.  Her story is also that of an American girl born into a society just beginning to make room for women on its playing fields. She played baseball, basketball. She ran. She grew tall and beautiful and strong. She led he college basketball team to a national championship. But it was running that she loved; she could run faster than anyone.  Rapoport follows Jones from meet to meet during the 1999 outdoor track season, a witness to her domination. With unprecedented access to Jones, her colleagues, family, friends and foes, Rapoport artfully presents the stories of a world-class athlete whose quest began as the dream of a little girl.",
        "Category": " Sports & Recreation , Basketball",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "5.54",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Foods for Better Health: Prevention and Healing of Diseases",
        "Authors": "By Webb, Densie and Smith, Susan Male",
        "Description": "",
        "Category": " Health & Fitness , General",
        "Publisher": "Pubns Intl Ltd",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Feed Muscle, Shrink Fat Diet",
        "Authors": "By Smith, Kathy",
        "Description": "The noted fitness expert introduces a groundbreaking, six-week program emphasizing a diet rich in lean protein, vitamin C-rich vegetables and fruits, and fiber to promote total weight control and overall health, along with delicious menus, favorite recipes, and a series of simple, ten-minute workouts designed to help tone, define, sculpt, and strengthen every part of the body.",
        "Category": " Cooking , Health & Healing , Weight Control",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Sawdust and Solitude",
        "Authors": "By Zora, Lucia.  Edited By Courtney Ryley Cooper",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown & Co.",
        "Price Starting With ($)": "192.34",
        "Publish Date": {
            "Month": "January",
            "Year": "1928"
        }
    },
    {
        "Title": "Quiet Moments for Women",
        "Authors": "By Bacher, June Masters",
        "Description": "",
        "Category": "",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1979"
        }
    },
    {
        "Title": "Jackpot Nation: Rambling and Gambling Across Our Landscape of Luck",
        "Authors": "By Hoffer, Richard",
        "Description": "Is this a great country or what? You can bet on the turn of the card, a roll of the dice—but also the NFL, the NCAA, and which Olson twin marries first. We bet $80 million a year, the amount growing wildly as more and more people gain access to this huge American wheel of fortune. No longer quarantined in Las Vegas, gambling has become as local as our neighborhood cineplex. It's no wonder that we spend more money gambling than we do on movies, music, sports, video games, and theme parks combined! If there's not a casino around the corner, there's one on your laptop computer. In Jackpot Nation, acclaimed Sports Illustrated writer Richard Hoffer takes us on a headlong tour, alternately horrifying and hilarious, across our landscape of luck, discovering just how ridiculously determined we are to gamble. Whether he's trying to win a side of bacon in a Minnesota bar, hustling a paper sack filled with $100,000 cash across Las Vegas parking lots, poring over expansion plans with a tribal chief in California, or visiting a retired bus salesman with a poor understanding of three-game parlays in his New York prison cell, Hoffer finds a national inclination—a cultural predisposition, even—to take a chance.Hoffer shows us how Americans—adventurers at heart—have embraced this ability to take recreational risks with a surprising gusto. But as he pokes into this country's far corners, traveling coast to coast with odds as his copilot, he uncovers more than just the playful exercise of that age-old fantasy—something for nothing. He discovers that the very institutions that used to regulate this workout are now its biggest cheerleaders. Whereas government, religion, and business once restricted our ability to gamble, making it  taboo even, they have now taken ownership of the pastime. Yesterday's numbers racket is today's state lottery; yesterday's mobbed-up casino is now part of a Fortune 500 company. It's one thing to recognize the house edge, but sometimes it's quite another to figure out who actually owns the house.Still, Hoffer manages to find the fun in all this, as equally delighted with the delirium of a slot machine trade show as the religious risk of an underground poker game, almost right beneath the spires of the Mormon Tabernacle. He concludes that people are, mostly, having a good time. If he also uncovers a downside—the outlandish vigorish that comes with its growing acceptance—well, that's why they call it gambling.",
        "Category": " Social Science , Popular Culture",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Never Balance Your Checkbook on Tuesday: And 300 More Financial Lessons You Can't Afford Not to Know",
        "Authors": "By Dunnan, Nancy",
        "Description": "A leading financial advisor presents some three hundred practical, smart-money tips and strategies, covering such topics as shopping, retirement planning, savings, part-time jobs, education, household budgeting, and more. Original. 30,000 first printing.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Harper Resource",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Convection Oven Cookery (Nitty Gritty Cookbooks)",
        "Authors": "By Katona, Christie and Katona, Thomas",
        "Description": "",
        "Category": " Cooking , Methods , Cookery for One",
        "Publisher": "Bristol Publishing Enterprises",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Words of Wisdom: Daily Affirmations of Faith",
        "Authors": "By Simmons, Joseph",
        "Description": "Focus, Focus, Focus! You will only have significant success with something that is an obsession. Success comes from having passion and having fun creating your objective!Words of Wisdom is a collection of inspirational aphorisms, which Rev Run sends out to his closest friends each day and which were made suddenly popular when his television show zoomed to the top of the MTV charts. Rev Run (an ordained minister) closes each episode of Run's House by reading philosophical, Christian, and inspirational books in the bathtub before penning words that inspire, encourage, and motivate. Here, available for the first time to the public, are Run's Words of Wisdom published in a gifty yet affordable format just in time for the show's second season. All great blessings come from being at peace. When the day is over, go to sleep. Never sit up worrying about tomorrow. Work hard and let God do the rest. I always say these words at night: \"I can sleep tonight because God is awake!\" Relax. Rest easy.",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Amistad",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "U.S. National Security: Policymakers, Processes, and Politics",
        "Authors": "By Sarkesian, Sam C., Cimbala, Stephen J., and Williams, John Allen",
        "Description": "The fifth edition of US National Security retains the structure and approach that have made this text so successful, but it has been revised and updated throughout to reflect the challenges faced by the Obama administration. The choices necessary in an increasingly budget-constrained environment, the broader range of national security issues, and the evolving nature of counterinsurgency doctrine and practice are among the currents that inform the authors’ clear presentation and appraisal of US security interests, politics, and processes.",
        "Category": " Political Science , General",
        "Publisher": "Lynne Rienner Pub",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Smoothies for Life! Yummy, Fun, and Nutritious!",
        "Authors": "By Chace, Daniella and Keane, Maureen B.",
        "Description": "Blend Your Way to Better Health!Join the millions of health-conscious individuals who have already discovered the tasty, nutritional, revitalizing goodness of smoothies. In Smoothies for Life, Daniella Chace and Maureen Keane (coauthor of the million-copy bestseller Juicing for Life) show you how to make high-energy, delicious smoothies right in your own home! All you need is a blender (or food processor), a few, simple ingredients, and you're ready to embark on a new taste and nutrition adventure. Learn how you can:·Beat fatigue with Mocha Magic ·Build athletic endurance with Tropical Elixir ·Lose weight with Peachy Almond Freeze ·Boost immunity with Rasanana Berry ·Reduce stress with Ginseng Soother ·Improve your memory with Pink Hurricane ·Detoxify your body with Watermelon Cooler ·And much more!These tantalizing smoothies contain creative combinations of antioxidant-rich fruits, healing tinctures, flavorful extracts, and natural sweeteners — and they are always delicious. Once you start, you'll be drinking these smoothies for life!Includes information for adding revitalizing herbs such as ginkgo, echinacea, goldenseal, and kava!",
        "Category": " Cooking , Beverages , Juices & Smoothies",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "America's Half-Century: United States Foreign Policy in the Cold War (The American Moment)",
        "Authors": "By McCormick, Thomas J",
        "Description": "",
        "Category": " Political Science , International Relations , General",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "The Antiques Guide to Decorative Arts in America, 1600-1875",
        "Authors": "By Stillinger, Elizabeth",
        "Description": "",
        "Category": "",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Skeptic in the House of God",
        "Authors": "By Kelley, James L.",
        "Description": "James L.Kelley, a skeptic about religion, writes with insight and humor  of his journey through St. Mark's, an Episcopal church that welcomes  doubters without pressuring them to compromise their intellectual  integrity. When Kelley first visited the church well into his forties,  he was searching for a respite from urban malaise and found himself  filled with disquieting questions: How could he reconcile his  convictions with the central purpose of the church-to worship a God he  didn't believe in? Could he say the prayers and sing the hymns while  remaining an honest skeptic?After fifteen years of full  participation in a church that is open not only to skeptics but also to  gay men and lesbians, blacks and Jews, where members are invited to  critique Sunday sermons, and where hymns are rewritten to reflect  feminist concerns, Kelley found that his agnosticism remained but his  skepticism about church participation had disappeared. Modern urban life  can be a sterile, isolating experience. Yet in St. Mark's Kelley  discovered a place of vibrant community, honest inquiry, and support  over the hard places in life.",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Rutgers University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Southern Living Our Best Christmas Recipes",
        "Authors": "By Liles, Jean Wickstrom (COM) and Hooper, Lisa A. (EDT)",
        "Description": "Offers menus for formal and informal Christmas get-togethers, shares recipes for seasonal foods, and provides instructions for gifts from the kitchen",
        "Category": " Cooking , Holiday",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "When the Man You Love Is Ill: Doing Your Best for Your Partner Without Losing Yourself",
        "Authors": "By Isaacs, Florence and Lynn, Dorree, Ph.D.",
        "Description": "When the Man You Love is Ill is a woman’s guide to living with a partner facing a medical crisis or chronic illness. How do you understand the male psyche? How do you manage your own feelings of fear and guilt? How do you deal with the loss and keep the family stable? This book helps to heal the relationship with their partners or spouses.",
        "Category": " Health & Fitness , Health Care Issues",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Bring Your \"A\" Game: The 10 Career Secrets of the High Achiever",
        "Authors": "By McGovern, Robert J.",
        "Description": "The first 10 years of your career can often be the \"make it or break it\" period. Bring Your \"A\" Game shows you how to define your career plan early on, with sound advice on how to acquire the critical building blocks and time-tested workplace skills you need to get ahead.Throughout his career, Rob McGovern has employed and mentored hundreds of young professionals. In Bring Your \"A\" Game, he shares the 10 common attributes that are consistent with career high-achievers, or \"A\" players, as well as contingency procedures when something goes wrong, such as getting fired, having a stalled career or realizing that you hate your job.Filled with real-life situations, anecdotes, pointed direction and practical methods for dealing with any workplace situation, Bring Your \"A\" Game is not just another \"how to find a job\" book - it's a how to have a career book.",
        "Category": " Business & Economics , Decision-Making & Problem Solving",
        "Publisher": "Sourcebooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Small Amish Quilt Patterns",
        "Authors": "By Pellman, Rachel T.",
        "Description": "Shows how to plan and construct crib quilts and wall hangings, recommends traditional patterns, and includes quilting templates",
        "Category": "",
        "Publisher": "Good Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Fitness Weight Training (Fitness Spectrum Series)",
        "Authors": "By Baechle, Thomas R. and Earle, Roger W.",
        "Description": "Provides advice for starting a weight training program, suggests workouts at various intensity levels, and offers six sample weight training programs",
        "Category": " Sports & Recreation , Bodybuilding & Weight Training",
        "Publisher": "Human Kinetics Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Index to Opera, Operetta and Musical Comedy Synopses in Collections and Periodicals",
        "Authors": "By Drone, Jeanette Marie",
        "Description": "Indexes 1,605 titles by 627 composers.",
        "Category": " Performing Arts , Reference",
        "Publisher": "Scarecrow Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Home Cooking With Amy Coleman (Pbs Cooking Series)",
        "Authors": "By Amy Coleman",
        "Description": "",
        "Category": " Cooking , Methods , General",
        "Publisher": "Bristol Publishing Enterprises Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "101 Potato Recipes",
        "Authors": "By International, Publications",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "American Bistro: Great Recipes in the New Cooking Tradition",
        "Authors": "By Worthington, Diane Rossen and Weaver, Jonelle (PHT)",
        "Description": "The new cooking trend that emphasizes fresh ingredients and an ethnic flair is fostered in this collection of recipes that includes such taste-tempting dishes as Broiled Snapper with Poblano Chile Pesto and Garden Vegetable Stew with Couscous. IP.",
        "Category": " Cooking , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "It's Called Work for a Reason!: Your Success Is Your Own Damn Fault",
        "Authors": "By Winget, Larry",
        "Description": "\"Larry Winget hacks through the bad advice given in most business books. Some authors stroke your ego by reinforcing information you already know. Others get you lost in pages of boredom until you have no idea what the book is even about. Some authors exploit the hottest buzzword, without giving you any real idea how to do what must be done. The worst tell cute little parables with messages so trite that we should all be insulted. Here, Winget tells the unvarnished truth about the one key ingredient to success in business: Work! Your success is not up to your boss, your manager, your employees, or the economy. It's up to YOU. Business is never bad, people are just bad at being in business. If that makes you mad, this book is for you.--From publisher description.\"--From source other than the Library of CongressThe author presents a blunt assessment of what he finds wrong with today's companies, arguing that poor training, apathy, and substandard customer service is the fault of employees, in a guide that urges modern workers to become results-oriented.",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Gotham",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Wish Club: A Novel",
        "Authors": "By Strickland, Kim",
        "Description": "Claudia, Lindsay, Gail, Mara, and Jill are about to find out that the old adage is true—they really should be careful what they wish for. At first their book club was like any other: talking, drinking wine, and maybe even discussing the book they’ve read. But when they read a novel about witchcraft and jokingly try one of the spells . . . it works. Naturally the women are freaked out at—they’re not witches! But what could be the harm in lighting some candles and making little wishes? Everyone has wishes—the perfect man, more time to yourself, a little extra cash . . . When their book club morphs into “Wish Club,” the ladies find their real gift is for conjuring trouble. Their wishes start going awry, and they find themselves in strange, hilarious, and in some cases even dangerous predicaments. But as they search for someone who might be able to help, each of the women begins to discover that she may have the ability to make her own wishes come true.",
        "Category": " Fiction , Literary",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Budgie: An Owner's Guide to a Happy Healthy Pet",
        "Authors": "By Mancini, Julie R. and Rach, Julie",
        "Description": "The Budgerigar (Budgie) was rated \"America's #1 Bird\" by Bird Talk magazine (July 1996). Written by Bird Talk's editor, this book has the latest care information.",
        "Category": " Pets , Birds",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "The Girls' Guide to Dreams",
        "Authors": "By Collier-Thompson, Kristi and Turchyn, Sandie (ILT)",
        "Description": "In those turbulent teenage years, girls need help making sense of the world. Dreams could be the key to figuring out what's happening in their lives--but only if they can properly decode the symbols, images, and actions that play out in their unconscious minds every night. Adult dream dictionaries may miss the mark, because they don't pay attention to what matters most to girls. For example, how many would include entries on \"acne\" or \"allowances\"? And some words have different implications for kids than grown-ups: \"zero\" might represent fears about a school project, for example. Now, there's a guide just for teenagers, with advice on how to tailor the interpretations to their own personal situation. Scary and threatening explanations are out, along with concepts and events that may not be relevant or easily grasped by young people. Instead, they'll find comforting guidance and a path to self-understanding. From \"abandonment\" and \"abnormality\" to \"zipper\" and \"zoo,\" these wise and wonderful analyses will lead to some real girl power!",
        "Category": " Young Adult Nonfiction , Girls & Women",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "THE RICHER, THE POORER",
        "Authors": "By West, Dorothy",
        "Description": "On the heels of the bestseller success of her  novel The Wedding, Dorothy West,  the last surviving member of the Harlem  Renaissance, presents a collection of essays and stories that  explore both the realism of everyday life, and the  fantastical, extraordinary circumstances of one  woman's life in a mythic time. Traversing the  universal themes and conflicts between poverty and  prosperity, men and women, and young and old, and  compiling writing that spans almost seventy years,  The Richer, The Poorer not only  affords an unparalleled window into the  African-American middle class, but also delves into the  richness of experience of \"one of the finest writers  produced in this country during the Roaring  Twenties\"(Book Page).",
        "Category": " Fiction , African American , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "501 Spanish Verbs",
        "Authors": "By Kendris, Christopher and Kendris, Theodore N.",
        "Description": "With more than 1 million copies in print, the new, updated edition of this all-time best selling language book of Spanish verbs is now printed in two colors for increased ease of reference. The most important and most commonly used Spanish verbs are presented alphabetically in chart form, one verb per page, and conjugated in all persons and tenses, both active and passive. This thorough guide to the use of verbs features many additional references and tips, including a bilingual list of more than 1,250 additional Spanish verbs, helpful expressions and idioms for travelers, and verb drills and tests with answers explained at the back of the book.",
        "Category": " Foreign Language Study , Spanish",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Trying to Save Piggy Sneed",
        "Authors": "By Irving, John",
        "Description": "Here is a treat for John Irving addicts and a perfect introduction to his work for the uninitiated.  To open this spirited collection, Irving explains how he became a writer.  There follow six scintillating stories written over the last twenty years ending with a homage to Charles Dickens.  This irresistible collection cannot fail to delight and charm.",
        "Category": " Fiction , Biographical",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "My Little Bible Series - Blue",
        "Authors": "By Hollingsworth, Mary and Britt, Stephanie McFetridge (ILT)",
        "Description": "The My Little Bible series has simple Bible stories, memory verses, prayers and psalms for young readers and attractive art.  A world-wide bestseller in several languages.",
        "Category": " Juvenile Nonfiction , Religion , Biblical Studies",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "The Quotable Cat",
        "Authors": "By Rogak, Lisa",
        "Description": "A compendium of feline lore from some of the most famous cat lovers that ever lived includes quotations by T.S. Eliot, Mark Twain, Cleveland Amory, Colette, William Shakespeare, Ernest Hemingway, and many others",
        "Category": " Pets , Cats , General",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "The Visitant",
        "Authors": "By Gear, W. Michael and Gear, Kathleen O'Neal",
        "Description": "Dr. Maureen Cole, one of the world's foremost physical anthropologists, has been called in to examine and evaluate a mass grave discovered in New Mexico. The burial site contains only the shattered skulls of women and children.Dr. Cole is appalled at the find and begins working immediately to unravel the mystery of these deaths. But as she works, strange things begin to happen around her. Little incidents at first, then her generator quits, and she begins to hear whispering voices emanating from the plastic bags of bones.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Forge",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "People of the Book",
        "Authors": "By Brooks, Geraldine",
        "Description": "Make this your next book club selection and everyone saves.Get 15% off when you order 5 or more of this title for your book club.Simply enter the coupon code BROOKSPEOPLE at checkout.This offer does not apply to eBook purchases. This offer applies to only one downloadable audio per purchase.View our feature on Geraldine Books’s People of the Book.From the Pulitzer Prize–winning author of March, the journey of a rare illuminated manuscript through centuries of exile and warIn 1996, Hanna Heath, an Australian rare-book expert, is offered the job of a lifetime: analysis and conservation of the famed Sarajevo Haggadah, which has been rescued from Serb shelling during the Bosnian war. Priceless and beautiful, the book is one of the earliest Jewish volumes ever to be illuminated with images. When Hanna, a caustic loner with a passion for her work, discovers a series of tiny artifacts in its ancient binding—an insect wing fragment, wine stains, salt crystals, a white hair—she begins to unlock the book’s mysteries. The reader is ushered into an exquisitely detailed and atmospheric past, tracing the book’s journey from its salvation back to its creation.In Bosnia during World War II, a Muslim risks his life to protect it from the Nazis. In the hedonistic salons of fin-de-siècle Vienna, the book becomes a pawn in the struggle against the city’s rising anti-Semitism. In inquisition-era Venice, a Catholic priest saves it from burning. In Barcelona in 1492, the scribe who wrote the text sees his family destroyed by the agonies of enforced exile. And in Seville in 1480, the reason for the Haggadah’s extraordinary illuminations is finally disclosed. Hanna’s investigation unexpectedly plunges her into the intrigues of fine art forgers and ultra-nationalist fanatics. Her experiences will test her belief in herself and the man she has come to love.Inspired by a true story, People of the Book is at once a novel of sweeping historical grandeur and intimate emotional intensity, an ambitious, electrifying work by an acclaimed and beloved author.",
        "Category": " Fiction , Literary",
        "Publisher": "The Viking Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Swing Hammer Swing!",
        "Authors": "By Torrington, Jeff",
        "Description": "An \"energetic, irreverent and very funny\" (New York Times Book Review) first novel set in Glasgow during a single week in the late sixties. Publishers Weekly, in a starred review, called it \"a rich Scotch broth of language, steaming with metaphor...and pungent dialect.\" Winner of Britain's Whitbread Book of the Year Award.",
        "Category": " Fiction , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Strength Training Past 50 (Ageless Athlete Series)",
        "Authors": "By Baechle, Thomas R. and Westcott, Wayne L.",
        "Description": "Research clearly shows that strength training is especially effective for older adults. Strength Training Past 50 explains and shows the most effective way for mature adults to work their muscles by presenting specific strength tests; 9 safety essentials; 39 age-appropriate exercises; a 10-week workout plan; and personalized programs for increasing muscle size, strength, and endurance.Two world-renowned experts, Wayne Westcott and Tom Baechle, team up to present strength exercise information and prescriptions tailored to the needs of anyone over 50 years of age.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Human Kinetics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Low Carb Cookbook",
        "Authors": "By Gina Steer",
        "Description": "",
        "Category": "",
        "Publisher": "parragon",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Ideas for Great Wall Systems (Southern Living Home Improvement Series)",
        "Authors": "By",
        "Description": "Offers advice on planning new shelves and storage, shows a variety of manufactured wall systems, and explains what to look for in shelves and cabinets",
        "Category": "",
        "Publisher": "Sunset Books (Lane)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Foreign Correspondent (Night Soldiers)",
        "Authors": "By Furst, Alan",
        "Description": "From Alan Furst, whom The New York Times calls “America’s preeminent spy novelist,” comes an epic story of romantic love, love of country, and love of freedom–the story of a secret war fought in elegant hotel bars and first-class railway cars, in the mountains of Spain and the backstreets of Berlin. It is an inspiring, thrilling saga of everyday people forced by their hearts’ passion to fight in the war against tyranny.By 1938, hundreds of Italian intellectuals, lawyers and journalists, university professors and scientists had escaped Mussolini’s fascist government and taken refuge in Paris. There, amid the struggles of émigré life, they founded an Italian resistance, with an underground press that smuggled news and encouragement back to Italy. Fighting fascism with typewriters, they produced 512 clandestine newspapers. The Foreign Correspondent is their story.Paris, a winter night in 1938: a murder/suicide at a discreet lovers’ hotel. But this is no romantic traged–it is the work of the OVRA, Mussolini’s fascist secret police, and is meant to eliminate the editor of Liberazione, a clandestine émigré newspaper. Carlo Weisz, who has fled from Trieste and secured a job as a foreign correspondent with the Reuters bureau, becomes the new editor. Weisz is, at that moment, in Spain, reporting on the last campaign of the Spanish civil war. But as soon as he returns to Paris, he is pursued by the French Sûreté, by agents of the OVRA, and by officers of the British Secret Intelligence Service. In the desperate politics of Europe on the edge of war, a foreign correspondent is a pawn, worth surveillance, or blackmail, or murder. The Foreign Correspondent is the story of Carlo Weisz and a handful of antifascists: the army officer known as “Colonel Ferrara,” who fights for a lost cause in Spain; Arturo Salamone, the shrewd leader of a resistance group in Paris; and Christa von Schirren, the woman who becomes the love of Weisz’s life, herself involved in a doomed resistance underground in Berlin.The Foreign Correspondent is Alan Furst at his absolute best–taut and powerful, enigmatic and romantic, with sharp, seductive writing that takes the reader through darkness and intrigue to a spectacular denouement.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The Murray's Cheese Handbook: A Guide to More Than 300 of the World's Best Cheeses",
        "Authors": "By Kaufelt, Rob and Thorpe, Liz",
        "Description": "Rob Kaufelt, cheese purveyor to American’s top restaurants and owner of Murray’s Cheese—named the world’s best cheese store byForbes magazine—guides us through the bewildering variety of cheeses available today in this entertaining and indispensable guide featuring:*Descriptions of more than 300 cheeses from across America and around the world, including what to drink with each*Suggested accompaniments for all the different styles and types of cheeses *How to arrange cheese plates for dressed-up dinners or casual cheese tastings*The best cheeses to serve before a meal, with a salad, or for a gooey grilled cheese sandwich*Must-have lists: The Ten Most Intimidating Cheeses, Sexiest Cheeses, Cheeses to Eat Before You Die*Answers to the most frequently asked questions about cheese",
        "Category": " Cooking , Specific Ingredients , Dairy",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Leading Economic Controversies of 1998",
        "Authors": "By Mansfield, Edwin (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Southwest Indian Cookbook",
        "Authors": "By Keegan, Marcia",
        "Description": "Includes recipes and food lore of both Navajo and Pueblo Indian cultures",
        "Category": " Cooking , Regional & Ethnic , Indian & South Asian",
        "Publisher": "Clear Light Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "The Best Of Mr. Food Dinner On The Double",
        "Authors": "By Ginsburg, Art",
        "Description": "The popular television chef introduces a collection of 175 of his favorite recipes for delicious, quick-and-easy meals that can be prepared in forty-five minutes or less.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Favorite Brand Name Barbeque Collection",
        "Authors": "By Publications International",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Everything Dog Book",
        "Authors": "By Devito, Carlo, Zhorne, Jeff, and Ammen, Amy",
        "Description": "Discusses breeds, selecting and buying a dog, basic care and grooming, training, shows, health and first aid, and older dogs",
        "Category": " Pets , Dogs , General",
        "Publisher": "Everything",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Geography in America",
        "Authors": "By Galle, Gary I. and Willimott, Cort J.",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Merrill Pub Co",
        "Price Starting With ($)": "6.85",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "German at a glance: Phrase book & dictionary for travelers",
        "Authors": "By Strutz, Henry",
        "Description": "",
        "Category": "",
        "Publisher": "Barron's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Time Out New York 4 (4th ed)",
        "Authors": "By Time Out",
        "Description": "",
        "Category": " Travel , United States , Northeast , Middle Atlantic (NJ, NY, PA)",
        "Publisher": "Time Out",
        "Price Starting With ($)": "6.52",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Mountain Bike Magazine's Complete Guide To Mountain Biking Skills: Expert Tips On Conquering Curves, Corners, Dips, Descents, Hills, Water Hazards,  And Other All-Terrain Challenges",
        "Authors": "By Bicycling (EDT)",
        "Description": "Mountain Bike Magazine's Complete Guide To Mountain Biking Skills by the editors of Mountain Bike Magazine and Bicycling Magazine offers expert tips on conquering curves, corners, dips, descents, hills, water hazards and other all-terrain challenges.Hit the dirt!From breaking to bunny hopping, speed jumping to switchbacks-- here are the skills you need to catch big air and experience the best of off-road riding. * Selecting the right rig for you and your budget.* Step-by-step drills for clearing obstacles, popping wheelies and more.* How to hammer it and ride faster than you ever thought possible.* Seven ways to stay alive by avoiding face plants, biffs and other crash landings.* All-weather strategies for plowing through mud, rain and snow.* Pro advice on entering your first off-road race.* Riding responsibly to save the trails.* Planning the perfect tour and enjoying a fat-tire vacation.* Tons more practical info for aspiring and die-hard dirtheads.You also get skill-building techniques and strategies from world-class mountain bikers, including* Ned Overend, six-time NORBA national champion* John Tomac, 1994 NORBA downhill champion* Juli Furtado, 1995 World Cup champion* Missy Giove, 1994 world downhill champion* Tinker Juarez, 1994 NORBA national champion* Mike King, 1993 world downhill champion",
        "Category": " Sports & Recreation , Cycling",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Shakespeare's Sonnets (Cliffs Notes)",
        "Authors": "By Lowers, James K. (EDT)",
        "Description": "The original CliffsNotes study guides offer expert commentary on major themes, plots, characters, literary devices, and historical background. The latest generation of titles in this series also feature glossaries and visual elements that complement the classic, familiar format.In CliffsNotes on Shakespeare's Sonnets, you explore the significance of William Shakespeare's 154 sonnets -- a sequence of poems that have solidified the Bard's reputation as one of the greatest poets ever. In these sonnets, Shakespeare writes of the trials and triumphs of love, and you meet three of the most mysterious literary characters ever: The Fair Young Man, The Dark Lady, and The Rival Poet.Critical essays help you understand the history of the sonnet, as well as how the sonnets relate to Shakespeare's plays. Other features that help you study includeAnalyses of The Fair Young Man, The Dark Lady, and The Rival PoetDiscussions of the sonnets' dominate themesCriticism of individual sonnetsA section of review questionsA selected bibliographyClassic literature or modern modern-day treasure — you'll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1965"
        }
    },
    {
        "Title": "Catholics In Crisis: An American Parish Fights For Its Soul",
        "Authors": "By Naughton, Jim",
        "Description": "Polls illustrating the gulf between the Roman Catholic Church and its American flock appear with numbing frequency. But behind the statistics are millions of people struggling to reconcile their lives with their faith. Catholics in Crisis is a vivid portrayal of this struggle, told through the narrative frame of a single, albeit highly influential, parish.Holy Trinity in Washington, D.C., one of the most prominent and popular churches in the nation, has long enjoyed a reputation as a place where post-Vatican II Catholicism is at its most vital. It is also a community in which American dissent from Vatican teaching is clearly articulated. But when a lone parishioner stands up through a Sunday Mass to protest the exclusion of women from the priesthood, he ignites a fire-storm of controversy that exposes deep rifts and threatens to tear the community apart.The Standing, as it came to be called, is but one of the stories that Jim Naughton skillfully weaves together as he examines the issues that can divide parents and children, husbands and wives, priests and the laity, Rome and America. The rich cast of characters includes: the pastor of Holy Trinity—deeply spiritual, charismatic, and about to leave the church; the female director of liturgy, caught between liberal and conservative factions; a parishioner and parent, who is appalled at the CCD program that he feels substitutes liberal platitudes for Catholic truth; a young priest, who is struggling with his vow of celibacy; a powerful bishop, who believes that Holy Trinity goes out of its way to flout Church rubrics, and is determined to bring it to heel; and a handful of others who play out the realities of divorce, remarriage, abortion, and premarital sex against the background the church’s teachings.",
        "Category": " Religion , General",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Death of an Englishman: A Marshal Guarnaccia Investigation",
        "Authors": "By Nabb, Magdalen",
        "Description": "The debut of  Marshal Salvatore Guarnaccia of the Carabinieri, a Sicilian, stationed in Florence. It is just before Christmas and the marshal wants to go South to spend the holiday with his wife and family, but first he must recover from the flu (which has left the Florentine caribinieri short-handed) and also solve a murder. A seemingly respectable retired Englishman, living in a flat on the Via Maggio near the Santa Trinita bridge, was shot in the back during the night.  He was well-connected and Scotland Yard has despatched two officers to \"assist\" the Italians in solving the crime. But it is the marshal, a quiet observer, not an intellectual, who manages to figure out what happened, and why. In addition to the wonderful atmosphere of Florence, Magdalen Nabb has created a delightful investigator who has been described as \"the most Maigret-like of contemporary policemen\" by the  Times Literary Supplement .",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Soho Crime",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Mountain Reader",
        "Authors": "By Murray, John A. (EDT)",
        "Description": "",
        "Category": " Nature , Ecosystems & Habitats , Mountains",
        "Publisher": "The Lyons Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Flavored Oils: 50 Recipes for Cooking with Infused Oils",
        "Authors": "By Chiarello, Michael and Wisner, Penelope",
        "Description": "This elegant and practical cookbook reveals how oils enhanced with the essence of herbs, spices, fruits, and vegetables captured at their peak can add an aromatic, gourmet touch to practically any dish. Low in saturated fats and easy to use, flavored oils make healthful alternatives to mayonnaises and sauces in everything from marinades and vinaigrettes to appetizers and entrees. Written by Michael Chiarello, renowned chef and creator of a popular line of infused oils, Flavored Oils presents a dazzling array of tempting recipes, from a heady Rosemary and Roasted Lemon Marinade to a delicate Beet Salad with Tarragon and Orange Oil to a savory Pork Tenderloin with Molasses, Bacon, and Porcini Vinaigrette. Brimming with inventive ideas and lavishly illustrated with full-color photographs, this unique volume makes a welcome companion for the home cook, as well as a lovely gift.",
        "Category": " Cooking , Specific Ingredients , Fruit",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Trucs of the Trade: 101 Tricks, Tips, and Recipes from America's Greatest Chefs",
        "Authors": "By Ball, Frank, Feltman, Arlene (EDT), and Glazer, Art (ILT)",
        "Description": "Features helpful hints for vegetables, fruits, eggs, grains, meat, fish, desserts, and more, and includes recipes for appetizers, entrees, and desserts",
        "Category": " Cooking , General",
        "Publisher": "Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The Plan",
        "Authors": "By Cannell, Stephen J.",
        "Description": "The Mafia, having secured secret control of a television network, and utilizing its vast amounts of untraceable cash, runs its own puppet for the presidency of the United States. Its Plan is discovered by Ryan Bolt, who has been hired to do a documentary about the candidate by his old prep-school buddy Mickey Alo. Bolt gets help from an unlikely source - Mickey's beautiful Mafia Princess sister, Lucinda - but this is a ruthless and deadly power game wherein nothing and no one is sacred, and Ryan must fight to save himself, his new love, and his country.From the harshly lit television newsrooms, where reality is tailored for public consumption, to the smoky back rooms where the real decisions are made, The Plan is a quite plausible journey into our nation's worst nightmare, and a sensational adventure from its opening scene to its violent climax.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Correct the 10 most common golf problems in 10 days",
        "Authors": "By Devaney, John, Ostroske, Walter, and LA Montagne, Aime (PHT)",
        "Description": "Examines such golf problems as faulty grip and stance, slicing, mismatched putts, and landing short of the green, and offers techniques to correct them",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "The Kitchen Companion : The Ultimate Guide to Cooking and the Kitchen",
        "Authors": "By Clingerman, Polly, Leonard, Joanne (EDT), Haynes, Jim (ILT), and Burwell and Burwell (PHT)",
        "Description": "A guide for beginning and experienced cooks features advice on ingredients and measuring, general cooking hints, tips on seasonings, basic recipes with simple variations, and charts for changing recipes and using substitute ingredients",
        "Category": " Cooking , Methods , General",
        "Publisher": "Amer Cooking Guild",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Visions of America: How we saw the 1984 election",
        "Authors": "By Henry, William A.",
        "Description": "",
        "Category": "",
        "Publisher": "Atlantic Monthly Press",
        "Price Starting With ($)": "10.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Folger book of Shakespeare Quotations",
        "Authors": "By Shakespeare, William and Stevenson, Burton Egbert",
        "Description": "A compact reference book of quotations from Shakespeare's plays and poems, listed by subject and identifying the source, location, and speaker",
        "Category": " Literary Criticism , General",
        "Publisher": "Folger",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "December",
            "Year": "1979"
        }
    },
    {
        "Title": "Chef Paul Prudhomme's Louisiana Tastes: Exciting Flavors from the State that Cooks",
        "Authors": "By Prudhomme, Paul",
        "Description": "The master of Louisiana cuisine invites everyone to taste the new flavors of Louisiana cookingChef Paul Prudhomme put Louisiana cooking on the map. Fifteen years have passed since the publication of his groundbreaking Chef Paul Prudhomme's Louisiana Kitchen. Now Chef Paul returns to his culinary roots to show us how Louisiana cooking has evolved.Today, the culinary influences of Asia, Latin America, the Middle East, and many other cuisines are being integrated into \"traditional\" Louisiana cooking. Chef Paul explores how Louisiana cooks have incorporated such newly available ingredients as lemongrass, fresh tamarind, and papaya into their dishes. As Chef Paul says, any Louisiana cook worth his or her salt will work with what's available -- familiar or not -- and turn it into something delicious. Andouille Spicy Rice gets its zing! from chipotle and pasilla chile peppers, and Roasted Lamb with Fire-Roasted Pepper Sauce is flavored with jalapeno peppers and fennel. Classic jambalaya, etouffee, and gumbo are reinvented with such far-flung ingredients as star anise, cilantro, yuca, plantain, and mango.Chef Paul Prudhomme's Louisiana Kitchen is an exciting exploration of the new flavors that have made Louisiana cooking even better.Chef Paul Prudhomme put Louisiana cooking on the map. Fifteen years have passed since the publication of his groundbreaking Chef Paul Prudhomme's Louisiana Kitchen. Now Chef Paul returns to his culinary roots to show us how Louisiana cooking has evolved.Today, the culinary influences of Asia, Latin America, the Middle East, and many other cuisines are being integrated into \"traditional\" Louisiana cooking. Chef Paul explores how Louisiana cooks have incorporated such newly available ingredients as lemongrass, fresh tamarind, and papaya into their dishes. As Chef Paul says, any Louisiana cook worth his or her salt will work with what's available -- familiar or not -- and turn it into something delicious. Andouille Spicy Rice gets its zing! from chipotle and pasilla chile peppers, and Roasted Lamb with Fire-Roasted Pepper Sauce is flavored with jalapeno peppers and fennel. Classic jambalaya, etouffee, and gumbo are reinvented with such far-flung ingredients as star anise, cilantro, yuca, plantain, and mango.Chef Paul Prudhomme's Louisiana Kitchen. is an exciting exploration of the new flavors that have made Louisiana cooking even better.Chef Paul Prudhomme put Louisiana cooking on the map. Fifteen years have passed since the publication of his groundbreaking Chef Paul Prudhomme's Louisiana Kitchen. Now Chef Paul returns to his culinary roots to show us how Louisiana cooking has evolved.Today, the culinary influences of Asia, Latin America, the Middle East, and many other cuisines are being integrated into \"traditional\" Louisiana cooking. Chef Paul explores how Louisiana cooks have incorporated such newly available ingredients as lemongrass, fresh tamarind, and papaya into their dishes. As Chef Paul says, any Louisiana cook worth his or her salt will work with what's available--familiar or not--and turn it into something delicious. Andouille Spicy Rice gets its zing! from chipotle and pasilla chile peppers, and Roasted Lamb with Fire-Roasted Pepper Sauce is flavored with jalapeno peppers and fennel. Classic jambalaya, etouffee, and gumbo are reinvented with such far-flung ingredients as star anise, cilantro, yuca, plantain, and mango.Chef Paul Prudhomme's Louisiana Kitchen. is an exciting exploration of the new flavors that have made Louisiana cooking even better.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Dynamic Yoga",
        "Authors": "By Sadur, Russell (PHT) and Meaux, Kia",
        "Description": "A basic grounding in the principles and practice of the most intensive workout for body, mind, and spirit. Dynamic Yoga is a powerful exercise system designed to give the body the ultimate workout for increased energy, fitness, and flexibility. Boost your energy levels. Kia Meaux has devised an imaginative and invigorating program based on the sun Salutes of Ashtanga yoga. It encourages you to get your body moving in a series of flowing, controlled postures specifically designed to work every part of the body. Starting with gently warm-ups, you move to an active and energizing phase to get your heart pumping and your body jumping, followed by a series of soothing cool-downs -- so be prepared to sweat and then relax! Benefit from expert guidance. Kia's extensive teaching experience means that she is able to explain how to get maximum benefit from the athletic postures and graceful Sun Salutes, how to substitute less challenging alternatives where necessary, and how to avoid common errors. it you are aiming for all-round fitness, this is the ideal workout.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "DK Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Cooking class pasta: Cookbook",
        "Authors": "By Publications International Ltd",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "A Remarkable Mother",
        "Authors": "By Carter, Jimmy",
        "Description": "A Remarkable Mother is President Carter's loving, admiring, wry homage to Miss Lillian Carter, who championed the underdog always, even when her son was president. A registered nurse, pecan grower, university housemother, Peace Corps volunteer, public speaker, and renowned raconteur, Miss Lillian ignored the mores and prejudices of the racially segregated South of the Great Depression years. She was an avid supporter of the Brooklyn Dodgers (because she happened to attend the first major league baseball game in which Jackie Robinson, from Cairo, Georgia, played), was a favored guest on television talk shows (usually able to \"steal the microphone\" from hosts such as Johnny Carson and Walter Cronkite), and an important role model for the nation. Jimmy Carter's mother emerges from this portrait as redoubtable, generous, and forward-looking. He ascribes to her the inspiration for his own life's work of commitment and faith.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Endless Universe: The story of space, time, and the search for life beyond our planet",
        "Authors": "By Heather Couper, Nigel Henbest",
        "Description": "",
        "Category": "",
        "Publisher": "Covent Garden Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Come on, People: On the Path from Victims to Victors",
        "Authors": "By Cosby, Bill and Poussaint, Alvin F.",
        "Description": "Bill Cosby and Alvin F. Poussaint have a powerful message for families and communities as they lay out their visions for strengthening America, or for that matter the world. They address the crises of people who are stuck because of feelings of low self-esteem, abandonment, anger, fearfulness, sadness, and feelings of being used, undefended and unprotected. These feelings often impede their ability to move forward. The authors aim to help empower people make the daunting transition from victims to victors. Come On, People! is always engaging, and loaded with heart-piercing stories of the problems facing many communities.",
        "Category": " Social Science , Ethnic Studies , African American Studies",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Market-driven Health Care: Who Wins, Who Loses In The Transformation Of America's Largest Service Industry",
        "Authors": "By Herzlinger, Regina E.",
        "Description": "What happens when the demanding consumers who nearly brought the U.S. automobile industry to its knees focus the same kinds of pressure on the industry that represents one-seventh of the U.S. economy?health care? The health organizations that combine quality, convenience, information, choices, and lower costs will be the winners in this revolution. Regina Herzlinger, chaired professor at the Harvard Business School, distills the facts from the noise surrounding the one industry whose measures of success are life and death. In a thoroughly readable, anecdotal style, she pinpoints the drivers of change?the savvy consumer, the cost-conscious payer, and the rapidly improving technology?that will revolutionize the American health-care system. This is a must-read for those in every corner of the immense health-care web. With its strong narrative style, this is a book that will be read and talked about by everyone concerned about the future of American health care.",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Great Dads: A Celebration of Fatherhood",
        "Authors": "By Decker, Jonathan P. (EDT)",
        "Description": "",
        "Category": " Family & Relationships , General",
        "Publisher": "Adams Media Corp",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Ideals Favorite Christmas Desserts",
        "Authors": "By Ideals Publications Inc",
        "Description": "",
        "Category": " Cooking , Holiday",
        "Publisher": "Ideals Childrens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "The Tabasco Cookbook: 125 Years of America's Favorite Pepper Sauce",
        "Authors": "By McIlhenny, Paul and Hunter, Barbara",
        "Description": "\"Tabasco sauce is an indispensable ingredient, and always on my kitchen counter. I am a loyal Fan.\"Pierre FraneyThe world would be a much blander place without that familiar little red bottle with the white diamond label.Ever since Edmund McIlhenny introduced his soon-to-be-famous pepper sauce in 1868, raw oysters and Bloody Marys have depended on that definitive dash to make them complete. Now, Paul McIlhenny unbottles the authoritative cookbook on this very special sauce. It's no surprise that a generous amount of Tabasco sauce adds heat and bite to foods, but The Tabasco Cookbook reveals that a judicious amount will add \"roundness\" to flavors in a multitude of ways.Tempting recipes range from contemporary offerings such as Potato, Artichoke, and Leek Soup, Devil's Chicken, and Lemon Sesame Asparagus to a host of Tabasco Classics -- regional favorites such as Eula Mae's Cajun Seafood Gumbo, Grillades for Brunch, Shrimp Creole, and Dirty Rice. Each recipe is rated from (gives flavors a lift) to (not for the meek) according to its piquancy level, and simple tips on using Tabasco sauce to heighten the flavor of everything from popcorn to polenta are sprinkled throughout the pages.The Tabasco Cookbook is filled with vignettes describing the venerable history of the pepper sauce and the family-run company behind it, as well as bits of trivia and lore revealing elusive facts, such as what a \"petit baton rouge\" is (page 130). With more than thirty-five duotone photographs from the McIlhenny archives, The Tabasco Cookbook brings to life the history behind one of America's most classic ingredients.So don't just reach for the Tabasco sauce when you're thinking \"hot\": Tabasco sauce is the perfect solution whenever flavors need a lift.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Secrets of the Tsil Cafe",
        "Authors": "By Averill, Thomas Fox",
        "Description": "Young Weston Hingler becomes cuaght in the middle of his parents' culinary diversity, secrets, histories, infidelities, and needs as he grows up in a cross-cultural extended family that exists between two kitchens--one new World, the other traditional. 25,000 first printing.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Blue Hen",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Ultimate Bicycle Book (DK Living)",
        "Authors": "By Grant, Richard and Ballantine, Richard",
        "Description": "In the tradition of DK's visual dictionaries, this colorful guide describes different types of bicycles, equipment, clothing, and accessories; various levels of riding, from casual commuting, to touring and endurance riding, to the traffic antics of bike messengers; choosing and buying a bicycle; and basic adjustments and repairs. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Sports & Recreation , Cycling",
        "Publisher": "DK Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Mother",
        "Authors": "By l-a-rentschler",
        "Description": "",
        "Category": "",
        "Publisher": "Madison Park Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Big Flavors of the Hot Sun: Recipes and Techniques from the Spice Zone",
        "Authors": "By Schlesinger, Chris, Willoughby, John, and Witschonke, Alan (ILT)",
        "Description": "An exuberantly written cookbook featuring intensely flavored cooking from tropical and subtropical parts of the globe.  Written collaboratively by a food writer and a cook/restauranteur of 20 years, this book contains enticing, imaginative, yet quite simple recipes; background on the cooking techniques of the varied cultures from which the recipes are drawn; clear instructions and diagrams; interesting facts and stories about spices; and a casual, anecdotal style that makes for entertaining reading. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Cooking , Reference",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Chiles (Basic Flavoring Series)",
        "Authors": "By Merrell, James (PHT) and Gordon-Smith, Clare",
        "Description": "Thirty quick and tasty recipes are accompanied by full-color photographs and instructions on how to use chiles to enhance favorite dishes; and menu selections include Roast Quail in a Cumin and Chile Crust with Sweet Potato Chips and Red Pepper Jelly.",
        "Category": " Cooking , Specific Ingredients , Vegetables",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Matters of the Heart Devotions for Women",
        "Authors": "By Bynum, Juanita",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "Charisma Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "White House Cookbook: Revised and Updated Centennial Edition",
        "Authors": "By Ziemann, Hugo, Geil, Patti Bazel, Gillette, F. L., and Ross, Tami",
        "Description": "A nineteenth-century cookbook includes presidential menus, household hints, and recipes for breads, meats, seafood, vegetables and desserts",
        "Category": " Cooking , General",
        "Publisher": "Chronimed Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Perfect Love",
        "Authors": "By Buchan, Elizabeth",
        "Description": "How far would she go for the Perfect Love? Many things can disrupt a long-time marriage. Prue Valour, 41, has spent her adulthood keeping house, making meals for her older husband, Max, and being a mother to their preadolescent daughter. Despite the comforts of life in their small English village, a vague discontent nags at Prue. But change is set in motion with the return of Max's petulant, icily beautiful daughter Violet. Moving in with her new baby and husband, Violet is as hateful to her step-mother Prue as she had been as a child. Worse, Violet resents her fretful baby. But Violet's husband Jamie is unexpectedly helpful, likeable, and caring. Drawn to each other, he and Prue are soon skirting a boundary between innocence and passion. But will Prue take that irrevocable step across?",
        "Category": " Fiction , Family Life , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.5",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "The Fourth Star: Dispatches from Inside Daniel Boulud's Celebrated New York Restaurant",
        "Authors": "By Brenner, Leslie",
        "Description": "For foodies, restaurant fans and restaurant workers, chefs and chef-wannabes, and for everyone who devoured Kitchen Confidential, here is a revealing look at what goes on behind the scenes at the world-renowned Restaurant Daniel as chef/owner Daniel Boulud strives for perfection–and for the New York Times’ top four-star rating. The hushed, elegant atmosphere of a fine restaurant often conceals an intensely stressful workplace where highly trained, underpaid staffers work backbreaking hours against impossible dead-lines, often at the whim of a driven and demanding yet creatively gifted boss. New York’s Restaurant Daniel is one such place. With the complete cooperation of Chef Daniel Boulud, author Leslie Brenner spent a full year at the restaurant, getting to know the staff in the kitchen, the front of the house, and the manager’s office. And she reports on it all with a vivid immediacy: the maître d’ shuffling reservations when a VIP shows up unannounced, the young pastry chef who gets passed over for a promotion (and then gets the last laugh), even the financial arrangements that keep the restaurant’s doors open for business. And underlying all the daily drama is Chef Boulud’s obsession with getting a fourth star from the New York Times.",
        "Category": " Cooking , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "420 Ways to Clean Everything",
        "Authors": "By Wylie, Harriet",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Great Adventures in Food: Fresh Ways to Celebrate Every Meal",
        "Authors": "By Haas, Ellen and Moore, Bonnie",
        "Description": "In a country in which poor eating habits affect people of all ages, a collection of recipes helps families develop a healthy eating style and provides valuable tips on all stages of meal preparation. 20,000 first printing.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "6.26",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Chef Paul Prudhomme's Seasoned America",
        "Authors": "By Prudhomme, Paul",
        "Description": "When one of America's most talented and best-loved chefs reinterprets the great American classics, the result is Chef Paul Prudhomme's Seasoned America, a beautifully illustrated collection of American favorites made even better.In his new book, Chef Paul transforms the plainest of dishes -- like a beef noodle casserole made from ground meat and pasta -- into delicious company fare. The humble tamale pie, lowly turkey hash, and ordinary ham loaf become truly memorable in his capable hands. His Texas Chili may be the best anyone has ever tasted. Mulacalong Chicken, a specialty of Charleston, South Carolina, has a soft curry flavor that's indescribably wonderful. He seasons traditional regional and ethnic dishes in unconventional and surprising ways that make a world of difference: thyme in the West Coast Oyster Stew, nutmeg in the New England Boiled Dinner, cardamom in Iowa Chicken and Corn Pot Pie, cumin in Oklahoma Fried Chicken and Biscuits, coriander in Brooklyn Borscht.Chef Paul's unique concept of \"building\" a dish to create maximum flavor and texture is used in many of his recipes, and a special section of the book explains exactly how it's done, in language anyone can understand. For example, Milwaukee Potato Soup has a base of grated potatoes for thickening and flavor, as well as two different sizes of diced potatoes for texture.Other formerly \"inelegant\" dishes are treated to the remarkable -- and frequently unorthodox-Chef Paul touch, to create food no one is likely to soon forget: A slow -- roasted, boneless stuffed chicken emerges juicy and brimming with flavor in Atchafalaya Boneless Roast Chicken. Indian fry bread topped with a spicy lamb stew and fresh salsa becomes the world's best Navajo Tacos.Through colorful stories, special tips on techniques, and invaluable information, you'll find all the encouragement you need to experiment with dishes you've always taken for granted. From Albuquerque Burritos to Lower East Side Latkes, Michigan Miner's Pasties to San Francisco Cioppino, Seasoned America and Paul Prudhomme will guide you step by step toward the successful creation of extraordinary American food.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    }
]