[
    {
        "Title": "Politically Correct Parables",
        "Authors": "By Walker, Robert Martin",
        "Description": "",
        "Category": "",
        "Publisher": "Andrews McMeel Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Little Mermaid (Fairy Tale Pop-up Book)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Playmore Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Walt Disney's Peter Pan to the Rescue (Golden Books)",
        "Authors": "By Walt Disney Productions",
        "Description": "Tinker Bell escapes from Captain Hook and his band of pirates in time to bring Peter Pan to rescue Wendy, her brothers, and the Lost Boys",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Daily Wisdom for Women: Practical, Biblical Insight for Today's Woman",
        "Authors": "By Fitzpatrick, Carol L.",
        "Description": "Daily Wisdom for Women has touched the lives of more than three-quarters of a million readers since its release in 1997. Now in a beautiful deluxe edition, this daily devotional will continue to encourage new generations of women. A year’s worth of scripture selections, devotional readings, and prayers offer insight to women seeking biblical wisdom that can applied directly to your life. Great for personal study and gift-giving!",
        "Category": " Religion , Devotional",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Never Be Lied to Again",
        "Authors": "By Lieberman, David J., Ph.D.",
        "Description": "How many times have you been manipulated or taken advantage of by someone's lies? Are you tired of being deceived, tricked, and fooled? Finally, renowned behaviorist David J. Lieberman shows you how to stop the lies and uncover the truth-- in any conversation or situation. In a simple, user-friendly format, Dr. Lieberman gives you the tools to determine, with uncanny accuracy, if you are being lied to.Utilizing newly developed techniques in hypnosis and psycholinguistics, this book also shows you how to easily influence anyone to tell the truth-- within minutes. Use it in any situation, from casual conversation to in-depth interviews. Never Be Lied to Again is chock-full of colorful examples and engaging scenarios to help you keep from being taken advantage of and give you that extra edge. Use these groundbreaking techniques to take control of every personal and business situation...and never be lied to again.",
        "Category": " Body, Mind & Spirit , Mindfulness & Meditation",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Christian's Secret of a Happy Life (Value Book)",
        "Authors": "By Smith, Hannah Whitall",
        "Description": "",
        "Category": " Religion , Christianity , Literature & the Arts",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "God's Answers for Your Life",
        "Authors": "By Kay Wheeler",
        "Description": "This scriptured guide to Christian maturity offers support and deeper spiritual understanding through the struggles of life.",
        "Category": " Religion , Inspirational",
        "Publisher": "Word Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "The Mark of a Man",
        "Authors": "By Elliot, Elisabeth",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Revell",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1981"
        }
    },
    {
        "Title": "The American Heritage Dictionary of the English Language",
        "Authors": "By American Heritage Publishing Company (EDT) and Harris, Robert W.",
        "Description": "Contains over 155,000 entries, with current meanings given first. Includes notes on usage, quoted and original examples, and several thousand illustrations.",
        "Category": " Reference , Dictionaries",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "8.09",
        "Publish Date": {
            "Month": "February",
            "Year": "1975"
        }
    },
    {
        "Title": "Southern Living 1988 Annual Recipes (Southern Living Annual Recipes)",
        "Authors": "By Southern Living",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Cooking Light 87",
        "Authors": "By Barnett, Robert A.",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "DK Essential Managers: Communicate Clearly",
        "Authors": "By Heller, Robert and Hindle, Tim",
        "Description": "Learn all you need to know about successful communication, from interpreting body language to writing letters, optimizing meetings, and speaking on the telephone. Communicate Clearly shows you how to hold an audience when making presentations and how to take notes or compile reports, and it also provides practical techniques for you to try in different settings. Power tips help you handle real-life situations and develop the first-class communication skills that are the key to a productive and informed workplace. The author practices what he preaches, communicating the clear communication skills with refreshing clarity. The DK Essential Managers series has sold over 2 million copies worldwide. Experienced and novice managers alike can benefit from these compact guides that slip easily into a briefcase or a portfolio. The topics are relevant to every work environment, from large corporations to small businesses. Concise treatments of dozens of business techniques, skills, methods, and problems are presented with hundreds of photos, charts, and diagrams. It is the most exciting and accessible approach to business and self-improvement available.",
        "Category": " Business & Economics , Business Communication , General",
        "Publisher": "DK",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "When Smart People Fail - Rebuilding Yourself For Success",
        "Authors": "By Carole Hyatt, Linda Gottlieb",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Ball Busters Baseball",
        "Authors": "By Moog, Bob",
        "Description": "The Ball Busters series will challenge and entertain both serious sports buffs and laid-back fans of the game. Each title includes a combo of trivia and word puzzles such as brainteasers, word searches and more.",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "University Games",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "How My Parents Learned to Eat (Rise and Shine)",
        "Authors": "By Friedman, Ina R. and Say, Allen (ILT)",
        "Description": "A young girl recounts the story of her parents' courtship as her father, an American sailor stationed in Yokohama, and her mother, a Japanese girl, overcome the problems of different cultures",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Sea Creatures: My First Pocket Guide",
        "Authors": "By Frank H. Talbot, James G. Mead",
        "Description": "",
        "Category": "",
        "Publisher": "National Geographic Society",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "101 Delicious Diabetic Recipes",
        "Authors": "By unknown",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Pubns Intl Ltd",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Peter Pan (A Stepping Stone Book(TM))",
        "Authors": "By Barrie, J. M., Dubowski, Cathy East (ADP), and Zallinger, Jean (ILT)",
        "Description": "Fly away with Peter Pan to the enchanted island of Neverland! This first chapter book adaptation of the classic novel, originally published in 1911, tells the story of the boy who never grows up. And when they join Peter on his magical island, Wendy and her brothers are in for exciting encounters with mermaids, an Indian princess, and pirates! Let the amazing adventures begin!",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "The Monsters' alphabet",
        "Authors": "By Wood, Kay",
        "Description": "The Sesame Street monsters present the letters of the alphabet.",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Nate the Great and the Tardy Tortoise",
        "Authors": "By Sharmat, Marjorie Weinman, Simont, Marc (ILT), and Sharmat, Craig",
        "Description": "These chapter books introduce beginning readers to the detective mystery genre. Perfect for the Common Core, kids can problem-solve with Nate, using logical thinking to solve mysteries! The sun is shining, the birds are singing, and someone is eating the flowers in Nate the Great's garden. A green tortoise is slowly, slowly stepping across the lawn, and Nate is slowly, slowly following him. Where does Nate's green guest truly belong? It may take all of Nate the Great's patience and sharp eyesight to find out slowly.",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Pickle Puss (The Kids of the Polk Street School)",
        "Authors": "By Giff, Patricia Reilly and Sims, Blanche (ILT)",
        "Description": "It's August, and Emily has big plans at the library. She's going to read lots of books and tack a paper fish next to her name for each one. Then Dawn Bosco says she can read more books than Emily. Not only that, both Emily and Dawn want to keep Pickle Puss, a stray cat thay found. They decide that whoever reads the most books can keep cat.When Emily adds a fish for a book she read along time ago, she has one more fish than Dawn. She knows she's cheating, but she wants to keep the cat. What a pickle she's in.",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1986"
        }
    },
    {
        "Title": "Hearts of Gold: Four True Life Stories About Compassion",
        "Authors": "By Denise Rinaldo, Rigoberta Menchu, Craig Kielburger",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Practical Baking (Practical Series Cookbooks)",
        "Authors": "By Parragon",
        "Description": "",
        "Category": "",
        "Publisher": "P3 Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Ridiculous Knock-Knocks & Super Silly Riddles (Flip Book! Two Books in One!)",
        "Authors": "By Chris Tait & Charles Keller",
        "Description": "",
        "Category": "",
        "Publisher": "Sterling Publishing Co., Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Star Wars Episode I: The Phantom Menace Movie Storybook",
        "Authors": "By George Lucas, Min Choi",
        "Description": "",
        "Category": "",
        "Publisher": "LucasBooks for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The Fantastic Cutaway Book of Spacecraft",
        "Authors": "By Hawkes, Nigel and Pang, Alex (ILT)",
        "Description": "Cutaway illustrations and text reveal how the space shuttle and other spacecraft work and what astronauts do in space",
        "Category": " Juvenile Nonfiction , Technology , Aeronautics, Astronautics & Space Science",
        "Publisher": "Copper Beech",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Certain Peace in Uncertain Times: Embracing Prayer in an Anxious Age",
        "Authors": "By Dobson, Shirley",
        "Description": "Shirley Dobson knows more than anyone else about mobilizing groups and individuals to pray effectively. In her new release, Certain Peace in Uncertain Times, the National Day of Prayer Task Force Chairman teaches readers to Praise, Repent, Ask, and Yield -- nurturing a true and lasting lifestyle of prayer. This memorable, biblically sound resource will motivate and encourage everyone to communicate daily with God. End result: Christians around the world praying as one -- not because they ought to, but because they want to!",
        "Category": " Religion , Prayer",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "THE RECTOR'S WIFE",
        "Authors": "By Trollope, Joanna",
        "Description": "For twenty years, Anna Bouverie, as a priest's wife, has served God and the parish in a variety of ways. She has baked for the Brownies, delivered parish magazines, washed and ironed her husband's surplices and clothed herself and her children in jumble-sale items.When her husband fails to gain promotion to archdeacon and retreats into isolated bitterness, and the bullying of her daughter at the local comprehensive reaches an intolerable level, Anna rebels. She takes a job in the local supermarket where she earns her own money, her sense of self-worth, the shocked disapproval of the parish and the icy fury of her husband.She also attracts the passionate interest of three very different men, each of whom was to play a significant part in the blossoming of her life ...",
        "Category": " Fiction , Sagas",
        "Publisher": "Corgi",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Bobbsey Twins #3: The Secret at the Seashore",
        "Authors": "By Hope, Laura Lee",
        "Description": "The twins are involved in the adventure of the robber who hid himself and the money in a amusement park",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Poppy and Rye (Poppy, 4)",
        "Authors": "By Avi and Floca, Brian (ILT)",
        "Description": "The third book in the beloved Poppy series by Newbery Medal–winning author Avi, with illustrations from Caldecott Medal–winning artist Brian FlocaHeartbroken over the death of her fiance, Ragweed, Poppy the deer mouse journeys west through the vast Dimwood Forest to bring the sad news to Ragweed's family. But Poppy and her prickly porcupine pal Ereth arrive only to discover that beavers have flooded the serene valley where Ragweed lived.Together Poppy and Ragweed's brother Rye brave kidnapping, imprisonment, and a daring rescue to fight the beavers. At the same time, Rye—who has lived in Ragweed's shadow—fights to prove himself worthy of Poppy's love.",
        "Category": " Juvenile Fiction , Animals , Mice, Hamsters, Guinea Pigs, etc.",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2020"
        }
    },
    {
        "Title": "The Weekend Crafter: Dough Craft: More than 50 Stylish Designs to Make and Decorate in a Weekend",
        "Authors": "By Neal, Moira",
        "Description": "Shows how to turn flour, salt, paint, varnish, and household tools found in most kitchens into fifty decorative items, captured in 184 instructional color photographs outlining how to mold, incise, and sculpt the dough. Original. 40,000 first printing.",
        "Category": " Crafts & Hobbies , Dough",
        "Publisher": "Lark Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Clinical Interviewing and Counseling: Principles and Techniques (Appleton psychiatry series)",
        "Authors": "By Golda M. Edinburg, Norman Zinberg, Wendy Kelman",
        "Description": "",
        "Category": "",
        "Publisher": "Appleton-Century-Crofts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "I Can Tell the Time",
        "Authors": "By Gillian Davies",
        "Description": "",
        "Category": "",
        "Publisher": "Brimax Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Chicken Soup for the Golfer's Soul The 2nd Round: 101 More Stories of Insight, Inspiration and Laughter on the Links (Chicken Soup for the Soul)",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), Donnelly, Mark (COM), Donnelly, Chrissy (COM), and Aubery, Jeff (COM)",
        "Description": "Whether readers are relatively new to the game of golf or old hands with impressive handicaps, most golfers share an unbridled enthusiasm for the game as proven by the blockbuster success of the first Chicken Soup for the Golfer's Soul. Due to popular demand, the coauthors have compiled this follow-up filled with more stories to celebrate the foibles, feats and famous people on the fairway.Written by professional and amateur golfers, caddies and weekend hackers, these stories reveal the most universal aspects of the game so many millions enjoy. With stories about sportsmanship, overcoming obstacles, connecting generations and savoring each moment, this book is an entertaining read as well as a profound reminder for lessons learned both on and off the greens.",
        "Category": " Self-help , Spiritual",
        "Publisher": "HCI",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Meditation For Dummies",
        "Authors": "By Bodian, Stephan",
        "Description": "“A useful guidebook filled with clear instructions and helpful hints.”—Deepak Chopra“An easy-to-follow yet comprehensive introduction to the practice of meditation.”—John Gray, author, Men Are From Mars, Women are From VenusMeditation Pluses: it can improve your focus and concentration; reduce tension, anxiety and stress; promote creativity and enhanced performance in work and play; lower blood pressure; and improve immune response. Also, it requires no special clothing or equipment, it can be done anywhere, and you can learn the basics in just minutes. Meditation Minuses: it will never be an Olympic event and it won’t make it easier for you to get a date...on the other hand, the improved health, vigor and self-awareness that comes with the practice of meditation can do wonders for your love life. Interested?Packed with state-of-the-art information and savvy advice, this friendly guide demystifies meditati on traditions and practices and shows you step-by-step how to relax, take a deep breath, and open yourself to inner peace and understanding. You’ll discover how to:Understand meditation traditionsDevelop a meditation practice that works for youOvercome roadblocks to happiness and successCultivate your spiritual sideExtend meditation into your daily lifeMeditate to heal or to achieve peak performanceExpert Stephen Bodian distills the best of the various meditation traditions and gently leads you step-by-step to discover a form and style of meditation that works best for you. Instruction manual, survey course, and a guide to deeper exploration, Meditation For Dummies covers all the bases. You’ll discover:Where meditation comes from and various traditions around the worldHow to prepare for meditation and how to sit, dress and other practical aspectsHow meditation can help you open your heart to love, compassion, and forgivenessHow to troubleshoot emotional, behavioral, professional and physical problems using meditationHow to use meditation for healing and performance enhancementPeople throughout history have used some form of meditation for self-improvement and spiritual enlightenment. Now let Meditation For Dummies introduce you to the amazing benefits of sitting still and focusing.",
        "Category": " Health & Fitness , Yoga",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Commonsense Bidding: The Most Complete Guide to Modern Methods of Standard Bidding",
        "Authors": "By William S. Root",
        "Description": "",
        "Category": "",
        "Publisher": "Crown Publishers Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "Personal Finance For Dummies (Personal Finance for Dummies, 3rd ed)",
        "Authors": "By Tyson, Eric",
        "Description": "Many Americans don’t understand personal finance. If you’re among them, it’s probably not your fault. Personal Finance 101 is not offered in our schools – not in high school, not even in the best colleges and graduate schools. It should be. There are common financial problems and mistakes and different people keep making those same mistakes over and over again. Personal Finance For Dummies, 3rd Edition, like a good friend, can stop you from falling into those traps.This book is for anyone who wants a crash course in personal finance. It’s basic enough for a novice to get his or her arms around thorny financial issues, but advanced readers will be challenged to think about their finances in a new way and identify areas for improvement. In a nutshell, this easy-to-understand guide is for anyone who wants toGet out of high-interest consumer deptPlan for major goalsStart an investment programMinimize high piles of bills, receipts, and junk mailYou’ll explore what it takes to start an investment program as you diagnose your current financial health, set new goals, and reduce your spending. Personal Finance For Dummies, 3rd Edition, also covers:Figuring out where your dollars are goingSolving debt and credit problemsReducing your tax burdenPicking up wise investmentsPaying the right price for insuranceFiguring out where to go for more financial informationBest-selling personal finance writer Eric Tyson is a master at keeping it simple. And his third edition of Personal Finance For Dummies, can help you consider your higher life goals and non-financial priorities (your family, your friends, and your causes) and how you can best accomplish those with the financial resources you have.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "IDG Books Worldwide",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "simple truths for Teachers",
        "Authors": "By Freeman, Georgann, Jones, Marie, and stevenson, June",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International Inc.",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Other 90%: How to Unlock Your Vast Untapped Potential for Leadership and Life",
        "Authors": "By Cooper, Robert K.",
        "Description": "For centuries, it has been assumed that there are vast limits to human capacity. Now, although a host of scientific discoveries prove this wrong, a mindset of limits persists, blocking us from our greatest possibilities and leaving us feeling bombarded by stress, change, and uncertainty. No matter how hard we work, no matter how much we give, we're still not getting what we hoped for. There is another way.Dr. Robert Cooper, a neuroscience pioneer and leadership advisor, urges us to take a radically different view of human capacity. We are mostly unused potential, he says, employing less than 10 percent of our brilliance or hidden talents. In easy-to-follow steps, he explains how to develop and apply the art and science of your hidden capacity.The art is the motivation and inspiration coming from the wonderful stories that are the heart of The Other 90%. Dr. Cooper draws on his wide-ranging insights and experiences to show how it's possible to make a difference in yourself and others.However, inspiration without a way to turn vision into reality is an empty vessel. Combining art with science, Dr. Cooper provides extraordinary help in the form of specific, little-known practical ways to use the latest research in neuroscience, performance psychology, and work physiology for excelling in a pressure-filled world.  He shows you how to:* Increase energy at work -- and have more energy for personal and family life.* Activate the brain's \"alertness switches\" to defeat pressure and stress.* Use not only the brain in your head but the ones in your heart and gut.* Motivate exceptional ingenuity and performance in yourself and others.The most exciting breakthroughs will not come from advances in technology but from a deeper realization of what it means to be most human and alive. Many of the choices that can dramatically change our lives are simple and practical -- yet few people know what these choices are or how to apply them in work and life. The Other 90% is your guide to new territory and new challenges.",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Currency",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Patio Roofs and Gazebos",
        "Authors": "By Sunset Books, Sunset Books (COR), Vandervort, Donald W., and Feldman, Fran",
        "Description": "Presents ideas, plans, and installation techniques for building gazebos, patio roofs, arbors, and other garden structures",
        "Category": " House & Home , Outdoor & Recreational Areas",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Decks (Southern Living)",
        "Authors": "By Sunset Books",
        "Description": "Shows a variety of deck styles and designs, explains each step of the building process, and offers advice on materials and customization",
        "Category": " Technology & Engineering , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Daughters Of England",
        "Authors": "By Carr, Philippa",
        "Description": "Sarah Standish, a naive girl of humble means, defies her parents to run off to become an actress on the London stage. She soon develops a friendship with the well-to-do Lord Rosslyn, a man with more than friendship on his mind. The innocent Sarah weds Rosslyn, and she is pregnant by the time she learns that Rosslyn has another wife. She flees with her daughter, Kate, but dies while Kate is still very young.Lord Rosslyn's intrigue does not end with Sarah's death; his greed eventually fixes on Kate as a means of securing the fate of Rosslyn Manor through an arranged marriage - a fate that Kate is determined to deny him.",
        "Category": " Fiction , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Angels: God's Secret Agents",
        "Authors": "By Graham, Billy",
        "Description": "",
        "Category": "",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "Anatomy and Physiology Volume Cells Tissues",
        "Authors": "By Steen, Edwin Benzel, Montagu, Ashley",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "6.03",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "More Spaghetti, I Say! (Scholastic Reader Level 2)",
        "Authors": "By Gelman, Rita Golden and Gerberg, Mort (ILT)",
        "Description": "Minnie the monkey is too busy eating spaghetti--all day, in all ways--to play with her friend Freddie.",
        "Category": " Juvenile Fiction , Cooking & Food",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "My Tooth Is About to Fall Out (Scholastic Reader Level 1)",
        "Authors": "By MacCarone, Grace and Lewin, Betsy (ILT)",
        "Description": "A little girl loses a tooth.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "The Worst Helper Ever (Step-Into-Reading, Step 2)",
        "Authors": "By Scarry, Richard and Scarry, Richard (ILT)",
        "Description": "Learn to read with Richard Scarry and Step Into Reading!Farmer Pig is having a very busy day. He needs a helper. Charlie Cat can help. Or can he? Time after time, Charlie causes hilarious mayhem as he tries to assist with milking the cow, watering the garden and clearing the table. While strengthening their word recognition skills, early readers will laugh at the exploits of the hapless pig and cat, and learn that everyone makes mistakes sometimes.",
        "Category": " Juvenile Fiction , Lifestyles , Farm & Ranch Life",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "This Little Piggy Played the Fiddle",
        "Authors": "By Susan James Frye",
        "Description": "",
        "Category": "",
        "Publisher": "Kindermusik International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "I Spy Pirate Treasure (I Spy Tv Tie-in)",
        "Authors": "By Marzollo, Dan and Yoshimoto, Ward (ILT)",
        "Description": "Ahoy, mateys! Play I Spy!This book features Spyler and CeCe, characters from the I Spy TV show.Spyler and CeCe look for pirate treasure as they follow a treasure map.When Spyler and CeCe have found everything, the two friends bury their chest again and make a new map!Throughout, children can play I Spy and look for fun objects. At the end there's an extra I Spy game!",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Happy Trick-Or-Treaters (Read With Me)",
        "Authors": "By Packard, Mary and Micucci, Charles (ILT)",
        "Description": "Ten animal friends trick-or-treat their way through the woods on their road to a surprise Halloween party for Frog, in a rhyming tale complete with appealing animal illustrations. Original.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Halloween",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Arthur's Loose Tooth",
        "Authors": "By Hoban, Lillian",
        "Description": "Arthur, afraid of pulling his loose tooth, and his little sister, Violet, learn something about being brave in the seventh adventure about two favorite chimps.",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "My Dad Is Awesome (My Relative Series)",
        "Authors": "By Butterworth, Nick",
        "Description": "A young boy extols the virtues of his father",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Dinosaur (Special Edition Storybook)",
        "Authors": "By Bazaldua, C. (ADP)",
        "Description": "When a meteor destroys Lemur Island, a dinosaur who has lived there alone except for his lemur friends escapes to a land that is dangerous, but filled with dinosaurs of all shapes and sizes.",
        "Category": " Juvenile Fiction , Animals , Dinosaurs & Prehistoric Creatures",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Great Adventures That Changed Our World",
        "Authors": "By Reader's Digest Association",
        "Description": "Presents accounts of more than a hundred great journeys, from the first voyage beyond the horizon to the first lunar landing, using diaries, logs, and other primary sources",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "The Finishing School",
        "Authors": "By Godwin, Gail",
        "Description": "Forty-year-old actress Justin Stokes recalls the summer she turned fourteen and her relationship with Ursula DeVane, the older woman who made that summer memorable",
        "Category": " Fiction , Psychological",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "Peter Rabbit Birthday Book",
        "Authors": "By Potter, Beatrix",
        "Description": "",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Greenwich House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Behind the Lines (Corps, Vol 7)",
        "Authors": "By Griffin, W. E. B.",
        "Description": "On the island of Mindanao, a man calling himself \"General\" Fertig has set himself up as a guerrilla leader to harass the Japanese. Army records show that the only officer named Fertig in the Philippines is a reserve lieutenant colonel of the Corps of Engineers, reported MIA on Luzon, but still, the reports filtering out are interesting, and it's Marine lieutenant Ken McCoy's mission to sneak behind the lines and find out if he's for real.",
        "Category": " Fiction , War & Military",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Forever Angels: The Forgotten Angel",
        "Authors": "By Weyn, Suzanne",
        "Description": "When an accident leaves Christina blind and feeling abandoned, she regains her faith in angels as she makes adjustments in her life and endures the operation that restores her vision",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Making Peace With Your Partner: Healing Conflicts in Marriage",
        "Authors": "By Wright, H. Norman",
        "Description": "Describes the characteristics of a successful marriage, shares experiences that can strenghten a marriage, and stresses the importance of strong Christian faith",
        "Category": " House & Home , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Low-Fat Gourmet Chicken",
        "Authors": "By Clark, Eleanor and Eddy, Jackie",
        "Description": "Presents a variety of low fat, low cholesterol chicken recipes for soups, salads, stews, Oriental dishes, and entrees",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Prima Lifestyles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "R U 4 Real? (TodaysGirls.com #4)",
        "Authors": "By Brown, Terry and Peacock, Nancy Been",
        "Description": "Meet MayaRU4 Real:  Maya pushes the perfect appearance . . . until it perfectly pushes her to the edge. She's trying to organize a fashion show. She bought the dresses, and they can't be exchanged. Now, she can't believe her friends are going to the lake house without her. They only have a week to squeeze into their designer dresses-and she knows they're all gonna just pig out the whole time. She'll be the only one left with a waistline.",
        "Category": " Young Adult Fiction , Religious , Christian , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Stranger Online (TodaysGirls.com, No. 1)",
        "Authors": "By Smith, Carol and Brown, Terry K.",
        "Description": "Meet AmberMysterious, threatening emails end up in Amber's mailbox in her mailbox on the girls Web site. But only the today's girls know about their new site! Suddenly, the stranger logs on during a routine nightly chat session. Who could this sixth person be? Amber's integrity-and her spot on the swim team-is called into question before she manages to solve the mystery and save her reputation.",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Easy Does It Creative Decor and so Much More!",
        "Authors": "By Anne Van Wagner Childs",
        "Description": "",
        "Category": "",
        "Publisher": "Steve Patterson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Look and Find Disney's Pocahontas",
        "Authors": "By Internatl Publications, Walt Disney Prod",
        "Description": "",
        "Category": "",
        "Publisher": "Phoenix Intl Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Day and Night (Bear Facts, Volume 4)",
        "Authors": "By Bennett, David",
        "Description": "",
        "Category": "",
        "Publisher": "Reader's Digets Association, Inc.",
        "Price Starting With ($)": "5.75",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Fix-It and Forget-It Cookbook: Feasting with Your Slow Cooker",
        "Authors": "By Ranck, Dawn J. and Good, Phyllis Pellman",
        "Description": "Provides recipes for appetizers, soups, stews, main dishes, and desserts suitable for slow cookers, including cooking tips and variations.",
        "Category": " Cooking , Methods , Special Appliances",
        "Publisher": "Good Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "The Blue Bottle Club",
        "Authors": "By Penelope Stokes",
        "Description": "",
        "Category": "",
        "Publisher": "Nashville Word Publishing",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Sick Puppy",
        "Authors": "By Hiaasen, Carl",
        "Description": "When Palmer Stoat notices the black pickup truck following him on the highway, he fears his precious Range Rover is about to be carjacked. But Twilly Spree, the man tailing Stoat, has vengeance, not sport-utility vehicles, on his mind. Idealistic, independently wealthy and pathologically short-tempered, Twilly has dedicated himself to saving Florida's wilderness from runaway destruction. He favors unambiguous political statements -- such as torching Jet-Skis or blowing up banks -- that leave his human targets shaken but re-educated.After watching Stoat blithely dump a trail of fast-food litter out the window, Twilly decides to teach him a lesson. Thus, Stoat's prized Range Rover becomes home to a horde of hungry dung beetles. Which could have been the end to it had Twilly not discovered that Stoat is one of Florida's cockiest and most powerful political fixers, whose latest project is the \"malling\" of a pristine Gulf Coast island. Now the real Hiaasen-variety fun begins . . .Dognapping eco-terrorists, bogus big-time hunters, a Republicans-only hooker, an infamous ex-governor who's gone back to nature, thousands of singing toads and a Labrador retriever greater than the sum of his Labrador parts -- these are only some of the denizens of Carl Hiaasen's outrageously funny new novel.Brilliantly twisted entertainment wrapped around a powerful ecological plea, Sick Puppy gleefully lives up to its title and gives us Hiaasen at his riotous and muckraking best.",
        "Category": " Fiction , Political",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Charleston: Come Hell or High Water (A History in Photographs)",
        "Authors": "By Whitelaw, Robert N. S.",
        "Description": "",
        "Category": " History , United States , State & Local , General",
        "Publisher": "Alice F. Levkoff",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Gideon's Torch",
        "Authors": "By Colson, Charles and Vaughn, Ellen Santilli",
        "Description": "Attorney General Emily Gineen must deal with the chaos decending upon Washington, as the new administration of President J. Whitney Griswold copes with a controversial murder, a TV network hijacking, a terrorist bomb, and the emergence of new undergroundnetworks formed by ordinary citizens",
        "Category": " Fiction , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Introduction to Ordinary Differential Equations",
        "Authors": "By LaFeber, Walter",
        "Description": "",
        "Category": "",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.28",
        "Publish Date": {
            "Month": "March",
            "Year": "1980"
        }
    },
    {
        "Title": "Compass American Guides: South Carolina",
        "Authors": "By Leifermann, Henry and Horan, Eric (PHT)",
        "Description": "",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Compass America Guides",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Girl Talk: Mother-Daughter Conversations on Biblical Womanhood",
        "Authors": "By Mahaney, Carolyn and Mahaney Whitacre, Nicole",
        "Description": "Mothers and daughters have a lot to talk about. That’s how God designed it. A mother is her daughter’s first role model, teacher, and friend, and she carries the responsibility of passing on to her daughter a legacy of biblical womanhood.Join mother-daughter team Carolyn Mahaney and Nicole Whitacre as they give you insights and suggestions on how to talk—really talk—to each other about what it means to become a godly woman. Tips and study questions make it easy for moms and their pre-teen and teenage daughters to read, share, discuss, and grow. “The Mahaney women’s chatty and comfortable approach is deeply biblical and straightforward, connecting with all sorts of relationships, including single moms, stepmoms, adoptive families, and those in either healthy or challenging relationships.”—Noël Piper, author of Treasuring God in Our Traditions“This delightful read is filled with warmth, wit, and wisdom—and loads of practical ways to apply the gospel to real issues facing teen girls.… I am grateful for this call to mothers to pass the legacy of biblical womanhood to their daughters.”—Susan Hunt, Women in the Church Consultant, Presbyterian Church in America",
        "Category": " Religion , Christianity , General",
        "Publisher": "Crossway",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Historic Inns of America: Historic Inns of the South",
        "Authors": "By Gieseking, Hal",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "The Art and Technique of Decorating With Fabric",
        "Authors": "By Clifton-Mogg, Caroline and Paine, Melanie",
        "Description": "Looks at the history of fabric decoration, shows window and room treatments, and offers advice on fabric selection",
        "Category": " Art , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.23",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "The Practical Guide to Decorative Antique Effects",
        "Authors": "By Sloan, Annie",
        "Description": "Applying a variety of ideas from colorwashing to decoupage, a detailed reference demonstrates how inexpensive furniture and objects can be made to look like antiques while providing tips on equipment, surfaces, and more. 25,000 first printing.",
        "Category": " House & Home , Decorating",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "In Danger's Path (Corps #8)",
        "Authors": "By Griffin, W. E. B.",
        "Description": "Desperate to find someone to unite the warring interests of General MacArthur, Admiral Nimitz, and OSS chief Donovan, FDR puts Fleming Pickering in charge of the OSS's Pacific operations. Immediately, two urgent missions fall into his lap: to contact and rescue a band of former American servicemen and their dependents on the run from the Japanese in the Gobi Desert of Mongolia; and at the same time, to set up a weather station in the Gobi to help direct planned aerial attacks against Japan.Pickering has a free hand to use whomever he pleases, and he is soon surrounded by many of the Marines on whom he has come to rely during the war: men like Ken McCoy, Ed Banning, Jake Dillon, Ernie Zimmerman, and - much to his surprise - a certain scapegrace pilot named Malcolm Pickering, his son. Together, they will venture in terra very much incognita - and with luck they may even come out alive....",
        "Category": " Fiction , War & Military",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Country Finishes: Simple Paint Treatments for Found and Unfinished Furniture",
        "Authors": "By Kollath, Richard and Ross, George (PHT)",
        "Description": "Twenty-two original paint projects show readers how to turn flea-market finds and generic unfinished furniture into charming country classic, presenting all the necessary techniques, including sponging, stippling, scumbling, stenciling, combing, and decoupage.",
        "Category": " Technology & Engineering , General",
        "Publisher": "Bulfinch Pr",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Decorating Year-Round: Shaping Your Style Through the Seasons",
        "Authors": "By Better Homes and Gardens Books and Ingham, Vicki L. (EDT)",
        "Description": "Decorating ideas and projects organized by season.Whole-house tours that convey seasonal palettes—pinks and greens and creams for spring, bright tropical colors for summer, etc.Chapters include at a glance, tip-style, and step-by-step projects.Multiple room arrangement ideas and tips with floor plans.Ideas to change rooms with color, furniture placement, and accessories to reflect the mood of the season.Resource directory for materials and furnishings pictured.Shopping sources for decorating materials cited.",
        "Category": " House & Home , Decorating",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "New Country Collecting",
        "Authors": "By Emmerling, Mary Ellisor, Greene, Joshua (PHT), Sheehan, Carol Sama, and Greene, Joshua",
        "Description": "No one knows country antiques and collectibles better than Mary Emmerling, and in her fifteenth book, Mary Emmerling's New Country Collecting, she shows that even for the most dedicated collector, there is always something new to discover.To show what's new in collecting Mary criss-crossed the country, visiting twenty-one homes of collectors and dealers - all unique showcases of collecting passion. In Collector's Choice, she introduces the homes of dedicated \"keepers\" - some who have collected classic country for twenty-five years, and others who specialize in the newer areas of collecting - Native American and rustic furniture, or an eclectic mix of Scandinavian and Amish. In Dealer's Choice, she presents the homes of the experts, who are more often found behind the scenes, and whose collections represent not only passion, but also discipline and a highly trained eye.Interspersed with the inspiring interiors are Mary's secrets for collecting today, organized in twelve special sections - Found Collections, Smalls, Native Crafts of the Southwest, The Eclectic Decorator, The Tale of the Tag, Care and Feeding of Antiques, The Allure of Painted Furniture, The Art of Picking, The Romance of Wood, Shopping for Antiques, The Next Wave, and Religious Art of New Mexico.With 350 photographs, Mary Emmerling's New Country Collecting is an inspiration for both collecting and decorating. With its special how-to \"miniseminars\" and its national source listing, it is the best resource for today's collector. And with Mary Emmerling as the guide, it is an exciting, enriching tour through the collector's world.",
        "Category": "",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Webster's New World Student Writing Handbook",
        "Authors": "By Sorenson, Sharon",
        "Description": "The first comprehensive writing guide created expressly for high school and college students. Acclaimed by students, educators, and parents, this guide has assisted thousands of students in writing top-quality essays, term papers, and reports, on any school subject.",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Webster's New World",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Martha Stewart's Pies and Tarts",
        "Authors": "By Stewart, Martha",
        "Description": "Shares recipes for glazes, pastries, and pies and tarts which feature apples, pears, peaches, plums, berries, lemons, vegetables, nuts, chocolate, custards, and creams",
        "Category": " Cooking , Courses & Dishes , Pies",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "Decorative Style: The Most Original and Comprehensive Sourcebook of Styles, Treatments, Techniques",
        "Authors": "By McCloud, Kevin, Embree, James Cook, and Crockett, Michael",
        "Description": "Decorative Style is the most practical and innovative resource of decorating styles, techniques, and tools and materials ever created.  Using innovative, easy-to-master techniques and surprisingly inexpensive materials (paint, paper, fabric, replica molding -- even photocopies!), Kevin McCloud -- a brilliant young set designer turned interior decorator -- shows you everything you need to know to design and create your own stunning adaptations of today's most popular decorating styles.  There are forty styles in all -- from Santa Fe, Shaker, Miami Deco, and Caribbean to Bauhaus, Biedermeier, Mackintosh, and French Country (to name just a few) -- each designed and created especially by the author and stunningly photographed, with literally hundreds of styling options and color variations to choose from.  Each style is represented by a complete floor-to-ceiling \"room slice\" -- a unique device that allows you to see the total impact of a scheme while easily visualizing its possibilities for your own room. The decorative effects and other components of each style are analyzed, rephotographed with a full range of imaginative alternatives, and cross-referenced to all the techniques, tools, and materials needed to create each unique effect. Even the most inexperienced and budget-conscious of home owners will be inspired by Kevin McCloud's imaginative use of inexpensive, readily available materials and amazing timesaving techniques.  Whether you do the work yourself or hire it out, whether you're redoing an alcove or an entire house, Decorative Style will kindle your imagination and give you all the tools you need to create spectacular, one-of-a-kind interiors that will truly distinguish and enhance the value of your home.",
        "Category": " House & Home , Repair",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.24",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Teach Yourself HTML VISUALLY (Idg's 3-D Visual Series)",
        "Authors": "By Maran, Ruth",
        "Description": "HTML is the markup language that designed for creating Web pages. But how do you learn the code, techniques, and cascading stylesheets when you can't see what you're building? Armed with Teach Yourself HTML Visually, you get the building blocks you need to master links, embedded images, sounds and video, and frames to create a dynamic site with visual appeal. With a graphical format and step-by-step examples, Teach Yourself HTML Visually will help you can take on HTML and enhance your Web site at your own pace",
        "Category": " Computers , Programming Languages , HTML",
        "Publisher": "Visual",
        "Price Starting With ($)": "6.15",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Mary Emmerling's American Country Classics: The New American Country Look",
        "Authors": "By Emmerling, Mary Ellisor and Sheehan, Carol Sama",
        "Description": "Emmerling's  American country  (1980) introduced handmade furniture, rag rugs, folk art, baskets, boxes, and quilts. The \"new\" look more sophisticated, more elegant, and less cluttered emphasizes comfort as well as cuteness in country-style homes all over the US, including a restored farmhouse in New England, a former stable in Southern California, a condo in Utah, and a cottage in Mississippi. With some 250 color photographs. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "7.56",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "NIrV: New International Reader's Version - New Testament, Young Reader's Edition",
        "Authors": "By Anonymous",
        "Description": "",
        "Category": " Bibles , New International Version , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Precious Moments Stories from the Bible",
        "Authors": "By Baker Book House, Haan, Sheri D.",
        "Description": "",
        "Category": "",
        "Publisher": "Baker Book House",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Decorating Eden",
        "Authors": "By Wilkinson, Elizabeth and Henderson, Marjorie (EDT)",
        "Description": "First published in 1985 as  The House of boughs , this revised edition of the lovely, comprehensive sourcebook of garden architecture and artifacts draws on seven centuries of history and design from gardens throughout the world, all organized by topic in alphabetical order and illustrated with some 1,000 line drawings, diagrams, and photographs. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Gardening , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Country Living Country Paint: Traditional Decorative Paint Techniques",
        "Authors": "By Levie, Eleanor, Murphy, Rhoda Jaffin, and Country Living Magazine (COR)",
        "Description": "Practical how-to instructions are combined with simple design ideas in a guide for country home owners that explores how different paint finishes result in varied effects and how color choice can make or break a room.",
        "Category": " House & Home , Decorating",
        "Publisher": "Hearst",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Faux Chic: Creating the Look You Want for Less (Interior Design and Architecture)",
        "Authors": "By Sterbenz, Genevieve A. and Sterbenz, Carol Endler",
        "Description": "",
        "Category": " House & Home , Decorating & Furnishings",
        "Publisher": "Quarry Books",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Period Details",
        "Authors": "By Miller, Martin",
        "Description": "",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Feeding Strategy (Phoenix Series)",
        "Authors": "By Owen, Jennifer",
        "Description": "Feeding is invoked in some way in almost all the encounters and associations between different species. The choice of food is immense: plants grow in a multitude of forms, from seaweeds to cactuses and from grasses to forest trees: animal prey is available from tiny krill in the oceans to antelopes on the plains. As almost every species is accessible to another with the right feeding strategy, there is a continual evolutionary jostling between eater and eaten for the advantage over the other.Among both plants and animals elaborate strategies have evolved for exploring the surrounding life as food. The feeding behavior of predators is based on a search and strike strategy. In contrast, grazers live surrounded by their food and are relatively immobile. Such animals as impalas and grasshoppers, whose persistent feeding make them ready prey, have evolved means of avoiding the notice of predators or methods of speedy escape. Plants that digest animal tissue have evolved complex and devious means to attract prey.The variations in style of these feeding encounters and the precision involved in some of the feeding mechanisms are the themes ofFeeding Strategy.",
        "Category": " Science , Life Sciences , Zoology , General",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1982"
        }
    },
    {
        "Title": "World on Fire: How Exporting Free Market Democracy Breeds Ethnic Hatred and Global Instability",
        "Authors": "By Chua, Amy",
        "Description": "The reigning consensus holds that the combination of free markets and democracy would transform the third world and sweep away the ethnic hatred and religious zealotry associated with underdevelopment. In this revelatory investigation of the true impact of globalization, Yale Law School professor Amy Chua explains why many developing countries are in fact consumed by ethnic violence after adopting free market democracy. Chua shows how in non-Western countries around the globe, free markets have concentrated starkly disproportionate wealth in the hands of a resented ethnic minority. These “market-dominant minorities” – Chinese in Southeast Asia, Croatians in the former Yugoslavia, whites in Latin America and South Africa, Indians in East Africa, Lebanese in West Africa, Jews in post-communist Russia – become objects of violent hatred. At the same time, democracy empowers the impoverished majority, unleashing ethnic demagoguery, confiscation, and sometimes genocidal revenge. She also argues that the United States has become the world’s most visible market-dominant minority, a fact that helps explain the rising tide of anti-Americanism around the world. Chua is a friend of globalization, but she urges us to find ways to spread its benefits and curb its most destructive aspects.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Management Information Systems, Eighth Edition",
        "Authors": "By Laudon, Kenneth C. and Laudon, Jane P.",
        "Description": "Information systems knowledge is essential for creating competitive firms, managing global corporations, and providing useful products and services to customers. This book introduces management information systems that readers will find vital to their professional success.  Emphasizes the digital integration of the firm through enterprise applications (management of the supply chain, customer relationships, enterprise systems, and knowledge). Offers vivid examples, engaging and interactive exercises, and the most up-to-date information to illustrate the impact of information technology on business. Highlights new applications and technologies to digitally enable business processes for electronic business and electronic commerce?i.e., what will improve firms' relationships with customers and create additional value.  Provides new Running Case on Laudon Web site and accompanying CD-ROM; examines a fictitious company called Dirt Bikes USA, with each text chapter containing a project requiring readers to use application software, Web tools, or analytical skills to solve a problem the company has encountered.  An indispensable reference for managers and executives who wish to integrate or update MIS in their",
        "Category": " Computers , Management Information Systems",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "7.37",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Why a Son Needs a Mom: 100 Reasons",
        "Authors": "By Lang, Gregory E.",
        "Description": "One son's loving relection on what his mother brought to his life as well as the aspirations she has been able to fulfill in part because of what he has brought to hers.  The result is a book that will inspire mothers and remind sons of the importance their mothers have had in their lives.",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Cumberland House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Unbelievably Good Deals and Great Adventures That You Absolutely Can't Get Unless You're over 50 (4th Ed)",
        "Authors": "By Heilman, Joan Rattner",
        "Description": "Provides information on discounts on travel, accommodations, goods, and services for those over fifty, and lists retirement organizations",
        "Category": "",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Unlimited Access : An FBI Agent Inside the Clinton White House",
        "Authors": "By Aldrich, Gary",
        "Description": "Gary Aldrich was an FBI agent closing out his career with a stint at the White House. What should have been a peaceful exit left him shaken. Unlimited Access is Aldrich's electrifying expose of a presidential administration with a great deal to hide--and willing to put America at risk to keep it hidden.",
        "Category": " History , Modern , 20th Century",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Keeping Your Covenant",
        "Authors": "By Dennis Rainey",
        "Description": "",
        "Category": "",
        "Publisher": "Family Life",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "But I'm Almost 13! : Raising a Responsible Adolescent",
        "Authors": "By Ginsberg, Kenneth R., Jaldow, Martha M., and Jablow, Martha",
        "Description": "Practical strategies for the adolescent years from an expert in adolescent medicineThe overwhelming majority of adolescent health problems today result not from physical disease, but from worrisome behavior. If parents take action early before teen rebellion kicks in, most of these problems are preventable. In this invaluable guide, Dr. Ken Ginsburg, one of the nation's foremost specialists in adolescent medicine, offers a positive action plan for parents of preteens. Prevention strategies include preparing kids to resist peer pressure, recognizing behaviors that signal emotional problems, and teaching preteens to anticipate and react to potentially dangerous situations.With sample scripts, real-life vignettes, and specific exercises, parents learn to build upon adolescent optimism, creativity, and resiliency to guide their children toward more positive futures and toward safer, more appropriate choices.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "The Story of Noah",
        "Authors": "By Pingry, Patricia A. and Venturi-Pickett, Stacy (ILT)",
        "Description": "A simple retelling of the Biblical story from Genesis in which Noah builds an ark which saves him and his family from the flood waters that cover the earth.",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "WorthyKids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    }
]