[
    {
        "Title": "National Audubon Society Pocket Guide: Insects and Spiders (National Audubon Society Pocket Guides)",
        "Authors": "By Farrand, John",
        "Description": "A portable, comprehensive field guide--brimming with concise descriptions and stunning color photographs, and designed to fit into your back pocket--from the go-to reference source for over 18 million nature lovers.The National Audubon Society Pocket Guide: Insects and Spiders is the essential pocket-size guide to 80 of the most abundant and colorful insects and spiders in North America. Small enough to fit in your back pocket and featuring stunning full-color photographs and concise descriptions, this handy guide is the ideal companion for any outdoor excusion, and perfect for beginners and experts alike.",
        "Category": " Nature , Animals , Insects & Spiders",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Familiar Birds of North America, Western Region (The Audubon Society Pocket Guides)",
        "Authors": "By Farrand, John and Kaufman, Kenn",
        "Description": "Discover the birds of North America’s western region in this compact, beautifully designed, and easy-to-use pocket guide, which includes 80 stunning full-color photos, illustrated accounts and appendices. Whether your home is in a remote countryside or in a populous city, you will derive hours of pleasure observing and learning about birds, and the National Audubon Society Pocket Guide to Familiar Birds of North America: West is an excellent and convenient reference guide to accompany any bird-lover.",
        "Category": " Nature , Birdwatching Guides",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Quick and Easy Recipes:Pasta and Noodles",
        "Authors": "By Ostmann, Barbara Gibbs (Ed. ) and Baker, Jane L.",
        "Description": "",
        "Category": "",
        "Publisher": "Dial Publishing Company",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Absolute Barbeque",
        "Authors": "By Kansas City Barbeque Inner Circle",
        "Description": "",
        "Category": "",
        "Publisher": "Old Market Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Fat Envelope Frenzy: One Year, Five Promising Students, and the Pursuit of the Ivy League Prize",
        "Authors": "By Jager-hyman, Joie",
        "Description": "A former Ivy League admissions officer, Joie Jager-Hyman follows five bright and eager high schoolers—students from diverse ethnic, social, and financial backgrounds—as they each put their best foot forward on the road they hope will lead them to the hallowed halls of Harvard University.At once a remarkable true story of dedication, achievement, and heartbreak and a guide for success in an ultra-competitive environment, this important work deserves a place in the home of every family that has ever dreamed of receiving that coveted “fat envelope” in the mail. Jager-Hyman also offers a startlingly frank appraisal of the college admission process and the important roles race and class continue to play in a student's efforts to attend the best school possible.",
        "Category": " Education , Higher",
        "Publisher": "Harper-perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Shipwreck: The Coast of Utopia, Part II",
        "Authors": "By Stoppard, Tom",
        "Description": "Shipwreck is the second part of The Coast of Utopia, Tom Stoppard's long-awaited and monumental trilogy that explores a group of friends who came of age under the Tsarist autocracy of Nicholas I, and for whom the term intelligentsia was coined. Among them are the anarchist Michael Bakunin, who was to challenge Marx for the soul of the masses; Ivan Turgenev, author of some of the most enduring works in Russian literature; the brilliant, erratic young critic Vissarion Belinsky; and Alexander Herzen, a nobleman's son and the first self-proclaimed socialist in Russia, who becomes the main focus of this drama of politics, love, loss, and betrayal. In The Coast of Utopia, Stoppard presents an inspired examination of the struggle between romantic anarchy, utopian idealism, and practical reformation.",
        "Category": " Drama , English, Irish, Scottish, Welsh",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Houghton Mifflin Reading: The Nation's Choice: Theme Paperbacks, Above-Level Grade 4 Theme 2 - In Search of the Grand Canyon",
        "Authors": "By Houghton Mifflin Company (COR)",
        "Description": "",
        "Category": " Education , Teaching Methods & Materials , Reading & Phonics",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Floating Opera",
        "Authors": "By John Barth",
        "Description": "",
        "Category": "",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Escape from the Island of Aquarius (The Cooper Kids Adventure Series #2) (Volume 2)",
        "Authors": "By Peretti, Frank E.",
        "Description": "The Coopers head to a South Sea island in search of missionary Adam MacKenzie. They must decide whether the man they find is the real Adam MacKenzie, and discover what he has to do with the disasters threatening the island.",
        "Category": " Young Adult Fiction , Action & Adventure , General",
        "Publisher": "Crossway",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Start Your Trip With a Full Tank: And Other Spiritual Jump Starts",
        "Authors": "By Hutchcraft, Ron",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Battle For A Generation",
        "Authors": "By Hutchcraft, Ron, Whitmer, Lisa Hutchcraft, and Whitmer, Lisa",
        "Description": "Our kids are bombarded daily with choices we never had to make. They are  surrounded by gangs, weapons, and drugs. Teenage sexual activity has become a fact  of life. Abortion a 'necessary evil.' And many kids are making these life-altering  decisions without the benefit of wise biblical counsel. They don't know their Creator  as Shepherd of their heart, and are dying because of it emotionally, spiritually,  and sometimes even physically. You can do something about it. Ron Hutchcraft  and Lisa Hutchcraft Whitmer recognize the urgent needs of our kids and know exactly  what will help them--a relationship with Jesus Christ. Take a look into the world  of today's teens. Relationships matter most to them. Music is their language. Sex  is expected...and confusing. They are very lonely, wounded, and lost. Sin is not  an issue for them, but the results of sin are. The Battle for a Generation  explains how to meet the needs of today's young people right where they live.",
        "Category": " Religion , Christian Education , Children & Youth",
        "Publisher": "Moody Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Intermediate Algebra: Functions and Authentic Applications",
        "Authors": "By Lehmann, Jay",
        "Description": "",
        "Category": " Mathematics , Algebra , Intermediate",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "From Playpen to Podium",
        "Authors": "By Myers, Jeff",
        "Description": "",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Noble Pub Assoc/Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Think You're the Only One? Oddball Groups Where Outsiders Fit In",
        "Authors": "By Brown, Seth",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Hors D'Oeuvres Everybody Loves (Quail Ridge Press Cookbook)",
        "Authors": "By Furrh, Mary Leigh and Barksdale, Jo",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Quail Ridge Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Stories from Latin America : Historias de Latinoamerica",
        "Authors": "By Barlow, Genevieve",
        "Description": "These enduring legends offer insights into the history and culture of Latin American countries.  For ease of comprehension, they are told in both Spanish and English, on facing pages.",
        "Category": " Travel , Central America",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "A Love Like No Other: Stories from Adoptive Parents",
        "Authors": "By Kruger, Pamela (EDT) and Smolowe, Jill (EDT)",
        "Description": "Adoption now affects more American families than ever before-1.5 million adopted children live in the United States today, and 60 percent of Americans report some kind of personal connection to adoption. Happily, this surge has coincided with an increasing mainstream acceptance of adoption as just another way to form a family, complete with its own frustrations and joys that deserve to be discussed and celebrated.  A Love Like No Other does just that. It features twenty leading writers, all of whom are adoptive parents, discussing their personal experiences. They include adoptive parents of children of other races, like Emily Prager, who grapples with how to best keep her daughter connected to her Chinese roots; parents whose families blend biological children and adopted children, like bestselling author Jacquelyn Mitchard; single mothers of only children, like journalist Sheila Stainback; and same-sex adoptive parents like Jesse Green, who wonders how his sons will feel when instructed to make a Mother's Day card. They live in big cities and small towns, and have adopted domestically and overseas. Some of their stories soberingly address the potential complications of adoptive parenting, while others tell of happily enriched family lives.  Impressive for both its breadth and its quality, A Love Like No Other is a timely and heartwarming mosaic of the contemporary lives of adoptive parents and their children. In elegant prose and with refreshing honesty, these essays will introduce you to a group of families you won't soon forget.",
        "Category": " Family & Relationships , Adoption & Fostering",
        "Publisher": "Riverhead Hardcover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "And Then They Were Nuns: A Novel",
        "Authors": "By Leonardi, Susan J.",
        "Description": "",
        "Category": " Fiction , LGBT , Lesbian",
        "Publisher": "Firebrand Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "A Puzzle in a Pear Tree (The Puzzle Lady Mysteries)",
        "Authors": "By Hall, Parnell",
        "Description": "The Chicago Sun-Times crowns Parnell Hall’s Puzzle Lady mysteries “a joy for lovers of both crosswords and frothy crime detection...Cora Felton is a lovable and unique sleuth.” Now the crime-solving powers of the inimitable Cora and her clever niece, Sherry Carter, are put to the ultimate test as they square off against a yuletide killer who hides within the white-and-black shadows of an acrostic....A Puzzle In A Pear Tree’Tis the season to be jolly, but Cora Felton, shanghaied into “The Twelve Days of Christmas” as a most reluctant maid-a-milking, has every right to feel like a grinch. When someone steals the partridge from the pear tree and replaces it with a cryptic puzzle she has no hope of solving, it’s almost more than the Puzzle Lady can bear. But then smug crossword creator Harvey Beerbaum solves the acrostic, and it turns out to be a poem promising the death of an actress. This is more like it! Could the threat be aimed at Cora and her thespian debut? Or at Sherry, one of the ladies-dancing? Or at Sherry’s nemesis, the pageant’s predatory lead, Becky Baldwin? Cora and Sherry barely have time for a mystery, what with trimming Christmas trees and buying Christmas presents, but rehearsals go on, under police protection--until a killer strikes elsewhere in a most unexpected manner.Ordinarily Cora Felton would be delighted to have two murders to solve. But this time she finds herself vying with a visiting Scotland Yard inspector who appears to have an all-too-personal stake in solving the crimes. Cora does too when her own niece becomes a prime suspect and the murderer strikes again. Is someone trying to shut down the Christmas pageant? Cora would be only too happy if that were the case, but she fears the secrets lie deeper. Now she is interviewing witnesses, breaking into motel rooms, finding evidence, planting evidence, and having a merry old time. In fact, she would be perfectly happy--if this wasn’t turning out to be a Christmas to die for!",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "The Penny Wars",
        "Authors": "By Baker, Elliott",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Book",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Snoopy: Flying Ace to the Rescue (Collector's Edition)",
        "Authors": "By Charles Schulz",
        "Description": "",
        "Category": "",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Between Two Worlds: Escape from Tyranny: Growing Up in the Shadow of Saddam",
        "Authors": "By Becklund, Laurie and Salbi, Zainab",
        "Description": "Zainab Salbi was eleven years old when her father was chosen to be Saddam Hussein's personal pilot and her family's life was grafted onto his. Her mother, the beautiful Alia, taught her daughter the skills she needed to survive. A plastic smile. Saying yes. Burying in boxes in her mind the horrors she glimpsed around her. \"Learn to erase your memories,\" she instructed. \"He can read eyes.\" In this richly visual memoir, Salbi describes tyranny as she saw it - through the eyes of a privileged child, a rebellious teenager, a violated wife, and ultimately a public figure fighting to overcome the skill that once kept her alive: silence.  Between Two Worlds is a riveting quest for truth that deepens our understanding of the universal themes of power, fear, sexual subjugation, and the question one generation asks the one before it:  How could you have let this happen to us?",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Avery",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The Umpire's Handbook",
        "Authors": "By Brinkman, J., Euchner",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Henry V (Cliffs Notes)",
        "Authors": "By Fisher, Jeffrey",
        "Description": "The original CliffsNotes study guides offer expert commentary on major themes, plots, characters, literary devices, and historical background. The latest generation of titles in this series also feature glossaries and visual elements that complement the classic, familiar format.In CliffsNotes on Henry V (the final play in Shakespeare&#39;s political tetralogy), you once again meet young Prince Hal who is now the ideal Christian monarch, King Henry V. To retain power and increase revenue, he finds he must lead his soldiers in battle against France to reclaim land and titles.A character study on King Henry V and a close look at sixteenth century politics shed light on the Bard&#39;s intentions for the play. You&#39;ll also explore synopses of the three related history plays that lead up to Henry V. Count on CliffsNotes on Henry V for detailed summaries and commentaries on every scene to help you appreciate the complexity of the play.Other features that help you study include A list of characters and their rolesAn interactive quizEssay topics and review questionsClassic literature or modern-day treasure—you&#39;ll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to the Perfect Resume, Second Edition (2nd Edition)",
        "Authors": "By Ireland, Susan",
        "Description": "This is an updated and revised guide to help job seekers put together an attention-grabbing resume and land their dream job.  Includes advice for new graduates, seniors, mothers returning to the workforce, career switchers, and more.  Features dozens of sample resume styles, an action plan for a successful job search, and professional advice on creating cover letters, finessing the toughest interview, and writing thank you and follow-up letters.",
        "Category": " Business & Economics , Careers , Resumes",
        "Publisher": "Alpha",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Growing in Christ While Helping Others Participant's Guide 4: A Recovery Program Based on Eight Principles from the Beatitudes (Celebrate Recovery)",
        "Authors": "By Baker, John and Warren, Rick (FRW)",
        "Description": "A Program for Implementing a Christ-Centered Recovery Ministry in Your Church Alcoholism - Divorce - Sexual Abuse - Codependency - Domestic Violence - Drug Addiction - Sexual Addiction - Food Addiction - Gambling Addiction and many more! There is a way the church can help the hurting move beyond their wounds to experience the healing and forgiveness of Christ. Since 1991, more than 200,000 people have participated in the Celebrate Recovery programs offered at more than 3,500 churches, prisons, and rescue missions. Drawn from the Beatitudes, Celebrate Recovery helps people resolve painful problems in the context of the church as a whole. Newly updated, the kit includes: •1 20-minute DVD introductory guide for leaders •1 leader’s guide •1 of each participant’s guide (4 total) •CD-ROM with 25 lessons •CD-ROM with sermon transcripts and reproducible promotional materials •4-volume audio CD sermon series “And then there’s pastor John Baker, the founder of Celebrate Recovery… Big John and I shared something in common. We used to drink too much. And our hearts changed, and then we quit. That is a tried-and-true formula. The problem is government is not good at changing hearts. But people like John Baker have been good about it and successful doing that.” —President George W. Bush on Celebrate Recovery and its founder, John Baker, at the Faith- Based and Community Initiatives Conference, March 3, 2004.",
        "Category": " Religion , Christian Education , Adult",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "The Overland Migrations",
        "Authors": "By Lavender, David",
        "Description": "",
        "Category": "",
        "Publisher": "Patrice Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1981"
        }
    },
    {
        "Title": "Pandora Gets Jealous (The Mythic Misadventures)",
        "Authors": "By Hennesy, Carolyn",
        "Description": "Pandora Atheneus Andromaeche Helena (or Pandy, for short) has no idea what she'll bring for her school project. By accident she discovers a simple box, said to contain something so terrifying and horrible that no one must ever, ever touch it for fear of inflicting all of mankind with the wrath of the Gods and Goddesses. This, of course, makes the box the perfect thing for Pandora to bring for her school project. Unfortunately, things don't go quite the way she was hoping, and the box accidentally gets opened, unleashing all kinds of evil and misery into the world. Hauled before Zeus, Hera and the rest of immortals, Pandy's given the task of collecting all the evils within a year's time.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Bloomsbury USA Childrens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Golem (CALDECOTT MEDAL BOOK)",
        "Authors": "By Wisniewski, David and Salsbery, Lee (ILT)",
        "Description": "Retold from traditional sources and accompanied by David Wisniewski's unique cut-paper illustrations, Golem is a dramatic tale of supernatural forces invoked to save an oppressed people. It also offers a thought-provoking look at the consequences of unleashing power beyond human control. The afterword discusses the legend of the golem and its roots in the history of the Jews.  A Caldecott Medal Book.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Country & Ethnic",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Block-Buster",
        "Authors": "By Gerald Green",
        "Description": "",
        "Category": "",
        "Publisher": "Warner Paperback Library",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Just Walk Across the Room Participant's Guide: Four Sessions on Simple Steps Pointing People to Faith (Zondervangroupware)",
        "Authors": "By Hybels, Bill and Wiersma, Ashley",
        "Description": "Building on the solid foundation laid in Becoming a Contagious Christian, Just Walk Across the Room signals the next era in personal evangelism. Pastor Bill Hybels’s firm conviction is that the highest value in personal evangelism is being attuned to and cooperative with the promptings of the Holy Spirit. This means playing only the role you are intended to play—walking when the Spirit says to walk, talking when the Spirit says to talk, and falling silent when the Spirit suggests that you’ve already said enough. More than two thousand years ago, Jesus himself introduced the perfect model for evangelism. He left the marvelous adoration of the angels and the perfection of heaven, and he chose to “walk” clear across the cosmos. He had no memorized script, no forced formulas. Instead, he was armed only with an offer of redemption to people just like you and me, many of whom were neck-deep in pain of their own making. Today, the goal for every Christian is to reflect Christ’s love and follow his example by taking simple walks across rooms—leaving our circles of comfort and extending hands of care, compassion, and inclusiveness to people living far from God. Hybels encourages Christ-followers to “live in 3-D”—developing friendships, discovering stories, and discerning appropriate next steps—as a means of learning to understand the Spirit’s promptings. With fresh perspectives from his own reflections and experiences collected during his most recent decade of ministry. Hybels shows with undeniable clarity the power of this approach to evangelism. The stakes are high. The implications are eternal. And you may be only a conversation away from having unparalleled impact on someone’s life—if you will just walk across the room.",
        "Category": " Religion , Christian Ministry , Evangelism",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "The Prince and Other Writings (Barnes & Noble Classics)",
        "Authors": "By Machiavelli, Niccolo and Rebhorn, Wayne A.",
        "Description": "&&LDIV&&R&&LDIV&&R&&LDIV&&R&&LI&&RThe Prince and Other Writings&&L/I&&R, by &&LB&&RNiccolo Machiavelli&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&L/DIV&&R&&LDIV&&R &&L/DIV&&R&&LDIV&&ROne of history’s greatest political philosophers, &&LB&&RNiccolò Machiavelli&&L/B&&R is notorious for his treatise &&LI&&RThe Prince&&L/I&&R, which has become a cornerstone of modern political theory. Written in 1513 and published in 1532, after Machivelli’s death, &&LI&&RThe Prince&&L/I&&R immediately provoked controversy that has continued unabated to this day. &&LBR&&R&&LBR&&RDefining human nature as inherently selfish, Machiavelli proposes that social conflict and violence are natural phenomena that help determine the ablest, most versatile form of government. Asserting that idealism has no place in the political arena, &&LI&&RThe Prince&&L/I&&R primarily addresses a monarch’s difficulties in retaining authority. Considered the first expression of political realism, it has often been accused of advocating a political philosophy in which “the end justifies the means.” Indeed the emphasis in &&LI&&RThe Prince&&L/I&&R on practical success, at the expense even of traditional moral values, earned Machiavelli a reputation for ruthlessness, deception, and cruelty. Many scholars contend, however, that the author’s pragmatic views of ethics and politics reflected the realities of his time, as exemplified by the Medici family of Florence. &&LBR&&R&&LBR&&RDebates about Machiavelli’s theories are as lively today as they were 450 years ago, but no one questions the importance of his fundamental contribution to Western political thought. This newly translated edition also includes Machiavelli’s &&LI&&RLetter to Francesco Vettori&&L/I&&R, &&LI&&RThe Life of Castruccio Castracani&&L/I&&R, and excerpts from the &&LI&&RDiscourses on Livy&&L/I&&R.&&LBR&&R&&L/DIV&&R&&LDIV&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R&&LSTRONG&&RWayne A. Rebhorn&&L/B&&R&&L/B&&R, Celanese Centennial Professor of English at the University of Texas, has authored numerous studies of Renaissance European literature. His &&LI&&RFoxes and Lions: Machiavelli’s Confidence Men&&L/I&&R won the Howard R. Marraro Prize of the Modern Language Association of America in 1990. &&L/P&&R&&L/DIV&&R&&L/DIV&&R",
        "Category": " Philosophy , Political",
        "Publisher": "Barnes Noble Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "A Graceful Life: Lutheran Spirituality for Today",
        "Authors": "By Hanson, Bradley",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Augsburg Fortress Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "100 Questions & Answers About Breast Cancer (100 Questions & Answers)",
        "Authors": "By Brown, Zora K., Leffall, Lesalle D., and Platt, Elizabeth",
        "Description": "Newly Revised and Updated! Whether you're a newly diagnosed breast cancer patient, a survivor, or a friend or relative of either, this book offers help. The only text to provide both the patient’s and doctor’s views, this completely updated third edition of this best-selling book gives you up-to-date, authoritative, practical answers to your questions about breast cancer, including risk factors and prevention, diagnosis and treatment options, post-treatment quality of life, sources of support, and much more. Now including an entire new section on the impact of cancer on sexuality, intimacy and fertility, 100 Questions & Answers About Breast Cancer, Third Edition is written by a prominent breast cancer advocate and survivor and by a cancer surgeon.The book is an invaluable resource for anyone coping with the physical and emotional turmoil of this frightening disease.",
        "Category": " Health & Fitness , Diseases , Cancer",
        "Publisher": "Jones and Bartlett Publishers, Inc.",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Wee Willow Whistle",
        "Authors": "By Kay Avery",
        "Description": "",
        "Category": "",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "20.85",
        "Publish Date": {
            "Month": "January",
            "Year": "1947"
        }
    },
    {
        "Title": "The Snowman (Bright & Early Board Books(TM))",
        "Authors": "By Briggs, Raymond",
        "Description": "When his snowman comes to life, a little boy invites him into his home and in return is taken on a flight high above the countryside, in a classic wordless story with a new cover. An ALA Notable Children's Book.",
        "Category": " Juvenile Fiction , Comics & Graphic Novels , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Muppet Babies First Library Series",
        "Authors": "By n/a",
        "Description": "",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "Bendon Pub Intl",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Illustrated Encyclopedia: Thematically arranged",
        "Authors": "By Francesca Baines, Jack Challoner, Fiona Macdonald, Steve Parker",
        "Description": "",
        "Category": "",
        "Publisher": "Dempsey Parr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Footnotes: A Life Without Limits",
        "Authors": "By Klingvall, Lena Maria",
        "Description": "Born in Sweden to loving Christian parents eager to cherish their first-born child, Lena Maria Johansson was especially blessed from the start. But, at first, her parents despaired: Their beloved baby girl emerged drastically deformed, without arms and with only one fully formed leg and foot, the other leg markedly shorter and mis­shapen. Yet, Lena's parents were not to be daunted. Their love for their daughter knew no bounds. Lena's father's response when he saw his daughter for the first time was, \"Arms or no arms, she will need a home anyway.\" Thus, with compassion and abiding love but never pity, the Johanssons raised the remarkable girl who is today Lena Maria Klingvall, a woman of indomitable spirit and unshakable faith.Fueled by her parents' unceasing confidence in her, Lena learned to use her feet to do all kinds of things, from basic self-care, to playing keyboards and driving a car. From early on, Lena refused \"special\" status, preferring instead to learn how to accomplish things her own way. In her own words, \"I prefer to rejoice in what I can do —not mourn what I can't.\" In that spirit, Lena has not only learned to play keyboards and drive a car, but also to conduct a choir, develop a successful professional singing career and compete in the Paralympics in Seoul, Korea.This uplifting personal story, written by a one-of-a-kind woman who wholeheartedly believes that God her Creator never makes mistakes, is sure to not only inspire you, but also forever change the way you look at life.",
        "Category": " Self-help , Personal Growth , Happiness",
        "Publisher": "HCI",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Back to Malachi",
        "Authors": "By Conley, Robert J.",
        "Description": "Half-Cherokee, half-white, Charlie Black must choose between the ways of his young, Christian fiance+a7e and those of his ancestors when his childhood friend runs afoul of the law. Original.",
        "Category": " Fiction , Westerns",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Six",
        "Authors": "By Carew, Opal",
        "Description": "\"SIX is so steamy it fogged my glasses.\" - Fresh FictionHarmony leads a secret life.  On the surface, she's a respectable, straight-laced professional.  But once a year, she reunites with her old college friends--the infamous Group of Six--for a decadent sexual free-for-all.  Here, there are no limits.  Nothing is forbidden as they push every boundary to reach dizzying new heights of pleasure.  But this year, Harmony has a serious boyfriend in her life…and he has no idea about her naughty annual retreats.  Now Aiden is about to enter an intoxicating new world of explosive sensuality and mind-blowing group sex.  But can their relationship withstand Harmony's wild side?  And when an old friend reveals his true feelings for Harmony, how far is Aiden willing to go to win her heart?",
        "Category": " Fiction , Romance , Erotica",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Kalaupapa National Historical Park and the legacy of Father Damien: A pictorial history",
        "Authors": "By Anwei Skinsnes Law, Richard A. Wisniewski",
        "Description": "",
        "Category": "",
        "Publisher": "Pacific Basin Enterprises",
        "Price Starting With ($)": "23.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Love Must Be Tough",
        "Authors": "By Dobson, James C.",
        "Description": "At the core of most marital conflicts lies an overlooked but vicious culprit: disrespect. According to Dr. James Dobson, this symptom is the most serious indicator of potential family breakup. In his groundbreaking classic that popularized the \"tough love\" principle, Dr. Dobson offers practical help for the spouse who wants to hold the marriage together. He shows how to rekindle romantic interest and draw the offending partner back home. For new generations faced with ever-increasing threats to stable and loving bonds, Love Must Be Tough offers realistic hope.Have you tried everything to save your marriage?  You’ve forgiven a thousand times. You’ve bent over backwards to make your partner feel loved and accepted. But the only reward for your loyalty has been anger, indifference, infidelity, or abuse. Your spouse may even be ready to walk out the door.  Do you feel like all is lost? Are you ready to give up? There is still hope.  Dr. James Dobson’s “tough love” principles have proven to be uniquely valuable and effective. Unlike most approaches to marriage crisis, the strategy in this groundbreaking classic does not require the willing cooperation of both spouses. Love Must Be Tough offers the guidance that gives you the best chance of rekindling romance, renewing your relationship, and drawing your partner back into your arms. Story Behind the BookThis book provides an alternative for those in the midst of family crises. It offers practical tools—tough boundaries based on love and respect—that can draw an apathetic husband or wife back in the direction of commitment. The wrong response in moments of crisis can smother the dying embers of love. On the other hand, human conflict, if properly managed, can be the vehicle for transforming an unstable relationship into a vibrant, healthy marriage.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Faces of Public Health",
        "Authors": "By Pfizer Public Health Group",
        "Description": "",
        "Category": "",
        "Publisher": "Pfizer Inc.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Timechart Of Presidents And First Ladies: Spectacular 12-foot foldout wallchart",
        "Authors": "By Greenman, Barbara",
        "Description": "",
        "Category": " Reference , General",
        "Publisher": "Chartwell Books",
        "Price Starting With ($)": "6.78",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The Fox and the Hound",
        "Authors": "By Disney, Walt",
        "Description": "",
        "Category": "",
        "Publisher": "Smithmark",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Going Public: New Strategies of Presidential Leadership",
        "Authors": "By Kernell, Samuel",
        "Description": "Examines the increasingly frequent presidential practice of appealing for support directly to the public over the heads of an often balky Congress. The author carefully traces the history of this practice, examining the role of the news media, trends in presidential speeches, public appearances, and travel. Using examples from recent presidencies, he explains how the process developed , how it works, what its long-term impact is likely to be, and what dilemmas it poses for presidential leadership. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Political Science , Political Process , General",
        "Publisher": "CQ Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Ancient Egypt with Other (History in Stone)",
        "Authors": "By Langley, Andrew",
        "Description": "Explores the lifestyles of the ancient Egyptians, from the time they first settled into the Nile River Valley to the invasion of the Muslim armies, while highlighting key rulers, warriors, and gods.",
        "Category": " Juvenile Nonfiction , History , Ancient",
        "Publisher": "Silver Dolphin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Overcoming Your Parents Divorce: 5 Steps to a Happy Relationship",
        "Authors": "By Lamotte, Elisabeth J.",
        "Description": "Experts predict that children of divorce are fated to be unlucky in love, as divorce can shatter a young person’s beliefs about the sanctity of marriage. In addition, maintaining healthy relationships with both parents may seem completely out of reach to children of divorcees. In Children of Divorce author Elisabeth Joy LaMotte offers a brighter future, providing readers with five essential steps for building and maintaining meaningful relationships and proves the experts wrong. She tackles issues like the fear of commitment and explores both the trauma and the hidden opportunities of divorce. She highlights the most common pitfalls faced by children of divorce and shows readers how to avoid making the same mistakes as their parents. Although primarily directed at young adults whose parents are divorced, this book is also useful for young adults whose parents were unhappily married and chose to remain together and parents stuggling with the possibility of a divorce.",
        "Category": " Self-help , General",
        "Publisher": "New Horizon Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Yaz: Baseball, the Wall, and Me",
        "Authors": "By Eskenazi, Gerald and Yastrzemski, Carl",
        "Description": "The Hall of Famer recounts his life as a ball player in Boston, his relationship with managers and fans, and his blue-collar approach to his job, and describes how free-agency broke up a potential Red Sox dynasty",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "Building a Church of Small Groups",
        "Authors": "By Donahue, Bill and Robinson, Russ",
        "Description": "Our hearts were made for community. We hunger for the deep, authentic relationships Jesus had in mind when he prayed that his followers would be one. Yet in many churches, the connection we crave is lacking. How can church become a place where nobody stands alone?Through small groups. Like nothing else, they provide the kind of life-giving community that builds and empowers the body of Christ and impacts the world. At Willow Creek Community Church, small groups are so important that they define the core organizational strategy. Bill Donahue and Russ Robinson write, 'We have gone from a church with small groups . . . to being a church of small groups.'Donahue and Robinson share revealing glimpses of Willow Creek’s journey to becoming a church where over 18,000 people connect in 2,700 small groups. And they tell how your church--whatever its size and circumstances--can become a place where men and women, adults and children, can experience powerful, transforming community. Building a Church of Small Groups unpacks the vision, values, and strategies required to integrate small groups into your entire ministry. Part one presents the theological, sociological, and organizational underpinnings of small groups. You’ll discover why small groups, as reflections of God’s communal nature, are so vital to church health.Part two moves you from vision to practice. Here is how to develop thriving small groups based on authentic relationships, where truth and life intersect, conflict leads to growth, and skilled leaders help group members mature into fully devoted followers of Christ.Part three shows you how to identify, recruit, and train group leaders and provide them with long-term coaching and support. Finally, in part four, you’ll learn how to deal with the critical process of change as your church develops its small group ministry.Written by two of today’s top authorities on small group ministry, Building a Church of Small Groups is a proven blueprint for health and spiritual vitality in your church. Here is thorough, seasoned guidance for helping people grow together in faith, heart, and lives through closely knit small group communities.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "The Joy of Quilting",
        "Authors": "By Hanson, Joan and Hickey, Mary",
        "Description": "",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Martingale & Company",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Who's Who in Jewish History: After the Period of the Old Testament (Who's Who Series)",
        "Authors": "By Comay, Joan and Cohn-Sherbok, Lavinia",
        "Description": "Joan Comay's Who's Who in the Old Testament followed the history of Jewish people up to the end of the First Book of Maccabees in 135 B.C. InWho's Who in Jewish History she continues this fascinating story from that point up to the present day, a period of over twenty centuries.Offering entries on the lives of nearly one thousand men and women, this guide provides and in-depth look at Jews who have made a significant contribution to the history and thought of their own people, individual Jews who have been eminent in the general life and culture of their time, and non-Jews who have had a special impact on Jewish history. Here in brilliant procession are scholars, courtiers, and martyrs, from Simeon Bar-Giora (leader of the first Jewish revolt in the first century B.C.) through Aaron of Lincoln (the twelfth-century English money lender) to Golda Meir (the fourth prime minister of Israel) and Elie Wiesel (Holocaust survivor and world renowned author). Including a special chronology of Jewish history,Who's Who in Jewish History is an intriguing parade of celebrated individuals from almost every area of human achievement.",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "'MARY, QUEEN OF SCOTS (SOVEREIGN)'",
        "Authors": "By .",
        "Description": "",
        "Category": "",
        "Publisher": "Pitkin Pictorials",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Creative Photographer: A Complete Guide to Photography (Abrams Studio)",
        "Authors": "By Ingledew, John",
        "Description": "A comprehensive course in the art and techniques of photography offers a detailed survey of modern-day photographic equipment, aesthetics, tools and methods, and approaches to such typical photographic subjects as still life, landscape, portraiture, fashion, and sports, along with practical advice on how to become a professional photographer, lists of professional organizations, and more. Original.",
        "Category": " Photography , Techniques , General",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "6.78",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "No More Lone Ranger Moms: Women Helping Women in the Practical Everyday-Ness of Life",
        "Authors": "By Partow, Donna",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Freezer Cooking Manual from 30 Day Gourmet : A Month of Meals Made Easy",
        "Authors": "By Wohlenhaus, Tara and Slagle, Nanci",
        "Description": "Provides a plan for buying, cooking, and freezing food for a month of meals, and includes recipes and shopping lists",
        "Category": " Cooking , Methods , Canning & Preserving",
        "Publisher": "30 Day Gourmet Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Salt Dancers: A Novel",
        "Authors": "By Hegi, Ursula",
        "Description": "Unmarried and pregnant at forty-one, Julia returns home to Spokane, Washington, to the father she hasn't seen in twenty-three years, and to the memories of secrecy, betrayal, abuse, and abandonment that haunt her still. She is determined to understand, before her child is born, how her family unraveled. What made her mother disappear without a word one day, leaving Julia to face the terror of her father's desperate, alcohol-fueled outbursts? How did the loving father, who taught Julia the salt dance to chase away her fears, turn into the punishing father who could never be pleased?",
        "Category": " Fiction , Psychological",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Great Moments in Pro Football.",
        "Authors": "By Hollander, Zander",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Downhome: An Anthology of Southern Women Writers",
        "Authors": "By Mee, Susie (EDT)",
        "Description": "The South - within its diversity of voices and experiences lies \"a shared legacy: the act of speech - of stories handed down in which a distinctive language is honored, a language rich in Biblical and regional contexts; the love of place where individuals, relationships, and family histories not only matter but buttress everyday life. Both are part of that rarest and most indispensable groundspring of literature, memory. The memory of being 'Downhome.'\"Susie Mee has gathered a wealth of short fiction by southern women who - from their various backgrounds, from their different eras - draw on that shared legacy she describes in her introduction. That memory of \"downhome,\" whether it is used lovingly or ironically, echoes throughout the seven sections here, which range from Growing Up to Kinfolk and Courtship to Passing On, and in the words of these special authors.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Silver Secrets",
        "Authors": "By Pearson",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "Silver Burdett Ginn Religion",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "1921: The Great Novel of the Irish Civil War (Irish Century)",
        "Authors": "By Llywelyn, Morgan",
        "Description": "The Irish fight for independence is one of the most captivating tales of the twentieth century.  Morgan Llywelyn, the acclaimed historical writer of books like Lion of Ireland, Bard and The Horse Goddess, is the writer born to bring this epic battle to life.  Having created an entire body of work chronicling the Celts and Ireland, she now turns to recent Irish history to create a multivolume saga: The Irish Century.1921 tells the story of the Irish War of Independence and the heartbreaking civil war that followed. Henry Mooney, a reporter for theClare Champion and the Irish Bulletin, is a self-described \"moderate nationalist\" who struggles to see the truth in the news of the day, and to report it fairly.  Lacking more radical Republican beliefs of his dear friends Ned Halloran and Sile Duffy, Henry reports the political--and later, bloody--actions of his fellow Irishman from the ashes of the failed 1916 Rising to the creation of the Irish Free State to the tragic and wide-ranging battles of the Irish Civil War.Meanwhile, Henry feels the impact of these history-changing events in his own personal life. His friendship with Ned falters when their political beliefs diverge, and an unexpected tragedy leaves them further apart than ever. Henry struggles with his passion for a well-bred Protestant Anglo-Irish woman, Ella Rutledge, and as he dutifully reports the events in the political battle for independence, he comes to realize that the Irish struggle for freedom wil leave no life untouched--and no Irish citizen with a dry eye or an untroubled heart.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Introduction to Comparative Politics, AP* Edition",
        "Authors": "By Kesselman, Mark",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Handy Math Answer Book",
        "Authors": "By Patricia, and Thomas E Svarney Barnes-Sv",
        "Description": "",
        "Category": "",
        "Publisher": "Visible Ink Press",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Restitution",
        "Authors": "By Vance, Lee",
        "Description": "Peter Tyler seems to have it all—a beautiful and accomplished wife, a high-powered Wall Street career, a sprawling house in the suburbs. But beneath this perfect surface, things are not what they seem. Haunted by an unhappy childhood, Peter is drifting further and further from his college-sweetheart wife and her ideal of family life; eventually, confused and dissatisfied, he seeks solace in a one-night stand.Before Peter can fully come to grips with what he’s done, his house is broken into and his wife brutally murdered. When the police discover that a mysterious package from Peter’s best friend, Andrei, is the only thing missing, they rule out random robbery. When they dig a little deeper and discover Peter’s infidelity—combined with his refusal to reveal the identity of his lover—he becomes their prime suspect. To complete the nightmare, Andrei, who might hold the key to everything, has disappeared without a trace.Forced to run, Peter will have to question everything he has ever believed as he struggles to unravel the truth behind his wife’s murder and Andrei’s disappearance before the police catch up with him. Along the way he’ll encounter an embittered ex-cop with a taste for vengeance, a conniving pharmaceutical conglomerate, the head of an underground AIDS facility with ties to the Russian Mob, a corporate jackal bent on a swindle of epic proportions, and a spectacular act of revenge that will take your breath away.Whip-smart, lightning-paced, and adrenaline-fueled from first to last, this is a book you won’t be able to put down until you know everything.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Matthew 5-7: How to Be Happy (Six Weeks with the Bible)",
        "Authors": "By Perrotta, Kevin",
        "Description": "In the Sermon on the Mount, Jesus urged his listeners to live in a way that  fosters justice, peace, harmony, and well-being within and among people.  Matthew 5-7: How to Be Happy helps us apply the message of the Sermon  on the Mount to our own lives today and find true joy in our walk of  faith.A Guided Discovery of the BibleThe Bible invites us to explore  God’s word and reflect on how we might respond to it. To do this, we need  guidance and the right tools for discovery. The Six Weeks with the Bible series  of Bible discussion guides offers both in a concise six-week format. Whether  focusing on a specific biblical book or exploring a theme that runs throughout  the Bible, these practical guides in this series provide meaningful insights  that explain Scripture while helping readers make connections to their own  lives. Each guide• is faithful to Church teaching and is guided by sound biblical  scholarship• presents the insights of Church fathers and saints•  includes questions for discussion and reflection• delivers information in a  reader-friendly format• gives suggestions for prayer that help readers  respond to God’s word• appeals to beginners as well as to advanced students  of the Bible By reading Scripture, reflecting on its deeper meanings,  and incorporating it into our daily life, we can grow not only in our  understanding of God’s word, but also in our relationship with  God.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Loyola Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Crystal Skull",
        "Authors": "By Scott, Manda",
        "Description": "12.21.12.The date is set. Time is running out.In a spellbinding blend of history, myth, and science, bestselling novelist Manda Scott unleashes a thriller that sweeps from the secrets of the Mayans to the court of a sixteenth-century queen to a shattering end-times prophecy.Ancient lore predicts the end of the world with chilling precision: 21 December 2012. But the prophecies provide the key to stopping Armageddon: a flawless sapphire carved into the perfect likeness of a human skull.One woman has inherited the skull’s legacy of deadly secrets, intrigue, and murder. Can she crack the only code that could save the world?",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Guide to Beginning Obedience",
        "Authors": "By Gentile, Dan",
        "Description": "An experienced dog trainer demonstrates methods for teaching dogs basic commands and offers solutions for problem behavior",
        "Category": " Pets , Dogs , General",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Just As I Am: The Life of David Ring As Told to Lela Gilbert",
        "Authors": "By Gilbert, Lela and Ring, David",
        "Description": "D. Ring, a victim of cerebral palsy, gives his testimony of victory through Christ in spite of affliction.",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Moody Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Healthy Competition: What's Holding Back Health Care and How to Free It",
        "Authors": "By Cannon, Michael F. and Tanner, Michael D.",
        "Description": "Government control has driven health care costs sky-high at the same time that it has reduced the quality of care. As America's health care system cries out for reform, should policymakers embrace even more government planning, or should they fight for more individual freedom? In this updated edition of their 2005 book, the authors tackle proposals that would let government manage even more of America's health care sector. The continuing problem of ever-rising health care costs makes this book as timely as ever.",
        "Category": " Political Science , Public Policy , Social Services & Welfare",
        "Publisher": "Cato Institute",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Blood Trail: Victory Nelson Private Investigator: Otherworldly Crimes a Specialty",
        "Authors": "By Huff, Tanya",
        "Description": "When a pack of werewolves is discovered on a London, Ontario, farm, Henry Fitzroy, a Toronto-based vampire and writer of romance novels, calls upon private investigator Vicki Nelson to help him trace the trail of destruction to the killers. Original.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "DAW",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Global Governance Reform: Breaking the Stalemate",
        "Authors": "By Bradford, Colin I. (EDT) and Linn, Johannes F. (EDT)",
        "Description": "The current international system of institutions and governance groups is proving inadequate to meet many of today's most important challenges, such as terrorism, poverty, nuclear proliferation, financial integration, and climate change. The International Monetary Fund, World Bank, and UN were founded after World War II, and their structures of voting power and representation have become obsolete, no longer reflecting today's balance of economic and political power. This insightful book examines how to make such institutions more responsive and effective.  Institutional reform is critically needed but currently in stalemate. A new push is needed from powerful nations acting together through a reformed and enlarged G-8 that includes emerging economies, such as China and India. Global challenges demand integrated approaches, with greater coordination among international institutions. Global Governance Reform argues that without reconstituting the Group of 8 summit into a larger, more representative group of leaders, with a new mandate to provide strategic guidance to the system of international institutions, the world will fall further behind in addressing global challenges. The path to global reform is defined by the need to act in coordinated ways on summit and institutional reform, and this book lights the way.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Plum Spooky: A Stephanie Plum Between the Numbers Novel",
        "Authors": "By Evanovich, Janet",
        "Description": "Plum Spooky, the First Full Length Stephanie Plum Between-the-Numbers Novel from #1 Bestselling Author Janet Evanovich.Turn on all the lights and check under your bed. Things are about to get spooky in Trenton, New Jersey.According to legend, the Jersey Devil prowls the Pine Barrens and soars above the treetops in the dark of night. As eerie as this might seem, there are things in the Barrens that are even more frightening and dangerous. And there are monkeys. Lots of monkeys.Wulf Grimoire is a world wanderer and an opportunist who can kill without remorse and disappear like smoke. He's chosen Martin Munch, boy genius, as his new business partner, and he's chosen the Barrens as his new playground.Munch received his doctorate degree in quantum physics when he was twenty-two. He's now twenty-four, and while his brain is large, his body hasn't made it out of the boys' department at Macy's. Anyone who says good things come in small packages hasn't met Munch. Wulf Grimoire is looking for world domination. Martin Munch would be happy if he could just get a woman naked and tied to a tree.Bounty hunter Stephanie Plum has Munch on her most-wanted list for failure to appear in court. Plum is the all-American girl stuck in an uncomfortable job, succeeding on luck and tenacity. Usually she gets her man. This time she gets a monkey. She also gets a big guy named Diesel. Diesel pops in and out of Plum's life like birthday cake – delicious to look at and taste, not especially healthy as a steady diet, gone by the end of the week if not sooner. He's an über bounty hunter with special skills when it comes to tracking men and pleasing women. He's after Grimoire, and now he's also after Munch. And if truth were told, he wouldn't mind setting Stephanie Plum in his crosshairs.Diesel and Plum hunt down Munch and Grimoire, following them into the Barrens, surviving cranberry bogs, the Jersey Devil, a hair-raising experience, sand in their underwear, and, of course . . . monkeys.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "The Outlaw Demon Wails",
        "Authors": "By Harrison, Kim",
        "Description": "When you dance with demons, you lay your soul on the line . . .In the Hollows, where the natural and the supernatural co-exist—not always peacefully—desperate times often call for unorthodox measures. But bounty hunter-witch Rachel Morgan did the absolutely unthinkable to save the lives of her friends: she willingly trafficked in forbidden demon magic. And now her sins have come home to haunt her.As Rachel hunts for the truth behind a terrifying murder, the discovery of a shocking family secret is about to throw her entire life into question. And the long-lost ancient knowledge she seeks resides in the demonic ever-after.But there are some lines that should never be crossed—like the one Rachel Morgan's stepping over . . . again!",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Harper Voyager",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Raggedy Ann Stories",
        "Authors": "By Gruelle, Johnny",
        "Description": "Since Raggedy Ann first appeared in print in 1918, she has charmed millions of readers with her always warm and optimistic outlook and calm approach to difficulties. Now she returns to delight a new generation in this carefully produced reissue, which restores the book to its original appearance.  All the original stories are here, as Raggedy Ann comes to Marcella's nursery and quickly becomes the leader of the dolls. After learning a lesson from a naughty raid on the pantry, Raggedy Ann's adventures show her striving to be good -- and succeeding. She and the other dolls rescue Fido, the family dog, from the dogcatcher. When, in one adventure, Raggedy Ann has to have her stuffing replaced, she gets her famous \"I LOVE YOU\" candy heart. Raggedy Ann also goes up in a kite, teaches two new dolls to be tolerant, and shares the excitement of a baby brother for Marcella, among several other tales.  Johnny Gruelle's delicate illustrations are the perfect companions to the well-loved stories in this American classic, the only edition authorized by the Gruelle family. A brief biography of the author-artist by his grandson, Kim Gruelle, makes this edition especially valuable.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Eyewitness Top 10 Travel Guide to London",
        "Authors": "By Williams, Roger",
        "Description": "With a new design and unbeatable price, DK raises the bar on travel guides with its new Top 10 Travel Guide series. Whether you are traveling first class or on a limited budget, this Eyewitness Top 10 guide will lead you straight to the very best the city has to offer. Dozens of Top 10 lists -- from the Top 10 sights in literary Bloomsbury to the Top 10 pubs, shops and hotels -- provide the insider knowledge every visitor needs. And to save you time and money, there's even a list of the Top 10 Things to Avoid. Find your way effortlessly with the help of detailed maps and hundreds of photographs. And on www.Top10London.dk.com, find out what fellow travelers have ranked as a Top 10 sight or venue, and cast your own vote for the very best of London.",
        "Category": " Travel , Europe , Great Britain",
        "Publisher": "DK Travel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Ocean City: Maryland's Grand Old Resort",
        "Authors": "By Fleming, Kevin and David Trozzo, Text By Jane Vessels",
        "Description": "",
        "Category": "",
        "Publisher": "Portfolio Press (MD)",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Welcome to Club Scud!: A Doonesbury Book",
        "Authors": "By Trudeau, G. B.",
        "Description": "When B.D. is sent to the front to take part in Operation Desert Storm, Boopsie joins a Malibu support group for Desert Storm dependents and Roland Hedley makes a bungling attempt to join a press pool, in a Doonesbury view of the Persian Gulf War",
        "Category": " Humor , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "10 People Who Discovered America",
        "Authors": "By Bruce Black",
        "Description": "",
        "Category": "",
        "Publisher": "Willowisp Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Getting Results: A Guide For Federal Leaders And Managers",
        "Authors": "By White, Barry (EDT) and Newcomer, Kathryn E. (EDT)",
        "Description": "This text is a collaborative product of the Government Performance Coalition., an alliance of 17 diverse organizations whose focus is on continual improvement of the results the federal government delivers to the public. Twenty-four representatives from the Coalition offer their non-political and non-partisan perspectives on how federal leaders and managers can improve the results of their agencies and programs, and how Congress can support and critique that performance. Sixteen chapters are organized into four sections on leading for results, and achieving, communicating, and assessing results. For current and prospective appointed and career leaders and program managers in government, members of Congress and their staff, and nonprofit, private sector, and academic individuals and organizations interested in government performance. No subject index. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , Public Affairs & Administration",
        "Publisher": "Management Concepts Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Once-A-Month Cooking: A Proven System for Spending Less Time in the Kitchen and Enjoying Delicious, Homemade Meals Everyday",
        "Authors": "By Wilson, Mimi, Lagerborg, Mary Beth, and Wilson, Marilyn S.",
        "Description": "",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "B&H Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "The Modern Girl's Guide to Motherhood (Modern Girl's Guides)",
        "Authors": "By Buckingham, Jane and Furmaniak, Jen",
        "Description": "From the author of the bestselling The Modern Girl's Guide to Life comes a must-have book for the young mom, including best-kept secrets, practical advice, and multiple solutions for problems from birth to age fourJust when you thought you could cook (hey, one meal counts), clean (if the queen was coming), and seduce a man (well, long enough to get married), life throws you a curveball that makes all of your previous ineptitudes in life pale in comparison. With the appearance of one little extra line on a pregnancy test, you're thrown into a world of covering up leaks on shirts and taking a pacifier away from a two-year-old who has the grip of a pit bull.In this funny, smart, and honest book, Jane Buckingham cuts through the clutter to give you simple information and practical advice for navigating the different stages of motherhood. From how to get your child to sleep and how to wean, to how to get him off the pacifier and how to stop his tantrums, this book will help moms feel in the know and in control! Some of Buckingham's favorite tips:If your baby has a hard time feeding because of a stuffy nose, turn on the shower to steam up the bathroom and feed her there.Put your children's paints in an empty egg carton -- it's the perfect size, and there's no mess to clean up when you're done. Use an old raincoat with the arms cut off as a smock.You should buy a new car seat, rather than borrowing a friend's old car seat, as there are constant safety upgrades. Also, be sure you are the person registered to that car seat (send in that registration card!) so that you'll be notified in case of a recall.Keep the three-day rule in mind: Almost any bad habit can be broken in three days. Granted, they may be tough, torturous days, but you can do it!The Modern Girl's Guide to Motherhood helps modern moms do it all with love, style, and flair!",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Reagan Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Barn Dance! (Reading Rainbow)",
        "Authors": "By Rand, Ted (ILT), Martin, Bill, and Archambault, John",
        "Description": "In an old farmhouse, bathed in the light of a full moon, a young boy creeps to his bedroom window and looks outside. Was that a voice he just heard, or the hooting of an owl? There it is again:Come a little closer...Come a little closer...Listen to the night...There's music in the air...Beckoned by the voice, the boy sneaks downstairs, out the door, and walks toward the barn. As he gets closer he hears the sweet sound of a country fiddler and the rhythmic thumping of dancing feet. But who could possibly be having a barn dance in the middle of the night?",
        "Category": " Juvenile Fiction , Performing Arts , General",
        "Publisher": "Square Fish",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Numbers (Active Minds)",
        "Authors": "By Siede, George and Preis, Donna",
        "Description": "",
        "Category": " Mathematics , General",
        "Publisher": "Phoenix Intl Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "American Revolution: A Nonfiction Companion to Revolutionary War on Wednesday (Magic Tree House Research Guide Series)",
        "Authors": "By Murdocca, Sal (ILT), Osborne, Mary Pope, and Boyce, Natalie Pope",
        "Description": "The #1   bestselling chapter book series of all time celebrates 25 years with new   covers and a new, easy-to-use numbering system! Getting the facts behind the   fiction has never looked better.Track   the facts with Jack and Annie!When Jack and Annie got back from their adventure in Magic Tree House   #22: Revolutionary War on Wednesday, they had lots of questions. What   was it like to live in colonial times? Why did the stamp Act make the   colonists so angry? Who were the Minutemen? What happened at the Boston Tea   Party? Find out the answers to these questions and more as Jack and Annie   track the facts.Filled with up-to-date information, photos, illustrations,   and fun tidbits from Jack and Annie, the Magic Tree House Fact Trackers are   the perfect way for kids to find out more about the topics they discovered in   their favorite Magic Tree House adventures. And teachers can use Fact   Trackers alongside their Magic Tree House fiction companions to meet common   core text pairing needs. Did you know that there’s a Magic Tree House book for every kid? Magic Tree House: Adventures with Jack and Annie, perfect for readers who   are just beginning chapter books Merlin Missions: More challenging adventures for the experienced   reader Super Edition: A longer and more dangerous adventure Fact Trackers: Nonfiction companions to your favorite   Magic Tree House adventures Have more fun with Jack and Annie at MagicTreeHouse.com!",
        "Category": " Juvenile Nonfiction , History , United States , Colonial & Revolutionary Periods",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Rise and Fall of the Soviet Empire",
        "Authors": "By Dalziel, Stephen",
        "Description": "Traces the history of Russian and Soviet expansion from the empire of the Tsars and the Russian Revolution through Stalin's conquests, and describes how the countries of Eastern Europe regained their freedom and the Soviet Union broke apart",
        "Category": " History , General",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The Encyclopedia of Knitting and Crochet Stitch Patterns",
        "Authors": "By Mariano, Linda",
        "Description": "",
        "Category": "",
        "Publisher": "Service Communications",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The U.S. Navy Seals: Sea, Air, and Land Specialists",
        "Authors": "By Jordan, David and Couch, Dick (FRW)",
        "Description": "",
        "Category": " History , Military , Naval",
        "Publisher": "Thunder Bay Pr",
        "Price Starting With ($)": "7.44",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Much Ado About Nothing (Folger Shakespeare Library)",
        "Authors": "By Shakespeare, William, Mowat, Barbara A. (EDT), and Westine, Paul (EDT)",
        "Description": "Much Ado About Nothing includes two quite different stories of romantic love. Hero and Claudio fall in love almost at first sight, but an outsider, Don John, strikes out at their happiness. Beatrice and Benedick are kept apart by pride and mutual antagonism until others decide to play Cupid. The authoritative edition of Much Ado About Nothing from The Folger Shakespeare Library, the trusted and widely used Shakespeare series for students and general readers, includes: -Freshly edited text based on the best early printed version of the play -Full explanatory notes conveniently placed on pages facing the text of the play -Scene-by-scene plot summaries -A key to the play’s famous lines and phrases -An introduction to reading Shakespeare’s language -An essay by a leading Shakespeare scholar providing a modern perspective on the play -Fresh images from the Folger Shakespeare Library’s vast holdings of rare books -An annotated guide to further reading Essay by Gail Kern Paster The Folger Shakespeare Library in Washington, DC, is home to the world’s largest collection of Shakespeare’s printed works, and a magnet for Shakespeare scholars from around the globe. In addition to exhibitions open to the public throughout the year, the Folger offers a full calendar of performances and programs. For more information, visit Folger.edu.",
        "Category": " Drama , General",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Go Green, Live Rich: 50 Simple Ways to Save the Earth and Get Rich Trying",
        "Authors": "By Bach, David and Rosner, Hillary",
        "Description": "Let David Bach show you a whole new way to prosper—by going greenInternationally renowned financial expert and bestselling author David Bach has always urged readers to put their financial lives in line with their values. But what if your values are a cleaner and greener earth? Most people think that “going green” is an expensive choice they can’t afford. Bach is here to say that you can have both: a life in line with your green values and a million dollars in the bank.  Go Green, Live Rich outlines fifty ways to make your life, your home, your shopping, and your finances greener—and get rich trying. From driving the right car to making your home energy smart, Bach offers ways to improve the environment while you spend less, save more, earn more, and pay fewer taxes. Best of all, he shows you exactly how to take advantage of the \"green wave\" in personal finance without the difficult work of evaluating individual stocks. What's more, he will get you thinking about a green business of your own so you can help the world along as it is changing for the better.  David Bach is on a mission to teach the world that you can live a great life by living a green life. With Go Green, Live Rich, you can live in line with your eco-values on the road to financial freedom.",
        "Category": " Business & Economics , Environmental Economics",
        "Publisher": "Crown Business",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Art of Filo Cookbook",
        "Authors": "By Sousanis, Marti",
        "Description": "Explains how to store, freeze, and work with filo pastry sheets, and suggests international-style recipes for appetizers, vegetable dishes, meat dishes, and desserts",
        "Category": " Cooking , Methods , General",
        "Publisher": "Addison Wesley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1983"
        }
    },
    {
        "Title": "Spiritual Notes to Myself: Essential Wisdom for the 21st Century",
        "Authors": "By Prather, Hugh",
        "Description": "",
        "Category": "",
        "Publisher": "MJF Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Turkeys, Pilgrims and Indian Corn: The Story of the Thanksgiving Symbols",
        "Authors": "By Barth, Edna",
        "Description": "Centers on the Pilgrims' dealings with the Indians and provides insight into prominent people, myths such as Plymouth Rock, and harvest feasts around the globe",
        "Category": "",
        "Publisher": "Houghton Mifflin (Jp)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1981"
        }
    },
    {
        "Title": "How to Speak Southern",
        "Authors": "By Mitchell, Steve",
        "Description": "This tongue-in-cheek dictionary of Southern words and phrases offers a hilarious spoof of the Southern accent. This book is dedicated to all Yankees* in the hope that it will teach them how to talk right.  *Yankee: Anyone who is not from Kentucky, Virginia, Tennessee, North Carolina, South Carolina, Georgia, Florida, Mississippi, Alabama, Louisiana, Arkansas, Texas, and possibly Oklahoma and West-by-God-Virginia. A Yankee may become an honorary Southerner, but a Southerner cannot become a Yankee, assuming any Southerner wanted to.",
        "Category": " Humor , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "The Country Doctor Handbook: Old-fashioned Cures That Prevent Pain, Obsesity, Heart Disease, Cancer, Diabetes and More",
        "Authors": "By The Editors of FC&A Medical Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "FC&A Medical Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Prize Stories 1990: The O. Henry Awards (The O. Henry Prize Collection)",
        "Authors": "By Abrahams, William Miller",
        "Description": "“Widely regarded as the nation’s most prestigious awards for short fiction”—The Atlantic Monthly   The O. Henry Prize Stories 1990 gathers 20 of the best short stories of the year, selected from thousands published in literary magazines.  Stories include: Leo E. Litwak “The Eleventh Edition” (first prize) Peter Matthiessen “Lumumba Lives” (second prize) Lore Segal “The Reverse Bug” (third prize) Joyce Carol Oates “Heat” Carolyn Osborn “The Grands” James P. Blaylock “Unidentified Objects” Jane Brown Gillette “Sins Against Animals” Julie Schumacher “The Private Life of Robert Schumann” Joanne Greenberg “Elizabeth Baird” Alice Adams “1940: Fall” T. Coraghessan Boyle “The Ape Lady in Retirement” Marilyn Sides “The Island of the Mapmaker’s Wife” David Michael Kaplan “Stand” Meredith Steinbach “In Recent History” Claudia Smith Brinson “Einstein’s Daughter” Felicia  Ackerman “The Forecasting Game” Reginald McKnight “The Kind of Light That Shines on Texas” Bruce Fleming “The Autobiography of Gertrude Stein” Devon Jersild “In Which John Imagines His Mind as a Pond” Janice Eidus “Vito Loves Geraldine”   “One of the most welcome signs of the literary spring is the appearance of the annual O. Henry Awards collection.”—Los Angeles Times",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "The Hardness Factor: How to Achieve Your Best Health and Sexual Fitness at Any Age",
        "Authors": "By Couzens, Gerald Secor and Lamm, Steven",
        "Description": "Hard is good, harder is better -- for your health, your libido, your life. Such is the provocative premise behind Dr. Steven Lamm's The Hardness Factor, a groundbreaking book that will change the way men live and love. The Hardness Factor measures male health through the quality of an erection -- perhaps the greatest male motivator for better living (more so than fear of cancer, heart attack, or stroke). The Hardness Factor asks, Can men be hard and in shape for sex their entire lives? The answer is, absolutely. Here for the first time are scientific, evidence-based regimens -- emphasizing nutrition, supplements, and exercise -- to increase erectile quality. By following the programs in The Hardness Factor, you willimprove overall health;produce stronger, harder, and longer-lasting erections;increase strength, fitness, flexibility, and vitality;restore self-confidence; andachieve maximum sexual gratification with your partner.A renowned New York clinician, bestselling author, and a favorite expert on the television show The View, Dr. Lamm offers straight talk for men of all ages in \"The Four-Day Insurance Policy,\" which can provide a quick fix for that upcoming Saturday night (or any other dating emergency), and the more detailed \"Six-Week Hardness Factor Program,\" which will improve a man's sex drive, stamina, hardness, and, most of all, health. This comprehensive guide also includes numerous recipes created by acclaimed chef Waldy Malouf, aimed at promoting nutritional health and jump-starting the libido.After following The Hardness Factor, you will not only achieve optimal health and sexual fitness but also understand why the penis is the best barometer of a man's health.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Current Issues 2006 Edition: Whose Music Is It? 2006-2007 SUPPLEMENT",
        "Authors": "By Close Up Foundation",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Close Up Foundation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Dare to Lose",
        "Authors": "By Lieberman, Shari and Bruning, Nancy",
        "Description": "Dare to Lose is an empowering, innovative approach to weight loss that can help anyone transform their bodies and rev up their metabolism to keep weight off forever. In her trademark no-nonsense style, Shari Lieberman candidly challenges women to get serious and commit to her lifelong weight-loss program, geared to their individual needs.Lieberman explains the importance of metabolism in weight loss, pointing out the factors that slow down metabolism-such as stress, yo-yo and crash dieting, and sedentary lifestyles-and ways to counteract them. Her four-step program includes eliminating stress and toxins from the body; following sound nutrition guidelines; engaging in fat-burning, muscle-building exercise; and taking nutritional supplements that help boost metabolism for quick yet lasting results.",
        "Category": " Health & Fitness , Diet & Nutrition , Weight Loss",
        "Publisher": "Avery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "The Old Patagonian Express - By Train Through the Americas",
        "Authors": "By Paul Theroux",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1980"
        }
    }
]