[
    {
        "Title": "Living on the Edge: Dare to Experience True Spirituality",
        "Authors": "By Ingram, Chip",
        "Description": "Challenges believers to experience Christianity as God intended using providing a clear profile that is faith-focused, practical and measurable, featuring resources",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Howard Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Traveling with Pomegranates: A Mother and Daughter Journey to the Sacred Places of Greece, Turkey, and France",
        "Authors": "By Kidd, Sue Monk and Taylor, Ann Kidd",
        "Description": "The New York Times bestselling memoir of pilgrimage and metamorphosis by Sue Monk Kidd, the author of The Secret Life of Bees and The Book of Longings, and her daughter, Ann Kidd Taylor Sue Monk Kidd has touched the hearts of millions of readers with her beloved novels and acclaimed nonfiction. Now, in this wise and engrossing dual memoir, she and her daughter, Ann, chronicle their travels together through Greece and France at a time when each was on a quest to redefine herself and rediscover each other. As Sue struggles to enlarge a vision of swarming bees into a novel, and Ann ponders the classic question of what to do with her life, this modern-day Demeter and Persephone explore an array of inspiring figures and sacred sites. They also give voice to that most protean of human connections: the bond of mothers and daughters.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Child of My Heart: A Celebration of Adoption",
        "Authors": "By Alpert, Barbara (EDT)",
        "Description": "A positive and thought-provoking look at the joys and frustrations of adopting a child offers insights and impressions from those who have undergone the experience, including Rosie O'Donnell, Michelle Pfeiffer, and Pearl S. Buck. Original.",
        "Category": " Family & Relationships , Adoption & Fostering",
        "Publisher": "Berkley Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Into Thick Air: Biking to the Bellybutton of Six Continents",
        "Authors": "By Malusa, Jim",
        "Description": "With plenty of sunscreen and a cold beer swaddled in his sleeping bag, writer and botanist Jim Malusa bicycled alone to the lowest point on each of six continents, a six-year series of &#147;anti-expeditions” to the &#147;anti-summits.” His journeys took him to Lake Eyre in the arid heart of Australia, along Moses’ route to the Dead Sea, and from Moscow to the Caspian Sea. He pedaled across the Andes to Patagonia, around tiny Djibouti in the Horn of Africa, and from Tucson to Death Valley. With a scientist’s eye, he vividly observes local landscapes and creatures. As a lone man, he is overfed by grandmothers, courted by ladies of the night in Volgograd, invited into a mosque by Africa’s most feared tribe, chased by sandstorms and hurricanes &#151; yet Malusa keeps riding. His reward: the deep silence of the world’s great depressions. A large-hearted narrative of what happens when a friendly, perceptive American puts himself at the mercy of strange landscapes and their denizens, Into Thick Air presents one of the most talented new voices in contemporary travel writing.",
        "Category": " Travel , Special Interest , Adventure",
        "Publisher": "Counterpoint",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Is It Just Me?: Or is it nuts out there?",
        "Authors": "By Goldberg, Whoopi",
        "Description": "Have you noticed that things aren't as civil as they once were? Or that rudeness is no longer an exception but a lifestyle? Sure you have. All you need to do is set foot outside your door to see that bad manners are taking over everywhere. People are yakking on cell phones in restaurants, even at church. Folks in carpools wear enough cologne to make our eyes bleed. Complete strangers think it's OK to rub a pregnant lady's belly. Passengers abuse flight attendants, family outings to the ball park are ruined by rowdy drunks . . . a congressman heckled the President of the United States. Well, Whoopi Goldberg has noticed all this and more and asked herself, \"Is it just me?\" Unleashing her trademark irreverence and humor, her new book of observations takes a funny and excruciatingly honest look at how a loss of civility is messing with the quality of life for all of us. So if your pet peeve is folks who talk in movie theaters like it was their living room, or if you get bugged by people clipping their nails and performing other personal hygiene next to you on the bus, or if you cringe when \"please\" and \"thank you\" get replaced by \"gimme\" and \"huh\" . . . you have found a kindred spirit. Because Whoopi has witnessed the growing disrespect and rudeness in our lives and realized she is not alone. And, as you'll discover in these pages, neither are you.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Candy Everybody Wants",
        "Authors": "By Kilmer-Purcell, Josh",
        "Description": "From the critically acclaimed author of I Am Not Myself These Days comes the very odd adventures of a starry-eyed young man from the Midwest seeking fame and fortune in the flamboyant surreality of New York,  Los Angeles . . . and everywhere in between.Jayson Blocher is tired of worshiping pop culture; he wants to be part of it. So he's off,  accompanied by an ever-changing cast of quirky extended family members, on an extremely bumpy journey from rural Wisconsin to a New York escort agency for Broadway chorus boys, to a Hollywood sitcom set. Somewhere out there his destiny awaits—along with the discovery of first love, some unusual coincidences, a kidnapping mystery . . . and the sobering truth that being America's sweetheart can leave a very sour aftertaste.",
        "Category": " Fiction , Gay",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Shadows on the Sea (Aladdin Historical Fiction)",
        "Authors": "By Harlow, Joan Hiatt",
        "Description": "1942.  The U.S. is at war with Germany. Fourteen-year-old Jill Winter's mother is traveling to Newfoundland and must pass through the treacherous North Atlantic, where German submarines -- U-boats -- stalk like wolves. Jill's father, a famous pop singer, is on tour, so Jill is sent to Winter Haven, Maine, to stay with Nana.  Quarry, a local boy, says that \"gossip ain't never been so good,\" and Jill soon discovers he's right -- Winter Haven is full of secrets and rumors. It seems everyone has something to hide -- even Nana! Jill doesn't know whom to trust, and she's worried for her mother's safety. And things get even worse when she finds a wounded carrier pigeon with a coded message attached to its leg.  Jill is determined to get to the bottom of all these mysteries, but when she uncovers the biggest secret of all, she finds herself in grave danger -- and must run for her life!",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Margaret K. McElderry Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "How to Take the Grrrr Out of Anger (Laugh & Learn)",
        "Authors": "By Verdick, Elizabeth and Lisovskis, Marjorie",
        "Description": "Anger is a part of life. We can’t avoid it, we shouldn’t stuff it, and we can’t make it go away.Kids need help learning how to manage their anger. This book speaks directly to them and offers strategies they can start using immediately.Blending solid information and sound advice with jokes and funny cartoons, it guides kids to understand that anger is normal and can be expressed in many ways—some healthy, some not.It teaches them how to recognize anger in themselves and others, how to handle situations and emotions (loneliness, guilt, frustration, fear) that lead to or mask anger, and how to deal with the anger they feel.Young readers learn that violence is not acceptable and there are better, safer, more positive ways to resolve conflicts.They also discover what to do when people around them are angry, how to get help, and how to locate other resources (books, hotlines, school groups) when they need more support.",
        "Category": " Juvenile Nonfiction , Social Topics , Emotions & Feelings",
        "Publisher": "Free Spirit Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Dr. Gott's No Flour, No Sugar Diet",
        "Authors": "By Gott, Peter H. and Donovan, Robin",
        "Description": "During his 40 years of medical practice and in his nationally syndicated newspaper column, Dr. Gott's patients and readers have continually asked him for a way to lose weight that is both simple and foolproof. In response, he developed the No Flour, No Sugar diet which has prompted countless weight loss success stories from his patients, thousands of letters from readers of his column raving about their successes, and a New York Times bestselling book.DR. GOTT'S NO FLOUR, NO SUGAR DIET is about as easy as it gets. All you need to do is eliminate flour and added sugar from your diet. That means no bread, bagels, cookies, or cakes, but it doesn't mean you can't still enjoy lean meats, rice, low-fat dairy products, vegetables, and fruits. It doesn't call for counting calories or grams of food, it allows you to choose from a wide range of food (once you hit your goal weight, you can even reintroduce some items with flour and sugar back into your diet), and it's totally affordable. In this book, you will learn how to:-Satisfy your sweet tooth without sugar-Plan for success and stay on track-Curb your carb cravings without flour-Keep the weight off in the long termThe book also includes firsthand questions and challenges from his readers, and Dr. Gott's informative and helpful responses. Complete with recipes for Breakfast; Soups, Salads, Wraps; Snacks and Appetizers; Entrees; and Desserts; and easy-to-follow meal plans, this is a simple and effective diet that delivers phenomenal, fast results.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Grand Central Life & Style",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Cake Pops: Tips, Tricks, and Recipes for More Than 40 Irresistible Mini Treats",
        "Authors": "By Dudley, Angie",
        "Description": "What's cuter than a cupcake? A cake pop, of course! Wildly popular blogger Bakerella (aka Angie Dudley) has turned cake pops into an international sensation! Cute little cakes on a stick from decorated balls to more ambitious shapes such as baby chicks, ice cream cones, and even cupcakes these adorable creations are the perfect alternative to cake at any party or get-together. Martha Stewart loved the cupcake pops so much she had Bakerella appear on her show to demonstrate making them. Now Angie makes it easy and fun to recreate these amazing treats right at home with clear step-by-step instructions and photos of more than 40 featured projects, as well as clever tips for presentation, decorating, dipping, coloring and melting chocolate, and much more.",
        "Category": " Cooking , Courses & Dishes , Cakes",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Immanuel's Veins",
        "Authors": "By Dekker, Ted",
        "Description": "This story is for everyone--but not everyone is for this story. It is a dangerous tale of times past. A love story full of deep seduction. A story of terrible longing and bold sacrifice.Then as now, evil begins its courtship cloaked in light. And the heart embraces what it should flee. Forgetting it once had a truer lover.With a kiss, evil will ravage body, soul, and mind. Yet there remains hope, because the heart knows no bounds.Love will prove greater than lust. Sacrifice will overcome seduction. And blood will flow.Because the battle for the heart is always violently opposed. For those desperate to drink deep from this fountain of life, enter.But remember, not everyone is for this story. \"A heart-wrenching journey of redemption and hope that left me sobbing, laughing, and clinging to every word.\"--Donna McChristian, 44, Environmental Chemist",
        "Category": " Fiction , Christian , Suspense",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Promise Me",
        "Authors": "By Evans, Richard Paul",
        "Description": "The #1 bestselling author of The Christmas Box and master of the holiday novel presents a breathtaking story of the transcendent power of love.Beth Cardall has a secret. For eighteen years, she has had no choice but to keep it to herself, but on Christmas Eve 2008, all that is about to change. For Beth, 1989 was a year marked by tragedy. Her life was falling apart: her six-year-old daughter, Charlotte, was suffering from an unidentifiable illness; her marriage transformed from a seemingly happy and loving relationship to one full of betrayal and pain; her job at the dry cleaners was increasingly at risk; and she had lost any ability to trust, to hope, or to believe in herself. Then, on Christmas Day, as she rushed through a blizzard to the nearest 7-Eleven, Beth encountered Matthew, a strikingly handsome, mysterious stranger, who would single-handedly change the course of her life.  Who is this man, and how does he seem to know so much about her? He pursues her relentlessly, and only after she’s fallen deeply in love with him does she learn his incredible secret, changing the world as she knows it, as well as her own destiny.",
        "Category": " Fiction , Literary",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "In the Still of the Night: The Strange Death of Ronda Reynolds and Her Mother's Unceasing Quest for the Truth",
        "Authors": "By Rule, Ann",
        "Description": "FROM TRUE-CRIME LEGEND ANN RULE comes this riveting story of a young woman whose life ended too soon—and a determined mother’s eleven-year crusade to clear her daughter’s name. It was nine days before Christmas 1998, and thirty-two-year-old Ronda Reynolds was getting ready to travel from Seattle to Spokane to visit her mother and brother and grandmother before the holidays. Ronda’s second marriage was dissolving after less than a year, her career as a pioneering female Washington State Trooper had ended, but she was optimistic about starting over again. \"I’m actually looking forward to getting on with my life,\" she told her mother earlier the night before. \"I just need a few days with you guys.\" Barb Thompson, Ronda’s mother, who had met her daughter’s second husband only once before, was just happy that Ronda was coming home. At 6:20 that morning, Ron Reynolds called 911 and told the dispatcher his wife was dead. She had committed suicide, he said, although he hadn’t heard the gunshot and he didn’t know if she had a pulse. EMTs arrived, detectives arrived, the coroner’s deputy arrived, and a postmortem was conducted. Lewis County Coroner Terry Wilson, who neither visited the death scene nor attended the autopsy, declared the manner of Ronda’s death as \"undetermined.\" Over the next eleven years, Coroner Wilson would change that manner of death from \"undetermined\" to \"suicide,\" back to \"undetermined\"—and then back to \"suicide\" again. But Barb Thompson never for one moment believed her daughter committed suicide. Neither did Detective Jerry Berry or ballistics expert Marty Hayes or attorney Royce Ferguson or dozens of Ronda’s friends. For eleven grueling years, through the ups and downs of the legal system and its endless delays, these people and others helped Barb Thompson fight to strike that painful word from her daughter’s death certificate. On November 9, 2009, a precedent-setting hearing was held to determine whether Coroner Wilson’s office had been derelict in its duty in investigating the death of Ronda Reynolds. Veteran true-crime writer Ann Rule was present at that hearing, hoping to unbraid the tangled strands of conflicting statements and mishandled evidence and present all sides of this haunting case and to determine, perhaps, what happened to Ronda Reynolds, in the chill still of that tragic December night.",
        "Category": " True Crime , Murder , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.48",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Dirty Sexy Politics",
        "Authors": "By McCain, Meghan",
        "Description": "Meghan McCain came to prominence as the straight-talking, progressive daughter of the 2008 Republican presidential candidate Senator John McCain. And her profile has only risen since the election ended in favor of the other guy. What makes Meghan so appealing? As a new role model for young, creative, and vocal members of the GOP, she's unafraid to mix it up and speak her mind. In Dirty Sexy Politics she takes a hard look at the future of her party. She doesn't shy away from serious issues and her raucous humor and down-to-earth style keep her positions accessible. In this witty, candid, and boisterous book, Meghan takes us deep behind the scenes of the campaign trail. She steals campaign signs in New Hampshire, tastes the nightlife in Nashville, and has a strange encounter with Laura and Jenna Bush at the White House. Along the way, she falls in love with America--while seeing how far the Republican Party has veered from its core values of freedom, honesty, and individuality. In Dirty Sexy Politics, Meghan McCain gives us a true insider's account of life on a campaign trail.",
        "Category": " Political Science , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Sugar and Spice (L.A. Candy, 3)",
        "Authors": "By Conrad, Lauren",
        "Description": "Sugar and Spice...not everyone's nice.In the deliciously entertaining conclusion to the L.A. Candy series, New York Times bestselling author and star of the hit TV show The Hills Lauren Conrad pulls back the curtain on young Hollywood and shows that sometimes the real drama is behind the scenes.Fresh from being betrayed by one of her closest friends, new reality-TV celebrity Jane Roberts has learned a few lessons. Most important: know who to trust. And in Hollywood, that list is short.Although the press is intent on creating a tabloid war between her and ex-friend, current-costar Madison Parker, Jane just wants to take control of her life. She’s started by swearing off guys and the drama that comes with them. But when her high school sweetheart Caleb and her unrequited L.A. crush Braden show up, both acting sweeter than ever, Jane has a hard timeremembering her no-boys rule....Her best friend, Scarlett, has only one guy on her mind: her new boyfriend, Liam. The girl who once thought love was a four-letter word is now head over heels. The problem is, being on a hit reality show means hanging out with other guys on-camera, and Liam isn’t too happy with pretending to play a bit part in her love life.Just when everything feels out of control, Jane makes a shocking discovery—one that changes everyone’s definition of “reality” forever.",
        "Category": " Young Adult Fiction , Performing Arts , Television & Radio",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Zero History",
        "Authors": "By Gibson, William",
        "Description": "The iconic visionary returns with his first new novel since the New York Times bestseller Spook   Country. Whatever you do, because you are an artist, will bring you to the next thing of   your own... When she sang for The Curfew, Hollis Henry's face was known worldwide. She still runs   into people who remember the poster. Unfortunately, in the post-crash economy, cult memorabilia doesn't pay the   rent, and right now she's a journalist in need of a job. The last person she wants to work for is Hubertus Bigend,   twisted genius of global marketing; but there's no way to tell an entity like Bigend that you want nothing more to do   with him. That simply brings you more firmly to his attention. Milgrim is clean, drug-free for the first   time in a decade. It took eight months in a clinic in Basel. Fifteen complete changes of his blood. Bigend paid for all   that. Milgrim's idiomatic Russian is superb, and he notices things. Meanwhile no one notices Milgrim. That makes   him worth every penny, though it cost Bigend more than his cartel-grade custom-armored truck. The   culture of the military has trickled down to the street- Bigend knows that, and he'll find a way to take a cut. What   surprises him though is that someone else seems to be on top of that situation in a way that Bigend associates only   with himself. Bigend loves staring into the abyss of the global market; he's just not used to it staring   back.    Watch a Video",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "The Lost Symbol (Robert Langdon)",
        "Authors": "By Brown, Dan",
        "Description": "#1 Worldwide BestsellerFamed Harvard symbologist Robert Langdon answers an unexpected summons to appear at the U.S. Capitol Building. His plans are interrupted when a disturbing object—artfully encoded with five symbols—is discovered in the building. Langdon recognizes in the find an ancient invitation into a lost world of esoteric, potentially dangerous wisdom. When his mentor Peter Solomon—a long-standing Mason and beloved philanthropist—is kidnapped, Langdon realizes that the only way to save Solomon is to accept the mystical invitation and plunge headlong into a clandestine world of Masonic secrets, hidden history, and one inconceivable truth . . . all under the watchful eye of Dan Brown's most terrifying villain to date. Set within the hidden chambers, tunnels, and temples of Washington, D.C., The Lost Symbol is an intelligent, lightning-paced story with surprises at every turn—one of Brown's most riveting novels.",
        "Category": " Fiction , Literary",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "The Baby Signing Book: Includes 350 ASL Signs for Babies and Toddlers",
        "Authors": "By Bingham, Sara and Villanueva, Jamie (ILT)",
        "Description": "This first edition (9780778801634) is replaced by the second edition (9780778804512).    Communicate with babies -- even before they can speak.    Before a baby can talk and before a toddler can say completely understandable words, they have important things to say. Babies and children are often more interested in connecting with parents or other caregivers than playing with their toys.    The Baby Signing Book uses American Sign Language, which is ideal for babies and toddlers because:  The ability of babies to understand what they see develops well before their ability to understand what they hear.  The ability of a baby to speak develops between the ages of 12 and 18 months, while the ability to use American Sign Language develops between 6 and 12 months.  Babies understand what they see            much earlier than typically expected, and are able to sign well before they are able to talk.    The Baby Signing Book teaches parents 300 developmentally appropriate American Sign Language signs. With clear instructions for every sign, memory aid, song and game, the learning in this program is easy to follow and, most important, fun for all. Language milestones are charted throughout the book so progress can be charted. The book also features a variety of visual highlights that emphasize key concepts and interesting tips.    Adults can customize a program according to the family's needs and aspirations. With the dictionary of 300 symbols, this handbook is clearly the most user-friendly and comprehensive baby signing book available.",
        "Category": " Language Arts & Disciplines , Sign Language",
        "Publisher": "Robert Rose",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "The Athenian Agora: Excavations in the Heart of Classical Athens",
        "Authors": "By John M. Camp",
        "Description": "Traces the progress of the excavation of the Agora, Athen's ancient public square and looks at ruins, sculpture, pottery, and artifacts uncovered on the site",
        "Category": "",
        "Publisher": "Thames and Hudson",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "A Hellion in Her Bed (2) (The Hellions of Halstead Hall)",
        "Authors": "By Jeffries, Sabrina",
        "Description": "Furious at his grandmother’s ultimatum to marry or lose his inheritance, Lord Jarret Sharpe wagers his luck—and his heart—at the card table against a most unlikely opponent. Mired in scandal after his parents’ mysterious deaths, notorious gambler Lord Jarret Sharpe agrees to tamely run the family brewery for a year if his Machiavellian grandmother rescinds her ultimatum that he marry. But the gambler in him can’t resist when beguiling Annabel Lake proposes a wager. If she wins their card game, he must help save her family’s foundering brewery. But if he wins, she must spend a night in his bed. The outcome sets off a chain of events that threatens to destroy all his plans . . . and unveils the secret Annabel has held for so long. When Jarret discovers the darker reason behind her wager, he forces her into another one—and this time he intends to win not just her body, but her heart.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "The Game On! Diet: Kick Your Friend's Butt While Shrinking Your Own",
        "Authors": "By Vernoff, Krista and Ferguson, Az",
        "Description": "The Game On! Diet is not a diet. It's a bold new approach to fitness that turns the latest, smartest, most successful health science into a fun, fierce, and exhilarating game. Developed by Az Ferguson, to help Grey's Anatomy writer Krista Vernoff shed forty pounds of postpregnancy weight, it is the ideal program for busy people who should be working out but have a thousand good excuses not to. Az keeps you motivated and Krista keeps you laughing as they show you how to organize opposing teams, set goals, and compete to earn points for daily exercise, healthy meal plans, and positive lifestyle changes. With The Game On! Diet, the process of losing weight, for the first time ever, is actually fun. After all, what's better than a bikini body . . . and bragging rights? Get out there and lose . . . to win! Game on!",
        "Category": " Sports & Recreation , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Barron's Ap U.s. Government and Politics (Barron's AP United States Government & Politics)",
        "Authors": "By Lader, Curt",
        "Description": "This manualÃ‚’s general review of U.S. government and politics is focused to reflect the most-often-asked questions on recent Advanced Placement exams. Topics covered include Constitutional development, the branches and institutions of the federal government, political parties and processes, special interest groups, the media, bureaucracy, and public policy issues as they relate to the economy, the federal budget, social welfare, foreign policy and the national defense. Two full-length model exams follow the manualÃ‚’s subject review, and are provided with answer keys.",
        "Category": " Political Science , American Government , National",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "A Nose for Justice: A Novel",
        "Authors": "By Maestro, Laura Hartman (ILT) and Brown, Rita Mae",
        "Description": "Explosive sabotage and the startling unearthing of a hundred-year-old skeleton on a Nevada ranch thrillingly start off this debut novel in a tail-wagging new series from New York Times bestselling author Rita Mae Brown. With the ruins of her high-powered Wall Street job now far in the rearview mirror of her rented silver Camaro, thirty-two-year-old Mags Rogers arrives at her great-aunt Jeep’s sprawling Wings Ranch to reassemble her life. In the passenger seat, with his suspicious nose to a cracked window, is Mags’s beloved wirehaired dachshund, the urbane Baxter.  Mags was named for her great-aunt, Magdalena—though everyone calls the spry octogenarian rancher Jeep. From piloting planes in World War II to discovering one of America’s largest gold deposits, Jeep has enjoyed a lifetime jam-packed with love and adventure, and she’s not done yet. At her side—to Baxter’s low-down distress—is Jeep’s loyal German Shepherd mix, King. The growlings are mutual: King sniffs that Baxter is a “fuzzy sausage.”Meanwhile, someone pipe-bombs Red Rock Valley’s pumping station, endangering the water supply near and far. Deputy Pete Meadows links the sabotage to a string of local murders, but he doesn’t yet know if it’s a corporate plot or twisted eco-terrorism. He’s also called out to Wings Ranch when human bones are dug up in Jeep’s barn; the dead man’s ring identifies him as an elite Russian military officer from the late 1800s, apparently knifed to death. In her search to find out whodunit, Mags uncovers fascinating history about Jeep’s ranch, including an intriguing connection to Buffalo Bill.  Mags and Pete have mysteries to solve, among them why they are so drawn to each other. Baxter and King team up when it comes time to protect their humans. And all the while, Jeep Reed, the sassiest wit in the West, has a bold plan for Red Rock Valley in which they all will play a part.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Finding Perfect (Fool's Gold, Book 3)",
        "Authors": "By Mallery, Susan",
        "Description": "When Pia O'Brian's best friend dies, Pia expects to inherit her cherished cat. Instead, the woman leaves Pia three frozen embryos. With a disastrous track record in the romance department and the parenting skills of a hamster, Pia doesn't think she's meant for motherhood. But determined to do the right thing, Pia decides to become a single mother. Only to meet a gorgeous, sexy hunk the very same day.A former foster-care kid now rich beyond his wildest dreams, Raoul Moreno runs a camp for needy children in Fool's Gold, California. After his last relationship, Raoul thought he was done with women and commitment. Still, he can't get sweet, sexy Pia out of his mind—and proposes a crazy plan. But can such an unconventional beginning really result in the perfect ending?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Obama Zombies: How the Liberal Machine Brainwashed My Generation",
        "Authors": "By Mattera, Jason",
        "Description": "In 2008, Barack Obama lobotomized a generation. For an entire year, otherwise clear-thinking members of the most affluent, over-educated, information-drenched generation in American history fell prey to the most expensive, hi-tech, laser-focused marketing assault in presidential campaign history. Twitter messages were machine-gunned to cell phones at mach speed. Facebook and MySpace groups spread across the Internet like digital fire. YouTube videos featuring celebrities ricocheted across the globe and into college students’ in-boxes with devastating regularity. All the while, the mega-money-raising engine whirred like a slot machine stuck on jackpot. The result: an unthinking mass of young voters marched forward to elect the most radical and untested president in U.S. history. Recognized as one of the country’s top young conservative activists by Human Events, Jason Mattera created an internet sensation with ambush video interviews that exposed clueless young liberals and cunning Democratic officials. Now he reveals the jaw-dropping lengths Barack Obama and his allies in Hollywood, Washington, and Academia went to in order to transform a legion of iPod-listening, MTV-watching followers into a winning coalition that threatens to become a long-lasting political realignment. Obama Zombies uncovers the true, behind-the-scenes story of the methods and tactics the Obama campaign unleashed on youth culture. Through personal interviews and meticulous original research, Mattera explains why conservatism’s future rests upon jolting the young masses from their slumber, yanking out their earphones, and sparking a countercultural conservative battle against the rise of the ignorant Left. The lesson from 2008 is crystal clear: When true conservatives run away, Obama zombies come out to play.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Threshold Editions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Living a Life of Balance: Women of Faith Study Guide Series",
        "Authors": "By Meberg, Marilyn (FRW)",
        "Description": "Living a life of balance is easier said than done.  We try so hard to be everywhere at once, to be all things to all people, to our husbands, to our jobs, but before we know it, we're completely worn out and a life of balance seems virtually impossible.Living a Life of Balance will encourage women to slow down and take a closer look at how they are living their life.  It will offer the guidance, hope and rest women are searching for in their busy lives.Reaching an audience across racial, socio-economic, denominational, and age boundaries, these guides will enhance the lives of women as they empower them in their weekly devotions. The study guides can be used for both individual and group settings.Women are asking good questions about their faith. With our study guides, we want to join them in their quest for knowledge and lead them in finding the answers they are seeking.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Routing Protocols and Concepts, CCNA Exploration Companion Guide",
        "Authors": "By Graziani, Rick and Johnson, Allan",
        "Description": "Routing Protocols and Concepts  CCNA Exploration Companion Guide     Routing Protocols and Concepts, CCNA Exploration Companion Guide is the official supplemental textbook for the Routing Protocols and Concepts course in the Cisco Networking Academy® CCNA® Exploration curriculum version 4. This course describes the architecture, components, and operation of routers, and explains the principles of routing and the primary routing protocols. The Companion Guide, written and edited by Networking Academy instructors, is designed as a portable desk reference to use anytime, anywhere. The book’s features reinforce the material in the course to help you focus on important concepts and organize your study time for exams.      New and improved features help you study and succeed in this course:    Chapter objectives—Review core concepts by answering the focus questions listed at the beginning of each chapter.   Key terms—Refer to the updated lists of networking vocabulary introduced and turn to the highlighted terms in context in each chapter.   Glossary—Consult the comprehensive glossary with more than 150 terms.  Check Your Understanding questions and answer key—Evaluate your readiness with the updated end-of-chapter questions that match the style of questions you see on the online course quizzes. The answer key explains each answer.  Challenge questions and activities—Strive to ace more challenging review questions and activities designed to prepare you for the complex styles of questions you might see on the CCNA exam. The answer key explains each answer.     Rick Graziani has been a computer science and networking instructor at Cabrillo College since 1994.       Allan Johnson works full time developing curriculum for Cisco Networking Academy. Allan also is a part-time instructor at Del Mar College in Corpus Christi, Texas.     How To—Look for this icon to study the steps you need to learn to perform certain tasks.     Packet Tracer Activities— Explore networking concepts in activities interspersed throughout some chapters using   Packet Tracer v4.1 developed by Cisco®. The files for these activities are on the accompanying CD-ROM.     Also available for the Routing Protocols and Concepts Course:  Routing Protocols and Concepts   CCNA Exploration   Labs and Study Guide   ISBN-10: 1-58713-204-4  ISBN-13: 978-1-58713-204-9     Companion CD-ROM  The CD-ROM provides many useful tools and information to support your education:    Packet Tracer Activity exercise files v4.1    A Guide to Using a Networker’s Journal booklet  Taking Notes: a .txt file of the chapter objectives     More IT Career Information  Tips on Lifelong Learning in Networking     This book is part of the Cisco Networking Academy Series from Cisco Press®. The products in this series support and complement the Cisco Networking Academy online curriculum.",
        "Category": " Computers , Networking , Network Protocols",
        "Publisher": "Cisco Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Extraordinary, Ordinary People: A Memoir of Family",
        "Authors": "By Rice, Condoleezza",
        "Description": "Condoleezza Rice has excelled as a diplomat, political scientist, and concert pianist.  Her achievements run the gamut from helping to oversee the collapse of communism in Europe and the decline of the Soviet Union, to working to protect the country in the aftermath of 9-11, to becoming only the second woman - and the first black woman ever -- to serve as Secretary of State.  But until she was 25 she never learned to swim. Not because she wouldn't have loved to, but because when she was a little girl in Birmingham, Alabama, Commissioner of Public Safety Bull Connor decided he'd rather shut down the city's pools than give black citizens access. Throughout the 1950's, Birmingham's black middle class largely succeeded in insulating their children from the most corrosive effects of racism, providing multiple support systems to ensure the next generation would live better than the last.  But by 1963, when Rice was applying herself to her fourth grader's lessons, the situation had grown intolerable.  Birmingham was an environment where blacks were expected to keep their head down and do what they were told -- or face violent consequences. That spring two bombs exploded in Rice’s neighborhood amid a series of chilling Klu Klux Klan attacks.  Months later, four young girls lost their lives in a particularly vicious bombing. So how was Rice able to achieve what she ultimately did? Her father, John, a minister and educator, instilled a love of sports and politics.  Her mother, a teacher, developed Condoleezza’s passion for piano and exposed her to the fine arts.  From both, Rice learned the value of faith in the face of hardship and the importance of giving back to the community.  Her parents’ fierce unwillingness to set limits propelled her to the venerable halls of Stanford University, where she quickly rose through the ranks to become the university’s second-in-command.  An expert in Soviet and Eastern European Affairs, she played a leading role in U.S. policy as the Iron Curtain fell and the Soviet Union disintegrated.  Less than a decade later, at the apex of the hotly contested 2000 presidential election, she received the exciting news – just shortly before her father’s death – that she would go on to the White House as the first female National Security Advisor.   As comfortable describing lighthearted family moments as she is recalling the poignancy of her mother’s cancer battle and the heady challenge of going toe-to-toe with Soviet leaders, Rice holds nothing back in this remarkably candid telling. This is the story of Condoleezza Rice that has never been told, not that of an ultra-accomplished world leader, but of a little girl – and a young woman -- trying to find her place in a sometimes hostile world and of two exceptional parents, and an extended family and community, that made all the difference.",
        "Category": " Political Science , American Government , Executive Branch",
        "Publisher": "Crown Archetype",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Woodrow, the White House Mouse",
        "Authors": "By Barnes, Peter W. and Barnes, Cheryl Shaw",
        "Description": "",
        "Category": "",
        "Publisher": "Vacation Spot Pub.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "The Adobe Photoshop Lightroom 3 Book for Digital Photographers (Voices That Matter)",
        "Authors": "By Kelby, Scott",
        "Description": "Since Lightroom first launched, Scott Kelby&#39;s The Lightroom Book for Digital Photographers has been the world&#39;s #1 best-selling Lightroom book. In this latest version for Lightroom 3, Scott uses his same step-by-step, plain-English style and layout to make learning Lightroom easy and fun. Scott doesn&#39;t just show you which sliders do what. Instead, by using the following three simple, yet brilliant, techniques that make it just an incredible learning tool, this book shows you how to create your own photography workflow using Lightroom: 1) Scott shares his own personal settings and studio-tested techniques.  He trains thousands of Lightroom users at his \"Lightroom Live!\" tour and knows first hand what really works and what doesn&#39;t. 2) The entire book is laid out in a real workflow order with everything step by step, so you can begin using Lightroom like a pro from the start. 3) What really sets this book apart are the last two chapters. This is where Scott dramatically answers his #1 most-asked Lightroom question, which is: \"Exactly what order am I supposed to do things in, and where does Photoshop fit in?\" Plus, this is the first version of the book that includes his famous \"7-Point System for Lightroom,\" which lets you focus on mastering just the seven most important editing techniques.  The Adobe Photoshop Lightroom 3 Book for Digital Photographers is the first and only book to bring the whole process together in such a clear, concise, and visual way.",
        "Category": " Computers , Digital Media , Photography",
        "Publisher": "New Riders Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Big Girls Don't Cry: The Election that Changed Everything for American Women",
        "Authors": "By Traister, Rebecca",
        "Description": "REBECCA TRAISTER, whose coverage of the 2008 presidential election for Salon confirmed her to be a gifted cultural observer, offers a startling appraisal of what the campaign meant for all of us. Though the election didn’t give us our first woman president or vice president, the exhilarating campaign was nonetheless transformative for American women and for the nation. In Big Girls Don’t Cry, her electrifying, incisive and highly entertaining first book, Traister tells a terrific story and makes sense of a moment in American history that changed the country’s narrative in ways that no one anticipated.It was all as unpredictable as it was riveting: Hillary Clinton’s improbable rise, her fall and her insistence (to the consternation of her party and the media) on pushing forward straight through to her remarkable phoenix flight from the race; Sarah Palin’s attempt not only to fill the void left by Clinton, but to alter the very definition of feminism and claim some version of it for conservatives; liberal rapture over Barack Obama and the historic election of our first African-American president; the media microscope trained on Michelle Obama, harsher even than the one Hillary had endured fifteen years earlier. Meanwhile, media women like Katie Couric and Rachel Maddow altered the course of the election, and comedians like Tina Fey and Amy Poehler helped make feminism funny. What did all this mean to the millions of people who were glued to their TV sets, and for the country, its history and its future? As Traister sees it, the 2008 election was good for women. The campaign for the presidency reopened some of the most fraught American conversations—about gender, race and generational difference, about sexism on the left and feminism on the right—difficult discussions that had been left unfinished but that are crucial to further perfecting our union. The election was also catalytic, shaping the perspectives of American women and men from different generations and backgrounds, altering the way that all of us will approach questions of women and power far into the future. When Clinton cried, when Palin reached for her newborn at the end of a vice presidential debate, when Couric asked a series of campaign-ending questions, the whole country was watching women’s history—American history—being made. Throughout, Traister weaves in her own experience as a thirtysomething feminist sorting through all the events and media coverage—vacillating between Clinton and Obama and forced to face tough questions about her own feminism, the women’s movement, race and the different generational perspectives of women working toward political parity some ninety years after their sex was first enfranchised. It was a time of enormous change, and there is no better guide through that explosive, infuriating, heartbreaking and sometimes hilarious year than Rebecca Traister. Big Girls Don’t Cry offers an enduring portrait of dramatic cultural and political shifts brought about by this most historic of American contests.",
        "Category": " Political Science , Political Process , Campaigns & Elections",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "His Bride (The His Series, 3)",
        "Authors": "By Callen, Gayle",
        "Description": "To save her penniless family from ruin, Gwyneth Hall enters into a marriage of convenience with the wealthy Sir Edmund Blackwell, a man with a dark past who needs Gwyneth to retain his hard-won estate. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Rediscovering Values: On Wall Street, Main Street, and Your Street",
        "Authors": "By Wallis, Jim",
        "Description": "When we start with the wrong question, no matter how good an answer we get, it won’t give us the results we want. Rather than joining the throngs who are asking, When will this economic crisis be over? Jim Wallis says the right question to ask is How will this crisis change us? The worst thing we can do now, Wallis tells us, is to go back to normal. Normal is what got us into this situation. We need a new normal, and this economic crisis is an invitation to discover what that means. Some of the principles Wallis unpacks for our new normal are . . .• Spending money we don’t have for things we don’t need is a bad foundation for an economy or a family.• It’s time to stop keeping up with the Joneses and start making sure the Joneses are okay.• The values of commercials and billboards are not the things we want to teach our children.• Care for the poor is not just a moral duty but is critical for the common good.• A healthy society is a balanced society in which markets, the government, and our communities all play a role.• The operating principle of God’s economy says that there is enough if we share it.• And much, much more . . .In the pages of this book, Wallis provides us with a moral compass for this new economy—one that will guide us on Wall Street, Main Street, and Your Street.Embracing a New Economy Getting back to \"the way things were\" is not an option. It is time we take our economic uncertainty and use it to find some moral clarity. Too often we have been ruled by the maxims that greed is good, it’s all about me, and I want it now. Those can be challenged only with some of our oldest and best values—enough is enough, we are in it together, and thinking not just for tomorrow but for future generations. Jim Wallis shows that the solution to our problems will be found only as individuals, families, friends, churches, mosques, synagogues, and entire communities wrestle with the question of values together.",
        "Category": " Philosophy , Ethics & Moral Philosophy",
        "Publisher": "Howard Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Ghost Shadow (The Bone Island Trilogy, 2)",
        "Authors": "By Graham, Heather",
        "Description": "There are those who walk among us who are no longer alive, but not yet crossed over. They seek retribution…vengeance…to warn. Among the living, few intuit their presence.Katie O'Hara  is one who can.As she's drawn deeper and deeper into a gruesome years-old murder, whispered warnings from a spectral friend become more and more insistent. But Katie must uncover the truth: could David Beckett really be guilty of his fiancée's murder?Worse—the body count's rising on the Island of Bones, andthe dead seem to be reenacting some macabre tableaux from history. The danger is increasing by the moment—especially as Katie finds herself irresistibly drawn to David, who may be responsible for more than just one killing….",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Hope Unseen: The Story of the U.S. Army's First Blind Active-Duty Officer",
        "Authors": "By Smiley, Scotty and Crandall, Doug (CON)",
        "Description": "The inspiring, unflinching true story of “blind” faith, as Major Scotty Smiley awakes in a hospital bed and realizes his world is permanently dark he must stretch his faith like never before. Courageous, heartfelt, and honest, Hope Unseen challenges readers to question their doubts, not their beliefs, and depend upon God no matter what.A nervous glance from a man in a parked car. Muted instincts from a soldier on patrol. Violent destruction followed by total darkness. Two weeks later, Scotty Smiley woke up in Walter Reed Army Medical Center, helpless . . . and blind. Blindness became Scotty’s journey of supreme testing. As he lay helpless in the hospital, Captain Smiley resented the theft of his dreams—becoming a CEO, a Delta Force operator, or a four-star general. With his wife Tiffany’s love and the support of his family and friends, Scotty was transformed—the injury only intensifying his indomitable spirit. Since the moment he jumped out of a hospital bed and forced his way through nurses and cords to take a simple shower, Captain Scotty Smiley has climbed Mount Rainier, won an ESPY as Best Outdoor Athlete, surfed, skydived, become a father, earned an MBA from Duke, taught leadership at West Point, commanded an army company, and won the MacArthur Leadership Award. Scotty and Tiffany Smiley have lived out a faith so real that it will inspire you to question your own doubts, push you to serve something bigger than yourself, and encourage you to cling to a Hope Unseen.",
        "Category": " Religion , Leadership",
        "Publisher": "Howard Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "DK Readers: Truck Trouble (Level 1: Beginning to Read)",
        "Authors": "By Royston, Angela",
        "Description": "Describes a truck driver's rig and some of the problems he encounters as he picks up and delivers his cargo.",
        "Category": " Juvenile Nonfiction , Careers",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Be Happy or I'll Scream!: My Deranged Quest for the Perfect Husband, Family, and Life",
        "Authors": "By Lynch, Sheri",
        "Description": "Be Happy or I'll Scream is for every married woman who has found just the tiniest bit of disconnect between the image of a perfect family in her head-think \"The Brady Bunch\" or \"The Huxtables\"-and the evidence in front of her eyes.  Instead of darling and compliant rosy-cheeked children and an adorably tolerant husband ready to go along with zany shenanigans, most women are faced with: kids who view family outings with all the enthusiasm of hardened inmates forced to bust rocks in roadside Alabama and a man who would trade every last one of her kooky ideas for a just a teeny little bit more sex and a hot meal on the table at six. Sheri Lynch, co-cost of radio's syndicated Bob & Sheri, is a superb humorist of modern marriage, mores, and motherhood. Her Hello, My Name Is Mommy decoded the pitfalls of pregnancy and trials of new motherhood. Be Happy or I'll Scream taps into the wackier, even more wonderful world of family and husband management, kid-raising, and sanity maintenance in the face of it all.  Her take on what life is really like inside a marriage-as opposed to what it looks like on the holiday card version of same-will ring both wacky and true to any woman who was ever foolish enough to dream of the perfect marriage and family.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Pooh's Hero Party (Winnie the Pooh First Reader)",
        "Authors": "By Milne, A. A., Gaines, Isabel, Studio Orlando (COR), and Studio Orlando (ILT)",
        "Description": "When a storm destroys Owl's house and floods the area, Christopher Robin calls Pooh a hero for saving Piglet in his honeypot, but when Piglet allows Eeyore to give Piglet's house to Owl, Pooh realizes there are many heroes",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Disney Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Thorn",
        "Authors": "By Lewis, Beverly",
        "Description": "Lancaster County, with its rolling meadows and secret byways, may seem idyllic, but it is not without its thorns. THE ROSE TRILOGY is the stirring saga of two Amish sisters on the fringes of the church, and the unforeseen discoveries that change their lives.Rose Kauffman, a spirited young woman, has a close friendship with the bishop's foster son. Nick dresses Plain and works hard but stirs up plenty of trouble too. Rose's sister cautions her against becoming too involved, but Rose is being courted by a good, Amish fellow, so dismisses the warnings. Meanwhile, Rose keeps house for an English widower but is startled when he forbids her to ever go upstairs. What is the man hiding? Rose's older sister, Hen, knows more than she should about falling for the wrong man. Unable to abandon her Amish ways, Hen is soon separated from her very modern husband. Mattie, their young daughter, must visit her father regularly, but Hen demands she wear Amish attire--and speak Pennsylvania Dutch, despite her husband's wishes. Will Hen be able to reestablish her place among the People she abandoned? And will she be able to convince Rose to steer clear of rogue neighbor Nick?",
        "Category": " Fiction , Christian , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "The Grace of Silence: A Memoir",
        "Authors": "By Norris, Michele",
        "Description": "\"History at its best is about telling stories---stories about people who lived before, about events in the past that create the contours of the present. In the hands of a gifted storyteller. a memoir becomes more than a chronicle of the writer's life. It becomes the history of a time and a place. So it is with this magnificent memoir---one of the most eloquent, moving, and insightful memories I have ever read.\"---Doris Kearns Goodwin. Pulitzer Prize---winning historian and author of Team of Rivals\"A riveting, inspiring memoir of an at once singular and representative American family. Norris takes us on a painful yet triumphant journey of self-discovery. She relies on her formidable skills as an investigative reporter to unearth shocking family secrets kept from her by her father and mother when she was growing up. Feeling hurt and betrayed, she learns that their lack of forthrightness allowed her to rise in a country haunted by its racial past. Powerful and tender. The Grace of Silence reveals our human complexity in exemplary fashion.\"---Henry Louis Gates, Jr., Alphonse Fletcher University Professor and director of the W. E. B. Du Bois Institute. Harvard University, and author of Colored People\"Norris takes us on a riveting personal journey from north to south and back again through the tangled landscape of race in America---and teaches anew about the pain and possibilities of our past and future.\"---Tom Brokaw, author of the Greatest Generation and Boom!\"A soaring memoir that pays powerful tribute to the quiet and dignified heroes among us, Norris's remarkable family and her courageous journey to tell their story create an inspiring portrait of America that will stay with you forever. I loved this book.\"---Dave Isay, founder of Story CorpsIn the Wake of talk of a \"postracial\" America upon Barack Obama's ascension as president of the United States, Michele Norris, cohost of National Public Radio's flagship program All Things Considered, set out to write, through original reporting, a book about \"the hidden conversation\" on race that is unfolding nation-wide. She would, she thought, base her book on the frank disclosures of others on the subject, but she was soon disabused of her presumption when forced to confront the fact that \"the conversation\" in her own family had not been forthright.Norris unearthed painful family secrets that compelled her to question her own self-understanding: from her father's shooting by a Birmingham police officer weeks after his discharge from the navy at the conclusion of World War II to her maternal grand-mother's peddling pancake mix as an itinerant Aunt Jemima to white farm women in the Midwest, In what became a profoundly personal and bracing journey into her family's past, Norris traveled from her childhood home in Minneapolis to her ancestral roots in the Deep South to explore the reasons for the \"things left unsaid\" by her father and mother when she was growing up, the better to come to terms with her own identity. Along the way she discovered how her character was forged by both revelation and silence.Extraordinary for Norris's candor in examining her own racial legacy and what it means to be an American, The Grace of Silence is also informed by rigorous research in its evocation of time and place, scores of interviews with ordinary folk, and wise observations about evolving attitudes, at once encouraging and disturbing, toward race in America today. For its particularity and universality, it is powerfully moving, a tour de force.",
        "Category": " Biography & Autobiography , Cultural, Ethnic & Regional , General",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Arthur's Fire Drill (Step-Into-Reading, Step 3)",
        "Authors": "By Brown, Marc Tolon",
        "Description": "When D.W.'s  teacher announces that they will have a fire drill, D.W. is afraid the school is going to burn down! So Arthur gives her his fire fighter's hat, a whistle, and a few tips on fire safety, and appoints her their home fire warden. She then sets off to school prepared to take charge. Includes two pages of word stickers to reinforce word recognition and to help beginning readers create their own Arthur stories.",
        "Category": " Juvenile Nonfiction , Health & Daily Living , Safety",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "City of Glass (The Mortal Instruments, Book 3)",
        "Authors": "By Clare, Cassandra",
        "Description": "Love is a mortal sin, and the secrets of the past are deadly. Plunge into the third installment in the internationally bestselling Mortal Instruments series and “prepare to be hooked” (Entertainment Weekly).To save her mother’s life, Clary must travel to the City of Glass, the ancestral home of the Shadowhunters—never mind that entering the city without permission is against the Law, and breaking the Law could mean death. To make things worse, she learns that Jace does not want her there, and Simon has been thrown in prison by the Shadowhunters, who are deeply suspicious of a vampire who can withstand sunlight. As Clary uncovers more about her family’s past, she finds an ally in mysterious Shadowhunter Sebastian. With Valentine mustering the full force of his power to destroy all Shadowhunters forever, their only chance to defeat him is to fight alongside their eternal enemies. But can Downworlders and Shadowhunters put aside their hatred to work together? While Jace realizes exactly how much he’s willing to risk for Clary, can she harness her newfound powers to help save the Glass City—whatever the cost? Love is a mortal sin and the secrets of the past prove deadly as Clary and Jace face down Valentine in the third installment of bestselling series the Mortal Instruments. Includes an exclusive sneak peek of the fourth book in the Mortal Instruments series: City of Fallen Angels! And don't miss the teaser from Clockwork Angel, the first book in the Infernal Devices trilogy, the prequel to the Mortal Instruments series.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Margaret K. McElderry Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Do More Great Work: Stop the Busywork. Start the Work That Matters.",
        "Authors": "By Stanier, Michael Bungay",
        "Description": "You work hard. You put in the hours. Yet you feel like you are constantly treading water with \"Good Work\" that keeps you going but never quite moves you ahead. Or worse, you are mired in \"Bad Work\"—endless meetings and energy-draining bureaucratic traps.Do More Great Work gets to the heart of the problem: Even the best performers are spending less than a fraction of their time doing \"Great Work\"—the kind of innovative work that pushes us forward, stretches our creativity, and truly satisfies us. Michael Bungay Stanier, Canadian Coach of the Year in 2006, is a business consultant who’s found a way to move us away from bad work (and even good work), and toward more time spent doing great work.When you’re up to your eyeballs answering e-mail, returning phone calls, attending meetings and scrambling to get that project done, you can turn to this inspirational, motivating, and at times playful book for invaluable guidance. In fifteen exercises, Do More Great Work shows how you can finally do more of the work that engages and challenges you, that has a real impact, that plays to your strengths—and that matters.The exercises are \"maps\"—brilliantly simple visual tools that help you find, start and sustain Great Work, revealing how to:Find clues to your own Great Work—they’re all around youLocate the sweet spot between what you want to do and what your organization wants you to doGenerate new ideas and possibilities quicklyBest manage your overwhelming workloadDouble the likelihood that you’ll do what you want to doAll it takes is ten minutes a day, a pencil and a willingness to change. Do More Great Work will not only help you identify what the Great Work of your life is, it will tell you how to do it.",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Perfect Recipes for Having People Over",
        "Authors": "By Anderson, Pamela",
        "Description": "Having your friends over is no big deal when you have the perfect recipe, one that&#39;s not only foolproof but simple and that fits into your hectic schedule. In her new cookbook, Pam Anderson shares nearly 200 perfectly convenient dishes, including * Lacy Cheddar Crisps—An irresistible one-ingredient hors d&#39;oeuvre, ready in 10 minutes. * Oven-Barbecued Pork—Slow-cooked for 10 to 12 hours. You literally make this one in your sleep. * Creamy Baked Macaroni and Cheese—When kids are coming, why not serve the best version of their favorite? * Shish Kebabs—Satisfy every guest, from vegetarians to carnivores, in the same meal. Six exciting flavoring pastes offer all the variety you need. * Easy Baked Risotto—Elegant and effortless, with many sumptuous variations, including seafood and vegetarian. You socialize while it cooks. * Orange-Glazed Asparagus—One of the most versatile side dishes imaginable. Ready in 8 relaxed minutes. * Molten Chocolate Cakes—15 minutes to oozy decadence. Every recipe comes with helpful suggestions on what to serve with the dish, how to vary it, how to take shortcuts, and how to make it ahead.",
        "Category": " Cooking , Entertaining",
        "Publisher": "Rux Martin/Houghton Mifflin Harcourt",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Road of Lost Innocence: As a girl she was sold into sexual slavery, but now she rescues others. The true story of a Cambodian heroine.",
        "Authors": "By Marshall, Ruth and Mam, Somaly",
        "Description": "A portion of the proceeds of this book will be donated to the Somaly Mam Foundation.A riveting, raw, and beautiful memoir of tragedy and hopeBorn in a village deep in the Cambodian forest, Somaly Mam was sold into sexual slavery by her grandfather when she was twelve years old. For the next decade she was shuttled through the brothels that make up the sprawling sex trade of Southeast Asia. Trapped in this dangerous and desperate world, she suffered the brutality and horrors of human trafficking—rape, torture, deprivation—until she managed to escape with the help of a French aid worker. Emboldened by her newfound freedom, education, and security, Somaly blossomed but remained haunted by the girls in the brothels she left behind.Written in exquisite, spare, unflinching prose, The Road of Lost Innocence recounts the experiences of her early life and tells the story of her awakening as an activist and her harrowing and brave fight against the powerful and corrupt forces that steal the lives of these girls. She has orchestrated raids on brothels and rescued sex workers, some as young as five and six; she has built shelters, started schools, and founded an organization that has so far saved more than four thousand women and children in Cambodia, Thailand, Vietnam, and Laos. Her memoir will leave you awestruck by her tenacity and courage and will renew your faith in the power of an individual to bring about change.To learn more about how you can help fight human trafficking, visit the foundation’s website: www.somaly.org.",
        "Category": " Social Science , Developing & Emerging Countries",
        "Publisher": "Spiegel & Grau",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Fancy Nancy: Halloween...or Bust!",
        "Authors": "By O'Connor, Jane, Bracken, Carolyn (ILT), and Preiss, Robin Glasser (ILT)",
        "Description": "Fancy Nancy dresses as a bunch of grapes for the Halloween party, but when the balloons she uses as grapes begin to pop, she thinks her costume is ruined.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Halloween",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Windows on the World Complete Wine Course: 2009 Edition (Kevin Zraly's Complete Wine Course)",
        "Authors": "By Zraly, Kevin",
        "Description": "Windows on the World Complete Wine Course is simply the bestselling wine book in North America?it’s a classic. In addition to retaining the expanded 60-page section on ?101 Wines You Should Know,” from last year, the 2009 revision will include 16 pages of quizzes (two at the end of every chapter) to test readers on how much they’ve learned?just as if they were in Kevin’s class. Those who use the book as an actual course will find this enormously helpful, and a great challenge for testing their knowledge of wine fundamentals. Of course, all wine lists and labels, vintage charts, and trend reports will receive a complete update, too.As always, Zraly organizes his wines by region, from simple to complex, beginning with white wines from France, the U.S., and Germany; he moves on to the red wines of Burgundy and the Rhône, Bordeaux, the U.S., Italy, Australia, Argentina, and Chile; and concludes with champagnes and ports. By following Kevin’s order, readers will experience the best wines and the wide diversity of taste, style, region, and country. It’s not only a comprehensive and bargain-priced hands-on wine education, but a superb catalog from which to start a wine cellar or find a bottle appropriate for any occasion at any price.This unequaled volume retains all the invaluable information, fabulous illustration, and gorgeous styling of the previous editions?presented in Zraly’s inimitable, irreverent style. It’s clearly the wine guide against which all others are judged.",
        "Category": " Cooking , Beverages , Alcoholic , Wine",
        "Publisher": "Union Square & Co.",
        "Price Starting With ($)": "5.84",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Only the Good Spy Young (Gallagher Girls, 4)",
        "Authors": "By Carter, Ally",
        "Description": "When Cammie Morgan enrolled at the Gallagher Academy, she knew she was preparing for the dangerous life of a spy. What she didn't know was that the serious, real-life danger would start during her junior year of high school. But that's exactly what happened two months ago when Cammie faced off against an ancient terrorist organization dead set on kidnapping her.Now the danger follows her everywhere, and even Cammie \"The Chameleon\" can't hide.  When a terrifying encounter in London reveals that one of her most-trusted allies is actually a rogue double-agent, Cammie no longer knows if she can trust her classmates, her teachers-or even her own heart. In this fourth installment of the New York Times best-selling series, the Gallagher Girls must hack, spy, steal, and lie their way to the truth.as they go searching for answers, recognizing that the key to Cammie's future may lie deep in the past.",
        "Category": " Young Adult Fiction , Mysteries & Detective Stories",
        "Publisher": "Hyperion Book CH",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Seeing Yourself Through God's Eyes: A 31-Day Devotional Guide",
        "Authors": "By Hunt, June",
        "Description": "",
        "Category": " Religion , Christian Living , Devotional",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Wait, Hoho, Wait! (Ni Hao, Kai-lan Ready-to-Read)",
        "Authors": "By Inches, Alison (ADP) and Mather, Daniel (ILT)",
        "Description": "Oh, no! Kai-Lan and her friends are building a toy car they can all ride in--but HoHo can't wait until it's finished! He tries to ride in the car before it's ready and ends up breaking it.  Now he has to wait even longer while they put the broken pieces back together. But Kai-Lan shows him that if you do something you like while you're waiting, the time goes by much faster. This sweet story teachers a valuable lesson to preschool children! Book contains rebus icons throughout.",
        "Category": " Juvenile Fiction , Imagination & Play",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "The Face on the Wall (Homer Kelly Mystery)",
        "Authors": "By Langton, Jane",
        "Description": "No matter how many times she erases it, a mysterious, eerie face keeps appearing on her mural wall, and when her tenant's eight-year-old retarded son is found dead in front of it Annie calls in her uncle Homer to investigate. Reprint.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.52",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "A Closer Walk (Devotions by Steve Troxel, Volume 1)",
        "Authors": "By Troxel, Steve",
        "Description": "",
        "Category": "",
        "Publisher": "GDWM",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Spellmans Strike Again: A Novel (Izzy Spellman Mysteries)",
        "Authors": "By Lutz, Lisa",
        "Description": "• A series beloved by fans and critics alike: Lisa Lutz’s debut novel, The Spellman Files , a New York Times bestseller, sold in twenty-three countries and was released in mass market in the spring of 2009. Curse of the Spellmans , its followup, was a national bestseller nominated for the 2008 Edgar Award for Best Novel, and will be released in mass market just prior to the release of Revenge of the Spellmans in paperback and The Spellmans Strike Again in hardcover. .• The fourth and final book: The Spellmans Strike Again is the last installment in the unique Spellman series, beloved by mystery booksellers and fans of Janet Evanovich. “The end of the Spellmans? Now that should have you on the edge of your seat,” says the Daily News (New York). Though clamoring fans will have a word to say about that….",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Seeking the Savior",
        "Authors": "By SEEKING A SAVIOR",
        "Description": "",
        "Category": "",
        "Publisher": "Family Christian Stores",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Mystery of the Ancient Pyramid (Cairo, Egypt) (4) (Around the World In 80 Mysteries)",
        "Authors": "By Marsh, Carole",
        "Description": "",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Carole Marsh Mysteries",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Student-Athlete and College Recruiting: How to Prepare for College Athletics and the Recruiting Process",
        "Authors": "By Wire, Rick",
        "Description": "",
        "Category": " Sports & Recreation , General",
        "Publisher": "Athletic Guide Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "The Valcourt Heiress (Medieval Song Quartet)",
        "Authors": "By Coulter, Catherine",
        "Description": "Set in medieval England, this lively historical romance delivers the trademark wit that fans have come to know and love from the #1 New York Times-bestselling author. When Garron of Kersey returns home from the king's service to claim his title as Baron Wareham, he's shocked to find Wareham Castle very nearly destroyed by a man called the Black Demon. According to the last starving servants still clinging to life inside the castle walls, the Black Demon was looking for gold belonging to Garron's brother Arthur. Among his remaining servants is the enigmatic Merry, the bastard child of the castle's priest. Garron quickly realizes that she is much more than a servant: She reads and writes and makes lists, just as he does. Together they bring Wareham back to its former splendor. But this is only the beginning. Did Arthur have a cache of gold? Who is the Black Demon? And the biggest question of all: Who is Merry?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Homer's Odyssey: A Fearless Feline Tale, or How I Learned about Love and Life with a Blind Wonder Cat",
        "Authors": "By Cooper, Gwen",
        "Description": "ONCE IN NINE LIVES, SOMETHING EXTRAORDINARY HAPPENS. The last thing Gwen Cooper wanted was another cat. She already had two, not to mention a phenomenally underpaying job and a recently broken heart. Then Gwen’s veterinarian called with a story about a three-week-old eyeless kitten who’d been abandoned. It was love at first sight.Everyone warned that Homer would always be an “underachiever.” But the kitten nobody believed in quickly grew into a three-pound dynamo with a giant heart who eagerly made friends with every human who crossed his path. Homer scaled seven-foot bookcases with ease, survived being trapped alone for days after 9/11 in an apartment near the World Trade Center, and even saved Gwen’s life when he chased off an intruder who broke into their home in the middle of the night. But it was Homer’s unswerving loyalty, his infinite capacity for love, and his joy in the face of all obstacles that transformed Gwen’s life. And by the time she met the man she would marry, she realized that Homer had taught her the most valuable lesson of all: Love isn’t something you see with your eyes. BONUS: This edition contains a new afterword and an excerpt from Gwen Cooper's Love Saves the Day.",
        "Category": " Pets , Cats , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Horrible Harry and the Green Slime",
        "Authors": "By Kline, Suzy and Remkiewicz, Frank (ILT)",
        "Description": "Follows the school activities of second-graders, Harry and Doug, as they participate in a secret mission to celebrate \"Charlotte's Web,\" learn how to make green slime, and put on a skit warning about the dangers of smoking.",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Let Me In",
        "Authors": "By Ajvide Lindqvist, John",
        "Description": "Let Me In Takes Top Honors at Tribeca Film Festival and is now an Award-winning movie in both the U.S. and Sweden!It is autumn 1981 when inconceivable horror comes to Blackeberg, a suburb in Sweden. The body of a teenager is found, emptied of blood, the murder rumored to be part of a ritual killing. Twelve-year-old Oskar is personally hoping that revenge has come at long last---revenge for the bullying he endures at school, day after day. But the murder is not the most important thing on his mind. A new girl has moved in next door---a girl who has never seen a Rubik's Cube before, but who can solve it at once. There is something wrong with her, though, something odd. And she only comes out at night. . . .Sweeping top honors at film festivals all over the globe, Let Me In has received the same kind of spectacular raves that have been lavished on the book. American and Swedish readers of vampire fiction will be thrilled! Following the success in Sweden, this movie was remade in 2010 starring Kodi Smit Mcpheem, Chloe Grace Moretz and Richard Jenkins changing its name from the Swedish Let The Right One In.  The story has continued to reach new viewers in a London Musical and the book remains a vampire favorite among its readers.",
        "Category": " Fiction , Horror",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Horrible Harry and the Ant Invasion",
        "Authors": "By Kline, Suzy and Remkiewicz, Frank (ILT)",
        "Description": "It?s a busy time in Room 2B?an ant observation project is beginning, Miss Mackle is teaching square dancing, and class pictures are being taken.  Then one of the fish from the 2B fish tank goes belly-up! Is Harry to blame?",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Dork Diaries: Tales from a Not-So-Popular Party Girl",
        "Authors": "By Russell, Rachel Renee",
        "Description": "Rachel Renee Russell's sequel to Dork Diaries is packed with adorable art and tons of laughs.Recipe for disaster: 4 parties. Add 2 friends and 1 crush. Divide by 1 mean girl out to RUIN Nikki. Mix well, put fingers over eyes, and CRINGE! Settled in at her new school and flanked by awesome friends Chloe and Zoey, life is looking up for Nikki Maxwell, especially since her crush, Brandon, asked her to be his lab partner—a seriously awesome development. However, when Nikki overhears mean girl MacKenzie bragging that Brandon’s taking her to the Halloween dance, a bummed Nikki signs on to spend Halloween at a kids’ party with her little sister, Brianna, instead. After she finds out Mackenzie was lying and her dream of going to the party with Brandon could be a reality, Nikki has two events to juggle . . . plus plenty of other entertaining trials and tribulations along the way!",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Not Your Parents’ Offering Plate: A New Vision for Financial Stewardship",
        "Authors": "By Christopher, J. Clif",
        "Description": "Hearing a young attorney speak of the faith-based reasons for which he had just made a substantial monetary gift to a community youth center, Clif Christopher asked the speaker if he would consider making a similar contribution to the congregation of which he was an active member. \"Lord no, they wouldn't know what to do with it\" was the answer.That, in a nutshell, describes the problem churches are facing in their stewardship efforts, says Christopher. Unlike leading nonprofit agencies and institutions, we too often fail to convince potential givers that their gifts will have impact and significance. In this book, Christopher lays out the main reasons for this failure to capture the imagination of potential givers, including our frequent failure simply to ask. Written with the needs of pastors and stewardship teams in mind, Not Your Parents’ Offering Plate provides immediate, practical guidance to all who seek to help God’s people be better stewards of their resources. Also available: The engaging follow up book - Whose Offering Plate is It?",
        "Category": " Religion , Christian Church , General",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Huck: The Remarkable True Story of How One Lost Puppy Taught a Family--and a Whole Town--about Hope and Happy Endings",
        "Authors": "By Elder, Janet",
        "Description": "Huck is a page-turning, unforgettable true story of the tenacity of one small dog, the unexpected, extraordinary kindness of strangers, and a family’s devotion to each other.  Michael was four when his relentless campaign for a dog began. At seven he made a PowerPoint presentation, “My Dog,” with headings like “A Childhood Without a Dog is a Sad Thing.” His parents, Janet and Rich, were steadfast; bringing a dog into their fast-paced New York City lives was utterly impractical. However, on a trip to Italy, a chance happening leads Janet to reconsider, a decision then hastened by a diagnosis of breast cancer.  Janet decides the excitement of a new puppy would  be the perfect antidote to the strain on the family of months of arduous treatments for her illness. The prospect of a new puppy would be an affirmation of life, a powerful talisman for them all. On Thanksgiving weekend, soon after the grueling months of treatments are over, Huck, a sweet, mischievous, red-haired, toy poodle joins the family and wins everyone’s heart. A few months later the family ventures to baseball’s spring training, leaving Huck with Janet’s sister in Ramsey, New Jersey.  Barely twenty-four hours into the trip, Janet receives the dreaded phone call: Huck has slipped through the backyard fence and run away.  Broken-hearted and frantic, the family catches the first plane to New Jersey to begin a search for their lost puppy. It is a race against time, for little Huck is now lost in an area entirely unfamiliar to him, facing the threat of bears and coyotes, swamps and freezing temperatures, rain and fast cars.  Moved by the family’s plight, strangers – from school children to townspeople to the police lieutenant – join the search, one that proves to be an unyielding test of determination and faith. Touching and warm-hearted, Huck is a spirit-lifting story about resilience, the generosity of strangers, and hope.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Born to Bite: An Argeneau Novel (Argeneau Vampire)",
        "Authors": "By Sands, Lynsay",
        "Description": "“Lynsay Sands writes books that keep readers coming back for more.” —Katie MacAlister, USA Today Bestselling Author of A Girl’s Guide to VampiresThe Argeneau vampire family is back in Born to Bite by USA Today and New York Times bestseller Lynsay Sands. One of the premier names in contemporary paranormal romance, the incomparable Sands blends steamy passion with mystery, as a sexy, chopper-riding Enforcer investigates a breathtaking immortal whose previous three wives all have had trouble remaining  undead. Are you hooked on Charlaine Harris and her Sookie Stackhouse books? Then Lynsay Sands and Born to Bite are exactly what you’re hungry for.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Texts From Last Night: All the Texts No One Remembers Sending",
        "Authors": "By Leto, Lauren and Bator, Ben",
        "Description": "In the tradition of The Truth About Chuck Norris, PostSecret, and I Can Has Cheezburger?, Texts from Last Night celebrates the funniest and most outrageous text messages from the instantly popular websiteThere are few forms of communication that are more entertaining, appalling, and laugh-out-loud hilarious than the text message-especially when it's received in the wee hours of the morning from a friend who has had one too many shots of tequila.Texts from Last Night is a celebration of the best, worst, and weirdest text messages that have ever been sent, such as:•Before i could say \"i'm not the kind of girl,\" i was•I got us kicked out of the bar because the waitress found me in the kitchen trying to make spaghetti•The ticket read \"found nude in a tree\"Texts from Last Night is chock full of LOL and WTF moments and will make any thumb-typer :) in recognition.Read Ben Bator and Lauren Leto's post on the Penguin Blog.",
        "Category": " Humor , Topic , Adult",
        "Publisher": "Gotham",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "The Professional (Spenser)",
        "Authors": "By Parker, Robert B.",
        "Description": "Hired to counter a blackmailer who has had affairs with several wealthy women, Boston private eye Spenser finds the case turning violent when the women are systematically murdered, a situation that is complicated by the discovery that not all of the blackmailer's conquests make sense. By the author of Rough Weather. Reprint. A best-selling book.",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "A Murderous Yarn (A Needlecraft Mystery)",
        "Authors": "By Ferris, Monica",
        "Description": "The art of needlecraft requires patience, discipline, and creativity. So, too, does the art of detection. Just ask Betsy Devonshire—who’s learning that life in a small-town needlecraft shop can reveal an unexpected knack for knitting…and a hidden talent for unraveling crime.A Murderous YarnHeavens to Betsy Devonshire! She never intended to get so caught up in this year’s antique car race. But as sponsor of one of the entrants, she can’t help but keep a close eye on the outcome—and it’s not pretty. One of the drivers never makes it to the finish line. His car is found exploded in flames. Now Betsy and her crafty friends must determine if it was an accident or the work of a jealous competitor. The answer may be in a piece of needlework, but pinning down a suspect won’t be easy…",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "The First Five Years of Marriage: Launching a Lifelong, Successful Relationship (FOTF Complete Guide)",
        "Authors": "By Swihart, Phillip J., Ph.D. and Wooten, Wilford",
        "Description": "Marriage isn't easy. That's why thousands of couples have asked the counselors at Focus on the Family for insight into money, communication, and a host of other issues. Their collective wisdom is now available in one handy reference guide. The Complete Guide to the First Five Years of Marriage was designed to help spouses build a strong foundation for a lifetime partnership filled with genuine love and joy.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Come to the Table: Food, Fellowship, and a Celebration of God's Bounty",
        "Authors": "By Long, Benita, Anderson, Sammy (PHT), Wingfield, Steve (CON), Wilson, Susan (CON), and Mitchell, Ann (CON)",
        "Description": "Celebrate God's BountyEvery man should eat and drink and enjoy the good of all his labor?it is the gift of God. Ecclesiastes 3:12God intends for us to enjoy his blessings in abundance. Come to the Table is a threefold feast: For the body, we have hearty and delectable recipes. For the mind, there are thought-provoking quotations from great poets and thinkers. And for the spirit, stunning photographs and inspirational Scriptures transport you to another realm.",
        "Category": " Cooking , General",
        "Publisher": "Harper Horizon",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Runner's World The Runner's Body: How the Latest Exercise Science Can Help You Run Stronger, Longer, and Faster",
        "Authors": "By Fitzgerald, Matt, Tucker, Ross, Ph.D., and Dugas, Jonathan",
        "Description": "Every day scientists learn more about how the body adapts to the stress of running—and how various body systems contribute to running performance. Leading the charge is a fresh generation of brilliant young exercise physiologists including Ross Tucker and Jonathan Dugas, whose work has demolished many long-standing beliefs about running. Now Tucker and Dugas, whose blog, Science of Sport, has already created a devoted readership, join with esteemed fitness author Matt Fitzgerald to provide a captivating tour of the human body from the runner's perspective. Focusing on how runners at all levels can improve their health and performance, Runner's World The Runner's Body offers in a friendly, accessible tone, the newest, most surprising, and most helpful scientific discoveries about every aspect of the sport—from how best to nourish the runner's body to safe and legal ways to increase oxygen delivery to the muscles. Full of surprising facts, practical sidebars, and graphical elements, The Runner's Body is a must-have resource for anyone who wants to become a better—and healthier—runner.",
        "Category": " Sports & Recreation , Running & Jogging",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Art of the Slow Cooker: 80 Exciting New Recipes",
        "Authors": "By Schloss, Andrew and Duivenvoorden, Yvonne (PHT)",
        "Description": "For the Art of the Slow Cooker, best-selling author Andrew Schloss has developed 80 recipes for soups, stews, succulent braises, vegetarian disheseven dessertsthat bring slow-cooked meals to new heights. Slow cooking gives a wonderful velvety texture to meatloaf, an incredible richness to Osso Buco Milanese, and bold and complex flavors to Curried Vegetables and Dal simmered in Indian spices. Each chapter offers recipes for both simple everyday meals and spectacular dishes perfect for entertaining. With cooking charts to help with timing, advice on finding the right slow cooker for every kitchen, and glorious color photographs throughout, the Art of the Slow Cooker will delight readers looking for easy and amazing meals.",
        "Category": " Cooking , Methods , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "The Me I Want to Be Participant's Guide: Becoming God's Best Version of You",
        "Authors": "By Ortberg, John and Rubin, Scott (CON)",
        "Description": "In this five-session small group Bible study, The Me I Want to Be, John Ortberg reveals how you can become the unique, fully alive person God intended you to be.There is a me each of one of us wants to be….someone who’s more kind and generous, patient, and loving. But there is a gap between the me I am and the me I want to be. Oftentimes we find it easy to trust God to bridge the gap between and us and him, but we struggle to really live by grace and trust God to close the gap between the me I am and the me I want to be. Becoming God’s best version of you is both God’s desire and the greatest task of your life. And here’s the good news…he’s already working on it. Your life is God’s project, not yours.The Me I Want to Be small group Bible study is a powerful look at becoming the unique, fully alive, flourishing person God intended. Pastor and author John Ortberg teaches through fives sessions how you can move toward becoming God’s best version of you in four specific areas: your mind, your time, your relationships, and your experiences.Spiritual growth can seem difficult or intimidating, but John Ortberg’s humor and innovative thinking inThe Me I Want to Be will leave you challenged, inspired, and hopeful about true spiritual growth happening in you and your small group.This Participant Guide is designed for use with The Me I Want to Be DVD (sold separately) and includes discussion questions for individuals and groups. When used together they provide you with a practical tool than can transform your faith.Sessions include: 1. Discovering the Spirit2. Renewing My Mind3. Redeeming My Time 4. Deeping My Relationships5. Transforming My Experience",
        "Category": " Religion , Christian Education , Adult",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Ghost Night (The Bone Island Trilogy, 3)",
        "Authors": "By Graham, Heather",
        "Description": "A slasher movie turns real when two young actors are brutally murdered on a remote island film set. Their severed heads and arms are posed in macabre homage to a nineteenth-century pirate massacre.Two years later, survivor Vanessa Loren is drawn back to South Bimini by a documentary being made about the storied region. Filmmaker Sean O'Hara aches to see how the unsolved crime haunts her…and Sean knows more than a little about ghosts.Lured by visions of a spectral figurehead, Vanessa discovers authentic pirate treasures that only deepen the mystery. Are the murders the work of modern-day marauders, the Bermuda Triangle or a deadly paranormal echo of the island's violent history? As Vanessa and Sean grow closer, the killer prepares to resume the slaughter…unless the dead can intervene.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Willow: A Novel",
        "Authors": "By Miller, Linda Lael",
        "Description": "Dear Reader:Willow is a novel from early in my career, and it was originally shorter than many of my other historical romances. Now, I’m delighted to be able to share this brand-new edition with you. I’ve taken the opportunity to expand Willow to include the subplots, love scenes, and deeper characterization that are possible with a longer book. I hope you enjoy reading this retelling as much as I have enjoyed visiting these characters and this story once again.In 1883, the railroad had only recently come to Montana Territory, and outlaws still lurked in the hills. Willow Gallagher, who spent her early childhood in an outlaw camp until her father finally found her, is torn by divided loyalties. Newly married to handsome railroad baron Gideon Marshall, she finds fiery passion in Gideon’s embrace, until she discovers he is on a mission . . . a mission to capture Willow’s outlaw brother, Steven. Now Willow must choose—betray her brother, or risk the love she has found with Gideon, the love she has dreamed of all her life, to save Steven. It is a choice that could break her heart. . . .May you be blessed,Linda Lael Miller",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Old Dogs: Are the Best Dogs",
        "Authors": "By Weingarten, Gene and Williamson, Michael S. (PHT)",
        "Description": "Featuring sixty black-and-white photographs of old dogs shot by Pulitzer Prize–winning photographer Michael S. Williamson and narrated by Washington Post staffer and columnist Gene Weingarten, this is a perfect collection for dog lovers that celebrates “man’s best friend.”Anyone who has ever loved an old dog will love Old Dogs. In this collection of profiles and photographs, Weingarten and Williamson document the unique appeal of man's best friend in his or her last, and best, years.   This book is a tribute to every dog who has made it to that time of life when the hearing and eyesight begin to go, when the step becomes uncertain, but when other, richer traits ripen and coalesce. It is when a dog attains a special sort of dignity and a charm all his own.   If you've known a favorite old dog, you'll find him or her on these pages. Your dog might go by a different name and have a different shape, but you'll recognize him or her by the look in an eye or the contours of a life story. There is the dog who thinks he is a house cat; the herder, the fetcher, the punk and the peacock, the escape artist, the demolition artist, the patrician, the lovable lout, the amiable dope, the laughable clown, the schemer, the singer, the daredevil, the diplomat, the politician, the gourmand, and the thief. Plus, as a special bonus, you will find the first Latvian elkhounds ever photographed.   Old Dogs is a glorious gift book and a fitting tribute to that one dog you can't ever forget.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "11.48",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Food & Wine Best of the Best Cookbook Recipes",
        "Authors": "By Food & Wine (EDT)",
        "Description": "Over 100 incredible recipes, meticulously tested by the FOOD & WINE Test Kitchen, for everything from salads and soups to pasta, chicken and desserts. The latest dishes from superstars such as Giada De Laurentiis, Bobby Flay, Mario Batali and Charlie Trotter. Exclusive, never-before-published recipes from many of the authors, including Michelle Bernstein's supercrispy fried chicken and Flo Braker's dreamy coconut cream pie.",
        "Category": " Cooking , General",
        "Publisher": "Food & Wine",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Walking Dead: Compendium One",
        "Authors": "By Moore, Tony (ILT), Kirkman, Robert, Adlard, Charlie (ILT), Rathburn, Cliff (ILT), and Wooton, Rus (CON)",
        "Description": "Introducing the first eight volumes of the fan-favorite, New York TimesBest Seller series collected into one massive paperback collection! Collects TheWalking Dead #1-48.  This is the perfect collection for any fan of the EmmyAward-winning television series on AMC: over one thousand pages chronicling thebeginning of Robert Kirkman's Eisner Award-winning continuing story of survivalhorror- from Rick Grimes' waking up alone in a hospital, to him and his familyseeking solace on Hershel's farm, and the controversial introduction of Woodburydespot: The Governor. In a world ruled by the dead, we are finally forced tofinally start living.",
        "Category": " Comics & Graphic Novels , Horror",
        "Publisher": "Image Comics",
        "Price Starting With ($)": "23.1",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Slim Calm Sexy Yoga: 210 Proven Yoga Moves for Mind/Body Bliss",
        "Authors": "By Stiles, Tara",
        "Description": "Inside this book is the secret to a new you. A slimmer, calmer, sexier you. The secret? A revolutionary approach to the traditional practice of yoga.Study after study has shown that yoga offers a multitude of benefits for today's stressedout, busy woman, including a trimmer body, stronger immunity, lower blood pressure, improved mood, better sex, and more!In this comprehensive manual, you'll find more than 200 body-shaping and lifechanging yoga poses, meditations, breathing exercises, and unique 15-minute routines crafted by yoga superstar Tara Stiles.In Slim Calm Sexy Yoga you'll discover how just 15 minutes of yoga a day can help you:- Sculpt a sexy silhouette- Control diet-busting cravings- Banish stress for good- Amp up your sexual satisfaction- Get smooth, glowing skin- Sleep better, stay healthy, and have through-the- roof energyThis easy-to-follow illustrated guide to the transformative powers of yoga guarantees a total lifestyle makeover. Let Slim Calm Sexy Yoga be your blueprint for a brand-new you!",
        "Category": " Health & Fitness , Yoga",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Keep Calm and Carry On",
        "Authors": "By Andrews McMeel Publishing (COR)",
        "Description": "Packed full of cheery motivational quotes, proverbs and mantras, Keep Calm and Carry On is an uplifting gift book meant to give you a boost through troubled times. Discovered on a poster created by the British Ministry of Information for British soldiers before World War II, the slogan still manages to strike a chord in our current difficult times.\"Success is the ability to go from one failure to another with no loss of enthusiasm.\" --Winston Churchill\"Don't judge each day by the harvest you reap, but by the seeds that you plant.\" --Robert Louis Stevenson\"It's a recession when your neighbor loses his job; it's a depression when you lose your own.\" --Harry S. Truman",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "An Irish Country Courtship: A Novel (Irish Country Books)",
        "Authors": "By Taylor, Patrick",
        "Description": "Welcome to the colourful Ulster village of Ballybucklebo, where two doctors work hand in hand to mend the bodies and spirits of the town's diverse and engaging inhabitants. But who is looking after the wounded hearts of the doctors?After less than a year, young Barry Laverty, M.B., is settling in to the village, with only a few months to go before he becomes a full partner in the practice. He's looking forward to becoming a fixture in the community, until an unexpected romantic reversal gives him second thoughts. Will he truly be happy tending to routine coughs and colds for the rest of his career? After all, even when a more challenging case comes along, like a rare tropical disease, all he can do is pass it on to a qualified specialist or big-city hospital. As much as Barry enjoys the rough and tumble of life in County Down, is running a humble GP's shop all he wants out of life?Barry's mentor, Doctor Fingal Flahertie O'Reilly, is going through some personal upheavals as well. After mourning his deceased wife for decades, he's finally allowed a new woman into his life. But this budding courtship is not going over well with Kinky Kincaid, the doctors' redoubtable housekeeper, who fears having her position usurped by O'Reilly's new flame. Tact, diplomacy, and a fair amount of blarney may be required to restore peace to the household.Meanwhile, life goes on in Ballybucklebo, presenting both doctors with plenty of distractions from their own troubles. From a mysterious outbreak at the local school to a complicated swindle involving an unlucky racehorse, the two partners will need all of their combined wit and compassion to put things right again--just in time for their lives to change forever.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "By Nightfall: A Novel",
        "Authors": "By Cunningham, Michael",
        "Description": "Peter and Rebecca Harris: mid-forties denizens of Manhattan's SoHo, nearing the apogee of committed careers in the arts—he a dealer, she an editor. With a spacious loft, a college-age daughter in Boston, and lively friends, they are admirable, enviable contemporary urbanites with every reason, it seems, to be happy. Then Rebecca's much younger look-alike brother, Ethan (known in thefamily as Mizzy, \"the mistake\"), shows up for a visit. A beautiful, beguiling twenty-three-year-old with a history of drug problems, Mizzy is wayward, at loose ends, looking for direction. And in his presence, Peter finds himself questioning his artists, their work, his career—the entire world he has so carefully constructed.Like his legendary, Pulitzer Prize–winning novel, The Hours, Michael Cunningham's masterly new novel is a heartbreaking look at the way we live now. Full of shocks and aftershocks, it makes us think and feel deeply about the uses and meaning of beauty and the place of love in our lives.",
        "Category": " Fiction , Literary",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Insurance Handbook for the Medical Office",
        "Authors": "By Fordney, Marilyn Takahashi",
        "Description": "Keep current with all the latest changes with this complete resource! Trusted by medical insurance instructors and billers for more than 30 years, Insurance Handbook for the Medical Office helps you excel at all aspects of insurance billing for a full range of today's health care plans. In full color, this edition includes all the new regulations, such as the latest information on HIPAA, diagnostic coding, procedural coding, bill collection strategies, and Medicare.Meticulously reviewed by a panel of industry experts. Emphasis on the business of running a medical office highlights the importance of the medical insurance specialist's role in filing clean claims, solving problems, and collecting overdue payments.Key terms are bolded at first mention, explained within the context of the discussion, and defined in the glossary.Key points summarize important chapter content. Block-by-block explanations and examples demonstrate the correct way to complete the CMS-1500 claim form.Completed sample insurance forms apply concepts to real life. Unique payer icons clarify CMS claim form completion. Form icons and Computer icons ease the transition from paper to electronic filing.Special HIPAA Alerts ensure compliance with governmental privacy regulations.Guidelines for the filing and submission of electronic claims include the do's and don'ts for the electronic environment.Service to Patient features discuss ways to provide quality service to the patient as well as to your co-workers.A documentation chapter covers the principles of documentation and shows how proper documentation can prevent penalties and refund requests, and help you prove compliance in the case of an audit or review.An Evolve website includes supplemental Medisoft activities, self-assessment quizzes, updates of content, and web links for further research and study.A workbook contains learning tips, review exercises, cases, and critical thinking activities for hands-on experience with real-world cases. (Available separately.)Updated learning objectives correlate directly to the text, making it easier to study and to measure your progress.New CMS-1500 form filler software on Evolve provides additional exercises for hands-on practice.",
        "Category": " Medical , Medical History & Records",
        "Publisher": "Saunders",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Blood of Lambs: A Former Terrorist's Memoir of Death and Redemption",
        "Authors": "By Saleem, Kamal and Lynn, Vincent",
        "Description": "Memoirs of a Terrorist reveals the true inside story of the life and mindset of a radical muslim terrorist who finally came to renounce his murderous mission and embrace freedom. Some radical Muslims believe that non-Muslims who refuse to convert must die. Memoirs of a Terrorist is the true account of the life of such a terrorist who has since renounced his deadly participation in jihad, or “holy war.” His memoir conveys an urgent message to Americans to wake up to the dangers of the terrorists who are still executing their harmful and destructive schemes.Kamal Saleem was born under a different name into a Sunni Muslim family in Lebanon. From a young age he was taught that the loftiest accomplishment he could achieve in life was to be martyred while killing infidels, namely Christians, Jews, and Americans. At age seven, he was recruited by the Muslim Brotherhood and entered an assault camp where members of al-Assifa, the armed branch of Fatah, trained for terror missions against Israel. After years of training, Saleem operatedin successful terror campaigns funded by the Muslim Brotherhood, the Palestinian Liberation Organization, and wealthy oil sheikhs. He infiltrated the United States with the sole purpose of converting others to radical Islam.However, a life-changing event caused him to reevaluate his worldview. Kamal came to know three kind Christian men, and through them he saw the love of God—eventually coming to know their God as well. As a result of their love andsacrificial giving, Kamal acknowledged his need for Christ as Savior. Memoirs of a Terrorist is his riveting story that attests to the power of love and freedom.",
        "Category": " Religion , Religion, Politics & State",
        "Publisher": "Howard Books",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "They Must Be Stopped: Why We Must Defeat Radical Islam and How We Can Do It",
        "Authors": "By Gabriel, Brigitte",
        "Description": "They Must Be Stopped is New York Times bestselling author Brigitte Gabriel's warning to the world: We can no longer ignore the growth of radical Islam--we must act soon, and powerfully. Gabriel challenges our western and politically-correct notions about Islam, demonstrating why radical Islam is so deadly and how we can halt its progress.Brigitte Gabriel speaks her mind:*Fundamentalist Islam is a religion rooted in 7th century teachings that are fundamentally opposed to democracy and equality.*Radical Islamists are utterly contemptuous of all \"infidels\" (non-Muslims) and regard them as enemies worthy of death.*Madrassas in America are increasing in number, and they are just one part of a growing radical Islamic army on US soil.*Radical Islam exploits the US legal system and America's protection of religion to spread its hatred for western values.*America must organize a unified voice that says \"enough\" to political correctness, and demands that government officials and elected representatives do whatever is necessary to protect us.Brigitte Gabriel has fearlessly faced down critics, death threats, and political correctness, and is one of the most sought after terrorism experts in the world. They Must Be Stopped is her clarion call to action. Gabriel thoroughly addresses the historical and religious basis of radical Islam, its frightening encroachment into societies around the world, and its abuses of democracy in the name of religion.",
        "Category": " Political Science , Terrorism",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "The Teen Vogue Handbook: An Insider's Guide to Careers in Fashion",
        "Authors": "By Teen Vogue (COR)",
        "Description": "Amy Astley, former Teen Vogue Editor-in-Chief, says: “The Teen Vogue Handbook is a dream book, a truly creative book filled with tips on the stylish life from the top people in the industry.”The key to this book is the mix of beautiful pictures, career advice and profiles of everyone and every aspect of the fashion industry.  There are hugely famous people interviewed (Marc Jacobs, Bruce Weber, Patrick DeMarchelier) alongside assistants and others who are just getting started.  The book includes 6 sections: Designers, Editors, Stylists, Beauty, Photographers and Models.  And in every section, the people in the profile share simple tips on how to live the Teen Vogue lifestyle, now.",
        "Category": " Young Adult Nonfiction , Girls & Women",
        "Publisher": "Razorbill",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Barron's AP English Language and Composition",
        "Authors": "By Ehrenhaft, George",
        "Description": "This updated manual presents five full-length practice exams with all questions answered and clearly explained. The book features a complete overview of what students need to know about language and rhetoric to earn top scores on the AP exam. Also included is advice and instruction for answering multiple-choice questions, plus an essential guide to writing focused and well-organized responses to essay questions, including the synthesis essay, which requires students to demonstrate mastery of documentation skills. Sample students’ essays are presented with critiques that point out each essay’s strengths and weaknesses. A glossary consisting of hundreds of rhetorical terms is also included.",
        "Category": " Language Arts & Disciplines , Writing , General",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Quiet Strength: Men's Bible Study",
        "Authors": "By Group Publishing",
        "Description": "This resource addresses six tough questions men ask. Or, more accurately, don't ask--though men crave the answers.Each of the six Bible studies is crafted especially for men, and provides biblical answers, relationship-building discussion questions, fun activities, and character-building insights from the life of Tony Dungy, Head Coach of the Indianapolis Colts.Readers find six studies that answer these questions:    What's my game plan?    What's my strength?    What's success?    Where's my security?    What is my significance?    What's my legacy?",
        "Category": " Religion , Christian Ministry , Adult",
        "Publisher": "Group Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "The Power of a Whisper: Hearing God, Having the Guts to Respond",
        "Authors": "By Hybels, Bill",
        "Description": "“Without a hint of exaggeration,” says  Bill Hybels, “the ability to discern divine direction has saved me from a life of sure boredom and self-destruction. God’s well-timed words have redirected my path, rescued me from temptation and re-energized me during some of my deepest moments of despair.” In The Power of a Whisper, vision is cast for what life can look like when God’s followers choose to hear from heaven as they navigate life on earth. Whispers that arbitrate key decisions, nudges that rescue from dark nights of the soul, promptings that spur on growth, urgings that come by way of another person, inspiration that opens once-glazed-over eyes to the terrible plight people face in this world—through firsthand accounts spanning fifty-seven years of life, more than thirty of which have been spent in the trenches of ministry, Hybels promotes passion in Christ-followers' hearts for being wide open to hearing from God, and for getting gutsier about doing exactly what he says to do. For more information go to: www.thewhisperwall.com.",
        "Category": " Religion , Christian Living , Spiritual Growth",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "12.7",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Microsoft Windows Vista: Comprehensive Concepts and Techniques (Shelly Cashman Seies)",
        "Authors": "By Shelly, Gary B., Freund, Steven M., and Enger, Raymond E.",
        "Description": "Introduce your students to the new generation of Microsoft Office with the new generation of Shelly Cashman Series books! For the past three decades, the Shelly Cashman Series has effectively introduced computer skills to millions of students. With Windows Vista, we're continuing our history of innovation by enhancing our proven pedagogy to reflect the learning styles of today's students.  In Microsoft Windows Vista: Comprehensive Concepts and Techniques you'll find features that are specifically designed to engage students, improve retention, and prepare them for future success. Our trademark step-by-step, screen-by-screen approach now encourages students to expand their understanding of the Windows Vista operating system through experimentation, exploration, and planning ahead. Brand new end of chapter exercises prepare students to become more capable users by requiring them to use critical thinking and problem-solving skills.",
        "Category": " Computers , Operating Systems , General",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "7.67",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Adobe Photoshop CS3 One-On-One",
        "Authors": "By McClelland, Deke",
        "Description": "The DVD videos are available on Safari. Please click here.Pioneering computer graphics author Deke McClelland updates his bestselling hands-on tutorial for Adobe Photoshop CS3, the latest version of this industry-standard image editing and production program. As with previous editions, Photoshop CS3 One-on-One guides readers step by step through the program's features and functionality. A key appeal of the One-on-One series is the two hours of DVD-video material included. Once you read about a particular technique, you can see how it's done first hand in the video. The combination is uniquely effective. And hugely popular.Whether you're a first-timer looking to learn Photoshop, or a seasoned user interested in the groundbreaking features of CS3, Deke's conversational style and carefully structured lessons guide you through everything you need to know to get up and running, and then takes you well into mastery. You'll learn to:Grasp fundamental and advanced concepts and theoryUse best practices, and techniques for making the most of Photoshop CS3Build relevant, real-world projectsUse Photoshop's workflow and file handling featuresUse the combined power of Bridge + Camera Raw to process your digital photosChoose the right technique for converting your images to black & whiteCreate beautiful multilayered documents including posters and flyersAnd much moreA Photoshop expert, sought-after computer graphics and design lecturer and author of over 70 books, Deke creates a classroom environment in Photoshop CS3 One-on-One with written instruction and video training -- except that you get one-on-one attention as you proceed from lesson to lesson at your own pace. It's like having private lessons with the author.Whether you're an enthusiast, prosumer, creative pro, technical pro, or newcomer, Deke's book will have you speaking fluent Photoshop CS3 in no time.",
        "Category": " Computers , Desktop Applications , Desktop Publishing",
        "Publisher": "Deke Press",
        "Price Starting With ($)": "7.06",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Sleepwalk with Me: and Other Painfully True Stories",
        "Authors": "By Birbiglia, Mike",
        "Description": "Hello, I am Mike Birbiglia and I want you to read my book. Too on the nose? Sorry. Let me dial it back.  I’m Mike Birbiglia and I’m a comedian. You may know me from Comedy Central or This American Life or The Bob & Tom Show, but you’ve never seen me like this before. Naked. Wait, that’s the name of another book. Also I’m not naked as there are no pictures in my book. Also, if there were naked pictures of me, you definitely wouldn’t buy it, though you might sneak a copy into the back corner of the bookstore and show it to your friend and laugh. Okay, let’s get off the naked stuff. This is my first book. It’s difficult to describe. It’s a comedic memoir, but I’m only 32 years old so I’d hate for you to think I’m “wrapping it up,” so to speak. But I tell some personal stories. Some REALLY personal stories. Stories that I considered not publishing time and time again, especially when my father said, “Michael, you might want to stay away from the per­sonal stuff.” I said, “Dad, just read the dedication.” (Which I’m telling you to do too.) Some of the stories are about my childhood, some are about girls I made out with when I was thirteen, some are about my parents, and some are, of course, about my bouts with sleepwalking. Bring this book to bed. And sleepwalk with me.",
        "Category": " Performing Arts , Comedy",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "Excel 2007 All-In-One Desk Reference For Dummies",
        "Authors": "By Harvey, Greg",
        "Description": "Master the Ribbon, powerful graphics capabilities, and more!  Your one-stop guide to great-looking spreadsheets that actually mean something Create colorful spreadsheets and charts, use Live Preview, and maximize everything Excel 2007 has to offer! Find just what you need to know about using the new Ribbon, designing spreadsheets that communicate, editing and printing them, working with formulas, protecting your data when you collaborate, turning out cool charts, and much more. The included four-color insert highlights the Ribbon, new graphics features, and more! Discover how to  Create dynamic spreadsheets with style galleries Work with more than 40 new cell styles Automate formatting with Live Preview Share Excel data with other programs Use VBA to write custom Excel functions",
        "Category": " Computers , Desktop Applications , Spreadsheets",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Zombie Combat Manual: A Guide to Fighting the Living Dead",
        "Authors": "By Ma, Roger and Heller, Y. N. (ILT)",
        "Description": "The Zombie Combat Manual is a comprehensive guide that demonstrates how anyone, from seasoned fighter to average citizen, can become an effective warrior in the inevitable battle against the undead.   With detailed illustrations and firsthand accounts from zombie combat veterans, this manual provides readers with the information they need to emerge victoriously from a close combat encounter with a walking corpse. Now is the time to learn how to survive a hand-to-hand battle against the advancing army of the undead-before humans fall prey to their growing ranks.",
        "Category": " Humor , Form , Parodies",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "How to Let God Solve Your Problems: 12 Keys for Finding Clear Guidance in Life's Trials",
        "Authors": "By Stanley, Charles F.",
        "Description": "“God, how did I get in this mess!?”Is that the cry of your heart? You may be in the midst of an emotional hurricane right now and wondering Can anything good come out of this situation? Or you may be stumbling through the aftermath of a physical or financial crisis, fearful that you’ll never get back on your feet. In How to Let God Solve Your Problems, Dr. Charles Stanley demonstrates how God allows times of trial for a number of reasons:To turn your attention back toward Him.To adjust your priorities.To purify and prepare you for greater service.To better form you into His image.To grant you the experience of His comfort.Whether your hardship is the result of sin, unwise choices, or simply the consequence of living in a fallen world, God still has a plan for your life. He is aware of your circumstances, He has not forgotten His promises, and He will guide you through your difficulty to victory!",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Baby Love: Healthy, Easy, Delicious Meals for Your Baby and Toddler",
        "Authors": "By O'donnell, Norah and Tracy, Geoff",
        "Description": "Finally, the must-have cookbook is here for the millions of busy parents who have taken on a healthier approach to eating—less processed, more organic—and who want to feed their little ones easy-to-make, cost-effective, completely nutritious and delicious meals.With more than sixty gourmet-inspired recipes and dozens of Chef Geoff's tips for quick and nutritious preparation, parents everywhere will be in on the Baby Love secret: that making fresh baby food is pretty simple, even if you've never cooked a day in your life.Learn how to make two weeks worth of Baby Love meals in less than one hour per week, at a fraction of the cost of jarred baby food. Say good-bye to bland and processed and hello to fresh and scrumptious!BABY LOVE recipes include: Pom-Pom Apple*Peach and Apricot Oatmeal*Tropical Smoothie *Creamy Butternut with Nutmeg*Very Gouda Grits*Norah's Brain-Booster Zucchini Muffins*Made with Love…Baby Love",
        "Category": " Cooking , Baby Food",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "I Like You: Hospitality Under the Influence",
        "Authors": "By Sedaris, Amy",
        "Description": "The inspiration for the TV show At Home with Amy Sedaris, here is a hilarious, helpful, and informative guide on how to entertain.Are you lacking direction in how to whip up a swanky soiree for lumberjacks?  A dinner party for white-collar workers?  A festive gathering for the grieving?  Don't despair!Take a cue from entertaining expert Amy Sedaris and host an unforgettable fete that will have your guests raving.  No matter the style or size of the gathering - from the straightforward to the bizarre - I LIKE YOU provides jackpot recipes and solid advice laced with Amy's blisteringly funny take on entertaining, plus four-color photos and enlightening sidebars on everything it takes to pull off a party with extraordinary flair.  You don't even need to be a host or hostess to benefit - Amy offers tips for guests, too!  (Rule number one:  don't be fifteen minutes early.)  Readers will discover unique dishes to serve alcoholics (\"Broiled Frozen Chicken Wings with Applesauce\"), the secret to a successful children's party (a half-hour time limit, games included), plus a whole appendix chock-full of arts and crafts ideas (from a mini-pantyhose plant-hanger to a do-it-yourself calf stretcher), and much, much more!\"In At Home with Amy Sedaris, Ms. Sedaris offers deliriously twisted takes on the homemaking skills she skewered in her books I Like You and Simple Times.\" -- The New York TimesAmySedarisRocks.comInstagram.com/AmySedarisFacebook.com/AmySedarisOfficialYoutube.com/OfficialAmySedaris",
        "Category": " Cooking , Entertaining",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "No More Sleepless Nights",
        "Authors": "By Linde, Shirley and Hauri, Peter",
        "Description": "In this sensible, simple-to-follow workbook, based on the acclaimedNo More Sleepless Nights program, one of the world's leadinginsomnia experts gives you the tools to be your own sleeptherapist. Filled with interactive quizzes, sleep logs, andself-evaluation exercises, which may be used in conjunction withthe patented Sleep Timer, the workbook will help you uncover theunderlying cause of your own sleep problem, and then put together apersonalized action plan for getting a good night's rest.  With advice on improving sleep hygiene and diet, the rightexercise, relaxation techniques, and more, No More SleeplessNights Workbook helps you conquer your own poor sleep rightnow. More importantly, it equips you to beat it again if it everreturns to disturb your dreams.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "A New Kind of Christianity: Ten Questions That Are Transforming the Faith",
        "Authors": "By McLaren, Brian D.",
        "Description": "“Some books provide us with information about the world, but every once in a while a book appears that enables us to imagine new, more wonderful worlds. [A New Kind of Christianity] is one of these.” —Peter Rollins, Ikon A New Kind of Christianity is Brian D. McLaren’s much anticipated follow-up to his breakthrough work of the emergent-church movement, A New Kind of Christian. Named by Time magazine as one of America’s top 25 evangelicals, McLaren, along with such contemporaries as N.T. Wright, Jim Wallis, and Rob Bell, is one of the acknowledged leaders of a new generation of Christians who want to update their faith for current times while remaining true to the core message of Jesus. In this controversial and thought-provoking book, McLaren explores the questions that will determine the shape of Christianity for the next 500 years.",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Fortunate Harbor (A Happiness Key Novel)",
        "Authors": "By Richards, Emilie",
        "Description": "Join five women connected only by their growing friendship and the road that runs like a lifeline between their cottages in a run-down Florida development called Happiness Key.Tracy Deloche finally gets a chance to swap business for a romantic evening with Marsh Egan, but dinner goes cold when she spots her ex-husband prowling outside her cottage. CJ is supposed to be in prison and out of her life for good. Exactly what is this modern-day pirate seeking and what will it mean for Tracy's future?Janya Kapur envies every pregnant woman she sees, but Rishi, her husband, is suddenly reluctant to talk about children. Is he disappointed in her inability to conceive? Their marriage was a contract between strangers. Can they ever hope for anything more?Waitress Wanda Gray loses her job after new owners turn the Dancing Shrimp into a tapas bar. Wise neighbor Alice Brooks's suggestion that Wanda start her own business seems like a brilliant solution, until Wanda starts Pie War I with the owners of the local bakery.When the empty cottage at Happiness Key is rented by single mother Dana Turner, everything seems perfect. With Alice volunteering to watch Dana's daughter while she works and Wanda's offer of a job, this spit of Florida Gulf Coast land should be a fortunate harbor for a mother and daughter who have moved far too often. Except for Dana's shocking secret.As the women of Happiness Key struggle to discover the truth in time to help their new neighbor, their only weapon is friendship. But will friendship be enough?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    }
]