[
    {
        "Title": "The Rescue of Miss Yaskell: And Other Pipe Dreams",
        "Authors": "By Baker, Russell",
        "Description": "A selection of Baker's witty, trenchant observations on society, morals, manners, and current events encompasses literary parodies, reminiscences, and personal anecdotes about topics ranging from high interest rates to pro football",
        "Category": " Humor , General",
        "Publisher": "Congdon & Weed",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Tangled Vines",
        "Authors": "By Dailey, Janet",
        "Description": "What mystery haunts the Rutledge Estate, one of the most prestigious vineyards in Napa Valley? What secret has Kelly Douglas, one of prime time's most popular newscasters, kept locked inside for so many years? In Tangled Vines, Janet Dailey's riveting new novel, the lush vineyards of Napa Valley, California, and the city lights of Manhattan are the backdrops for the mesmerizing story of television news personality Kelly Douglas and vintner Sam Rutledge, and the passions and secrets that surround their lives and the Napa wine country.Kelly Douglas, the host of a new prime-time magazine show, is on the brink of achieving her lifelong dream of becoming a nightly news anchor. Hers is a modern-day Cinderella story: long ago she pulled herself out of a desperately unhappy childhood in rural Napa Valley, escaped from her abusive, alcoholic father, and transformed herself from \"four-eyed and fat\" Lizzie Dougherty into the chic and successful Kelly Douglas. Her lustrous auburn hair, impeccable taste and wardrobe, dedication to hard work, and uncanny talent for being in the right place at the right time have propelled her to journalistic stardom - and she has never once looked back.By chance, Kelly returns to Napa Valley to do a feature story. There she becomes entangled in the lives of Katherine Rutledge, the matriarch of the famous Rutledge Estate Winery, and her grandson, the ruggedly handsome vintner Sam Rutledge, who epitomizes the family motto: If you're a Rutledge, wine, not blood, runs through your veins. But the Rutledge motto also applies to Katherine's estranged son, Gil, who owns a competing winery in the valley. The bonds of blood and wine are put to the ultimate test, and the bitter rivalry between Katherine and Gil is further fueled by the desire of them both to form a joint venture with the illustrious Bordeaux winery of Baron Fougere in France - with both mother and son vowing to stop at nothing to attain their goal.Meanwhile, Kelly finds herself progressively drawn to Sam's subtle yet sexy charm. Up until now, Kelly's fast-track schedule has never allowed her any time for love - should she be falling for Sam Rutledge now, at the most crucial moment of her career?When a murder on the Rutledge Estate is linked to Kelly's abusive father, from whom she has long been estranged, her entire world turns upside down, and she is forced to confront her hidden past and her hidden pain. Amid the turmoil, Kelly and Sam discover their extraordinary passion and poignant love for each other. But can Kelly afford to let Sam see the battered child within? Will she jeopardize her promising new life and career, or risk losing the one man she loves in order to protect her secret past?Tangled Vines is an enthralling story of passion and intrigue that combines the romance and drama of the wine country with the healing power of love to create Janet Dailey's most exciting and rewarding novel yet.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Little Brown & Co (T)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Castro's Curveball",
        "Authors": "By Wendel, Tim",
        "Description": "Fresh, original, and peopled with a rich cast of colorful characters, Castro's Curveball captures the passion of baseball and the vibrant flavor of Cuba in a grand-slam work of fiction.Whether you believe in fate, the stars, a Supreme Being, or Mr. Coincidence, you can always count on one thing--life will throw you a wicked curveball or two. Billy Bryan has seen his share. A former minor-league catcher for the Washington Senators, Bryan is now a retired high school teacher, widowed with a grown daughter, and \"coming to the end of many things.\" Then a long-forgotten scrapbook stirs memories of a distant past--and beckons him on a reluctant journey to relive his own extraordinary role in history. . . .In 1947, Bryan is playing winter ball in Cuba, immersing himself in the decadent nightlife of Havana, and dreaming of someday \"making it\" to the majors. But his future on the diamond is as uncertain as Cuba itself, a country where rumblings of revolution hang in the air like a high fly ball to left. Then one fateful night Bryan witnesses a young student radical named Fidel hurl pitch after amazing pitch. So begins Billy's tug-of-war with destiny--to score a victory for the game he worships, win the heart of the woman he loves, or make his mark in a world racing toward revolution. . . .",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "The Frequency of Souls",
        "Authors": "By Zuravleff, Mary Kay",
        "Description": "George Mahoney suspects he is getting a little stale at redesigning refrigerators, the job he has held for fourteen years. His new office mate, Niagara Spense, is six feet tall, has cloth-brown hair and glasses thicker than George's, and wears a different color of the same homemade dress every day. George cannot stop thinking about her, despite the fact that he is married and the father of two. They come to electrical engineering from opposite directions: while George is wedded to facts and the physical world, Niagara considers electricity a mysterious life force flowing behind walls and throughout the nerves of the body.Soon the gangly girl scientist tells George of her quest for electrical evidence of life after death - audible fossils she calls them - and her revelation compounds George's crises of faith in his puny belief system, his marriage, and his career. Ready to leave his icemakers and butter softeners behind, George finds he has a personal stake in Niagara's astral projections. By the end of this extraordinary novel, Niagara has opened many doors for George, and ultimately she opens him up to the cosmos, where he learns the truth that allows him to claim the life that is his.",
        "Category": " Fiction , General",
        "Publisher": "Farrar Straus Giroux",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "I Don't Know How She Does It: The Life of Kate Reddy, Working Mother",
        "Authors": "By Pearson, Allison",
        "Description": "For every woman trying to strike that impossible balance between work and home-and pretending that she has-and for every woman who has wanted to hurl the acquaintance who coos admiringly, \"Honestly, I just don't know how you do it,\" out a window, here's a novel to make you cringe with recognition and laugh out loud. With fierce, unsentimental irony, Allison Pearson's novel brilliantly dramatizes the dilemma of working motherhood at the start of the twenty-first century.Meet Kate Reddy, hedge-fund manager and mother of two. She can juggle nine different currencies in five different time zones and get herself and two children washed and dressed and out of the house in half an hour. In Kate's life, Everything Goes Perfectly as long as Everything Goes Perfectly.  She lies to her own mother about how much time she spends with her kids; practices pelvic floor squeezes in the boardroom; applies tips from Toddler Taming to soothe her irascible boss; uses her cell phone in the office bathroom to procure a hamster for her daughter's birthday (\"Any working mother who says she doesn't bribe her kids can add Liar to her résumé\"); and cries into the laundry hamper when she misses her children's bedtime.In a novel that is at once uproariously funny and achingly sad, Allison Pearson captures the guilty secret lives of working women-the self-recrimination, the comic deceptions, the giddy exhaustion, the despair-as no other writer has. Kate Reddy's conflict --How are we meant to pass our days? How are we to reconcile the two passions, work and motherhood, that divide our lives? --gets at the private absurdities of working motherhood as only a novel could: with humor, drama, and bracing wisdom.",
        "Category": " Fiction , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Hell's Pavement",
        "Authors": "By Knight, Damon",
        "Description": "",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1980"
        }
    },
    {
        "Title": "Charms for the Easy Life",
        "Authors": "By Gibbons, Kaye",
        "Description": "In the verdant backwoods of North Carolina, in a sad and singular era, the Birches are unique among women of their time-living gloriously rich it decidedly offbeat lives in a private world ahandoned by men. And though misery often heats a path to their door, headstrong Sophia and her y, brilliant daughter Margaret possess charms to ward off loneliness and despair-thanks to the uncompromising strength, uncommon wisdom, and muscular love of a remarkable matriarch and self-taught healer who calls herself Charlie Kate.In Charms for the Easy Life, Kaye Gibbons has created a luminous, truthtelling novel that gives life to her most passionate and toughminded women yet.",
        "Category": "",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The Chinese Chef",
        "Authors": "By Yan, Martin",
        "Description": "This new collection of recipes, keyed to the new season of the PBS series \"Yan Can Cook,\" features unusual yet classic dishes, reflecting innovative cooking techniques, and includes a listing of basic--and exotic--ingredients",
        "Category": " Cooking , General",
        "Publisher": "Doubleday Canada",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Why in the World: Adventures in Geography",
        "Authors": "By Agel, Jerome, Demko, George J., and Boe, Eugene",
        "Description": "An introduction to geography uses maps, cartoons, and anecdotes to describe its relationship to history, politics, sociology, population, immigration, cultural patterns, economics, and agriculture",
        "Category": " Reference , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Accident",
        "Authors": "By Steel, Danielle",
        "Description": "Happy housewife Page Clarke finds her life changed forever when her teenaged daughter, Allyson, is in a car accident, and, without her husband Brad there to lean on, Page turns to handsome Trygve, whose own daughter was also injured. 1,300,000 first printing. $500,000 ad/promo.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Five Days in Paris",
        "Authors": "By Steel, Danielle",
        "Description": "As president of a major pharmaceutical empire, Peter Haskell has everything. Power, position, a career and a family, which mean everything to him, and for which he has sacrificed a great deal. Compromise has been key in Peter Haskell's life, and integrity is the base on which he lives. Olivia Thatcher is the wife of a famous senator. She has given to her husband's ambitions and career until her soul is bone dry. She is trapped in a web of duty and obligation, married to a man she once loved and no longer even knows. When her son died, a piece of Olivia died too. Accidentally, on the night of a bomb threat, they meet in Paris, at the Ritz. Their totally different lives converge for one magical moment in the Place Vendôme, as Olivia carefully, silently, steps out of her life and walks away. As the two strangers meet, their lives become briefly enmeshed. In a café in Montmartre, their hearts are laid bare. Peter, once so sure of his path, so certain of his marriage and success, but suddenly faced with his professional future in jeopardy. Olivia, no longer sure of anything except that she can't go on anymore.When Olivia disappears, only Peter suspects that it may not be foul play. And if he finds her again, where will they go from there? Five days in Paris is all they have. They go back to their separate lives, but nothing is the same. At home again, they both must pursue their lives, despite challenges, compromise, and betrayal. Everything they believe is put on the line, until they each realize they must stand fast against compromise and face life's challenges head-on.From the Paperback edition.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "A Recipe for Bees: A Novel",
        "Authors": "By Anderson-Dargatz, Gail",
        "Description": "Gail Anderson-Dargatz's evocative novel of one woman's simple but passionately lived life reminds of us of the pleasure to be found in human contact and simple, natural things.Raised by her silent but companionable father and a mother who kept bees, headstrong Augusta marries shy, deferential Karl, twelve years her senior, and goes to live with him on his father's remote farm. Terrified that she will literally die from loneliness and isolation, she finds work in town, and for a short time, fulfillment with another man in a romance that will reverberate throughout her life. Not until many years later does she find her salvation in beekeeping, the practice she first learned from her mother. It is beekeeping that reconnects her to the world and at long last brings fire to her steadfast marriage.",
        "Category": " Fiction , Literary",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Oh! Pascal!",
        "Authors": "By Cooper, Doug, Clancy, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Norton",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The organic gardener",
        "Authors": "By Foster, Catharine Osgood",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Real Coke: Real Story",
        "Authors": "By Oliver, Thomas",
        "Description": "A financial writer with exclusive access to the Coca-Cola Company introduces the men who weathered the corportate storms of the early 1980s and then examines how they came to make the controversial marketing decision",
        "Category": " Business & Economics , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Making Peace with the Planet",
        "Authors": "By Commoner, Barry",
        "Description": "",
        "Category": " Science , Environmental Science",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "The Ballad of John and Yoko",
        "Authors": "By Jonathan Cott~Christine Doudna",
        "Description": "",
        "Category": "",
        "Publisher": "Dolphin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Flights of discovery: The earth from above",
        "Authors": "By Gerster, Georg",
        "Description": "",
        "Category": "",
        "Publisher": "Paddington Press : distributed by Grosset & Dunlop",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Dryden to Johnson (New History of Literature)",
        "Authors": "By Lonsdale, Roger (EDT)",
        "Description": "Essays discuss Dryden, Swift, Pope, Addison and Steele, Defoe and Richardson, Fielding, Smollett, Sterne, Johnson, and religious themes of the period",
        "Category": " Young Adult Nonfiction , Literary Criticism & Collections",
        "Publisher": "Peter Bedrick Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "A Treasury of Irish Verse",
        "Authors": "By BHB International Staff",
        "Description": "",
        "Category": "",
        "Publisher": "Clb",
        "Price Starting With ($)": "10.78",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Heart of a Father: How Dads Can Shape the Destiny of America",
        "Authors": "By Canfield, Ken R.",
        "Description": "Every father has a hidden desire for his children -- to see them surpass him.  How can this come about?  Ken Canfield gives a three-part blueprint:  First, a dad should examine his own heart.  Next, he should take steps to improve the way he connects with his children.  Then he should take a longer range view and plan specifically for a lifetime of involved fathering.  Based on years of careful research involving thousands of dads, this book is a solid reference tool for dads.  Canfield's three-part blueprint addresses:-A father's past.  A father should resolve his relationship with his own father in order to effectively build a relationship with his children.-How to make a dad's house a home.  Canfield explains how to build the four 'walls' or dimensions, of fathering:  Involvement, Awareness, Consistency, and Nurturing -A plan for the future.  From being a new father to being a grandfather, dads face challenges at each stage of their life.  With the long-range perspective this book provides, fathers can anticipate and prepare for the changing situations they'll face.",
        "Category": " Family & Relationships , Parenting , Fatherhood",
        "Publisher": "Northfield Publishing",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Laura: America's First Lady, First Mother",
        "Authors": "By Felix, Antonia",
        "Description": "A biography of First Lady Laura Bush retraces her journey from a West Texas town to the halls of power in Washington.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Adams Media Corp",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Power Sleep : The Revolutionary Program That Prepares Your Mind for Peak Performance",
        "Authors": "By Maas, James B. and Wherry, Megan L.",
        "Description": "Do your eyelids feel heavy during afternoon meetings? Do you sleep extra hours on weekend mornings? Do you use caffeine to stay alert? An alarm to get out of bed? These are all symptoms of sleep deficiency--signals that you are operating below your peak performance and beneath your mental capacity. Despite popular perceptions, sleep is not a luxury--it is a necessity. More than seventy million Americans are sleep-deprived, and make crucial business and personal decisions in an impaired state. In Power Sleep, Dr. James B. Maas, a pioneer of sleep research at Cornell University, has created an easy, drug-free program to improve your body and mind for an alert and productive tomorrow. In Power Sleep, you&#39;ll find:  The golden rules of sleep Twenty great sleep strategies Dos and don&#39;ts of sleeping pills and over-the-counter remedies How to combat travel fatigue, including jet lag and drowsy drivingTips for exhausted parents of newborns, infants, and toddlers How to overcome sleep disorders, including insomnia An important and practical book, Power Sleep will help you get the sleep you need to improve your mental and physical well-being quickly and dramatically and to become a peak performer.",
        "Category": " Self-help , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Inner Simplicity: 100 Ways to Regain Peace and Nourish Your Soul",
        "Authors": "By ST. James Elaine",
        "Description": "The author of Simplify Your Life offers a path to the simpler life of mind and spirit through meditation, solitude, making spirituality a regular part of the day, and getting in touch with your creativity. Original. 75,000 first printing.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The Movie Mom's Guide to Family Movies",
        "Authors": "By Minow, Nell",
        "Description": "A parent's guide to movies on video appropriate for children aged two to eighteen reviews more than five hundred movies for families, including plot descriptions, the issues they explore, and warnings about violence, stereotypes, sex, and more. Original.",
        "Category": " Performing Arts , Film , Guides & Reviews",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Never Mind the Pollacks: A Rock and Roll Novel",
        "Authors": "By Pollack, Neal",
        "Description": "The most important document in the history of rock 'n' roll since the liner notes to Killroy Was Here.(This paperback includes a new P.S. section with author interviews, insights, features, suggested readings, and more.)Never Mind the Pollacks, the first novel from acclaimed humorist Neal Pollack, is an epic history of rock-and-roll told through the eyes of two rival rock critics. The novel spans the decades from the 1940s to the present day, and includes such real-life characters as Elvis Presley, Bob Dylan, Joan Baez, Lou Reed, Iggy Pop, Bruce Springsteen, Joey Ramone, Patti Smith, Kurt Cobain, and many more. Pollack deploys his trademark roasting of literary pomposity, but his narrative transcends mere parody to become full-fledged social satire. He takes on the icons of popular music and their biographers, true-life rock books and historical fiction. There has never been a book quite like this one, particularly since it contains more than two-dozen original songs written by the author.The life story of the book's main character, \"Neal Pollack,\" is uniquely American. The only son of Jewish immigrant parents, he shows an aptitude early in life for rock criticism. Prodded by the legendary Sam Phillips and haunted by a ghostly, mysterious blues man, deeply disturbed by his mother's illegitimate marriage to Jerry Lee Lewis, he leaves his Memphis boyhood behind to become a folk troubadour in Greenwich Village. Six broken hearts, two liver transplants, and a lot of cocaine orgies later, he meets his ultimate destiny in a surprise ending that will shock anyone who wasn't paying attention to the early chapters. With Never Mind the Pollacks, Neal Pollack establishes himself as one of the most important novelists of his generation who isn't named Jonathan.",
        "Category": " Fiction , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Matter of Trust (Shadowcreek Chronicles)",
        "Authors": "By Renich, T. Elizabeth",
        "Description": "",
        "Category": " Fiction , Historical",
        "Publisher": "Y W A M Pub",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The Conspiracy of Ignorance: The Failure of American Public Schools",
        "Authors": "By Gross, Martin L.",
        "Description": "In this global age of information, nothing should alarm American parents and leaders more than the failure of our public schools. As quality education of the young becomes the true international currency, that commodity--unfortunately--is in grievously short supply. American schoolchildren lag far behind students in most of the developed world, scoring nineteenth out of twenty-one countries in a recent math competition. On domestic exams, almost forty percent are reading at \"below basic\" levels.  In this candid, provocative, and comprehensive study of the public school system, from kindergarten through high school, bestselling author Martin L. Gross charges that the Education Establishment has nurtured a conspiracy of ignorance that promotes and defends lower standards of teaching and learning designed to maintain its monopoly on our public schools.  The verdict is in: The teaching vocation has failed to produce competent teachers, penalizing its 45 million public school students. The problem is that the Establishment--from a tight group of teachers, principals, superintendents, education professors, and counselors, to the state commissioners of education--selects mainly academically inferior teacher candidates, and ignoring time-tested fundamentals, trains them in such dubious concepts as \"educational psychology\" and a \"whole language\" method of reading that ignores proper grammar and spelling.  In a series of shocking revelations, Mr. Gross describes how the typical teacher learns little more than a two-year community college graduate; how the average college-bound student scores fifty points higher on his SAT exams than most of his teachers; how the great majority of school teachers are less trained in their own specialties than other college graduates in the same field; and how \"untrained\" teachers in both private and public schools perform better than Establishment graduates. The usual remedies--from federal aid to smaller class sizes--have done nothing to alleviate these problems because they make no attempt to challenge the Education Establishment's control. In a powerful Bill of Indictment, Mr. Gross shows how the teaching vocation, aided by its unions, maintains a self-perpetuating cycle of low performance, and he offers his own detailed prescription for change that will raise public education to the level our children--and society--need and deserve.  The Conspiracy of Ignorance is a lucid, persuasive argument based on a wealth of research that asks the questions most education observers are afraid to ask. It is a book desperately needed to ensure that American schoolchildren will have a chance to prosper as educated and productive citizens in today's world.",
        "Category": " Education , Educational Policy & Reform , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Practicing History",
        "Authors": "By Tuchman, Barbara Wertheim",
        "Description": "Celebrated for bringing a personal touch to history in her Pulitzer Prize–winning epicThe Guns of August and other classic books, Barbara W. Tuchman reflects on world events and the historian’s craft in these perceptive, essential essays.From thoughtful pieces on the historian’s role to striking insights into America’s past and present to trenchant observations on the international scene, Barbara W. Tuchman looks at history in a unique way and draws lessons from what she sees. Spanning more than four decades of writing in The New York Times Magazine, The Atlantic, Foreign Affairs, Harper’s, The Nation,and The Saturday Evening Post, Tuchman weighs in on a range of eclectic topics, from Israel and Mao Tse-tung to a Freudian reading of Woodrow Wilson. This is a splendid body of work, the story of a lifetime spent “practicing history.”Praise for Practicing History“Persuades and enthralls . . . I can think of no better primer for the nonexpert who wishes to learn history.”—Chicago Sun-Times“Provocative, consistent, and beautifully readable, an event not to be missed by history buffs.”—Baltimore Sun“A delight to read.”—The New York Times Book Review",
        "Category": " History , Reference",
        "Publisher": "Knopf",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1981"
        }
    },
    {
        "Title": "Fortress America: On the Frontlines of Homeland Security --An Inside Look at the Coming Surveillance State",
        "Authors": "By Brzezinski, Matthew",
        "Description": "Heavily armed guards at the entrances to malls and restaurants. Citizens deemed “suspicious” taken away without formal charges or legal counsel. Would a “safe” America even look like America anymore?One of the few journalists to penetrate the new counter terror initiative, Matthew Brzezinski offers an insider’s look at the new technology, laws, tactics, and persistent vulnerabilities of the post-9/11 era. The result is this startling, sometimes controversial look at what it will take to achieve genuine homeland security and what it may be like to live inside Fortress AmericaIs this what a safe America will look like?• Cameras at airport ticket counters that can tell if you are stressed • Satellites and surveillance equipment that can see through the walls of your home• Computer programs capable of spotting abnormal behavior • National ID “smart” cards encoding your personal, financial, and medical information required for electronic police spot checksIn the aftermath of September 11, a massive effort has been launched to protect us from another terrorist attack. But the costs of safeguarding our country will require not only unprecedented amounts of funding, but dramatic changes in the way Americans lead their everyday lives. Is this the new price of freedom? • Mandatory chips installed in all cell phones and automobiles that can locate you instantly within a dozen yards• Patriot II legislation that can arbitrarily revoke citizenship and allow terrorist sympathizers to vanish without a trace• Transponder implants that could be injected into the bodies of prisoners, foreign nationals, and perhaps one day all US citizens…Such high-tech measures are not the stuff of science fiction but in many cases are already being implemented. As Brzezinski discovers, similar measures have been in use for years in security states like Israel. But will Americans trade liberty for security? Will they have a choice? And can even the most radical measures insure that a 9/11 style attack won’t happen again? From an unheeded warning six years before the WTC disaster to dramatic war-game scenarios secretly conducted at Andrews Air Force Base and chilling on-site simulations of actual attacks, Fortress America paints a sobering picture of the future of freedom…and what life may be like in a maximum security state.",
        "Category": " Political Science , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "When My Name Was Keoko",
        "Authors": "By Park, Linda Sue",
        "Description": "Sun-hee and her older brother Tae-yul are proud of their Korean heritage. Yet they live their lives under Japanese occupation. All students must read and write in Japanese and no one can fly the Korean flag. Hardest of all is when the Japanese Emperor forces all Koreans to take Japanese names. Sun-hee and Tae-yul become Keoko and Nobuo. Korea is torn apart by their Japanese invaders during World War II. Everyone must help with war preparations, but it doesn’t mean they are willing to defend Japan. Tae-yul is about to risk his life to help his family, while Sun-hee stays home guarding life-and-death secrets.",
        "Category": " Young Adult Fiction , Historical , Asia",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Intermediate Accounting",
        "Authors": "By Stice, Earl K., Stice, James D., and Skousen, Fred",
        "Description": "New edition of a text that reflects the broadening definition of accounting today.  Skousen (advancement vice president, Brigham Young U.), Earl K. Stice, and James Stice (both of whom are professors of accounting, Brigham Young U.) discuss topics including the foundations of financial accounting, primary and additional activities of a business and common disclosures, and other dimensions of financial reporting. From advances in technology to changing attitudes, they explore the essential concepts and show students how accounting principles are linked to the operation, financing, and investing aspects of business. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Business & Economics , Accounting , General",
        "Publisher": "South-Western College Pub",
        "Price Starting With ($)": "11.13",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "J. K. Rowling: The Wizard Behind Harry Potter",
        "Authors": "By Shapiro, Marc",
        "Description": "Celebrates the life and work of J.K. Rowling, and provides answers to such questions as where did the name \"Harry Potter\" come from, what was J.K. Rowling like as a child, and who were some of her favorite authors.",
        "Category": " Juvenile Nonfiction , Reference , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Vera (Mrs. Vladimir Nabokov)",
        "Authors": "By Schiff, Stacy",
        "Description": "NEW YORK TIMES BESTSELLER  Winner of the 2000 Pulitzer Prize for biography and hailed by critics as both “monumental” (The Boston Globe) and “utterly romantic” (New York magazine), Stacy Schiff’s Véra (Mrs. Vladimir Nabokov) brings to shimmering life one of the greatest literary love stories of our time. Vladimir Nabokov—the émigré author of Lolita; Pale Fire; and Speak, Memory—wrote his books first for himself, second for his wife, Véra, and third for no one at all. “Without my wife,” he once noted, “I wouldn’t have written a single novel.” Set in prewar Europe and postwar America, spanning much of the century, the story of the Nabokovs’ fifty-two-year marriage reads as vividly as a novel. Véra, both beautiful and brilliant, is its outsized heroine—a woman who loves as deeply and intelligently as did the great romantic heroines of Austen and Tolstoy. Stacy Schiff's Véra is a triumph of the biographical form.",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Modern Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Duty: A Father, His Son, and the Man Who Won the War",
        "Authors": "By Greene, Bob",
        "Description": "When Bob Greene went home to central Ohio to be with his dying father, it set off a chain of events that led him to knowing his dad in a way he never had before—thanks to a quiet man who lived just a few miles away, a man who had changed the history of the world.Greene's father—a soldier with an infantry division in World War II—often spoke of seeing the man around town. All but anonymous even in his own city, carefully maintaining his privacy, this man, Greene's father would point out to him, had \"won the war.\" He was Paul Tibbets. At the age of twenty-nine, at the request of his country, Tibbets assembled a secret team of 1,800 American soldiers to carry out the single most violent act in the history of mankind. In 1945 Tibbets piloted a plane—which he called Enola Gay, after his mother—to the Japanese city of Hiroshima, where he dropped the atomic bomb.On the morning after the last meal he ever ate with his father, Greene went to meet Tibbets. What developed was an unlikely friendship that allowed Greene to discover things about his father, and his father's generation of soldiers, that he never fully understood before. Duty is the story of three lives connected by history, proximity, and blood; indeed, it is many stories, intimate and achingly personal as well as deeply historic. In one soldier's memory of a mission that transformed the world—and in a son's last attempt to grasp his father's ingrained sense of honor and duty—lies a powerful tribute to the ordinary heroes of an extraordinary time in American life.What Greene came away with is found history and found poetry—a profoundly moving work that offers a vividly new perspective on responsibility, empathy, and love. It is an exploration of and response to the concept of duty as it once was and always should be: quiet and from the heart. On every page you can hear the whisper of a generation and its children bidding each other farewell.",
        "Category": " History , Military , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "CliffsQuickReview Spanish II (Cliffs Quick Review (Paperback))",
        "Authors": "By Rodriguez, Jill",
        "Description": "CliffsQuickReview course guides cover the essentials of your toughest classes. Get a firm grip on core concepts and key material, and test your newfound knowledge with review questions.CliffsQuickReview Spanish II continues where CliffsQuickReview Spanish I left off andis meant to provide all the foundations of basic Spanish pronunciation, spelling, and sentence construction. Spanish grammar is systematically explained in its most simplistic way; if you've already read CliffsQuickReview Spanish I or if you already have a good foundation in Spanish, this book is an appropriate resource to hone your skills to the equivalent of two years of college-level Spanish. As you work your way through this review, you'll be ready to tackle such concepts asNew verb tenses — future tense, conditional tense, compound tenses, and the past participleSubjunctive Mood I and IIPrepositions and pronounsPassive voice, conjunctions, and more sentence variationsPast subjunctive and sequence of tensesAntonyms and synonymsCliffsQuickReview Spanish II can act as a supplement to your textbook and to classroom lectures. Use this reference in any way that fits your personal style for study and review — you decide what works best with your needs. You can read the book from cover to cover or just look for the information you want and put it back on the shelf for later. Here are just a few ways you can search for topics:Use the free Pocket Guide full of essential informationGet a glimpse of what you’ll gain from a chapter by reading through the Chapter Check-In at the beginning of each chapterUse the Chapter Checkout at the end of each chapter to gauge your grasp of the important information you need to knowTest your knowledge more completely in the CQR Review and look for additional sources of information in the CQR Resource CenterUse the glossary to find key terms fastWith titles available for all the most popular high school and college courses, CliffsQuickReview guides are a comprehensive resource that can help you get the best possible grades.",
        "Category": " Foreign Language Study , Spanish",
        "Publisher": "CliffsNotes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "The Shrewd Christian: You Can't Have It All, But You Can Have More Than Enough",
        "Authors": "By Atkinson, Neil",
        "Description": "If financial freedom seems like an unattainable dream–wake up! Let Neil Atkinson open your eyes to the truth about wealth in this biblically based, practical, readable, funny, and encouraging guide.  If you want to get a grip on your finances, you’ve got to let go of your misconceptions about what it means to be shrewd. The Shrewd Christian will enable you to conquer money, not merely solve money problems. When you change your thinking, you’ll see your lifestyle change. And when your lifestyle changes, you’ll experience true wealth.Neil Atkinson started out where you are. And now he’s ready to you how to achieve authentic, biblical financial freedom for the rest of your life.",
        "Category": " Business & Economics , Finance , General",
        "Publisher": "WaterBrook",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "When Character Was King: A Story of Ronald Reagan",
        "Authors": "By Noonan, Peggy",
        "Description": "No one has ever captured Ronald Reagan like Peggy Noonan. In When Character Was King, Noonan brings her own reflections on Reagan to bear as well as new stories—from Presidents George W. Bush and his father, George H. W. Bush, his Secret Service men and White House colleagues, his wife, his daughter Patti Davis, and his close friends—to reveal the true nature of a man even his opponents now view as a maker of big history. Marked by incisive wit and elegant prose, When Character Was King will both enlighten and move readers. It may well be the last word on Ronald Reagan, not only as a leader but as a man.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Long-Term Care: Your Financial Planning Guide",
        "Authors": "By Shelton, Phyllis",
        "Description": "One of the nation's leading authorities on long-term care planning presents a wealth of essential information for creating a strategy that suits your family and covers such topics as financing, tax incentives, Medicare, Medicaid, reverse mortgages, insurance policies, and more. Reprint. 15,000 first printing.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Into the Storm: A Study in Command",
        "Authors": "By Clancy, Tom and Franks, Frederick M.",
        "Description": "A study that delves deep into the operational art of war--as seen through the eyes of America's outstanding military leaders--takes readers inside the war councils, command posts, and up to the front lines. Reprint.",
        "Category": " History , Military , Persian Gulf War (1991)",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Lists to Live By: The Fourth Collection: For Everything That Really Matters",
        "Authors": "By Gray, Alice (EDT), Stephens, Steve (EDT), Van Diest, John (COM), and Van Diest, John (EDT)",
        "Description": "Every List is a Treasure!  Over half a million people can’t be wrong. Business professionals, parents, athletes, teenagers, pastors, and everyone who wants a better life are applauding the Lists to Live By books. By popular request, this bestselling series returns with a fourth collection of two hundred powerful and engaging lists, with topics such as success, simplicity, love, romance, faith, parenting, retirement, and wisdom. This book is a motivational tool, a reference volume, a discussion starter, and an enjoyable read—all rolled into one! Read this collection and it will change the way you live. Lists Will Change Your Life!  For good…for better…for best.  In the busyness of each moment, it’s hard not to forget something—even when you’re trying to remember it all! Lists books help you keep timeless priorities in mind and refuse to let the “tyranny of the urgent” reign in your day.  In this fourth collection of powerful and engaging Lists to Live By, you’ll find treasures that will challenge you, strengthen you, and help you to focus more on those important things that all-too-frequently get pushed aside.  Grow stronger relationships. Nurture your health. Strengthen your character…and change your life with this dynamic resource.  A reference volume, motivational tool, discussion starter—and a wonderfully enjoyable read—the jewels within these pages will sparkle throughout time and light your way from good to great each day.",
        "Category": " Religion , Inspirational",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Ultimate On-Line Homework Helper",
        "Authors": "By Salzman, Marian and Pondiscio, Robert",
        "Description": "Reveals the online resources that can make learning easier and fun, from descriptions of special student on-line services to sites that offer tutoring to guidelines on how to communicate with other kids. Original.",
        "Category": " Young Adult Fiction , Science & Technology",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Sisters of Theta Phi Kappa: A Novel",
        "Authors": "By Perrin, Kayla",
        "Description": "Jessica, Ellie, Shereen, and Yolanda were the brightest stars of the Theta Phi Kappa Sorority at Howard University.  Now, ten years later, they seem to have it all.  Jessica is in the limelight, a TV personality whose star is on the rise.  Ellie is an optimist, happily engaged in the quest for love.  Shereen is a stunning and powerful executive, and Yolanda, the strong-willed leader of the group, has defied her roots to capture her vision of the American dream.  But years before, these four women banded together to keep a devastating secret-and now, ten years later, someone will do anything to see the secret brought to light.  None of them anticipated the consequences of keeping the secret-and now, someone is trying to shatter all their lives.  Intense, powerful, page-turning, and emotional, The Sisters of Theta Phi Kappa will keep you guessing and will make you think about the depths of friendship, the price of loyalty, and the bonds of sisterhood.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "God and the Oval Office: The Religious Faith of Our 43 Presidents",
        "Authors": "By McCollister, John",
        "Description": "\"We need to remember that the separation of church and state must never mean the separation of religious values from the lives of public servants.\" ?Lyndon B. Johnson\"So help me God.\" Goerge Washington added those words to the presidential oath, and every president since has followed suit. Whether their faith was devout or doubted, heartfelt of pragmatic, John McCollister plumbs America's strong and deep spiritual heritage, showing the fascinating and vital role faith played in the lives of each of our forty-three presidents:Thomas Jefferson's \"edited\" version of the GospelsAbraham Lincoln's unique approach to organized religionAndrew Johnson's \"secret\" CatholicismJames Garfield's personal sacrifice of the pulpit for the presidencyDwight Eisenhower's trust in God's sovereigntyRonald Reagan's profound sense of forgivenessGeorge W. Bush's unapologetic faith in Jesus ChristFrom George Washington to George W. Bush, most of our country's chief executives have turned to God for assurance, guidance, and hope, Through what they learned in the Bible, bolstered by strength found in prayer, they have led America to become the greatest nation on earth. Timely and timeless, God and the Oval Office tells tells their story.",
        "Category": " Religion , Religion, Politics & State",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Pennsylvania Bed & Breakfast Guide & Cookbook",
        "Authors": "By Shughart, Karen",
        "Description": "",
        "Category": " Travel , Food, Lodging & Transportation , Bed & Breakfast",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The Jane Austen Book Club",
        "Authors": "By Fowler, Karen Joy",
        "Description": "THE NEW YORK TIMES BESTSELLERA book club discuss the works of Jane Austen and experience their own affairs of the heart in this charming “tribute to Austen that manages to capture her spirit” (The Boston Globe).In California’s central valley, five women and one man join to discuss Jane Austen’s novels. Over the six months they get together, marriages are tested, affairs begin, unsuitable arrangements become suitable, and love happens. With her eye for the frailties of human behavior and her ear for the absurdities of social intercourse, Karen Joy Fowler has never been wittier nor her characters more appealing. The result is a delicious dissection of modern relationships.Dedicated Austenites will delight in unearthing the echoes of Austen that run through the novel, but most readers will simply enjoy the vision and voice that, despite two centuries of separation, unite two great writers of brilliant social comedy.",
        "Category": " Fiction , Literary",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "By Blood Alone (Legion of the Damned)",
        "Authors": "By Dietz, William C.",
        "Description": "It takes more than guts to win a war...In a Legion gone lax, Colonel Bill Booly, with his mixed-blood and by-the-book attitude, is a misfit.  So when he steps on some important toes, his punishment is assignment to the worst post in the galaxy: Earth.But Booly and his troops will turn out to be Earth's best line of defense, when a Legion-led military coup topples the government.It's Legionnaire against Legionnaire in a struggle that will be won by strength, by courage, and...",
        "Category": " Fiction , Science Fiction , High Tech",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Bus 9 to Paradise",
        "Authors": "By Buscaglia, Leo F.",
        "Description": "Paradise on earth? Why not. Our existence is precisely what we make it and by embracing the many pleasures life has to offer, we can have unlimited joy. Leo Buscaglia, who has already shown so many of us the way to more love and happiness, now offers refreshing, detailed advice on looking around us and finding delight in the simple things--in food, in flowers, in music, in dance, in books, in art, in memories, in our families, and in loving.Step onto Bus 9 with Leo and open yourself to a life-affirming journey to paradise. It's the most important trip you'll ever take.",
        "Category": " Psychology , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "Thou Shalt Not Be Aware (Meridian)",
        "Authors": "By Miller, Alice",
        "Description": "",
        "Category": " Psychology , Movements , Psychoanalysis",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Marketing Warfare",
        "Authors": "By Ries, Al and Trout, Jack",
        "Description": "Basing their techniques on successful military strategies, the authors provide practical frameworks to effectively market products, companies, and institutions and use case histories to demonstrate how each technique operates",
        "Category": " Business & Economics , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "The Frog Prince: An Autobiography",
        "Authors": "By Girodias, Maurice",
        "Description": "Examines the life of Maurice Girodias, founder of his own press which published such books as Lolita and the Story of O, reflecting upon the middle-class life of pre-World War I France and its collapse afterward",
        "Category": "",
        "Publisher": "Crown Publishers",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Why Can't Men Open Up: Overcoming Men's Fear of Intimacy",
        "Authors": "By Naifeh, Steven and Smith, Gregory White",
        "Description": "Deals with men's problems with intimacy and tells how the women in their lives can help them learn to communicate their feelings",
        "Category": " Social Science , General",
        "Publisher": "Crown Publishing Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "Widows",
        "Authors": "By Corson, William R., Trento, Susan B., and Trento, Joseph J.",
        "Description": "Details four major compromises of American intelligence, revealing how moles penetrated the CIA and seriously weakened the agency and much of Western intelligence",
        "Category": " Political Science , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "8.78",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Scruples Two",
        "Authors": "By Krantz, Judith",
        "Description": "In the sequel to Scruples, Billy Ikehorn, Spider Elliott, and Valentine O'Neill return in a tale of love, passion, and deceit that picks up where the first book left off. 500,000 first printing. $500,000 ad/promo. Tour.",
        "Category": " Fiction , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Handmade Christmas: The Best of Martha Stewart Living",
        "Authors": "By Stewart, Martha and Martha Stewart Living",
        "Description": "Handmade Christmas is filled with ingenious ideas for creating a personal and festive holiday. From creating holiday window boxes or a gingerbread mansion to making your own gift wrap, Martha Stewart offers a stylish, inventive guide. 200 4-color photographs.",
        "Category": " Crafts & Hobbies , Holiday & Seasonal",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Managing for the Future: The 1990s and Beyond",
        "Authors": "By Drucker, Peter Ferdinand",
        "Description": "A guide to management in an era of high interest rates discusses the full spectrum of today's concerns with an eye to the future. By the author of Managing for Turbulent Times  and The Frontiers of Management.  35,000 first printing.",
        "Category": " Business & Economics , Management Science",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Dr. Mollen's Anti-aging Diet",
        "Authors": "By Mollen, Art",
        "Description": "A health expert offers a new program for weight loss and longevity, presenting a diet that protects the kidneys, digestive, and skeletal systems from the ravages of excessive protein consumption and offers three weeks of menu plans. 100,000 first printing. National ad/promo.",
        "Category": " Health & Fitness , General",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Little Visits Every Day",
        "Authors": "By Simon, Mary Manz and Warren, Beverly (ILT)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Religion , Biblical Studies",
        "Publisher": "Concordia Pub House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Information processing",
        "Authors": "By Bohl, Marilyn",
        "Description": "",
        "Category": "",
        "Publisher": "Science research associates",
        "Price Starting With ($)": "5.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Without a Hero and other stories",
        "Authors": "By Boyle, T. Coraghessan",
        "Description": "A critic recently said of T. Coraghessan Boyle, \"More happens in one of Boyle's stories than in most post-Victorian novels.\" This is precisely the case in Without a Hero, fifteen stunning stories that each, in its own way, displays a virtuosity and versatility rare in literary America. In this, his fourth story collection, Boyle takes chance after chance, even to the point of reexamining the ethos of Ernest Hemingway, one of the masters of the form. In \"Big Game,\" the wild animal safari takes place not in Africa but on a pay-per-shoot ranch in Southern California and includes an elephant hunt and its vivid consequences. There are echoes here of Hemingway's classic \"The Short Happy Life of Francis Macomber\" and Green Hills of Africa, but Boyle's hunting story is drawn for the age of ecology rather than an age without limits.Throughout, Boyle displays an astonishing range as he zooms in on such American specimens as the college football player who knows only defeat; the entrepreneur who creates a center for acquisitive disorders; the couple in search of the last toads on earth; and the boy caught between the ingenuousness of childhood and the cynicism of adulthood in \"The Fog Man.\" In some of these stories, Boyle makes you laugh out loud; in others you come closer to understanding the human condition because of the way he cuts to the secret places in his people's hearts. Here is the author of the highly praised 1993 novel, The Road to Wellville, entering a richer and deeper phase in his writing life, his stories bursting with what the Los Angeles Times has called his \"ferocious, delicious imagination, often darkly satirical and always infatuated with language.\"",
        "Category": " Fiction , Literary",
        "Publisher": "The Viking Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "INSIDE CONGRESS: The Shocking Scandals, Corruption, and Abuse of Power Behind the Scenes on Capitol Hill",
        "Authors": "By Kessler, Ronald",
        "Description": "This is the book Congress doesn't want you to see. It whisks you inside the most exclusive country club in the nation - where money is master, corruption is commonplace, and lawmakers routinely break the law without consequence. Based on in-depth interviews with Capitol Police officers, doormen, elevator operators, waiters, clerks, pages, staffers, and members of the House and Senate themselves, Inside Congress exposes the arrogance, hypocrisy, lies, and outright lawlessness of Republican and Democrat alike.Inside Congress unmasks the dubious character of those we entrust with our government: philanderers who champion family values; defenders of the working class who live like kings and treat their staff like dirt; and assorted tyrants, drunks, and petty thieves who are in the business of taxing us and enriching themselves.",
        "Category": " Political Science , Political Process , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "At Large",
        "Authors": "By Goodman, Ellen",
        "Description": "Provides a collection of the observations of columnist Ellen Goodman on topics ranging from nuclear power reactors to the problems of a modern \"superwoman\" and the difficulties of separation from one's children",
        "Category": " Reference , General",
        "Publisher": "Summit Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1981"
        }
    },
    {
        "Title": "Amy Fisher : My Story",
        "Authors": "By Weller, Sheila and Fisher, Amy",
        "Description": "Here at last is Amy Fisher's story - revealed by one of the only two people who know the truth about the events that led to that terrible May day on Long Island when Amy Fisher's gun went off and a bullet smashed into the head of Mary Jo Buttafuoco. (\"Even lying there - shot, bleeding - Mary Jo had grabbed Joey's T-shirt. I yanked it out of her hand.\") Joey Buttafuoco, Mary Jo's husband, has denied that he ever had an affair with Amy, as she alleges. Amy has said that he set her up as a prostitute (\"I started to have trouble keeping my food down on days I had customers\"), and that he was intimately involved in the plot to murder his wife (\"Joey said not to call him afterward. He'd call me\"). Joey has denied these allegations. Currently serving a five-to-fifteen-year sentence for first-degree assault (\"If you're a celebrity prisoner, they make life very tough on you\"), Amy has finally told her side of the story, in full and fascinating detail, to veteran journalist Sheila Weller.The lurid tale of sex, money, teenage prostitution, murder for hire, drugs, suicide attempts, divorce, and pornographic videotapes has rocked the country and scarred the affluent Long Island, New York, communities where the Fishers and the Buttafuocos live. Mary Jo's health is shattered, Joey Buttafuoco's image has suffered, the Fishers have filed for divorce, Amy is in prison - and the aftershocks of this volatile case continue to grip the nation. Amy Fisher, who says she made love with \"Joey B.\" in her parents' home, in a motel, in the apartment above his body shop, and on his boat - Double Trouble - remembers the good times...\"I went to the appointed place, waited until I saw the Double Trouble chugging up, shooting foam on either side. As Joey cruised in and lifted me on board, I felt like Grace Kelly with Bing Crosby in that old movie where they sang 'True Love.'\"What are the real secrets of this high-school truant and runaway who left Mary Jo Buttafuoco lying on her front porch in a pool of blood? Everyone has an opinion about Amy Fisher. To some, she's the living nightmare of suburban America; to others, she's a traumatized victim of abuse, and a plaything of ruthless adults who used her for their salacious pleasure. Here, at last, Amy Fisher's shocking and heartwrenching story is completely revealed....",
        "Category": " Social Science , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "A Civil Tongue",
        "Authors": "By Newman, Edwin",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Bobbs-Merrill Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1976"
        }
    },
    {
        "Title": "The Death of Common Sense: How Law is Suffocating America",
        "Authors": "By Howard, Philip K.",
        "Description": "Americans are bursting with frustration at government. Thick rule books dictate results that almost never make sense. Government can barely fix potholes or fire an employee who doesn't show up for work, much less accomplish important goals. With the best of intentions, government hands out new legal rights like land grants, usually to victims of history or circumstance, but fails to notice that it then loses its ability to balance everyone's welfare.The land of freedom has become a legal maze of obligation, ritual, and obeisance. With dozens of vivid stories - some humorous, some tragic - Philip Howard peels away the basic assumptions of a system that is driving Americans crazy.Law began infiltrating the nooks and crannies of our lives in the 1960s, crowding out our common sense. Rules replaced thinking. Process replaced responsibility. One false idea lay at the bottom of these developments: that human judgment should he banned from anything to do with law. We fell for the idea that all could be laid out in a tidy legal system where decisions were predetermined, social choices premade.The Death of Common Sense grinds up sacred legal cows, one after another. Again and again, it shows how they lead to the bureaucracy and laws that frustrate and humiliate every citizen. Then, Howard turns his scrutiny to the fears that have kept us obedient and powerless in our daily decisions, and sets us on a course to take back control of our lives.",
        "Category": " Social Science , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Brief Lives",
        "Authors": "By Brookner, Anita.",
        "Description": "With this novel, Booker Prize-winning author Anita Brookner confirms her reputation as an unparalleled observer of social nuance and deeply felt longings. Brief Lives chronicles an unlikely friendship: that between the flamboyant, monstrously egocentric Julia and the modest, self-effacing Fay, who is at once fascinated and appalled by Julia's excesses. Thrust together by their husbands' business partnership -- and by a guilty secret -- Julia and Fay develop an intense bond that is nonetheless something less than intimacy, a relationship in which we see our own uneasy compromises, not only with other people, but with life itself.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Eating Well Is the Best Revenge",
        "Authors": "By Burros, Marian",
        "Description": "New York Times food columnist and bestselling cookbook author Marian Burros knows that the pleasures of food and healthful eating habits are not mutually exclusive. Millions of readers trust her to keep them informed of the most recent trends and developments on food and nutrition. They also know her delicious but no-nonsense recipes and strategic approach to cooking result in meals that please the palate yet still reflect the recommendations of the new Food Guide Pyramid.In Eating Well Is the Best Revenge, Burros has collected over 100 of the menus from her weekly column, \"Plain and Simple,\" and created a cookbook that meets all the demands of today's busy, concerned, and sophisticated home cook. Here are recipes that reflect the wide range of flavors and cooking styles that Americans relish, that are as good to eat as they are good for you, that meet the latest and most sound nutritional requirements, and that can be easily and speedily prepared from fresh ingredients.All the work of figuring out nutritional values and making sure meals meet today's requirements has been done for you, so each menu follows the new government guidelines for a low-fat, high-carbohydrate, moderate-protein diet. Additional features include a game plan for preparing each menu, a user's guide to quick-cook ingredients, a pantry list that lets you shop in the express lane, and mail-order sources. There are tips on how to reduce fat in your cooking, and a simple guide to the new Food Guide Pyramid. Burros has also sorted through all the studies, reports, tests, expert opinions, and government agency press releases for you, and in a special section provides the most up-to-date information on food safety and the new labeling laws.",
        "Category": " Cooking , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Apocalypse Wow",
        "Authors": "By Garner, James Finn",
        "Description": "As the year 2000 bears down, the best-selling author of Politically Correct Bedtime Stories, James Finn Garner, confronts a series of monumental questions: Will we remember to order new checks from the bank? Did our invitation to the Kennedy New Year's party get lost in the mail again? Are we all poised on the brink of worldwide enlightenment or complete planetary destruction? Should you really bother investing in that Five-Year CD?\"Tonight,\" in the unforgettable words of The Artist Formerly Known as Prince, \"We're gonna party like it's 1999.\" The end is near...or at least nearer than it used to be, says Garner. Humanity is wracked by millennial panic and apocalyptic anticipation -- or if it isn't already, just wait until it reads Garner's latest (and last?). In it, he sets off on a slightly-to-the-South-of-skeptical pilgrimage in search of the truth behind the end times predictions.",
        "Category": " Humor , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Who I Was Supposed to Be: Stories",
        "Authors": "By Perabo, Susan",
        "Description": "Behind every face in Who I Was Supposed to Be, is a singular quirk to explore, a peculiarity to celebrate. In Susan Perabo's world, nothing can be taken for granted: here, a retired grocer takes up jewel theft in his twilight years; a data processor squanders her inheritance on one of Princess Diana's gowns; a mugging victim feigns amnesia to win back his wife. In the tradition of Lorrie Moore, Susan Perabo's slightly off-center lens looks hard at the banal and the bizarre, and at the human condition, where she finds extraordinary magic within the smallest of gestures. Sharply written and overlaid with a mischievous wit, Who I Was Supposed to Be is an unforgettable homage to laughter, love, and wonder.",
        "Category": " Fiction , Literary",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Mask of Treachery",
        "Authors": "By Costello, John",
        "Description": "Newly discovered British and American reports, scores of interviews, and expert analysis substantiate an account of the espionage network created by Anthony Blunt and of that network's infiltration of British and American institutions",
        "Category": " Political Science , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Sleeping With the Devil",
        "Authors": "By Finstad, Suzanne",
        "Description": "Chronicles the story of Barbara Piotrowski, who came under the spell of bodybuilder Richard Minns, a Texas millionaire who took over her life while keeping his marriage a secret and who later hired assassins to kill her",
        "Category": " Political Science , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "10.34",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Russia: On the Eve of War and Revolution (Princeton Legacy Library)",
        "Authors": "By Wallace, Donald MacKenzie, Sir",
        "Description": "The result of six years of study and travel in pre-Soviet Russia, this work by a major British journalist provides a vivid description of daily life under the last three Tsars, in the turbulent age following the emancipation of the serfs in 1861.Originally published in 1984.The Princeton Legacy Library uses the latest print-on-demand technology to again make available previously out-of-print books from the distinguished backlist of Princeton University Press. These editions preserve the original texts of these important books while presenting them in durable paperback and hardcover editions. The goal of the Princeton Legacy Library is to vastly increase access to the rich scholarly heritage found in the thousands of books published by Princeton University Press since its founding in 1905.",
        "Category": " History , Russia & the Former Soviet Union",
        "Publisher": "Princeton University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "The Great Wreath Book: 49 Prizewinning Designs from Woman's Day",
        "Authors": "By Capuana, Theresa",
        "Description": "Offers advice on making wreaths, shows designs featuring a variety of themes, and lists materials and tools needed to make each wreath",
        "Category": " Art , General",
        "Publisher": "Meredith Pr",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Cat's Meow: A Novel",
        "Authors": "By De La Cruz, Melissa and Demarco, Kim (ILT)",
        "Description": "Cat McAllister grew up as a Hollywood child star, spent her adolescence modeling in Japan, and now, as she celebrates her twenty-fifth birthday for the fourth time, she lives for velvet ropes, Moët & Chandon, gold-leaf invitations, and other fashionista prizes. But on her way up the social ladder, making her way past the who's who and the what's what, Cat finds herself stuck in that seventh circle of celebrity hell.  What's worse, her funds are running dry.  What's a girl to do?  Marry rich. And so the ruckus begins, taking us from China for a baby adoption, to Paris for the couture shows, to the \"it\" world of Gotham. And that's just the hors d'oeuvres.  Punctuated with Kim DeMarco's illustrations, Cat's Meow is a spectacularly witty novel about a young woman looking for love, clothes, and what will make her truly happy in life.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Charleston: Houses and Gardens",
        "Authors": "By Evangeline Davis",
        "Description": "",
        "Category": "",
        "Publisher": "Preservation Society of Charleston",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "God and man in Washington",
        "Authors": "By Blanshard, Paul",
        "Description": "",
        "Category": "",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "The story of Gone with the wind",
        "Authors": "By Thomas, Bob",
        "Description": "",
        "Category": "",
        "Publisher": "National Publishers",
        "Price Starting With ($)": "7.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "The development of the modern state (Main themes in European history)",
        "Authors": "By Lubasz, Heinz",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Look! A parade (Start-right elf books)",
        "Authors": "By Barrows, Marjorie",
        "Description": "",
        "Category": "",
        "Publisher": "Rand McNally",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Some Horses",
        "Authors": "By McGuane, Thomas",
        "Description": "A collection of eight essays from renowned horse enthusiast and acclaimed writer Thomas McGuane examines the various personalities and traits of different breeds of horses, and explores the deep bond forged between horses and humans.",
        "Category": " Literary Criticism , American , General",
        "Publisher": "Lyons Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Mozart (Illustrated Lives of the Great Composers)",
        "Authors": "By Woodford, Peggy",
        "Description": "",
        "Category": " Biography & Autobiography , Composers & Musicians",
        "Publisher": "Omnibus Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "How To Do Everything with Your Digital Camera",
        "Authors": "By Johnson, Dave",
        "Description": "Do more with your digital camera than you ever thought possible with help from this easy-to-use guide. You'll understand digital photography basics, learn to share results through e-mail or the Internet, store images electronically, apply advanced photography techniques, perform image editing, and much more. This book dissects digital photography in bite-sized, understandable sections that will help anyone--from beginner to professional--have a better digital camera experience.",
        "Category": " Photography , Techniques , Equipment",
        "Publisher": "McGraw-Hill Osborne Media",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "The Sharper Mind: Mental Games for a Keen Mind and a Fool Proof Memory",
        "Authors": "By Chernow, Fred B.",
        "Description": "The Sharper Mind is packed with proven, practical techniques and simple exercises you can use to increase your memory, focus concentration, enhance creativity, and boost your learning potential, as well as remember names, numbers, dates, and important facts with speed and accuracy; perform even complex calculations instantly with mental math shortcuts; conquer absent-mindedness and forgetfulness; develop mental agility with the help of a \"mental aerobics workout\"; and age-proof your memory.",
        "Category": " Self-help , Personal Growth , Memory Improvement",
        "Publisher": "Prentice Hall Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Portraits: Photographs of Farm Animals",
        "Authors": "By Klinkenborg, Verlyn, Weil, Danielle, Klinkenborg, Verlyn (INT), and Weil, Danielle (PHT)",
        "Description": "Although the family farm is fading from the American landscape, the farm and its inhabitants hold a special place in our hearts. We are a nation descended from farmers, still tied to that heritage by strong emotional bonds. In Portraits, art photographer Danielle Weil presents 50 exquisite black-and-white portraits of farm animals. Her carefully composed photographs enable us to look at these animals--cows, sheep, pigs, chickens, ducks, goats, horses, and donkeys--with the patience they seldom allow us in real life and make it possible for us to discover their individuality, their uniqueness, all over again.  With a lyrical introduction by Verlyn Klinkenborg, Portraits is the perfect gift book for animal lovers and for all of us who feel a nostalgic connection to the farm.  Photographs of Farm Animals by Danielle Weil. A celebration of the American family farm in fifty exquisite black-and-white portraits. Introduction by Verlyn Klinkenborg.",
        "Category": " Nature , Animals , General",
        "Publisher": "Artisan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Sports Illustrated Golf: Play Like a Pro (Sports Illustrated Winner's Circle Books)",
        "Authors": "By Mulvoy, Mark",
        "Description": "",
        "Category": "",
        "Publisher": "Sports Illustrated Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "In Search of the Castaways",
        "Authors": "By Hettie Jones",
        "Description": "",
        "Category": "",
        "Publisher": "POCKET",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The Florabama Ladies' Auxiliary & Sewing Circle",
        "Authors": "By Battle, Lois",
        "Description": "A New York Times bestseller     A Literary Guild and Doubleday Book Club Selection    Welcome to Florabama, Alabama—a place where you can stop to sip a co'cola or iced tea and think about money and love. If you had'em, you were free to think about other things. If you didn't you couldn't think about anything else.    \"We've been screwed blue and tattooed,\" quips Hilly Pruitt, upon hearing the news of the closing of Cherished Lady, the local lingerie factory where she's worked a lifetime. The same day the plant closes, Bonnie Duke Cullman, former-deb turned Atlanta-society-wife, has herself been downsized—right out of her marriage and picture-perfect life. In an unlikely alliance, Bonnie, Hilly, and the rest of the ex-bra seamstresses join forces in the \"Displaced Homemakers Program\" at a podunk community college. Together they endure a midlife survival course where the events of a single year forever alter the way they see the world and their places in it.",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Transformation Thinking",
        "Authors": "By Wycoff, Joyce and Richardson, Tim",
        "Description": "What is transformation?It's a miracle waiting to happen. It's the result of thinking that goes \"outside the dots.\" It's what makes a company grow and flourish - moving beyond barriers to creativity and change.Joyce Wycoff explains the tools of transformation - Brainwriting, Mess Mapping, Fishboning, Storyboarding and more - simple techniques that free the mind and open doors to problem-solving in any organization, large or small. This practical, powerful guidebook is a must for managers and leaders who want to transform the way they make decisions, set goals, inspire successful teamwork, encourage communication, stimulate new ideas, and more.",
        "Category": "",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Terms of Adornment: The Ultimate Guide to Accessories",
        "Authors": "By Chase, Deborah and Powell, Carleen (ILT)",
        "Description": "You no longer have to lament over the fate of your unused accessories--from the scarf you always forget to wear to that handbag you had to have but only use once or twice a year to those shoes you never wear because your personal style has changed.  Accessory guru Deborah Chase is here to save the day (or at least your wardrobe).  Packed with tons of tips, historical fashion anecdotes, and complete outfits for every accessory, Terms of Adornment is an A-to-Z guide to utilizing everything from amethysts and aviator glasses to y necklaces and zippers.  Save time, money, and frustration: maximize your wardrobe and wear what you like with a style that's all about you.",
        "Category": " Design , Fashion & Accessories",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The 500 Year Delta: What Happens After What Comes Next",
        "Authors": "By Means, Howard, Taylor, James, and Wacker, Watts",
        "Description": "In the tradition of Alvin Toffler's Future Shock and John Naisbitt's Megatrends, The 500-Year Delta offers an enthralling glimpse of what businesses and individuals should expect as the five-hundred-year-old \"Age of Reason\" segues into the \"Age of Possibility.\"  According to visionary futurists Jim Taylor and Watts Wacker, we stand at not one but several crossroads-marked points of discontinuity between past and present. These include:  The shift from reason-based to chaos-based logic  The splintering of social, political, and economic organization The collapse of producer-controlled consumer markets  For a world caught in this swirling intersection of change, Jim Taylor and Watts Wacker provide tested strategies to help companies and individuals reset their course toward an unpredictable future, offering new models to accommodate the increasing chaos of everyday life.  Describing our present point of transformation as a \"triple witching hour,\" the authors chart a future course that is at once bracing, forbidding, joyous, and ultimately redemptive.",
        "Category": " Business & Economics , Management",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Alec Baldwin Doesn't Love Me and Other Trials from My Queer Life",
        "Authors": "By Ford, Michael Thomas",
        "Description": "An irreverent, insightful, and wickedly funny humor collection that shows just how queer life really is.",
        "Category": " Humor , General",
        "Publisher": "Alyson Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Legend of Luke (Redwall)",
        "Authors": "By Jacques, Brian and Fangorn (ILT)",
        "Description": "New York Times bestselling author Brian Jacques gives us another tales of Redwall, filled with “The Knights of the Round Table with paws” (The Sunday Times) along with their friends and enemies.Redwall's most valiant champion, Martin the Warrior, embarks on a perilous journey to the northland shore to trace his heroic legacy: the legendary exploits of his father Luke…",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Small Miracles Of Love & Friendship: Remarkable Coincidences of Warmth and Devotion",
        "Authors": "By Halberstam, Yitta, Leventhal, Judith, and Mandelbaum, Yitta Halberstam",
        "Description": "A collection of sixty true stories deals with both romantic and platonic friendship, showing how these enduring relationships are all representative of the divine harmony that pervades all things. Original.",
        "Category": " Religion , Inspirational",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "All Souls' Rising",
        "Authors": "By Bell, Madison Smartt",
        "Description": "Second-generation African slave Toussaint-Louverture, determined to resist the excesses of the mob and still put an end to brutal French domination, is joined by black, white, rich, poor, free, and enslaved characters to form an unstoppable Haitian insurrection. Reprint.",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "MEET HILLARY RODHAM CLINTON (A Bullseye Biography)",
        "Authors": "By Spain, Valerie",
        "Description": "Offers a look at the personal and professional life of Hillary Clinton, from her childhood to her role as First Lady",
        "Category": "",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Earthquake in the Early Morning (Magic Tree House #24) (Magic Tree House (R))",
        "Authors": "By Murdocca, Sal (ILT) and Osborne, Mary Pope",
        "Description": "The #1   bestselling chapter book series of all time celebrates 25 years with new   covers and a new, easy-to-use numbering system! An adventure that will shake you up! That's what Jack and Annie get when   the Magic Tree House whisks them back to California in 1906. As soon as they   arrive, the famous San Francisco earthquake hits the city. Can Jack and Annie   save the day? Or will San Francisco be destroyed first? Did you know that there’s a Magic Tree House book for every kid? Magic Tree House: Adventures with Jack and Annie, perfect for readers who   are just beginning chapter books Merlin Missions: More challenging adventures for the experienced   reader Super Edition: A longer and more dangerous adventure Fact Trackers: Nonfiction companions to your favorite Magic Tree House   adventures Have more fun with Jack and Annie at MagicTreeHouse.com!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The Bookseller's Daughter",
        "Authors": "By Rosenthal, Pam",
        "Description": "During the French Revolution, scullery maid and avid reader Marie-Laure Vernet succumbs to forbidden passion with Viscount Joseph d'Auvers-Raimond, a smuggler of forbidden books, against a backdrop of murder and betrayal. Original. 35,000 first printing.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Kensington",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Essential Labrador Retriever (The Essential Guides)",
        "Authors": "By Stockdale, Renee (EDT) and Howell Book House (COR)",
        "Description": "A low priced, paperback book on Labrador retriever care filled with gorgeous four colour photographs incorporated in a beautiful design.THE ESSENTIAL GUIDES have all of the information that the new or experienced pet owner needs for a successful relationship with his or her pet.  Packed with interesting sidebars, the books discuss bringing your new pet home; the optimal way to feed your pet; and how to properly groom your pet.  Also included are comprehensive chapters on health care and how to train your pet like an expert; as well as a special chapter filled with fun facts about your specific pet.The many fun and descriptive photos in THE ESSENTIAL GUIDES are taken by a professional photographer, and each book contains perforated fact cards with lots of helpful pet care tips for your convenience.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "West Virginia Off the Beaten Path, 4th: A Guide to Unique Places (Off the Beaten Path Series)",
        "Authors": "By Soltis, Stephen, Soltis, Stacy, and Clauson-Wicker, Su",
        "Description": "A guide to the off-beat and out-of-the-way finds throughout the Mountain State, with updated information on activities and attractions for residents and visitors alike.",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Globe Pequot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Forge #6",
        "Authors": "By Oarr, Chris (EDT)",
        "Description": "",
        "Category": " Comics & Graphic Novels , General",
        "Publisher": "Crossgeneration Comics Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    }
]