[
    {
        "Title": "Look and Learn About Animals in the Wild (Look and Learn About...) (Look & Learn)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "brimax",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1885"
        }
    },
    {
        "Title": "The Berenstain Bears and the Trouble at School",
        "Authors": "By Berenstain, Stan and Berenstain, Jan",
        "Description": "This classic Berenstain Bears story is a perfect way to teach children about responsibility and the importance of doing your schoolwork!Come for a visit in Bear Country with this classic First Time Book® from Stan and Jan Berenstain. Brother isn’t doing his schoolwork, and it’s starting to catch up with him. Now that he got a bad grade on his quiz, how is he going to tell Mama and Papa? Includes over 50 bonus stickers!",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "The Berenstain Bears and the In-Crowd",
        "Authors": "By Berenstain, Stan and Berenstain, Jan",
        "Description": "This classic Berenstain Bears story is a perfect way to teach children about the importance of being yourself!Come for a visit in Bear Country with this classic First Time Book® from Stan and Jan Berenstain. There’s a new cub at school, Queenie McBear, and Sister really wants to be her friend. Will she try and change who she is in order to get Queenie to like her, or will she realize that she’s wonderful just as she is. Includes over 50 bonus stickers!",
        "Category": " Juvenile Fiction , Social Themes , Peer Pressure",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Hello Reader, Level 1: Footprints in the Snow",
        "Authors": "By Rogers, Jacqueline (ILT) and Benjamin, Cynthia",
        "Description": "Pictures and simple text depict forest animals' tracks in the snow as they rush to their homes during a winter storm",
        "Category": " Juvenile Fiction , Concepts , Size & Shape",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Wee Sing and Play",
        "Authors": "By Beall, Pamela Conn",
        "Description": "",
        "Category": " Juvenile Fiction , Sports & Recreation , General",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Tie-Dye Projects for Kids",
        "Authors": "By Publications International",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "THE LION AND THE MOUSE: An AESOP Fable",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Dalmatian Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Milo's Story (A Stepping Stone Book(TM))",
        "Authors": "By Mason, Jane B. (EDT)",
        "Description": "Milo and the rest of the characters from Atlantis: The Lost Empire appear in this easy-to-read chapter book that takes young adventurers deeper and deeper into the mysteries of the strange subterranean world. Original. 100,000 first printing.",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "The Great Adventure",
        "Authors": "By Clairmont, Patsy (EDT) and Mullins, Traci (EDT)",
        "Description": "Adventure? Who needs it? Some would say, \"I don't have time, or the money, or the inclination...\" yet we ALL are in the midst of an adventure called life, whether we choose to be or not. These sixty devotionals, by the six Women of Faith speakers, will serve as a guide and encouragement for women who are in this journey called life. With their contagious wit and wisdom, they will soon have the reader enbracing the adventure of life through learning how to trust God with all things. What better tour guides could there be?!",
        "Category": " Religion , Devotional",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Little Red Riding Hood (Dalmatian Press Puppy Tales)",
        "Authors": "By Ashley Crownover",
        "Description": "",
        "Category": "",
        "Publisher": "Dalmatian Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The manger is empty",
        "Authors": "By Wangerin, Walter",
        "Description": "",
        "Category": "",
        "Publisher": "Crossings Book Club",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "A Dance of Friendship (Angelina Ballerina)",
        "Authors": "By Craig, Helen (ILT) and Holabird, Katharine",
        "Description": "Angelina is very excited—her new friend Anya is joining her ballet class!  But when Anya becomes the center of attention, Angelina becomes jealous and the two mouselings get into a big fight.  How will Angelina make things right again and find the perfect way to say \"I'm sorry\"?",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Your Child's Profession of Faith",
        "Authors": "By Gundersen, Dennis",
        "Description": "",
        "Category": "",
        "Publisher": "Calvary Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "The Hot Flash Club: A Novel",
        "Authors": "By Thayer, Nancy",
        "Description": "From the bestselling author of Between Husbands and Friends and An Act of Love comes a wise, wonderful, and delightfully witty “coming of age” novel about four intrepid women who discover themselves as they were truly meant to be: passionate, alive, and ready to face the best years of their lives.Meet Faye, Marilyn, Alice, and Shirley. Four women with skills, smarts, and secrets—all feeling over the hill and out of the race. But in a moment of delicious serendipity, they meet and realize they share more than raging hormones and lost dreams. Now as the Hot Flash Club, where the topics of motherhood, sex, and men are discussed with double servings of chocolate cake, they vow to help each other . . . and themselves.Faye, the artist. A determinedly cheerful widow and connoisseur of control-top pantyhose, she’s struggling with creative block and an empty, lonely house. Now she’s got a tricky problem to bring to the club’s table: how can they catch her perfect son-in-law cheating on her only daughter Laura? Shirley, the healer. Though her yoga-slender body belie her years, decades of dating losers and the strain of being broke make her feel her age. Shirley has a secret dream: a wellness spa that nurtures body and soul. But first she needs to believe in herself, in her abilities, and in her friends at the club.Marilyn, the brain. A paleontologist who has spent so many years looking at dried-up fossils, she’s almost become one herself. Worried that her brilliant but nerdy son is about to marry the very wrong woman, she gets some help from the HFC, who transform her from a caterpillar to a butterfly, with amazing results.Alice, the executive. Black and regal, she soared to the top of the corporate ladder. Now her shoes are murder on her arthritic back and the younger jackals are circling in for the kill. But as the inspiration behind the HFC, she’s about to discover something extraordinary: contentment.For Faye, Shirley, Marilyn, and Alice, the time has come to use it or lose it—be it their bodies, their brains, their spirits, and their sense of fun. Together they realize that they can have it all, perhaps for the first time in their lives. And though what sags may never rise again, feeling sexy has no expiration date— and best of all, with a little help from her friends, a woman can always start over . . . and never, ever, give up what matters most.",
        "Category": " Fiction , Women",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "I Spy Super Challenger",
        "Authors": "By Marzollo, Jean, Wick, Walter (PHT), and Wick, Walter",
        "Description": "Search-and-find riddles paired with amazing photographs will captivate kids of all ages in the bestselling I Spy series.Think you know every I Spy book out there? Think you've found every last bauble, bow, striped cat, and cloudy ship? Think again! Jean Marzollo has written her most challenging riddles yet to accompany Walter Wick's fabulous photographs culled from the original I Spy books. You've never seen I Spy like this!",
        "Category": " Juvenile Nonfiction , Games & Activities , Puzzles",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Cooking with cheese (Adventures in cooking series)",
        "Authors": "By Culinary Arts Institute",
        "Description": "",
        "Category": "",
        "Publisher": "Culinary Arts Institute",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Lassie Come-Home: Eric Knight’s Original 1938 Classic in a New Picture-Book Edition",
        "Authors": "By Jeffers, Susan (ILT), Wells, Rosemary, and Knight, Eric",
        "Description": "A new edition of Lassie Come-Home blends evocative full-color artwork with the poignant tale of a determined dog whose love for its master takes it on a long and difficult journey. Reprint.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Square Fish",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "No Fighting, No Biting! (An I Can Read Book, Level 2)",
        "Authors": "By Minarik, Else Holmelund and Sendak, Maurice (ILT)",
        "Description": "Poor Cousin Joan!She can't read her book when Willy and Rosa are pinching and squeezing and fighting. So she tells them stories about two little alligators who are always fighting and biting—just like Willy and Rosa!",
        "Category": " Juvenile Fiction , Social Themes , Manners & Etiquette",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "All-Time Great World Series (All Aboard Reading, Level 3 Grades 2-3)",
        "Authors": "By Gutelle, Andrew and Forbes, Bart (ILT)",
        "Description": "An easy-to-read look at four of major-league baseball's most exciting World Series competitions",
        "Category": " Juvenile Fiction , Sports & Recreation , Baseball & Softball",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "The Secret Garden (Penguin Young Readers, Level 3)",
        "Authors": "By Burnett, Frances Hodgson, Hautzig, Deborah, and Carabetta, Natalie (ILT)",
        "Description": "An early reader's edition of a popular classic follows the adventures of the lonely Mary, who comes to live in her uncle's foreboding home and, with the help of a new friend, discovers a hidden garden of secrets. Simultaneous.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "NIV Young Discoverer's Bible",
        "Authors": "By Munger, Nancy",
        "Description": "",
        "Category": " Bibles , New International Version , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "8.78",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Meditations from the Road",
        "Authors": "By Peck, M. Scott",
        "Description": "A Daily Companion  Millions of readers have turned to The Road Less Traveled and The Different Drum for guidance. Now, in Meditations from the Road, the wisdom of these books can provide daily inspiration. Brilliantly integrating traditional psychology and spiritual insight, Dr. Peck shares his thoughts about the nature of loving relationships, how to become ones own person, how to be a more sensitive parent, the meaning and necessity of community in our lives, and so much more. With a new introduction by Dr. Peck, Meditations from the Road will help you along your way toward achieving wisdom and fullness in your life.",
        "Category": " Psychology , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Arthur Accused (Marc Brown Arthur Chapter Books)",
        "Authors": "By Marc Tolon Brown",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Bubble Gum In The Sky - Pbk (First-Start Easy Reader)",
        "Authors": "By Harvey, Paul (ILT) and Everett, Louise",
        "Description": "A rabbit with a fondness for bubble gum blows a gigantic bubble which carries him up into the sky",
        "Category": "",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Spotter's Guide to Shells: An Introduction to Seashells of the World",
        "Authors": "By Saunders, Graham",
        "Description": "Describes and portrays over two hundred species of gastropods, bivalves, cephalopods, chitons, and scaphopods, discussing the biology, habitats, and life cycles of various mollusks and showing how to start a shell collection",
        "Category": " Science , General",
        "Publisher": "Wh Smith Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1979"
        }
    },
    {
        "Title": "Cat Care (101 Essential Tips)",
        "Authors": "By Edney, A. T. B.",
        "Description": "Discusses housing, behavior, handling, health care, grooming, feeding, and first aid",
        "Category": " Pets , Cats , General",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Celebrating Life: Catching the Thieves That Steal Your Joy (Fran Sciacca)",
        "Authors": "By Swindoll, Luci",
        "Description": "Do you ever experience discontentment, depression, resentment, or fear? This topical Bible study for women examines the many reasons you have for letting go of the past and celebrating life now. Author Luci Swindoll’s enthusiasm will encourage you, her questions will challenge you, and her insights will impact the way you face each day. Begin to enjoy your talents, experiences, relationships, and uniqueness.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "NavPress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "The Way We Talk Now",
        "Authors": "By Nunberg, Geoffrey",
        "Description": "This engaging collection of National Public Radio broadcasts and magazine pieces by one of America’s best-known linguists covers the waterfront of contemporary culture by taking stock of its words and phrases. From our metaphors for the Internet (“Virtual Rialto”) to the perils of electronic grammar checkers (“The Software We Deserve”), from traditional grammatical bugaboos (“Sex and the Singular Verb”) to the ways we talk about illicit love (“Affairs of State”), Geoffrey Nunberg shows just how much the language we use from day to day reveals about who we are and who we want to be.",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "HENRY AND MUDGE IN THE SPARKLE DAYS (Henry and Mudge, No 5)",
        "Authors": "By Rylant, Cynthia and Stevenson, Sucie (ILT)",
        "Description": "In the winter Henry and his big dog Mudge play in the snow, share a family Christmas dinner, and gather around a crackling winter fireplace",
        "Category": "",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Just a Mess (Little Critter) (Look-Look)",
        "Authors": "By Mayer, Mercer and Mayer, Mercer (ILT)",
        "Description": "Mercer Mayer’s Little Critter has made quite the mess in this classic, funny, and heartwarming book. Whether he’s shoving junk under the bed, cramming toys in the closet, or overstuffing drawers with clothes, both parents and children alike will relate to this beloved story. A perfect way to teach kids about picking up after themselves!",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "AGE OF DINOSAURS (Random House All-about Books)",
        "Authors": "By Lambert, David, Francis, John, Robinson, Bernard, and Wardle, Ross (ILT)",
        "Description": "A brief introduction to the many creatures that roamed the earth, air, and sea more than 65 million years ago",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Love from Grandma",
        "Authors": "By Amble, Becky L.",
        "Description": "",
        "Category": " Family & Relationships , Parenting , Grandparenting",
        "Publisher": "Garborgs Heart N Home",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Curious George Goes to the Aquarium",
        "Authors": "By Rey, H. A. and Rey, Margret",
        "Description": "Curious George decides that he wants to feed the seals at the aquarium, and pandemonium follows. Soon he's doing tricks in the seal tank, and he's even offered a job in the seal show. Once again, George turns chaos into a glorious opportunity to show what he can accomplish.",
        "Category": " Juvenile Fiction , Animals , Apes, Monkeys, etc.",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "Great Black Heroes: Five Brave Explorers (Scholastic Reader, Level 4)",
        "Authors": "By Garnett, Ron (ILT) and Hudson, Wade",
        "Description": "With inspiring and educational stories, Scholastic's Hello Reader series caters to the spectrum of reading abilities among beginning readers. My First Hello Readers use basic words to reinforce phonics and sight vocabulary. The books at this level offer punch-out flash cards plus six additional pages of skill-building activities. Levels 1 - 4 combine a greater vocabulary and longer sentence length. Each book has an introductory letter from an education specialist guiding parents on how to help their children learn to read.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Cultural, Ethnic & Regional",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "365 Ways to Cook Pasta",
        "Authors": "By Simmons, Marie",
        "Description": "Gathers recipes for sauces, and salads, soups, stews, desserts, puddings, and breakfast dishes that feature pasta",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Walking to Fitness",
        "Authors": "By Seth Bauer & The Editors of Walking Magazine",
        "Description": "",
        "Category": "",
        "Publisher": "Walking, Incorporated",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Robinson Crusoe (Dover Thrift Editions)",
        "Authors": "By Defoe, Daniel",
        "Description": "Thought to have been inspired by the true-life experiences of a marooned sailor, Robinson Crusoe tells the story of the sole survivor of a shipwreck, stranded on a Caribbean island, who prevails against all odds, enduring three decades of solitude while mastering both himself and his strange new world. First published in 1719, the novel has long been one of the English language's great adventure stories.In the journal he shares with us, the endearing, goatskin-clad castaway recounts the details of his lonely existence and his many adventures, including a fierce battle with cannibals and a daring rescue of Friday, the man who becomes his trusted servant and companion. Defoe's brilliant and imaginative use of detail renders Crusoe's island world utterly convincing. In reclaiming his humanity from the savagery of his circumstances, the hero humbly acquires the qualities of courage, patience, ingenuity, and industry.Hailed as the first great English novel, Robinson Crusoe spawned legions of imitations, none of which surpass the original. All readers with a taste for adventure will relish this inexpensive edition of one of the most popular and influential books ever written.",
        "Category": " Fiction , Classics",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Sleeping Beauty (Walt Disney's Classic)",
        "Authors": "By Walt Disney Company",
        "Description": "Recounts the fairy tale about a beautiful princess who falls into a deep, long sleep after pricking her finger on a spindle",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Golden Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Horrible Harry in Room 2B",
        "Authors": "By Kline, Suzy",
        "Description": "",
        "Category": "",
        "Publisher": "Scholastic",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Talking Mickey Mouse Show: The Impossible Journey",
        "Authors": "By Disney",
        "Description": "",
        "Category": "",
        "Publisher": "Worlds of Wonder, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "You Know Your Dog Owns You If",
        "Authors": "By Chapman, Chaz and Curtis, Stacy",
        "Description": "",
        "Category": " Humor , Topic , Animals",
        "Publisher": "Lumina Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Garfield Keeps His Chins Up (Garfield (Numbered Paperback))",
        "Authors": "By Davis, Jim",
        "Description": "What are calories to a cat? For Garfield, they're a delicious way of life. But what do you expect from a feline who is able to eat tall lasagnas in a single gulp? So whether he's chaperoning Jon on a date, sleeping 'til noon, or tormenting the odiously lovable Odie, Garfield will never miss his next meal--or the chance to make us laugh!",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Pooped Troop (Pee Wee Scouts)",
        "Authors": "By Delton, Judy and Tiegreen, Alan (ILT)",
        "Description": "The Scouts of Troop 23 overdo it in their efforts to earn a fitness badge, and although tired, they are ready to reward themselves at a party with plenty of fattening food",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "All kinds of ships (A Golden look-look book)",
        "Authors": "By Reit, Seymour",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The Teddy Bear Who Couldn't Do Anything",
        "Authors": "By Anastasio, Dina and Loccisano, Karen (ILT)",
        "Description": "Though he can't march like the toy soldier, dance like the ballerina, or play the drums like the monkey, the teddy bear discovers that he is able to comfort a sleepy young boy",
        "Category": "",
        "Publisher": "Ladybird Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "When You Grow Up",
        "Authors": "By Goodings, Lennie and Jones, Jenny (ILT)",
        "Description": "Zachary, a young bear, says that when he grows up he is going to live with his mother, but she encourages him to think about the many other things he could do, such as being a footballer, pilot, or cowboy.",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "Dial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Unusual Animals (Golden Look-Look Book)",
        "Authors": "By Daly, Kathleen N.",
        "Description": "Easy-to-read text describes the characteristics of eighteen unusual animals including the platypus, cowbird, and seahorse.The unique appearances and unusual habits of a platypus, a sloth, a cowbird, a koala bear, a peacock, a seahorse, and other creatures are described",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Home Is Where the Heart Is (Thomas Kinkades Lighted Path Collection))",
        "Authors": "By Kinkade, Thomas and Kinkade, Thomas (ILT)",
        "Description": "A collection of the author's paintings of country cottages and Victorian homes, with quotes and proverbs about the meaning of home",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Easy Roses: Secrets for Glorious Gardens- Indoors and Out (The Garden Style Book)",
        "Authors": "By Brennan, Georgeanne, Echtermeyer, Faith (PHT), and Echtermeyer, Faith",
        "Description": "",
        "Category": " Gardening , Flowers , Roses",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The Berenstain Bears Visit the Dentist",
        "Authors": "By Berenstain, Stan and Berenstain, Jan",
        "Description": "Complete with a visit from the Tooth Fairy, this classic Berenstain Bears story is the perfect way to calm children’s nerves about going to the dentist!Come for a visit in Bear Country with this classic First Time Book® from Stan and Jan Berenstain. Join Mama, Papa, Brother, and Sister for a trip to the dentist where they’ll get checked for cavities, have their teeth cleaned, and learn all about the tools a dentist uses to help keep teeth healthy. Includes over 50 bonus stickers!",
        "Category": " Juvenile Fiction , Social Themes , New Experience",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1981"
        }
    },
    {
        "Title": "The Berenstain Bears and the Trouble with Friends",
        "Authors": "By Berenstain, Stan and Berenstain, Jan",
        "Description": "This beloved story is a perfect way to introduce children to the importance of friendship, sharing, and problem solving! Come for a visit in Bear Country with this classic First Time Book® from Stan and Jan Berenstain. A new cub, Lizzie, has moved to town and Sister can’t wait to become her friend. But when bossiness enters the mix, Sister and Lizzie’s new friendship might be in trouble.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Second-Grade Ape (Hello Reader)",
        "Authors": "By Pinkwater, Daniel Manus and Pinkwater, Jill (ILT)",
        "Description": "When a boy named Flash Fleetwood finds a stray gorilla, he places a lost-and-found ad in the paper, and when no one responds, he is allowed to keep the pet and bring it to show-and-tell, as long as it has a bath first. Original.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "The Last Shot: City Streets, Basketball Dreams",
        "Authors": "By Frey, Darcy",
        "Description": "For the average American boy, a basketball scholarship to college is not a necessity. But for many young athletes at Lincoln High School in Coney Island, New York, it is the only escape from the crime and poverty of the inner city.  In The Last Shot, author Darcy Frey chronicles the hopes and aspirations of four of Lincoln High's most promising players. What Frey finds is an environment that, by stressing the game above all else, has left its young athletes with nowhere to turn but to the glamorous coaches, slick recruiters, and million-dollar athletic companies who offer everything but guarantee nothing.  Gracefully and compassionately written, The Last Shot is a startling and disillusioning exposé of inner-city life and the big business of college basketball.",
        "Category": " Sports & Recreation , Basketball",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "DK Readers: Creating the X-Men, How Comic Books Come to Life (Level 4: Proficient Readers)\"",
        "Authors": "By Buckley, James and Teitelbaum, Michael",
        "Description": "Provides information on the artists and writers who create the X-men comic book series.",
        "Category": " Juvenile Nonfiction , Art , Cartooning",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Common Sense Discipline",
        "Authors": "By Rose, Ron and Allen, Roger",
        "Description": "",
        "Category": "",
        "Publisher": "David C. Cook",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Otis Spofford",
        "Authors": "By Cleary, Beverly",
        "Description": "When it comes to stirring up a little excitement in class, Otis Spofford knows just what to do. He can turn a folk dance fiesta into a three-ring circus . . . or an arithmetic lesson into a spitball marathon. Best of all, Otis likes teasing neat, well-behaved Ellen Tebbits—until the day his teasing goes too far. Now Otis is nervous, because Ellen isn't just mad . . . she's planning something!",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Universe's Biggest Book of Stupid Jokes",
        "Authors": "By Mostyn, David",
        "Description": "",
        "Category": "",
        "Publisher": "Constable Robinson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Recommended Country Inns Mid-Atlantic and Chesapeake Region (Recommended Country Inns Series)",
        "Authors": "By Chase, Suzi Forbes, Metcalf, Olive (ILT), and Chapin, Brenda Boelts",
        "Description": "",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Globe Pequot",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Fox in Socks (Beginner Books)",
        "Authors": "By Seuss, Dr.",
        "Description": "Fox in Socks celebrates 50 years of troubling tongues!      This  classic Beginner Book by Dr. Seuss features silly tongue twisters that  will have young readers--and their parents--giggling with glee. When a  fox in socks meets Knox in a box, hilarity ensues. Add chicks with  bricks and blocks and clocks and you're sure to get your words twisted  and lips locked! With his unmistakable gift for rhyme, Dr. Seuss creates  a hysterical and energetic way for beginning readers to dive into the  joy of reading. This book comes with the following warning: \"This is a  book you READ ALOUD to find out just how smart your tongue is. The first  time you read it, don't go fast! This Fox is a tricky fox. He'll try to  get your tongue in trouble.\" Available for a limited time only with a  peel-off 50th Anniversary Edition sticker on the cover, this is an ideal  gift for the holidays, birthdays, and happy occasions of all kinds that  the whole family will enjoy.",
        "Category": " Juvenile Fiction , Clothing & Dress",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Indelible (Grant County)",
        "Authors": "By Slaughter, Karin",
        "Description": "Two armed men enter the police station in tiny Heartsdale, Georgia, and open fire. When the shooting stops, an officer is dead, Police Chief Jeffrey Tolliver is seriously wounded, and the survivors -- including a class of grade-school children and medical examiner Sara Linton -- are held hostage. In a tense standoff that could erupt at any moment into more bloodletting -- with her ex-husband on the threshold of death -- Sara must search for answers and an escape in the memories of a time at the start of their relationship when another brutal, shocking crime shattered their small-town world. Because the sins of the past have caught up with Sara and Jeffrey ... with a vengeance.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "A Certain Hope (Texas Hearts, Book 1) (Love Inspired #311)",
        "Authors": "By Worth, Lenora",
        "Description": "A Certain Hope by Lenora Worth released on Jul 26, 2005 is available now for purchase.",
        "Category": " Fiction , Christian , Romance , General",
        "Publisher": "Love Inspired",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Elmo's Alphabet",
        "Authors": "By Muntean, Michaela",
        "Description": "",
        "Category": "",
        "Publisher": "Reader's Digest Young Famili",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Designing and Remodeling Bathrooms (Ortho library)",
        "Authors": "By Fox, Jill (EDT), Rice, Kenneth (PHT), and Beckstrom, Robert",
        "Description": "Depicts a variety of designs and offers practical guidance for installing bathroom fixtures",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "The Camel Club (Camel Club Series)",
        "Authors": "By Baldacci, David",
        "Description": "Welcome to THE CAMEL CLUB.Existing at the fringes of Washington, D.C., the Club consists of four eccentric members. Led by a mysterious man known as \"Oliver Stone,\" they study conspiracy theories, current events, and the machinations of government to discover the \"truth\" behind the country's actions.Their efforts bear little fruit-until the group witnesses a shocking murder...and become embroiled in an astounding, far-reaching conspiracy. Now the Club must join forces with a Secret Service agent to confront one of the most chilling spectacles ever to take place on American soil-an event that may trigger the ultimate war between two different worlds. And all that stands in the way of this apocalypse is five unexpected heroes.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Vision",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Arthur's Family Vacation: An Arthur Adventure (Arthur Adventures)",
        "Authors": "By Brown, Marc Tolon",
        "Description": "Arthur's family vacation is all wet-it's pouring rain! Arthur has to take charge and finds new things for his family to do-like go to Gatorville. Maybe family vacation isn't so bad after all!",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "A Guide Book of United States Coins, 34th Edition",
        "Authors": "By R.S. Yeoman",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Mother of Pearl (Oprah's Book Club)",
        "Authors": "By Haynes, Melinda",
        "Description": "Capturing all the rueful irony and racial ambivalence of small-town Mississippi in the late 1950s, Melinda Haynes' celebrated novel is a wholly unforgettable exploration of family, identity, and redemption. Mother of Pearl revolves around twenty-eight-year-old Even Grade, a black man who grew up an orphan, and Valuable Korner, the fifteen-year-old white daughter of the town whore and an unknown father. Both are passionately determined to discover the precious things neither experienced as children: human connection, enduring commitment, and, above all, unconditional love. A startlingly accomplished mixture of beauty, mystery, and tragedy, Mother of Pearl marks the debut of an extraordinary literary talent.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Who's who at the zoo?",
        "Authors": "By Weiss, Ellen",
        "Description": "",
        "Category": "",
        "Publisher": "Western Pub. Co. Inc., in conjuction with Children's Television Workshop",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Real-Life Monsters (Walt Disney Fun-To-Learn Library, Volume 6)",
        "Authors": "By Disney",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "From Whales To Snails (Disney Fun To Learn Library Volume 8)",
        "Authors": "By Walt Disney Production",
        "Description": "",
        "Category": "",
        "Publisher": "Advance Pub Llc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "All About You, Vol. 11",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1983"
        }
    },
    {
        "Title": "Numbers 1-10 (Walt Disney Library, Volume 2)",
        "Authors": "By Walt Disney",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Book",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Seasons and Holidays (Disney's Fun to Learn Ser)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Advance Pub Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "The Well-Filled Microwave Cookbook (Well-Filled Series , No 2)",
        "Authors": "By Wise, Victoria, Hoffman, Susanna, and Langley, Stephanie (ILT)",
        "Description": "Microwave ovens are in over 90% of American homes--but too often relegated to the role of re-heater, defroster, and popcorn maker. No more. Victoria Wise and Susanna Hoffman, authors of The Well-Filled Tortilla, spent three years exploring the possibilities of the microwave, and they've created a collection of 350 innovative, flavorful, at times whimsical recipes that take full advantage of the box and what it does best. And what the microwave does best, as the authors have discovered, is pretty terrific. Perfectly cooked fish. Creamy no-stir risottos. Luscious sauces for pasta. Crunchy pickles and relishes in a twinkling. Soup with an unexpected depth of flavor. Hasty puddings. And all without much of the time, mess, fuss, and demanding attention of conventional cooking. Then, marry these virtues with the sensibilities of two truly imaginative chefs, and the box really does become magic: Cuba Seafood Soup with Black Beans, Sweet Potato and Yam, Burmese Curried Chicken, Fish Fillets Brazilian, Tahini Spice Cake with Orange Glaze, Double Chocolate Pudding.",
        "Category": " Cooking , Methods , Microwave",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Stories to Solve: Folktales from Around the World",
        "Authors": "By George Shannon",
        "Description": "",
        "Category": "",
        "Publisher": "The Trumpet Club",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Interlude",
        "Authors": "By Gilbert, Lela",
        "Description": "Her dreams of love were about to come true. But on the eve of her wedding the nightmare began. Her fianc Jon, on photographic assignment in Lebanon, has vanished. Reporters mob her doorstep. Washington is doing \"everything possible\"--which means next to nothing. And all Elisabeth can do is wait. Her desperation to \"do something\" leads her into unwitting involvement with an international drug smuggle, an offbeat rock band, and a polished televangelist. Has her desperate attempt to find Jon only further endangered his life? An engrossing tale of faltering but persistent faith and miraculous, liberating love from the author of \"Prelude\".",
        "Category": " Fiction , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Guide to Sweden (Highlights Top Secret Adventures)",
        "Authors": "By Brian Williams",
        "Description": "",
        "Category": "",
        "Publisher": "Highlights for Children, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Highlights Top Secret Adventures guide to Thailand",
        "Authors": "By March, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Highlights for Children, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Incredible Fishing Stories",
        "Authors": "By Lee, Jared D. (ILT) and Morey, Shaun",
        "Description": "From a grueling 37-hour fight with a Pacific salmon to the maimed fisherman whose severed thumb turned up in the belly of a Mackinaw trout. From extraordinary marlin quests to hair-raising tales of \"fish catches man,\" here are fishing's 80 most unpredictable and spectacular tales. To get them, Shaun Morey-a fanatical fisherman and inveterate story collector-traveled from Alaska to Australia, Mexico, and the Caribbean to interview anglers, boat captains, guides and witnesses; to dig up photographs, and to confirm each tale. You'll read about Captain Jimmy Lewis who, in a moment of sheer bravado (or insanity), speared by hand-and landed-a 1,600-pound hammerhead shark. Or Bob Smith, fulfilling his twenty-year quest to catch all forty species of North America's wild trout on the bitter cold morning after his eighty-first birthday. Or the 800-pound blue marlin that made a final lunge-ripping up the deck and dragging a chair, with Paul Clause strapped in it, to the bottom of the ocean. (Paul survived; so did the marlin.) Truth is stranger than fiction.",
        "Category": " Sports & Recreation , Fishing",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Guide to India (Highlights top secret adventures)",
        "Authors": "By Williams, Brian",
        "Description": "",
        "Category": "",
        "Publisher": "Highlights for Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Mysteries of Pittsburgh",
        "Authors": "By Chabon, Michael",
        "Description": "The acclaimed New York Times bestseller.",
        "Category": "",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Rafe and Jared: The MacKade Brothers",
        "Authors": "By Roberts, Nora",
        "Description": "The dangerously sexy MacKade brothers are back in this exciting collection that features The Return of Rafe MacKade, in which reserved and sensible antiques dealer Regan Jones finds herself tempted by notorious bad boy Rafe MacKade, and The Pride of Jared MacKade, in which attorney Jared MacKade matches wits with sexy, unconventional Savannah Morningstar. Original. 1,200,000 first printing.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "The Velveteen Rabbit (Chunky Shape)",
        "Authors": "By Bianco, Margery Williams, Carpenter, Nancy (ILT), and Kass, Kimberly",
        "Description": "Illus. in full color. The timeless story of a toy rabbit that becomes real through the love of a child appears for the first time in an elegantly slipcased picture book and audio-cassette format. Cassette running time: 25 minutes.  From the Trade Paperback edition.",
        "Category": " Juvenile Fiction , Toys, Dolls & Puppets",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Biscuit's Birthday",
        "Authors": "By Capucilli, Alyssa Satin and Schories, Pat (ILT)",
        "Description": "It's Biscuit's birthday, and he's having a party! Join his friends in helping him celebrate. There are eight pages of activities at the end of the book, including a word search, maze, matching game, and more. Includes eight pages of activities!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Birthdays",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "If I Were President",
        "Authors": "By Peggy Gavan",
        "Description": "",
        "Category": "",
        "Publisher": "troll 1994",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Next Stop, New York City! (Polk Street Special)",
        "Authors": "By Giff, Patricia Reilly and Sims, Blanche (ILT)",
        "Description": "Bright lights, big city--Ms. Rooney's class is heading for NYC! They'll see dinosaurs at the American Museum of Natural History and they'll visit the Bronx Zoo, the Statue of Liberty, and many more sights. They'll even be in a Flag Day parade.Ms. Rooney's named Emily their \"New York City expert.\" But Emily doesn't know a thing about The Big Apple. And it's Pizzazz Week at the Polk Street School--not only does Emily not have pizzazz, but she did something that let her class down. What will she do when they find out? Not to worry! Emily finds the answers in The Big Apple, which is full of fun and big surprises for everyone.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Dog Days of the West (Wishbone Super Adventure #1)",
        "Authors": "By Henry, O., Duffield, Rick, and Sathre, Vivian",
        "Description": "Wishbone imagines he is cowboy \"Long Bill\" Longley",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Lyrick Studios",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "The Three Little Pigs (First Little Golden Book)",
        "Authors": "By Benjamin, Alan and Obligado, Lilian (ILT)",
        "Description": "Relates the adventures of three little pigs who leave home to seek their fortunes and how they deal with the big bad wolf.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Little Polar Bear (A Public Televsion Storytime Book)",
        "Authors": "By De Beer, Hans",
        "Description": "It's a big day for the little polar bear Lars! His father takes him hunting for the very first time, and that night he is so tired from all his lessons that he falls fast asleep. He sleeps so soundly that he doesn't hear the ice crack, doesn't feel himself slowly drift away from his father and the North Pole - he doesn't realize that his adventures have just begun.",
        "Category": " Juvenile Fiction , Animals , Bears",
        "Publisher": "North-South Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Peach Sampler",
        "Authors": "By Eliza Mears Horton",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Spires Company",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "Opposites",
        "Authors": "By Hill, Eric",
        "Description": "Pop-up flaps conceal the answers to questions about pairs of opposites.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "The Fire Engine Book",
        "Authors": "By Younger, Jesse",
        "Description": "",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Sunny Chandler's Return: A Novel",
        "Authors": "By Brown, Sandra",
        "Description": "The unforgettable novel of a woman who must return to her small hometown in the South, only to discover that the years-old secrets and scandals of her past are right where she left them'from #1 New York Times bestselling author Sandra Brown Sunny Chandler always said she'd never return to Latham Green, Louisiana. Just three years ago she was at the center of the small town's juiciest scandal. Now she's been invited to her best friend's wedding and has no choice but to go home. And with her return come the whispers . . . the looks . . . the rumors. It doesn't take her long to see that Latham Green has nothing new to offer. Except maybe Ty Beaumont . . . Ty can see through the gossip to the real Sunny. Yet despite his easy Southern charm, Sunny doesn't seem interested, even if she's seriously tempted. For she's harboring the agonizing secret of why she really left. What she needs is a man who's not just a lover. And though there's clearly much more to the roguish Ty Beaumont than meets the eye, Sunny doesn't know if she can trust anyone with her secret heartbreak'even the one man who may be able to heal it.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "The Journal of Daily Renewal: The Companion to Make the Connection",
        "Authors": "By Greene, Bob and Winfrey, Oprah",
        "Description": "A spiral-bound journal allows readers to keep a record of their feelings and own progress in their daily exercise program, and includes daily inspirational quotes, plus a check-off list of accomplishments.",
        "Category": "",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Pudgy Book of Mother Goose (Pudgy Board Books)",
        "Authors": "By Walz, Richard",
        "Description": "Humpty   Dumpty, Little Boy Blue, and other Mother Goose favorites are all here for   children to enjoy in a beautifully illustrated, sturdy book of rhymes.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Get a Clue! (Lizzie McGuire Mysteries, No. 1)",
        "Authors": "By Banim, Lisa and Minsky, Terri (CRT)",
        "Description": "Someone has been leaving creepy notes in lockers, notebooks, and knapsacks all over school, with messages like \"I Know What You Did Last Week.\" Students are getting really annoyed. And the notes all appear to be written by one person-Lizzie McGuire! But who would want to frame Lizzie for such a totally bizarro prank? Time for Lizzie to track down the guilty party before she's exiled to Loser-ville forever!",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Volo",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Always Postpone Meetings With Time-Wasting Morons",
        "Authors": "By Adams, Scott",
        "Description": "From mountain and valley, from hill and dale, people are asking, \"How can I have more Dilbert in my life?\" Help is at hand with a blast from the past in Scott Adams' very first compilation of Dilbert comic strips, Always Postpone Meetings with Time-Wasting Morons.It is tempting to compare Adams' work to that of Leonardo da Vinci. The differences are striking. Adams displays good jokes and strong character development, whereas da Vinci has been skating for years on his ability to do shading. Advantage: Adams.And though it may seem boorish to point this out, da Vinci wrote backwards. And he's dead. Advantage: Adams.The choice is clear. Fans looking for a book which will stand the test of time, even beyond the time you spend flipping through it in the bookstore (for which the author receives no royalties whatsoever), should buy this book. Those who are not good comparison shoppers can buy the Mona Lisa.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Growing Up Protected",
        "Authors": "By Stonehouse, Bernard and Francis, John (ILT)",
        "Description": "Provides information on how different creatures mature into adults and how they are able to survive with the help of parents and their own special characteristics.",
        "Category": " Juvenile Nonfiction , Science & Nature , Biology",
        "Publisher": "Tangerine Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Dr. Jekyll and Mr. Hyde (Wordsworth Classics)",
        "Authors": "By Stevenson, Robert Louis",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Wordsworth Editions Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Daisy Miller & Other Stories (Wordsworth Classics)",
        "Authors": "By James, Henry",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Wordworth Editions Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    }
]