[
    {
        "Title": "The Attending Physician",
        "Authors": "By R.B.Dominic",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Birds of Prey: A Novel of Suspense",
        "Authors": "By Jance, Judith A.",
        "Description": "A survivor of childhood trauma, two marriages, twenty hard years with the Seattle Police Department, and the bottle, Jonas Piedmont Beaumont has spent far too much time trolling the darker waters of human nature. In the wake of a devastating professional tragedy, he has decided, at long last, to pull the pin. But there is no safety in semiretirement for a man who, long ago, chose to make a violent world his home.Temporarily at leisure, Beau has agreed to chaperon his newly wed grandmother on her honeymoon cruise to the Gulf of Alaska. His time aboard the Starfire Breeze is meant to be an enjoyable diversion, a respite to allow some deep psychological wounds a chance to heal in the bright sun and clear, crisp northern sea air. It also places him squarely in the sights of a feisty group of middle-aged divorc&eacutees.But death is everywhere, even at sea. Beau's brief idyll is abruptly shaken when one of his new admirers, mysteriously disappears -- and is shattered when a security videotape shows her taking a fatal fall overboard. Like it or not, the burden of investigating a heinous crime is once again on Beau's shoulders. And this one is carrying the seasoned detective into uncommonly dark and dangerous waters. Adrift a thousand miles from home, J. P. Beaumont suddenly finds himself submerged in a terrifying conspiracy that, if allowed to proceed unchecked, could have disastrous consequences, not only for Beau and his shipmates, but for the future of the world they all hope to return to.In Birds of Prey, J. A. Jance masterfully demonstrates her rare and winning ability to combine riveting suspense, intelligence, vivid color, and poignant humanity into one magnificent whole. No one in her field is better at exploring mortal strengths and frailties while exposing the complex shades of evil that can shroud the human soul.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Mighty Good Road",
        "Authors": "By Melissa Scott",
        "Description": "",
        "Category": "",
        "Publisher": "Baen Books / SFBC",
        "Price Starting With ($)": "12.55",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Hard Fall",
        "Authors": "By Pearson, Ridley",
        "Description": "First there was Lockerbie.  Then Eurotour's Flight 1023.  Now the bomber is ready to strike again!  The bombing of Eurotours flight 1023 was big news.  To FBI agent Cam Daggett it was more than that.  It was personal.  His parents and son were on that plane.  And for two years he's been after the killer who did it.  All he has is a name: Anthony Kort . . .and the knowledge that Kort is in the United States with a detonator no airport security can detect.Cam's colleagues at the Bureau and his girlfriend tell him to get behind a desk, to leave the investigation to other agents.  But Cam has painstakingly built a portrait of the terrorist, and he alone has a snowball's chance in hell of predicting Kort's next target.  Except hell is a much kinder, gentler place than where Cam's headed -- into Kort's depraved world of madness and revenge.From the Paperback edition.",
        "Category": " Fiction , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "Vertical Burn",
        "Authors": "By Emerson, Earl W.",
        "Description": "Earl Emerson is the poet laureate of men and women who make their living where the heat is, bringing to life the terror of a burning building and the moments of solitude, solace, and camaraderie that happen in between. Now, Emerson has written a mesmerizing novel of suspense about a man who goes into a fire as a hero and a friend, and comes out as an outcast–and a target.VERTICAL BURNTwenty-eight paces. John Finney counted his steps as he fought his way for help from inside a Seattle warehouse burning on Leary Way. And when he reached his rescuers, he told them where his partner lay waiting–twenty-eight paces away. But they didn’t reach Finney’s partner until the building had cooled. Now, six months after that tragic day, no one remembers Finney giving the directions that pinpointed his partner’s position. No one can remember anything about Finney except that he left his friend to die. For Finney, the son of a fire chief, losing his reputation and the trust of his fellow firefighters is a bitter blow. But Finney doesn’t believe the fire was an accident. And he doesn’t believe the campaign against him is one either.Trying to reconstruct the events at Leary Way, Finney uncovers suspicious actions by men at the scene. With only one person on his side–a female firefighter who is herself an outcast in the department–Finney begins to piece together an astounding conspiracy that will turn friends into suspects, good men into conspirators, and every man inside the department into a potentially deadly enemy. And the most horrific fire is yet to burn.From the terrifying darkness of a smoke-engulfed room to the politics that plays out behind closed doors, Earl Emerson captures with passion and pathos the life and times of the men and women dedicated to the service. In Vertical Burn he fuses his feeling for real-life heroes with a white-hot tale of suspense and betrayal– the kind of betrayal that burns bodies, burns a city, and burns a soul forever.",
        "Category": " Fiction , Literary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Kid's Stuff",
        "Authors": "By Kelly, Susan B.",
        "Description": "Acclaimed British author Susan B. Kelly, known to readers for her Detective Chief Inspector Nick Trevellyan/Alison Hope mysteries, focuses on Trevellyan and reveals a darker side of Hop Valley life in this compelling new novel.When Nick arrests Arturo Bottone, a callous peddler of child pornography, he knows he's won just half the battle. He's got the middle man, but who is taking the pictures? Soon out on bail, Bottone is found dead, hanged in his own stable. Is it suicide, as the police pathologist and Nick's police colleagues suggest? Or was he murdered by a client eager to protect his good name?",
        "Category": " Fiction , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Against The Odds (Serrano Legacy)",
        "Authors": "By Moon, Elizabeth",
        "Description": "IMPLOSION!The worst has happened: Fleet is tearing itself apart. Some of the mutineers see injustice in the unequal spread of the rejuvenation drugs that offer virtual immortality to the rich; others are simply thirsty for power, or for blood. The Loyalists, meanwhile, fight desperately to preserve the rule of law in Familias Regnant space.But when Esmay Suiza-Serrano is unceremoniously booted out of Fleet, the apparent victim of Family politics, she has no idea of the whirlwind of conflict into which she is about to be drawn. As the noose tightens on galactic civilization, great battles will be fought and greater loves affirmed...and old friends will meet their destinies.",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Baen",
        "Price Starting With ($)": "5.93",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Dead Midnight (Sharon McCone Mysteries)",
        "Authors": "By Muller, Marcia",
        "Description": "Sharon McCone, who has faced and survived many personal crises, must endure another long, dark journey after her brother Joey takes his own life. Reeling from the anguish and the perplexing reasons for Joey's suicide, Sharon tries to escape through work.On the surface, the new case seems straight-forward enough. Yet as the keen private investigator knows, it's often what's hiding under the surface that's deadly. McCone is asked to investigate another suicide, this one of Roger Nagasawa, a talented young man who worked for an online magazine that chronicled the new and hip in the Bay area. Even with millions of dollars in venture capital backing it, Insite is failing and the 'zine's management has become so cutthroat that Roger evidently jumped off the San Francisco-Oakland Bay Bridge rather than face another day at the office. Or did something sinister behind the scenes prod him to take the plunge?The investigation hits achingly close to home as McCone struggles to answer the questions that plague Roger's grieving family. With her emotions sandblasted and her reactions slowed, she fails to recognize the peril that surrounds her as the case takes a violent twist.From Rogers empty apartment to an eerie abandoned resort on the San Francisco waterfront, McCone is caught in a deadly battle to uncover the truth. And to survive, she must confront the many painful secrets of her own life ... and a killer whose heart is as black as the moonless bay.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Mysterious Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Reckless Abandon: A Stone Barrington Novel",
        "Authors": "By Woods, Stuart",
        "Description": "In Reckless Abandon, the smooth and charming cop-turned-lawyer Stone Barrington returns - this time on the hunt for a killer with the guts to think he can hide out among the crowds of New York City. What this fugitive does not know can definitely hurt him: Stone's partner in this endeavor is none other than Holly Barker, the Orchid Beach, Florida, police chief who would love nothing better than to put the man where he belongs, behind bars.The man is running from more than one audacious and shocking crime scene in Florida, and now it's up to Stone and Holly to track him down before he can strike again. Stone is, well, glad to have a woman like Holly at his side, right until the moment when her presence creates a great danger to both of them. But their greatest obstacle in the chase could be the government insiders who profess to have the public's best interests in mind.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The Fallen Man",
        "Authors": "By Hillerman, Tony",
        "Description": "Legions of devotees will cheer the return of Joe Leaphorn and Jim Chee in Tony Hillerman's most intricate and atmospheric novel yet. The Navajo policemen whose exploits are now published in sixteen languages are brought together by the need to know how a man met his death on Ship Rock, almost seventeen hundred feet above the desert floor. Why had he climbed this mountain sacred to Navajos and why had he been killed there - or, even worse, left to die a lonely death?The fallen man lay sprawled on a ledge under the peak of Ship Rock mountain for eleven years - visited only by the ravens that had picked his bones clean and scattered his rock-climbing gear. That peaceful period ended, appropriately, on Halloween, when a climbing party stumbled upon his bones and began a chain of events that would ultimately link Leaphorn and Chee.As Chee and Leaphorn join to investigate why the fallen man fell, they set off across the high desert landscape of the Navajo reservation and into the lives of a rookie cop who is smarter than anyone thinks, a lonely woman who takes up her father's hobby of watching a mountain, a cattle-brand inspector who demonstrates that cows are even more curious than cats, a banker who knows her depositors' private lives as well as their balance sheets, a widow who loves one man too many, and the people who defy death on the towering cliffs of a sacred peak.",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "The Forgotten: A Peter Decker/Rina Lazarus Novel",
        "Authors": "By Kellerman, Faye",
        "Description": "The unofficial caretaker of her small storefront synagogue, Rina is shocked when she receives a morning call from the police. The modest place of worship has been desecrated with anti-Semitic graffiti and grisly Nazi death-camp photographs. Rina's husband, Lt. Peter Decker, is also rocked by this outrage, which cuts close to the spiritual heart of his family, but he can't let his emotions get in the way of his duties.A suspect is soon in custody. Seventeen-year-old Ernesto Golding is one of L.A.'s children of wealth and privilege, a rich kid obsessed with haunting suspicions about the origins of his Polish paternal grandfather, who moved to Argentina after the Third Reich collapsed. Charges are brought against Ernesto, a deal is cut, and the vandalism case is eventually closed.Still, Decker has never abandoned the possibility that others were involved in the desecration. And his hunch is confirmed when, six months later, Ernesto is found brutally murdered along with his therapist, Dr. Mervin Baldwin, at the psychologist's exclusive nature camp that caters to the wealthy's troubled children. Suspicion falls immediately on Baldwin's psychologist wife, Dee, who has vanished mysteriously. Further probing by Decker fails to produce quick answers and simple solutions. For Decker and Rina, unraveling the truth behind Ernesto's violent death becomes more terrifying with each sinister twist, pushing them into the ghastly world of ruthless parents and damaged youths. Slowly, lethal secrets with roots in the horrors of a past generation surface, propelling Peter and Rina into a dreaded journey of dark and evil -- and of ultimate retribution.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Visions in Death",
        "Authors": "By Robb, J. D.",
        "Description": "A brand-new novel in the number-one New York Times-bestselling In Death series set in 2059 New York City. As technology and humanity collide, Detective Eve Dallas searches the darkest corners of Manhattan for an elusive killer with a passion for collecting souls...  On one of the city's hottest nights, New York Police Lieutenant Eve Dallas is sent to Central Park-and into a hellish new investigation. The victim is found on the rocks, just above the still, dark water of the lake. Around her neck is a single red ribbon. Her hands are posed, as if in prayer. But it is the eyes-removed with such precision, as if done with the careful hands of a surgeon-that have Dallas most alarmed.  As more bodies turn up, each with the same defining scars, Eve is frantic for answers. Against her instincts, she accepts help from a psychic who offers one vision after another-each with shockingly accurate details of the murders. And when partner and friend Peabody is badly injured after escaping an attack, the stakes are raised. Are the eyes a symbol? A twisted religious ritual? A souvenir? With help from her husband, Roarke, Dallas must uncover the killer's motivation before another vision becomes another nightmare. . . .",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Songcatcher: A Novel",
        "Authors": "By McCrumb, Sharyn",
        "Description": "Folksinger Lark McCourry retraces the history of a family song, which she had heard from her North Carolina relatives as a child, back to eighteenth-century Scotland to young Malcolm MacQuarry, kidnapped and sent to the American colonies, where he eventually became a lawyer and fought in the American Revolution. 60,000 first printing.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Wings of Fire",
        "Authors": "By Brown, Dale",
        "Description": "Dale Brown has written thirteen consecutive bestselling novels, but nothing that compares with the drama of Wings of Fire. Ostracized by the government, the military, even his own family, Air Force general Patrick McClanahan is near the end of his rope. And it's about to get worse.  North Africa is in turmoil. The new Libyan president has assassinated the new Egyptian president, and the latter's widow, Makta Salaam, vows revenge. Enlisting McClanahan's high-tech help, she survives an assassination attempt, takes over the Egyptian government, seduces and then kills the Libyan president, and all but proclaims herself queen of Arab North Africa. It's when she invades the Gaza Strip and proclaims it part of her empire that she goes too far. Both Syria and Israel go on alert, and it is only through the intervention of his fellow Night Stalkers that McClanahan wrests himself from under her spell. But is it too late? Salaam still has a few tricks up her sleeve, and she has saved the deadliest for last. . . .  Filled with meticulous authenticity and exceptional storytelling, Wings of Fire is Dale Brown at his best.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Call Back Yesterday",
        "Authors": "By Shipman Natalie",
        "Description": "",
        "Category": "",
        "Publisher": "See Description",
        "Price Starting With ($)": "7.59",
        "Publish Date": {
            "Month": "January",
            "Year": "1945"
        }
    },
    {
        "Title": "The Ten Thousand",
        "Authors": "By Coyle, Harold",
        "Description": "Harold Coyle has established himself as one of America's finest suspense novelists. With four consecutive New York Times best-selling novels of epic war, Team Yankee, Sword Point, Bright Star, and Trial by Fire, he is a master of the supercharged merging of global conflicts, strategy, politics, and probable world events. The Ten Thousand represents Harold Coyle at his visionary and apocalyptic best, and it's as intense, startling and thrilling as it is suspenseful.Hard on the heels of revolution and hope, Europe is suddenly in flames again. Germany is once more the dominant power, her leadership determined to win the world's respect, by bloody force if necessary. In Eastern Europe, where a weakened Russia is struggling against the ambitions of her neighbors, virulent nationalism and ancient ethnic hatreds fan the flames of war, this time with nuclear weapons as the ultimate threat. Caught up in the rising storm of a Europe in dangerous transition is an American army, no longer just keeping the peace, but drawn inexorably into a real shooting war.Harold Coyle's riveting - and all too possibly prophetic - new novel has the immediacy and the punch of today's fears and tomorrow's headlines. When the Ukraine refuses to hand its store of nuclear weapons to Russia, American troops are sent in to enforce compliance, while a right-wing nationalist German government seizes the opportunity to make a bid for world power....Trapped by the rush of events, threatened by the specter-become-reality of a united Germany with atomic weapons, the American forces make a bold bid for survival by fighting their way to the safety of the Baltic Sea, crossing a hostile Germany like the Greeks in Xenophon's classic \"The Ten Thousand.\"Coyle's grasp of geopolitical reality and his sure command of the battlefield - in the words of Stephen Coonts, \"Nobody knows war like Harold Coyle, and nobody writes it better! \" - is matched by the skill with which he creates and maneuvers a rich and fascinating cast of characters, from the top decision makers - the President of the United States, the Chancellor of Germany, their advisors and staffs - down to the ordinary soldiers and civilians obliged to live or die as a consequence of those decisions.The story of Lieutenant General \"Big Al\" Malin's epic march through Germany to the sea pits Americans against Germans for the first time in fifty years, plunging into battle Colonel Scott Dixon (the ongoing central figure in Coyle's novels); Captain Nancy Kozak, the engaging young female combat officer from Trial by Fire; and Colonel Vorishnov and Major Ilvanich, two Russian officers who find themselves fighting side by side with the Americans; as well as countless soldiers and officers on both sides, facing combat - and their consciences - for the first time.Exciting, frighteningly plausible, absolutely authentic, The Ten Thousand is Harold Coyle's most ambitious and explosive book to date.",
        "Category": " Fiction , War & Military",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Back Story (Spenser Mystery)",
        "Authors": "By Parker, Robert B.",
        "Description": "In 1974, a revolutionary group calling itself The Dread Scott Brigade held up the Old Shawmut Bank in Boston's Audubon Circle. Money was stolen. And a woman named Emily Gordon, a visitor in town cashing traveler's checks, was shot and killed. No one saw who shot her. Despite security-camera photos and a letter from the group claiming responsibility, the perpetrators have remained at large for nearly three decades.  Enter Paul Giacomin, the closest thing to a son Spenser has. Twice before, Spenser's come to the young man's assistance; and now Paul is thirty-seven, his troubled past behind him. When Paul's friend Daryl Gordon-daughter of the long-gone Emily-decides she needs closure regarding her mother's death, it's Spenser she turns to. The lack of clues and a missing FBI intelligence report force Spenser to reach out in every direction-to Daryl's estranged, hippie father, to Vinnie Morris and the mob, to the mysterious Ives-testing his resourcefulness and his courage.  Taut, tense, and expertly crafted, this is Robert B. Parker at his storytelling best.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "When the Wind Blows",
        "Authors": "By Patterson, James",
        "Description": "While grieving her husband's murder, a young Colorado veterinarian meets a troubled FBI agent and begins to uncover the world's most sinister secrets.Frannie O'Neill is a young and talented veterinarian living in Colorado. Plagued by the mysterious murder of her husband, David, a local doctor, Frannie throws herself into her work. It is not long before another bizarre murder occurs and Kit Harrison, a troubled and unconventional FBI agent, arrives on her doorstep.Late one night, near the woods of her animal hospital, Frannie stumbles upon a strange, astonishing phenomenon that will change the course of her life forever: her name is Max.With breathtaking energy, eleven-year-old Max leads Frannie and Kit to uncover one of the most diabolical and inhuman plots of modern science. Bold and compelling, When the Wind Blows is a story of suspense and passion as only James Patterson could tell it.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.59",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The Burning City",
        "Authors": "By Niven, Larry and Pournelle, Jerry",
        "Description": "Each an acclaimed author in his own right, Larry Niven and Jerry Pournelle have collaborated on some of the biggest bestsellers in science fiction history, including the No. 1 New York Times bestseller Footfall, as well as Lucifer's Hammer, Inferno, Oath of Fealty, and The Mote in God's Eye. Now Niven and Pournelle have combined their award-winning talents and imaginations to produce a masterpiece of epic fantasy that rivals the works of Robert Jordan and David Eddings.  Set in the world of Niven's popular The Magic Goes Away, The Burning City transports readers to an enchanted ancient city that often bears a provocative resemblance to our own modem society. Here Yagen-Atep, the volatile and voracious god of fire, holds sway, alternately protecting and destroying the city's denizens. In Tep's Town, nothing can burn indoors and no fire can start: by accident -- except when the Burning comes upon the city. Then the people, possessed by Yagen-Atep, set their own town ablaze in a riotous orgy of destruction that often comes without warning.  Whandall Placehold has lived with the Burning all his life. Fighting his way to adulthood in the mean-but-magical streets of the city's most blighted neighborhoods, Whandall alone dreams of escaping the god's wrath to find a new and better life. But his best hope for freedom may lie with Morth of Atlantis, the enigmatic sorcerer who killed his father!  Both gritty and exotic, The Burning City is unique fantasy vision unlike any you have read before.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Before I Say Good-Bye",
        "Authors": "By Clark, Mary Higgins",
        "Description": "Mary Higgins Clark, America's \"Queen of Suspense,\" delves into the mystery of psychic powers and communication with the dead in her gripping new thriller,  Before I Say Good-Bye.  When Adam Cauliff's new cabin cruiser, Cornelia II, blows up in New York harbor with him and several close business associates aboard, his wife, Nell MacDermott, is not only distraught at the loss but wracked with guilt because she and Adam had just had a serious quarrel and she had told him not to come home.  The quarrel was precipitated by Nell's decision to try to win the congressional seat long held by her grandfather Cornelius MacDermott. Orphaned at age ten, she had been raised by \"Mac,\" as she called him, and was always at his side on Capitol Hill. Politics was in her blood, and Adam had known her ambitions when they married. Suddenly, however, he became opposed to her plan to run for Congress.  Nell, like her great-aunt Gert, possesses psychic gifts, which her grandfather scoffingly dismisses as \"flights of fantasy.\" As a child she had been aware of the deaths of both her parents and grandmother at the exact moment they died. She knew because at that very moment she sensed their presence near her. Even though Nell has the rare gift of extrasensory perception, she is much too levelheaded to accept most of the claims made by many so-called psychics and is skeptical about Aunt Gert's fascination with mediums. After Adam's death, however, Gert begs Nell to see a medium, Bonnie Wilson, who has contacted her, claiming she is in touch with Adam. Still regretting her last angry words to Adam, Nell agrees, hoping that she will be able to reach him through the medium and part from him in peace.  As the investigation into the boat's explosion proceeds, Nell is shocked by the official confirmation that it was not an accident but the result of foul play. Adam, an architect, had been involved in a major construction project on land he had recently purchased and which had since had a spectacular rise in value.  Was Adam the target of the explosion? Or was it Winifred Johnson, his self-effacing, fifty-two-year-old assistant, who knew too much about bribery in the construction business and who was openly in love with him? Or was it Sam Krause, a builder with a questionable reputation who was involved in the new project? Or Jimmy Ryan, the debt-ridden construction foreman whose wife, after his death, discovers money hidden in their home? Or was it Peter Lang, the wealthy man-about-town real-estate entrepreneur, whose minor traffic accident caused him to miss the fatal meeting on the boat?  As Nell searches for the truth about Adam's death, she carries out instructions from Adam transmitted through the medium. What she does not know is that she is being closely watched, and the nearer she comes to learning what actually happened on the boat that night, the nearer she is to becoming the next victim of a ruthless killer.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "To Ruin A Queen : An Ursula Blanchard Mystery at Queen Elizabeth I's Court",
        "Authors": "By Buckley, Fiona",
        "Description": "With historical mysteries and tales of Tudor England in high demand, acclaimed author Fiona Buckley returns with a poignant new novel featuring Ursula Blanchard, waiting woman and secret agent for Queen Elizabeth I.  Still loyal to her royal mistress but needing to be with her French husband, Matthew de la Roche, Ursula begins to build a new life for herself at Matthew's château. She loves Matthew, although she longs desperately for her little girl, Meg, left behind in England. But when Meg's passage is finally arranged, the child is missing. Where is she, and could her disappearance be part of a plot to tempt Ursula back to her homeland?  Frightened for her child, Ursula follows a trail that leads to the home of the ancient Mortimer family, the mysterious Vetch Castle, a grim, haunted keep on the Welsh border. There she finds castle owner Philip Mortimer, who boasts that he will force Queen Elizabeth to restore the fortunes of his once-great family. There, too, Ursula finds Philip's mother, the aging but still beautiful Lady Thomasine, who is frightened by her son's claims and pleads for Ursula's help in discovering what it is that he knows. What deadly secrets does this castle hide? What ghostly faces look from the windows of the deserted southwest tower? What has Philip Mortimer discovered? The secrets of Vetch Castle could be dangerous, especially if they concern the Queen -- dangerous to the Mortimers and to Ursula and those she loves, as she soon learns to her peril.  Richly evocative of its rugged English and Welsh setting, precise in its historical detail, and filled with memorable characters, To Ruin a Queen will affirm Fiona Buckley's growing reputation as a queen of historical crime.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Tribal Secrets",
        "Authors": "By Izzi, Eugene",
        "Description": "Raised on Chicago's mean streets, Babe Hill has fought long and hard to put his violent past behind him. And it looks as if he may have finally succeeded: his performance in a Sunday night Movie of the Week has made Babe Hill a star. But getting there didn't come easy, and Babe has the scars to prove it....Down on the city's southeast side, Babe's father, Johnny Hilliard, has made a career out of killing for the mob, while Babe's younger brother kills for the pure pleasure of it. Even Babe, before managing to break away from the family, once went before a judge for manslaughter. No matter how far you go or how high you climb, it's the kind of history that can always reach up and drag you down.But now Babe is discovering that the past isn't his only problem, that success doesn't mean safety, and fame doesn't deliver happiness. Because when you've got millions of adoring fans, all it takes is one to make your life hell. Edna Rose doesn't care if Babe has a wife and kids. She knows that the sexy actor belongs to her - and she'll do anything to win him...anything.Yet when Edna makes her move, she'll find she has unexpected competition. Babe's father has just ripped off his employers to the tune of forty grand, and now the mob means to make Babe pay for his father's sins. Suddenly everyone wants a piece of Babe...but it won't go down the way any of them expect....From Chicago's darkest alleys into the darkest corners of the human heart, Tribal Secrets rips away the masks...to expose the menace, rage, and desperation that seethes just beneath the surface of our lives.",
        "Category": " Fiction , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "18.39",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Student's Guide to Music Theory: A Book of Music Fundamentals for Students",
        "Authors": "By Bye, Dean L.",
        "Description": "",
        "Category": "",
        "Publisher": "Mel Bay Publications, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2015"
        }
    },
    {
        "Title": "Fortress Cuba;: Russia's American base ;",
        "Authors": "By Mallin, Jay",
        "Description": "",
        "Category": "",
        "Publisher": "H. Regnery Co",
        "Price Starting With ($)": "12.11",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Chinese Profiles",
        "Authors": "By Zhang, Xinxin",
        "Description": "",
        "Category": "",
        "Publisher": "China Books & Periodicals",
        "Price Starting With ($)": "7.68",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "Card Tricks",
        "Authors": "By Weir, James",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Me and My Little Brain (Great Brain)",
        "Authors": "By Fitzgerald, John D.",
        "Description": "When the Great Brain leaves Adenville to attend school, nine-year-old J.D. is left to discover his own significant talents",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1972"
        }
    },
    {
        "Title": "Why Does Popcorn Pop",
        "Authors": "By Voorhees, Don",
        "Description": "",
        "Category": "",
        "Publisher": "MJF Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Sailing-Ship: Six Thousand Years of History",
        "Authors": "By Anderson, Romola",
        "Description": "",
        "Category": "",
        "Publisher": "Bonanza Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Devil's Claw (Joanna Brady Mysteries, Book 8)",
        "Authors": "By Jance, Judith A.",
        "Description": "In the night-still canyons of the Arizona desert, a girl is on the run. Alone but for her beloved red-tailed hawk, she flees from the dark shadows of her young life, the horror she has witnessed…and the terror that now stalks her.New York Times bestselling author J.A. Jance returns with her eighth novel in the highly acclaimed Joanna Brady mystery series. Set against the backdrop of the modern west, this gripping tale finds Sheriff Brady juggling a precarious overload in both her personal and professional lives. About to be married, Joanna's facing a daughter turning twelve and going on twenty, a meddlesome mother micro-managing her wedding, and new in-laws arriving any day. The sudden death of her much-loved neighbor and handyman, Clayton Rhodes, creates further turmoil, leaving Joanna shocked, saddened, and the target of Clayton's irate and irrational daughter, who accuses the Sheriff's Department of covering up a possible murder.But amidst the uproar, the report of a homicide at Cochise Stronghold in the Dragoon Mountains quickly captures Joanna's full attention. An Indian woman has been found shot to death--a woman recently released from prision after serving time for the manslaughter killing of her husband. She is the mother of a missing fifteen-year-old, Lucy Ridder.The death at first appears to be a case of domestic rage finally exploding'and a troubled teen runaway may be a victim, or a cold-blooded killer. Yet as Joanna deals with the long-standing troubles of Clayton Rhodes' family and digs deeper into the mysterious life of Lucy and her family, she discovers that investigating family hostilities is leading her down a twisted trail of hatred, greed, and far-reaching consequences--and into a dangerous world where violence is the first response and long buried secrets are a reason to kill…or die.Once again, J.A. Jance delivers a gritty, deftly written thriller that unfolds on a vivid landscape of raw beauty and unrelenting danger. And, as always, Sheriff Joanna Brady brings the setting to life with the sensitivity, spirit, and intense passion for justice that makes Jance novels ring with authenticity.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Defense for the Devil",
        "Authors": "By Wilhelm, Kate",
        "Description": "Attorney Barbara Holloway has taken on the sort of cases no one else wants - hopeless messes, all of them - and with the help of her father, Frank, she has pulled through each time. But even from the start, this new case is different.Mitch Arno always meant bad news for the coastal town of Folsum, Oregon. When they ran him out of town seventeen years ago, he left behind a wife with two daughters and a family that never wanted to see him again.When he returns, he brings trouble in the form of a lot of suspicious money. As Barbara attempts to counsel Mitch's wife about the money, a second form of trouble arrives: a corpse, Mitch's. And now Barbara is in a morass of conflicting interests, and the only way out could lead her straight into the arms of the devil.",
        "Category": " Fiction , Legal",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Survivor in Death",
        "Authors": "By Robb, J. D.",
        "Description": "The newest in the number-one New York Times-bestselling In Death series featuring Lieutenant Eve Dallas and Roarke. Nora Roberts writing as J. D. Robb returns to the New York City of 2059-where Dallas will struggle to solve the murder of a seemingly ordinary family and to protect one small, terrified survivor.  The members of the Swisher family were murdered in their beds with brutal, military precision. The state-of-the-art security was breached, and the killers used night-vision equipment to find their way through the cozy, middle-class house. Clearly, Dallas is dealing with pros. It seems the only mistake they made was to overlook the nine-year-old girl cowering in the darkened kitchen.  Now Nixie Swisher is an orphan-and the sole eyewitness to a seemingly inexplicable crime. Kids are not Dallas's strong suit. But Nixie needs a safe place to stay, and Dallas needs to solve this case. With her partner, Peabody, back on the job-and her husband, Roarke, providing the kind of help that only he can give-Lieutenant Eve Dallas is running after shadows, and dead-set on finding out who's behind them.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Parallel Lies",
        "Authors": "By Pearson, Ridley",
        "Description": "Every six or eight weeks, another train derailment. Images fill our TV sets and cover the front pages. \"Driver error,\" \"mechanical failure,\" \"a failed signal\" - the rail company provides the reasons behind the accidents. But they are hiding the truth.Umberto Alvarez, a suspected terrorist, blames Northern Union Railroad for the crossing guard collision that killed his wife and twins two years earlier. He believes he and his family are the victims of a massive cover-up. The truth is nothing but a publicity stunt.Peter Tyler is an ex-cop looking to redeem himself after being suspended from the force for an assault that was taken out of context. Now a \"temp\" investigator for the National Transportation Safety Board, Tyler sees an opportunity to jump-start his career. The truth of what happened that night will never be known, but a woman who steps out of a snowstorm and into his life may just hold the key to unlocking the past and allowing Tyler to move on.",
        "Category": " Fiction , Thrillers",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Mobtown: A Novel",
        "Authors": "By Kelly, Jack",
        "Description": "Jack Kelly sets his new novel in Rochester, New York, circa 1959. Kelly's Rochester is a dark and glamorous place, not unlike Los Angeles in the forties - filled with dapper mobsters and slightly dangerous, mysterious women. Rochester is home to, among others, gangsters, a dead heiress, and a savvy private detective named Ike Van Savage, a man who says about himself: \"Some people want their lives predictable. You go to work, come home, no surprises...I wasn't like that...I needed creeps pawing teenagers and gangsters torching houses and mystery women cooing danger over the phone.\" Enter a beautiful mystery woman in the flesh, the wife of a notorious local gangster, who believes her husband is out to kill her. Van Savage takes on the case despite its dangers - perhaps even because of them - and finds himself drawn into a dark world of seduction, suspicion, and violence.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Hope Will Answer: An Inspector Trevellyan, Allison Hope Mystery",
        "Authors": "By Kelly, Susan B.",
        "Description": "It's a drizzly November in England's picturesque Hop Valley, and Alison Hope feels restless. So when her old friend, Philip Hunter, begs her to come to London to help track down the source of some computer fraud, she's delighted - much to the dismay of Inspector Nick Trevellyan, her friend and lover, who senses trouble, even danger, ahead.His instincts are right. Alison has hardly had time to assume a new name, dye her hair, and acquire tinted contact lenses, when the fiscal fraud turns into murder. Nick, meanwhile, is stuck at home, trying to track down the brutal rapist of a young girl before the man can strike again.When Nick's longtime associate, Bill Deacon, has to go into the hospital, and the overly ambitious and efficient Detective Sergeant Walpole arrives to replace him, Nick has yet another reason to be desperate to finish his case.In London, Alison is on her own in a terrifying situation unlike any she's ever faced before.",
        "Category": " Fiction , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Cold Light",
        "Authors": "By Harvey, John",
        "Description": "For Dana Matthieson, the annual Christmas Eve office party had turned into a disaster: fighting off her boss's sloppy sexual advances, Dana had by evening's end lost her temper, the heel off one of her party shoes, and, quite possibly, her job.In the cold light of Christmas Day, it was beginning to look as if she'd also lost her roommate.It was a run-of-the-mill Christmastime crime wave as far as Charlie Resnick could determine. A Pakistani cabdriver had been beaten and robbed; a half-dozen men and one woman were up on drunk-and-disorderly charges; there were fewer than the usual number of break-ins and burglaries. A possible child abuse case had made for some messy moments with Social Services, but all in all, things were under control.Until Dana Matthieson picked up her phone to report a missing roommate.Nancy Phelan had been missing for nineteen hours by the time the police were notified. As her blunt-spoken, no-nonsense father put it to Resnick: \"Forty-eight hours, that's what they reckon, isn't it? Forty-eight hours. If you don't find them in that, likely they're sodding dead!\"It was considerably more than forty-eight hours before the police had the chilling proof that Nancy Phelan had been abducted. And it was the New Year before the first tape arrived and they knew that they were dealing with a psychopath ... and possibly, a psychopathic killer.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Last Puzzle & Testament",
        "Authors": "By Hall, Parnell",
        "Description": "Emma Hurley's will has her greedy relatives climbing the walls when they learn the bulk of the old woman's fortune will go to the first one of her would-be heirs who can solve an elaborate puzzle. By the author of A Clue for the Puzzle Lady. 25,000 first printing.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Talented Mr. Ripley",
        "Authors": "By Highsmith, Patricia",
        "Description": "In a chilling literary hall of mirrors, Patricia Highsmith introduces Tom Ripley.  Like a hero in a latter-day Henry James novel, is sent to Italy with a commission to coax a prodigal young American back to his wealthy father. But Ripley finds himself very fond of Dickie Greenleaf. He wants to be like him--exactly like him.  Suave, agreeable, and utterly amoral, Ripley stops at nothing--certainly not only one murder--to accomplish his goal.  Turning the mystery form inside out, Highsmith shows the terrifying abilities afforded to a man unhindered by the concept of evil.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "All the Dead Lie Down",
        "Authors": "By Walker, Mary Willis",
        "Description": "When true-crime reporter Molly Cates's father died more than twenty-five years ago, his death was ruled a suicide, and Molly's obsessive efforts to prove otherwise led to nothing but anguish and the breakup of her family. Now new information comes her way and she reopens the old investigation with a vengeance, but the answers she finally wrests from the past leave her with a moral dilemma she never anticipated. Her quest becomes even more painful when Molly encounters a homeless woman who insists she knows about a secret plot to kill everyone in the Texas legislature. By the time she convinces Molly it's true, it may be too late to prevent disaster.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Armadale",
        "Authors": "By Collins, Wilkie",
        "Description": "",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Dover Pubns",
        "Price Starting With ($)": "41.75",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "River of Darkness",
        "Authors": "By Grady, James",
        "Description": "CIA agent Jud Stuart must defend himself from his own country after the Cold War because top authorities think he knows too much",
        "Category": " Fiction , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Tough Cookie",
        "Authors": "By Davidson, Diane Mott",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "I Still Miss My Man but My Aim Is Getting Better",
        "Authors": "By Shankman, Sarah",
        "Description": "Tuesday, eleven-thirty, a bright spring morning .... Just off the breakfast shift at Sweet Willie's meat-and-three, Shelby Kay Tate rushes down an old-fashioned Nashville sidewalk with Thursday night playing itself out in her mind. It's songwriters' night at the Sutler, a chance to serve up her big, bluesy voice to a crowd hungry for new country songs. Shelby's picturing herself onstage, a girl from Star, Mississippi, belting one clear against the back wall, when a familiar head of golden hair brings her out of her reverie.She'd know Leroy Mabry's puny frame from a mile away - and the last time she'd seen it was in divorce court. Though she wonders what the devil he's up to, she's got better things to think about. But back home, changing out of her work clothes, she's shocked to discover Leroy's idea of a calling card nestled among her lingerie. Momma always said her scream was a snake-strangler.Jeff Wayne Capshew, Metro Police patrolman for ten years, knows these stalking things can get serious fast. He's done all he can do for Shelby, but he can't shake her image from his mind ... her thick, wild, red-brown hair, her creamy valentine face. He feels compelled to protect her - and his instincts are right on. Leroy's been hitting the bourbon and soon shows up at Shelby's to convince her to come on home. When she flat out refuses, he begins to lose it.While Leroy sobers up in a cellblock, Shelby puts the pedal to the metal - aiming for her true heart's desire. The rest of her life takes the backseat, so there's no way for her to see what's coming. Leroy, fueled by his pent-up anger and fast-talking cellmate, gets out on bail and goes after her again; Jeff crosses her path a few too many times, going well beyond the call of duty; an eclectic mix of jealous women, scouting agents, and a big-name star ready for a big-time comeback make their own plans for Thursday night at the Sutler. Shelby's ready for a high-voltage evening but, blinded by her vision of bright lights and hot crowds, she's headed down a dangerous collision course.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Dover & the Unkindest Cut of All",
        "Authors": "By Joyce Porter",
        "Description": "",
        "Category": "",
        "Publisher": "Charles Scribner",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Restoration (Star Trek New Frontier: Excalibur, Book 3)",
        "Authors": "By David, Peter",
        "Description": "From the universe of Star Trek The Next Generation®  Peter David's bestselling novels of Star Trek: New Frontier have been a genuine publishing phenomenon. Now the series hits a new landmark with the first original hardcover to chronicle the adventures of Captain Mackenzie Calhoun and the valiant crew of the U.S.S. Excalibur. But the latest chapter begins with the future of Calhoun and his mission very much in doubt....  The Excalibur has been destroyed, the victim of insidious sabotage. Last seen on board only moments before it was blown to bits, Captain Mackenzie Calhoun was assumed lost with his ship. Now First Officer Elizabeth Shelby has been granted a command of her own, the U.S.S. Exeter, where she will discover exactly what kind of a captain she is meant to become.  But what about Calhoun? Unbeknownst to Starfleet, the resourceful Xenexian officer escaped the cataclysmic demise of the Excalibur, only to end up marooned on the primitive outback world of Yakaba. There he eventually befriends Shula, a woman with the strange and inexplicable ability to summon rain for her parched and struggling frontier community.  Shula's powers, however, have made her the target of jealous and avaricious enemies. They will stop at nothing to seize control of her special gifts -- or destroy them forever. Trapped on a hostile world, unable to contact Starfleet or even let Shelby and the others know he is still alive, Calhoun is drawn into a life-or-death struggle against relentless foes.  Full of unexpected twists and surprises as only Peter David can devise them, Restoration is a major turning point in the ongoing saga of Star Trek®: New Frontier.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Flesh & Blood: Erotic Tales of Crime and Passion",
        "Authors": "By Collins, Max Allan (EDT) and Gelb, Jeff (EDT)",
        "Description": "Sex and violence. They go together like greed and blackmail, and jealousy and murder. Now acclaimed masters and rising stars of today's crime and mystery fiction offer erotic tales, luring you into the seductively dangerous realm of flesh and blood.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mysterious Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Black Sand",
        "Authors": "By Caunitz, William J.",
        "Description": "United in a deadly struggle to recover a stolen ancient artifact are Det. Lt. Teddy Lucas of the NYPD and Maj. Andreas Vassos of the Hellenic National Police",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "The Rules of Silence (Lindsey, David)",
        "Authors": "By Lindsey, David L.",
        "Description": "Titus Cain is living an idyllic life most can only dream about. He's a self-made multimillionaire and founder of a successful software company. His employees adore him. He has a warm and loving wife. His home is a large but unpretentious country house atop ten acres of beautiful Texas Hill Country. And Titus is the kind of man who knows he has a lot to be thankful for.Then Cayetano \"Tano\" Luquin walks into his life one summer evening escorted by three armed assassins. They've come for Titus, but this is no ordinary kidnapping. There are rules. Strict rules. Simple rules. And they must be followed. Or there will be consequences.Titus is free to go on living as he pleases - but he must make a series of \"bad business investments\" totaling $64 million over the next four days. If he misses a single payment, people close to Titus die. If he tries to negotiate the ransom, people die. If he contacts the authorities or warns his friends and family of the danger, people die. Silence is his only option.He complies with Tano's demands, frantically scrambling to liquidate millions of his company's assets in time to meet the first deadline. Payment is made with just moments to spare, and Titus can breathe a sigh of relief. Or so he thinks.He's about to discover that Tano is driven by stakes higher than he had revealed, and that he's willing to be more vicious and merciless than Titus had ever imagined. Trapped in a criminal enterprise with uniquely terrifying rules, and realizing that every decision he makes, every word he speaks, and every move he makes could cost the life of someone he loves, Titus decides to fight back. His only hope is to find an ally as cold-blooded and determined as his enemy.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "18.3",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "A Deeper Sea",
        "Authors": "By Jablokov, Alexander",
        "Description": "The year is 2015 - and Ilya Sergeiivich Stasov, a colonel of the newly rebonded Russian Reorganized Republic, is in command of an underfunded dolplin research center. Driven by an overpowering sense of his own destiny and an obsessive need to reestablish ancient links with the intelligent sea-dwelling mammals, he pushes his experiments far beyond the limits of ethical science. Until one shocking act of cruelty brings astonishing results - and the barriers impeding human/delphine communication are broken down...forever.Five years later, the world's superpowers are at war - and Stasov has transformed his dolphins into deadly armored cyborgs designed to wreak havoc on the ocean-going vessels of his nation's enemies. But his control over the events he has set in motion is rapidly eroding. For the dolphins have their own agenda that transcends the petty hostilities and self-serving greed of human beings - leaving a guilt-stricken Ilya Stasov to suffer the torments of doubt and damnation in an altered reality...and ultimately rocketing him toward the stars.A masterwork of exhilarating intelligence and breathtaking vision, A DEEPER SEA Firmly places AIexander Jablokov in the upper echelon of science fiction luminaries. This brilliant and important novel of ideas and stunning imagination explores questions of duty, science, faith, love, morality and mortality...and speculates on humankind's future role in a dangerous predatory universe.",
        "Category": " Fiction , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "BAD SAMARITAN: A Novel of Suspense Featuring Charlie Peace",
        "Authors": "By Barnard, Robert",
        "Description": "It's bound to be a problem when a vicar's wife loses her faith. In a Robert Barnard novel it can be a source of amusement, dismay, contemplation, and even murder.The hideous neo-Gothic parish church of St. Saviour's may or may not be typical of the Church of England, but clergy wife Rosemary Sheffield definitely does not fit the usual mold. While walking in the park one day, she loses her faith. It just lifts away from her, leaving her feeling free and liberated.Should a woman who loses her faith continue to take an active role in church activities? Rosemary's not about to abdicate her position of power in the Mothers' Union to gossipy Florrie Harridance, not even when Florrie spreads rumors about Rosemary's supposed holiday fling, when she may have been too friendly with a young waiter named Stanko.Rosemary quickly squelches the gossip, but nasty rumors threaten to return when Stanko, a mysterious refugee from the former Yugoslavia, turns up one day at the vicarage, begging for Rosemary's help. In assisting Stanko, Rosemary opens herself and her family to all sorts of unwelcome attentions from inquisitive parishioners. Even her long-suffering husband, Paul, must wonder who Stanko is and what is the nature of Rosemary's involvement with him.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Engaged to Die (Death on Demand Mysteries, No. 14)",
        "Authors": "By Hart, Carolyn G.",
        "Description": "Love is in the air -- but alas, so is murder -- as award-winning author Carolyn Hart returns once again to the South Carolina Low Country island of Broward's Rock and sets her delightful married sleuths, the Darlings, on separate trails to a killer.Nothing warms the heart like romance -- even as the raw, cold winds of January chill the residents of Broward's Rock to the bone. But it's more than amore that intrigues mystery bookstore owner Annie Darling and her husband, Max, when wealthy, widowed art patron Virginia Neville announces her engagement to Jake O'Neill, her handsome, charming, and much younger fiancé, at a gala opening at the Neville gallery. Virginia's joyful announcement leaves many of the gathered -- especially certain members of her resentful extended stepfamily -- quite peeved. And one of the guests takes the news harder than the rest: before the last champagne bubble pops, murder disrupts the grand celebration.Quickly deputized by Acting Police Chief Billy Cameron, troubleshooter Max Darling dives headfirst into the icy investigative waters, leaving wife Annie somewhat out in the cold. But since her young assistant, Chloe, is a prime suspect -- and one of Jake O'Neill's most recent broken hearts -- Annie is determined to untangle the unholy marriage of jealousy, blackmail, gunplay, and malicious mischief ... even if it means crossing swords with hubby Max and placing herself in the perilous path of a cleverly sadistic stalker.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "The Big Dig: A Carlotta Carlyle Mystery",
        "Authors": "By Barnes, Linda",
        "Description": "Carlotta Carlyle, the six-foot-tall redheaded private investigator, thought that working undercover searching out fraud on Boston's Big Dig would be a challenging assignment. After all, the Big Dig, the creation of a central artery tunnel running beneath crowded downtown Boston is an engineering marvel, the largest urban construction project in modern history, a fourteen billion dollar boondoggle in the eyes of protesters. Playing a mild-mannered secretary working out of a construction trailer is not quite the thrill ride she had in mind.Carlotta decides to moonlight, taking on a missing persons case, but the search for Veronica James turns up one dead end after another. So do her fraud investigations on the Dig, and soon it looks like Carlotta has dug herself one big hole. But then a break-in at Veronica's coupled with the mysterious death of a construction worker on one of the sites stirs up a storm, and soon enough Carlotta is in over her head in more ways than one. Suspenseful, unpredictable, and vivid, The Big Dig is a startling return to form for one of the masters of the crime genre.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Greatest Evil (Father Koesler Mystery)",
        "Authors": "By Kienzle, William X.",
        "Description": "Just as Father Robert Koesler is getting ready to retire, a murder is committed, and his investigative instincts get the better of him as he strives to find the killer. 15,000 first printing.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Andrews McMeel Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "The Running Woman",
        "Authors": "By Carlon, Patricia",
        "Description": "A woman is observed running from Larapinta Creek Bridge; then the body of a very unpleasant fourteen-year old girl is found, drowned. Did the girl fall into the water by accident? Or was she pushed?Attractive, blonde Gabriel Endicott is an apparently wealthy young widow, a newcomer to Australia's Larapinta district where everyone else seems to know the neighbors very well indeed. The next day she receives a newspaper clipping in the mail about the drowning. The clipping ends with the enigmatic statement that the police are anxious to interview a woman seen running from the bridge over the creek, \"a young, fair-haired woman wearing a white dress.\"Gabriel doesn't know who would have sent her this news. Or the subsequent envelopes containing information about the death of young Carol Zamia. But she was wearing a cream-colored suit and had walked near the bridge that night. Now the police, the town, everyone, seems to suspect her of complicity in the girl's death. Either she pushed Carol or, aware of an accident, she failed to rescue her. Gabriel's efforts to free herself from suspicion only arouse more doubts as to her innocence, even in those who want most to believe in her.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Soho Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Seven Dials (Charlotte and Thomas Pitt)",
        "Authors": "By Perry, Anne",
        "Description": "In the first gray of a mid-September morning, Thomas Pitt, mainstay of Her Majesty's Special Branch, is summoned to Connaught Square mansion where the body of a junior diplomat lies huddled in a wheelbarrow. Nearby stands the tenant of the house, the beautiful and notorious Egyptian woman Ayesha Zakhari, who falls under the shadow of suspicion. Pitt's orders, emanating from the Prime Minister Gladstone himself, are to protect - at all costs - the good name of the third person in the garden: senior cabinet minister Saville Ryerson. This distinguished public servant, whispered to be Ayesha's lover, insists that she is as innocent as he is himself. Could it be true?In the dead man's less-than-stellar reputation, Pitt finds hope. But in ancient Alexandria, where the victim was once an army officer, hope grows dim. For there, Pitt receives intimations of deadly entanglements stretching from Egyptian cotton fields to Manchester cotton mills, from the noxious London slum known as Seven Dials to the madhouse called Bedlam.Meanwhile, in a packed courtroom at the Old Bailey, time is ticking away for Ayesha and Saville. With Pitt and his clients racing against the hangman, the trial reaches its pulse-pumping climax.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Suspicion of Rage",
        "Authors": "By Parker, Barbara",
        "Description": "Miami lawyers Gail Connor and Anthony Quintana have recently been married. Gail hopes to learn more about her new husband by seeing the island that still claims his heart. Anthony's loyalties are divided between his family, who believe in the Revolution, and his friends, dissident writers Jose Leiva and Yolanda Cabrera. No one is aware that Yolanda's idealistic twenty-year-old son, Mario, belongs to an underground group plotting the assassination of a top Cuban general.The night before Gail and Anthony leave for Havana, the CIA pays a visit. They want Anthony to deliver a message to his brother-in-law, General Ramiro Vega: He is in danger, and unless he defects, he could be killed.Why is Vega so important to the CIA? The answer leads to the discovery of a violent death, a secret terrorist threat, and a love from the past that could tear Gail and Anthony apart.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Mom, Apple Pie, and Murder",
        "Authors": "By Pickard, Nancy (EDT)",
        "Description": "An entertaining assortment of short fiction for Mother's Day features mystery tales with a maternal twist, from Nancy Pickard, Joan Hess, Lia Matera, Margaret Maron, Susan Dunlap, Ed Gorman, Jeremiah Healy, Gillian Roberts, and other notable authors. Original.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Sinister Pig",
        "Authors": "By Hillerman, Tony",
        "Description": "",
        "Category": "",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Earthquake in Metropolis! (Superman Returns)",
        "Authors": "By Sky, David E.",
        "Description": "Begin your reading adventures with your favorite super hero. This exciting book format is ideal for early readers with 32 pages of easy to understand words, short sentences, and colorful artwork straight from the movie! Your child will enjoy the story line, illustrations and the adventures of reading about the world’s most popular super hero.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Superman Returns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Busy Woman's Cookbook",
        "Authors": "By McFall, Gene and McFall, Sharon",
        "Description": "",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Newman Marketing",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Finding Your Religion: When the Faith You Grew Up With Has Lost Its Meaning",
        "Authors": "By McLennan, Scotty",
        "Description": "\"Starting with my own experiences in college in the 1960s and early 1970s, I have learned a great deal about how people lose and find their own religion.  I've come to see it very much as an ongoing process that never stops.  For many people, the faith they grew up with loses its meaning during adolescence.  Others who never had any faith in childhood begin exploring religion for the first time in adolescence or young adulthood.  I've come to realize that there are identifiable stages of spiritual development that people go through, no matter what their religious tradition is or isn't.  Just as we grow emotionally and intellectually over the years, so we grow spiritually, if we allow ourselves.-- from the bookTufts University Chaplain Scotty McLennan (the inspiration for Doonesbury's Reverend Scot Sloan) offers an indispensable guidebook to those seeking a new spiritual path or wishing to reconnect to the religion of their youth.  He reassures anyone at a spiritual crossroads--those who have become disillusioned with or even abandoned the religion of their youth--that finding a relevant and fulfilling spirituality is a process of understanding one's place in any of six universal stages of faith: Magic, Reality, Dependence, Independence, Interdependence, and Unity.  He offers signposts and checklists for determining where readers are own their own spiritual journey, and for helping them grow and develop.  By recognizing a progression of steps toward a faith of one's own choosing, McLennan explains, one can more fully open one's soul to its spiritual destiny.",
        "Category": " Religion , Spirituality",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "The Proposal (The English Garden Series #1)",
        "Authors": "By Wick, Lori",
        "Description": "Distraught to learn that her wealthy but tyrannical brother has been granted custody of three children, Lydia and her husband Frank seek offer advice to William, who had not anticipated the challenges of raising children but finds the experience offering unexpected rewards. Original.",
        "Category": " Fiction , Religious",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Getting Started in Drawing",
        "Authors": "By Blake, Wendon",
        "Description": "Offers step-by-step demonstrations of how to create landscapes, still lifes, and portraits, and introduces basic tools and techniques for working with pencil, chalk, and charcoal",
        "Category": " Art , Techniques , Drawing",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "The Autobiography of an Ex-Coloured Man (American Century)",
        "Authors": "By Johnson, James Weldon",
        "Description": "James Weldon Johnson's emotionally gripping novel is a landmark in black literary history and, more than eighty years after its original anonymous publication, a classic of American fiction. The first fictional memoir ever written by a black, The Autobiography of an Ex-Coloured Man influenced a generation of writers during the Harlem Renaissance and served as eloquent inspiration for Zora Neale Hurston, Ralph Ellison, and Richard Wright. In the 1920s and since, it has also given white readers a startling new perspective on their own culture, revealing to many the double standard of racial identity imposed on black Americans.Narrated by a mulatto man whose light skin allows him to \"pass\" for white, the novel describes a pilgrimage through America's color lines at the turn of the century--from a black college in Jacksonville to an elite New York nightclub, from the rural South to the white suburbs of the Northeast. This is a powerful, unsentimental examination of race in America, a hymn to the anguish of forging an identity in a nation obsessed with color. And, as Arna Bontemps pointed out decades ago, \"the problems of the artist [as presented here] seem as contemporary as if the book had been written this year.\"",
        "Category": " Fiction , Literary",
        "Publisher": "Hill and Wang",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Utz",
        "Authors": "By Chatwin, Bruce",
        "Description": "An elegant novel set in Prague about the possibility of freedom in an unfree state, from the acclaimed author of The Songlines and In PatagoniaUtz collects Meissen porcelain with a passion. His collection, which he has protected and enlarged through both World War II and Czechoslovakia's years of Stalinism, numbers more than 1,000 pieces, all crammed into his two-room Prague flat.Utz is allowed to leave the country each year, and although he has considered defection, he always returns. He cannot take his precious collection with him, but he cannot leave it, either. And so Utz is as much owned by his porcelain as it is owned by him, as much of a prisoner of the collection as of the Communist state.A fascinating, enigmatic man, Kaspar Utz is one of Bruce Chatwin's finest creations. And his story, as delicately cast as one of Utz's porcelain figures, is unforgettable.",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "The Secret Country",
        "Authors": "By Dean, Pamela C.",
        "Description": "The first book in the magical, wonderfully interwoven Secret Country trilogy. They thought it was a game, but it was its own world...  Each vacation for the past nine years, cousins Patrick, Ruth, Ellen, Ted, and Laura have played a game they call the “Secret”—an invented, scripted world full of witches, unicorns, a magic ring, court intrigue, and the Dragon King. In the Secret, they can imagine anything into reality, and shape destiny. Then the unbelievable happens: by trick or by chance, they actually find themselves in the Secret Country, their made-up identities now real. The five have arrived at the start of their games, with the Country on the edge of war. What was once exciting and wonderful now looms threateningly before them, and no one is sure how to stop it… or if they will ever get back home.   \"An intricate sparkling web of intrigue and magic. One of my very favorites.”—Patricia C. Wrede, author of Dealing with Dragons",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Firebird",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Roy Blount's Book of Southern Humor",
        "Authors": "By Blount, Roy, Jr.",
        "Description": "The richest vein of American humor—the broadest, the earthiest, the most outrageously inventive—can be found below the Mason-Dixon line, where the comic impulse just naturally seems allied to the native storytelling genius, and the sacred and the profane are on the closest of terms.Roy Blount, Jr., himself a native Southerner and on paper and in person one of the funniest men in America, has dug deep and foraged far and wide to produce the definitive treasury of Southern humor for our time. It comprises more than 150 selections, including stories, sketches, essays, poems, memoirs, and blues and C&W lyrics, arranged under such headings as \"My People, My People (How's Your Mama 'n Them?),\" \"Here Be Dragons, or, How Come These Butterbeans Have an Alligator Taste?\" and \"Lying and Other Forms of Communication.\" The wildly heterogeneous roster of contributors range from such classics as William Faulkner, Mark Twain, Flannery O'Connor, Zora Neale Hurston, and Eudora Welty to such brilliantly funny contemporaries as Molly Ivins, Dave Barry, Harry Crews, Ishmael Reed, Barry Hannah, Bailey White, and Roy Blount, Jr., his very own self.If you could stop laughing long enough you'd probably call Roy Blount's Book of Southern Humor a classic. And you'd be right.",
        "Category": " Humor , Form , Essays",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Wash Your Hair with Whipped Cream: And Hundreds More Offbeat Uses for Even More Brand-Name Products",
        "Authors": "By Green, Joey",
        "Description": "With more than 30 all new brand-name products and their wacky, alternative uses, Wash Your Hair with Whipped Cream exposes the secret lives of popular products you've got in the kitchen, medicine cabinet, and workshop from Alka-Seltzer to Wonder Bread.As you stroll down Main Street, U.S.A., with household wizard Joey Green, you'll also learn the histories behind the products, how they got their names, strange facts about them, and, as always, the bizarre ways they can be used. Filled to the brim with hundreds of remarkable uses for your favorite products, this delightfully quirky guide to solving life's everyday problems with everyday products will leave you chuckling in the supermarket aisles.",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Literary Circles of Washington",
        "Authors": "By Schafer, Edith Nalle",
        "Description": "",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "Starrhill Pr",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Tidewater Dynasty: The Lees of Stratford Hall",
        "Authors": "By Roberts, Carey and Seely, Rebecca",
        "Description": "Three generations of the Lee family--from Thomas Lee, the founding father, to Robert E. Lee, destined to become the greatest member of the family--make their mark on American history",
        "Category": " History , Americas (North, Central, South, West Indies)",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1981"
        }
    },
    {
        "Title": "The Ancient Historians",
        "Authors": "By Grant, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Book of Heaven",
        "Authors": "By Minkoff, Harvey",
        "Description": "A fascinating exploration of Heaven, its lore, legends, and wonders, featuring questions and information covering everything from near-death experience to the meaning of hell.",
        "Category": " Religion , Inspirational",
        "Publisher": "Testament",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "The Wit and Humor of Oscar Wilde (Dover Humor)",
        "Authors": "By Wilde, Oscar",
        "Description": "More than 1000 ripostes, paradoxes, and epigrams on sin, society, genius, wealth, men, women, religion, America, education, and smoking: \"Work is the curse of the drinking classes,\" \"I can resist everything except temptation,\" etcetera. Also excerpts from his trial testimony, where the tragedy implicit in Wilde's humor is nowhere more vivid.",
        "Category": " Humor , Form , Anecdotes & Quotations",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1959"
        }
    },
    {
        "Title": "The Measure of a Man: 20 Attributes of a Godly Man",
        "Authors": "By Getz, Gene A.",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Regal Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Cleopatra'S Nose, Twinkie Defense and 12, 000 Other Phrases",
        "Authors": "By Agel",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall Press",
        "Price Starting With ($)": "14.44",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "The Heart Is A Lonely Hunter: A Novel",
        "Authors": "By McCullers, Carson (NA)",
        "Description": "With the publication of her first novel, The Heart is a Lonely Hunter, Carson McCullers, all of twenty-three, became a literary sensation. With its profound sense of moral isolation and its compassionate glimpses into its characters&#39; inner lives, the novel is considered McCullers&#39; finest work, an enduring masterpiece first published by Houghton Mifflin in 1940. At its center is the deaf-mute John Singer, who becomes the confidant for various types of misfits in a Georgia mill town during the 1930s. Each one yearns for escape from small town life. When Singer&#39;s mute companion goes insane, Singer moves into the Kelly house, where Mick Kelly, the book&#39;s heroine (and loosely based on McCullers), finds solace in her music. Wonderfully attuned to the spiritual isolation that underlies the human condition, and with a deft sense for racial tensions in the South, McCullers spins a haunting, unforgettable story that gives voice to the rejected, the forgotten, and the mistreated—and, through Mick Kelly, gives voice to the quiet, intensely personal search for beauty. Richard Wright praised Carson McCullers for her ability \"to rise above the pressures of her environment and embrace white and black humanity in one sweep of apprehension and tenderness.\" She writes \"with a sweep and certainty that are overwhelming,\" said the New York Times. McCullers became an overnight literary sensation, but her novel has endured, just as timely and powerful today as when it was first published. The Heart is a Lonely Hunter is Carson McCullers at her most compassionate, endearing best.",
        "Category": " Fiction , Literary",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2022"
        }
    },
    {
        "Title": "Rip-Roaring Russell (Riverside Kids)",
        "Authors": "By Hurwitz, Johanna and Tilley, Debbie (ILT)",
        "Description": "Nobody asked Russell if he wanted a little sister!Russell's enjoying his first year in school. The trouble is his baby sister, Elisa. She's only a few months old, and she's a pest! But sometimes, as Russell is about to discover, it's not so bad to have a little sister. Because that also means he's something special: a big brother!",
        "Category": " Juvenile Fiction , Family , Siblings",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Pope John Paul II: His Essential Wisdom",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Fall River Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Lizzie #9: Just Like Lizzie: Lizzie McGuire: Just Like Lizzie - Book #9",
        "Authors": "By Jasmine Jones",
        "Description": "",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Preface to Bonhoeffer: The Man and Two of His Shorter Writings",
        "Authors": "By Godsey, John D.",
        "Description": "",
        "Category": "",
        "Publisher": "Augsburg Fortress Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1979"
        }
    },
    {
        "Title": "Managing to Be Wealthy",
        "Authors": "By Sestina, John E.",
        "Description": "Well, maybe  wealthier  would be more accurate. Financial planner Sestina gives direct advice, covering basic financial concepts, how to figure out cash flow and needs, plan for children's college education and for retirement, and understand insurance, liabilities, home- ownership, taxes, investments, estate planning.  About 45 pages are devoted to worksheets. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Kaplan Business",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Baby Names Keepsake",
        "Authors": "By Geddes, Anne",
        "Description": "",
        "Category": " Family & Relationships , General",
        "Publisher": "Cedco Pub",
        "Price Starting With ($)": "5.66",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Shameless Shortcuts: 1,027 Tips and Techniques That Help You Save Time, Save Money, and Save Work Every Day!",
        "Authors": "By Bradley, Fern Marshall (EDT)",
        "Description": "Ingenious ways to save precious minutes and hours on daily tasks and household routinesShort on time but long on chores? If your housework is driving you crazy, you need to get shameless. Shameless Shortcuts, that is. This clever book gives you the secrets you need to do the job you want--while saving time, money, and effort.In Shameless Shortcuts you will discover:  o The top 10 shortcuts for the 5 worst time-wasters  o Strategic ways to use email to save time  o 5 simple tax return shortcuts that save you time--and money  o Fast fixes for clogged toilets, blocked drains, and faulty faucets  o Gift ideas that take 2 minutesThe editors of Yankee magazine have collected the most ingenious, most effective ideas for snipping minutes from the activities of daily life. Time-pressured readers will appreciate the no-nonsense approach: every shortcut is explained in 200 words or less. Just 2 minutes of reading translates into practical knowledge that can free time immediately, whether it's a cooking tip that saves 5 minutes per meal prepared, a shopping shortcut that shears 10 minutes a trip when running errands, or a daily yard-scouting ritual that reduces yard work by up to 2 hours a week. After a single 30-minute session reading Shameless Shortcuts, you can save as much as 30 minutes a day--every day! And that time is yours to use--any way you like!",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The Mind of God: The Scientific Basis for a Rational World",
        "Authors": "By Davies, P. C. W.",
        "Description": "Throughout history, humans have dreamed of knowing the reason for the existence of the universe. In The Mind of God, physicist Paul Davies explores whether modern science can provide the key that will unlock this last secret. In his quest for an ultimate explanation, Davies reexamines the great questions that have preoccupied humankind for millennia, and in the process explores, among other topics, the origin and evolution of the cosmos, the nature of life and consciousness, and the claim that our universe is a kind of gigantic computer. Charting the ways in which the theories of such scientists as Newton, Einstein, and more recently Stephen Hawking and Richard Feynman have altered our conception of the physical universe. Davies puts these scientists' discoveries into context with the writings of philosophers such as Plato. Descartes, Hume, and Kant. His startling conclusion is that the universe is \"no minor byproduct of mindless, purposeless forces. We are truly meant to be here.\" By the means of science, we can truly see into the mind of God.",
        "Category": " Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Charles Spurgeon (Heroes of the Faith)",
        "Authors": "By Harmon, Dan",
        "Description": "",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Barbour Pub Inc",
        "Price Starting With ($)": "13.98",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Lacy",
        "Authors": "By Palmer, Diana",
        "Description": "Cole Whitehall had asked Lacy Jarrett to wait for him. But after the war, he returned to the rambling Whitehall cattle ranch a changed man, the promise of lasting love replaced by a cold, hard distance. Lacy yearned to reignite the once inseparable couple's unquenched passion.Unwittingly compromised into marriage, the handsome Texan refused to come under Lacy's thumb. But the hard press of aching desire had her longing to learn the secrets Cole harbored in his heart. Tormented, she wouldn't let him shoulder the burden alone, and soon the pursuit of an endless love would burn bright enough to set their world ablaze.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Match Made In Heaven",
        "Authors": "By Mitchell, Bob",
        "Description": "A Golf Match You'll Never ForgetLying on An operating table, about to undergo emergency heart surgery, Elliott Goodman hears the voice of God--as in The Almighty--speaking to him. God, it seems, has a last-second wager for Elliott, challenging him to an eighteen-hole golf match. If Elliott wins, he'll be saved. If he loses. . . God sends down eighteen legendary opponents to play against Elliott and to hopefully teach him a few tricks along the way. From Leonardo da Vinci (nice clubs) to Marilyn Monroe (nice. . .everything), Babe Ruth (pass the hot dogs), Abraham Lincoln (cheater!), and fourteen other luminaries, including Moses, John Lennon, Joan of Arc, Picasso, W.C. Fields, Gandhi, and Shakespeare, Elliott squares off against some of the most extraordinary people who've ever lived. As shots are analyzed, balls enter bunkers, and Freud drives the cart (control freak), Elliott has a chance to examine his life and his form, to see what he can correct or improve before facing his ultimate adversary.Big-hearted and delightfully original, Match Made in Heaven is a timeless tale about finding joy and inspiration on the greatest of all courses--life.\"An engaging and often hilarious account of a star-studded round.\" --Bob Costas \"A great read. . .Bob Mitchell writes with wit, intelligence, and passion.\" --Bill Bradley\"Bob Mitchell's masterpiece reveals his genius for weaving life's wonderful lessons within a magical golf story.\" --Ann Liguori",
        "Category": " Fiction , Sports",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Everything Wine Book (Everything (Cooking))",
        "Authors": "By May, Danny and Sharpe, Andy",
        "Description": "A primer for those interested in wine making, tasting, or drinking teaches readers about the categories and types of wine, all the various grape varietals, and how to pair wine with all different kinds of food, from burgers to French cuisine. Original.",
        "Category": " Cooking , Beverages , Alcoholic , Wine",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Success With the Gentle Art of Verbal Self-Defense",
        "Authors": "By Elgin, Suzette Haden",
        "Description": "Demonstrates how to identify, avoid, and defuse verbal attacks, tells how to handle irate customers and manipulative bosses, and describes techniques for improving communication",
        "Category": " Psychology , General",
        "Publisher": "Prentice Hall Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Inside Out",
        "Authors": "By Crabb, Lawrence J.",
        "Description": "",
        "Category": "",
        "Publisher": "NavPress",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "The Imperial Way: By rail from Peshawar to Chittagong",
        "Authors": "By Theroux, Paul and McCurry, Steve",
        "Description": "Chronicles an illustrated railway journey through India, from Peshawar, full of Afghan refugees, through Agra, home of the Taj Mahal, to flooded Chittagong on the Bay of Bengal",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Houghton Mifflin Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Becoming a Heroine: Reading about Women in Novels",
        "Authors": "By Brownstein, Rachel M.",
        "Description": "Analyzes the image of women and the theme of the choice of a husband in the classic novels by English authors, such as Jane Austen, Charlotte Bronte, and Virginia Woolf",
        "Category": " Fiction , Classics",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "The Young Black Stallion: A Wild and Untamable Spirit!",
        "Authors": "By Farley, Walter and Farley, Steven",
        "Description": "In this prequel to The Black Stallion, we learn the story of the Black before he was shipwrecked with Alec Ramsay. Born in the mountain stronghold of Sheikh Abu Ishak, the colt shows great promise. During a band of robbers’ attempt to steal him, the colt escapes and learns to survive on his own in the high mountains. Will he ever find his way home?",
        "Category": " Juvenile Fiction , Animals , Horses",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Power Play (The Hardy Boys Casefiles, No. 50)",
        "Authors": "By Dixon, Franklin W.",
        "Description": "Posing as lab assistants in order to protect a superpowered solar cell from espionage, Frank and Joe are confronted by a deadly mystery when someone kills a scientist and steals the cell",
        "Category": " Young Adult Fiction , Family , Siblings",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Steven Caney's Invention Book",
        "Authors": "By Caney, Steven",
        "Description": "Kids are natural inventors, bursting with notions so crazy they just might work. Chester Greenwood was just a boy when his big cold ears prompted him to fashion wire and fur into the world's first earmuffs. Caney shows how to get into \"an inventing frame of mind\" and how to look at everyday objects in new ways, as clues to fresh ideas. From keeping a good notebook to setting up a workshop, from building the prototype to applying for a patent, Steven Caney covers it all, even showing the young entrepreneur how to market an invention successfully. To get the creativity flowing, here are also hundreds of fantasy ideas that still need to be invented: everything from a temperature-regulating straw to sunburn alarm tabs. There are also extensive plans for twenty projects kids can build from ordinary household items. And to demonstrate the many sources of creative thinking, Caney tells the stories behind 25 landmark American inventions. Selection of the Book-of-the-Month Club. Suitable for ages 8-13. 215,000 copies in print.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Inquisition: The Hammer of Heresy",
        "Authors": "By Burman, Edward",
        "Description": "",
        "Category": "",
        "Publisher": "Dorset Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Cathedrals and Castles: Building in the Middle Ages",
        "Authors": "By Erlande-Brandenburg, Alain and Stonehewer, Rosemary (TRN)",
        "Description": "Photographs, drawings, and details of manuscript illuminations tell the story of the birth of the building trades and the changes in society they reflected, revealing how Gothic cathedrals, great castles, bridges, houses, and city walls were designed and built. Original.",
        "Category": " Architecture , Buildings , Religious",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Why You Say It: The Fascinating Stories Behind Over 600 Everyday Words and Phrases",
        "Authors": "By Garrison, Webb B.",
        "Description": "The Fascinating stories behind over 600 everyday words and phrases such as...Shindig - A veteran square dance caller will tell you that bruised shins result from the swigging feet of beginning dancers. A dance that leaves telltale marks on the lower legs of participants is ashindig.Alibi - The word is taken straight from Latin and means \"elsewhere.\" The perfect \"alibi\" is to prove one was \"elsewhere\" when the deed was done.And many more...",
        "Category": " Language Arts & Disciplines , Linguistics , Etymology",
        "Publisher": "Thomas Nelson Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "The Chinese System of Food Cures: Prevention and Remedies",
        "Authors": "By Lu, Henry C.",
        "Description": "A Chinese professor of medicine reveals how you can prepare ordinary foods to relieve and cure hundreds of ailments; fresh cherries for laryngitis, celery juice and honey to lower cholesterol, beef kidney to improve male potency, and much more. “A fascinating book.”—Holos Institute of Health.",
        "Category": " Health & Fitness , General",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Experiencing the Passion of Jesus: A Discussion Guide on History's Most Important Event",
        "Authors": "By Strobel, Lee and Poole, Garry",
        "Description": "A discussion guide addressing the death and resurrection of Jesus offers commentary based on biblical teaching to explain the significance of Jesus' death.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    }
]