[
    {
        "Title": "Blue Sea Cookbook",
        "Authors": "By Alberson, Sarah D. and Porter, Eleanor (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Hastings house",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Discover the Backroads of the South",
        "Authors": "By Seidenberg, Robert",
        "Description": "Shows and describes Southern festivals, roadside stands, historic homes, farms, parks, and trails",
        "Category": " History , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.87",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "The Pact: A Love Story",
        "Authors": "By Picoult, Jodi",
        "Description": "Friendship, loyalty, lifelong love -- and teenage suicide. A riveting, timely, and terrifying novel from an acclaimed writer who skillfully intertwines the intimate perceptions of Anne Tyler with the dramatic tension of John Grisham The Golds and the Hartes, neighbors for eighteen years, have always been inseparable. So have their children-and it's no surprise that in high school Chris and Emily's friendship blossoms into something more. But the bonds of family, friendship, and passion-which had seemed so indestructible -- suddenly threaten to unravel in the wake of unexpected tragedy. When midnight calls from the hospital come in, no one is ready for the truth. Emily is dead at seventeen from a gunshot wound to the head. There's a single unspent bullet in the gun that Chris pilfered from his father's cabinet-a bullet that Chris tells police he intended for himself. But a local detective has doubts about the suicide pact that Chris describes.This extraordinary, heart-rending novel asks questions that every parent faces: How much do we know about our children? Our friends? What if . . .? As its chapters unfold, alternating between an idyllic past and an unthinkable present, The Pact paints an indelible portrait of families in anguish . . . and creates an astonishingly suspenseful courtroom drama, as Chris finds himself on trial for murder.It's rare to find a writer who combines Alice Hoffman's gift for evoking everyday life in pellucid prose with a remarkable ability to create a legal page-turner that will keep you up all night reading, but this is such a book. The Pact rings true: wonderfully observed, truly moving, frightening, and utterly impossible to put down.",
        "Category": " Fiction , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Adventures at the Auction: The Ultimate Guide to Buying and Selling at Auction -- In Person and Online",
        "Authors": "By Santow, Dan and Hindman, Leslie",
        "Description": "Auctions are a great way to start or add to a collection, furnish a home, purchase a special wedding gift, or own a unique piece of history. And whether they are traditional auctions or online auctions, they can be exciting entertainment, too. But for the many people who are intimidated by auction fears, getting started is half the battle. Leslie Hindman, the Chicago auctioneer and host of two HGTV shows, At the Auction and Appraisal Fair, now shares her inspiring advice on smart buying and selling in Adventures at the Auction.As one of America's best-known auctioneers, Leslie Hindman provides not only what auction-goers need to know, but also reassurance and practical information. She arms readers with the ten most common auction myths, the five most common auction blunders, and the five most important criteria for determining value, along with simple auction basics and hundreds of tips on strategy. She covers buying and selling from beginning to end, with ideas that will inform the seasoned buyer as well as the novice. Then, to inspire readers with the possibilities, she identifies twelve popular categories where bargains still exist, from books to silver to timepieces. Along the way, she entertains with anecdotes from her own twenty-five-year career as an auctioneer. Best of all, for those who want to attend auctions only at home, Hindman includes \"On the Internet\" sections throughout the book, describing the joys and pitfalls of buying and selling online. As a bonus, she offers glossaries of terms for both traditional and online auctions, a list of Internet acronyms, a directory of auction houses, and a color section that shows, step by step, item by item, what to look for when checking out a potential purchase.Whether you want to go to an auction or log onto eBay, Leslie Hindman's Adventures at the Auction is an invaluable companion.From the Hardcover edition.",
        "Category": " Antiques & Collectibles , General",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Shadow of God: A Novel of War and Faith",
        "Authors": "By Goodman, Anthony A.",
        "Description": "A tremendously vivid historical encounter becomes a larger-than-life canvas for this brilliant saga. The year is 1522. Two great leaders, twenty-five-year-old Suleiman the Magnificent, the absolute ruler of the mighty Ottoman Empire, and Philippe de L'Isle Adam, the grisly, fifty-eight-year-old Grand Master of the Knights of Rhodes, come to war on the Greek island of Rhodes. For 145 days, Philippe and 500 European Knights fight to protect their fortressed city and withstand an assault of nearly 200,000 men from Suleiman's army, in a battle that becomes the historic hallmark for siege warfare.Authentic in all its historical detail, The Shadow of God evokes a seismic clash of cultures: Muslim versus Christian, the Ottoman Empire versus the last remaining Knights of the Crusades and, most important, two of the most powerful men of their time. Embedded in this fictional account is the secret marriage of a lovely Jewish nurse to her Christian French Knight, as well as the forbidden love of the Grand Master for the beautiful Helene. An epic of bravery and courage, The Shadow of God weaves a tapestry of beauty, terror and triumph set in a forgotten time of brutality and courage, loyalty and honor.\"So vividly rendered that historical fiction fans and medieval history enthusiasts will be crossing their fingers for a follow-up.\"-Publishers Weekly\"An engaging and well-written fictional account of the Ottoman Turks' 145-day siege of the Greek island of Rhodes.\"-Library Journal",
        "Category": " Fiction , African American , General",
        "Publisher": "Sourcebooks Landmark",
        "Price Starting With ($)": "5.98",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Frumpy to Foxy in 15 Minutes Flat: Style Advice for Every Woman",
        "Authors": "By Rubin, Elycia and Mauceri, Rita",
        "Description": "Frumpiness is a fact of life…frizzy hair days, blotchy skin days, big and bloated days. But women everywhere can take solace in the fact that they're not the only ones who get \"the frumps\"—EVERYONE does! Women’s magazines have built an enormous business around this fact, from Glamour's catty \"Dos and Don'ts\" feature to the recent Star magazine cover feature on \"Stars Without Makeup.\"Elycia Rubin and Rita Mauceri to the rescue! Contrasting frumpy \"before\" illustrations and commentary with the foxy \"after\" pics, Elycia and Rita show you how to avoid looking frumpy in all situations.Frumpy to Foxy in 15 Minutes Flat shows women how to ditch the frumpies and drape themselves in foxy for every life situation, from working out to going out.",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "Fair Winds Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Superfudge",
        "Authors": "By Blume, Judy",
        "Description": "Peter describes the highs and lows of life with his younger brother Fudge.",
        "Category": " Juvenile Fiction , Family , Siblings",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Orchid Blues (Holly Barker Novels)",
        "Authors": "By Woods, Stuart",
        "Description": "Holly is on her way - with her steady beau, Jackson Oxenhandler - to a once-in-a-lifetime celebration, when the festivities are shattered by a brutal crime that takes place too close to home. A highly disciplined team of men hits a local Orchid Beach, Florida, business, and the waves from the robbery nearly capsize Holly's life. She vows to find the culprits - who have been careful enough to leave nothing behind except the corpse of an innocent bystander - and soon she discovers evidence that leads her into the midst of a clan whose members are as mysterious as they are zealous. Holly's father, Ham, a retired Army chief master sergeant, is her ticket into the strange world this group inhabits, and what Ham learns there boggles the minds of Holly and her FBI contact, Harry Crisp.Holly and Ham are sucked into a whirlpool of crazed criminality, and in the end, even the FBI can do little to help them. This time, Holly, Ham, and Daisy are on their own, and they wouldn't have it any other way.",
        "Category": " Fiction , Literary",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Backyard Design: Making the Most of the Space Around Your House",
        "Authors": "By Bussolini, Karen (PHT) and Breskend, Jean Spiro",
        "Description": "",
        "Category": " Gardening , Landscape",
        "Publisher": "Bulfinch",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Insalate: Authentic Italian Salads for All Seasons",
        "Authors": "By Eskite, Richard (PHT), Simon, Susan, and Bellati, Manfredi (PHT)",
        "Description": "Since the first insalata on Sicily, tossed together from the wild herbs and greens that covered the island, Italians have been enjoying the bounty of their fields and waters, creating fresh, flavorful salads. Insalate offers a delectable sampler of refreshing, authentic Italian favorites accompanied by enchanting photographs of open-air markets, artisans, and vineyards. Organized by season to take advantage of produce picked at the peak of ripeness, over 50 simple yet exuberant recipes use fruits and vegetables to create glorious palate-pleasers. With selections ranging from classic to contemporary, served as appetizers, main courses, or the crisp finale to a meal, Insalate offers acolorful way to recreate the flavors of Italy in your very own salad bowl.",
        "Category": " Cooking , Courses & Dishes , Salads",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "A Surprise Garden (Disney Winnie the Pooh; It's Fun to Learn, No. 1)",
        "Authors": "By Nancy Parent",
        "Description": "",
        "Category": "",
        "Publisher": "Disney",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Disney Winnie the pooh I Spy Shapes (6)",
        "Authors": "By victoria saxon",
        "Description": "",
        "Category": "",
        "Publisher": "advanced publishers,L.C",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Clean Like a Man: Housekeeping for Men (and the Women Who Love Them)",
        "Authors": "By McNulty, Tom",
        "Description": "Most men have a problem with cleaning house: They don't konw how to do it, and they don't particularly want to learn. The results are usually a messy house or a bitter spouse—or both. Clean Like a Man is the solution. Written specifically for the attention-challenged and motivation-impaired male, it's the first and only housekeeping primer that tells men how to clean the house their way: getting everything done quickly and easily, without getting to Felix Unger about it. It's such a great approach to housekeeping that women will love it too.",
        "Category": " House & Home , Cleaning, Caretaking & Organizing",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "I'll Be Watching You: A Novel",
        "Authors": "By Kane, Andrea",
        "Description": "The author of three New York Times bestsellingmasterworks of tense and unrelenting drama,the phenomenal Andrea Kane returnswith an electrifying thriller that takes romanticsuspense to a breathtaking new level\"I'll be watching you ... \" the cryptic e-mail read.Taylor Halstead, psychologist and successful radio personality, is terrified that she'll never be safe again. Coming on the heels of a series of tragic and terrible events, the e-mail sends chills racing up her spine. Her safe, secure world has already been violated by her cousin Stephanie's boyfriend, Gordon Mallory, in her own apartment. Only the door buzzer and Stephanie's intervening voice rescue her, but not before Gordon promises to return. Soon after, he is killed along with Stephanie in an inexplicable explosion aboard his yacht. Or is he?The e-mail is just the beginning. The terror campaign escalates when an electronically disguised voice on Taylor's telephone threatens to kill her, and her life becomes a nightmare. It seems the only one she can turn to is attorney Reed Weston, her confidant, protector, and, ultimately, lover. But is Reed's determination to protect her enough to avert disaster? And can Taylor trust Gordon's identical twin, Jonathan, who always seems to show up when she least expects him?Grief and dread unravel Taylor's sanity, playing tricks with her mind and heart. Someone out there wants her dead -- a crazed fan or the troubled teenage boy she's been counseling or, impossibly, Gordon himself. His vow to return and those final menacing words -- \"I'll be watching you\" -- haunt her day and night. Whoever is out there is coming closer, and Taylor Halstead has nowhere to run and nowhere to hide.",
        "Category": " Fiction , Romance , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "110%: 110 Strategies For Feeling Great Every Day",
        "Authors": "By Armstrong, Lance (FRW), Croce, Pat, and Lyon, Bill",
        "Description": "Presenting: Wise words and simple strategies to help elevate your mood and your attitude, from Pat Croce, president of the Philadelphia 76ers! A top motivational speaker and author of the New York Times best-selling I Feel Great and You Will Too!, Croce shares simple techniques to help remove psychological blocks and set the stage to stimulate positive thoughts. \"[Croce] has a very personal and persuasive way of expressing his ideas on self-improvement and self-promotion,\" notes Booklist. \"His energy, enthusiasm, and ease in telling a funny story are on gregarious display,\" raves the Philadelphia Inquirer. Pat Croce's inspring new 110% is a fun, fast read that packs the most important motivating message of all: Be happy, feel great. With advice like this, who has time to feel blue?",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "One More River: A Noah's Ark Counting Book",
        "Authors": "By Paley, Joan",
        "Description": "In an adaptation of a traditional spiritual, the animals enter Noah's Ark in increasing numbers, from one elephant to ten hens. By the creator of Little White Duck.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Megan Tingley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Merchants of Treason: America's Secrets for Sale",
        "Authors": "By Allen, Thomas B. and Polmar, Norman",
        "Description": "A survey of U.S. intelligence failures from the Pueblo incident to the present",
        "Category": " Political Science , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "On the Shoulders of Giants: New Approaches to Numeracy",
        "Authors": "By Steen, Lynn Arthur (EDT)",
        "Description": "This book from the Mathematical Sciences Education Board of the National Research Council presents new ways to teach mathematics to a changing society, as well as new approaches to thinking about the field of mathematics and the world in general. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "National Academies Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Law of torts",
        "Authors": "By Edgar, David Stewart",
        "Description": "",
        "Category": "",
        "Publisher": "Holton-Palmetto press, inc",
        "Price Starting With ($)": "24.73",
        "Publish Date": {
            "Month": "January",
            "Year": "1936"
        }
    },
    {
        "Title": "The Gentle Art of Making Enemies (Dover Fine Art, History of Art)",
        "Authors": "By (WHISTLER, James McNeill)",
        "Description": "Whistler's Gentle Art, a classic in the literature of insult and denigration, might well be subtitled \"The Autobiography of a Hater,\" for it contains the deadly sarcasm and stinging remarks of one of the wittiest men of the nineteenth century. Whistler not only refused to tolerate misunderstanding by critics and the so-called art-loving public — but launched vicious counterattacks as well. His celebrated passages-at-arms with Oscar Wilde and Swinburne, the terse and penetrating \"letters to the editor,\" his rebuttals to attacks from critics, and biting marginal notes to contemptuous comments on his paintings and hostile reviews (which are also reprinted) are all part of this record of the artist's vendettas.Whistler's most famous battle began when critic John Ruskin saw one of the artist's \"Nocturnes\" exhibited in Grosvenor Gallery. \"I have seen, and heard,\" wrote Ruskin, \"much of cockney impudence before now; but never expected to hear a coxcomb ask two hundred guineas for flinging a pot of paint in the public's face.\" Whistler was incensed with this criticism, and initiated the famous libel case \"Whistler vs. Ruskin.\" Extracts from the resultant trial record are among the highlights of this book, with Whistler brilliantly annihilating his Philistine critics, but winning only a farthing in damages.The Gentle Art, designed by Whistler himself, is a highly entertaining account of personal revenges, but it is also an iconoclast's plea for a new and better attitude toward painting. As a historical document, it is the best statement of the new aesthetics versus the old guard academics, and it helped greatly in shaping the modern feeling toward art.",
        "Category": " Art , Criticism & Theory",
        "Publisher": "Dover",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "June",
            "Year": "1967"
        }
    },
    {
        "Title": "Straight Talk on Decorating",
        "Authors": "By Jennings, Lynette",
        "Description": "",
        "Category": " House & Home , Decorating",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "The Irony of Vietnam: The System Worked",
        "Authors": "By Gelb, Leslie H.",
        "Description": "Few analysts of U.S. involvement in Vietnam would agree with the provocative conclusion of this book. The thesis of most postmortems is that the United States lost the war because of the failure of its foreign policy decisionmaking system. According to Gelb and Betts, however, the foreign policy failed, but the decisionmaking system worked.   They attribute this paradox to the efficiency of the system in sustaining an increasingly heavy commitment based on the shared conviction of six administrations that the United States must prevent the loss of Vietnam to communism. However questionable the conviction, and thus the commitment, may have been, the authors stress that the latter \"was made and kept for twenty-five years. That is what the system&#151;the shared values, the political and bureaucratic pressures&#151;was designed to do, and it did it.\"  The comprehensive analysis that supports this contention reflects the widest use thus fare of available sources, including recently declassified portions of negotiations documents and files in presidential libraries. The frequently quoted statement of the principals themselves contradict the commonly held view that U.S. leaders were unaware of the consequences of their decisions and deluded by false expectations of easy victory. With few exceptions, the record reveals that these leaders were both realistic and pessimistic about the chances for success in Vietnam. Whey they persisted nonetheless is explained in this thorough account of their decisionmaking from 1946 to 1968, and how their mistakes might be avoided by policymakers in the future is considered in the final chapter.",
        "Category": " Political Science , International Relations , Diplomacy",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1979"
        }
    },
    {
        "Title": "The Queen of Everything",
        "Authors": "By Caletti, Deb",
        "Description": "People ask me all the time what having Vince MacKenzie for a father was like. What they mean is, was he always crazy?  High school junior Jordan MacKenzie's life was pretty typical: fractured family, new boyfriend, dead-end job. She'd been living with her father (the predictable optometrist) since her mother (the hippie holdover) had been too embarrassing to be around. Jordan felt like she finally had as normal a life as she could. But then came Gayle D'Angelo.  Jordan knew her father was dating Gayle, and that Gayle was married. Jordan knew it was wrong, and that her father was becoming someone she didn't recognize anymore, but what could she do about it? And how could she -- how could anyone -- have possibly guessed that this illicit love affair would implode in such a violent and disturbing way?",
        "Category": " Young Adult Fiction , Family , Parents",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Entertaining Science Experiments with Everyday Objects",
        "Authors": "By Gardner, Martin",
        "Description": "To Martin Gardner, seeing is not just believing — it is understanding. This fundamental rule has made him one of the most successful teachers and popularizers of science in America. With the simple instructions in this book and a few commonly available household objects, you or your child can easily learn even the most difficult scientific principles by directly experiencing how they work.Gardner shows you how to re-create classic experiments with easily obtainable objects. Using just a flashlight, a pocket mirror, and a bowl of water, you can demonstrate the color composition of white light just as Newton did 300 years ago. With cardboard, colored paper, and wax paper you can perform \"Meyer's experiment\" with complementary colors. You need only a playing card, a spool, and a thumbtack to demonstrate Bernoulli's principle of aerodynamics. A soda bottle filled with water, a few paper matches, and a toy balloon elucidate Pascal's law governing pressure in liquids. And two drinking glasses, some matches, and a piece of wet blotting paper re-create a famous experiment, first performed in 1650 in Magdeburg, Germany, that dramatically reveals the force of ordinary atmospheric pressure.In language simple enough to be easily understood by an 11-year-old, yet technically accurate and informative enough to benefit adults, and aided by Anthony Ravielli's clear illustrations, Gardner presents a splendid practical course in basic science and mathematics. While your child perplexes and delights his or her friends with a series of 100 amusing tricks and experiments, he or she is learning the principles of astronomy, chemistry, physiology, psychology, general mathematics, topology, probability, geometry, numbers, optics (light), gravity, static electricity, mechanics, air hydraulics, thermodynamics (heat), acoustics (sound), and inertia. This is a perfect refresher course for adults as well as an ideal introduction to science for youngsters.\"The experiments … are all clearly explained and unusually well illustrated.\" — Booklist.",
        "Category": " Juvenile Nonfiction , Science & Nature , Experiments & Projects",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1981"
        }
    },
    {
        "Title": "Hard Trade (Rinehart Suspense Novel)",
        "Authors": "By Lyons, Arthur",
        "Description": "Los Angeles detective Jacob Asch investigates an ordinary domestic case that becomes complicated with multiple murder against the backdrop of the California lifestyle",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "HOLT, RINEHART, WINSTON",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1981"
        }
    },
    {
        "Title": "Jewish As a Second Language",
        "Authors": "By Katz, Molly and Moores, Jeff (ILT)",
        "Description": "Now bigger, better, and with more guilt: a completely revised, updated, and expanded second edition (would it hurt to have a little more?) of Jewish as a Second Language, the hilarious field guide to Jewish language and culture. Written to help her Gentile husband and others like him who fall for believing a Jewish mother-in-law when she says, \"Don't bother driving me, I'll take a cab,\" Jewish as a Second Language shows how to be one of the family—how to worry, how to interrupt, how to change your hotel room. It's not Yiddish. Though non-Jews can endear themselves by learning how to mis-use words like schmendrick and schmatta—providing both laughs and confirmation of Jewish superiority—this Jewish language is about the complex twists and somersaults of everyday speech, of unexpected nuances, hidden meanings, and swampy thickets of behavior, of wins, losses, and draws in competitions you never knew you entered. It's about the most common OAQs (obsessive anal questions): \"This mole looks okay, doesn't it?\" \"Can Saltines go bad?\" \"They'll de-ice the wings before takeoff, right?\" The Four Basic Shrugs. Acronyms never to use again: NASCAR, STD, and MRSA (Methicillin Resistant Staphylococcus Aureus, the potentially deadly skin virus that’s spread by contact, and also by talking about it casually). The things non-Jews do for fun and what Jews do: Contra dance/Contradict, Read the comics/Read the obituaries, Get your boobs done/Get your taxes done. Stuff never found in a Jewish home (trout flies, a lineoleum knife, a Lay-Z-Boy, a rottweiler) or mouth (Miracle Whip, marshmallow fluff, Bud).So you'll sit, you'll read, you'll laugh until you're nauseous. It's a nice book.",
        "Category": " Humor , Topic , Religion",
        "Publisher": "Workman Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Easy Desserts",
        "Authors": "By Cookbook Resources, LLC",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Desserts",
        "Publisher": "Cookbook Resouces, LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Revelations",
        "Authors": "By Burnham, Sophy",
        "Description": "Naughton, Virginia, in the late 1950s was a town of old money, even older prejudice, and deeply rooted complacency. It should have been obvious to the lay leaders of the Episcopal Church that an unorthodox and troubled man like Thomas Lewis Buckford was not the right choice for pastor of Trinity Church.Tom Buckford is a man in spiritual bankruptcy. His marriage is an empty shell. The wealth and snobbery of his new parish make a mockery of his ideals, and despair has blotted out his love of God. Then Tom meets Elizabeth McEwen and sets out on a course of disaster. Tom and Elizabeth fall in love with the famished hunger of long deprivation. But this forbidden love affair soon leaps beyond the bounds of physical passion to become a consuming spiritual awakening.Just as she did in A Book of Angels, Sophy Burnham has created a magnificent portrait of the mystery, the wonder, and the searing beauty of spiritual experience. Filled with stunning insight and riveting drama, Revelations is ultimately a story of confrontation between God's will and man's, between good and evil, between the material and the spiritual, between human laws and transcendent love.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Algebra Review 3rd",
        "Authors": "By Michael Sullivan",
        "Description": "",
        "Category": "",
        "Publisher": "Ingram",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Perfect Storm: A True Story of Men Against the Sea",
        "Authors": "By Junger, Sebastian",
        "Description": "In October 1991, three weather systems collided off the coast of Nova Scotia to create a storm of singular fury, boasting waves over one hundred feet high. Among its victims was the Gloucester, Massachusetts-based swordfishing boat the Andrea Gail, which vanished with all six crew members aboard.\"Drifting down on swimmers is standard rescue procedure, but the seas are so violent that Buschor keeps getting flung out of reach. There are times when he's thirty feet higher than the men trying to rescue him. . . . [I]f the boat's not going to Buschor, Buschor's going to have to go to it. SWIM! they scream over the rail. SWIM! Buschor rips off his gloves and hood and starts swimming for his life.\"It was the storm of the century, boasting waves over one hundred feet high a tempest created by so rare a combination of factors that meteorologists deemed it \"the perfect storm.\" When it struck in October 1991, there was virtually no warning. \"She's comin' on, boys, and she's comin' on strong,\" radioed Captain Billy Tyne of the Andrea Gail off the coast of Nova Scotia, and soon afterward the boat and its crew of six disappeared without a trace.In a book taut with the fury of the elements, Sebastian Junger takes us deep into the heart of the storm, depicting with vivid detail the courage, terror, and awe that surface in such a gale. Junger illuminates a world of swordfishermen consumed by the dangerous but lucrative trade of offshore fishing, \"a young man's game, a single man's game,\" and gives us a glimpse of their lives in the tough fishing port of Gloucester, Massachusetts; he recreates the last moments of the Andrea Gail crew and recounts the daring high-seas rescues that made heroes of some and victims of others; and he weaves together the history of the fishing industry, the science of storms, and the candid accounts of the people whose lives the storm touched, to produce a rich and informed narrative. The Perfect Storm is a real-life thriller that will leave readers with the taste of salt air on their tongues and a sense of terror of the deep.",
        "Category": " Nature , Ecosystems & Habitats , Oceans & Seas",
        "Publisher": "w.w. norton",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Bygones",
        "Authors": "By Spencer, LaVyrle",
        "Description": "Bess Curran is shaken from her comfortable, independent, post-divorce life when her daughter becomes pregnant and plans a wedding in which she asks both parents to walk her down the aisle. 250,000 first printing. Doubleday Main. Lit Guild Alt. Reader's Digest Cond Bks.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "The Worst-Case Scenario Survival Handbook: Golf",
        "Authors": "By Borgenicht, David, Piven, Joshua, Grace, James, and Brown, Brenda (ILT)",
        "Description": "The authors of The Worst-Case Scenario Survival Handbook take to the links! Dave and Josh join golf fanatic James Grace, drawing on their own tragic exploits and the experience of experts to help golfers survive dozens of dire situations. Learn how to finish a round with a broken arm, deal with a cigar brush fire, cure golf addiction, or remove a tick. Discover the best way to play out of a water hazard, make it through a lightning storm, or survive being hit in the privates. Hands-on, illustrated, step-by-step instructions guide you through these and other perils lurking on the fairway. With an appendix of rules for bizarre mis-haps, strategies for surmounting dress-code and equipment crises, and other essential survival tips, this handy guide won't help you save par-but it could save your bacon! Don't tee off without it.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "The Far Side of the World",
        "Authors": "By O'Brian, Patrick",
        "Description": "Now available in an attractive movie-tie-in jacket for the release of the motion picture Master and Commander: The Far Side of the World starring Russell Crowe: \"A world of enchanting fictional surfaces.\"John Bayley, New York Review of Books. Jack Aubrey, a brilliant and fearless captain in Nelson's navy, accepts a mission that will test his abilities to the limit: he is to set sail immediately for Cape Horn, to intercept a powerful frigate intent on wreaking havoc among British whalers. Aubrey's beloved ship, HMS Surprise, is up to the task, but many of her sailors are untried. Aubrey's confidant, ship's surgeon Stephen Maturin, has orders of his own in the world of secret intelligence. As the Surprise and her crew draw closer to the enemy, their journey grows ever more dangerous: murder, shipwreck, and a desperate rescue attempt await them in the far reaches of the Pacific.",
        "Category": " Fiction , Media Tie-In",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Everyday Low Carb Cooking: 240 Great-Tasting Low Carbohydrate Recipes the Whole Family will Enjoy",
        "Authors": "By Haas, Alex",
        "Description": "Low-carb eating continues to gain adherents as people discover that they can lose weight and help manage chronic conditions such as diabetes and high cholesterol by eating more low-carb foods. Everyday Low Carb Cooking&#151;here in its third edition&#151;contains 225 recipes from two dozen cuisines that provide a wide variety of low-carb options. The recipes are designed for the entire family to enjoy, and cover salads, soups, and a wide variety of seafood, chicken, beef, pork, and vegetable choices. Haas has already been praised for the incredible variety of his recipes and for offering low-carb versions of such foods as salad dressings, chicken wings, crab cakes, and coleslaws&#151;that are not readily available in other low-carb cookbooks. Each recipe includes macronutrient counts for each ingredient. This is an accessible, proven book of low carbohydrate recipes for everyone who wants or needs to be on a low-carb diet.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "The Best of Times: The Boom and Bust Years of America before and after Everything Changed",
        "Authors": "By Johnson, Haynes",
        "Description": "We were awash in money and spellbound by celebrity. We ogled at O. J., marveled over Monica, and sent the stock market soaring. It was a time of unprecedented wealth and possibility, it was a time of waste and squandered opportunities. In the Best of Times (yes, the title is ironic), Pulitzer Prize-winning journalist Haynes Johnson looks back on the decade when Bill Clinton and Bill Gates ran the country--and the rest of us sat back and downloaded it all off the Internet. He opens with a tense, exciting amount of chess master's Gary Kasparov's match with Deep Blue--a defeat of man by machine emblematic of a decade in which, as Thoreau said, we became \"tools of [our] tools.\" He takes us through the work-obsessed halls of Microsoft, the lab that created Dolly the Sheep, and the Hollywood studios that operated on the mantra \"dumb and dumber.\" The book is full of fresh insights into the headlines of the decade: the avalanche of wealth that rewarded some and passed many by; the societal schisms that could be seen from the O. J. Simpson trials to Congress. With a sharp eye for the quote or detail that perfectly captures a moment in time, Johnson knows just how to tell this story. He serves up no-holds-barred portraits of the key players, for a sorrowful David Geffen, who assures us that movies will only get worse, to Monica Lewinsky as a monument to entitlement. What lies ahead? It's uncertain. We can only hope that Haynes Johnson is there to explain it to us when it happens. The Best of Times, the product of four years of interviews with America's leaders in politics, business, and science, is in the best tradition of timeless social history--a memorable portrait of the nation at a turning point.",
        "Category": " History , United States , 20th Century",
        "Publisher": "Harvest",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Yoga For Wimps: Poses for The Flexibly Impaired",
        "Authors": "By Austin, Miriam and Kaplan, Barry (PHT)",
        "Description": "Crave yoga's benefits--but feel afraid to look \"weird?\" Think yoga requires you to look like a pretzel? Now there's a friendly, full-color, hand-holding, one-step-at-a-time, few-minutes-a-day way to get started. It meets you right where you are, with three different approaches to fit your needs. Instant Yoga gets you going immediately with 15 practice sessions for any time of the day, even when there's only a few minutes to spare. Run through a sequence and the workout's over! FixIts offer solutions to specific problems, such as a sore neck, back pain, those aching feet, or stress. In the Glossary, the author demonstrates every pose correctly, with instructions for improving technique. The changes you experience will amaze and delight you so much you'll never want to wimp out on your workout! The author lives in Lexington, VA. 128 pages (all in color), 8 1/2 x 11.",
        "Category": " Health & Fitness , Yoga",
        "Publisher": "Sterling",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "1001 Ways to Energize Employees",
        "Authors": "By Nelson, Bob and Morris, Burton (ILT)",
        "Description": "Take the brakes off your business. In the perfect follow-up to 1001 Ways to Reward Employees, the innovative book that has sold over one million copies,  Bob Nelson reveals what real companies across America are doing to get the very best out of their employees-and why it's the key to their success.  Energizing is listening-AT&T's Universal Card Service's employee suggestion system yields 1,200 ideas a month and millions of dollars in savings. Energizing is encouraging risk-taking-Hershey Foods gives out The Exalted Order of the Extended Neck Award. Energizing is Starbuck's making employees partners, Saturn creating teams that function as independent small businesses, Springfield Remanufacturing's opening its books to all employees. With case studies, examples, techniques, research highlights, and quotes from business leaders, 1001 Ways to Energize Employees is invaluable for managers seeking to increase employee enthusiasm and involvement.",
        "Category": " Business & Economics , Management",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Eating in the Dark:  America's Experiment with Genetically Engineered Food",
        "Authors": "By Hart, Kathleen",
        "Description": "Most Americans Eat Genetically Modified food on a daily basis. Yet many of us are barely aware that we're eating something that has been altered; food labels do not include information on ingredients that have been genetically modified, and the subject has received surprisingly little media coverage.Even as genetically engineered foods spread throughout America, most consumers abroad have refused to eat them. Opposition to genetically engineered food is now beginning to surface in the United States, where biotechnology is becoming a major issue for the new century.Eating in the Dark tells the story of how these new foods, most of which are engineered either to produce or to withstand heavy doses of pesticides, quietly entered America's food supply. Kathleen Hart explores the potential of this new technology to enhance nutrition and cut farmers' expenses. She also reveals the process by which regulatory agencies decided to allow the biotechnology industry to sell its products without first submitting them to thorough testing for possible long-term threats to consumer health and the environment.",
        "Category": " Science , Biotechnology",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Grand Design (Tyrants and Kings, Book 2)",
        "Authors": "By Marco, John",
        "Description": "From John Marco comes the epic sequel to his thrilling debut military fantasy, The Jackal of Nar. An infamous warrior is once again caught between two irresistible forces, and his choice may change the world....In the wake of Arkus' terrible war, Prince Richius Vantran, the Jackal of Nar, has fled into exile with his wife, Dyana, and their young daughter, Shani. Meanwhile, with the emperor's death, Nar has exploded in civil war. Now a new conflict is being waged between the religious fanatics of Bishop Herrith, who follow the Light of God, and the ruthless followers of Count Biagio and his Black Renaissance. Each man believes he has been chosen to lead, and as the terrifying slaughter mounts, fueled by the development of hideous new war machines, Vantran is offered the chance to ally with a third faction and take his revenge against his ancient enemy Biagio.But Biagio, a master of deception and intrigue, has a grand design to gain total power, and part of it involves luring Vantran's new allies into a clever and deadly trap. As for Vantran, Biagio's own most hated enemy, the count has a far more devious plan: to strike the warrior-prince's only weakness...Vantran's innocent daughter. And Vantran himself will unwittingly seal his daughter's fate.Count Renato Biagio was bred in the lap of luxury, but this pampered fop has a steel core of determination.  Bishop Herrith is a man of God, equally determined to defend his beliefs.  With the emperor Arkus's death, each believes he has been chosen to lead Nar.  But when Richius Vantran, hero of the previous war and now an exile in a foreign land, is called to defeat Biagio, he finds himself with a bitter choice.  Is Herrith really the best leader for Nar, or is Richius's lust for vengeance blinding him to Biagio's potential? -->",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Spectra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Totltxt: The Big Book of Little Text Messages",
        "Authors": "By Wingate, Philippa (EDT) and Sinden, David (EDT)",
        "Description": "",
        "Category": " Reference , Research",
        "Publisher": "Chartwell Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Wild Horse Summer",
        "Authors": "By Casale, Paul (ILT) and Ryden, Hope",
        "Description": "For her thirteenth birthday, Alison spends the summer on a ranch in Wyoming where she learns to ride a horse and where Kelly, who is blind, helps her overcome an old fear. Reprint.",
        "Category": " Juvenile Fiction , Animals , Horses",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Sew and Go Kids: Full-Size Patterns Included",
        "Authors": "By Hubble, Jasmine",
        "Description": "",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "Krause Pubns Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "The New Rabbi: A Congregation Searches for Its Leader",
        "Authors": "By Fried, Stephen",
        "Description": "From award-winning journalist Stephen Fried comes a vividly intimate portrait of American Judaism today in which faith, family, and community are explored through the dramatic life of a landmark congregation as it seeks to replace its legendary retiring rabbi--and reinvent itself for the next generation. The New RabbiThe center of this compelling chronicle is Har Zion Temple on Philadelphia’s Main Line, which for the last seventy-five years has been one of the largest and most influential congregations in America. For thirty years Rabbi Gerald Wolpe has been its spiritual leader, a brilliant sermonizer of wide renown--but now he has announced his retirement. It is the start of a remarkable nationwide search process largely unknown to the lay world--and of much more. For at this dramatic moment Wolpe agrees to give extraordinary access to Fried, inviting him--and the reader--into the intense personal and professional life of the clergy and the complex behind-the-scenes life of a major Conservative congregation. These riveting pages bring us a unique view of Judaism in practice: from Har Zion’s strong-willed leaders and influential families to the young bar and bat mitzvahs just beginning their Jewish lives; from the three-days-a-year synagogue goers to the hard core of devout attendees. We are touched by their times of joy and times of grief, intrigued by congregational politics, moved by the search for faith. We witness the conflicts between generations about issues of belief, observance, and the pressures of secular life. We meet Wolpe’s vigorous-minded ailing wife and his sons, one of whom has become a celebrity rabbi in Los Angeles. And we follow the author’s own moving search for meaning as he reconnects with the religion of his youth. We also have a front-row seat at the usually clandestine process of choosing a new rabbi, as what was expected to be a simple one-year search for Rabbi Wolpe’s successor extends to two years and then three. Dozens of résumés are rejected, a parade of prospects come to interview, the chosen successor changes his mind at the last minute, and a confrontation erupts between the synagogue and the New York–based Conservative rabbis’ “union” that governs the process. As the time comes for Wolpe to depart, a venerated house of worship is being torn apart. And thrust onto the pulpit is Wolpe’s young assistant, Rabbi Jacob Herber, in his first job out of rabbinical school, facing the nearly impossible situation of taking over despite being technically ineligible for the position--and finding himself on trial with the congregation and at odds with his mentor. Rich in anecdote and scenes of wonderful immediacy, this is a riveting book about the search for personal faith, about the tension between secular concerns and ancient tradition in affluent America, and about what Wolpe himself has called “the retail business of religion.” Stephen Fried brings all these elements to vivid life with the passion and energy of a superbly gifted storyteller.",
        "Category": " Religion , Judaism , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Embroidery for the Home",
        "Authors": "By Kinmond, Jean",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins Distribution Services",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1970"
        }
    },
    {
        "Title": "The Alternate",
        "Authors": "By Martel, John S.",
        "Description": "In her palatial Pacific Heights mansion, above a city glittering in the night, Lara Ashford lies dead. A former beauty queen and the wife of a powerful ex-congressman, she was a woman who made mistakes - married to a man who made even more.Grace Harris and Barrett Dickson are the two attorneys caught in the fray, clinging to their careers, their troubled lives, their shaken ideals. The trial of Elliot Ashford for the brutal murder of his wife will turn them into adversaries in the courtroom, even as they find themselves dangerously close to each other outside it. For Grace, bent on justice no matter what the cost, the prosecution hinges on flawed and circumstantial evidence. For Barrett, a once-great advocate now on the fast track to oblivion, the defense hinges on an alibi that will not hold up.With a key piece of evidence mysteriously vanished...with the D.A. trying to run from his secrets all the way to the governor's mansion...and with influential people pulling strings on both sides, an innocent jury will be drawn into the cross fire, as a case driven by personal vendettas and hidden motives erupts in violence.Because - behind the headlines, the politics, and the legal maneuvering, behind the lies, the evasions, and the stunning reversals - another player is in the game: one with a front-row seat, and a history of madness and murder...",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Picture This",
        "Authors": "By Heller, Joseph",
        "Description": "Conjured back to life by Rembrandt's famous \"Aristotle Contemplating the Bust of Homer,\" Aristotle surveys history and profiles historical personalities, ultimately concluding that not much has changed in 2,500 years",
        "Category": " Fiction , Literary",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "20.85",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Code to Zero",
        "Authors": "By Follett, Ken",
        "Description": "It's January 1958 - a dark hour in the Cold War, and the early dawn of the space race. At Cape Canaveral, a countdown has begun. On launch pad 26B sits Explorer I, America's best hope to match the Soviet Sputnik and regain the lead in the contest for the skies above.Caught in this mighty struggle between the superpowers are four old friends from Harvard. Bound together by the past and separated by war, each knows that Explorer's failure to be anything less than a triumphant success would have disastrous consequences for the United States. And as Luke Lucas starts to unravel the mystery of his amnesia and relearn the story of his life, his desperate search leads him back to his Harvard friends: to his wife, to his best friend, to the woman he once loved more than life itself ... and to the realization that his fate is tied to the rocket that stands ready at the Cape. For Luke knew something that someone deliberately wanted him to forget, and unless he is able to discover his own terrible, deadly secret, Luke may be left powerless to save the launch of Explorer - and with it, America's future.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "30.98",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Are You Hungry, Dear?: Life, Laughs, and Lasagna",
        "Authors": "By Roberts, Doris, Morton, Danelle",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "A Little Bit Of Trouble",
        "Authors": "By Grindley, Sally and Taylor, Eleanor (ILT)",
        "Description": "In this delightful sequel to No Trouble at All, Sally Grindley and Eleanor Taylor have once again created a picture book that is irresistible to parents and grandparents.  One day, Grandfather Bear and his two mischevious cubs go on a picnic.  Grandfather Bear, as clueless and clumsy as ever, fails to notice a bull threatening to run over their picnic! But all's well that ends well, even with just a little bit of trouble.",
        "Category": " Juvenile Fiction , Animals , Bears",
        "Publisher": "Bloomsbury USA Childrens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Eleanor Rigby: A Novel",
        "Authors": "By Coupland, Douglas",
        "Description": "A riveting, witty, and profound story of loneliness and connection from internationally bestselling author Douglas Coupland.The 1997 night that Hale-Bopp streaks across the skies over Vancouver, Liz Dunn has nothing in her life but impending oral surgery and an armful of schmaltzy video rentals to get her through her solitary convalescence in her sterile condo. She's overweight, crabby, and plain, but behind her eyes lurk whole universes that she's never had the opportunity to express. Just as Liz makes a quiet decision to seek peace in her life rather than certainty, along comes another comet, in the form of a young man admitted to the local hospital with her name and number inscribed on his Medic Alert bracelet: In case of emergency, contact Liz Dunn.A charming lost soul and a strange visionary, Jeremy upends Liz's quiet existence, triggering a chain of events that take her to the other side of the world and back, endangering her life just as a real chance at happiness finally seems within reach. By turns funny and heartbreaking, Eleanor Rigby is a fast-paced read and a haunting exploration of the ways in which loneliness affects us all.",
        "Category": " Fiction , Psychological",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Nursery Collection",
        "Authors": "By Dempsey Parr",
        "Description": "",
        "Category": "",
        "Publisher": "PARRAGON",
        "Price Starting With ($)": "8.67",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Lipton Recipe Secrets The Magic of Flavor (71 Ways To Turn Ordinary Into Irresistible)",
        "Authors": "By Kitchens, Lipton",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International; English Language edition",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Please Don't Feed The Egos: and Other Tips for Corporate Survival (Dilbert Books (Hardcover Andrews McMeel))",
        "Authors": "By Adams, Scott",
        "Description": "Collects cartoons on surviving cubicle life, with tips such as \"never confuse responsibility with power\" and \"casual day is no time to make fashion statements\"",
        "Category": " Humor , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Harry Potter, You're the Best!: A Tribute from Fans the World Over",
        "Authors": "By Moore, Sharon (EDT)",
        "Description": "After St. Martin's published We Love Harry Potter! We'll tell you why we got hundreds of letters from fans around the world who wanted to offer their thoughts about the books they love. Their fertile imaginations have led them to share their creative takes on Harry: their opinions about the plots and characters, their wishes for the next book and the upcoming, highly ancipated movie version, their ideas for playing Harry, Ron, Hermione, and all their other favorite characters, and much more! The collected letters are a delightful testament to how widespread and beloved the Harry Potter phenomenon has become.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Secret Life of Beer: Legends, Lore & Little-Known Facts",
        "Authors": "By Eames, Alan D.",
        "Description": "Did you know that the Mayflower abandoned its journey and landed in Plymouth because it had run out of beer? That in ancient Sumeria, women dominated the art of brewing, operating under the protection of Siduri, goddess of the brewery? That 20 people literally drowned in beer in 1814, when a vat in a London brewery exploded, creating a tidal wave of beer? Or that alewives in colonial America brewed a high-test \"groaning ale\" for a mother-to-be to swig while in labor? This fascinating and eclectic compendium comes from Alan Eames, beer's foremost historian, who has traveled the world uncovering the untold stories of one of the world's favorite beverages.",
        "Category": " Cooking , Beverages , Beer",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Betrayed!",
        "Authors": "By Telchin, Stan",
        "Description": "",
        "Category": " Religion , Messianic Judaism",
        "Publisher": "Chosen",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "Rainbow Colors (It's Fun to Learn, Vol. 10)",
        "Authors": "By Walt Disney",
        "Description": "",
        "Category": "",
        "Publisher": "Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "A Second Browser's Dictionary and Native's Guide to the Unknown American Language",
        "Authors": "By Ciardi, John",
        "Description": "Tells the stories, legends, and facts behind the origins of common American expressions",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "29.96",
        "Publish Date": {
            "Month": "May",
            "Year": "1983"
        }
    },
    {
        "Title": "How People Get Power; Organizing Oppressed Communities for Action.",
        "Authors": "By Kahn, Si",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1970"
        }
    },
    {
        "Title": "Talking Back...To Presidents, Dictators, and Assorted Scoundrels",
        "Authors": "By Mitchell, Andrea",
        "Description": "A chief foreign correspondent for NBC describes her first posting abroad after the murder of her predecessor, her work as a White House correspondent from the presidency of Jimmy Carter to the present, her marriage to Alan Greenspan, and more. 175,000 first printing.",
        "Category": " Biography & Autobiography , Editors, Journalists, Publishers",
        "Publisher": "Viking",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Greatest Generation",
        "Authors": "By Brokaw, Tom",
        "Description": "\"They came of age during the Great Depression and the Second World War and went on to build modern America -- men and women whose everyday lives of duty, honor, achievement, and courage gave us the world we have today.\"In this magnificent testament to a nation and her people, Tom Brokaw brings to life the extraordinary stories of a generation that gave new meaning to courage, sacrifice, honor.From military heroes to community leaders to ordinary Americans, he profiles men and women who served their country with valor, then came home and transformed America: Senator Daniel Inouye, decorated at the front, fighting prejudice at home; Martha Putney, one of the first black women to serve in the newly formed WACs; Charles Van Gorder, a doctor who set up a MASH-like medical facility in the middle of battle, then came home to open a small clinic in his hometown; Navy pilot George Bush, assigned to read the mail of the enlisted men under him, who says that in doing so \"I learned about life.\" And there are more, all seasoned by a time of tragedy and triumph.To this generation who gave so much and asked so little, Brokaw offers eloquent tribute in true stories of everyday heroes in extraordinary times.",
        "Category": " History , Modern , 20th Century",
        "Publisher": "Delta",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "A Princely Marriage, Charles and Diana, the First Ten Years",
        "Authors": "By Holden, Anthony",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Yogi Book: \"I Really Didn't Say Everything I Said\"",
        "Authors": "By Berra, Yogi",
        "Description": "\"It's déjà vu all over again\"—only better. The Yogi Book, the New York Times bestseller, now has a fresh new design throughout, new photographs, a career timeline, and all-new appreciations by some of his greatest fans, including Billy Crystal. And it's timed to coincide with the 85th birthday of this American legend who's more beloved than ever.As for the quotes, well, Yogi Berra's gift for saying the smartest things in the funniest, most memorable ways has made him a legend. Or, as The New Yorker put it, \"Hardly anybody would quarrel that . . . Winston Churchill has been replaced by Yogi Berra as the favorite source of quotations.\" The Yogi Book brings all of his famous quotes together in one place—and even better, gives the story behind them. \"It ain't over 'til it's over.\"—that’s Yogi's answer to a reporter when he was managing the Mets in July 1973, and they were nine games out of first place (not only quotable, but prophetic—they won the pennant). \"Nobody goes there anymore, it's too crowded.\"—Yogi's comment to Stan Musial and Joe Garagiola about Ruggieri's Restaurant in St. Louis 1959. \"It gets late early out there.\"—Yogi describing how shadows crept across Yankee Stadium's left field during late autumn afternoons.",
        "Category": " Biography & Autobiography , Sports",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Wuthering Heights (Oxford World's Classics)",
        "Authors": "By Bronte, Emily and Stoneman, Patsy (EDT)",
        "Description": "First published in 1847, Wuthering Heights is set on the bleak Yorkshire moors, where the drama of Catherine and Heathcliff, Heathcliff's cruel revenge against Edgar and Isabella Linton, and the promise of redemption through the next generation, is enacted. This edition uses the authoritative Clarendon text, and in a new introduction Patsy Stoneman considers the bewildering variety of critical interpretations to which the novel has been subject, as well as offering some provocative new insights for the modern reader.",
        "Category": " Fiction , Classics",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Blue Rose",
        "Authors": "By Straub, Peter",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Doggonest Christmas",
        "Authors": "By Stack, Richard Lynn and Stack, Charles W. (ILT)",
        "Description": "Josh, a young dog, rescues Santa Claus, and convinces his friends, a group of Mongrels, to replace Santa's ailing reindeer and pull Santa's sleigh on Chistmas Eve",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Windmill Pr",
        "Price Starting With ($)": "21.2",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Peril In Panama: China As The Gatekeeper Of The Panama Canal Threatens New Missile Crisis",
        "Authors": "By Delgaudio, Richard A.",
        "Description": "",
        "Category": "",
        "Publisher": "National Security Center",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Loon Voice Of Wilderness",
        "Authors": "By Dunning, Joan",
        "Description": "Describes a typical year in the life of a loon, traces the history of loons, one of the oldest birds on earth, and looks at loon characteristics and behavior",
        "Category": " Science , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "A Global Odyssey: The Autobiography of James K. Mathews",
        "Authors": "By Matthews, James",
        "Description": "A Global Odyssey includes Bishop Mathews’ memoirs as a student, as a missionary in India, and as mission board executive. This autobiography also chronicles his 38 years as a bishop, serving in Boston, Washington, Zimbabwe, Albany, and New York. In this volume, readers will encounter most of the religious, social, and political history of the twentieth century from the vantage point of a remarkable leader who helped shape many of the moments of that history. \"...a beautiful gift to the church in our age. --Ted A. Campbell, Ph.D., is Professor of History of Christianity, Wesley Theological Seminary, Washington, D.C.",
        "Category": " Religion , Christianity , Methodist",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Murder Under the Mistletoe",
        "Authors": "By Jordan, Jennifer",
        "Description": "Barry and Dee Vaughn, amateur sleuths, plan a festive Christmas at a small country hotel only to stumble upon the murder of a beautiful but spoiled socialite",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Last Man Standing",
        "Authors": "By Baldacci, David",
        "Description": "The sole survivor of a devastating ambush, FBI Hostage Rescue Team agent Web London would do anything to find out what really happened that night--and a ten year old boy may be the unexpected key in this #1 New York Times bestselling thriller.Web London was trained to penetrate hostile ground and come out alive. Then ten seconds in a dark alley cost him everything: his friends, his fellow agents, his reputation. Among his super-elite FBI Hostage Rescue Team, Web was the sole survivor of a high-tech, devastating ambush.Now Web is trying to put his life back together and understand what really happened. To get answers, he'll need the help of psychiatrist Claire Daniels and the one other human being who lived through the attack--a ten-year-old boy. But when his search leads him back to that bloodstained alley, Web suddenly realizes he is about to face his assassin again. And this time, one of them will become the Last Man Standing.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Star Wars Episode II: Attack of the Clones",
        "Authors": "By Salvatore, R. A.",
        "Description": "There is a great disturbance in the Force. . . . From the sleek ships of the glimmering Coruscant skyscape to the lush gardens of pastoral Naboo, dissent is roiling. The Republic is failing, even under the leadership of Supreme Chancellor Palpatine, elected ten years earlier to save the crumbling government. Separatists threaten war, and the Senate is hopelessly divided, unable to determine whether to raise an army for battle or keep the fragile peace. It is a stalemate that once broken, could lead to galactic chaos.Mischievous and resolved, courageous to the point of recklessness, Anakin Skywalker has come of age in a time of great upheaval. The nineteen-year-old apprentice to Obi-Wan Kenobi is an enigma to the Jedi Council, and a challenge to his Jedi Master. Time has not dulled Anakin’s ambition, nor has his Jedi training tamed his independent streak. When an attempt on Senator Padmé Amidala’s life brings them together for the first time in ten years, it is clear that time also has not dulled Anakin’s intense feelings for the beautiful diplomat.The attack on Senator Amidala just before a crucial vote thrusts the Republic even closer to the edge of disaster. Masters Yoda and Mace Windu sense enormous unease. The dark side is growing, clouding the Jedi’s perception of the events. Unbeknownst to the Jedi, a slow rumble is building into the roar of thousands of soldiers readying for battle. But even as the Republic falters around them, Anakin and Padmé find a connection so intense that all else begins to fall away. Anakin will lose himself—and his way—in emotions a Jedi, sworn to hold allegiance only to the Order, is forbidden to have.Based on the story by George Lucas and the screenplay by George Lucas and Jonathan Hales, this intense and revealing novel by bestselling author R. A. Salvatore sheds new light on the legend of Star Wars—and skillfully illuminates one of our most beloved sagas.",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Ballantine,",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Pasta - Irresistible Recipes For Perfect Pasta",
        "Authors": "By Fraser, Linda, Editor",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Complete Book of Christmas: A Complete Guide to Cooking, Decorating, Gift-Making and Parties for the Festive Season",
        "Authors": "By Bell, Carolyn",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "8.98",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Birdlife at Chincoteague and the Virginia Barrier Islands",
        "Authors": "By Meanley, Brooke",
        "Description": "",
        "Category": " Nature , Birdwatching Guides",
        "Publisher": "Schiffer Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "In the Land of Hummel: Traditional Bavarian Life",
        "Authors": "By Saal, Kathleen",
        "Description": "",
        "Category": " Antiques & Collectibles , Figurines",
        "Publisher": "Portfolio Pr",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "501 Low-carb Recipes",
        "Authors": "By Pamela Clark",
        "Description": "",
        "Category": "",
        "Publisher": "Elizabeth House",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "True Blue",
        "Authors": "By Rice, Luanne",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Common Thread: Mothers and Daughters: The Bond We Never Outgrow",
        "Authors": "By Manning, Martha",
        "Description": "No relationship is more fulfilling, infuriating, emotional, and problematic than that of mother and daughter. Now, in a work filled with truth, surprises, and humor, renowned psychologist and author Martha Manning offers mothers and daughters of all ages a new way to understand each other. Challenging the accepted premise that this powerful bond must be severed for emotional growth, Manning shows us why this precious attachment is never outgrown, how, if it is damaged, it can be healed, and what will enrich this lifelong commitment while fostering essential independence. The key is empathy, and Manning provides potent tools to help us build stronger ties and celebrate the crazy twists, joys, and secrets inherent in this most glorious of life connections.Combining personal experiences and scrupulous research, The Common Thread helps each of us develop a mutually empowering relationship -- and laugh, too -- as we more deeply connect with and appreciate the mother or daughter we love.",
        "Category": " Family & Relationships , Parenting , Parent & Adult Child",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Caribbean Cookbook",
        "Authors": "By Hamelecourt, Juliette",
        "Description": "",
        "Category": "",
        "Publisher": "Delair",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The Invitation",
        "Authors": "By Mountain Dreamer, Oriah",
        "Description": "Visionary author Oriah Mountain Dreamer brings to life the wisdom of her beloved invitation, which has touched hearts everywhere with its fresh and spirited call to live life more deeply, honestly, and well. Like the inspirations for Robert Fulghum′s All I Really Need to Know I learned in Kindergarten, Cherie Carter-Scott′s If Life Is a Game, These are the Rules, and Margaret Fishback Power′s Footprints, the poem that sparked The Invitation has been embraced around the world, passed along by thousands who have discovered and treasured its message. In this lovely gift book the author speaks from the heart, reflecting on everything from desire to betrayal and offering practical - and often surprising - suggestions for how to live the ecstasy of everyday life, learn to recognise true beauty in ourselves and the world around us, and how to find the sustenance that our spirit longs for. The poem Invitation has been recited and quoted at countless spiritual conferences, and on network radio by Robert Bly, Jack Kornfield, Angeles Arrien, and many other spiritual leaders. From the Invitation: ȴ doesn′t interest me what you do for a living. I want to know what you ache for, and if you dare to dream of meeting your heart′s longing. It doesn′t interest me how old you are. I want to know if you will risk looking like a fool for love, for your dream, for the adventure of being alive ...′",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Harper Audio",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "The Biggest Ever Knock Knock Joke Book",
        "Authors": "By ANAM",
        "Description": "",
        "Category": "",
        "Publisher": "Dempsey Parr",
        "Price Starting With ($)": "11.98",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Dubliners: New Edition",
        "Authors": "By Joyce, James",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1968"
        }
    },
    {
        "Title": "The Best of Sunset",
        "Authors": "By Sunset Books, Sunset Magazine & Book",
        "Description": "Gathers recipes for appetizers, soups, salads, meat, poultry, fish, shellfish, eggs, cheese, vegetables, pasta, sauces, dressings, preserves, breads, and desserts",
        "Category": " Cooking , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Celebrating America: The Ultimate Guide to America's 4 Regional Styles of 'Cue",
        "Authors": "By Schulz, Phillip Stephen",
        "Description": "A hearty countrywide affirmation of America's historical, cultural, and ethnic heritage journeys through twelve months of seasonal and holiday celebrations, offering one hundred delicious recipes, from Steamed Soft-Shell Crabs to Philadelphia Pepperpot Soup. 30,000 first printing.",
        "Category": " Cooking , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Breaking Down the Digital Walls: Learning to Teach in a Post-Modem World (SUNY series, Education and Culture: Critical Factors in the Formation of Character and Community in American Life)",
        "Authors": "By Burniske, R. W., Monke, Lowell, and Soltis, Jonas F. (FRW)",
        "Description": "An exploration of the benefits and problems of using the Internet in education.",
        "Category": " Computers , Internet , General",
        "Publisher": "SUNY Press",
        "Price Starting With ($)": "6.25",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "5-Jan",
        "Authors": "By Boling, Katharine",
        "Description": "The winter has been a tough one for Pauline and Arlene&#39;s family. Though only eleven, the twin girls are old in too many ways: They know what it is to work to exhaustion, to be hamstrung by longing, to be blind with hate. Pauline labors from dawn to dusk alongside the other members of her family at the local cotton mill, and wishes she could stay home like her sister. Meanwhile, crippled Arlene takes care of all the housework and cooking, dreaming of one day working at the mill and earning money and respect. Each is certain that the other has the easy life, but each discovers how wrong she is as this extraordinary novel unfolds.",
        "Category": " Juvenile Fiction , Disabilities & Special Needs",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Attitude Is Everything: 10 Life-Changing Steps to Turning Attitude into Action",
        "Authors": "By Harrell, Keith D.",
        "Description": "In the world of motivational speakers, Keith Harrell is a star. The Wall Street Journal recognized it--dubbing him \"A Star with Attitude.\" Such clients as IBM, Microsoft, Coca-Cola, Motorola, GM, Marriott Hotels Corporation, Boeing, and AT&T know it-that's why Keith is one of the most demanded speakers on the circuit. And, as you read this book, you will know it, too. Keith's star power is indisputable. Now, in Attitude Is Everything, he shares the secrets that got him where he is today--and provides you with a program for developing a healthier, happier attitude.In Attitude Is Everything, Keith offers an enlightening, inspiring, and practical guide for gaining control of your career and your life by ridding yourself of negative attitudinal baggage, building positive attitudes, and then turning them into actions to help you achieve your dreams.His Ten Steps For Turning Attitude Into Action: Understand the Power of Attitude Take Control of Your Life Practice Self-Awareness Re-Frame Your Bad Attitude Find Your Purpose and Passion Be Pre-Active Discover How to Motivate Yourself Build Supportive Relationships See Change as an Opportunity Leave a Lasting Legacy Keith developed his methods for putting attitudes into action in the real world of corporate America and, later, as a self-employed professional. He knows what works, and he knows how to help others create positive, empowering attitudes that will help you enjoy a more fulfilling and rewarding life!",
        "Category": " Self-help , General",
        "Publisher": "Collins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Disney's Winnie the Pooh: Friendship Day--Lessons from the Hundred-Acre Wood",
        "Authors": "By Nancy Parent",
        "Description": "",
        "Category": "",
        "Publisher": "Advance Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "The Courage To Be Catholic: Crisis, Reform, And The Future Of The Church",
        "Authors": "By Weigel, George",
        "Description": "The Catholic Church in America is in a state of crisis. Yet few understand what the crisis really is, why it happened, or how the Church must respond to it. As no other commentator or critic has done, George Weigel situates the current crisis of sexual abuse and episcopal malfeasance in the context of recent Catholic history. With honesty and critical rigor, he reveals the Church's failure to embrace the true spiritual promise of Vatican II, a failure that has resulted in the gradual but steady surrender to liberal culture that he dubs \"Catholic Lite.\" Drawing upon his unparalleled knowledge of how the Church works, both in America and in Rome, Weigel exposes the patterns of dissent and self-deception that became entrenched in seminaries, among priests, and ultimately among the bishops who failed their flock by thinking like managers instead of apostles. But, Weigel reminds us, in the Biblical world a \"crisis\" is a time of great opportunity, an invitation to deeper faith. Every great crisis of the Church's past, from the Dark Ages to the Reformation, has resulted in a period of reform that returned the Church-and its priesthood-to its roots. Weigel sets forth an agenda for genuine reform that challenges seminarians, priests, bishops, and the laity to lead more integrally Catholic lives. As he argues so persuasively, the answer to the present crisis will not be found in \"Catholic Lite\" but in classic Catholicism: a Catholicism that has reclaimed the wisdom of the past in order to face the corruptions of the present and create a strong future.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Israel from the Air (World from the Air) by Kriss, David (2001) Hardcover",
        "Authors": "By Kriss, David",
        "Description": "A glorious full colour journey over Israel, Palestine, the Holy City of Jerusalem, Galilee, the Dead Sea, the Red Sea, the Negev Desert, the Golan Heights and the Mediterranean coast.",
        "Category": " Photography , General",
        "Publisher": "Gardners Books",
        "Price Starting With ($)": "7.38",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Speaking Up",
        "Authors": "By Ruskin, Mark",
        "Description": "",
        "Category": " Business & Economics , Business Communication , General",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "GOODY A Mother Cat Story",
        "Authors": "By Bertail",
        "Description": "",
        "Category": "",
        "Publisher": "Rand McNally and CO",
        "Price Starting With ($)": "14.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1952"
        }
    },
    {
        "Title": "Serial Killers: Profiles of Today's most Terrifying Criminals(True Crime)",
        "Authors": "By editors-of-time-life",
        "Description": "Recounts the cases of Ted Bundy, John Wayne Gacy, Dennis Nilsen, and David Berkowitz, and briefly surveys earlier celebrated killers, including Jack the Ripper and the Boston Strangler",
        "Category": " Social Science , General",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "The Janson Directive",
        "Authors": "By Ludlum, Robert",
        "Description": "One of the world's greatest men has been kidnapped.Nobel laureate, international financier, and philanthropist Peter Novak - a billionaire who has committed his life and fortune to fostering democracy around the world through his Liberty Foundation - has been captured by the forces led by the near-mythical terrorist known as The Caliph. Holding Novak in a near impenetrable fortress, The Caliph has refused to negotiate for his release, planning instead to brutally execute Novak in a matter of days.Running out of time and hope, Novak's people turn to a man with a long history of defeating impossible odds: Paul Janson.  For decades, Janson was an operative and assassin whose skills and exploits made him a legend in the notorious U.S. covert agency Consular Operatations. No longer able to live with the brutality, bloodshed, and personal loss that marked his career, Janson has retired from the field and nothing could lure him back.  Nothing except Peter Novak, a man who once saved Janson's life when everyone else was powerless to help.With the considerable resources of The Liberty Foundation at his disposal, Janson hastily assembles a crack extraction team, setting in motion an ingenious rescue operation. But the operation goes horribly wrong and Janson is marked for death, the target of a \"beyond salvage\" order issued from the highest level of the government. Now he is running for his life, pursued by Jessica Kincaid, a young agent of astonishing ability who - as a student of Janson's own lethal arsenal of tactics and techniques - can anticipate and counter his every move.  To survive, Janson must outrace a conspiracy that has gone beyond the control of its originators. To win, he must counter it with a conspiracy of his own.With mere days, perhaps only hours, remaining, and shadowed by a secret that links Janson's violent life with that of the visionary peacemaker Peter Novak, Janson's only hope is to uncover the nearly unimaginable truth behind these events - a truth that has the power to foment wars, topple governments, and change the very course of history.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Sanctuaries- The Northeast: A Guide to Lodgings in Monasteries, Abbeys, and Retreats of United States",
        "Authors": "By Kelly, Jack and Kelly, Marcia",
        "Description": "Lists religious and nonsectarian retreats in the Northeastern United States, with a description of each location and information on the accommodations available",
        "Category": " Travel , Europe , Great Britain",
        "Publisher": "Harmony",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "His Lady: Sacred Promises for God's Woman",
        "Authors": "By Jakes, T. D.",
        "Description": "An inspirational collection of scripture passages, thoughts, and devotions offers solace, comfort, and strength to Christian women experiencing difficult times due to anger, despair, negative emotions, and other life stresses",
        "Category": " Religion , Biblical Criticism & Interpretation , General",
        "Publisher": "Berkley Hardcover",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Art of Food Processor Cooking",
        "Authors": "By Freiman, Jane",
        "Description": "Explains all food-processor cooking techniques, with a series of mini-lessons for beginners, a wide selection of thoroughly tested, international recipes, and a convenient food processing conversion chart for conventional recipes",
        "Category": " Cooking , General",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "12.96",
        "Publish Date": {
            "Month": "October",
            "Year": "1980"
        }
    },
    {
        "Title": "Reality Isn't What It Used to Be: Theatrical Politics, Ready-to-Wear Religion, Global Myths, Primitive Chic, and Other Wonders of the Postmodern World",
        "Authors": "By Anderson, Walter Truett",
        "Description": "Anderson reveals the reality of postmodernism in politics, popular culture, religion, literary criticism, art, and philosophy -- making sense of everything from deconstructionism to punk.",
        "Category": " Self-help , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "A Sense of History: The Best Writing from the Pages of American Heritage",
        "Authors": "By American Heritage Dictionaries",
        "Description": "Contains some of the best writing from American Heritage magazine, bringing together an informal history of America with such chapters as \"I Wish I'd Been There,\" and \"How We Have Changed.\"",
        "Category": "",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    }
]