[
    {
        "Title": "The Backyard Builder: Over 150 Build-It-Yourself Projects for Your Garden, Home, and Yard",
        "Authors": "By Warde, John (EDT)",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Maxim's Book of Big Pictures: Hot Babes, Strange Freaks and Bad, Bad Accidents",
        "Authors": "By Maxim Editors (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Ddm Pr",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Birds: Their Life, Their Ways, Their World",
        "Authors": "By Perrins, Christopher",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Readers Digest Assn",
        "Price Starting With ($)": "8.04",
        "Publish Date": {
            "Month": "October",
            "Year": "1976"
        }
    },
    {
        "Title": "Irish Trivia",
        "Authors": "By McCaffery, Mary A., Quinlan, Henry M., and Quinlan, Michael P.",
        "Description": "",
        "Category": "",
        "Publisher": "Quinlan Pr",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Lizzie McGuire: Broken Hearts - Book #7: Junior Novel",
        "Authors": "By Thorpe, Kiki and Papademetriou, Lisa",
        "Description": "Gordo's always been there for Lizzie-a true best friend. But when he starts secretly dating pretty Brooke Baker, everything changes. Now Gordo's making up stupid excuses to ditch Lizzie. Gordo's certainly not boyfriend material, so Brooke must be two-timing him. Lizzie advises Gordo to dump Brooke before he gets hurt. Plus, a cute neighborhood paperboy gives Lizzie her first kiss-and her first broken heart.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Volo",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Gourmet's America",
        "Authors": "By Yanes, Romulo A. (PHT) and Gourmet (EDT)",
        "Description": "Gathers regional recipes for soups, salads, vegetables, meat, fish, poultry, breads, and desserts",
        "Category": " Cooking , Methods , Gourmet",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Object oriented design with applications (Benjamin/Cummings series in Ada and software engineering)",
        "Authors": "By Booch, Grady",
        "Description": "",
        "Category": "",
        "Publisher": "Benjamin/Cummings Pub. Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Steamboat Annie & the Thousand Pound Catfish",
        "Authors": "By Fine, Howard (ILT) and Wright, Catherine",
        "Description": "Ernie, the troublesome, thousand-pound catfish, and his partner are back in the waters near the town of Pleasant and are causing a real ruckus in the community, so it's up to Steamboat Annie to take on the task of making Pleasant pleasant once again.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Philomel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "America's Dumbest Criminals: Based on True Stories from Law Enforcement Officials Across the Country",
        "Authors": "By Butler, Daniel R., Gregory, Leland, Ray, Alan, and Harris, Mike (ILT)",
        "Description": "100 crazy stories of America's dumbest criminals. WARNING: The crimes you are about to read are true. The names have been changed . . . to protect the ignorant.Here is the ultimate collection of the most incredibly stupid and painfully dumb attempts at crime ever brought together.The woman who invalidated her winning $5,000 lottery ticket by altering it to match the $20 prize numberThe accused vending-machine thief who paid his $400 bail entirely in quartersThe streaking robber who thought clothes would make him more identifiableThe convenience store thief who got away with just a hotdog, only to end up in the parking lot choking on the wiener",
        "Category": " Humor , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Taking AIM on Leadership",
        "Authors": "By Capezio, Peter, National Press Publications, Inc.",
        "Description": "",
        "Category": "",
        "Publisher": "National Press Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "What It Felt Like: Living in the American Century",
        "Authors": "By Allen, Henry",
        "Description": "The author of Fool's Mercy and Going Too Far Enough presents a social, cultural, and spiritual history of the twentieth century, in ten chapters that vividly capture the events, personalities, institutions, and unique character of each decade. 40,000 first printing.",
        "Category": " History , United States , 20th Century",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Democracy at Dawn: Notes from Poland and Points East (Eugenia & Hugh M. Stewart '26 Series)",
        "Authors": "By Quinn, Frederick",
        "Description": "From the sweeping changes of democratic reform to the bloody conflict of the Chechen Republic, 1993-95 was a tumultuous and critical time for Eastern Europe and the former Soviet republics. During that two-year period, Frederick Quinn toured the former Soviet empire as head of the rule of law programs of the Warsaw Office of Democratic Institutions and Human Rights (ODIHR). His primary task was to help the new nations of the region write new constitutions and rebuild their judicial systems. Keenly aware of the uniqueness of the history he was witnessing unfold, Quinn took notes of his experiences. The result is Democracy at Dawn—a personal, firsthand account of hope and nascent political and social freedom in a drab, confused, confusing, and often seemingly hopeless part of the world.         Quinn recounts the difficulties of many of the countries, as governmental and judicial habits and thought patterns held over from communist regimes, lack of equipment and supplies, shortages of food and services, and, in the case of the Chechen Republic, a devastating civil war all conspire against the formation of popular, pluralistic democracies. He also cites frustrating bureaucratic problems, both with the various host governments as well as with the administration of ODIHR. Quinn also recalls in fascinating detail his encounters with the new leaders of the region, such as Georgia's Edouard ... and ... Vaclav Havel.        At the core of this powerful memoir is Quinn's admiration for the many people he encountered, from working men and women to the functionaries at the highest levels of government, who share a desire for democracy and constitutionality—alien concepts that they nevertheless desperately want to realize. And, despite daunting obstacles faced by the former communist-bloc countries, Quinn asserts that the case for democracy may be more hopeful than it might at first appear. Public discussion about new forms of government is widespread; intense media scrutiny has helped keep the ambitions of authoritarian leaders in check; nongovernmental civic organizations are growing; and the international community has taken increased interest in holding the new states to treaty commitments involving human rights, free elections, and the creation of independent judiciaries.        Engaging and informative reading for the general reader interested in the new Eastern Europe, Democracy at Dawn also offers sociologists, historians, and political scientists a valuable inside look at the rise of democracy in Eastern Europe after the fall of the Iron Curtain. It will be of interest as well to judicial scholars concerned with the development of constitutional judicial systems in new democracies.",
        "Category": " History , Europe , Eastern",
        "Publisher": "Texas A&M University Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Forbes? Great Minds of Business",
        "Authors": "By Morgenson, Gretchen (EDT), Forbes, Timothy C., and Forbes Inc.",
        "Description": "In a collection of lively, in-depth interviews, five businessmen and women, including Andrew Grove, the head of Intel, trace their unique paths to success and analyze what it takes to be a leader. 50,000 first printing. $100,000 ad/promo.",
        "Category": " Business & Economics , Management",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Fix It, Clean It and Make It Last: The Ultimate Guide to Making Your Household Items Last Forever",
        "Authors": "By Frank W. Cawood and Associates (EDT)",
        "Description": "",
        "Category": " Self-help , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "This Old House Kitchens: A Guide to Design and Renovation Sticker: Companion to the.",
        "Authors": "By Thomas, Steve and Langdon, Philip",
        "Description": "Covers plumbing, electricity, heating and ventilation, lighting, floors, counters, storage, and kitchen equipment",
        "Category": " House & Home , Design & Construction",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "I Dreamed of Africa: Tie In Edition",
        "Authors": "By Gallmann, Kuki",
        "Description": "At the age of twenty-five, Kuki Gallman, divorced and badly injured in a devastating car accident, left Italy to convalesce in Africa with the man who would become her second husband. Enchanted by the land, they established a vast ranch on the Laikipia plateau in Kenya. But Africa's splendor came with a price. Filled with pain and joy, beauty and drama, Gallman's haunting memoir \"captures perfectly the magic of Kenya\" (The New York TImes Book Review).",
        "Category": " Fiction , Media Tie-In",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Daily Guideposts 2004: A Spirit-Lifting Devotional",
        "Authors": "By Guideposts Associates",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Ideals Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Better Homes and Gardens Annual Recipes 2000",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Books/bh&g",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Photoshop 5.5 for Windows & Macintosh, Second Edition (Visual QuickStart Guide)",
        "Authors": "By Weinmann, Elaine and Lourekas, Peter",
        "Description": "Weinmann and Lourekas have written the guides for earlier versions of the product in the series. For readers familiar with the image-manipulation software from Adobe, they explain the features of the latest release; for those new to it, they explain everything. They include several pages of color examples of twisted computer artwork and a glossary without pronunciation guides, but no bibliography. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Photography , Techniques , Equipment",
        "Publisher": "Peachpit Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Saturday Evening Post Christmas Book",
        "Authors": "By Flythe, Starkey and White, Jean",
        "Description": "",
        "Category": "",
        "Publisher": "The Curtis Publishing Co.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "It's Incredible",
        "Authors": "By Kiemel, Ann",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Tyndale House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "Burden of Truth: Defending the Truth in a World That Doesn't Believe It",
        "Authors": "By Colson, Charles W.",
        "Description": "",
        "Category": " Religion , Christianity , General",
        "Publisher": "Tyndale House Pub",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Cinematherapy: The Girl's Guide to Movies for Every Mood",
        "Authors": "By West, Beverly and Peske, Nancy K.",
        "Description": "What can take the edge off a bad day at the office better than a movie where the boss gets his (9-5)? And, of course, that close-up of Antonio Banderas, wet and naked in a cage, is the best cure for the break-up blahs known to modern science (Never Talk to Strangers). Now, for the first time, Cinematherapy acknowledges what women have known for years, and provides a sage guide to the best movie medicine currently available for whatever ails you, whether it's a sudden hormonal shift, a bad-hair day, or a full-fledged identity crisis.",
        "Category": " Performing Arts , Film , Guides & Reviews",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The Wonderful Spirit Filled Life",
        "Authors": "By Stanley, Charles F.",
        "Description": "Life abundant?Jesus promised it and we long for it, yet few Christians seem to have it. Blending lively anecdotes, commentary, and teachings from the Bible, Dr. Charles Stanley introduces you to the Holy Spirit. \"A big part of the Spirit-filled life is learning to recognize the fingerprint of the Holy Spirit. Once you know what to look for and once you begin looking for it, you will be amazed at how real the Holy Spirit will become to you. Learning to recognize the Holy Spirit is the first step in learning to live the Spirit-filled life.\"",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Beginning of Sorrows (The Omega Trilogy, Book 1)",
        "Authors": "By Morris, Gilbert, Morris, Lynn, and Morris, Alan",
        "Description": "Popular, dedicated nature worshiper, Aristide Luca Therion, becomes President of the waning United States of America when President Biship Beckwith dies in a fiery plane crash. Therion implements Project Final Unity, an electrical blackout covertly contrived by the German Union allies and Minden Lauer, Therion's spiritual mistress. The blackout is soon out of control, shutting down the entire country and bringing about chaos, anarchy, and famine. Will believers be able to once again bring hope or is thisThe Beginning of Sorrows?Note from Publisher: Due to the overall sales of the first two books in the Omega Trilogy, we regret to report that the third book, Seven Golden Vials, will not be releasing. However, we are happy to announce a new series from Gilbert Morris, debuting in the spring of 2003, tentatively titled \"The Creoles.\" Be looking for the first book to hit bookshelves early next year.",
        "Category": " Fiction , Religious",
        "Publisher": "TransitBooks.com",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Party Cakes & More Fun foods for kids",
        "Authors": "By n/a",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Forest House (The Mists of Avalon: Prequel)",
        "Authors": "By Bradley, Marion Zimmer",
        "Description": "The New York Times bestselling science fiction and fantasy author of the Avalon series introduces the prequel to the beloved and enduring classic The Mists of Avalon in this mesmerizing epic of one woman’s legendary role at a turning point in history. In a Britain struggling to survive Roman invasion, Eilan is the daughter of a Druidic warleader, gifted with visions and marked by fate to become a priestess of the Forest House. But fate also led Eilan to Gaius, a soldier of mixed blood, son of the Romans sent to subdue the native British.  For Gaius, Eilan felt forbidden love, and her terrible secret will haunt her even as she is anointed as the new High Priestess.  With mighty enemies poised to destroy the magic the Forest House shelters, Eilan must trust in the power of the great Goddess to lead her through the treacherous labyrinth of her destiny.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Donna Dewberry's One Stroke Painting Course",
        "Authors": "By Dewberry, Donna S",
        "Description": "Designer Donna Dewberry, one of the most innovative artists of home décor, creates incredibly simple one-stroke, never-take-your-brush-off-the-paper designs for beautiful painted items that will make any house a showpiece. These basic techniques, helpful worksheets, and patterns transform any object into something remarkable and decorative. Delicate ivy trim adorns a keepsake box; roses bloom on a vase; and sunflowers brighten a lamp. Paint magnificent flower-and-vine-covered stepping stones for a garden and special Christmas projects to heighten the holiday spirit. There are even complete room designs!  128 pages (all in color), 8 1/2 x 10. NEW IN PAPERBACK.",
        "Category": " Crafts & Hobbies , Painting",
        "Publisher": "Sterling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Saving Fish from Drowning",
        "Authors": "By Tan, Amy",
        "Description": "A provocative new novel from the bestselling author of The Joy Luck Club and The Bonesetter's Daughter.  On an ill-fated art expedition into the southern Shan state of Burma, eleven Americans leave their Floating Island Resort for a Christmas-morning tour-and disappear. Through twists of fate, curses, and just plain human error, they find themselves deep in the jungle, where they encounter a tribe awaiting the return of the leader and the mythical book of wisdom that will protect them from the ravages and destruction of the Myanmar military regime.  Saving Fish from Drowning seduces the reader with a fagade of Buddhist illusions, magician's tricks, and light comedy, even as the absurd and picaresque spiral into a gripping morality tale about the consequences of intentions-both good and bad-and about the shared responsibility that individuals must accept for the actions of others.  A pious man explained to his followers: \"It is evil to take lives and noble to save them. Each day I pledge to save a hundred lives. I drop my net in the lake and scoop out a hundred fishes. I place the fishes on the bank, where they flop and twirl. 'Don't be scared,' I tell those fishes. 'I am saving you from drowning.' Soon enough, the fishes grow calm and lie still. Yet, sad to say, I am always too late. The fishes expire. And because it is evil to waste anything, I take those dead fishes to market and I sell them for a good price. With the money I receive, I buy more nets so I can save more fishes.\"",
        "Category": " Fiction , Literary",
        "Publisher": "GP Putnam's Sons & Random House Publishing Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "The new Glénans sailing manual",
        "Authors": "By Centre nautique des Glénans",
        "Description": "",
        "Category": "",
        "Publisher": "distributed by W. W. Norton",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The God Who Hears",
        "Authors": "By Hunter, W. Bingham",
        "Description": "To pray is to know God.\"If God really cared he would answer my prayer.\"  \"I hesitate to ask him anything.\"  \"I can't understand why he continues to ignore my deepest needs.\"  Bingham Hunter recognizes that most believers have these thoughts from time to time.  He encourages us to look at prayer from the standpoint of who God is.The true aim of prayer is intimacy with God.  We pray effectively when we make him the desire of our hearts,  Hunter answers our questoins about prayer by directing us to the nature and attributes of God and to our own lives.  God responds not to our prayers but to who we are--what we think, feel, will and do.  Prayer is communication from the whole person to the Wholeness that is the living God.",
        "Category": " Religion , Philosophy",
        "Publisher": "IVP Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "Meet George Washington",
        "Authors": "By Heilbroner, Joan",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "23.12",
        "Publish Date": {
            "Month": "August",
            "Year": "1967"
        }
    },
    {
        "Title": "Guns, Crime, and Freedom",
        "Authors": "By Lapierre, Wayne",
        "Description": "During the Los Angeles riots, hundreds of law-abiding citizens were able to take up arms against lawless mobs to defend themselves, their families, their homes, and their businesses. They did the job police simply could not do. Lives were saved. Robberies were prevented. Homes and businesses were defended and left intact - all thanks to our constitutional right to keep and bear arms.But despite the lessons of the L.A. riots, despite the fact that millions of Americans use firearms every year to prevent violent crime, and despite the clear intent of our Founding Fathers, there are those in America who believe you do not have the right to own a gun.In Guns, Crime, and Freedom, Wayne LaPierre tells the true story.Until now, there has been no single source for Americans - gun owners and those who don't own guns but are still interested in the debate over gun control - to find the available facts surrounding the gun control argument. Guns, Crime, and Freedom has all the facts. It explores the issues of gun control, crime, and the Second Amendment, and provides documented evidence and telling statements about the agenda of those who want to ban guns.LaPierre vigorously challenges the media and their claim that private gun ownership is the cause of the spiraling crime rate that has made American streets and communities unsafe. He explains - with detailed facts - how the freedom guaranteed in our Constitution is called into question when legislation is proposed to ban guns and impose waiting periods and limitations on gun purchases.At a time when crime rates are soaring, when the \"revolving door\" criminal justice system turns convicts loose to murder, rob, and rape again, and when police seem helpless to protect innocent citizens, it is urgent, says Guns, Crime, and Freedom, that our right of self-defense not be put in jeopardy.",
        "Category": " Political Science , General",
        "Publisher": "Gateway Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "A City in Winter",
        "Authors": "By Van Allsburg, Chris and Helprin, Mark",
        "Description": "Driven to avenge the murder of her royal parents and reclaim her lost kingdom, a daring young heroine and would-be queen journeys to the beseiged city on the plain to seek out its evil conqueror, the Usurper. There she is befriended by two unlikely rebels who shield her from the Usurper and his malevolent legions, even while destiny propels her toward an inevitable confrontation - and the beginning of an epic battle.Mark Helprin's spellbinding tale reveals a city veiled in snow, at once divine and deadly. Evocatively told and beautifully rendered, A City in Winter will enchant readers of all ages. Stunning illustrations by Chris Van Allsburg lend a palpable richness to the pages, capturing all the exhilarating expanse of the story - from the pulse of the masses in the palace square to the wrath of the bloodthirsty Usurper who scours the city streets after curfew, to the opulence of an intimate dinner party set for a thousand guests....",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Viking/Ariel",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Edward VII, Prince and King",
        "Authors": "By St. Aubyn, Giles",
        "Description": "",
        "Category": "",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Potshot",
        "Authors": "By Parker, Robert B.",
        "Description": "Boston P.I. Spenser returns - heading west to the rich man's haven of Potshot, Arizona, a former mining town reborn as a paradise for Los Angeles millionaires looking for a place to escape the pressures of their high-flying lifestyles. Potshot overcame its rough reputation as a rendezvous for old-time mountain men who lived off the land, thanks to a healthy infusion of new blood and even newer money. But when this western idyll is threatened by a local gang - a twenty-first-century posse of desert rats, misfits, drunks, and scavengers - the local police seem powerless. Led by a charismatic individual known only as The Preacher, this motley band of thieves selectively exploits the town, nurturing it as a source of wealth while systematically robbing the residents blind.Enter Spenser, who has been hired by the comely Mary Lou Buckman to investigate the murder of her husband. The Buckmans, a pair of L.A. transplants, moved to Potshot and started a modest outdoor tour service. It is Mary Lou's belief that when her husband refused to pay The Preacher and his men protection money, he was killed. Without any witnesses, Spenser has little to go on, and it's clear the local police chief won't be doing much to help. Calling on his own cadre of tried-and-true cohorts, including Vinnie Morris, Bobby Horse, Chollo, Bernard J. Fortunato, Tedy Sapp, and the redoubtable Hawk, Spenser must find a way to beat the gang at their own dangerous game.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Jesus' Claims: Our Promises",
        "Authors": "By Dunnam, Maxie D., Dunnam",
        "Description": "",
        "Category": "",
        "Publisher": "Upper Room Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "King of the castle: The making of a dynasty : Seagram's and the Bronfman empire",
        "Authors": "By Newman, Peter Charles",
        "Description": "",
        "Category": "",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "19.71",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Crashing the Gate: Netroots, Grassroots, and the Rise of People-Powered Politics",
        "Authors": "By Armstrong, Jerome, Rosenberg, Simon (FRW), and Moulitsas Zuniga, Markos",
        "Description": "Crashing the Gate is a shot across the bow at the political establishment in Washington, DC and a call to re-democratize politics in America.This book lays bare, with passion and precision, how ineffective, incompetent, and antiquated the Democratic Party establishment has become, and how it has failed to adapt and respond to new realities and challenges. The authors save their sharpest knives to go for the jugular in their critique of Republican ideologues who are now running--and ruining--our country.Written by two of the most popular political bloggers in America, the book hails the new movement--of the netroots, the grassroots, the unorthodox labor unions, the maverick big donors--that is the antidote to old-school politics as usual. Fueled by advances in technology and a hunger for a more authentic and populist democracy, this broad-based movement is changing the way political campaigns are waged and managed.A must-read book for anyone with an interest in the future of American democracy.",
        "Category": " Political Science , Political Process , Political Parties",
        "Publisher": "Chelsea Green Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Dancing Through Life in a Pair of Broken Heels",
        "Authors": "By Guisewite, Mickey and Guisewite, Cathy (ILT)",
        "Description": "Forty-one hilarious short essays, accompanied by zany cartoons, shed new light on the key mysteries of modern life: including How did the lunch hour shrink to seven minutes? and Why is it impossible to agree with your mother? Reprint.",
        "Category": " Humor , Form , Essays",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Instant Physics: From Aristotle to Einstein, and Beyond",
        "Authors": "By Rothman, Tony",
        "Description": "For all of you who break out in a sweat at the thought of thermodynamics, or freeze up at the mention of quantum mechanics, like a bolt from the blue, INSTANT PHYSICS will zap you through the fascinating history of our most basic, yet baffling, science.From the thousand-year search for proof of the existence of the ever-elusive atom to the varied and heated arguments behind the big bang theory, INSTANT PHYSICS answers all the heavy questions with a light touch. You'll learn:* How the Greek philosophers used the sledgehammer of mathematics to break apart the mysteries of the physical universe.* Why gravity is a \"romantic\" force.* How to tell the difference between a gluon, a meson, and a quark, even if you can't see them.INSTANT PHYSICS is crammed with special features, including chapter summaries, who's who lists, biographical and historical tidbits, and a host of illustrations, photos, equations, diagrams, and drawings.",
        "Category": " Reference , Research",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "The Twisted Root: A William Monk Mystery",
        "Authors": "By Perry, Anne",
        "Description": "In a stunning feat of the imagination, Anne Perry encloses readers within the magic circle of her genius and brings to life the lost world of England's Victorian Age. Hoofbeats clatter on cobblestones, gaslight glimmers through fog, and in the exclusive privacy of elegant drawing rooms, powerful men and women once again live the splendor and shame of that matchless era. With The Twisted Root, Perry holds us rapt with a chilling story of love, betrayal, and consummate evil.As private investigator William Monk listens to young Lucius Stourbridge plead for help in tracking down his runaway fiancée, he feels a sense of heavy foreboding. Miriam Gardiner disappeared suddenly from a croquet party at the luxurious Bayswater mansion of her in-laws-to-be, and has not been seen since. But on Hampstead Heath, Monk finds the coach in which Miriam had fled and, nearby, the murdered body of the coachman. There is no trace of Miriam.What strange compulsion could have driven the beautiful widow to abandon the prospect of a loving marriage and financial abundance? Monk's attempt to answer that question proves a challenge, as Miriam Gardiner's fateful flight ends in a packed London courtroom where brilliant barrister Oliver Rathbone wages an uphill battle to absolve her from a charge of murder. And in a race with the hangman, Monk and clever nurse Hester Latterly--themselves now newlyweds--desperately pursue the elusive truth . . . and an unknown killer whose malign brilliance they have scarcely begun to fathom.",
        "Category": " Fiction , Literary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Boxers to Bandits The Extraordinary Story of Jimmy and Sophie Graham, Pioneer Missionaries in China 1889-1910",
        "Authors": "By Fortosis, Stephen and Reid, Mary Graham",
        "Description": "",
        "Category": "",
        "Publisher": "Billy Graham Evangelistic Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Goodnight Nobody: A Novel",
        "Authors": "By Weiner, Jennifer",
        "Description": "New York Times bestselling author Jennifer Weiner’s unforgettable story of adjusting to suburbia—and all the surprises hidden behind its doors.For Kate Klein, a semi-accidental mother of three, suburbia has been full of unpleasant surprises. Her once-loving husband is hardly ever home. The supermommies on the playground routinely snub her. Her days are spent carpooling and enduring endless games of Candy Land, and at night, most of her orgasms are of the do-it-yourself variety.  When a fellow mother is murdered, Kate finds that the unsolved mystery is the most exciting thing to happen in Upchurch, Connecticut, since her neighbors broke ground for a guesthouse and cracked their septic tank. Even though the local police chief warns her that crime-fighting's a job best left to the professionals, Kate launches an unofficial investigation -- from 8:45 to 11:30 on Mondays, Wednesdays, and Fridays, when her kids are in nursery school.  As Kate is drawn deeper into the murdered woman's past, she begins to uncover the secrets and lies behind Upchurch's picket-fence facade -- and considers the choices and compromises all modern women make as they navigate between marriage and independence, small towns and big cities, being a mother and having a life of one's own.",
        "Category": " Fiction , Women",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "800 insulators;: Priced & illustrated",
        "Authors": "By Bill Schroeder",
        "Description": "",
        "Category": "",
        "Publisher": "Printed by the Letter Shop",
        "Price Starting With ($)": "20.84",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The Nature Photographer's Complete Guide to Professional Field Techniques",
        "Authors": "By Shaw, John",
        "Description": "Discusses the use of photographic equipment and lenses and offers advice on methods for photographing natural scenes in all types of lighting",
        "Category": " Photography , General",
        "Publisher": "Watson-Guptill Pubns",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "Shrink Your Female Fat Zones:Lose Pounds And Inches - Fast! - From Your Belly,Hips,Thighs,And More",
        "Authors": "By Austin, Denise",
        "Description": "Presents a workout plan that targets specific female \"fat zones,\" and includes exercises and nutritional advice designed to reduce fat.",
        "Category": " Health & Fitness , Exercise , General",
        "Publisher": "RODALE PR INC",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "A Great and Terrible Beauty (The Gemma Doyle Trilogy)",
        "Authors": "By Bray, Libba",
        "Description": "The first book in the critically acclaimed New York Times, USA Today, and Publishers Weekly bestselling Gemma Doyle trilogy, the exhilarating and haunting saga from the author of The Diviners series and Going Bovine.It’s 1895, and after the suicide of her mother, 16-year-old Gemma Doyle is shipped  off from the life she knows in India to Spence, a proper boarding school in England.  Lonely, guilt-ridden, and prone to visions of the future that have an uncomfortable  habit of coming true, Gemma’s reception there is a chilly one. To make things worse,  she’s been followed by a mysterious young Indian man, a man sent to watch her. But  why? What is her destiny? And what will her entanglement with Spence’s most powerful  girls—and their foray into the spiritual world—lead to? “A delicious, elegant gothic.”—PW, Starred “Shivery with both passion and terror.”—Kirkus Reviews \"Compulsively readable.\" --VOYA A New York Times BestsellerA Publishers Weekly BestsellerA Book Sense BestsellerBBYA (ALA/YALSA Best Book for Young Adults)Iowa High School Book AwardGarden State Teen Book AwardPennsylvania Young Reader’s Choice Award",
        "Category": " Young Adult Fiction , Historical , Europe",
        "Publisher": "Ember",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The papers of Adlai E. Stevenson",
        "Authors": "By Johnson, Walter",
        "Description": "",
        "Category": "",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Ac/Dc Electricity and Electronics Made Easy",
        "Authors": "By Veley, Victor F. C",
        "Description": "Covers mechanical units, electrical units, resistor networks, voltage, magnetic circuits, inductance, capacitance, network theorems, resonance, complex algebra, filters, generators, motors, waveforms and electrical measurements",
        "Category": " Technology & Engineering , General",
        "Publisher": "Tab Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "The Purpose Driven Life",
        "Authors": "By Warren, Rick",
        "Description": "Another Landmark Book by Rick Warren.You are not an accident. Even before the universe was created, God had you in mind, and he planned you for his purposes. These purposes will extend far beyond the few years you will spend on earth. You were made to last forever!Self-help books often suggest that you try to discover the meaning and purpose of your life by looking within yourself, but Rick Warren says that is the wrong place to start. You must begin with God, your Creator, and his reasons for creating you. You were made by God and for God, and until you understand that, life will never make sense.This book will help you understand why you are alive and God's amazing plan for you---both here and now, and for eternity. Rick Warren will guide you through a personal 40-day spiritual journey that will transform your answer to life's most important question: What on earth am I here for?  Knowing God's purpose for creating you will reduce your stress, focus your energy, simplify your decisions, give meaning to your life, and, most importantly, prepare you for eternity.The Purpose Driven Life is a blueprint for Christian living in the 21st century---a lifestyle based on God's eternal purposes, not cultural values. Using over 1,200 scriptural quotes and references, it challenges the conventional definitions of worship, fellowship, discipleship, ministry, and evangelism. In the tradition of Oswald Chambers, Rick Warren offers distilled wisdom on the essence of what life is all about. This is a book of hope and challenge that you will read and re-read, and it will be a classic treasured by generations to come.",
        "Category": " Religion , Christian Living , Spiritual Growth",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Friendly Fire in the Civil War: More Than 100 True Stories of Comrade Killing Comrade",
        "Authors": "By Garrison, Webb B.",
        "Description": "Through stories of defective ammunition, accidental shooting, inexperienced troops, and deliberate firings, this book is the first to identify when Yankee killed Yankee and Confederate killed Confederate. These tragic accounts strip away the romanticism of the Civil War.",
        "Category": " History , Military , United States",
        "Publisher": "Rutledge Hill Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "The Reading Group: A Novel",
        "Authors": "By Noble, Elizabeth",
        "Description": "The Reading Group follows the trials and tribulations of a group of women who meet regularly to read and discuss books.Over the course of a year, each of these women become intertwined, both in the books they read and within each other's lives.Inspired by a shared desire for conversation, a good book and a glass of wine-Clare, Harriet, Nicole, Polly, and Susan undergo startling revelations and transformations despite their differences in background, age and respective dilemmas.What starts as a reading group gradually evolves into a forum where the women may express their views through the books they read and grow to become increasingly more open as the bonds of friendship cement.In The Reading Group, Noble reveals the many complicated paths in life we all face as well as the power and importance of friendship.This P.S. edition features an extra 16 pages of insights into the book, including author interviews, recommended reading, and more.",
        "Category": " Fiction , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Illuminator",
        "Authors": "By Vantrease, Brenda Rickman",
        "Description": "A glowing first novel that brings us \"historical fiction in the grand epic manner, beautifully felt and written\"It is England, in the fourteenth century -- a time of plague, political unrest and the earliest stirrings of the Reformation. The printing press had yet to be invented, and books were rare and costly, painstakingly lettered by hand and illuminated with exquisite paintings. Finn is a master illuminator who works not only for the Church but also, in secret, for John Wycliffe of Oxford, who professes the radical idea that the Bible should be translated into English for everyone to read. Finn has another secret as well, one that leads him into danger when he meets Lady Kathryn of Blackingham Manor, a widow struggling to protect her inheritance from the depredations of Church and Crown alike. Finn's alliance with Lady Kathryn will take us to the heart of what Barbara Tuchman once called \"the calamitous fourteenth century.\" Richly detailed and irresistibly compelling, Brenda Rickman Vantrease's The Illuminator is a glorious story of love, art, religion, and treachery at an extraordinary turning point in history.",
        "Category": " Fiction , Historical",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Flip the Switch",
        "Authors": "By Cooper, Robert K. and Cooper, Leslie L.",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale Press, Inc.",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Bishop and the Beggar Girl of St. Germain (A Father Blackie Ryan Mystery)",
        "Authors": "By Greeley, Andrew M.",
        "Description": "A priest has gone missing in Paris, and Bishop Blackie Ryan is sent to the rescue. The missing cleric is not just an ordinary Dominican friar, but the most popular priest in all of France. Popular because in a very short time Frere Jean-Claude - a simple, pious priest of humble origins - has become a television superstar, idolized by the people of France, a traditionally anticlerical country. Loved by everyone except, of course, the French hierarchy, the church, state, and television community.The Archbishop of Paris, familiar with Bishop Blackie's impressive sleuthing skills, asks the Archbishop of Chicago and Blackie's boss, Sean Cardinal Cronin, for help in finding this missing priest. As usual, Cardinal Cronin resolves the matter with a brusque \"See to it, Blackie?'At the door of the church of St-Germain-des-Pres, Blackie meets a young and beautiful woman begging for money. When he hires her as a translator, she turns out to be an excellent Dr. Watson and a brilliant musician as well. She is at his side for the entire investigation. He soon learns that the Church isn't eager to have the young, innocent, and saintly priest returned, nor are the police. Once the public discovers the disappearance of their beloved priest, the miracles start, and nothing scares the Church more than miracles.Undaunted, Blackie - with the help of his beautiful, young, smart sidekick - defies the cynical and uncooperative Paris police, an unbending church, and reluctant witnesses to find the bizarre solution to one of the most fascinating puzzles he has ever encountered.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The Genesis Wave Book One (Star Trek: The Next Generation)",
        "Authors": "By Vornholt, John",
        "Description": "Intended to create life from nothingness, the Genesis Device had the potential to become a weapon of awe-inspiring destructiveness, capable of rearranging matter and life energy on a planetary scale. After the cataclysmic explosion of the Genesis Planet, and the Klingon Empire's attempt to steal the top-secret technology for its own military purposes, Starfleet wisely decided to destroy all data and records on Project Genesis, hoping to bury its deadly secrets forever.Nearly a century later, all that remains of Genesis is the knowledge stored in the mind of an elderly, almost-forgotten scientist named Dr. Carol Marcus. But Dr. Marcus has gone missing, and a menace from bygone days has come rushing back with a vengeance.",
        "Category": " Fiction , Science Fiction , Space Opera",
        "Publisher": "Star Trek",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Joy of Being Single",
        "Authors": "By Zobel-Nolan, Allia and Chast, Roz (ILT)",
        "Description": "Forget rumors about married people living longer, or that single people are miserable, or that two can live as cheaply as one: married people started these rumors out of pure jealousy. Which inspired single freelance humorist Allia Zobel to correct the record. Joined by New Yorker cartoonist Roz Chast in her first-ever collaborative effort, the authors refute the bad rap singles have gotten with dozens of insightful, irrefutable reasons to celebrate living alone. 138,000 copies in print. Illustrated by Roz Chast.",
        "Category": " Comics & Graphic Novels , General",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Mommy Made and Daddy Too: Home Cooking for a Healthy Baby & Toddler",
        "Authors": "By Kimmel, Martha",
        "Description": "Gathers recipes for fruits, vegetables, poultry, meat, fish, pasta, cereals, snacks, and desserts suitable for young children",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "All Women Are Healers: A Comprehensive Guide to Natural Healing",
        "Authors": "By Stein, Diane",
        "Description": "&#147;By the study, experimentation and practice of natural healing, women are changing and charting the future of health care. Despite heavy resistance or lack of recognition from patriarchal medicine, they are nevertheless making positive changes that will continue and increase. Women&#146;s emphasis on one-to-one work practiced in mutual agreement and participation is very different from mechanized and big-money medicine, and has results and successes far beyond expectations. The emphasis on self-healing returns health care to the consumer, to women&#146;s lives and bodies, for the first time in centuries. The medical system cannot control a movement held in the hands of women, though it may try. Women are taking control again of healing, our daughter-right, for the first time since the matriarchies and the Inquisition.&#148;&#151;from the Introduction",
        "Category": " Health & Fitness , Healing",
        "Publisher": "Crossing Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "The Spectator Bird (Contemporary American Fiction)",
        "Authors": "By Stegner, Wallace Earle",
        "Description": "Joe Allston is a retired literary agent who is, in his own words, \"just killing time until time gets around to killing me.\" His parents and his only son are long dead, leaving him with neither ancestors nor descendants, tradition nor ties. His job, trafficking the talent of others, had not been his choice. He passes through life as a spectator.A postcard from a friend causes Allston to return to the journals of a trip he had taken years before, a journey to his mother's birthplace, where he'd sought a link with the past. The memories of that trip, both grotesque and poignant, move through layers of time and meaning, and reveal that Joe Allston isn't quite spectator enough.\"Elegant and entertaining . . . Every scene [is] adroitly staged and each effect precisely acomplished.\"The Atlantic",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Glorious Appearing: The End of Days",
        "Authors": "By LaHaye, Tim F. and Jenkins, Jerry B.",
        "Description": "Thousands of years of human history stained by strife, death, and sin come to an end when the King of Glory returns to earth. The satisfying conclusion of the seven years of Tribulation covered by the Left Behind series portrays the return of Jesus Christ to earth in both glory and judgment. At the height of the battle between the forces of evil gathered at Armageddon and the remaining Christian believers at Petra and Jerusalem, nothing seems to be able to stop the Antichrist, Nicolae Carpathia. But God has another plan.",
        "Category": " Fiction , Religious",
        "Publisher": "Tynedale House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "October Song",
        "Authors": "By Lewis, Beverly",
        "Description": "From newlyweds Katie and Dan living in the shadow of the shunning, to Rachel and Philip embracing parenthood even as he acclimates to Amish life as an outsider... From the courtship of Lydia Cottrell and her betrothed, Levi King, to Sarah Cain, now a wife and mother struggling to bridge her own life with that of the People... October Song is overflowing with the simpler things of life that make a Lewis novel an unforgettable journey into the depths of the human heart.",
        "Category": " Fiction , Religious",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Realty Check",
        "Authors": "By Anthony, Piers",
        "Description": "For the visit of their granddaughter and grandson, Penn and Chandelle got a house in Philadelphia that is rent-free for a month, and soon discover the house's fantastical properties, but they must now find out what the house wants in return.",
        "Category": " Fiction , Classics",
        "Publisher": "Write Way Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Scandinavian Humor and Other Myths",
        "Authors": "By Anderson, John Louis",
        "Description": "Filled with jokes, quizzes, anecdotes, stories, and illustrations to amuse Nordics and others, on topics ranging from how to tell Scandinavians apart to the best in Swedish insults",
        "Category": " Social Science , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "1,000 Places to See Before You Die: A Traveler's Life List",
        "Authors": "By Schultz, Patricia",
        "Description": "Introducing the Eighth Wonder of travel books, the New York Times bestseller that's been hailed by CBS-TV as one of the best books of the year and praised by Newsweek as  the \"book that tells you what's beautiful, what's inspiring, what's fun and what's just unforgettable everywhere on earth.\" Packed with recommendations of the world's best places to visit, on and off the beaten path, 1,000 Places To See Before You Die is a joyous, passionate gift for travelers, an around-the-world, continent-by-continent listing of beaches, museums, monuments, islands, inns, restaurants, mountains, and more. There's Botswana's Okavango Delta, the covered souks of Aleppo, the Tuscan hills surrounding San Gimignano, Canyon de Chelly, the Hassler hotel in Rome, Ipanema Beach, the backwaters of Kerala, Oaxaca's Saturday market, the Buddhas of Borobudur, Ballybunion golf club-all the places guaranteed to give you the shivers.The prose is gorgeous, seizing on exactly what makes each entry worthy of inclusion. And, following the romance, the nuts and bolts: addresses, phone numbers, websites, costs, and best times to visit—all updated for 2010 with the most current information.",
        "Category": " Travel , Reference",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "High Country (Anna Pigeon Mysteries)",
        "Authors": "By Barr, Nevada",
        "Description": "It's fall in the Sierra Mountains, and Anna Pigeon is slinging hash in Yosemite National Park's historic Ahwahnee Hotel. Four young people, all seasonal park employees, have disappeared, and two weeks of work by crack search-and-rescue teams have failed to turn up a single clue; investigators are unsure as to whether the four went AWOL for reasons of their own-or died in the park. Needing an out-of-park ranger to work undercover, Anna is detailed to dining-room duty; but after a week of waiting tables, she knows the missing employees are only the first indications of a sickness threatening the park.  Her twenty-something roommates give up their party-girl ways and panic; her new restaurant colleagues regard her with suspicion and fear. But when Anna's life is threatened and her temporary supervisor turns a deaf ear, she follows the scent of evil, taking a solo hike up a snowy trial to the high country, seeking answers. What waits for her is a nightmare of death and greed-and perhaps her final adventure.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "A Child Called It: One Child's Courage to Survive",
        "Authors": "By Pelzer, David J.",
        "Description": "This book chronicles the unforgettable account of one of the most severe child abuse cases in California history. It is the story of Dave Pelzer, who was brutally beaten and starved by his emotionally unstable, alcoholic mother: a mother who played tortuous, unpredictable games--games that left him nearly dead. He had to learn how to play his mother's games in order to survive because she no longer considered him a son, but a slave; and no longer a boy, but an \"it.\"Dave's bed was an old army cot in the basement, and his clothes were torn and raunchy. When his mother allowed him the luxury of food, it was nothing more than spoiled scraps that even the dogs refused to eat. The outside world knew nothing of his living nightmare. He had nothing or no one to turn to, but his dreams kept him alive--dreams of someone taking care of him, loving him and calling him their son.",
        "Category": " Family & Relationships , Abuse , General",
        "Publisher": "Health Communications Inc",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Tension-Free Golf: Unleashing Your Greatest Shots More Often",
        "Authors": "By Reinmuth, Dean",
        "Description": "",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Triumph Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Feng Shui: The Book of Cures",
        "Authors": "By Wydra, Nancilee",
        "Description": "In Feng Shui: The Book of Cures, expert Nancilee Wydra offers 150 easy, inexpensive solutions for making the home or workplace an uplifting, life-affirming space. This unique book details the incredible impact spaces have on people and then shows how to adjust factors such as lighting, furniture, and objects for a happier, healthier environment.",
        "Category": " Body, Mind & Spirit , Feng Shui",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Man Eaters Motel",
        "Authors": "By Rose, Alan and Boyles, Denis",
        "Description": "The author relates his adventures on a railroad journey through East Africa and explores both the romantic past and the turbulent present of Zanzibar and Kenya",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Making the Most of College: Students Speak Their Minds",
        "Authors": "By Light, Richard J.",
        "Description": "Why do some students make the most of college, while others struggle and look back on years of missed deadlines and missed opportunities? What choices can students make, and what can teachers and university leaders do, to improve more students’ experiences and help them achieve the most from their time and money? Most important, how is the increasing diversity on campus—cultural, racial, and religious—affecting education? What can students and faculty do to benefit from differences, and even learn from the inevitable moments of misunderstanding and awkwardness?From his ten years of interviews with Harvard seniors, Richard Light distills encouraging—and surprisingly practical—answers to fundamental questions. How can you choose classes wisely? What’s the best way to study? Why do some professors inspire and others leave you cold? How can you connect what you discover in class to all you’re learning in the rest of life? Light suggests, for instance: studying in pairs or groups can be more productive than studying alone; the first and most important skill to learn is time management; supervised independent research projects and working internships offer the most learning and the greatest challenges; and encounters with students of different religions can be simultaneously the most taxing and most illuminating of all the experiences with a diverse student body.Filled with practical advice, illuminated with stories of real students’ self-doubts, failures, discoveries, and hopes, Making the Most of College is a handbook for academic and personal success.",
        "Category": " Education , Higher",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "The Art of Sexual Magic",
        "Authors": "By Anand, Margot",
        "Description": "Restoring a sense of sacred significance to the act of lovemaking, the practice of sexual magic also enables couples to celebrate the highest form of erotic communication. Sexuality becomes a way to honor both physical instincts and spiritual yearnings.A world-renowned expert in the field of Tantric sexuality, Anand sensitively guides readers through a series of unique exercises, many of which are based on ancient erotic rituals. In the process, readers will become \"sexual magicians,\" gaining enchanting new powers that are magically accessible to every man and woman.Beautifully illustrated, with more than sixty explanatory drawings, The Art of Sexual Magic is a life-changing book for those who seek to discover the magic potential of sexual energy. It invites lovers on an exciting, unexplored pathway and richly rewarding journey.",
        "Category": " Psychology , Human Sexuality",
        "Publisher": "G P Putnam's Sons, NY",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Basic Christianity",
        "Authors": "By Stott, John R. W. and Stott, D., Jr.",
        "Description": "",
        "Category": " Religion , Christian Theology , Apologetics",
        "Publisher": "Wm. B. Eerdmans Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1959"
        }
    },
    {
        "Title": "Taste of Home Low-Fat Country Cooking",
        "Authors": "By Schnittka, Julie (EDT)",
        "Description": "",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Reiman Assoc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Fishes and How They Live",
        "Authors": "By fichter, george",
        "Description": "",
        "Category": "",
        "Publisher": "Golden P; Bailey & Swinfen",
        "Price Starting With ($)": "15.77",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "Harcourt School Publishers Science: Student Edition Grade 1 2000",
        "Authors": "By Houghton Mifflin Company (COR)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Science & Nature , General",
        "Publisher": "HARCOURT SCHOOL PUBLISHERS",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "500 Years of Life in America: An Illustated History",
        "Authors": "By Davidson, Marshall B",
        "Description": "",
        "Category": "",
        "Publisher": "-",
        "Price Starting With ($)": "7.33",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Dingley Falls",
        "Authors": "By Malone, Michael",
        "Description": "In the sleepy town of Dingley Falls, Connecticut, something funny is going on. Strange forces are pulling together the oddest of couples: a mild-mannered matron and a lascivious avant-garde poet; a sleek headmaster and a shy young curate; a hippie librarian and the wayward daughter of a local tycoon. What's more, mailboxes are being stuffed with shockingly violent hate letters, even as a mysterious ailment takes the lives of perfectly healthy people. Not to mention the strange lights flashing in the depths of the forest...With a sparkling range of characters who hurtle through an intricate and often hilarious journey, Michael Malone offers a sublime joyride in his classic novel.",
        "Category": " Fiction , Humorous",
        "Publisher": "Sourcebooks Landmark",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "When Your Rope Breaks",
        "Authors": "By Stephen Brown",
        "Description": "Stresses that people are imperfect, explains that following Christ is no guarantee of escaping life's trials, and tells how to find strength in one's faith",
        "Category": "",
        "Publisher": "Thomas Nelson Pub.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Playboys and Killjoys: An Essay on the Theory and Practice of Comedy",
        "Authors": "By Levin, Harry",
        "Description": "Harry Levin is one of the major literary critics in America. This book is a brilliant and original study of the whole world of comedy, concentrating on playwrights through the centuries, from Aristophanes and Plautus in classical times to Bernard Shaw and Bertolt Brecht and their recent successors.Theories about the subject of comedy have abounded, but they have generally been divorced from theatrical practice.  The alternative--discussions of plays and playwrights, without defining or analyzing the problems they have in common--is also unsatisfying.  Moreover, many critics, in trying to make the subject of humor \"respectable\" have treated the subject humorlessly, while others have succumbed to the temptation to be flip.Levin views the comic repertory as a richly variegated but broadly unified whole and provides a synthesis of theory and practice plus a further synthesis of theories heretofore regarded as conflicting.  He isolated two fundamental aspects of comedy: one centers on the ludicrous (irresponsible, irreverent) \"playboy\" whom we laugh with, and the other on the ridiulous (pretentious, forbidding) \"killjoy\", whom we laugh at.  Levin traces the dialectical interplay of these components throughout history and across various cultures and media.  He places strong emphasis on such major dramatists as Shakespeare, Ben Jonson, Moliï¿½re, and William Congreve.  He comments on the nature and theory of comedy as enunciated by such famous figures as George Meredith and Henri Bergson, and includes essays on such related ideas as humor, satire, and games; but the emphasis throughout is on the plays and on the stage, with incidental reference to comedians like Charlie Chaplin and the Marx Brothers.About the Author:Harry Levin is Irving Babbitt Professor of Comparative Literature Emeritus at Harvard University.  His many books include The Question of Hamlet and Shakespeare and the Revolution of the Times.",
        "Category": " Performing Arts , Comedy",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "Otherwise Engaged",
        "Authors": "By Gray, Simon",
        "Description": "",
        "Category": "",
        "Publisher": "Viking Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Almanac of American History",
        "Authors": "By Schlesinger, Arthur M.",
        "Description": "",
        "Category": "",
        "Publisher": "Gazelle Book Services Ltd",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "RFK: A Candid Biography of Robert F. Kennedy",
        "Authors": "By Heymann, C. David",
        "Description": "A definitive, intimate, multi-faceted biography of Robert Kennedy examines RFK's family life, political career, private liaisons, lovers, and his dealings with J. Edgar Hoover, Martin Luther King, Jr., Jimmy Hoffa, and other famous figures. 125,000 first printing. First serial, People. Tour.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Becoming a Writer",
        "Authors": "By Brande, Dorothea Thompson",
        "Description": "A reissue of a classic work published in 1934 on writing and the creative process, Becoming a Writer recaptures the excitement of Dorothea Brande's creative writing classroom of the 1920s. Decades before brain research \"discovered\" the role of the right and left brain in all human endeavor, Dorothea Brande was teaching students how to see again, how to hold their minds still, and how to call forth the inner writer.",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1981"
        }
    },
    {
        "Title": "The Miser and Other Plays (Penguin Classics)",
        "Authors": "By Moliere",
        "Description": "Contains background information on Moliere's career and style as well as the text of five comedies about human life and character",
        "Category": " Drama , General",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1953"
        }
    },
    {
        "Title": "Gardener's Latin: A Lexicon (English and Latin Edition)",
        "Authors": "By Neal, Bill",
        "Description": "A compilation of Latin terms that describe and distinguish among plants and flowers, with brief, clear definitions, and related lore which fills the margins of each page. Introduction by Barbara Damrosch. Beautifully produced would make a lovely gift for any gardener. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Gardening , Reference",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "The Girl in the Picture: The Story of Kim Phuc, the Photograph, and the Vietnam War",
        "Authors": "By Chong, Denise",
        "Description": "On June 8, 1972, nine-year-old Kim Phuc, severely burned by napalm, ran from her blazing village in South Vietnam and into the eye of history. Her photograph-one of the most unforgettable images of the twentieth century-was seen around the world and helped turn public opinion against the Vietnam War.This book is the story of how that photograph came to be-and the story of what happened to that girl after the camera shutter closed. Award-winning biographer Denise Chong's portrait of Kim Phuc-who eventually defected to Canada and is now a UNESCO spokesperson-is a rare look at the Vietnam War from the Vietnamese point-of-view and one of the only books to describe everyday life in the wake of this war and to probe its lingering effects on all its participants.",
        "Category": " History , Military , Vietnam War",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "To America: Personal Reflections of an Historian",
        "Authors": "By Ambrose, Stephen E.",
        "Description": "In To America, Stephen E. Ambrose, one of the country's most influential historians, reflects on his long career as an American historian and explains what an historian's job is all about. He celebrates America's spirit, which has carried us so far. He confronts its failures and struggles. As always in his much acclaimed work, Ambrose brings alive the men and women, famous and not, who have peopled our history and made the United States a model for the world.  Taking a few swings at today's political correctness, as well as his own early biases, Ambrose grapples with the country's historic sins of racism, its neglect and ill treatment of Native Americans, and its tragic errors (such as the war in Vietnam, which he ardently opposed on campus, where he was a professor). He reflects on some of the country's early founders who were progressive thinkers while living a contradiction as slaveholders, great men such as Washington and Jefferson. He contemplates the genius of Andrew Jackson's defeat of a vastly superior British force with a ragtag army in the War of 1812. He describes the grueling journey that Lewis and Clark made to open up the country, and the building of the railroad that joined it and produced great riches for a few barons.  Ambrose explains the misunderstood presidency of Ulysses S. Grant, records the country's assumption of world power under the leadership of Theodore Roosevelt, and extols its heroic victory of World War II. He writes about women's rights and civil rights and immigration, founding museums, and nation- building. He contrasts the presidencies of Dwight Eisenhower, John F. Kennedy, Richard Nixon, and Lyndon B. Johnson. Throughout, Ambrose celebrates the unflappable American spirit.  Most important, Ambrose writes about writing history. \"The last five letters of the word 'history' tell us that it is an account of the past that is about people and what they did, which is what makes it the most fascinating of subjects.\"   To America is an instant classic for all those interested in history, patriotism, and the love of writing.",
        "Category": " History , United States , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Sisson's Word and Expression Locater",
        "Authors": "By Sisson, Albert Franklin",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall Trade",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "June",
            "Year": "1966"
        }
    },
    {
        "Title": "The Divine Mercy Message and Devotion",
        "Authors": "By Michalenko, Seraphim, Flynn, Vinnie, and Stackpole, Robert A.",
        "Description": "",
        "Category": " Religion , Christianity , General",
        "Publisher": "Marian Press",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1982"
        }
    },
    {
        "Title": "Time Power: A Proven System for Getting More Done in Less Time Than You Ever Thought Possible",
        "Authors": "By Tracy, Brian",
        "Description": "Reveals the author's strategies for taking complete control of one's time and using it to get more done, increasing productivity and income exponentially, including how to make better, faster decisions, and overcoming people problems that can sap time. 60,000 first printing.",
        "Category": " Business & Economics , Time Management",
        "Publisher": "Amacom Books",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "John Gottlieb Morris: Man of God, Man of Science",
        "Authors": "By Kurtz, Michael J.",
        "Description": "John Gottlieb Morris was the first librarian of the Peabody Institute in Baltimore, founder of Lutherville, Maryland, and of the Lutherville Female Academy, an early geological and botanical scientist whose specimens from nature were fundamental to the development of the early Smithsonian Institution, and a nationally prominent Lutheran pastor. From the relationship between geology and biblical revelation to the need for American leadership in science, this combative clergyman fought continually for the advancement of knowledge, culture and morality.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "The Maryland Historical Society",
        "Price Starting With ($)": "10.15",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Cooking for Absolute Beginners",
        "Authors": "By Fitzsimmons, Muriel Simpson",
        "Description": "Which is the best cookbook for a beginner? Over the years, many beginning cooks have found this cookbook to be their favorite. It assumes no previous cooking knowledge at all, and it takes absolutely nothing for granted. Complete, well-organized, and extremely thorough, this cookbook progresses slowly and clearly so that you know exactly what to do every step of the way.Even before the first recipe appears, there are pages of important information you need to know: a long list of definitions, tables of measurements and equivalents, and commentary on stoves and kitchen tools. The simplest meal is breakfast, so the first recipes are for preparing fresh and stewed fruits, breakfast cereals, coffee and tea, eggs, breakfast meats, and toast. Then the author tells you how to have a complete meal ready on time and all about seasonings.The meat of the book is next: chapters on buying and cooking meats, fish and seafood, poultry and game, vegetables from artichokes to turnips, and how to make basic sauces, soups, cereal products, casseroles, salads and salad dressings, breads and biscuits, desserts (pies, cookies, cake, and more), and some jams and jellies.Most cooks only learn the basics of cooking when it's absolutely necessary — after a recipe fails because the cook was unclear about what to do. This book teaches you the essentials of cooking at the beginning and gets you started in the right direction. Beginners will find it invaluable, and experienced cooks will learn a few things from it as well — things they should have learned when they were beginners.",
        "Category": " Cooking , Methods , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2011"
        }
    },
    {
        "Title": "Management Communication",
        "Authors": "By Bell, Arthur H. and Smith, Dayle M.",
        "Description": "Effective managerial communication starts with an effective learning tool. Designed for an upper level undergrad, MBA, or Executive MBA course, Management Communication teaches students the essential writing and speaking skills within a business management context. Coverage includes intercultural communication, gender related issues, diversity issues, technology, media, crisis, and conflict resolution. Communication skills for leadership and team building are also developed. And students will gain a real-world perspective since the authors have applied communication concepts and techniques in such fields as retail sales, manufacturing, real estate, and corporate financial management. Key Features: * The text provides a focused and concise approach to the key concepts. * Includes cases with writing and speaking assignments designed for individual and group work. Additional cases can be found in the instructor's manual. * The authors explain the material in a conversational style, then encourage students to \"try it - evaluate it - perfect it.\" * Students will learn to apply communication skills in various business fields. * Many of the exercises and assignments are intended to get students to explore and use the Internet. * A web site for the text provides an Internet guide consisting of over 600 Web addresses and descriptions, including information on job search, presentation skills, aids for business writers, and other related subjects. * Visit the web site at www.wiley.com/college/bell",
        "Category": " Business & Economics , Business Communication , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The All-True Travels and Adventures of Lidie Newton",
        "Authors": "By Smiley, Jane",
        "Description": "Six years after her Pulitzer Prize-winning best-seller, A Thousand Acres, and three years after her witty, acclaimed, and best-selling novel of academe, Moo, Jane Smiley once again demonstrates her extraordinary range and brilliance.Her new novel, set in the 1850s, speaks to us in a splendidly quirky voice--the strong, wry, no-nonsense voice of Lidie Harkness of Quincy, Illinois, a young woman of courage, good sense, and good heart. It carries us into an America so violently torn apart by the question of slavery that it makes our current political battlegrounds seem a peaceable kingdom. Lidie is hard to scare. She is almost shockingly alive--a tall, plain girl who rides and shoots and speaks her mind, and whose straightforward ways paradoxically amount to a kind of glamour. We see her at twenty, making a good marriage--to Thomas Newton, a steady, sweet-tempered Yankee who passes through her hometown on a dangerous mission. He belongs to a group of rashly brave New England abolitionists who dedicate themselves to settling the Kansas Territory with like-minded folk to ensure its entering the Union as a Free State.Lidie packs up and goes with him. And the novel races alongside them into the Territory, into the maelstrom of \"Bloody Kansas,\" where slaveholding Missourians constantly and viciously clash with Free Staters, where wandering youths kill you as soon as look at you--where Lidie becomes even more fervently abolitionist than her husband as the young couple again and again barely escape entrapment in webs of atrocity on both sides of the great question.And when, suddenly, cold-blooded murder invades her own intimate circle, Lidie doesn't falter. She cuts off her hair, disguises herself as a boy, and rides into Missouri in search of the killers--a woman in a fiercely male world, an abolitionist spy in slave territory. On the run, her life threatened, her wits sharpened, she takes on yet another identity--and, in the very midst of her masquerade, discovers herself.Lidie grows increasingly important to us as we follow her travels and adventures on the feverish eve of the War Between the States. With its crackling portrayal of a totally individual and wonderfully articulate woman, its storytelling drive, and its powerful recapturing of an almost forgotten part of the American story, this is Jane Smiley at her enthralling and enriching best.",
        "Category": " Fiction , Literary",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "In Sunlight, in a Beautiful Garden: A Novel",
        "Authors": "By Cambor, Kathleen",
        "Description": "In Sunlight, in a Beautiful Garden is the story of a bittersweet romance set against the backdrop of the Johnstown, Pennsylvania, flood -- a tragedy that cost some 2,200 lives when the South Fork Dam burst on Memorial Day weekend, 1889. The dam was the site of a gentlemen's club that attracted some of the wealthiest industrialists of the day -- Henry Clay Frick, Andrew Mellon, and Andrew Carnegie -- and served as a summertime idyll for the families of the rich. In Sunlight, in a Beautiful Garden imagines the lives that were lived, lost, and irreparably changed by a tragedy that could have been averted.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Three Against the Tide",
        "Authors": "By Love, D. Anne",
        "Description": "The Civil War truly hits home when Susanna's father is called to help the Confederate Army. Twelve-year-old Susanna is placed in charge of the family's South Carolina plantation and her two younger brothers. Then the Yankee soldiers invade their island, forcing Susanna and her brothers Neddie and Samuel to escape to their other home in Charleston. When a fire destroys their Charleston home, Susanna decides nothing will stop them from finding their father. Throughout the dangerous journey, Susanna can't help but question the traditions her family and most Southerners have been fighting to protect. Maybe it's time to stop going with the flow, and go up against the tide.",
        "Category": " Young Adult Fiction , Historical , United States , General",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Thank You Mom",
        "Authors": "By Howard Books",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Howard Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Unseen Essential: A Story for Our Trouble",
        "Authors": "By James P. Gills, M.D., Heartlight",
        "Description": "",
        "Category": "",
        "Publisher": "Love Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    }
]