[
    {
        "Title": "FOOD FESTIVAL",
        "Authors": "By Geffen, Alice",
        "Description": "This travel guide cum cookbook describes fifty-eight American food festivals in detail and provides more than 130 of their recipes",
        "Category": "",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "How to Repair Food",
        "Authors": "By Bear, Marina, Bear, John, and Zeryck, Tanya",
        "Description": "Offers suggestions for correcting cooking mistakes such as burned, overcooked, bland, or salty food, thawed frozen foods, how to store leftovers, and briefly discusses problems with utensils and appliances",
        "Category": " Cooking , Reference",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Croutons on a Cow Pie #2 (Volume II)",
        "Authors": "By Black, Baxter",
        "Description": "This book is one of Baxter's favorites!  His second big hardback collection filled with some of his most popular pieces:  The Oyster, Buckskin Mare, Range Fire, Freckles Advice (this one was read at Freckles Brown's funeral by Ty Murray).Four authentic cowboy artists, Charlie Marsh, Dave Holl, Don Gill and Bob Black took this book to a new level!  it makes it tough for our readers though ... \"Do I look at the picture first, or read the poem first?\"",
        "Category": " Humor , Form , Limericks & Verse",
        "Publisher": "Coyote Cowboy Company; Record Stockman Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Southern Living 1982 Annual Recipes by editors (1982) Hardcover",
        "Authors": "By Editors",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "A Child's Garden Of Verses A Collection Of Scriptures, Prayers & Poems",
        "Authors": "By Kinkade, Thomas (ILT), Ford, June (EDT), and Stevenson, Robert Louis (EDT)",
        "Description": "An endearing collection of classic poems from Robert Louis Stevenson, as well as favorite selections from the Bible, Robert Browning, Mother Goose, Christian Rossetti, and other classic children's writers. Timeless, beloved poems such as \"My Shadow,\" \"Wynken, Blynken and Nod,\" and \"Twinkle Twinkle, Little Star\" are nestled next to comforting prayers for little ones. Each of the books' four sections, A Time to Play, Day's End, Wonders of Childhood and Blessings of Faith is enhanced with the acclaimed works of the world-renowned artist Thomas Kinkade.",
        "Category": " Juvenile Nonfiction , Literary Criticism & Collections",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Step into Narnia: A Journey Through The Lion, the Witch and the Wardrobe (Chronicles of Narnia)",
        "Authors": "By Kirk, Elizabeth J. and Kirk, E. J.",
        "Description": "The Chronicles of Narnia: The Lion, the Witch and the Wardrobe is now a spectacular motion picture from Walt Disney Pictures and Walden Media.Now even the youngest child can share the magic in this full-color journey through The Lion, the Witch and the Wardrobe. Sixty-four pages are packed with fun facts and exciting adventures with the heroes, villains and creatures of Narnia.Join in the battles, explore magical places and visit the homes of Mr. and Mrs. Beaver and the evil White Witch. So come step into Narnia as you:Follow Lucy's footsteps and find out how it all began!Watch out for the evil White Witch!Decide if Mr. Tumnus is a friend or not.Discover what it's like to ride the Great Lion, Aslan.This fresh, interactive guide is perfect for young fans of The Lion, the Witch and the Wardrobe. Original artwork and movie images will pull readers into the magical world of Narnia and the beginning of a great adventure.",
        "Category": " Juvenile Nonfiction , Literary Criticism & Collections",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Easy Home Cooking Baking Collection",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "When, Where, Why, and How It Happened",
        "Authors": "By Reader's Digest Association (COR) and Davison, Michael Worth (EDT)",
        "Description": "Full-color photographs, period prints, maps, and drawings highlight a decade-by-decade chronology of more than three thousand historical milestones, including the murder of Julius Caesar, the discoveries of Galileo, and the collapse of Communism.",
        "Category": " Reference , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "100% Pleasure: From Appetizers to Desserts, the Low-Fat Cookbook for People Who Love to Eat",
        "Authors": "By Glick, Ruth and Baggett, Nancy",
        "Description": "Two expert cooks present a wide variety of recipes that keep the fat out while keeping all the delicious flavor in and offer tips on developing a low-fat lifestyle. BOMC, Prevention, & Meredith Main.",
        "Category": " Cooking , Courses & Dishes , Appetizers",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Horses of Central Park",
        "Authors": "By Slade, Michael",
        "Description": "In a caper set in New York City, two children scheme to give the overworked and depressed horses of Central Park two precious days of freedom. Reprint.",
        "Category": "",
        "Publisher": "Scholastic Paperbacks",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "How To Paint With Oils",
        "Authors": "By Garrard, Peter John",
        "Description": "Demonstrates the basic techniques for working with oil paints and includes step-by-step instructions for creating landscapes, portraits, and still lifes",
        "Category": "",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Storm Runners: A Novel",
        "Authors": "By Parker, T. Jefferson",
        "Description": "Matt Stromsoe has come a long way since his wife and son were killed in an explosion meant for him. Wounded severely in both body and spirit, Stromsoe gave up the last thing that held any meaning for him—his job on the police force—and proceeded to hit rock bottom, hard.That was a lifetime ago, and finally the spiral of personal destruction and despair seems to have come to an end. The man responsible for the murders—Stromsoe's best friend from childhood and his wife's old lover—is behind bars and Stromsoe has put the past behind him, rescued from the abyss by a former colleague who offers him a job at his private security firm. Stromsoe's first assignment is to protect local television personality Frankie Hatfield from a stalker. But the further Stromsoe is drawn into this case, the more he finds that the net of intrigue is wide and ultimately leads back to the man who killed his family. As events conspire against him, Stromsoe learns that prison is no safeguard against revenge.T. Jefferson Parker has been hailed as belonging \"in the first rank of American crime novelists\" (Washington Post Book World) and praised for \"some of the finest writing you'll ever read\" (Chicago Sun-Times). Superbly crafted, emotionally complex, and filled with heart-stopping action, Storm Runners proves why the novels of T. Jefferson Parker are impossible to resist.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Gary Null's Power Foods: The 15 Best Foods for Your Health",
        "Authors": "By Null, Gary",
        "Description": "From the New York Times bestselling author-the 15 foods that pack an incredibly powerful punch for good health  Gary Null has guided and inspired entire generations of Americans to adopt healthier living habits. Now, in this revolutionary book, Null outlines a master plan for anyone searching for a healthier, more natural way of looking at food.  Here, Gary Null has created a comprehensive eating plan built on a foundation of his 15 Power Foods. He explains in detail the unique nutritional powers and attributes each food holds, and offers hundreds of delicious recipes that incorporate as many Power Foods as possible. A menu plan shows you how to make the most of meals throughout the day-breakfast, lunch, dinner, desserts, appetizers, beverages, and more. Gary also discusses healthful eating habits, like the benefits of organic, whole, raw, and vegan eating.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "NAL Hardcover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Broken on the Back Row",
        "Authors": "By Patty, Sandi",
        "Description": "Sandi Patty, the most awarded female vocalist in contemporary Christian Music, saw her stellar career go into a tailspin. Now she tells the story of her long road to restoration. From the agony of divorce nearly ten years ago, Sandi has moved from center stage to the back row of the church balcony and back into the spotlight.This book is the heart-touching narrative of her years as an acclaimed recording artist balancing her role as adoring mother to four children, her fall from public acclaim, and the steps she worked through with her church and pastor to find forgiveness and peace --- all under the harsh glare of national media attention.Sandi's story also includes insightful vignettes from their bustling blended family (Sandi's four children and three stepchildren) and the inspiring way God worked in the adoption of an eighth child, their precious Sam.Sandi's performance schedule is full once more but there's a difference in her music and her heart that reflects the unforgettable journey she's made to reach the other side of hurt and find healing and forgiveness in Christ.",
        "Category": " Religion , Inspirational",
        "Publisher": "Howard Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Catch Flies! (Leftovers)",
        "Authors": "By Ramsey, Marcy Dunn (ILT) and Howard, Tristan",
        "Description": "Disappointed when she is assigned to a different ball team than the ones her friends are on, Catherine is horrified when she learns that her own mother is the coach and that the entire team consists of misfits. Original.",
        "Category": "",
        "Publisher": "Little Apple",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "The Golden Glove (Allstar Sportstory)",
        "Authors": "By Bowen, Fred and Thorpe, Jim (ILT)",
        "Description": "When Mr. Decker oversleeps on the morning of the mayor's daughter's birthday, it's up to Chestnut, his determined cart horse, to make the deliveries and save her party.",
        "Category": " Juvenile Fiction , Sports & Recreation , Baseball & Softball",
        "Publisher": "Peacehaven Pub",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Penalty Shot (Matt Christopher Sports Classics)",
        "Authors": "By Christopher, Matt and Peters, S. (EDT)",
        "Description": "After a hiatus from the ice to get his grades back up to eligibility level, Jeff Connors returns to get the cold shoulder treatment from his teammates. During Jeff's absence, a threatening note was discovered in his best friend's locker--written in Jeff's hand. His protests of innocence fall on deaf ears, so Jeff is on his own to discover who's behind the sabotage.",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Full Court Fever (Allstar Sportstory)",
        "Authors": "By Bowen, Fred and Barrow, Ann (ILT)",
        "Description": "With help from a new student and inspiration from an old magazine article, the players on Michael's seventh-grade basketball team hope to overcome their shortness and win their game against the eighth graders",
        "Category": " Juvenile Fiction , Sports & Recreation , Basketball",
        "Publisher": "Peacehaven Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Rebel Glory (Lightning on Ice)",
        "Authors": "By Brouwer, Sigmund",
        "Description": "Seventeen-year-old hockey star B.T. McPhee needs to figure out why his team is suddenly being victimized by a series of mysterious accidents which threaten their chances to win the playoffs",
        "Category": " Young Adult Fiction , Sports & Recreation , Water Sports",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Undercover Tailback (Matt Christopher Sports Classics)",
        "Authors": "By Christopher, Matt and Casale, Paul (ILT)",
        "Description": "Parker Nolan, who has a reputation for exaggeration, finds himself at the center of a confusing mystery when he sees someone stealing football plays out of the coach's playbook. Reprint.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "My Weird School #16: Ms. Coco Is Loco!",
        "Authors": "By Gutman, Dan and Paillot, Jim (ILT)",
        "Description": "Something weird is going on!It's Poetry Month! And Ms. Coco, who runs the gifted and talented program, is poetry crazy! She cries when she sees a sunset! She thinks boys should have feelings! She talks in rhyme! All the time! Will A.J.'s life ever be normal again?",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Best Choices from the People's Pharmacy: What You Need to Know Before Your Next Visit to the Doctor or Drugstore",
        "Authors": "By Graedon, Joe and Graedon, Teresa, Ph.D.",
        "Description": "From the trusted authors of the \"People's Pharmacy\" syndicated newspaper column comes Best Choices from the People's Pharmacy, an essential reference that empowers readers to make intelligent, informed choices from among the array of treatment options—home remedies, herbal and nutritional supplements, and prescription and over-the-counter drugs—available todayWe can read the newspaper for candid restaurant or movie reviews or consult Consumer Reports for an impartial analysis of the best buys on toasters or automobiles. But where can we find objective evaluations of popular treatments for conditions like arthritis, high cholesterol, and migraines?Joe and Teresa Graedon, the best-selling authors of The People's Pharmacy, will fill the void with a comprehensive new reference that presents all the information readers need to become savvy health-care consumers. The book offers:• best-choice treatments for 50 medical conditions—from allergies, asthma, and heartburn to high blood pressure and osteoporosis • a remedy ratings guide to compare the effectiveness and affordability of various treatment options• compelling new information on the potential dangers of generic drugsFeaturing a list of the authors' must-have remedies and organized alphabetically by condition for fast, easy access, this trustworthy, practical guide should find a sizable and grateful audience.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Windows on the World Complete Wine Course: 2003 Edition: A Lively Guide (Kevin Zraly's Complete Wine Course)",
        "Authors": "By Zraly, Kevin",
        "Description": "Kevin Zraly's incomparable course--\"One of the best start-from-scratch wine books ever written,\" wrote Frank Prial in The New York Times--is still America's top-selling guide to wine. In his inimitable, irreverent style, Zraly answers all your questions; offers the most up-to-date recommendations; takes you on a country-by-country, region-by-region ratings tour of the latest vintages; and starts you on your way to becoming a wine connoisseur. Abundant full-color labels and maps entice you. And, now The Windows on the World Wine Course is more than just the best book on the market. This new edition of Zraly's masterwork features his loving and personal history of Windows on the World, right from its very beginning. It's a touching tribute to his co-workers who lost their lives on September 11th.For each book sold, Sterling Publishing will donate one dollar to the Windows of Hope Family Relief Fund. And, Zraly's contributions to oenophiles continues as well; The Windows on the World Wine School  remains in business at the Mariott Hotel.",
        "Category": " Cooking , Beverages , Alcoholic , Wine",
        "Publisher": "Sterling",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "The Complete Gardener",
        "Authors": "By Brookes, John",
        "Description": "The Complete Gardener is the most comprehensive, practical and creative book yet produced for the gardening enthusiast. Whether you are starting from scratch, remodeling an existing garden, enhancing your home with hanging baskets and window boxes or planning a focal point for a favorite room, this is the book for you. It is both practical manual and creative source-book—a unique blend of the art and science of gardening.In PART 1 John Brookes offers the outdoor gardener a wealth of information about planning, building, planting, and maintaining every conceivable type of garden—from country garden to city rooftop; from rock gardens and patios to pools and woodland glades.For the indoor gardener and creative homeowner, PART 2 is both a comprehensive guide to choosing, growing and caring for indoor plants, and a source-book of stylish ideas for arranging flowers, grouping plants and planning decorative room schemes.  Starting with a stunning photographic guide to the color, texture, size and shape of plants, the author demonstrates and explains all the basic principles of successful plant display-from choosing containers and coordinating colors to constructing decorative features that will enhance any room, staircase or open space and bring the special, magical effect of the garden right into your home.",
        "Category": " Gardening , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "8.78",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Fifth Grade Flop (Making the Grade Series)",
        "Authors": "By Stine, Megan, Stine, H. William, and Henry, Paul",
        "Description": "Fifth-grader Andrew, good in music but poor in sports, gets a chance to prove himself in both when he is asked to direct his own play as a school production and to chose a sport for a mini-Olympics competition.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "Pillsbury: Best of the Bake-off Cookbook: 350 Recipes from Ameria's Favorite Cooking Contest",
        "Authors": "By Pillsbury Company",
        "Description": "For almost fifty years, people have looked to one cooking contest for the most delicious, the most exciting and the most uniquely American recipes this country's home cooks have to offer. The Pillsbury Bake-Off Contest presents the very best of what people are cooking today for their family and friends - for everyday dinners, special occasion desserts and mouthwatering breads. Now, for the very first time, more than 350 of the most sought after prize-winning recipes from this famed cooking contest are gathered in one book, complete with gorgeous color photographs and stories about the people and the inspiration that led to their award-winning recipes.Best of the Bake-Off Cookbook is a sweet and savory record of how American cooking has evolved over the years, illustrating how home cooks have captured their ethnic heritages in dishes adapted from their grandparents' countries to modern kitchens and busier times. The stories are as inspiring as the recipes themselves, from 1955 winner Rosemary Sport's prize - a new pink range - which provided her family with the motivation to become proud new homeowners to 1996's Grand Prize-winner, Kurt Wait, a single parent, who with the help of his son developed his $1,000,000-winning recipe Macadamia Fudge Torte.Hundreds of the very best recipes are accompanied by enticing color photographs and organized by category: Soups, Sandwiches and Snacks; Main Dishes; Side Dishes and Salads; Breads; Sweet Rolls and Coffee Cakes; Cookies and Bars; Cakes and Tortes; Pies and Tarts; and Other Desserts. Each chapter is filled with personal profiles highlighting the people who created the recipes plus the wonderful and oftentimes humorous behind-the-scenes stories from the Bake-Off Contest events: One contestant accidentally sat on her cake entry; another was notified that she was a lucky contestant via a citizens-band message broadcast by her town's postmistress.",
        "Category": " Cooking , Methods , Baking",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Mickey & Me (Baseball Card Adventures)",
        "Authors": "By Gutman, Dan",
        "Description": "\"This chapter book series by Dan Gutman is a more advanced version of the Magic Tree House series where the historical adventures are all baseball focused. I highly recommend this book to baseball fans and action/adventure fans\" (Brightly.com).When Joe Stoshack's dad ends up in the hospital after a car accident, he has two words to say to his son: Mickey Mantle. For Stosh has a special power—with a baseball card in hand, he can travel back in time. And his dad has a rare card—Mantle's valuable 1951 rookie card. \"I've been thinking about it for a long time. Go back to 1951. You're the only one who can do it,\" Dad whispers.That night Stosh grips the card and prepares for another magical adventure. But when he opens his eyes, he's not in Yankee Stadium—he's in Milwaukee on June 8, 1944. And how he wound up there is not half as surprising as what he finds!",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Baby Animals (Children's Pop-up Book)",
        "Authors": "By Waldman, Playmore",
        "Description": "",
        "Category": "",
        "Publisher": "Unspecified",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Otter on his Own: The Story of the Sea Otter - a Smithsonian Oceanic Collection Book (Mini book)",
        "Authors": "By Bonforte, Lisa (ILT) and Boyle, Doe",
        "Description": "Sea Otter Pup spends the first months of his life with his mother in a protected cove off the California coast, learning how to hunt for food and care for himself",
        "Category": " Juvenile Fiction , Animals , Marine Life",
        "Publisher": "Soundprint",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Newfoundlands: Everything About Purchase, Care, Nutrition, Diseases, Breeding, Behavior, and Training (Complete Pet Owner's Manuals)",
        "Authors": "By Kosloff, Joanna",
        "Description": "Individuals in this breed are big, dark-coated, and bear-like, but despite appearances, they are gentle and very affectionate. Here is everything a purchaser needs to know about owning and raising this fine dog.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "America's Smithsonian: Celebrating 150 Years",
        "Authors": "By Heyman, I. Michael (INT)",
        "Description": "Depicts artifacts and objects from the collections of the various museums of the Smithsonian Institution that honor the human impulses of discovery, imagination, and memory",
        "Category": " Business & Economics , General",
        "Publisher": "Smithsonian Inst Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Chihuahuas: Everything About Purchase, Care, Nutrition, Diseases, Behavior, and Breeding (Complete Pet Owner's Manual)",
        "Authors": "By Coile, D. Caroline",
        "Description": "",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "B E S Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "The Cat Lover's Companion",
        "Authors": "By Clb (EDT)",
        "Description": "",
        "Category": " Pets , Cats , General",
        "Publisher": "Bramley",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Office of Innocence: A Novel (Keneally, Thomas)",
        "Authors": "By Keneally, Thomas",
        "Description": "On the outskirts of Sydney, Father Frank Darragh is embarking on his new life of priesthood just as war erupts in the Pacific theater. American GIs pour into Father Darragh's neighborhood, and with them comes a reminder of the atrocities abounding nearby. Determined to shun hypocrisy, the earnest priest finds himself constantly at odds with his superiors, who frown on his efforts to rescue an errant black soldier and pay deathbed visits to the wayward. But Frank Darragh persists, becoming his parish's most popular confessor, particularly among wives of Australian servicemen who confront an array of temptations while their husbands are away.One such parishioner, Kate Heggarty, turns the tables of temptation on young Darragh, challenging his spiritual beliefs and stirring a vulnerable place in his heart. When Kate is found murdered, his anguish is only compounded by accusations that he caused her death. Poignantly depicting the conflicts between the secular and the holy and between the family of Darragh's birth and the brotherhood of priests, Office of Innocence is a tale set in the most compelling of circumstances. Drawing on his own experience studying for the priesthood in his youth, Thomas Keneally has created a protagonist who speaks to the conundrums of our age while paying tribute to quiet heroes of the past.",
        "Category": " Fiction , Historical",
        "Publisher": "Nan A. Talese",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Ten-Minute Terrors: Camp Fear & Other Hideous Horrors",
        "Authors": "By Fowler, Anne Bancroft and Angeloch, Eric (ILT)",
        "Description": "Eight stories deal with ghosts, an Aztec stone, all-engulfing slime, a haunted camp, a volcanic eruption, monsters, a werewolf, and a vampire",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Lowell House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Mystery Ranch (4) (The Boxcar Children Mysteries)",
        "Authors": "By Warner, Gertrude Chandler and Gringhuis, Dirk",
        "Description": "Violet and Jessie begin an adventure when they journey to Centerville to keep Aunt Jane company on the family ranch.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Haunted Cabin Mystery (The Boxcar Children Mysteries)",
        "Authors": "By Warner, Gertrude Chandler and Tang, Charles (ILT)",
        "Description": "The Alden children travel on a Mississippi paddle-wheel steamer to visit an old family friend in his cabin near Hannibal, Missouri, and try to discover who is responsible for the mysterious activities near the house.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "INDPB",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Tales from King Arthur (Wordsworth Children's Classics)",
        "Authors": "By Lang, Andrew (EDT)",
        "Description": "",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Wordsworth Editions Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Belly Laughs",
        "Authors": "By Kowitt, Holly and Hillenburg, Stephen",
        "Description": "Snicker, chuckle, giggle, snort! Whoop it up with SpongeBob and his friends in this latest book of sidesplitting sillies. It's sure to buoy even the briniest blowhards!",
        "Category": " Juvenile Nonfiction , Humor , Jokes & Riddles",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Basketball Mystery (The Boxcar Children Mysteries #68)",
        "Authors": "By Warner, Gertrude Chandler and Tang, Charles (ILT)",
        "Description": "The Alden children investigate when the new coach of their community basketball league--Tipper Nettleton, one of Greenfield's most famous basketball stars--has her Most Valuable Player trophy stolen. Simultaneous.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Albert Whitman & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "In the Company of Cheerful Ladies (No. 1 Ladies' Detective Agency, Book 6)",
        "Authors": "By McCall Smith, Alexander",
        "Description": "THE NO. 1 LADIES’ DETECTIVE AGENCY - Book 6 Fans around the world adore the bestselling No. 1 Ladies’ Detective Agency series, the basis of the HBO TV show, and its proprietor Precious Ramotswe, Botswana’s premier lady detective.  In this charming series, Mma  Ramotswe navigates her cases and her personal life with wisdom, and good humor—not to mention help from her loyal assistant, Grace Makutsi, and the occasional cup of tea. In the newest addition to the universally beloved No. 1 Ladies’ Detective Agency  series, the charming and ever-resourceful Precious Ramotswe finds herself overly  beset by problems. She is already busier than usual at the detective agency when  added to her concerns are a strange intruder in her house on Zebra Drive and the  baffling appearance of a pumpkin. And then there is Mma Makutsi, who decides to treat  herself to dance lessons, only to be partnered with a man who seems to have two left  feet. Nor are things running quite as smoothly as they usually do at Tlokweng Road  Speedy Motors. Mma Ramotswe’s husband, the estimable Mr. J.L.B. Matekoni, is overburdened  with work even before one of his apprentices runs off with a wealthy woman. But what  finally rattles Mma Ramotswe’s normally unshakable composure is a visitor who forces  her to confront a secret from her past. . . .   All this unfolds against the sunlit  background of Mma Ramotswe’s beloved homeland, Botswana–a land of empty spaces, echoing  skies, and an endless supply of soothing bush tea.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "the year of impossible goodbyes",
        "Authors": "By Choi, Sook Nyui",
        "Description": "",
        "Category": "",
        "Publisher": "Dell Yearling paperback",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Reserve",
        "Authors": "By Banks, Russell",
        "Description": "Part love story, part murder mystery, set on the cusp of the Second World War, Russell Banks's sharp-witted and deeply engaging new novel raises dangerous questions about class, politics, art, love, and madness—and explores what happens when two powerful personalities, trapped at opposite ends of a social divide, begin to break the rules.Twenty-nine-year-old Vanessa Cole is a wild, stunningly beautiful heiress, the adopted only child of a highly regarded New York brain surgeon and his socialite wife. Twice married, Vanessa has been scandalously linked to any number of rich and famous men. But on the night of July 4, 1936, at her parents' country home in a remote Adirondack Mountain enclave known as The Reserve, two events coincide to permanently alter the course of Vanessa's callow life: her father dies suddenly of a heart attack, and a mysteriously seductive local artist, Jordan Groves, blithely lands his Waco biplane in the pristine waters of the forbidden Upper Lake. . . .Jordan's reputation has preceded him; he is internationally known as much for his exploits and conquests as for his paintings themselves, and, here in the midst of the Great Depression, his leftist loyalties seem suspiciously undercut by his wealth and elite clientele. But for all his worldly swagger, Jordan is as staggered by Vanessa's beauty and charm as she is by his defiant independence. He falls easy prey to her electrifying personality, but it is not long before he discovers that the heiress carries a dark, deeply scarring family secret. Emotionally unstable from the start, and further unhinged by her father's unexpected death, Vanessa begins to spin wildly out of control, manipulating and destroying the lives of all who cross her path.Moving from the secluded beauty of the Adirondack wilderness to the skies above war-torn Spain and Fascist Germany, The Reserve is a clever, incisive, and passionately romantic novel of suspense that adds a new dimension to this acclaimed author's extraordinary repertoire.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "A New Owner's Guide to Guinea Pigs",
        "Authors": "By Bawoll, Karen",
        "Description": "",
        "Category": " Pets , Reference",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Geographic Information Systems and Science",
        "Authors": "By Longley, Paul, Goodchild, Michael, Maguire, David J., and Rhind, David W.",
        "Description": "The first edition of Geographic Information Systems and Science has taken the GIS textbook market by storm, selling over 22,000 copies since publication. It is the most current, authoritative and comprehensive treatment of the field, that goes from fundamental principles to the big picture.GISS 2e builds on the success of the first edition:Completely revised with a new five part structure: Foundations; Principles; Techniques; Analysis; Management and PolicyAll new personality boxes of current GIS practitionersNew chapters on Distributed GIS, Map Production, Geovisualization, Modeling, and Managing GISSpecific coverage of current hot topics: GIS and the New World OrderSecurity, health and well-BeingDigital differentiation in GIS consumptionThe core organizing role of GIS in geographyThe greening of GISGrand challenges of GIS scienceScience and explanationA new suite of instructor resources including a companion website with an on-line lab resource and personal student sullabus and a cehensive Instructor’s Manual that maps the textbook to various disciplines and levels of courses.",
        "Category": " Science , Earth Sciences , Geography",
        "Publisher": "Wiley",
        "Price Starting With ($)": "7.23",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Mid-Atlantic Home Landscaping",
        "Authors": "By Holmes, Roger and Buchanan, Rita",
        "Description": "This updated, expanded edition provides inspiring ideas for making the Mid-Atlantic home landscape more attractive and functional. Starting with the 200 best plants that thrive in the region, area landscape professionals created 46 outdoor design concepts readers can work with. More than 430 color photographs and drawings complement the easy-to-follow instructions for caring for and installing plants, paths, patios, ponds, and arbors.DE, Long Island, MD, NJ, PA, VA, WV",
        "Category": " Gardening , Regional , Middle Atlantic (DC, DE, MD, NJ, NY, PA)",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Market Forces: A Novel",
        "Authors": "By Morgan, Richard K.",
        "Description": "From the award-winning author of Altered Carbon and Broken Angels–a turbocharged new thriller set in a world where killers are stars, media is mass entertainment, and freedom is a dangerous proposition . . .A coup in Cambodia. Guns to Guatemala. For the men and women of Shorn Associates, opportunity is calling. In the superheated global village of the near future, big money is made by finding the right little war and supporting one side against the other–in exchange for a share of the spoils. To succeed, Shorn uses a new kind of corporate gladiator: sharp-suited, hard-driving gunslingers who operate armored vehicles and follow a Samurai code. And Chris Faulkner is just the man for the job.He fought his way out of London’s zone of destitution. And his kills are making him famous. But unlike his best friend and competitor at Shorn, Faulkner has a side that outsiders cannot see: the side his wife is trying to salvage, that another woman–a porn star turned TV news reporter–is trying to exploit. Steeped in blood, eyed by common criminals looking for a shot at fame, Faulkner is living on borrowed time. Until he’s given one last shot at getting out alive. . . .",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Ice Trap: A Novel of Psychological Suspense",
        "Authors": "By Sewell, Kitty",
        "Description": "Dear Doctor Woodruff, I hope you don't mind me writing to you.I think I'm your daughter....This international bestseller is a startlingly assured first novel of deception, ambiguity, and shattering revelations. At the height of his career, a British surgeon has found success in both the hospital and at home. He and his wife have everything they want out of life, except the child she longs for, the child Dr. Woodruff secretly believes he may never be ready to parent. Suddenly, the delicate equilibrium of their relationship is blown apart by the arrival of shocking news. Deep in the desolate sub-Arctic wilderness of Canada where Woodruff lived and worked years before, a woman claims he is the father of her thirteen-year-old twins. Woodruff knows it cannot be true -- but DNA tests don't lie.To make sense of the impossible, he must return to that frozen wilderness, where no rules and few laws apply. Leaving his shattered relationship behind, he finds that his well-guarded secrets have even deeper and more sinister layers. But the people he once knew in that godforsaken place guard secrets of their own, and no one -- least of all the ruthless woman at the dark core of this maelstrom -- will help him uncover the truth. The past quickly gains a stranglehold, threatening to unravel everything Woodruff has built -- his marriage, his career. And a man who has made one mistake may pay dearly for another -- and risk destroying his entire future....      A Bertelsmann Book Club International Book of the Month      A Literary Guild Main Selection     Shortlisted for the CWA New Blood Dagger Award      Shortlisted for the Hay Festival Welsh Book of the Year",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Expert Obedience Training for Dogs",
        "Authors": "By Strickland, Winifred Gibson",
        "Description": "",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Josh the Story of Wonder Dog",
        "Authors": "By Stack, Richard",
        "Description": "",
        "Category": " Juvenile Nonfiction , Animals , Dogs",
        "Publisher": "Windmill Press",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Cat Facts",
        "Authors": "By Marcus Schneck, Jill Caravan",
        "Description": "",
        "Category": "",
        "Publisher": "Marboro Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "The Most Democratic Branch: How the Courts Serve America (Institutions of American Democracy)",
        "Authors": "By Rosen, Jeffrey",
        "Description": "Many critics attack federal judges as anti-democratic elitists, activists out of step with the mainstream of American thought. But others argue that judges should stand alone as the ultimate guardians of American values, placing principle before the views of the people. In The Most Democratic Branch, Jeffrey Rosen disagrees with both assertions. Contrary to what interest groups may claim, he contends that, from the days of John Marshall right up to the present, the federal courts by and largehave reflected the opinions of the mainstream. More important, he argues that the Supreme Court is most successful when it defers to the constitutional views of the American people, as represented most notably by Congress and the Presidency. And on the rare occasion when they departed from the consensus, the result has often been a disaster.To illustrate, Rosen provides a penetrating look at some of the most important Supreme Court cases in American history--cases involving racial equality, affirmative action, abortion, gay rights and gay marriage, the right to die, electoral disputes, and civil liberties in wartime. Rosen shows that the most notorious constitutional decisions in American history--the ones that have been most strenuously criticized, such asDred Scott or Roe v. Wade--have gone against mainstream opinion. By contrast, the most successful decisions--fromMarbury v. Madison to Brown v. Board of Education--have avoided imposing constitutional principles over the wishes of the people. Rosen concludes that the judiciary works best when it identifies the constitutional principles accepted by a majority of Americans, and enforces them unequivocally as fundamental law. Jeffrey Rosen is one of the most respected legal experts writing today, a regular contributor toThe New York Times Magazine and the Legal Affairs Editor of The New Republic. The provocative arguments that he puts forth here are bound to fuel heated debate at a time when the federal judiciary is already the focus of fierce criticism.",
        "Category": " Political Science , American Government , Judicial Branch",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "The Future of the Wild: Radical Conservation for a Crowded World",
        "Authors": "By Adams, Jonathan S.",
        "Description": "In this important book, biologist Jonathan S. Adams explains an exciting new approach to conservation. The main strategy behind it involves using the latest in conservation science along with the desires of local communities to protect the places where people live and work. In this way, each small success moves conservationists closer toward creating huge protected landscapes large enough to support animals like bison and wolves. Only with freedom to roam through and between these lands, using wilderness corridors, can such large animals flourish.Adams provides numerous examples of how this new conservation is succeeding around the country: cooperative ranchers work together to preserve wilderness in Arizona; activists fight the encroachment of big business on the Florida Everglades; and a maverick scientist struggles to create safe passageways for pumas in California’s overpopulated Orange County. Each example proves the benefits of combining the latest scientific studies with practical community organizing and sound economic planning. Through these examples and important conservation history, Adams shows how we can realistically protect wildlands despite our growing numbers.The Future of the Wild is a much needed, accessible book full of fascinating stories, unforgettable characters, and, ultimately, a powerful new vision for conservation in America.“Adams profiles ecologists and activists, as well as grassroots and national conservation organizations, in a seamless flow of readable prose to make his point that sustainable human activity and sustainable populations of wildlife must not be mutually exclusive.” —Ted Levin, OnEarth“An engaging, well-written book with a real feel for wildlife, wild places and the fascinating cast of characters—scientists, environmentalists and ranchers—whose idealism and dedication are contributing to a radically different kind of conservation.” —Paul Evans, BBC Wildlife“Jonathan Adams lays out a bold road map for how to bind together the scattered remnants of this continent’s wild places—and for knitting up the mingled fates of the wild and human communities that inhabit them, envisioning a better, more sustainable future for both.” —Scott Weidensaul, author of Return to Wild AmericaJonathan S. Adams is a conservation biologist, writer, and program director with The Nature Conservancy. He is the coauthor of The Myth of Wild Africa: Conservation Without Illusion and the coeditor of Precious Heritage: The Status of Biodiversity in the United States. He lives with his wife and two children in the Maryland suburbs of Washington, D.C.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The News About the News: American Journalism in Peril",
        "Authors": "By Kaiser, Robert G. and Downie, Leonard",
        "Description": "From two of America’s most prominent and accomplished journalists, an impassioned investigation of an endangered species, good journalism.Leonard Downie Jr. and Robert G. Kaiser—both reporters and editors at the Washington Post for nearly four decades—take us inside the American news media to reveal why the journalism we watch and read is so often so bad, and to explain what can be done about it.They demonstrate how the media’s preoccupation with celebrities, entertainment, sensationalism and profits can make a mockery of news. They remind us of the value of serious journalism with inside accounts of how great stories were reported and written—a New York Times investigation of Scientology and the IRS, and a Washington Post exposé of police excesses. They recount a tense debate inside their own newsroom about whether to publicize a presidential candidate’s long-ago love affair. They also provide surprisingly candid interviews with Dan Rather, Peter Jennings and Tom Brokaw. The authors explain why local television news is so uninformative. They evaluate news on the Internet, noting how unreliable it can be, and why it is so important to the future of the news business.Coverage of the terrorist attacks on America in the fall of 2001 demonstrated that the news media can still do outstanding work, Downie and Kaiser write, but that does not guarantee a bright future for news. Their book makes exceedingly clear why serious, incorruptible, revelatory reporting is crucial to the health of American society if we are to be informed, equipped to make decisions and protected from the abuse of power. And it allows all of us to feel like insiders in one of America’s most powerful institutions, the media.",
        "Category": " Language Arts & Disciplines , Journalism",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "The Last Sherlock Holmes Story",
        "Authors": "By Dibdin, Michael",
        "Description": "In 1888 Sherlock Holmes is languishing for a criminal case worthy of his powers, then one materializes, heralded by the spatter of gore and the shriek of headlines. For in vice-ridden Whitechapel, three female paupers of dubious morals have been murdered, their bodies hideously defiled. And in taunting letters their killer announces his intention to strike again—and signs his name \"Jack the Ripper.\"As conceived by the award-winning mystery writer Michael Dibdin, The Last Sherlock Holmes Story is a brilliantly inventive updating of the Holmes legend. Pitting master detective against archfiend, steely rationalism against satanic depravity, Dibdin gives us a Holmes who is more complex, more human, and ultimately more fascinating than the one imagined by Arthur Conan Doyle. Here is a riveting combination of history and fiction that confirms Dibdin's reputation as one of the most imaginative and atmospheric crime writers now at work.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Vintage Crime/Black Lizard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Regeneration (Species Imperative #3)",
        "Authors": "By Czerneda, Julie E.",
        "Description": "Senior co-administrator of the Norcoast Salmon Research Facility, Dr. Mackenzie Connor - Mac to her friends and colleagues - was a biologist who had wanted nothing more out of life than to study the spawning habits of salmon. But that was before she met Brymn, the first member of the Dhryn race ever to set foot on Earth. And it was before Base was attacked, and Mac's friend and fellow scientist Dr. Emily Mamani was kidnapped by the mysterious race known as the Ro.From that moment on everything changed for Mac, for Emily, for Brymn, for the human race, and for all the many member races of the Interspecies Union.Now, with the alien Dhryn following an instinct-driven migratory path through the inhabited spaceways - bringing about the annihilation of sentient races who have the misfortune to lie along the star trail they are following - time is running out not only for the human race but for all life forms.And only Mac and her disparate band of researchers - drawn from many of the races that are members of the Interspecies Union - stand any chance of solving the deadly puzzle of the Dhryn and the equally enigmatic Ro.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "DAW Hardcover",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Rival Crock Pot Slow Cooker Recipes",
        "Authors": "By Rival",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Who's There? Busy Bee",
        "Authors": "By Marta Berowska",
        "Description": "",
        "Category": "",
        "Publisher": "FisicalBook",
        "Price Starting With ($)": "5.92",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Spin Control",
        "Authors": "By Moriarty, Chris",
        "Description": "Call Arkady a clone with a conscience. Or call him a traitor. A member of the space-faring Syndicates, Arkady has defected to Israel with a hot commodity: a genetic weapon powerful enough to wipe out humanity.  But Israel’s not buying it.  They’re selling it–and Arkady–to the highest bidder. As the auction heats up, the Artificial Life Emancipation Front sends in Major Catherine Li.  Drummed out of the Peacekeepers for executing Syndicate prisoners, Li has now literally hooked up with an AI who has lived many lifetimes and shunted through many bodies.  But while they have their own conflicting loyalties to contend with, together they’re just one player in a mysterious high-stakes game….",
        "Category": " Fiction , Science Fiction , High Tech",
        "Publisher": "Spectra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Little Critter Doctor (Little Critter Board Books)",
        "Authors": "By Mayer, Mercer",
        "Description": "Doctor Critter examines his patients, treats two \"babies\" in need of his care, and shows how he has a cure for everything",
        "Category": "",
        "Publisher": "Inchworm Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Marlene Koch's Sensational Splenda Recipes: Over 375 Recipes Low in Sugar, Fat, and Calories",
        "Authors": "By Koch, Marlene",
        "Description": "The most complete Splenda cookbook on the market with recipes ranging from appetizers, snacks, main courses, salad dressing, and desserts, to beverages and cocktails. Marlene's sensational recipes show how to use this amazing sweetener to make healthy, low-carb, low-fat, low-sugar dishes that taste great.",
        "Category": " Cooking , Health & Healing , Weight Control",
        "Publisher": "M. Evans & Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Curtains for the Cardinal: An Italian Renaissance Mystery",
        "Authors": "By Eyre, Elizabeth",
        "Description": "In this second Italian Renaissance whodunit the enigmatic Sigismondo - at once mercenary, courtier, sleuth - is again called upon to solve a crime that seems to threaten an entire duchy.Prince Livio of Montenero, in a fit of insane rage following the death of his wife, lops off the head of his son, whom he suspects of being a bastard, and attempts to do the same to his daughter, the beautiful young Minerva. Sigismondo, who is fortunately present, saves her and transports her to a remote villa, where she is protected by a blind lord - who might be her real father - and his household of strange characters. Meanwhile, in the Duchy of Nemorra, Cardinal Petrucci arrives to officiate at the long-scheduled wedding of Nemorra's Lord Astorre to Minerva, now missing. Before anyone learns she is gone, the cardinal is murdered in a particularly gruesome manner, and Sigismondo steps forward to sort matters out and to find the murderer.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harcourt Brace & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Lost (Fielding, Joy)",
        "Authors": "By Fielding, Joy",
        "Description": "New York Times bestselling author Joy Fielding delivers her most glamorous and intriguing novel to date about the disappearance of a gorgeous young actress, and a mother whose life is thrown into turmoil as a result.  It's almost five o'clock. Where the hell are you?  Losing Julia has become a constant in Cindy Carver's life. The first time Julia disappeared, she was five years old and vanished at the playground. That inspired motherly paranoia. The second was when, at age fourteen, Julia decided to move in with her father. That broke Cindy's heart. But when twenty-one-year-old Julia disappears without a trace after a promising audition with one of Hollywood's most powerful and influential directors, Cindy begins a frantic search. Secrets are revealed, lives are forever altered, and Cindy is forced to acknowledge the disturbing truth about the young woman she realizes she never really knew.  Sexy, suspenseful, and utterly un-put-downable, Lost takes readers into the heart of a woman overwhelmed by her determination to find the daughter she's lost, and, if at all possible, to reclaim the respect she once had for herself.  Every stranger was a possible fiend; every friend a possible foe. How well do we know anybody? How well do we know ourselves?",
        "Category": " Fiction , Psychological",
        "Publisher": "Atria",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "The Incredible Journey",
        "Authors": "By Burnford, Sheila",
        "Description": "Fans of Old Yeller, Where the Red Fern Grows, and Shiloh will love this timeless classic about two dogs and a cat that embark on a journey to return to their owner and inspired the movie Homeward Bound.     An inquisitive Labrador retriever, friendly bull terrier, and courageous Siamese cat set out through the Canadian wilderness to find their owner in this truly “incredible” adventure.    Instinct tells them that the way home lies to the west and together the three house pets face hunger, the natural elements, and wild forest animals as they make their way home to the family they love.   This beloved classic that inspired the movie Homeward Bound has captured the hearts of generations of readers. The lengths to which these three animals will go for each other and for their owner make for a thrilling and thoroughly unforgettable tale.   “Captivating! A tale of charm [and] high drama.”—The New York Times  “A classic.”—The Atlantic “From the youngest child…to the oldest grown-up, there is something here for everyone.”—The Horn Book   \"An incredible book! A beautiful story so moving that it stays in the mind constantly. It is a gem to be treasured.\"—The St. Louis Post-Dispatch \"I have read The Incredible Journey with much enjoyment. Obviously the author has a great knowledge of animals and a great love for them.\"—Joy Adamson, author of Born Free    “A clever story and evocative writing will keep animal lovers and adventure fans turning the pages.”—Common Sense Media   Pacific Northwest Young Reader’s Choice Award Winner   William Allen White Award Winner   Dorothy Canfield Fisher Award Winner",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Meditations for Cats Who Do Too Much: Learning to Take Things One Life at a Time",
        "Authors": "By Spacek, Peter (ILT) and Cader, Michael",
        "Description": "At last, the breakthrough self-help book that will change the lives—all nine of them—of cats across America! As America’s favorite pets, cats are showered with attention. But celebrity sometimes has cat-astrophic effects. The truth is, felines are succumbing to eating disorders, chronic fatigue, and obsessive behavior (mostly cleaning), as well as shedaholism. Now help is at hand (and paw). These words of comfort and meditative advice offer compassionate solutions to such  problems as:-       chasing your own tail-       overcoming fear when the Higher Power leaves for the weekend-       coping with the compulsion to sit on every piece of furniture in the house, every day For dysfunctional felines everywhere, for every cat who wants to discover the kitten within—and for those who love them—this book is indeed the cat’s meow.",
        "Category": " Humor , Topic , Animals",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Cat Notebook ll",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "4716565",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Make It Merry: A Medley of Christmas Crafts (Crafts Magazine)",
        "Authors": "By Creative Publishing International",
        "Description": "Provides patterns and instructions for quilts, ornaments, luminaries, tree toppers, pillows, ribbon wreaths, wall hangings, afghans, boxes, and pins",
        "Category": " Art , General",
        "Publisher": "Creative Pub Intl",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The Winter Seeking",
        "Authors": "By Wright, Vinita Hampton",
        "Description": "Share the Journey to the Heart of the Manger.Twenty-two-year-old Mary Georgiana Reese faces a gauntlet of pain and loss: her parents’ divorce and her dad’s remarriage, her mother’s battle with cancer, and her own recent breakup. Amidst such turmoil, she can’t imagine facing Christmas with her mom’s family in Atlanta. Then she is confronted with one more unnerving shift: her mother’s reconnection with the Christian faith of her youth. Though Mary Georgiana has little use for religion, she attempts for her mother’s sake to understand this spiritual reawakening. In the process, she comes face to face with another Mary: a virgin heavy with child, making her own uncertain journey through circumstances that bring both fear and hope. As their two stories intertwine, each young woman travels through a season of pain and joy, with surprising results. Their dual journey of winter seeking, centered on the Christ child, invites you to an experience of the Nativity unlike any other.",
        "Category": " Fiction , Religious",
        "Publisher": "WaterBrook Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Basic Quiltmaking Techniques for Hand Applique",
        "Authors": "By Dietrich, Mimi",
        "Description": "Introduces applique terms and techniques, offers advice on selecting fabric, and suggests a variety of projects",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "That Patchwork Place",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Lie Down With The Devil (Carlotta Carlyle Mysteries)",
        "Authors": "By Barnes, Linda",
        "Description": "Bestseller and multiple award–winning author Linda Barnes returns with the most personal case to date for her popular Boston PI, Carlotta Carlyle. Carlotta, in unfamiliar territory working on her own behalf, finds herself in the middle of a complicated case that has as much to do with the people she loves as the backstreets of Boston, and beyond.For starters, Carlotta wants to know what her on-again, off-again boyfriend Sam Gianelli did to earn himself a secret indictment for murder that’s keeping him out of the country. A man with plenty of secrets, he won’t tell her anything, much less let her help, and she isn’t having any more luck with her old friends at the Boston PD. Sam’s exile could be connected to the mob—he is in the family—but she’s not buying it. It couldn’t be that simple. Nothing involving Sam ever is. Faced with nothing but dead ends, Carlotta goes back to basics and takes a case for a nervous bride-to-be who wants to make sure her fiancé is being faithful. Simple enough, but when her client turns up dead, Carlotta catches the kind of break she wished she hadn’t.While nothing is as it seems in Lie Down with the Devil, one thing is clear: Readers know that when they’re reading Linda Barnes, they’re in the hands of a maestro.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Complete Dodgers Record Book",
        "Authors": "By Schoor, Gene",
        "Description": "Provides information on the players and games of the Dodgers baseball team ranging from 1890 to 1983",
        "Category": " Sports & Recreation , Baseball , Essays & Writings",
        "Publisher": "Facts on File",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "52 Simple Ways to Make Christmas Special",
        "Authors": "By Dargatz, Jan",
        "Description": "Suggests new and traditional ways to commemorate the spiritual meaning of the Christmas season by focusing on Advent as a time for reflection, Christmas for celebration, and Epiphany for giving",
        "Category": " Social Science , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "A Dictionary of Philosophy",
        "Authors": "By Antony Flew",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Ideaship: How to Get Ideas Flowing in Your Workplace",
        "Authors": "By Foster, Jack, Corby, Larry (ILT), and Corby, Larry",
        "Description": "Innovative, original ideas are a company&apos;s most powerful competitive advantage. Nathan Mhyrvold, former chief technology officer at Microsoft, has said that a great employee is worth 1,000 times more than an average one simply because of his or her ideas. In Ideaship, the sequel to his bestselling book, How to Get Ideas, Jack Foster shifts from how individuals spark their new ideas to how to unleash the creative genius of an entire organization. To create an idea-prone workforce, Foster proposes a totally new concept of leadership: \"ideaship.\" Leaders shouldn&apos;t be spending their time obsessing over profits or sales or quality or service. Instead, they should devote most of their energies to making the office a place where creative ideas flow, where the workforce truly believes in its ability to brilliantly solve any problem put before it. Above all, where it&apos;s fun to work. With energy and humor, Foster draws on over thirty-five years as creative director of major advertising agencies-organizations whose only purpose is to constantly generate ideas-to offer dozens of fun, fast, often surprising nuggets of practical advice on how to create an environment where innovation and fresh thinking thrive. He reveals why you should only hire people you like, insist employees take vacations whether they want to or not, why efficiency is sometimes inefficient, and how sometimes you can accomplish more by playing the fool instead of the capital L \"Leader.\" Ideaship spells out proven ways to encourage creativity, simply and clearly and cogently, without a lot of charts and graphs and formulas and acronyms and statistics and fillers. It flips traditional leadership on its head and shows how simple acts of compassion, trust, and generosity of spirit, as well as some seemingly zany actions, can unleash unexpected, vital bursts of creativity.",
        "Category": " Business & Economics , Management",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Sales Questions That Close the Sale: How to Uncover Your Customers' Real Needs",
        "Authors": "By Brennan, Charles D.",
        "Description": "What's the best way for you to find out what a prospective customer needs? Ask! It sounds simple enough, but many salespeople get so tangled up in nerves, benefits-hawking and making a \"pitch\" that they forget to ask customers questions - or to ask them the right questions. This quick-to-read guide offers precise guidance on asking prospects appropriate and effective sales questions. You'll learn how to formulate questions that generate meaningful dialogue and uncover opportunities; channel a prospect from an opportunity to a sale; determine a client's true motivation; pace a conversation, gain and keep client interest, and maintain control of the conversation; present solutions; and deal with a prospect who won't \"follow the script\"",
        "Category": " Business & Economics , Sales & Selling , General",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Seeing and Savoring Jesus Christ (Revised Edition)",
        "Authors": "By Piper, John",
        "Description": "Pastor John Piper unveils the person of Christ so that everyone can understand Jesus' deity, power and wisdom. This accessible volume can awaken unbelievers and sweeten any Christian's view of the Lord's character.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Crossway",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "To an ancient people: The autobiography of Dr. Leopold Cohn",
        "Authors": "By Cohn, Leopold",
        "Description": "",
        "Category": "",
        "Publisher": "Chosen People Ministries",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Quilts Galore!: Quiltmaking Styles and Techniques",
        "Authors": "By McClun, Diana and Nownes, Laura",
        "Description": "Includes techniques, templates, yardage requirements, and instructions for pieced, appliqued, broderie perse, trapunto, whole cloth, stenciled, crazy, and medallion quilts",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Quilt Digest Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Earth Times Two.",
        "Authors": "By Reynolds, Pamela",
        "Description": "",
        "Category": "",
        "Publisher": "Lothrop Lee & Shepard",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1970"
        }
    },
    {
        "Title": "Working With Words: A Concise Handbook for Media Writers and Editors",
        "Authors": "By Brooks, Brian S. and Pinson, James L.",
        "Description": "Covers grammar, punctuation, and usage, and offers advice on avoiding pompous, muddled, sexist, or racist language",
        "Category": "",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "9.67",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Creative Writing: Forms and Techniques",
        "Authors": "By Mueller, Lavonne and Reynolds, Jerry D.",
        "Description": "",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Ntc Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Digging to America: A Novel",
        "Authors": "By Tyler, Anne",
        "Description": "New York Times Bestseller Rich, tender, and searching, Digging to America challenges the notion that home is a fixed place, and celebrates the subtle complexities of life on all sides of the American experience. Two families meet at the Baltimore airport while waiting for their baby girls to arrive from Korea. The Iranian-American Sami and Ziba Yazdan, with Ziba's elegant and reserved mother, Maryam, in tow, wait quietly while brash and all-American Bitsy and Brad Donaldson, plus extended family, are armed with camcorders and a fleet of balloons proclaiming \"It's a girl!\" After they decide together to throw an impromptu \"arrival party,\" a tradition is born, and so begins a lifelong friendship between the two families. As they raise their daughters, the Yazdan and Donaldson families grapple with questions of assimilation and identity. When Bitsy's recently widowed father sets his sights on Maryam, she must confront her own idea of what it means to be other, and of who she is and what she values.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Dateable: Are You? Are They?",
        "Authors": "By Morgan, Hayley and Lookadoo, Justin",
        "Description": "Passion. It's the fuel for success, for dreams, for life. But too many teens focus their energy and passion on the wrong thing-the wrong person. Dateable pulls no punches in telling teens the truth about dating while also directing their passion toward a greater purpose in life.  Teen relationships seldom last, the authors point out, so why should teens invest so much of themselves emotionally, physically, and spiritually? The answer? They shouldn't. Instead, they can protect their hearts, live with excitement, and enjoy relationships in a way that enhances rather than detracts from those they'll have in the future. With Justin and Hayley \"telling it like it is,\" teens will learn how to be dateable and how to evaluate the dateability of their latest crush. And they'll get some much-needed perspective on sex, his/her communication, clothes, God-even \"chick flicks.\" Dateable also includes sidebars, quizzes, callouts, and more.",
        "Category": " Young Adult Nonfiction , Religion , Christianity",
        "Publisher": "Revell",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "End in Tears: A Wexford Novel (Chief Inspector Wexford Mysteries)",
        "Authors": "By Rendell, Ruth",
        "Description": "At first there was no reason to link the killings. The first one, months earlier, seemed totally random: a lump of concrete pushed off an overpass onto a passing car. By contrast, the gruesome bludgeoning death of Amber Marshalson, returning home late from a night out clubbing with friends, was obviously calculated. The killer had been seen waiting for the girl in a nearby wood. But when Chief Inspector Wexford discovers that Amber had been the driver right behind the crushed car—and that she’d been driving a silver Honda, while the car in front of her was a gray Honda—he knows that someone wanted the teenager dead badly enough to kill twice to get the job done. And as it turns out, this murderer’s plans are only just getting underway. Can Wexford unravel the complex knots that connect these murders in time to save future victims? Or is he, as he begins to fear, losing his touch and fast becoming a relic of another time?Long beloved by readers for her deft weaving of wonderfully meticulous characterization, dark humor, and trenchant social commentary into gripping and fast-paced plots, Ruth Rendell is in top form with End in Tears. Taking off from the first page with back-to-back murders and ending with one of Wexford’s own officers in mortal danger, End in Tears touches on issues of class, race, parenthood, aging, and gender roles as it brings the traditional British whodunit into the twenty-first century.Also available as a Random House AudioBook, Large Print edition, and eBook",
        "Category": " Fiction , Mystery & Detective , Traditional",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Disney's Herbie Fully Loaded:  The Junior Novelization",
        "Authors": "By Trimble, Irene (ADP)",
        "Description": "An energetic VW Bug helps a young race car driver follow her dream to compete in NASCAR, in a novelization of the new live-action movie starring Lindsay Lohan. Original.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Random House Childrens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Going Places With Children in Washington, D.C.",
        "Authors": "By McDermott, Pamela",
        "Description": "",
        "Category": "",
        "Publisher": "Green Acres School",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "American Girl Doll Hair: Styling Tips and Tricks for Your Dolls",
        "Authors": "By American Girl Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "American Girl Publishing Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Borkmann's Point: An Inspector Van Veeteren Mystery [2]",
        "Authors": "By Thompson, Laurie (TRN) and Nesser, Hakan",
        "Description": "International Bestseller Internationally bestselling author Häkan Nesser makes his U.S. debut with this riveting  tale of murder and suspense that reveals the deep humanity of the characters portrayed  even as it sends chills up the spine. Chief Inspector Van Veeteren is called to  the sleepy coastal town of Kalbringen to assist the local police in the investigation  of two recent ax murders. Soon the case turns from bad to worse when another body  turns up and one of Van Veeteren’s colleagues, a young female detective, disappears  without a trace. Now Van Veeteren must find the killer, and, it is hoped, his colleague,  before anyone else comes to harm. Riveting and intellectually satisfying, Borkmann’s  Point unfolds like a chess match where each move could prove deadly.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Vintage Crime/Black Lizard",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Miss American Pie: A Diary of Love, Secrets, and Growing Up in the 1970s",
        "Authors": "By Sartor, Margaret",
        "Description": "A spellbinding and authentic document of American adolescence.Set against the backdrop of the deep South in the 1970s, Miss American Pie is the unforgettable account of Margaret Sartor's life from age twelve to eighteen. A raw document crafted from diaries, notebooks, and letters, this deeply personal yet universally appealing story astonishes with its candor. Young Margaret moves with ease between the seemingly trivial concerns of hairstyles and boys to more profound questions of faith and meaning. By turns funny and poignant, heartbreaking and profound, she tackles all of the decade's issues--desegregation, drugs, the sexual revolution, the rise of feminism, and the spread of charismatic evangelical Christianity--with humor, frankness, and unexpected insight.Miss American Pie reminds us what it feels like to grow up, offering a true and honest look at a teenager grappling with the timeless questions of sex, friendship, God, love, loss, and the meaning of family. The introduction and epilogue, written by Sartor from an older perspective, reflect on those turbulent and life-shaping years, revealing how the girl in the diary turned out after all, and demonstrating that childhood--both its joys and traumas--reverberate deeply in our adult lives.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Deduct It! Lower Your Small Business Taxes",
        "Authors": "By Fishman, Stephen",
        "Description": "For all your tax deductions, from start-up to success, you need to Deduct It!Completely updated for 2008 returnsMake more money for your small business by paying the IRS less. Let Deduct It! show you how to maximize the business deductions you're entitled to -- quickly, easily and legally.The 5th edition is completely updated with all the latest tax information, eligibility requirements and tax rates for 2008 returns. Whether your business is just starting or well-established, Deduct It! is indispensable to your venture.",
        "Category": " Business & Economics , Taxation , Small Business",
        "Publisher": "Nolo",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Girl in a Fix: Quick Beauty Solutions (and Why They Work)",
        "Authors": "By Douglass, Ali (ILT), Flaherty, Somer, and Kollmer, Jen",
        "Description": "Surprise zits, stinky feet, and renegade hair knots don’t come with fix-it manuals. But, good news -- tou can conquer them all with things found right in your kitchen, bathroom, or high school cafeteria!Want to know how to heal your hickey faster? How to reverse a bad dye job? Using household items like tomatoes, cooking spray, and coffee grounds, the beauty solutions in Girl In a Fix can bail you out of the worst cosmetic disasters. You’ll also learn the scientific reasons why these solutions work. Think you’ll need a lot of money to be beautiful? Think again. All you really need are some smarts.",
        "Category": " Young Adult Nonfiction , Health & Daily Living , Beauty & Grooming",
        "Publisher": "Zest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Medical-Surgical Nursing (Content Mastery Series Review Module)",
        "Authors": "By rn-phd-c-msn-cnnp-leslie-schaaf-treas",
        "Description": "",
        "Category": "",
        "Publisher": "ATI Assessment Technologies Institute",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Fundamentals for Nursing: Building Nursing Knowledge to Ensure NCLEX Success, Review Module (Content Mastery Series)",
        "Authors": "By Jeanne Barrett, Teri Scott",
        "Description": "",
        "Category": "",
        "Publisher": "Assessment Technologies Institute",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Nursing Leadership and Management- Review Module, 3.1 Edition",
        "Authors": "By LLC Assessment Technologies Institute",
        "Description": "",
        "Category": "",
        "Publisher": "Assessment Technologies Institute",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Crush: A Girl's Guide to Being Crazy in Love",
        "Authors": "By Conley, Erin Elisabeth",
        "Description": "Face it: Falling for your flame is exhilarating, but it can also be downright confusing and, sometimes, even painful. Crush guides you through the whole experience, giving advice on all things from attracting his attention to controlling your own boy-crazy behavior to smooching in the schoolyard. And if (or when) your crush crashes and burns, Crush helps you cope—and bounce back quickly. Including tell-all quotes from real-life teens, Crush reveals the ups and downs of falling—and failing—in love.",
        "Category": " Young Adult Nonfiction , Social Topics , Dating & Sex",
        "Publisher": "Zest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Germany: A Short History",
        "Authors": "By Detwiler, Donald S.",
        "Description": "A brilliant survey?from Roman Germania to Bonn’s recent reconciliation with Moscow?this up-to-date and authoritative new work provides a much-needed guide to modern German history. The German quest for national unity and power, which led to the establishment of the Hohenzollern Empire under Bis­marck in the nineteenth century and the catastrophe of the Third Reich under Hitler in the twentieth, is placed in the context of German history since antiq­uity in this concise interpretive survey. Addressed to the general reader inter­ested in European history and interna­tional relations, it will also be useful to students, journalists, librarians, and anyone needing a lucid introduction to the background of postwar Germany and its role in the contemporary world. This concise account of the impact of complex factors in the Middle Ages and early modern period on the course of more recent German history is comple­mented with a dozen original maps, a brief chronology, and a selected bibliog­raphy.",
        "Category": " History , Europe , Germany",
        "Publisher": "Southern Illinois University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1976"
        }
    },
    {
        "Title": "Positive Discipline A-Z, Revised and Expanded 2nd Edition: From Toddlers to Teens, 1001 Solutions to Everyday Parenting Problems",
        "Authors": "By Nelsen, Jane, Lott, Lynn, and Glenn, H. Stephen",
        "Description": "A Positive, Proven Approach to Parenting!As a parent, you face one of the most challenging—and rewarding—roles of your life. No matter how much you love your child, there will still be moments filled with anger, frustration, and, at times, desperation. What do you do? Over the years, millions of parents just like you have come to trust the classic Positive Discipline series for its consistent, commonsense approach to child rearing. In the completely updated edition of Positive Discipline A-Z, you will learn how to use kind but firm support to raise a child who is responsible, respectful, and resourceful. You'll find practical solutions to such parenting challenges as:Sibling Rivalry · Bedtime Hassles · The Angry ChildSchool Problems · Getting Chores Done · ADDEating Problems · Getting Through a DivorceProcrastination · Whining · Tattling and LyingHomework · And Dozens More!\"Good, practical ways to guide a child—and save your sanity.\"—Marguerite Kelly, author of The Mother's Almanac and The Mother's Almanac Goes to School\"The perfect blend of kindness and firmness. Clearly a four-star guide that any parent will immediately relate to, with practical no-nonsense answers for today's families.\"—John F. Taylor, Ph.D., author of Helping Your Hyperactive ADD Child\"As a parent and licensed clinical social worker, I found this book to be practical, innovative, and an excellent tool for both parents and psychotherapists.\"—Melanie J. Stern, L.C.S.W.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Awesome Art Activities Around the Year: 20 Dazzling Projects With Complete How-to's That Connect to Your Curriculum and Delight all Learners",
        "Authors": "By Intrater, Roberta Grobel",
        "Description": "An artist-in-the-schools presents 20 easy and exciting art projects that enrich your curriculum all year long. Children make a Portrait Flip Book, a Thanksgiving Food-Print Mural, a Chinese Lion Dance Mask, Creepy Crawly Styrofoam Stamps, Ocean-Life Collage, and more! For use with Grades 2-5.",
        "Category": " Education , Teaching Methods & Materials , Arts & Humanities",
        "Publisher": "Teaching Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "The Family Chronicle (D86)",
        "Authors": "By S.T. Aksakov",
        "Description": "",
        "Category": "",
        "Publisher": "E.P.. Dutton & Co., Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Giants of the Ocean: Great Story & Cool Facts (Half & Half Books: Level 3 (Paperback))",
        "Authors": "By Hyman, Miles (ILT) and Craipeau, Jean-lou",
        "Description": "HALF and HALF books (1/2 Fiction-1/2 Non-Fiction) present a great fiction story, followed by non-fiction content that relates to the story. A perfect bridge for readers to cross from story to facts! STORY: Rescued by a Dolphin - A storm rages at sea and a young boy sees a small raft being tossed through the waves. On the raft is a young girl and circling the raft is a huge shark, just waiting for a wave to knock the girl into the sea. Unable to help, the boy watches as the shark begins to attack the raft. Suddenly, a dolphin strikes the shark-and what happens next is nothing short of amazing! FACTS: Sharks, Dolphins and More! - Did you know there is a whale with a long twisted horn like a unicorn? Did you know there are crocodiles that swim in the ocean? This book is loaded with exciting information! You'll learn about animals of the ocean that are endangered- and some of the things that are being done to help protect them. Plus, find out how killer whales catch seals, how dolphins sleep, and much more!",
        "Category": " Juvenile Nonfiction , Readers , Intermediate",
        "Publisher": "Treasure Bay",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    }
]