[
    {
        "Title": "Dark Lady: A Novel",
        "Authors": "By Patterson, Richard North",
        "Description": "Once the prosecutor was a young law student. Once the dead man was an honest lawyer. Now Stella Marz stares at the body of her former lover, hanging from a doorway in a gruesome tableau.For Stella Marz, the search for Jack Novak's killer leads into another bizarre homicide case, back through her own past and through the city where she was born and where now--a good Catholic girl turned career woman--she is in crisis. Somewhere in this city a hidden alliance of big money, big plans, and dark secrets is fueling a great American revival. And somehow Stella Marz will bring the darkness into the light--no matter what it reveals, no matter who it destroys. . . .",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Guardian Angel: A V. I. Warshawski Novel",
        "Authors": "By Paretsky, Sara",
        "Description": "When a neighboring eighty-year-old dog owner turns up floating facedown in a canal shortly after an argument with a yuppie couple, V. I. Warshawski begins an investigation. Reprint.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Death of a Salesman",
        "Authors": "By Miller, Arthur and Miller, Authur",
        "Description": "",
        "Category": " Drama , American , General",
        "Publisher": "Dramatists Play Service, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "This Book Will Change Your Life, Again:  365 More Daily Instructions for Hysterical Living",
        "Authors": "By Benrik",
        "Description": "A follow-up to This Book Will Change Your Life presents an all-new hilarious compilation of 365 subversive and inventive suggestions for turning one's life upside down, including such offbeat expressions as taking part in Claim You're Jesus Day, Bake Naked Day, Let children rule the world, Speak Only Esperanto Day, and Speed-read War and Peace. Original.",
        "Category": " Humor , Form , Essays",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Economics of Public Issues, The (14th Edition)",
        "Authors": "By Miller, Roger LeRoy, Benjamin, Daniel K., and North, Douglass Cecil",
        "Description": "",
        "Category": " Political Science , Political Economy",
        "Publisher": "Addison Wesley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Vocabulary Cartoons: Sat Word Power",
        "Authors": "By Burchers, Sam, Burchers, Max, and Burchers, Bryan",
        "Description": "",
        "Category": " Young Adult Nonfiction , Language Arts , Vocabulary & Spelling",
        "Publisher": "New Monic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Easy Suppers",
        "Authors": "By Jester, Pat",
        "Description": "Especially designed for people on the go, recipes for suppers that can be made in thirty minutes or less include imaginative ideas for quick sandwich suppers, salads and vegetables, and much more",
        "Category": " Cooking , General",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Murach's MVS TSO: Concepts and ISPF",
        "Authors": "By Lowe, Doug",
        "Description": "The first of a two-part revision, expanded to cover several major versions of TSO and ISPF released by IBM since publication of the first edition in 1984. This volume,  Part 1 , presents everything necessary to use TSO/ISPF for application programming. ( Part 2  covers TSO commands and procedures.) Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Computers , Reference",
        "Publisher": "Mike Murach & Associates",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "201 Cocktails",
        "Authors": "By Maria Costantino, Editor",
        "Description": "",
        "Category": "",
        "Publisher": "753172",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Proud New Flags",
        "Authors": "By F. Van Wyck Mason",
        "Description": "",
        "Category": "",
        "Publisher": "J. B. Lippincott Company",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1951"
        }
    },
    {
        "Title": "A Garden in Paris",
        "Authors": "By Whitson, Stephanie Grace",
        "Description": "\"The motto, 'It is never too late to be what you might have been,' haunts Mary Davis. Newly widowed, she has the notion that if she can return to Paris with her increasingly distant daughter, perhaps she'll be able to reconcile with the past and find a new future\"--Provided by publisher.",
        "Category": " Fiction , Religious",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "The Machiavelli Covenant",
        "Authors": "By Folsom, Allan",
        "Description": "In Washington, D.C., former LAPD rogue detective Nicholas Marten has come out of hiding to hunt down the killers of his childhood sweetheart. The wife of a controversial United States congressman, she and her husband and son were mysteriously murdered soon after the congressman discovered a massive clandestine bioweapons program.In Europe to meet with distinguished heads of state prior to a crucial NATO summit in Warsaw, U.S. President John Henry Harris may well face the same deadly fate. A secret cabal orders Harris to have the president of France and the chancellor of Germany assassinated. If the president doesn't go along with the conspiracy, he'll become the cabal's next target.Now he can trust no one. Fleeing for his life, pursued by the Secret Service, the CIA, and Spanish Intelligence, Harris joins forces with Nicholas Marten and the beautiful but enigmatic French photojournalist Demi Picard. Together the three uncover one of the most secretive and brutally powerful groups the world has ever known, a brotherhood of blood who will stop at nothing to realize their own depraved ambitions. The assassination of world leaders, a genocidal attack on a major civilian populace with weapons of mass destruction - nothing is beyond them.The origin of their evil reaches back to the Renaissance when the dying political thinker Niccolo Machiavelli fashioned a sinister addendum to his most infamous work, The Prince. Titled simply \"The Covenant,\" it is a terrifying blueprint for the gaining and keeping of true political power. For five hundred years this despotic order of the supremely rich and powerful has kept Machiavelli's original manuscript hidden away under heavy guard, the document itself worshiped like a divine artifact.Out manned, outnumbered, outgunned, three people now stand alone against it: Nicholas Marten, Demi Picard, and John Henry Harris, president of the United States.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "13.98",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Fugitive Game: Online With Kevin Mitnick",
        "Authors": "By Littman, Jonathan",
        "Description": "Kevin David Mitnick was cyberspace's most wanted hacker. Mitnick could launch missiles or cripple the world's financial markets with a single phone call - or so went the myth. The FBI, phone companies, bounty hunters, even fellow hackers pursued him over the Internet and through cellular airways. But while Mitnick's alleged crimes have been widely publicized, his story has never been told.Now Jonathan Littman takes us into the mind of a serial hacker. Drawing on over fifty hours of telephone conversations with Mitnick on the run, Littman reveals Mitnick's double life; his narrow escapes; his new identities, complete with college degrees of his choosing; his hacking techniques and mastery of \"social engineering\"; his obsession with revenge.",
        "Category": " Social Science , Criminology",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.59",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Strike and Retrieve (Super Bolan #89)",
        "Authors": "By Pendleton, Don",
        "Description": "When a fellow Stony Man agent mysteriously vanishes, putting a high-tech prototype in the hands of the Chinese, Mack Bolan must embark on a dangerous mission amidst global tension to rescue his friend, find the prototype, and save the world. Original.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Gold Eagle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Unbalanced Acts",
        "Authors": "By Raines, Jeff",
        "Description": "With the clock against them, two elite New York City cops follow the twisted trail of a dead man when a terrorist seizes control of twelve of America's most depraved psychopaths and vows to unleash their bloody terror",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "6.28",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Scarlatti Inheritance",
        "Authors": "By Ludlum, Robert",
        "Description": "Embezzlement, intrigue, and murder attend the defection of a top Nazi official during World War II",
        "Category": "",
        "Publisher": "Bantam Doubleday Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "The French Atlantic Affair",
        "Authors": "By Lehman, Ernest",
        "Description": "",
        "Category": "",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Cuba Libre",
        "Authors": "By Leonard, Elmore",
        "Description": "The latest acclaimed best-seller by the author of Get Shorty follows the adventures of an American cowboy and his stolen mistress in Cuba during the Spanish-American War. Reprint.",
        "Category": " Fiction , Literary",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Katapult",
        "Authors": "By Kijewski, Karen",
        "Description": "KAT COLORADO A thirty-something California bartender-turned-P.I.--a curious lady with nine lives, nerves of iron. . .and a passion for justice. KATAPULT A murderer has struck home--and Kat Colorado is taking it personally. Her cousin Johnny has been found stabbed to death in he parking lot of the Homestead Cafe. And now Kat's on the prowl--trailing a killer through a dangerous world of shady real estate shenanigans and teenage hookers. And she's about to uncover a closetful of sordid family secrets almost certain to get an overly inquisitive Kat skinned.KAT COLORADOA thirty-something California bartender-turned-P.I.--a curious lady with nine lives, nerves of iron. . .and a passion for justice.KATAPULTA murderer has struck home--and Kat Colorado is taking it personally. Her cousin Johnny has been found stabbed to death in he parking lot of the Homestead Cafe. And now Kat's on the prowl--trailing a killer through a dangerous world of shady real estate shenanigans and teenage hookers. And she's about to uncover a closetful of sordid family secrets almost certain to get an overly inquisitive Kat skinned.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Amy, Ben and Catalpa the Cat: A Fanciful Story of This and That",
        "Authors": "By Owens, Gail (ILT) and Coon, Alma S.",
        "Description": "",
        "Category": "",
        "Publisher": "Colonial Williamsburg Foundation",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Uncle John's Bathroom Reader for Kids Only!",
        "Authors": "By Bathroom Readers' Institute",
        "Description": "The book that launched Uncle John's incredibly successful For Kids Only series still holds up as one of the best in the series. It's chock full of cool facts, gross stuff, quirky quizzes, silly jokes, bone-headed bloopers, and more! Read about…   * The Origins of the Popsicle, the Remote Control, and Bugs Bunny* Is Disney's Haunted Mansion Really Haunted?* Slime in the News* The World's 10 Most Dangerous Snakes* Explosive Fireworks Facts* How Young Sacagawea Saved the Lives of Lewis & Clark* What Eye Gunk is Made Of* How Your Nose Smells* School Lunches From Around the WorldAnd much, much more!",
        "Category": " Juvenile Nonfiction , Humor , General",
        "Publisher": "Portable Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Dinosaur Mad Libs",
        "Authors": "By Price, Roger and Stern, Leonard",
        "Description": "A popular volume in the riotous Mad Libs series lists a variety of incomplete dinosaur essays that are missing crucial nouns, verbs, and other parts of speech that young fans can enter for hilarious fun.",
        "Category": " Juvenile Fiction , Sports & Recreation , Games",
        "Publisher": "Mad Libs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2018"
        }
    },
    {
        "Title": "Don't Scream",
        "Authors": "By Staub, Wendy Corsi",
        "Description": "Don't Tell A Soul.  .  .  In a remote, heavily wooded area near the Berkshires of Massachusetts, Rachel Lorant died on her birthday. But she didn't die alone. That night, her four sorority sisters make a solemn, trembling pledge. They will never reveal what has just happened in those woods--ever. Instead, they will take their terrible secret to their graves.  .  .    Don't Think About The Past.  .  .  Now, ten years later, their secret is coming back to haunt them as each receives a card in the mail from Rachel: \"Happy Birthday to Me. xoxo R.\" It's clear that someone knows what happened that night. Someone is stalking them and sending mysterious, chilling gifts that only they can understand--deadly warnings of what is to come. For the sins of the past have come back with a vengeance, and a killer will see that they all pay in blood.  .  .    And Whatever You Do--Don't Scream.  .  .  Brynn Costello has never felt such pure fear. She didn't want any part in what happened so long ago, but now, the mother of two will do anything to stay alive and protect her family--even if it means matching wits with a killer she can't see.  .  .a twisted psychopath who is closer than she thinks and who is saving her death for last.  .  .",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Zebra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Classic Myths to Read Aloud: The Great Stories of Greek and Roman Mythology, Specially Arranged for Children Five and Up by an Educational Expert",
        "Authors": "By Russell, William F.",
        "Description": "The most complete collection of Greek and Roman myths specially arranged to be read aloud to children aged five to twelve. \"Every child deserves this book. Those who do the reading aloud will be enlightened and rewarded, too.\"--Edwin Newman Line drawings.",
        "Category": " Fiction , Fairy Tales, Folk Tales, Legends & Mythology",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "In a Class by Itself: A Novel",
        "Authors": "By Brown, Sandra",
        "Description": "One of romance's best-loved authors, Sandra Brown creates love stories whose \"larger than life heroes and heroines make you believe all the warm, wonderful, wild things in life.\"* Now the New York Times bestselling author delivers a powerfully erotic and deeply moving tale of a woman reunited with her first and only love--a man who wants what she denied him ten years ago....In A Class By ItselfDani Quinn knew Logan Webster would be at her high school reunion. Yet she had come in order to prove to herself that she was not afraid to see him again. Her departure years before from both Logan and the small Texas town where they were sweethearts had been abrupt, painful, and not of her choosing. Worst of all, she'd never had the chance to tell Logan the truth of why she had to leave. Now she would not only have a chance to explain, but to ask him for a favor. Handsome, charming, and dangerously charismatic, Logan exudes all the power and confidence of a self-made success. He listens as Dani describes her work for a charitable foundation and expresses her hope that he will donate one of his properties for a much-needed summer camp. Logan agrees, but with one shocking proviso: that Dani fulfill the intimate promise she made to him years ago. It is meant to be a coldhearted business transaction...but this time when Dani is once again compelled to leave without an explanation, nothing can keep Logan from following.  *RendezvousFrom the Trade Paperback edition.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Dining and Dieting with The Duchess: Secrets&Tips for a Healthful New Lifestyle",
        "Authors": "By Sarah, The Dutchess of York",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes&Noble",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Death in Still Waters: A Chesapeake Bay Mystery",
        "Authors": "By Lee, Barbara",
        "Description": "In the middle of a divorce and a career change, Eve Elliott accepts an invitation to the Chesapeake Bay home of her widowed aunt and is shocked when a suspicious death reveals some devastating secrets about the local residents. Reprint.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Notes to Myself: My Struggle to Become a Person (Bantam Books)",
        "Authors": "By Hugh Prather",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "A Quick Reference to The Research Paper",
        "Authors": "By Soremson, Sharon",
        "Description": "",
        "Category": " Young Adult Nonfiction , Reference",
        "Publisher": "Amsco School Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "No-fault Parenting",
        "Authors": "By Neville, Helen and Halaby, Mona",
        "Description": "Suggests practical ways to deal with child behavior problems including incessant talking, poor eating habits, tantrums, bed wetting, whining, and lying",
        "Category": "",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Gemini Contenders",
        "Authors": "By Ludlum, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Hunter Publishing+inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "Little Girl Book: Everything You Need To Know To Raise A Daughter Today",
        "Authors": "By Laskin, David and O'Neill, Kathleen",
        "Description": "Raising a daughter today can be more challenging and more rewarding than ever before. Parents want to encourage their daughters to take full advantage of the exciting range of new opportunities open to them in school, sports, and future careers, and at the same time acknowledge what is unique and feminine about them. THE LITTLE GIRL BOOK is the first book to guide parents step-by-step through every period of your daughter's development from birth through the early school years. Organized chronologically, and filled with interviews with parents, teachers, and psychologists, THE LITTLE GIRL BOOK contains important research findings and practical advice on many critical concerns for parents of little girls, including:* How to provide a non-sexist environment for your daughter* The myths and facts about girls and aggressiveness, sociability, and intelligence* Fostering independence and achievement without going overboard* How to deal with battles over clothing, moodiness, separation anxiety, whining, fussing, and sibling rivalry* Discovering Dad vs. Identifying with Mom* Understanding how girls acquire a sense of themselves as female* Do girls suffer more from math/science anxiety than boys?* And moreIlluminating, informative, and thoroughly practical, THE LITTLE GIRL BOOK is a celebration of the diversity of today's little girls.",
        "Category": " Family & Relationships , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "THE BLEEDING HEART",
        "Authors": "By French, Marilyn",
        "Description": "Living in England for the year without their families, Dolores and Victor, both fortyish, both successful, meet by chance, fall in love, and discover they agree on nothing",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1981"
        }
    },
    {
        "Title": "Return To The Garden",
        "Authors": "By Gawain, Shakti",
        "Description": "",
        "Category": "",
        "Publisher": "New World Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Jane's House",
        "Authors": "By robert Kimmel Smith",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Thoreau on Man & Nature",
        "Authors": "By Peter Pauper Press",
        "Description": "",
        "Category": "",
        "Publisher": "Peter Pauper Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "Back Story (Spenser)",
        "Authors": "By Parker, Robert B.",
        "Description": "Thirty years after an unsolved bank robbery leaves a woman dead, Paul Giacomin, whom Spenser regards as a son, and Daryl Gordon, the son of the robbery victim, turn to Spenser to seek out clues about the crime from a host of suspicious characters. Reprint.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Manual of Clinical Psychopharmacology",
        "Authors": "By Schatzberg, Alan F. and Cole, Jonathan O.",
        "Description": "",
        "Category": "",
        "Publisher": "Amer Psychiatric Pub",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "Tapas: The Little Dishes of Spain",
        "Authors": "By Casas, Penelope",
        "Description": "More than 300 wonderful tapas recipes (traditional Spanish appetizer dishes). Offers carefully selected menus to make the work easy and to ensure a beautifully balanced array of delicious, unusual and colorful dishes. 8 pages of full color photos.",
        "Category": " Cooking , Regional & Ethnic , Spanish",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Picturing People",
        "Authors": "By Nibbelink, Don D.",
        "Description": "",
        "Category": "",
        "Publisher": "Amphoto",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "August",
            "Year": "1976"
        }
    },
    {
        "Title": "Sweet Dreams: A Bedtime Storybook Collection",
        "Authors": "By Apperley, Dawn and McMullan, Kate",
        "Description": "A cozy collection of favorite bedtime stories in an oversized padded format.This sweet collection of favorite bedtime stories will lull any child to sleep.Including If You Were My Bunny by Kate McMullan, illustrated by David McPhail; Thank You Prayer by Josephine Page, illustrated by Caroline Jayne Church; Good Night, Sleep Tight, Little Bunnies by Dawn Apperley; and the classic Wynken, Blynken, and Nod illustrated by David McPhail.With the keepsake padded format at a new, lower price, these bedtime stories are now both huggable and readable!",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Psychiatric Treatment of the Child",
        "Authors": "By McDermott, John F. and Harrison, Saul I. (EDT)",
        "Description": "To find more information about Rowman and Littlefield titles, please visit www.rowmanlittlefield.com.",
        "Category": " Psychology , Developmental , Child",
        "Publisher": "Jason Aronson, Inc.",
        "Price Starting With ($)": "6.72",
        "Publish Date": {
            "Month": "April",
            "Year": "1977"
        }
    },
    {
        "Title": "1635: The Dreeson Incident (11) (The Ring of Fire)",
        "Authors": "By Flint, Eric and Demarce, Virginia",
        "Description": "1.  The latest in a New York Times best-selling series.2.  The Ring of Fire series is the most popular alternate history series going.3.  Advertising in Locus, Kliatt, more4.  Full-color series brochure5.  Special kit mailing6.  Co-op available7.  Teaser in mass market of 1634: The Baltic War8.  Special backlist discounts9.  Large 1,100+ mailing of ARCs10.  Trade advertising11.  Library marketing The Thirty Years War continues to ravage 17th century Europe, but a new force is gathering power and influence: the Confederated Principalities of Europe, an alliance between Gustavus Adolphus, King of Sweden, and the West Virginians from the 20th century led by Mike Stearns who were hurled centuries into the past by a mysterious cosmic accident.   While the old entrenched rulers and manipulators continue to plot against this new upstart nation, everyday life goes on in Grantville, the town lost in time, with librarians, firefighters, and garbage collectors trying to make do under unusual circumstances. And what better place for an undercover spy from France than working with the garbage collectors, examining 20th century machines that others throw out and copying the technology (though he wishes one device—the paper shredder—had been left behind in the future).   There are more sinister agents at work, however. One of them, Ducos, almost succeeded in assassinating the Pope, but his plan was ruined by quick action by a few Americans. Now, the would-be assassin not only has a score to settle, but has also decided on two excellent targets: Grantville’s leader Mike Stearns and his wife Rebecca. . . .",
        "Category": " Fiction , Alternative History",
        "Publisher": "Baen",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "The New American Militarism: How Americans Are Seduced by War",
        "Authors": "By Bacevich, Andrew J.",
        "Description": "In this provocative book, Andrew Bacevich warns of a dangerous dual obsession that has taken hold of Americans, conservatives, and liberals alike.  It is a marriage of militarism and utopian ideology--of unprecedented military might wed to a blind faith in the universality of American values. This mindset, the author warns, invites endless war and the ever-deepening militarization of U.S. policy.  It promises not to perfect but to pervert American ideals and to accelerate the hollowing out of American democracy.  As it alienates others, it will leave the United States increasingly isolated.  It will end in bankruptcy, moral as well as economic, and in abject failure.With The New American Militarism, which has been updated with a new Afterword, Bacevich examines the origins and implications of this misguided enterprise.  He shows how American militarism emerged as a reaction to the Vietnam War.  Various groups in American society--soldiers, politicians on the make, intellectuals, strategists, Christian evangelicals, even purveyors of pop culture--came to see the revival of military power and the celebration of military values as the antidote to all the ills besetting the country as a consequence of Vietnam and the 1960s.  The upshot, acutely evident in the aftermath of 9/11, has been a revival of vast ambitions and certainty, this time married to a pronounced affinity for the sword.  Bacevich urges us to restore a sense of realism and a sense of proportion to U.S. policy.  He proposes, in short, to bring American purposes and American methods--especially with regard to the role of the military--back into harmony with the nation's founding ideals.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "The Italian Collection (The Best of Food & Wine)",
        "Authors": "By Falick, Melanie (EDT)",
        "Description": "Gathers Italian recipes for antipasti, main dishes, pasta, pizza, breads, vegetables, rice, and desserts, and discusses Italian wines",
        "Category": " Cooking , Regional & Ethnic , Italian",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The Best of Food & Wine: Vegetables, Salads & Grains (ILLUSTRATED)",
        "Authors": "By",
        "Description": "Gathers recipes for appetizers, soups, salads, main dishes, side dishes, and desserts featuring vegetables and grains",
        "Category": " Cooking , Specific Ingredients , Vegetables",
        "Publisher": "American Express Publishing Corp",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The Illustrated Still Glides The Stream",
        "Authors": "By Thompson, Flora",
        "Description": "",
        "Category": "",
        "Publisher": "Crown Publishing",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "July",
            "Year": "1985"
        }
    },
    {
        "Title": "The Final Encyclopedia",
        "Authors": "By Dickson, Gordon R.",
        "Description": "As the Splinter Cultures return to hostile and war-torn Earth, the Dorsai are given the task of preparing for the return and initiating the reintegration of human culture after two millenia of fragmentation",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "13.21",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "The Thirteenth Floor",
        "Authors": "By Fleischman, Sid and Sis, Peter (ILT)",
        "Description": "When his older sister disappears, twelve-year-old Buddy Stebbins follows her back in time to save an ancestor accused of witchcraft and finds himself aboard a seventeenth-century pirate ship, captained by a distant relative. Reprint.",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Jokelopedia The Biggest, Best, Silliiest, Dumbest Joke Book Ever",
        "Authors": "By weitzman, Ilana, Blank, Eva, and green, Ro",
        "Description": "",
        "Category": "",
        "Publisher": "Workman Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Bright  Legacy: Portraits of Ten Outstanding Christian Women",
        "Authors": "By Spangler, Ann",
        "Description": "",
        "Category": "",
        "Publisher": "Servant Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Winter is Not Forever (Seasons of the Heart #3)",
        "Authors": "By Oke, Janette",
        "Description": "As graduation nears, Josh Jones worries that he is the only member of his class not to know what he wants to do with his life",
        "Category": " Fiction , Religious",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "The Lion, the Witch and the Wardrobe (Full-Color Collector's Edition)",
        "Authors": "By Lewis, C. S., Baynes, Pauline (ILT), and Birmingham, Christian (ILT)",
        "Description": "Don’t miss one of America’s top 100 most-loved novels, selected by PBS’s The Great American Read.A full-color paperback edition of The Lion, the Witch and the Wardrobe, book two in the classic fantasy series The Chronicles of Narnia. This edition is complete with full-color cover and interior art by the original illustrator, Pauline Baynes.Four adventurous siblings—Peter, Susan, Edmund, and Lucy Pevensie—step through a wardrobe door and into the land of Narnia, a land frozen in eternal winter and enslaved by the power of the White Witch. But when almost all hope is lost, the return of the Great Lion, Aslan, signals a great change . . . and a great sacrifice.The Lion, the Witch and the Wardrobe is the second book in C. S. Lewis's classic fantasy series, which has been drawing readers of all ages into a magical land with unforgettable characters for over sixty years. This is a stand-alone read, but if you would like to explore more of the Narnian realm, pick up The Horse and His Boy, the third book in The Chronicles of Narnia.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Walden and Civil Disobedience (Barnes & Noble Classics)",
        "Authors": "By Thoreau, Henry David and Levin, Jonathan (INT)",
        "Description": "&&LDIV&&R&&LDIV&&R&&LDIV&&R&&LI&&RWalden and Civil Disobedience&&L/I&&R, by &&LSTRONG&&RHenry David Thoreau&&L/B&&R, is part of the &&LI&&R&&LI&&RBarnes & Noble Classics&&L/I&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&L/DIV&&R&&LDIV&&R&&LB&&R&&L/B&&R &&L/DIV&&R&&LDIV&&R&&LB&&RHenry David Thoreau&&L/B&&R was a sturdy individualist and a lover of nature. In March, 1845, he built himself a wooden hut on the edge of Walden Pond, near Concord, Massachusetts, where he lived until September 1847. &&LI&&RWalden&&L/I&&R is Thoreaus autobiograophical account of his Robinson Crusoe existence, bare of creature comforts but rich in contemplation of the wonders of nature and the ways of man. &&LI&&ROn The Duty Of Civil Disobedience&&L/I&&R is the classic protest against government's interference with individual liberty, and is considered one of the most famous essays ever written. This newly repackaged edition also includes a selection of Thoreau's poetry. &&L/DIV&&R&&LDIV&&R &&L/DIV&&R&&LDIV&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R&&LB&&RJonathan Levin&&L/B&&R is Dean of the School of Humanities and Professor of Literature and Culture at SUNY-Purchase. His research interests include nineteenth- and twentieth-century American literature and culture, modernism and modernity, and environmental studies. He is the author of &&LI&&RThe Poetics of Transition: Emerson, Pragmatism, and American Literary Modernism&&L/I&&R, as well as numerous essays and reviews.&&L/P&&R&&L/DIV&&R&&L/DIV&&R&&L/B&&R",
        "Category": " Poetry , American , General",
        "Publisher": "Barnes & Noble Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Breach of Promise: A Novel (Nina Reilly)",
        "Authors": "By O'Shaughnessy, Perri",
        "Description": "Broken hearts. Broken promises. Deadly consequences.In glitzy Lake Tahoe, couples break up every day. But few are as successful as Lindy and Mike Markov, who built a $200-million business together—before Mike took up with a younger woman. Now he's claiming he doesn't owe Lindy a dime since they never married.Attorney Nina Reilly, struggling to make a living in her one-woman office and raise a young son alone, agrees to take Lindy's case. Nina knows winning is a long shot, even with a brilliant jury consultant and a palimony expert on her side. It's the kind of case—full of passion and explosive secrets—that could make a fortune for a young lawyer. Or drive someone to commit murder—for love, money . . . or the right verdict.New York Times bestselling author Perri O'Shaughnessy has created a wonderfully unique and unpredictable character in Nina Reilly, a tough, tenderhearted attorney and single mother who has been hailed by critics as \"one of the most interesting heroines in legal thrillers today\" (the San Jose Mercury News).",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Island Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Understanding British English",
        "Authors": "By Moore, Margaret E.",
        "Description": "A lexicon of words and phrases in use in Great Britain's version of the language, with American definitions",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Citadel Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Saints Preserve Us!: Everything You Need to Know About Every Saint You'll Ever Need",
        "Authors": "By Kelly, Sean and Rogers, Rosemary",
        "Description": "Hilarious and comprehensive, the ultimate guide to the universe of saints—and what each one means. Cross-referenced by birthdays, professions, and ailments, this is a must-have for any true believer with a proper sense of fun.Your name . . . your birthday . . . your nationality . . . your job . . . your hobby, each entitles you to the Papally Prescribed, Perpetual Personal Protection of a Plethora of Powerful Patrons in Paradise. Whatever your problem—social, sexual, or spiritual—or illness—mental or physical, chronic or acute—a Holy Host of Heavenly Helpers is at Hand.   And you don’t even have to be Catholic!   All you do need to discover the identities of Your Very Own Patron Saints, and to avail yourself of their Guaranteed Supernatural Assistance, is this Blessed Book.  • Religiously researched!• Fanatically comprehensive!• Compulsively cross-indexed!• Incredibly credulous!",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "The Liturgical Environment: What the Documents Say",
        "Authors": "By Boyer, Mark G.",
        "Description": "The Liturgical Environment: What the Documents Say is a compendium of present liturgical law on the liturgical environment. Calling to mind the norm of active participation as the guiding principles for all liturgical celebration, each chapter considers the ecclesial documents that pertain to the particular object under discussion, the theology found in the documents, and the praxis that flows from the theology.This book is for all persons who are involved in planning, building, decorating, and worshiping in a sacred environment.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Liturgical Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Better Homes and Gardens New Casserole Cook Book",
        "Authors": "By Better Homes and Gardens Books",
        "Description": "",
        "Category": " Cooking , Courses & Dishes , Casseroles",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Poems 3",
        "Authors": "By Alan Dugan",
        "Description": "",
        "Category": "",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "13.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Charmed",
        "Authors": "By Hart, Catherine",
        "Description": "Discovering a magnificent Shawnee amulet that had been buried in 1813 by a great warrior, Silver Thorn, history teacher Nikki Swan is swept into the Native American's world and learns that he is the brother of the great Tecumseh. Original.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Midnight Jewels",
        "Authors": "By Krentz, Jayne Ann",
        "Description": "Acclaimed New York Times bestselling author Jayne Ann Krentz dazzles with this thrilling contemporary romance of deadly secrets and desires. When a mysterious man enters a bookshop and demands a rare collection of 18th-century erotica, the owner has no idea that she will soon be a part of his dark and intriguing world.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Winter Fire (Only Series)",
        "Authors": "By Lowell, Elizabeth",
        "Description": "Orphaned at thirteen, a mail-order bride at fourteen, widowed at sixteen, Sarah Kennedy has learned to depend upon no one but herself--reserving all her love for her younger brother Conner, and for the wounded hawks she heals and returns to the air.A hardened Civil War veteran, personal tragedy has taught Case Maxwell three things: to be a patient, deadly fighter, to love nothing that can die; and that justice is blind. But when a confrontation with his sworn enemies, the Culpepper clan, leaves him near death, Case finds himself, like many another damaged wild creature, under the tender, unwanted care of Sarah Kennedy.Destiny has brought the healer and the warrior together to brave chilling risks and dangerous truths in a hard, magnificent land--two souls haunted by a perilous present and the bitter ghosts of the past. But the intense emotion both Case and Sarah fear--the passion that burns like fire in the very heart of winter--is the only thing that can truly save them, as together they seek the courage to face the greatest risk of all: love.Orphaned at thirteen, a mail-order bride at fourteen, widowed at sixteen, Sarah Kennedy has learned to depend upon no one but herself--reserving all her love for her younger brother Conner, and for the wounded hawks she heals and returns to the air.A hardened Civil War veteran, personal tragedy has taught Case Maxwell three things: to be a patient, deadly fighter, to love nothing that can die; and that justice is blind. But when a confrontation with his sworn enemies, the Culpepper clan, leaves him near death, Case finds himself, like many another damaged wild creature, under the tender, unwanted care of Sarah Kennedy.Destiny has brought the healer and the warrior together to brave chilling risks and dangerous truths in a hard, magnificent land--two souls haunted by a perilous present and the bitter ghosts of the past. But the intense emotion both Case and Sarah fear--the passion that burns like fire in the very heart of winter--is the only thing that can truly save them, as together they seek the courage to face the greatest risk of all: love.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Worth the Risk",
        "Authors": "By Krentz, Jayne Ann and James, Stephanie",
        "Description": "Smoldering with passion and romance, two complete novels in one volume includes Wizard, in which Sophia Bennett, unexpectedly finds love with Dr. Max Travers, who has a tempting combination of intelligence and power, and The Challoner Bride, about two lovers on opposite sides of a family feud. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Pirate and the Pagan: A Novel",
        "Authors": "By Henley, Virginia",
        "Description": "Wild as a pagan goddess, Lady Summer galloped her stallion along the Cornish coast.  She had dabbled in the smuggler's game to save her family estate, but a wealthy marriage would better serve her purpose now.  Lord Ruark Helford seemed the answer to her reckless prayers.  But as his hot, hungry kisses drew her toward deception and irresistible acts of love, she had to hesitate.  Would this arrogant, handsome lord be her ticket to heaven--or hell?",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Friends for Life",
        "Authors": "By Smith, Carol",
        "Description": "Five women become unlikely friends when they all stay in the same British public hospital. As they get to know each other, they discover that their lives intertwine--through bosses, ex-husbands and lovers. And the death of one of them, apparently from complications from surgery, seems to bring the others even closer. But when another is brutally attacked, the three remaining friends realize these deaths are connected and they must uncover a dangerous, psychotic killer who may be within their very circle.",
        "Category": " Fiction , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Hello, Darkness",
        "Authors": "By Brown, Sandra",
        "Description": "Since moving to Austin to ease the pain of tragic mistakes, Paris Gibson has led a life of virtual isolation, coming alive only at night when she hosts her popular radio show. Then one listener -- who identifies himself as \"Valentino\" -- tells Paris that the girl he loves jilted him because of Paris's on-air advice. He intends to exact revenge by killing the girl and then coming after Paris. Desperate to stop the sinister Valentino, Paris enlists the help of the police -- including crime psychologist Dean Malloy, the very man she had hoped never to meet again....",
        "Category": " Fiction , General",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Sources of The Making of the West: Peoples and Cultures, A Concise History: Volume II: Since 1340",
        "Authors": "By Lualdi, Katharine J.",
        "Description": "Sources of the Making of the West, A Concise History, Second Edition offers more options for working with sources. Each chapter now includes five sources that are tightly integrated with the text and that echo the narrative's balance of people and places. With 35% more documents, including new visual images, the companion reader offers instructors maximum flexibility for document-based teaching. New comparative questions help students draw connections across documents. Free when packaged with the text.",
        "Category": " History , United States , General",
        "Publisher": "Bedford/St. Martin's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "The Fannie Farmer Baking Book",
        "Authors": "By Cunningham, Marion",
        "Description": "Eight hundred recipes for all manner of traditional American bakery favorites and fresh creations are augmented by thorough baking instructions",
        "Category": " Cooking , Methods , Baking",
        "Publisher": "Alfred A. Knopf,",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "Magic or Madness",
        "Authors": "By Larbalestier, Justine",
        "Description": "For fifteen years, Reason Cansino has lived on the run. Together with her mother, Sarafina, she has moved from one place to another in the Australian countryside, desperate not to be found by Reason’s grandmother Esmeralda, a dangerous woman who believes in magic. But the moment Reason walks through Esmeralda’s back door and finds herselfon a New York City street, she’s confronted by an unavoidable truth—magic is real.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Razorbill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Chronicles of Ancient Darkness #1: Wolf Brother",
        "Authors": "By Paver, Michelle",
        "Description": "“Fantasy adventure on a grand scale, with a wealth of wilderness lore and convincing characterizations.” —BooklistFans of Fablehaven and City of Ember will devour Michelle Paver’s bestselling fantasy series about one boy’s epic fight against evil and the wolf who guides him.Six thousand years ago. Powerful mages stalk the land, threatening to destroy all the forest clans. According to legend, only twelve-year-old Torak and his wolf-cub companion can defeat them. Their journey together takes them through perilous terrain and into dangers they never imagined. Torak and Wolf are terrified of their mission. But if they do not battle to save their world, who will?“Torak’s coming-of-age tale will keep the pages turning.” —Publishers Weekly",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Katherine Tegen Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Ashes of Britannia (Warrior Queen Series)",
        "Authors": "By Garwood, Haley Elizabeth",
        "Description": "",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Writers Block",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Replay",
        "Authors": "By Creech, Sharon",
        "Description": "Leo's papa stood in the doorway, gazing down at him. \"Leo, you make gold from pebbles,\" and the way he said it, Leo could tell that this was a good thing.He may have been given a bit part in the school play ... but Leo dreams he is the biggest star on Broadway.Sure, his big, noisy family makes him feel like a sardine squashed in a tin ... but in his fantasy he gets all the attention he wants.Yes, his papa seems sad and distracted ... but Leo imagines him as a boy, tap-dancing and singing with delight.That's why they call Leo \"fog boy.\" He's always dreaming, always replaying things in his brain. He fantasizes about who he is in order to discover who he will become. As an actor in the school play, he is poised and ready for the curtain to open. But in the play that is his life, Leo is eager to discover what part will be his.",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Best Burgers (Shaped Cookbook)",
        "Authors": "By Publications International Ltd",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Sushi at Home",
        "Authors": "By Shimizu, Kay",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , Japanese",
        "Publisher": "Japan Publications",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "The Bible of Clay: A Novel",
        "Authors": "By Navarro, Julia",
        "Description": "Internationally bestselling author Julia Navarro riveted readers around the world with her provocative novel The Brotherhood of the Holy Shroud. Now she goes even further, in this electrifying thriller about a biblical discovery in the Iraqi desert—and a deadly struggle on the eve of war to unearth a truth that’s waited 3,000 years to be told….In St. Peter’s Basilica, a man sits in a confessional asking forgiveness for a murder he’s about to commit. And a young priest begins a desperate journey to stop him. It’s the beginning of a ruthless race to find a rumored cache of sacred texts that could be one of the most explosive discoveries of all time. For as Clara Tannenberg and a team of renegade archaeologists journey deep into an Iraq on the brink of war, another far more sinister group is determined to get there first. Sweeping from the time of the biblical patriarchs to the front lines of the Iraqi conflict, from the horrors of Nazi Germany to the back rooms of Washington, D.C., The Bible of Clay is a novel of unrelenting, thought-provoking, and all-too-plausible suspense.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "The Secret Knowledge of Grown-ups",
        "Authors": "By Wisniewski, David",
        "Description": "Sssssshhhhh! You are about to open secret files, heretofore hidden from kids for thousandsof years. Steel your mind for the truth. Prepare yourself for knowledge never before held by Americas youth. Learn the real reasons grown-ups tell you to do things! Caldecott medalistDavid Wisniewskis surprising revelations will have you rolling in the aisles.",
        "Category": " Juvenile Fiction , Health & Daily Living , Daily Activities",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "I Wonder Why Camels Have Humps: And Other Questions About Animals",
        "Authors": "By Ganeri, Anita",
        "Description": "Browsers and young students alike will enjoy these lively question and answer books with their unique mix of realistic illustration and engaging cartoons. The enticing questions will amaze, amuse and inspire, while the highly visual format encourages kids to keep reading.",
        "Category": " Juvenile Nonfiction , Animals , General",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Americana: Roadside Memories",
        "Authors": "By Witzel, Michael Karl",
        "Description": "",
        "Category": "",
        "Publisher": "Lowe and B. Hould Publishers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The World of Ripley's Believe it or Not!",
        "Authors": "By Mooney, Julie",
        "Description": "",
        "Category": "",
        "Publisher": "Bookwise International",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Loitering with Intent (Stone Barrington Novels, No 16)",
        "Authors": "By Woods, Stuart",
        "Description": "The newest addition to the New York Times- bestselling Stone Barrington series. Dumped by his glamorous Russian girlfriend during dinner at Elaine's, and running low on cash, Stone Barrington is having a bad week. So his luck seems to be improving when he's hired to locate the missing son of a very wealthy man-lucky because the job pays well, and because the son is hiding in the tropical paradise of Key West. But when Stone and his sometime running buddy Dino Bacchetti arrive in the sunny Keys, it appears that someone has been lying in wait. When Stone very nearly loses his life after being blindsided at a local bar, he realizes that the young man he's been hired to track may have good reason for not wanting to be found. Suddenly Key West is looking less like Margaritaville and more like the mean streets of New York. . . .",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "In the Huddle With... John Elway (Athlete Biographies)",
        "Authors": "By Christopher, Matt",
        "Description": "A prolific sports writer examines the personal life and football career of the quarterback for the Denver Broncos who, in 1997, led his team to their first Super Bowl victory. Original.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Sports & Recreation",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Mousekin's Special Day (Magic Castle Readers Social Science)",
        "Authors": "By Moncure, Jane Belk and Williams, Jenny (ILT)",
        "Description": "Mousekin's mommy reminds her it is a special day, but the little mouse cannot seem to figure out why.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , General",
        "Publisher": "The Childs World Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "The Amber Room: A Novel",
        "Authors": "By Berry, Steve",
        "Description": "Forged of the exquisite gem, the Amber Room is one of the greatest treasures ever made by man–and the subject of one of history’s most intriguing mysteries. German troops invading the Soviet Union seized the Room in 1941. When the Allies bombed, the Room was hidden, and it has never been seen since. But now, the hunt has begun once more.Atlanta judge Rachel Cutler loves her job and her kids, and remains civil to her ex-husband, Paul. But everything changes when her father dies under mysterious circumstances, leaving behind clues to a secret about something called the Amber Room. Desperate for the truth, Rachel takes off for Germany with Paul close behind. Before long, they’re in over their heads. Locked into a treacherous game with professional killers, Rachel and Paul find themselves on a collision course with the forces of greed, power, and history itself.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Apes Find Shapes (Magic Castle Readers Math)",
        "Authors": "By Moncure, Jane Belk and Friedman, Joy (ILT)",
        "Description": "Four funny apes help Tracy find shapes in the objects around her, including the circle in a doughnut, the triangle in a kite, and the rectangle in a door.",
        "Category": " Juvenile Fiction , Concepts , Size & Shape",
        "Publisher": "The Childs World Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Butterfly Express (Magic Castle Readers Science)",
        "Authors": "By Moncure, Jane Belk and Hohag, Linda (ILT)",
        "Description": "When a little girl's caterpillar becomes a butterfly during a snowfall, she sends it off to California where it can find flowers to drink from.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "The Childs World Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Rabbit's Habits (Magic Castle Readers Health and Safety)",
        "Authors": "By Moncure, Jane Belk and Peltier, Pam (ILT)",
        "Description": "Three little rabbits exhibit both good and bad habits regarding their attitudes toward new experiences, taking care of their things, behaving with others, getting enough rest, and eating healthy foods.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "The Childs World Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Night and Day (A Jesse Stone Novel)",
        "Authors": "By Parker, Robert B.",
        "Description": "",
        "Category": "",
        "Publisher": "Putnam",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Crashing Down",
        "Authors": "By O'Brien, Meg",
        "Description": "Victimized as a girl by a child molester who was never prosecuted, Carrie Holt has put the past behind her to become a successful writer, until a trip back to her hometown brings her face to face with her tormenter, now a celebrity, who will do anything to hide the truth. Original.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Diary of a Wimpy Kid, Book 1",
        "Authors": "By Kinney, Jeff",
        "Description": "Boys don’t keep diaries—or do they?The launch of an exciting and innovatively illustrated new series narrated by an unforgettable kid every family can relate toIt’s a new school year, and Greg Heffley finds himself thrust into middle school, where undersized weaklings share the hallways with kids who are taller, meaner, and already shaving. The hazards of growing up before you’re ready are uniquely revealed through words and drawings as Greg records them in his diary. In book one of this debut series, Greg is happy to have Rowley, his sidekick, along for the ride. But when Rowley’s star starts to rise, Greg tries to use his best friend’s newfound popularity to his own advantage, kicking off a chain of events that will test their friendship in hilarious fashion. Author/illustrator Jeff Kinney recalls the growing pains of school life and introduces a new kind of hero who epitomizes the challenges of being a kid. As Greg says in his diary, “Just don’t expect me to be all ‘Dear Diary’ this and ‘Dear Diary’ that.” Luckily for us, what Greg Heffley says he won’t do and what he actually does are two very different things. Since its launch in May 2004 on Funbrain.com, the Web version of Diary of a Wimpy Kid has been viewed by 20 million unique online readers. This year, it is averaging 70,000 readers a day. F&P level: T",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Amulet Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "American Oak Furniture: Styles and Prices/Book I (American Oak Furniture Styles & Prices)",
        "Authors": "By Swedberg, Robert W. and Swedberg, Harriett",
        "Description": "Sets forth guidelines for pricing oak furniture as well as illustrating, describing, and noting the value of various pieces of oak furniture from different stylistic periods",
        "Category": " Art , General",
        "Publisher": "Wallace-Homestead Book Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "Diary of a Wimpy Kid: The Last Straw (Book 3)",
        "Authors": "By Kinney, Jeff",
        "Description": "The highly anticipated third book in the critically acclaimed and bestselling series takes the art of being wimpy to a whole new level.  Let’s face it: Greg Heffley will never change his wimpy ways. Somebody just needs to explain that to Greg’s father. You see, Frank Heffley actually thinks he can get his son to toughen up, and he enlists Greg in organized sports and other “manly” endeavors. Of course, Greg is able to easily sidestep his father’s efforts to change him. But when Greg’s dad threatens to send him to military academy, Greg realizes he has to shape up . . . or get shipped out. Greg and his family and friends, who make the Diary of a Wimpy Kid books a must-read for middle school readers, are back and at their best in this hilarious new installment of the series, which is sure to please current fans while attracting new ones. Publishers Weekly-1/19/2009:The third book in this genre-busting series is certain to enlarge Kinney’s presence on the bestseller lists, where the previous titles have taken up residence for the past two years. Kinney’s spot-on humor and winning formula of deadpan text set against cartoons are back in full force. This time, Greg starts off on New Year’s Day (he resolves to “help other people improve,” telling his mother, “I think you should work on chewing your potato chips more quietly”) and ends with summer vacation. As he fends off his father’s attempts to make him more of a man (the threat of military school looms), Greg’s hapless adventures include handing out anonymous valentines expressing his true feelings (“Dear James, You smell”), attempting to impress his classmate Holly and single-handedly wrecking his soccer team’s perfect season. Kinney allows himself some insider humor as well, with Greg noting the “racket” children’s book authors have going. “All you have to do is make up a character with a snappy name, and then make sure the character learns a lesson at the end of the book.” Greg, self-centered as ever, may be the exception proving that rule. Ages 8–12. (Jan.) F&P level: T",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "A Knight in Shining Armor Promotion",
        "Authors": "By Deveraux, Jude",
        "Description": "Abandoned by her lover after a quarrel, Dougless Montgomery is stranded in rural England, but with the sudden appearance of Nicholas Stafford, Earl of Thornwyck--who died centuries ago--a passionate affair begins",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "300 Incredible Things to Do on the Internet -- Vol. I",
        "Authors": "By Leebow, Ken and Joffe, Paul",
        "Description": "Includes addresses for sites featuring fun activities",
        "Category": " Computers , General",
        "Publisher": "VIP Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The Tale of Squirrel Nutkin (The 23 Tales, No. 2)",
        "Authors": "By Potter, Beatrix",
        "Description": "A silly squirrel loses his tail in a riddle game",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Warne",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "The Prophet of Yonwood (The City of Ember Book 4)",
        "Authors": "By Duprau, Jeanne",
        "Description": "A prequel to the modern-day classic The City of Ember. This highly acclaimed adventure series has captivated kids and teachers alike for almost fifteen years and has sold over 3.5 MILLION copies!   Nickie will grow up to be one of the first citizens of the city of Ember. But for now, she’s an eleven-year-old girl whose father was sent away on some mysterious government project.    So when the opportunity to move presents itself, Nickie seizes it. But her new town of Yonwood, North Carolina, isn’t what she’d anticipated. It’s a place full of suspicion and mistrust, where one person’s visions of fire and destruction have turned the town’s citizens against each other. Nickie explores the oddities around her—her great-grandfather’s peculiar journals, a reclusive neighbor who studies the heavens, a strange boy who is fascinated with snakes—all while keeping an eye out for ways to help the world. Or is it already too late to avoid a devastating war?   Praise for the City of Ember books: Nominated to 28 State Award Lists! An American Library Association Notable Children’s Book A New York Public Library 100 Titles for Reading and Sharing Selection A Kirkus Reviews Editors’ Choice A Child Magazine Best Children’s Book A Mark Twain Award Winner A William Allen White Children’s Book Award Winner   “A realistic post-apocalyptic world. DuPrau’s book leaves Doon and Lina on the verge of undiscovered country and readers wanting more.” —USA Today   “An electric debut.” —Publishers Weekly, Starred   “While Ember is colorless and dark, the book itself is rich with description.” —VOYA, Starred   “A harrowing journey into the unknown, and cryptic messages for readers to decipher.” —Kirkus Reviews, Starred",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The Delta Decision",
        "Authors": "By Smith, Wilbur A.",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "Amazon Parrots",
        "Authors": "By Paradise, Paul R.",
        "Description": "",
        "Category": " Pets , Birds",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Breeding Cockatiels",
        "Authors": "By Sturman, Julie",
        "Description": "",
        "Category": " Pets , Birds",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Northeast (SmartGarden Regional Guides)",
        "Authors": "By Cole, Trevor J.",
        "Description": "Offers a guide to gardening for the northeastern United States, including information on temperature zones, water needs, and size approximations for woody and herbaceous plants.",
        "Category": " Gardening , Regional , General",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    }
]