[
    {
        "Title": "Collaborative Analysis of Student Work: Improving Teaching and Learning",
        "Authors": "By Langer, Georgea M., Colton, Amy B., and Goff, Loretta S.",
        "Description": "Offers an approach to staff development that challenges teachers to examine their beliefs about what students can do and helps them identify which teaching methods are working most successfully.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Assn for Supervision & Curriculum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Conveniently Vegan: Turn Packaged Foods into Delicious Vegetarian Dishes",
        "Authors": "By Wasserman, Debra",
        "Description": "",
        "Category": " Cooking , Vegan",
        "Publisher": "Vegetarian Resource Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "The Poky Little Puppy's First Christmas (Little Golden Book)",
        "Authors": "By Justine Korman",
        "Description": "The Poky Little Puppy, the beloved Little Golden Books' classic character, celebrates his first Christmas! It’s the poky little puppy’s first Christmas, and he’s not sure what to expect. When he meets an animal friend who’s lost his home, Poky’s quick to help–and learns all about the spirit of Christmas. Whether you've known the Poky Little Puppy for years or whether you're meeting him for the first time, you'll want to include this holiday treasure as a stocking stuffer for the little–and not so little–ones in your life!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Chicken Soup for the Girl's Soul: Real Stories by Real Girls About Real Stuff (Chicken Soup for the Soul)",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), Hansen, Patty (COM), and Dunlap, Irene (COM)",
        "Description": "From Barbies to your first bra, from holding your teddy bear to slowdancing   with your first boyfriend, from knowing everyone in elementary   school to trying to make new friends in middle school. . . . When dealing with   these changes, it's no wonder preteen girls can freak out from time to time.Consider Chicken Soup for the Girl's Soul your survival guide! From reading   the true experiences of other preteen girls, as well as women who've been there,   you'll see that you're not the only one who feels clueless and insecure sometimes.   You'll read about tough subjects, such as peer pressure, cliques, divorce   and loss, as well as fun “girls only” stories about friendship, embarrassing   moments (these could take up an entire book!), body changes and first crushes.   These stories will make you laugh, cry and realize that girl power is truly something   to celebrate. You'll turn to this book again and again, whenever you need   the advice only girls can give.Chicken Soup for the Girl's Soul is sure to be what a girl wants!",
        "Category": " Young Adult Nonfiction , Social Topics , General",
        "Publisher": "HCI",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Arthur's April Fool",
        "Authors": "By Marc Brown",
        "Description": "",
        "Category": "",
        "Publisher": "Trumpet Club",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Your God Is Too Safe: Rediscovering the Wonder of a God You Can't Control",
        "Authors": "By Peterson, Eugene (FRW) and Buchanan, Mark",
        "Description": "Here's a thoughtful, probing exploration of why Christians get stuck in the place of complacency, dryness, and tedium -- and how to move on to new levels of spiritual passion! Buchanan shows how the majority of Christians begin their spiritual journey with excitement and enthusiasm -- only to get bogged down in a \"borderland\" -- an in-between space beyond the \"old life\" but short of the abundant, adventurous existence promised by Jesus. Citing Jonah, he examines the problem of \"borderland living\" -- where doubt, disappointment, guilt, and wonderlessness keep people in a quagmire of mediocrity -- then offers solutions ... effective ways to get unstuck and move into a bold, unpredictable, exhilarating walk with Christ. Inspired writing!",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Monsoon Diary: A Memoir with Recipes",
        "Authors": "By Narayan, Shoba",
        "Description": "Shoba Narayan’s Monsoon Diary weaves a fascinating food narrative that combines delectable Indian recipes with tales from her life, stories of her delightfully eccentric family, and musings about Indian culture.Narayan recounts her childhood in South India, her college days in America, her arranged marriage, and visits from her parents and in-laws to her home in New York City. Monsoon Diary is populated with characters like Raju, the milkman who named his cows after his wives; the iron-man who daily set up shop in Narayan’s front yard, picking up red-hot coals with his bare hands; her mercurial grandparents and inventive parents. Narayan illumines Indian customs while commenting on American culture from the vantage point of the sympathetic outsider. Her characters, like Narayan herself, have a thing or two to say about cooking and about life.In this creative and intimate work, Narayan’s considerable vegetarian cooking talents are matched by stories as varied as Indian spices—at times pungent, mellow, piquant, and sweet. Tantalizing recipes for potato masala, dosa, and coconut chutney, among others, emerge from Narayan’s absorbing tales about food and the solemn and quirky customs that surround it.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Inside Out Girl: A Novel (P.S.)",
        "Authors": "By Cohen, Tish",
        "Description": "Rachel Berman wants everything to be perfect. An overprotective single mother of two, she is acutely aware of the statistical dangers lurking around every corner—which makes her snap decision to aid a stranded motorist wholly uncharacteristic. Len Bean is stuck on the shoulder with Olivia, his relentlessly curious, learning disabled ten-year-old daughter. To the chagrin of Rachel's children, who are about to be linked to the most-mocked girl in school, Rachel and Len begin dating. And when Len receives terrible news, little Olivia needs a hero more than ever.But the world refuses to be predictable. When personal crisis profoundly alters Rachel's relationship with a wild, very special little girl, this perfectionist mother finds herself drawn into a mystery from her past and toward a new appreciation for her own children's imperfect lives.",
        "Category": " Fiction , General",
        "Publisher": "Harper-perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Izzy & Lenore: Two Dogs, an Unexpected Journey, and Me",
        "Authors": "By Katz, Jon",
        "Description": "NEW YORK TIMES BESTSELLERIn this wonderful book, Jon Katz, the owner of Bedlam Farm, learns once again about  the unexpected places animals can take us. As trained hospice volunteers visiting  homes and nursing facilities in upstate New York, Katz and his affectionate and intuitive  border collie Izzy bring comfort and canine companionship to people who most need  it. An eighty-year-old Alzheimer’s patient smiles for the first time in months when  she feels Izzy’s soft fur. A retired logger joyfully remembers his own beloved dog.  As Izzy bonds with patients and Katz focuses on their families, the author begins  to come to terms with his own life, discovering dark realities he has never confronted.  Meanwhile, Lenore, a spirited, bright-eyed black Labrador puppy, arrives at Bedlam  Farm. Her genial personality and boundless capacity for affection steer Katz out  of the shadows, rekindle his love of working with dogs, and restore his connection  to the farm and the animals and people around him.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Just Like Jesus Devotional: A Thirty Day Walk With the Savior",
        "Authors": "By Lucado, Max",
        "Description": "God wants to give you a heart just like Jesus.Jesus felt no guilt; God wants you to feel no guilt.Jesus had no bad habits; God wants to do away with yours.Jesus had no fears; God wants the same for you.Jesus had no anxiety about death; you needn't either.God's desire, his plan, his ultimate goal is to make you into the image of Christ.This is your invitation to spend thirty intimate days with the Savior learning how to become more like Jesus. Can you think of a better offer?",
        "Category": " Religion , Devotional",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Mother Angelica's Little Book of Life Lessons and Everyday Spirituality",
        "Authors": "By Angelica, Mary",
        "Description": "New York Times Bestseller--Everyday spirituality from the beloved nun who passed away on Easter, 2016.“Everything starts with one person . . . I don’t care if you’re 5 or 105, God from all eternity chose you to be where you are, at this time in history, to change the world.” “If you are following God, He never shows you the end. It’s always a walk of faith.” “Faith is one foot on the ground, one foot in the air, and a queasy feeling in the stomach.” —Mother AngelicaAre you unsure of your purpose in life? Stuck in the past and worried about the future? Hamstrung by fear, failure, or trials? Mother is here to help. For more than twenty-five years, Mother Angelica has dispensed spiritual wisdom and practical advice to millions around the globe through her lively broadcasts on EWTN. Now she shares with you her personal life lessons and hilarious counsel as never before. Raymond Arroyo, author of the bestselling biography of Mother Angelica, has assembled an inspiring collection of her powerful insights, comic musings, and no-nonsense guidance for everyday living. Culled from never-before-seen interviews, private conversations, and recorded lessons not heard in over thirty years, to which Arroyo had exclusive access, these selections capture Mother Angelica’s spunky spirit and profound wisdom at their zenith. In Mother Angelica’s Little Book of Life Lessons and Everyday Spirituality, the beloved nun is your personal mentor. Together you’ll discover:How to find God’s Will in your lifeHow to pursue inspirations fearlesslyHow to make sense of pain and sufferingHow to spiritually overcome personal faults and trialsCreated in cooperation with Our Lady of the Angels Monastery, this devotional treasury is accompanied by original prayers from Mother Angelica’s private collection. Within are the meditations, personal beliefs, and pithy life lessons that transformed a disabled child of divorce into Mother Angelica, founder and CEO of the world’s largest religious media empire. Packed with real-world hope, this little book is sure to transform your life in a big way.A portion of the proceeds of this book goes to support the work of Our Lady of the Angels Monastery",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Image",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Successful Gardening in the Shade",
        "Authors": "By Helen Van Pelt Wilson",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday & Company Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Biscuit Visits the Big City (My First I Can Read)",
        "Authors": "By Capucilli, Alyssa Satin and Schories, Pat (ILT)",
        "Description": "For fans of Clifford and Spot, welcome everybody’s favorite little yellow puppy, Biscuit, in an I Can Read adventure!The city is a big, busy place for a little yellow puppy. From gazing at the tops of tall buildings to chasing pigeons across crowded sidewalks, there's so much to do! There are more people than Biscuit's ever seen before, too -- and so many new friends to make!Biscuit Visits the Big City, a My First I Can Read book, is carefully crafted using basic language, word repetition, sight words, and sweet illustrations—which means it's perfect for shared reading with emergent readers.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "DK MF WORD BOARD BK REV EDIT (My 1st Board Books)",
        "Authors": "By Wilkes, Angela",
        "Description": "The best-selling first word and picture book that helps children develop essential vocabulary.  DK proudly reintroduces 10 favorite board books from the beloved My First series, all with beautifully redesigned covers for a fresh new look. Filled with full-color photographs and large, easy-to-read text, My First Board Books provide children with an excellent platform for early learning. A variety of first concepts, such as colors, numbers, letters, and more are introduced in a fun, informative way to help children build the vocabulary and basic language skills that form the foundation of learning.",
        "Category": " Juvenile Nonfiction , Language Arts , Vocabulary & Spelling",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Parker's Wine Bargains: The World's Best Wine Values Under $25",
        "Authors": "By Parker, Robert M., Jr.",
        "Description": "Yes, you can buy world-class wine on a budget. With Parker's Wine Bargains, America's most influential wine critic offers a guide to the world's best wines priced at $25 or less.    Robert M. Parker, Jr., earned his international reputation and unprecedented influence as a dedicated consumer advocate -- if a wine isn't worth the money, he says so, regardless of the wine's pedigree. In Parker's Wine Bargains, for the first time he and his Wine Advocate team offer budget-minded wine buyers a handy guide to low-priced wines for both everyday drinking and special occasions.   Organized by country, the book lists more than 1,500 quality wine producers, as well as abbreviated tasting notes for more than 3,000 of the best value wines. The book includes significant contributions from Wine Advocate reviewers David Schildknecht, Antonio Galloni, Dr. Jay Miller, Mark Squires, and Neal Martin. Chapters include an overview of each country's wine-producing regions, highlight up-and-coming or underappreciated regions, and detail when wines can be consumed. Also featuring a vintage guide and lists such as \"the best of the best,\" Parker's Wine Bargains is an accessible guide from the expert the New York Times deems \"the critic who matters most.\"",
        "Category": " Cooking , Beverages , Alcoholic , Wine",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Mailer: His Life and Times",
        "Authors": "By Manso, Peter",
        "Description": "THE DEFINITIVE, AUTHORIZED ORAL BIOGRAPHY OF THE AMERICAN ICON  The winner of every major national literary award, the preeminent novelist of his generation, a Pulitzer Prize-winning journalist, a movie director, politician, pugilist, antiwar activist, hipster, philosopher, and enfant terrible, Norman Mailer has been maligned, loved, hated, belittled, idolized -- but never ignored. This sweeping biography captures the legend's extraordinary life and career in his own fascinating words and in vivid accounts by his famous peers, friends, enemies, wives, lovers, and family members. Mailer is an extraordinary tapestry, a portrait of an era as well as a man -- as protean as the subject himself and just as overflowing with life.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Powder Necklace: A Novel (Wsp Readers Club)",
        "Authors": "By Brew-hammond, Nana Ekua",
        "Description": "To protect her daughter from the fast life and bad influences of London, her mother sent her to school in rural Ghana. The move was for the girl’s own good, in her mother’s mind, but for the daughter, the reality of being the new girl, the foreigner-among-your-own-people, was even worse than the idea. During her time at school, she would learn that Ghana was much more complicated than her fellow ex-pats had ever told her, including how much a London-raised child takes something like water for granted. In Ghana, water “became a symbol of who had and who didn’t, who believed in God and who didn’t. If you didn’t have water to bathe, you were poor because no one had sent you some.”After six years in Ghana, her mother summons her home to London to meet the new man in her mother’s life—and his daughter. The reunion is bittersweet and short-lived as her parents decide it’s time that she get to know her father. So once again, she’s sent off, this time to live with her father, his new wife, and their young children in New York—but not before a family trip to Disney World.",
        "Category": " Fiction , Coming of Age",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Just in Case",
        "Authors": "By Rosoff, Meg",
        "Description": "David Case never questions his ordinary suburban life -- until one fateful day, a brush with death brings him face to face with his own mortality. Suddenly, everywhere he looks he sees catastrophe, disaster, the ruin of the human race, the demise of the planet...not to mention (to pinpoint the exact source of his anxiety) possible pain and suffering for himself. So he changes his name, reinvents his appearance, and falls in love with the seductive Agnes Bee -- in the hope that he?ll become unrecognizable to Fate and saved from his own doom.  With his imaginary greyhound in tow, Justin Case struggles to maintain his new image and above all, to survive in a world where twists of fate wait for him around every corner.",
        "Category": " Fiction , Psychological",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "My First Animal Board Book",
        "Authors": "By DK",
        "Description": "A sturdy, chunky-style board book teems with clearly labeled photographs of adorable baby animals, designed to teach young ones basic vocabulary.",
        "Category": " Juvenile Nonfiction , Animals , General",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Happy Thanksgiving, Biscuit!",
        "Authors": "By Capucilli, Alyssa Satin, Schories, Pat (ILT), and Schories, Pat (PHT)",
        "Description": "Celebrate Thanksgiving with Biscuit! Lift the flaps to reveal a special holiday surprise on every page.Biscuit has so much to be thankful for on his first Thanksgiving. How will he and the little girl spend this special day?Pull back the flaps to find out!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Thanksgiving",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2019"
        }
    },
    {
        "Title": "The Story Of England",
        "Authors": "By Hibbert, Christopher",
        "Description": "A concise, illustrated guide to England's political,  economic and cultural history from the Neolithic to the present  day. There is little depth here -  the centuries chase each other  across the pages - but it does provide an attractive, if basic,  introduction to English history through its hillforts, monuments,  buildings and kings and queens as well as paintings and  manuscripts.",
        "Category": " History , Europe , General",
        "Publisher": "Phaidon Press Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Horse Diaries #3: Koda",
        "Authors": "By Hermes, Patricia and Sanderson, Ruth (ILT)",
        "Description": "For anyone who has ever dreamed of hearing a horse’s story . . .Independence, Missouri, 1846Koda is a bay quarter horse with a white blaze. He loves to explore the countryside and run free with his human friend Jasmine nearby. But after Koda sets out with Jasmine’s family on a long and dusty wagon train journey on the Oregon Trail, he finds out what is truly important to him. Here is Koda’s story . . . in his own words.With moving and knowledgeable text and lovely black-and-white art throughout—both by real horse people—this is the perfect fit for all lovers of horses and history!",
        "Category": " Juvenile Fiction , Historical , United States , 19th Century",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Little Prince: The Story of a Shetland Pony (The Breyer Horse Collection, 2)",
        "Authors": "By Wedekind, Annie",
        "Description": "If Dauphin, a pampered Shetland pony, seems to lead the perfect life in the penthouse suite of the city's posh riding stables, it's because he does. And if he seems a bit too self-satisfied—after all, he's won several trophies for his young owner, Isabella, and is widely acknowledged to be the prettiest pony in the city—it's because he is.Dauphin leads a rich, comfortable life. But all that changes when his relationship with his owner takes a decided turn for the worse. He's suddenly sent away to a farm in the middle of nowhere, which is filled with the most unusual animals. And where, against all odds, he discovers the true meaning of home and family.",
        "Category": " Juvenile Fiction , Animals , Horses",
        "Publisher": "Feiwel & Friends",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Everyone She Loved: A Novel (Wsp Readers Club)",
        "Authors": "By Curran, Sheila",
        "Description": "A wise and triumphant novel about four women who’ve come of age together only to discover that—when it comes to the essentials—life’s little instruction book will always need revising. Penelope Cameron has convinced her husband and four closest friends to sign an outlandish pact. If she should die before her two daughters are eighteen, her husband will not remarry without the permission of Penelope’s sister and three college roommates. For years, this contract gathers dust until the unthinkable happens—a disaster that only lovable, worrisome Penelope could have predicted—and everyone she loved is left in a world without her. With the help of Penelope’s friends, her husband and children slowly build new lives. But just when things start to come together, the fragile serenity they have gained is suddenly threatened from within, and the unbreakable bonds they share seem likely to dissolve after all. Entertaining and uplifting, Everyone She Loved explores the faith one woman placed in those she held dearest, the care she took to protect her family, the many ways in which romantic entanglements will confound and confuse even the most determined of planners, but above all, the abiding strength of friendship.",
        "Category": " Fiction , Family Life",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Fancy Nancy: The Show Must Go On (I Can Read Level 1)",
        "Authors": "By O'Connor, Jane, Preiss-Glasser, Robin (ILT), and Enik, Ted (ILT)",
        "Description": "Nancy, who likes to use fancy words, is dismayed to be partnered with shy classmate Lionel for the school talent show until she comes up with an act perfectly suited for both of them. Simultaneous.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Growing Your Inner Light: A Guide to Independent Spiritual Practice",
        "Authors": "By Owen, Lara",
        "Description": "A comprehensive guide for creating a daily spiritual practice, Growing Your Inner Light gives specific advice on developing a unique spiritual path that fits exactly who you are, and what you hope to grow into as a spiritual being. Author Lara Owen clearly shows how a personalized practice can open the doors to living fully with integrity and to feeling connected with the surrounding world.   For readers yearning for a sense of inner peace, and a direct experience of spiritual meaning and connection, Growing Your Inner Light is a groundbreaking, transformative journey through thirteen phases of your growth, including: developing intuition; creating sacred spaces and altars; understanding your dreams; exploring the importance of retreats, meditation, and rituals.   Growing Your Inner Light gives readers the freedom to integrate from different traditions -- and develop new ones -- in order to create their own spiritual tradition. One former student of Lara's program shared that she feels \"less like a spiritual tourist and more like a pilgrim.\" Spiritual development is a natural part of being human, and a vital way to expand the intensity of your inner light throughout your life.",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Atria Books/Beyond Words",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Virginia Gardener's Guide",
        "Authors": "By Heriteau, Jacqueline",
        "Description": "Jacqueline Heriteau, named Communicator of the Year by the American Nurseryman's Association and coordinator of the Plant-A-Row for the Hungry campaign of the Garden Writers' Association of America, is well-known among Virginia gardeners.? With over 400 years of garden history, Virginia's 3-zone climate allows for nearly year-round gardening.? Jacqueline suggests that one of the best ways to learn about the plants most suitable to your landscape is to visit one of many magnificent public gardens that are found across the state, including Jefferson's Monticello in Central Virginia and Colonial Williamsburg Restoration in Tidewater, VA.? Jacqueline recommends 170 choice plant selections, including annuals, deciduous and evergreen trees, flowering bulbs, groundcovers, herbs, ornamental grasses, perennials, roses shrubs, and vines.? An entire chapter dedicated to creating ornamental water gardens adds a unique growing medium to the beauty of a Virginia landscape.? Most decidedly, Virginia gardeners will not suffer from a lack of interesting horticultural options.",
        "Category": " Gardening , Landscape",
        "Publisher": "Cool Springs Press",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Forest Gate: A Novel",
        "Authors": "By Akinti, Peter",
        "Description": "A shattering, poetic and raw first novel set among young Somalian refugees in the slums of London -- beginning with a double suicide and ending with a rebirth.   In a community where poverty is kept close and passed from one generation to the next, two teenage boys, best friends, stand on top of twin tower blocks. Facing each other across the abyss of London's urban sprawl, they say their good-byes and jump. One dies. The other, alternating with the sister of the deceased, narrates this novel.   James gives us a window into the inner city -- his mom is a crack addict, his gang \"brothers\" force him to kill another black boy. Meina describes with feeling her family history in Somalia: after her parents are killed before her eyes, her village aunt sells her to six husbands -- before she is even a teenager. Desperate to rebuild their lives, James and Meina set out to find the place for which every child longs -- home.   Brutal and shockingly violent in places, rambunctious and lively in others and slyly, dryly witty in yet others, Meina and James's journey toward life through their past is ultimately a powerful story of redemptive love and the debut of an extraordinary literary talent.",
        "Category": " Fiction , Literary",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Model World & Other Co",
        "Authors": "By Chabon, Michael",
        "Description": "From the wondrously talented author of The mysteries of Pittsburgh and Wonder Boys comes a magnificent collection of ironic, understated tales that confirm his reputation as \"the young star of American letters.\" -- Washington Post Book World. Here are eleven superb stories about growing up and growing wise -- stories in which people attempt to create and inhabit their own model worlds, only to watch them collapse in the face of the real world.",
        "Category": " Fiction , General",
        "Publisher": "Harper-perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "The Elements of Journalism: What Newspeople Should Know and the Public Should Expect, Completely Updated and Revised",
        "Authors": "By Kovach, Bill and Rosenstiel, Tom",
        "Description": "The Book That Every Citizen and Journalist Should Read“What this book does better than any single book on media history, ethics, or practice isweave . . . [together] why media audiences have fled and why new technology and megacorporate ownership are putting good journalism at risk.” —Rasmi Simhan,Boston Globe“Kovach and Rosenstiel’s essays on each [element] are concise gems, filled with insights worthy of becoming axiomatic. . . . The book should become essential reading for journalism professionals and students and for the citizens they aim to serve.” —Carl Sessions Stepp, American Journalism Review“If you think journalists have no idea what you want . . . here is a book that agrees with you. Better—it has solutions. The Elements of Journalism is written for journalists, but any citizen who wonders why the news seems trivial or uninspiring should read it.” —Marta Salij, Detroit Free PressThe elements of journalism are:* Journalism’s first obligation is to the truth.* Its first loyalty is to citizens.* Its essence is a discipline of verification.* Its practitioners must maintain an independence from those they cover.* It must serve as an independent monitor of power.* It must provide a forum for public criticism and compromise.* It must strive to make the significant interesting and relevant.* It must keep the news comprehensive and proportional.* Its practitioners must be allowed to exercise their personal conscience.",
        "Category": " Language Arts & Disciplines , Journalism",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Love 'em or Lose 'em: Getting Good People to Stay (4th edition)",
        "Authors": "By Kaye, Beverly L. and Jordan-Evans, Sharon",
        "Description": "NEW EDITION, REVISED AND UPDATED Since employees who walk out the door cost their companies up to 200 percent of their annual salaries to replace, retention is one of the most important issues facing businesses today. And with so many surveys reporting that employees are unhappy and not working up to their full potential, engagement is a second serious and costly issue. The latest edition of this Wall Street Journal bestseller offers twenty-six simple strategies—from A to Z—that managers can use to address their employees’ real concerns and keep them engaged. The fifth edition has been revised and updated throughout and includes many more international examples, reflecting the fact that Love ’Em or Lose ’Em is available in twenty-two languages, from Albanian and Arabic to Thai and Turkish. Its message is truly one that spans continents and cultures.",
        "Category": " Business & Economics , Human Resources & Personnel Management",
        "Publisher": "Berrett-Koehler Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Leaving the World: A Novel",
        "Authors": "By Kennedy, Douglas",
        "Description": "#1 International Bestseller “In this surging epic, a veritable decathlon of the spirit, Kennedy incisively dramatizes the enigma of chance, petty cruelty, and catastrophic evil, ‘unalloyed grief,’ and the tensile strength concealed beneath our obvious vulnerability.” —Booklist (starred review)On the night of her thirteenth birthday, Jane Howard made a vow to her warring parents: she would never get married, and she would never have children. But life, as Jane comes to discover, is a profoundly random business. Many years and many lives later, she is a professor in Boston, in love with a brilliant, erratic man named Theo. And then Jane becomes pregnant. Motherhood turns out to be a great welcome surprise—but when a devastating turn of events tears her existence apart she has no choice but to flee all she knows and leave the world. Just when she has renounced life itself, the disappearance of a young girl pulls her back from the edge and into an obsessive search for some sort of personal redemption. Convinced that she knows more about the case than the police do, she is forced to make a decision—stay hidden or bring to light a shattering truth. Leaving the World is a riveting portrait of a brilliant woman that reflects the way we live now, of the many routes we follow in the course of a single life, and of the arbitrary nature of destiny. A critically acclaimed international bestseller, it is also a compulsive read and one that speaks volumes about the dilemmas we face in trying to navigate our way through all that fate throws in our path.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Calculus Super Review",
        "Authors": "By Fogiel, M. (EDT)",
        "Description": "Get all you need to know with Super Reviews! Each Super Review is packed with in-depth, student-friendly topic reviews that fully explain everything about the subject. The Calculus I Super Review includes a review of functions, limits, basic derivatives, the definite integral, combinations, and permutations. Take the Super Review quizzes to see how much you've learned - and where you need more study. Makes an excellent study aid and textbook companion. Great for self-study!DETAILS- From cover to cover, each in-depth topic review is easy-to-follow and easy-to-grasp - Perfect when preparing for homework, quizzes, and exams!- Review questions after each topic that highlight and reinforce key areas and concepts- Student-friendly language for easy reading and comprehension- Includes quizzes that test your understanding of the subject",
        "Category": " Mathematics , Calculus",
        "Publisher": "Research & Education Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Ghosts and Witches of Cotswolds",
        "Authors": "By Brooks, John Attwood",
        "Description": "",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Jarrold Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "The 29 Most Common Writing Mistakes and How to Avoid Them",
        "Authors": "By Delton, Judy",
        "Description": "Discusses procrastination, observation, editing, generalization, dialogue, diction, punctuation, theme, plot, honesty, and agents",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "The Lute Player: A Novel of Richard the Lionhearted",
        "Authors": "By Lofts, Norah",
        "Description": "Beloved author Norah Lofts brings to life the romance and adventure of the crusading king Richard the Lionhearted through the eyes of his most humble and trusted companion -- his lute player.  One of the most renowned figures in medieval history, Richard the Lionhearted, inspired by a vision of the Holy Land, led his knights onto the battlefields of the Third Crusade. During the years of fighting and intrigue, Richard's life was intertwined with the lives of two strong, vibrant, and drastically different women who loved him -- Berengaria, princess of Navarre, and his mother, Eleanor of Aquitaine. While his marriage to Berengaria was ill-fated, Eleanor loved her son with a frantic, possessive pride. But it is Blondel, the king's lute player, who here steps forward from the shadows to tell this tale of romance, war, and betrayal.   In her trademark style, Norah Lofts paints a complex and human portrait of a legendary king.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "The Looking Glass Wars",
        "Authors": "By Beddor, Frank",
        "Description": "The Myth: Alice was an ordinary girl who stepped through the looking glass and entered a fairy-tale world invented by Lewis Carroll in his famous storybook. The Truth: Wonderland is real. Alyss Heart is the heir to the throne, until her murderous aunt Redd steals the crown and kills Alyss? parents. To escape Redd, Alyss and her bodyguard, Hatter Madigan, must flee to our world through the Pool of Tears. But in the pool Alyss and Hatter are separated. Lost and alone in Victorian London, Alyss is befriended by an aspiring author to whom she tells the violent, heartbreaking story of her young life. Yet he gets the story all wrong. Hatter Madigan knows the truth only too well, and he is searching every corner of our world to find the lost princess and return her to Wonderland so she may battle Redd for her rightful place as the Queen of Hearts.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Speak",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "I Know I've Been Changed",
        "Authors": "By Billingsley, Reshonda Tate",
        "Description": "A successful television reporter discovers that family is more important than fame and fortune in this hilarious and heartwarming family drama from bestselling author ReShonda Tate Billingsley.Raedella Rollins left the dusty town of Sweet Poke, Arkansas, on a Texas-bound bus with four mismatched suitcases, a newsroom job offer, and a promise to herself: never look back. Now, less than a decade later, she’s a top-rated talk show host, a celebrity news anchor, and fiancée to Houston’s star councilman. The future looks bright for Rae, and Sweet Poke is nothing more than a distant memory. But now that she’s reached the top, her ragtag family comes knocking. Mama Tee, the grandmother who raised her, calls with unwelcome family updates; and Shondella, her jealous older sister, guilts her into sending money. To Rae, nothing could be worse than an unexpected reunion with her over-the-top relatives. But when her picture-perfect life turns out to be an illusion, Rae's family calls her back to Sweet Poke and to the life she left behind. Can Rae let go of the pain of her childhood and open her heart to the healing that only faith and family can provide?",
        "Category": " Fiction , Romance , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Dr. Drabble's Remarkable Underwater Breathing Pills (Dr. Drabble Series , No 1)",
        "Authors": "By Brouwer, Sigmund, Davidson, Wayne, and Bell, Bill (ILT)",
        "Description": "",
        "Category": "",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "In God's Time: The Bible and the Future",
        "Authors": "By Hill, Craig C.",
        "Description": "Enormous confusion exists today concerning the Bible's teaching about the future. Millions of contemporary Christians are caught up in \"rapture\" fever, evidenced by the phenomenal success of the Left Behind novels. At the opposite end of the spectrum are those, such as the leaders of the Jesus Seminar, who believe that Jesus did not teach about the approaching Kingdom of God.In God's Time offers an alternative to these two poles in the debate, an alternative that is at once faithful and sane, readable and scholarly. Author Craig C. Hill encourages Christians both to take seriously and to think sensibly about the hope of God's ultimate victory. His new book includes chapters on the nature of the Bible, the history of prophecy, the meaning of apocalyptic writings, the interpretation of Daniel and Revelation, the expectations of Jesus, and the hopes of the early Christians. It also includes an appendix (\"Not Left Behind\") on the subject of the rapture.Endorsed by a wide array of top scholars and church leaders, In God's Time is a reliable guide to this often bewildering but always fascinating subject.",
        "Category": " Religion , Biblical Criticism & Interpretation , New Testament",
        "Publisher": "Wm. B. Eerdmans Publishing Co.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Portia's Ultra Mysterious Double Life (mix)",
        "Authors": "By Hays, Anna",
        "Description": "I look at the clock: 4:23 a.m. In approximately three hours I have to wake up again to go to school, and I haven't even gone to sleep yet. How can I possibly care about pop quizzes, bad hair days, and beauty makeovers now that I've found a major clue to the true identity of my missing father?    IDENTIFYING DATA   Subject: Portia Avatar -- Girl Psychoanalytic Detective   Background material: Twelve years old. Lives with earth mom, Indigo, and gray-and-white cat (who thinks he's a dog) named Frederick. To date, Portia does not know the whereabouts of her mysterious father, Patch.   Recent developments: An earthquake shakes up Portia's sleepy hometown of Palmville, California. A photograph of Patch is uncovered. Portia's life, as she knows it, is about to change forever.",
        "Category": " Juvenile Fiction , Social Themes , Adolescence & Coming of Age",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "As They See 'Em: A Fan's Travels in the Land of Umpires",
        "Authors": "By Weber, Bruce",
        "Description": "Millions of American baseball fans know, with absolute certainty, that umpires are simply overpaid galoots who are doing an easy job badly. Millions of American baseball fans are wrong.As They See ’Em is an insider’s look at the largely unknown world of professional umpires, the small group of men (and the very occasional woman) who make sure America’s favorite pastime is conducted in a manner that is clean, crisp, and true. Bruce Weber, a New York Times reporter, not only interviewed dozens of professional umpires but entered their world, trained to become an umpire, then spent a season working games from Little League to big league spring training. As They See ’Em is Weber’s entertaining account of this experience as well as a lively exploration of what amounts to an eccentric secret society, with its own customs, its own rituals, its own colorful vocabulary. Writing with deep knowledge of and affection for baseball, he delves into such questions as: Why isn’t every strike created equal? Is the ump part of the game or outside of it? Why doesn’t a tie go to the runner? And what do umps and managers say to each other during an argument, really? Packed with fascinating reportage that reveals the game as never before and answers the kinds of questions that fans, exasperated by the clichés of conventional sports commentary, pose to themselves around the television set, Bruce Weber’s As They See ’Em is a towering grand slam.",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "The Teacher's Guide to Success: Teaching Effectively in Today's Classrooms",
        "Authors": "By Kronowitz, Ellen L.",
        "Description": "How do successful teachers become successful? What skills do they have and which resources do they use? Dr. Ellen Kronowitz explores the keys to successful teaching and offers a realistic view of today’s classrooms and presents a very practical approach to preparing to teach. Pre-service and in-service teachers alike are provided tried and true experienced-based suggestions and research-based strategies and solutions to meet classroom challenges.     Organized by 8 topical units that address common, overriding concerns in the classroom, teachers are taken from the first day to the end of the school year. Each of the brief chapters within each unit simplifies the complex challenges teachers face including: having a successful first day, organizing the classroom with proven routines and procedures, disciplining students in a respectful and positive manner, mapping out a differentiated curriculum, teaching with proven research-based strategies, assessing student learning, working with parents, preparing students for standardized tests, addressing the personal and professional needs of teachers, and much more. Paired with a powerful DVD that comes with every book, readers are provided with tips from leading authorities in education, examples from live classrooms, and printable resources ready for immediate use in the classroom.",
        "Category": " Education , Professional Development",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Smash Trash! ( Wall - E Step into Reading Step 1)",
        "Authors": "By Driscoll, Laura and Cortes, Mario (ILT)",
        "Description": "Meet WALL•E in this Step 1 reader! It is the 29th Century and the Earth has been abandoned, but one robot has been left behind to collect and condense trash—WALL•E. This Step 1 Step into Reading book introduces early readers to Disney/Pixar WALL•E.",
        "Category": " Juvenile Fiction , Science Fiction , General",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "American Adulterer: A Novel",
        "Authors": "By Mercurio, Jed",
        "Description": "• Taut, magnificent prose: Mercurio’s premise—to chronicle Kennedy’s exploits, political and sexual, through the President’s own anguished but self-centered perspective—is bold to the point of hubris, but he succeeds in spades. The writing is elegant, spare, and wry; the narrative is exquisitely paced. The book’s ending is emotionally shattering—empathetic, redemptive, and shocking. • Startlingly revisionist portrait of JFK: We see Kennedy at his best, as a visionary statesman, a former soldier turned moral pacifist, a loving parent and devoted husband. And we see him at his worst, as a compulsive philanderer whose countless conquests—of movie stars, socialites, secretaries, and interns—ruined hundreds of lives.  • Amazing cast of characters: They are all here: Marilyn Monroe, Frank Sinatra, Peter Lawford, Angie Dickinson, Judith Campbell, LBJ, Fiddle and Faddle, Eisenhower, and perhaps most memorably, Jacqueline Kennedy.",
        "Category": " Fiction , Literary",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Disney Storybook Collection",
        "Authors": "By Disney Book Group (COR)",
        "Description": "Featuring your favorite Disney characters, these bestselling storybook collections havebeen completely redesigned with all new covers, gilded pages, newly editedtext, and a classic new look with over 250 illustrations?including full-pageartwork from the Disney archives.  From Bambi to Aladdin, the best-loved storiesof all time are now even better. Over twenty stories re-create the movie magicof the most beloved Disney films. Enhanced with new pieces of art from the Disney archives, these stories are still the ideal length for reading aloud.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "7.01",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The Satin Sash",
        "Authors": "By Garnier, Red",
        "Description": "Among three lovers, there are ties that bind?Business partners and best friends Grey Richards and Heath Solis are as different as night and day. Grey is calm, confident, and always in control. Heath is as passionate as his smoldering looks. No woman can resist them, and it?s always been easy to share. Until now? Grey is head over heels in love. He?ll do anything to see Antonia Kearny smile, to hear her breath catch, to make her scream his name. And when he realizes that Toni wants another man?and that it?s Heath? he?ll make the ultimate sacrifice? On a decadent weekend in Mexico, Toni will experience the hunger, the touch, the taste of two men. But will her desire bring them together, or tear them apart?",
        "Category": " Fiction , Erotica , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "The DIVA Principle®: Secrets to Divine Inspiration for Victorious Attitude",
        "Authors": "By McKinney Hammond, Michelle",
        "Description": "Offers straightforward advice on how to develop a positive attitude and a confident sense of style, sharing tips for women on how to champion themselves, take charge in a relationship, and overcome emotional and spiritual obstacles. Original.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Winner-Take-All Society: Why the Few at the Top Get So Much More Than the Rest of Us",
        "Authors": "By Frank, Robert H. and Cook, Philip J.",
        "Description": "Disney chairman Michael Eisner topped the 1993 Business Week chart of America's highest-paid executives, his $203 million in earnings roughly 10,000 times that of the lowest paid Disney employee.During the last two decades, the top one percent of U.S. earners captured more than 40 percent of the country's total earnings growth, one of the largest shifts any society has endured without a revolution or military defeat.  Robert H. Frank and Philip J. Cook argue that behind this shift lies the spread of \"winner-take-all markets\"&#151;markets in which small differences in performance give rise to enormous differences in reward.  Long familiar in sports and entertainment, this payoff pattern has increasingly permeated law, finance, fashion, publishing, and other fields.  The result: in addition to the growing gap between rich and poor, we see important professions like teaching and engineering in aching need of more talent.  This relentless emphasis on coming out on top&#151;the best-selling book, the blockbuster film, the Super Bowl winner&#151;has molded our discourse in ways that many find deeply troubling.",
        "Category": " Social Science , Social Classes & Economic Disparity",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Endurance Ride (The Saddle Club, No. 69)",
        "Authors": "By Bryant, Bonnie",
        "Description": "Learning about endurance riding, the Saddle Club girls prepare themselves for a grueling contest but fear that their annoying fellow rider, Kristie, is going to be their toughest obstacle. Original.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Skylark",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Fishy Friends: A Journey Through the Coral Kingdom",
        "Authors": "By O'Neill, Michael Patrick",
        "Description": "",
        "Category": " Juvenile Nonfiction , Animals , Marine Life",
        "Publisher": "Batfish Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Iron Heart: The True Story of How I Came Back from the Dead",
        "Authors": "By Boyle, Brian and Katovsky, Bill (CON)",
        "Description": "It was a horrific car crash. On the way home from swim practice, eighteen-year old Brian Boyle’s future changed in an instant when a dump truck plowed into his Camaro. He was airlifted to a shock-trauma hospital. He had lost sixty percent of his blood, his heart had moved across his chest, and his organs and pelvis were pulverized. He was placed in a medically-induced coma. When Brian finally emerged from the coma two months later, he had no memory of the accident. He could see and hear, but not move or talk. Unable to communicate to his doctors, nurses, or frantic parents, he heard words like ?vegetable” and ?nursing home.” If he lived, doctors predicted he might not be able to walk again, and certainly not swim. Then, miraculously, Brian clawed his way back to the living. First blinking his eyelids, then squeezing a hand, then smiling, he gradually emerged from his locked-in state. The former swimmer and bodybuilder had lost one hundred pounds. Iron Heart is the first-person account of his ordeal and his miraculous comeback. With enormous fortitude he learned to walk, then run, and eventually, to swim. With his dream of competing in the Ironman Triathlon spurring him on, Brian defied all odds, and three-and-a-half years after his accident, crossed the finish line in Kona, Hawaii. Brian’s inspiring journey from coma to Kona is brought to life in this memoir.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Skyhorse Publishing",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "How to Avoid the Mommy Trap: A Roadmap for Sharing Parenting and Making It Work (Capital Ideas)",
        "Authors": "By Shields, Julie",
        "Description": "Typically, when a woman gets pregnant, she considers whether to give up or cut back on her career, or surrender her child to daycare or a nanny.  Now families have other alternatives.  Fathers can stay home, work flexibly, go part-time, or help out so stay-at-home-mothers enjoy personal fulfillment too.  Prepared women can choose the lives they want by following the common sense prescriptions in \"How to Avoid the Mommy Trap.\"  Julie Shields interviewed marital counselors, childcare workers, negotiation experts, employers, child development experts, and parents to find out how to create a family balance.  How to Avoid the Mommy Trap emphasizes real-life solutions and strategies, and highlights common missteps.  Weaving research and anecdote together, Julie Shields demonstrates the value and efficacy of a new parenting paradigm - sharing.  This sensible primer is for every parent thinking about having children but wondering if and how to balance work, parenthood, and life.    Author Events    August 15, 2003 - WCUB Breakfast Club, 10 a.m.    August 26, 2003 - WFHR Radio, 10 a.m.    August 27, 2003 - WBKC, 8:30a.m.    August 29, 2003 - KLPW Radio, 12:10 p.m.    September 12, 2003 into September 13, 2003 - WBZ Radio, 1 a.m.      September 13, 2003 - WFAS \"Here’s to Your Good Health,\" 11 a.m.     September 27, 2003 - KTKK Interviews & Interactions with Linda Strasberg, 5:30 p.m.    October 29, 2003 - Speaking Engagement at the 92nd Street Y in New York City    November 1, 2003 - WFHG 92.7 FM / WXBQ \"The Barbara McFaddin Show,\" 10am",
        "Category": " Family & Relationships , Children with Special Needs",
        "Publisher": "Capital Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "The Cat at the Door: And Other Stories to Live by",
        "Authors": "By Mather, Anne D., Weldon, Louise B., and Martin, Lyn (ILT)",
        "Description": "Brief stories relating common events in the daily lives of children provide simple, positive thoughts to help readers learn about self-respect and relating to other people",
        "Category": " Juvenile Nonfiction , Family , General",
        "Publisher": "Hazelden",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Amelia Bedelia and the Baby (I Can Read Level 2)",
        "Authors": "By Parish, Peggy and Sweat, Lynn (ILT)",
        "Description": "Learn to read with the classic Amelia Bedelia! Ever since Amelia Bedelia made her debut in 1963, young readers have been laughing out loud at the antics of this literal-minded but charming housekeeper. Amelia Bedelia says, \"I don't know a thing about babies,\" so she has her hands full when she takes care of Mrs. Lane's baby. As usual, everyone’s favorite quirky housekeeper mixes things up, but she also wins the heart of her newest and youngest fan. This Level 2 I Can Read is perfect for kids who read on their own but still need a little help.\"No child can resist Amelia [Bedelia] and her literal trips through the minefield of the English language—and no adult can fail to notice that she's usually right when she's wrong.\"—The New York Times Book Review",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Greenwillow Books",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Good Work, Amelia Bedelia (I Can Read Level 2)",
        "Authors": "By Parish, Peggy and Sweat, Lynn (ILT)",
        "Description": "A busy dayMr. and Mrs. Rogers leave for the day and give Amelia Bedelia a long list of chores to do. Not one to stand still, Amelia Bedelia gets right to work -- with totally unexpected results!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Greenwillow Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Not in My Family: AIDS in the African-American Community",
        "Authors": "By Robertson, Gil L., IV",
        "Description": "In this landmark collection of personal essays, stories, brief memoirs, and polemics, a broad swath of black Americans unite to bear witness to the devastation AIDS has wrought on their community.  Not in My Family marks a new willingness on the part of black Americans—whether prominent figures from the worlds of politics, entertainment, or sports, or just ordinary folks with extraordinary stories — to face the scourge that has affected them disproportionately for years. Editor Gil Robertson has enlisted a remarkable group of contributors, including performers like Patti LaBelle, Mo’Nique, and Hill Harper; bestselling authors like Randall Robinson and Omar Tyree; political leaders like Rep. Jesse Jackson Jr. and former U.S. Surgeon General Dr. Joycelyn Elders; religious leaders like Rev. Calvin Butts, and many, many more.",
        "Category": " Medical , Public Health",
        "Publisher": "Agate Bolden",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "The Opposite of Me: A Novel",
        "Authors": "By Pekkanen, Sarah",
        "Description": "A \"fresh, funny, and satisfying\" (New York Times bestselling author Jennifer Weiner) about the complicated bonds of sisterhood.Twenty-nine-year-old Lindsey Rose has, for as long as she can remember, lived in the shadow of her ravishingly beautiful fraternal twin sister, Alex. Determined to get noticed, Lindsey is finally on the cusp of being named VP creative director of an elite New York advertising agency, after years of eighty-plus-hour weeks, migraines, and profound loneliness. But during the course of one devastating night, Lindsey’s carefully constructed life implodes. Humiliated, she flees the glitter of Manhattan and retreats to the time warp of her parents’ Maryland home. As her sister plans her lavish wedding to her Prince Charming, Lindsey struggles to maintain her identity as the smart, responsible twin while she furtively tries to piece her career back together. But things get more complicated when a long-held family secret is unleashed that forces both sisters to reconsider who they are and who they are meant to be.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "unConventional Assassination: Baltimore—Politics, Passion and Power",
        "Authors": "By Young, Ron",
        "Description": "",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "PublishAmerica",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "The Bible Answer Book",
        "Authors": "By Hanegraaff, Hank",
        "Description": "Hank Hanegraaff has heard it all. He knows what questions plague believers and nonbelievers. And he's done something about it--he's spelled out the answers. The Bible Answer Book is a simple guide covering 80 of the top questions that the Bible Answer Man has dealt with in his ministry. Topics include parents and kids, religions, difficulty, faith, fear, sin, salvation, and many more issues vital to understanding the path to better understanding God. Each question is approached in Hanegraaff's scholarly, easy-to-understand style, and he even suggests additional sources for readers who want to explore the topics further.",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "9.8",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "A Guide to the World Bank",
        "Authors": "By World Bank",
        "Description": "The World Bank Group is a vital source of financial and technical assistance to developing countries around the world. Its focus is on helping the poorest people in the poorest countries by using its financial resources, staff, and extensive experience to aid countries in reducing poverty, increasing economic growth, and improving quality of life. In partnership with more than 100 developing countries, the Bank Group is striving to improve health and education, fight corruption, boost agricultural support, build roadsand ports, and protect the environment. Other projects are aimed at rebuilding war-torn countries or regions, providing basic services such as access to clean water, and encouraging investments that create jobs. In addition to this critical groundwork around the world, various parts of the World Bank Group are involved in activities ranging from conducting economic research and analysis to providing financial and advisory services to governments and private enterprises.This completely revised and updated second edition provides an accessible and straightforward overview of the World Bank Group's history, organization, mission, and purpose. Additionally, for those wishing to delve further into subjects of particular interest, the book guides readers to sources containing more detailed information, including annual reports, Web sites, publications, and e-mail addresses for various departments. It also provides information on how to work for or do business with the World Bank.A good introduction for anyone interested in understanding what the World Bank Group does and how it does it, this book shows readers who want to learn more where to begin.",
        "Category": " Business & Economics , Development , Economic Development",
        "Publisher": "World Bank Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Ultimate Guide to Ceramic & Stone Tile: Select, Install, Maintain (Home Improvement) (English and English Edition)",
        "Authors": "By Editors of Creative Homeowner, Home Improvement, How-To",
        "Description": "Everything a do-it-yourselfer needs to know about tiling floors, walls, counters, patios, and more can be found in Ultimate Guide to Ceramic & Stone Tile. Design and planning information helps readers prepare the site and select the right tile–ceramic, stone, vinyl, glass, and more. Chapters on tools and materials feature how-to photo sequences so even novices can tackle tile projects successfully. The emphasis is on solid, durable installations that can stand up to years of use in kitchens, baths, and other areas. The book also covers exterior applications, and includes a practical and complete guide to repairing and maintaining existing tile.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "The Fragmented Forest: Island Biogeography Theory and the Preservation of Biotic Diversity (Chicago Original Paperback)",
        "Authors": "By Harris, Larry D.",
        "Description": "In this poineering application of island biogeography theory, Harris presents an alternative to current practices of timber harvesting. \"Harris pulls together many threads of biological thinking about islands and their effect on plant and animal survival and evolution. He weaves these threads into a model for managing forest lands in a manner that might serve both our short-term economic and social needs as well as what some people feel is our ancient charge to be steward of all parts of creation.\"--American ForestsWinner of the 1986 Wildlife Society Publication Award",
        "Category": " Science , Life Sciences , Ecology",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "The Intellectual Devotional Modern Culture: Revive Your Mind, Complete Your Education, and Converse Confidently with the Culturati (The Intellectual Devotional Series)",
        "Authors": "By Kidder, David S. and Oppenheim, Noah D.",
        "Description": "In the tradition of the instant bestsellers The Intellectual Devotional and The Intellectual Devotional: American History comes the third installment in this indispensable series. In The Intellectual Devotional: Modern Culture, authors David S. Kidder and Noah D. Oppenheim explore the fascinating world of contemporary culture to offer 365 daily readings that provide the essential references needed to navigate the world today. Quench your intellectual thirst with an overview of the literature, music, film, personalities, trends, sports, and pop references that have defined the way we live. From the Slinky to Star Wars; Beatlemania to Babe Ruth; flappers to fascism—refreshing your memory and dazzling your friends has never been easier, or more fun. Whether you're a trivia genius, pop-culture buff, or avid reader, you'll be riveted by this comprehensive journey through contemporary culture.",
        "Category": " Reference , Almanacs",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "The Decline & Fall of the Roman Empire",
        "Authors": "By Low, D.M.",
        "Description": "",
        "Category": "",
        "Publisher": "Bonanza Books",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "Century's End",
        "Authors": "By Schwartz, Hillel",
        "Description": "As we near the end of a millennium, the fears of decay and fantasies of renewal multiply. In this scholarly and riveting analysis, Schwartz considers the Christian, Jewish, and Islamic experiences of one thousand years of centuries' ends, not only in historical perspective but with a view to understanding the cultural meaning and implications of that state of mind known as  fin de siecle . With b&w illustrations and excellent endnotes. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " History , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Small Group Strategies: Ideas and Activities for Developing Spiritual Growth in Your Students",
        "Authors": "By Polich, Laurie and Scandlyn, Charley",
        "Description": "Meet students where they are. With Small Group Strategies, you can effectively guide students in your small group toward the most important relationship they will ever have—a lifelong relationship with Christ. Respected authors Laurie Polich and Charley Scandlyn offer 30-plus years of collective youth ministry experience to these proven ideas, which offer: •a strategic approach to small group ministry •hundreds of ideas to reach students at every level •practical applications that foster spiritual growth Meet your students where they are in life. You have the heart. You have the vision. Here are the ideas you need to make it happen.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "City, Save Thyself!: Nuclear Terror and the Urban Ballot",
        "Authors": "By Wylie, David A.",
        "Description": "Acting as a what-to-do guide for a hundred agonizing what’s-wrong reports on war, terror, habitat destruction, and the decay of democracy, this book lays out a ways to revitalize democratic resources via city and town government. Whatever a person’s current response to America’s civic ills and the world's threat from nuclear weapons, the ideas presented here will urge a productive new phase and aid in turning frustration into aspiration. This volume is a remarkable combination of practical politics, idealism, and invention.",
        "Category": " Political Science , Political Process , Political Advocacy",
        "Publisher": "Trueblood Publishing Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "The Key to Life (Mini Book) (Petites)",
        "Authors": "By Bedford-Pierce, Sophia and Gershman, Jo",
        "Description": "",
        "Category": " Reference , Quotations",
        "Publisher": "Peter Pauper Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Being a Wild, Wonderful Woman for God",
        "Authors": "By Tirabassi, Becky",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "The Lost Dinosaur Bone (Little Critter)",
        "Authors": "By Mayer, Mercer",
        "Description": "Little Critter's class is going to the Critterville Museum of Natural History, and everyone is excited. But when the class arrives, they find out the dinosaur exhibit is closed because of a missing Triceratops bone. Join Little Critter as he searches the Hall of Gems and Minerals, climbs the trees in the rain forest, and sneaks around the Planetarium—all to solve the mystery of the lost dinosaur bone.",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "The Botticelli Secret: A Novel of Renaissance Italy (Reading Group Gold)",
        "Authors": "By Fiorato, Marina",
        "Description": "In this exhilarating cross between The Da Vinci Code and The Birth of Venus, an irrepressible young woman in 15th-century Italy must flee for her life after stumbling upon a deadly secret when she serves as a model for Botticelli...When part-time model and full-time prostitute Luciana Vetra is asked by one of her most exalted clients to pose for a painter friend, she doesn't mind serving as the model for the central figure of Flora in Sandro Botticelli's masterpiece \"Primavera.\" But when the artist dismisses her without payment, Luciana impulsively steals an unfinished version of the painting--only to find that somone is ready to kill her to get it back. What could possibly be so valuable about the picture? As friends and clients are slaughtered around her, Luciana turns to the one man who has never desired her beauty, novice librarian Brother Guido. Fleeing Venice together, Luciana and Guido race through the nine cities of Renaissance Italy, pursued by ruthless foes who are determined to keep them from decoding the painting's secrets.Gloriously fresh and vivid, with a deliciously irreverent heroine, The Botticelli Secret is an irresistible blend of history, wit, and suspense.",
        "Category": " Fiction , Historical , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Super Kids in 30 Minutes a Day",
        "Authors": "By Kwiatkowski, Karen U.",
        "Description": "",
        "Category": " Family & Relationships , General",
        "Publisher": "Robert D Reed",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "S.C.A.M.",
        "Authors": "By Harrison, Emma",
        "Description": "Mike Riley, a star high school quarterback well on his way to an athletic scholarship at the school of his choice, catches his girlfriend cheating on him and it takes a night of poker to make him feel like a winner again.",
        "Category": "",
        "Publisher": "Spark Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Pigs (Munsch for Kids)",
        "Authors": "By Munsch, Robert N. and Martchenko, Michael (ILT)",
        "Description": "Megan is told to feed the pigs, but not to open the gate. She does of course, and the results are hilarious as the pigs help themselves to coffee and the newspaper at the breakfast table, follow Megan to school, and ride home by way of the school bus",
        "Category": " Juvenile Fiction , Animals , Pigs",
        "Publisher": "Annick Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "How to Be Your Little Man's Dad: 365 Things to Do with Your Son",
        "Authors": "By Bolin, Dan and Sutterfield, Ken",
        "Description": "Spend time with your sonMost young boys look up to their father as the most important man in their life and long for a deep and loving relationship with him. But even if you sincerely desire a special connection with your son, that kind of closeness can be hard to build.How to Be Your Little Man’s Dad offers 365 simple and creative father-son activities that will foster the kind of relationship you both want. Written by Dan Bolin, the author of How to Be Your Daughter’s Daddy, and Ken Sutterfield, who fathers two sons, this book will encourage you to be the dad your little man needs most—a dad who takes the time to show his son he loves him.",
        "Category": " Family & Relationships , Parenting , Fatherhood",
        "Publisher": "NavPress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Be Your Own Sales Manager: Strategies And Tactics For Managing Your Accounts, Your Territory, And Yourself",
        "Authors": "By Alessandra, Anthony J., Monoky, John, and Cathcart, Jim",
        "Description": "Be Your Own Sales Manager puts the most up-to-date management techniques at your fingertips, offering smart strategies designed to give you a competitive edge.In today's fast-moving, fiercely competitive markets, sales is more than a job, it is a career, a profession requiring special knowledge and specific skills. You have to be your own boss, take on the responsibilities—and reap the rewards—of sales management.",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Laugh Again",
        "Authors": "By Swindoll, Charles R.",
        "Description": "Did you hear the one about the Christian who couldn't keep from laughing?Chuck Swindoll has not only heard it, he tells it in this delightful book that gives us permission to be happy again.\"When did life stop being funny?\" Swindoll asks. His answer is found in this best-selling book which speaks to all busy, joy-drained people?from the pressured businessman to the harried homemaker. In Laugh Again, readers will discover ways to live in the present, say \"no\" to negativism, and realize that, while no one's life is perfect, joy and humor can be inspirational.Let Chuck Swindoll show you how to experience outrageous joy . . . and learn to laugh again!",
        "Category": " Religion , Christian Life , Inspirational",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The Twelve Gifts of Birth (Twelve Gifts Series, 1)",
        "Authors": "By Costanzo, Charlene, Reger, Jill (ILT), Ackison, Wendy Wassink (ILT), and Reger, Jill (PHT)",
        "Description": "“Every home should have this book. Every family should read it often.”—Lendon Smith, M.D.(Pediatrics), Portland, OR A wonderful, inspirational, beautifully illustrated classic, The Twelve Gifts of Birth by Charlene Costanzo offers a message of love and hope for children of all ages—and for the child in every adult. The recipient of numerous prizes and accolades—including the 1999 Glyph Best Book Award—The Twelve Gifts of Birth is a gift to be cherished, ideal for giving on birthdays, baby showers, baptisms, first communions, confirmations, and, of course, Mother’s Day.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Ten-Year Nap",
        "Authors": "By Wolitzer, Meg",
        "Description": "The New York Times bestselling novel by the author of The Interestings and The Female Persuasion that woke up critics, book clubs, and women everywhere. For a group of four New York friends the past decade has been defined largely by marriage and motherhood, but it wasn’t always that way. Growing up, they had been told that their generation would be different. And for a while this was true. They went to good colleges and began high-powered careers. But after marriage and babies, for a variety of reasons, they decided to stay home, temporarily, to raise their children. Now, ten years later, they are still at home, unsure how they came to inhabit lives so different from the ones they expected—until a new series of events begins to change the landscape of their lives yet again, in ways they couldn’t have predicted. Written in Meg Wolitzer’s inimitable, glittering style, The Ten-Year Nap is wickedly observant, knowing, provocative, surprising, and always entertaining, as it explores the lives of its women with candor, wit, and generosity. Meg Wolitzers's newest book, The Interestings, is now available from Riverhead Books.",
        "Category": " Fiction , Women",
        "Publisher": "Riverhead",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "The Everything Paying For College Book: Grants, Loans, Scholarships, And Financial Aid -- All You Need To Fund Higher Education",
        "Authors": "By Brown, Nathan and Proper, Sheryle A.",
        "Description": "Finding the right college-from filling out applications to getting accepted-should be one of the most thrilling times of your life. But it won't be if you're still figuring out how to pay for it come Labor Day. Whether you're a graduating high-school senior, a parent making financial investments for your child's future, or an adult returning to school, The Everything Paying for College Book is a valuable resource that provides the information you need to face the challenge of college tuition. With appendices listing organizations and other resources, you'll find smart ways to save and find extra cash for books and class.The Everything Paying for College Book helps you learn about:The difference between loans and grantsConditional cashOptions for long-term investingWhen and how to fill out the formsQualification guidelinesWhom you should approach for moneyEasily accessible and highly informative, The Everything Paying for College Book takes the mystery out of myriad money sources, where to find grants and loans, and how to fill out the endless paper trail of forms so that you can spend less time thinking about your finances and more time hitting the books!",
        "Category": " Study Aids , Financial Aid",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "The Dating Game #6: Parallel Parking (No. 6)",
        "Authors": "By Standiford, Natalie",
        "Description": "Revisits the lives of high-schoolers Holly, Lina, and Mads as they wonder about slowing down their searches for the right boys, and as Holly's boyfriend Sean offers her friend Mads more than the driving lessons he promised.",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Guys Write for Guys Read",
        "Authors": "By Scieszka, Jon (EDT)",
        "Description": "Short stories, anecdotes, cartoons, and columns are compiled in this amusing collection by male authors, such as Stephen King and Gordon Korman, who share their comical, sad, and strange memories of what life was like for them when they were boys and the impact those moments had in their later lives. Simultaneous.",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Viking Juvenile",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Gifted Hands TV Tie-in: The Ben Carson Story (ZonderKidz Biography)",
        "Authors": "By Lewis, Gregg and Lewis, Deborah Shaw",
        "Description": "The movie, 'Gifted Hands,' airs on TNT on February 7, 2009, and portrays the amazing, true story of Dr. Ben Carson.  In this special movie tie-in print edition, kids will read how an angry inner-city boy grew up to become one of the world's greatest neurosurgeons, and they will learn how anything is possible with faith and determination. Many had given up on Ben, including himself, but his mother never did.  She encouraged him to do better and reach higher for his dreams. There are photographs of Ben and his family throughout the text with an 8-page color section of movie and behind-the-scene images.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Religious",
        "Publisher": "ZonderKidz",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "The Best American Sports Writing 2008",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "The Sugar Queen",
        "Authors": "By Allen, Sarah, Addison",
        "Description": "In this irresistible follow-up to her New York Times bestselling debut, Garden Spells, author Sarah Addison Allen tells the tale of a young woman whose family secrets—and secret passions—are about to change her life forever.Twenty-seven-year-old Josey Cirrini is sure of three things: winter in her North Carolina hometown is her favorite season, she’s a sorry excuse for a Southern belle, and sweets are best eaten in the privacy of her hidden closet. For while Josey has settled into an uneventful life in her mother’s house, her one consolation is the stockpile of sugary treats and paperback romances she escapes to each night…. Until she finds it harboring none other than local waitress Della Lee Baker, a tough-talking, tenderhearted woman who is one part nemesis—and two parts fairy godmother…Fleeing a life of bad luck and big mistakes, Della Lee has decided Josey’s clandestine closet is the safest place to crash. In return she’s going to change Josey’s life—because, clearly, it is not the closet of a happy woman. With Della Lee’s tough love, Josey is soon forgoing pecan rolls and caramels, tapping into her startlingly keen feminine instincts, and finding her narrow existence quickly expanding.Before long, Josey bonds with Chloe Finley, a young woman who makes the best sandwiches in town, is hounded by books that inexplicably appear whenever she needs them, and—most amazing of all—has a close connection to Josey’s longtime crush. As little by little Josey dares to step outside herself, she discovers a world where the color red has astonishing power, passion can make eggs fry in their cartons, and romance can blossom at any time—even for her. It seems that Della Lee’s work is done, and it’s time for her to move on. But the truth about where she’s going, why she showed up in the first place—and what Chloe has to do with it all—is about to add one more unexpected chapter to Josey’s fast-changing life.Brimming with warmth, wit, and a sprinkling of magic, here is a spellbinding tale of friendship, love—and the enchanting possibilities of every new day.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Here We Go Round the Mulberry Bush",
        "Authors": "By Jenny Tulip",
        "Description": "",
        "Category": "",
        "Publisher": "Flying Frog",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Gel Candles: 40 Creative Projects",
        "Authors": "By Prett, Giles D. (PHT) and Westerman, C. Kaila",
        "Description": "Candle gel is the hottest new product in candle crafting. This new product (95% mineral oil, 5% resin) is transparent, is extremely easy to clean up, and has a significantly longer burning time than traditional waxes. Author Kaila Westerman gives the basics of gel candle crafting in ten easy steps, then explores the endless possibilities for creating special effects with layers of color, swirls, bubbles, specialty molds, and embedments such as glass, botanicals, shells, stones, and pieces of solid paraffin candle wax. Readers can create candles that look like rainbows, aquariums, seascapes, playful sodas and other drinks, and more. Since gel candles cannot stand alone, each design is enhanced by wonderful whimsical, vintage, or even sophisticated containers.",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Travels with Ted & Ned",
        "Authors": "By Hesburgh, Theodore M.",
        "Description": "The warm   and moving story of one of the greatest religious and secular leaders of our   time.\"...the riveting story of an incredible man who made an enormous impact on history and lived his dream.\" --Ann Landers",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Corey's Pony is Missing (Pony Tails, No. 3)",
        "Authors": "By Bryant, Bonnie and Ramsey, Marcy Dunn (ILT)",
        "Description": "Friendship and ponies go hand in hand when the three members of the Pony Tails join together to locate Corey's pony, Samurai, who has run away. Original.",
        "Category": " Juvenile Fiction , Animals , Horses",
        "Publisher": "Skylark",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Stupid Celebrities",
        "Authors": "By Petras, Ross",
        "Description": "Gathers insensitive, nonsensical, and egotistical comments from actors, actresses, businessmen, singers, broadcasters, and athletes",
        "Category": " Humor , General",
        "Publisher": "Andrews McMeel Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "The Occupation of Iraq: Winning the War, Losing the Peace",
        "Authors": "By Allawi, Ali A.",
        "Description": "Involved for over thirty years in the politics of Iraq, Ali A. Allawi was a long-time opposition leader against the Baathist regime. In the post-Saddam years he has held important government positions and participated in crucial national decisions and events. In this book, the former Minister of Defense and Finance draws on his unique personal experience, extensive relationships with members of the main political groups and parties in Iraq, and deep understanding of the history and society of his country to answer the baffling questions that persist about its current crises. What really led the United States to invade Iraq, and why have events failed to unfold as planned?The Occupation of Iraq examines what the United States did and didn’t know at the time of the invasion, the reasons for the confused and contradictory policies that were enacted, and the emergence of the Iraqi political class during the difficult transition process. The book tracks the growth of the insurgency and illuminates the complex relationships among Sunnis, Shias, and Kurds. Bringing the discussion forward to the reconfiguration of political forces in 2006, Allawi provides in these pages the clearest view to date of the modern history of Iraq and the invasion that changed its course in unpredicted ways.",
        "Category": " Political Science , Reference",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Lincoln's Other White House: The Untold Story of the Man and His Presidency",
        "Authors": "By Brownstein, Elizabeth Smith",
        "Description": "The Lincolns spent the summer of 1862 north of the White House at the Soldiers’ Home. The lush, cool hill overlooking the squalid capital promised the Lincolns an escape from the \"\"city of stink.\"\" Despite fears about Lincoln’s vulnerability in the secluded place, Lincoln spent a quarter of his presidency at the Soldiers’ Home. But until the National Trust for Historic Preservation began restoring the cottage, little had been done to explore this missing link in Lincoln’s life. Elizabeth Smith Brownstein fills in a critical gap. Using diaries, letters, and eyewitness accounts, she provides unusual perspectives on Lincoln’s relationships, traces the evolution of Lincoln’s image, examines the Lincoln marriage, and more. Lincoln’s Other White House is a vivid evocation of a turbulent era, and an intimate portrait of the still elusive president.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Doing Both: How Cisco Captures Today's Profit and Drives Tomorrow's Growth",
        "Authors": "By Sidhu, Inder",
        "Description": "\"Doing Both shows how Cisco turns business questions into market answers, offering real-life examples that will benefit forward-looking leaders.\" —Jeff Immelt, Chairman and CEO, GE\"The best business books build around a single idea, often contrarian and counterintuitive. Everyone knows you can’t have your cake and eat it, too. One of the first things you learn at business school is that management is about making difficult choices. Well, not always. This book persuades the reader that in decision making ‘and’ is often better than ‘or.’ Well worth the read.\" —Sir Terry Leahy, CEO, Tesco\"Companies are often confronted with false choices, such as disruptive or sustaining innovation and optimization or reinvention. This book draws on Cisco’s impressive track record over the last decade to illustrate that the correct strategy is always to do both.\" —Ratan Tata, Chairman, Tata Group\"I have a very short personal list of ‘most-admired companies,’ and Cisco is one of them. Its management team has figured out how to break many ‘either-or’ tradeoffs that limit most companies’ abilities to innovate and grow. This book is a lucid, cogent chronicle of how they do this. Your entire management team should read it.\" —Clayton Christensen, Robert & Jane Cizik Professor of Business Administration, Harvard Business School, and author of The Innovator’s Dilemma\"Insightful recommendations from a key executive within Cisco, the game-changing leader in networking for the Internet.\" —Garth Saloner, Philip H. Knight Professor, and Dean, Graduate School of Business, Stanford University\"Doing Both brings together many powerful lessons behind the story of Cisco, a company with a long record of delivering consistent innovation and strong business results. I encourage senior executives to embrace the challenges presented in this thoughtful book.\" —Dominic Barton, Global Managing Director, McKinsey & CompanyOver the past seven years, in a highly unstable global economy, Cisco doubled revenue, tripled profits, and quadrupled earnings per share. How? By Doing Both. When companies face key strategic decisions, they often take one path and abandon the other. They focus on innovation and new business at the expense of core businesses or vice versa. They stress discipline and sacrifice flexibility. They focus on customers and ignore partners. And they struggle. Cisco believes there is a better way: Doing Both. Doing Both means approaching every decision as an opportunity to seize, not a sacrifice to endure. It means avoiding false choices, reduced expectations, and weak compromises. It means finding ways to make each option benefit and mutually reinforce the other. In this book, Cisco Senior Vice President Inder Sidhu explains why “doing both” is today’s best strategy. Then, drawing on Cisco’s hardwon insights and the experiences of companies like Procter & Gamble, Whirlpool, and Harley-Davidson, Inder presents a complete blueprint for \"doing both\" in your organization, too.Win by Doing Both!• Sustaining and Disruptive Innovation• Existing and New Business Models• Optimization and Reinvention• Satisfied Customers and Gratified Partners• Established and Emerging Countries• Doing Things Right and Doing What Matters• Superstar Performers and Winning Teams• Authoritative Leadership and Democratic Decision Making",
        "Category": " Business & Economics , Industries , Computers & Information Technology",
        "Publisher": "Ft Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "We Are the Beloved: A Spiritual Journey",
        "Authors": "By Blanchard, Kenneth H.",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "101 Ways To Boost Your Science Skills",
        "Authors": "By Hirschfeld, Robert",
        "Description": "",
        "Category": " Juvenile Nonfiction , School & Education",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Rules of Vengeance",
        "Authors": "By Reich, Christopher",
        "Description": "The New York Times bestselling author delivers a riveting sequel to his smash hit Rules of Deception that catapults him to the distinction of master of the espionage thriller.Months after foiling an attack on a commercial jetliner, Doctors Without Borders physician Jonathan Ransom is working under an assumed name in a remote corner of Africa, while his newly revealed spy wife, Emma, desperate to escape the wrath of Division, the secret American intelligence agency she betrayed, has vanished into the netherworld of international espionage.  Both look forward to sharing a stolen weekend in London—until an ambush on a convoy of limousines turns their romantic rendezvous into a terrorist bloodbath. In the confusion, Emma disappears.Jonathan is first hailed as a hero for his valiant actions during the violence, but when surveillance footage makes it unclear whether he was trying to stop the terrorists, or aid them, he quickly turns from savior to suspect.  Once more on the run, Jonathan realizes that the only way to clear his name is to locate Emma, but finding her may prove that all along he’s been a pawn in a game far beyond his imagining....",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Time For Kids: Clara Barton: Angel of the Battlefield (Time For Kids Biographies)",
        "Authors": "By Time for Kids and Prokos, Anna",
        "Description": "Take a close-up look at Clara Barton, who bravely nursed soldiers during the Civil War. Interviews with experts and lively writing deliver the accurate reporting you expect from Time For Kids®. Historical and contemporary photographs capture the life of this caring woman and show how her legacy—the American Red Cross—assists people today.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Historical",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "NFL Reader: Between the Lines",
        "Authors": "By Bass, Tom",
        "Description": "Get in the game and the center of the action with Scholastic and the NFL!Ever wonder who all those guys on the field are during a football game? What are the positions they play? What are their jobs? Ever wonder what the difference is between a wide reciever, a line backer and a tight end?The answers are in this book along with handy tips to help you decide exactly which position you might want to play.",
        "Category": " Juvenile Nonfiction , Sports & Recreation , Football",
        "Publisher": "Scholastic",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Beyond Macaroni and Cheese",
        "Authors": "By Lagerborg, Mary Beth (EDT) and Parks, Karen J. (EDT)",
        "Description": "When the family has got to eat, and there's little time to prepare a meal, and the kids are picky eaters, and you've already exhausted the week's quota for macaroni and cheese, turn here. You'll find meals tasty and easy enough to coax you beyond the familiar, boxed standbys. These recipes were submitted and tested by moms in MOPS (Mothers of Preschoolers) groups across the country. Moms on the front lines, swapping recipes they know will work for families.",
        "Category": " Religion , Christian Life , Family",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    }
]