[
    {
        "Title": "The Ha-Ha",
        "Authors": "By King, Dave",
        "Description": "Howard Kapostash has not spoken in thirty years. The small repertory of gestures and simple sounds that he uses to communicate lead most people to assume he is disturbed. No one understands that Howard is still the same man he was before his tragic injury. But when he agrees to help an old girlfriend by opening his home to her nine-year-old son, the presence of this nervous, resourceful boy in his life transforms Howard utterly. He is afforded a rare glimpse of life outside his shell ? with all its exuberant joys and crushing sorrows.",
        "Category": " Fiction , Psychological",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2016"
        }
    },
    {
        "Title": "Selected papers of great American physicists : the bicentennial commemorative volume of The American Physical Society 1976",
        "Authors": "By Weart, Spencer R.",
        "Description": "",
        "Category": "",
        "Publisher": "American Institute of Physics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The Reading Group Handbook: Everything You Need to Know to Start Your Own Book Club",
        "Authors": "By Jacobsohn, Rachel W.",
        "Description": "Perhaps you are one of the millions who has tuned in and turned on to the hugely popular Oprah's Book Club. And perhaps by watching it, you've discovered a new, or rekindled an old, passion for reading. Now, with the guidance of Rachel W. Jacobsohn's revised and updated edition of The Reading Group Handbook, you, too, can start your own book club! Book clubs and reading groups give fellow members the chance to break out of established reading patterns and learn adventurous approaches to creative material. With the help of The Reading Group Handbook, you'll get a definitive, step-by-step guide to starting your own book club, written by a professional reading group leader who has organized and led groups--face-to-face and even online--for over twenty years. In this newly revised and expanded edition, you'll get information on:  Where to meet: homes, local bookstores, libraries, and online How to select members and decide a format for the meetings How to read material critically and constructively in preparation for the gathering The art of the discussion Over thirty-five suggested reading lists, including an expanded list of year-by-year Pulitzer Prize winners, Oprah's Book Club picks, and personal recommendations from the author and her groups' members Where to go to get more information on the books you choose and on book clubs throughout the country As reading groups have become the latest trend in socializing, anyone who wants to combine a love of literature with the opportunity to meet others will not want to be without The Reading Group Handbook. With The Reading Group Handbook, readers will enjoy the benefits of a good book and a good book club.",
        "Category": " Literary Criticism , Books & Reading",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "What Dogs Do",
        "Authors": "By Beals, Sharon and Beals, Sharon (PHT)",
        "Description": "What do dogs do? The dogs Sharon Beals has photographed do it all -- defend, love, trust, worry, hunt, laugh, and, above all, charm. With the genuine care and affection of a true dog lover, Beals has captured all the cleverness, devotion, and individuality of 30 endearing hounds of many ages and breeds in photographs both sympathetic and satirical. From the stub-tailed pup investigating a deep hole in the ground to the industrious black mutt escaping under a fence, the images in this irresistible portfolio will change the way dog owners and animal lovers look at their favorite canines.",
        "Category": " Pets , Cats , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "The gold of Tutankhamen",
        "Authors": "By El-Mallakh, Kamal",
        "Description": "",
        "Category": "",
        "Publisher": "Newsweek Books",
        "Price Starting With ($)": "9.92",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Last Days of Patton",
        "Authors": "By Farago, Ladislas",
        "Description": "Uses previously unseen documents and actual medical records to reveal Patton's increasing irrationality after the war as he changed from anti-Nazi fanatic to staunch German champion, before his fatal jeep accident in 1945",
        "Category": " Biography & Autobiography , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Play Poker Like the Pros",
        "Authors": "By Hellmuth, Phil",
        "Description": "In Play Poker Like the Pros, poker master Phil Hellmuth, Jr., demonstrates exactly how to play and win -- even if you have never picked up a deck of cards -- the modern games of poker, including: Texas Hold'em, Omaha, Seven-Card Stud, and Razz.Phil Hellmuth, Jr., a seven-time World Champion of Poker, presents his tournament-tested strategies to beat any type of player, including:The Jackal (crazy and unpredictable)The Elephant (plays too many hands) The Mouse (plays very conservatively)The Lion (skilled and tough to beat)Play Poker Like the Pros begins by laying out the rules and set-up of each game and then moves on to easy-to-follow basic and advanced strategies. Hellmuth teaches exactly which hands to play, when to bluff, when to raise, and when to fold. In addition Hellmuth provides techniques for reading other players and staying cool under pressure. There are also special chapters on how to beat online poker games and an inside look at tournament play.",
        "Category": " Games , Card Games , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Entombed (Alexandra Cooper)",
        "Authors": "By Fairstein, Linda A.",
        "Description": "Workers demolishing a nineteenth-century brownstone where Poe once lived discover a human skeleton standing - entombed - behind a brick wall. When assistant district attorney and sex crimes prosecutor Alexandra Cooper hears about the case, it strikes her as a classic scene from Poe's fiction...except that forensic evidence shows this young woman died within the last twenty-five years.Meanwhile, Alex is furious at the news that an old nemesis may be preying on women once again on Manhattan's exclusive Upper East Side. The Silk Stocking Rapist first struck four years ago, leaving a string of victims in his wake, then abruptly disappeared before Alex and the NYPD could identify him. Now, with improved forensic technology and a national DNA data bank to draw from, a fresh attack may give Alex a new lease on many old crimes, just in time to beat the statute of limitations.But when a woman dies as a result of her injuries, Alex's search for justice for the rapist's prior victims becomes a hunt for a killer as well. As Alex peels back the layers of the murdered woman's past indiscretions, she finds more than one potential enemy and many intriguing connections between the Silk Stocking Rapist, his victims, and the haunting theme of revenge that pervades Poe's stories.The case takes Alex and detectives Mercer Wallace and Mike Chapman from a quiet college campus to the stunning, 250-acre forest that comprises the New York Botanical Gardens. There, an enigmatic librarian presides over the Raven Society, a secretive group devoted to the work of Poe. Could it be that their fascination with a writer famed for depicting bizarre and exquisitely planned murders goes well beyond scholarly interest? In exploring the fabled writer's tormented life for clues, Alex will cross paths with a cunning killer and face some of the greatest challenges of her career.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Son of the Black Stallion",
        "Authors": "By Walter Farley",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1947"
        }
    },
    {
        "Title": "Brush Up Your Classics!",
        "Authors": "By MacRone, Michael and Lulevitch, Tom (ILT)",
        "Description": "Here is a fabulous and fun reference guide to the Latin and Greek origins of such words and expressions as \"windbag\" and \"seize the day,\" as well as a lively tour through the literature and life of ancient times.  With fun black-and-white illustrations, this irreverent and informative book provides history, maps, and even a glossary for a unique way to revisit the ancient classics.",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Harmony: Business, Technology, and the End of Paperwork",
        "Authors": "By Penzias, Arno A.",
        "Description": "Harmony establishes its author - a Nobel Prize winner and director of research at Bell Labs - as one of the great explainers of the digital revolution. In Dr. Arno Penzias's view, the explosive growth of technology in the past decade has transformed our lives nearly beyond recognition and brought us to the brink of a new era.Today, networked computers allow information to flow directly from source to user - bypassing a host of formerly busy human intermediaries in the process. Because much of present-day office work is more easily accomplished by electronics than people, the focus of work has shifted from colleagues to customers - thereby boosting externally focused tasks such as sales and consulting. The new technology supports a growing trend toward nomadic information workers, who are able to carry their office wherever the task of the moment takes them.What tasks lie ahead for our evolving workforce? While today's products and services are markedly better than past offerings, shortcomings abound: These new gizmos are often hard to use, incompatible with each other, and a burden on our natural environment.The solution to these problems lies in the huge task of harmonizing the outputs of our technology. We are entering the era of harmony, a system of marketplace value that will emphasize ease of use, true systems integration, and environmental renewal. This new competitive challenge will occupy the workers who seemed to be the first casualty of the information age.",
        "Category": " Business & Economics , General",
        "Publisher": "Harperbusiness",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Dave Barry is from Mars and Venus",
        "Authors": "By Barry, Dave",
        "Description": "The popular humorist shares a collection of his hilarious syndicated columns that discuss his coverage of the Olympics, swimming with the U.S. synchronized swim team, his appearance on Wheel of Fortune, and other key events. 100,000 first printing. Tour.",
        "Category": " Humor , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Dream Record Book",
        "Authors": "By Barrett, David V.",
        "Description": "",
        "Category": " Self-help , Dreams",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Kathy Prendergast: The End and the Beginning",
        "Authors": "By Prendergast, Kathy, McKee, Francis, and Irish Museum of Modern Art (Kilmainham, Dublin, Ireland) (COR)",
        "Description": "",
        "Category": " Art , Individual Artists , General",
        "Publisher": "Merrell Pub Ltd",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Service Breakthroughs: Changing the Rules of the Game",
        "Authors": "By Hart, Christopher, Heskett, James L., and Sasser, W. Earl",
        "Description": "What Do Citicorp, UPS and Marriott have in common? They are \"breakthrough\" service providers, firms that changed the rules of the game in their respective industries by consistently meeting or exceeding customer needs and expectations. To find out how these companies do it, service management experts James Heskett, Earl Sasser, and Christopher Hart put the question to the chief executive officers of fifteen of America's leading service firms attending a workshop at the Harvard Business School. Breakthrough leaders, they discovered, think very differently about their businesses than do their competitors, in distinct and well-defined ways. Now, in Service Breakthroughs, based upon five years of exhaustive research in fourteen service industries, Heskett, Sasser, and Hart show exactly what enables one or two companies in each industry to constantly set new standards for quality and value that force competitors to adapt or fail. At the heart of breakthrough performance, the authors contend, is a sometimes intuitive but thorough understanding of the \"self-reinforcing service cycle\" that replaces traditional management of \"trade-offs.\" The \"cycle\" is a paradigm derived from the research results suggesting direct links between heightened customer satisfaction, increased customer retention, augmented sales and profit, improved quality and productivity, greater service value per unit of cost, improved satisfaction of service providers, increased employee retention, and further heightened customer satisfaction. With detailed examples and dramatic case studies of Mark Twain Bancshares, American Airlines, Florida Power & Light, Federal Express, McDonald's and many other companies, Heskett, Sasser, and Hart show how this self-reinforcing cycle of behavior differentiates breakthrough leaders from their \"merely good\" competitors. The authors describe how breakthrough managers develop counterintuitive, even contrarian, strategic service visions. These companies define their \"service concept\" in terms of results achieved for customers rather than services performed. They target market segments by focusing on psychographics -- how customers think and behave -- instead of demographics. And instead of viewing a service delivery system as a facility where the service is producted and sold, breakthrough firms see it as an opportunity to enhance the quality of the service.  These profound differences in thought and action have brought spectacular results. For managers who wish to set the pace in their service industries, Service Breakthroughs will be essential reading.",
        "Category": " Business & Economics , Forecasting",
        "Publisher": "Free Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Complete Book of Flowers and Plants for Interior Decoration With a Section on Garden Rooms",
        "Authors": "By Wheeler, Esther And Lasker, Anabel Combs",
        "Description": "",
        "Category": "",
        "Publisher": "Hearthside Press, Inc.",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Too Far Afield",
        "Authors": "By Grass, Gunter and Winston, Krishna (TRN)",
        "Description": "From the Nobel Prize-winning author of My Century and The Tin Drum, a novel of broad historical proportions set in Berlin during the years of German reunification.Two old men roam through Berlin observing life in the former German Democratic Republic after the fall of the Wall in 1989. Theo Wuttke, a former East German functionary, is a keen observer and a gifted speaker. Ludwig Hoftaller is a mid-level spy whose loyalties shift with each new regime. Together, both men see what the future is bringing as they try to save what they can from the past and understand the meaning of being German.A complex and challenging exploration of what Germany's reunification will mean-for Germans, for Europe, and for the world-Too Far Afield is a masterwork from one of Europe's greatest writers. Written with the wit, fantasy, literary erudition, and political acerbity for which Grass is celebrated, it is a deeply human story laced with pain and humor in equal measure.",
        "Category": " Fiction , Literary",
        "Publisher": "HarperVia",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "The Rosary",
        "Authors": "By Wills, Garry",
        "Description": "A simple strand of beads and a crucifix, the rosary has been an aid to prayer, contemplation, and religious worship for centuries. In this superb book, Garry Wills looks at the meaning of the beads and at the mysteries, or events, in the lives of Jesus and Mary that the beads are meant to signify. In an age when self-help methods abound and meditation is increasingly popular, Wills reminds us that the rosary is a ?timely and timeless? method for reconnecting with ourselves and with our faith. As he discusses each mystery, Wills guides us through the lives of Jesus and Mary, reflecting on Scripture passages and their teachings with his signature elegant, lucid prose.  With gorgeous full-color reproductions of paintings by Renaissance master Tintoretto illustrating the mysteries, The Rosary will be the perfect book for those who practice the rosary themselves or for those who are seeking a new and timeless form of contemplation.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Outsmarting Female Fatigue: Eight Energizing Strategies for Longlife Vitality",
        "Authors": "By Waterhouse, Debra",
        "Description": "The author of Outsmarting the Female Fat Cell tackles another feminine issue--fatigue--offering women advice on how to tap their full energy potential by eating right, drinking enough water, staying in shape, getting enough sleep, enjoying nature, reducing chaos, enhancing sensuality, and rediscovering inner joy.  75,000 first printing.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "A Brief History of Mutiny",
        "Authors": "By Woodman, Richard",
        "Description": "Perhaps even more than the waves and weather, sea officers of the past feared the ever-present risk of mutiny. Functioning as a microcosm of dissent in our society at large, the steep hierarchy and deep social divisions between the crew and their commanders, the misery and monotony of very hard work and little sleep, and the constant threat of death from shipwreck, disease, or the enemy often led to an anarchic breakdown of any semblance of stability or order at sea.The notorious mutiny on the Bounty in 1787 has been elevated to iconic status by Hollywood, yet Richard Woodman describes it here as a mere “pup” among mutinies. Despite the usual portrayal, Captain Bligh was neither tyrant nor sadist—whereas Pigot of the Hermione was both, and his crew was probably justified in throwing him overboard. Woodman brings a seaman’s perspective to this compelling history, which stretches from Magellan’s successful handling of an uprising that took place on his great voyage of discovery in 1519, to the “sordid crimes” that mutinies had become by the end of the Second World War.",
        "Category": " History , Oceania",
        "Publisher": "Carroll & Graf",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Origins of World War I 1871-1914 (Berkshire Studies in History)",
        "Authors": "By Remak, Joachim",
        "Description": "",
        "Category": "",
        "Publisher": "HOLT, RINEHART, WINSTON",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "April",
            "Year": "1967"
        }
    },
    {
        "Title": "Views from a French Farmhouse",
        "Authors": "By More, Julian",
        "Description": "",
        "Category": "",
        "Publisher": "Trafalgar Square Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Tradition and innovation in psychoanalytic education",
        "Authors": "By Meisels, Murray, Shapiro, Ester R., and Lewis, Helen Block",
        "Description": "",
        "Category": "",
        "Publisher": "L. Erlbaum Associates",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Aperture 152: Crossing Borders, Contemporary Czech & Slovak Photography",
        "Authors": "By Aperture Foundation. and Roalf, Peggy (EDT)",
        "Description": "Aperture 152Crossing Borders: Contemporary Czech and Slovak PhotographyFall 1998A new generation of Czech and Slovak photographers--heirs to the legacy of such modern masters as Josef Sudek and Frantisek Driktol--will be the subject of the August 1998 issue of Aperture, featuring images never before published in the West. In the Aperture tradition of investigating the contemporary photography of individual nations, Crossing Borders probes the cultural, social, and emotional climate of the post-Communist era as experienced by twenty-three photographers.The writings of such prominent Czech and Slovak writers as the novelist Jan Novak, author of The Willys Dream Kit, and the poet Anna Ondrejková help to illuminate the full dimensions of contemporary creative life in the Czech and Slovak Republics.Photographers:Pavel Banka, Judita Csáderová, Bohdan Holomícek, Viktor Kolar, Josef Koudelka, Antonín Kratochvil, Zdenek Lhoták, Ivan Lutterer, Jan Malý, Pavel Mára, Pavel Pecha, Ivan Pinkava, Jan Pohribný, Jirí Polácek, Rudo Prekop, Vasil Stanko, Tono Stano, Kamil Varga, Peter Župník",
        "Category": " Photography , General",
        "Publisher": "Aperture",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "SIMONE DE BEAUVOIR PB/ EVANS (Social Science Paperbacks ; 294)",
        "Authors": "By Evans, Mary",
        "Description": "Examines the French feminist's memoirs and philosophical writings, discusses her essential beliefs, and assesses her influence on the Women's movement",
        "Category": "",
        "Publisher": ". OTHER",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1985"
        }
    },
    {
        "Title": "Spanning the World: The Crazy Universe of Big-Time Sports, All-Star Egos, and Hall of Fame Bloopers",
        "Authors": "By Berman, Len",
        "Description": "Go Spanning the World with Len Berman in this wildly entertaining, insightful, and often hilarious book that takes sports fans behind the scenes and inside locker rooms.One of the most popular television sports personalities—known for his \"Spanning the World\" segments on NBC's Today show—Len Berman delivers his unique view of the world of sports, from the bizarre to the historic, all with his characteristic wit.Over the years sports and sports reporting have changed, but Spanning the World puts it all in perspective in this irreverent take on the heroes and iconic moments.Barry Bonds massages the media: \"If you put that camera in my face, I'll slit your throat.\"Mickey Mantle reveals his most pleasurable Yankee Stadium experience (it didn't happen on the field). Bobby Orr loses his cool and chairs start flying from the upper decks.Bill Parcells finally spills his Super Bowl–winning formula: \"Power wins!\"And much more ... Berman guides us through the world he knows like no one else, from intimate recollections of his heroes to postgame celebrations, exhibiting the most hilarious and shocking moments from the whole cast of characters from the last decades in sports: John McEnroe, Muhammad Ali, Larry Bird, Derek Jeter, and many more. He also  addresses the more serious issues facing sports today, including steroids, overpaid stars, athletes and violence, and the place of sports in society.A must read for every sports fan, Spanning the World is an irresistible blend of humor, history, and contemporary commentary on the state of sports from the ultimate fan who has seen it all.",
        "Category": " Sports & Recreation , Essays",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Sweet Smell of Christmas (Scented Storybook)",
        "Authors": "By Scarry, Patricia M.",
        "Description": "It's time to celebrate the sights and smells of Christmas in this classic scratch-and sniff book!Join Little Bear as he prepares for the holidays, all the while giving readers a chance to smell six wonderful scents including apple pie, christmas tree, hot chocolate, and more! This delectable treat is a perfect way for families to spend the yuletide season.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Whistles Round the Bend: Travel on America's Waterways",
        "Authors": "By Ault, Phillip H.",
        "Description": "Examines past modes of transportation on America's waterways, from the canoes of the American Indians to the passenger steamers of the Great Lakes",
        "Category": " Young Adult Nonfiction , General",
        "Publisher": "Dodd Mead",
        "Price Starting With ($)": "5.61",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "Webster's New Spanish-English Dictionary",
        "Authors": "By Editor",
        "Description": "",
        "Category": "",
        "Publisher": "Merriam-Webster",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Green Paradise: Autobiography (Autobiography, Vol 1)",
        "Authors": "By Green Julien",
        "Description": "The author, born to American parents living in Paris, recounts his life and the influences on his writing",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Marion Boyars Publishers Ltd",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Lost in the Forest",
        "Authors": "By Miller, Sue",
        "Description": "For nearly two decades, since the publication of her iconic first novel, The Good Mother, Sue Miller has distinguished herself as one of our most elegant and widely celebrated chroniclers of family life, with a singular gift for laying bare the interior lives of her characters. In each of her novels, Miller has written with exquisite precision about the experience of grace in daily life–the sudden, epiphanic recognition of the extraordinary amid the ordinary–as well as the sharp and unexpected motions of the human heart away from it, toward an unruly netherworld of upheaval and desire. But never before have Miller’s powers been keener or more transfixing than they are in Lost in the Forest, a novel set in the vineyards of Northern California that tells the story of a young girl who, in the wake of a tragic accident, seeks solace in a damaging love affair with a much older man.Eva, a divorced and happily remarried mother of three, runs a small bookstore in a town north of San Francisco. When her second husband, John, is killed in a car accident, her family’s fragile peace is once again overtaken by loss. Emily, the eldest, must grapple with newfound independence and responsibility. Theo, the youngest, can only begin to fathom his father’s death. But for Daisy, the middle child, John’s absence opens up a world of bewilderment, exposing her at the onset of adolescence to the chaos and instability that hover just beyond the safety of parental love. In her sorrow, Daisy embarks on a harrowing sexual odyssey, a journey that will cast her even farther out onto the harsh promontory of adulthood and lost hope.With astonishing sensuality and immediacy, Lost in the Forest moves through the most intimate realms of domestic life, from grief and sex to adolescence and marriage. It is a stunning, kaleidoscopic evocation of a family in crisis, written with delicacy and masterful care. For her lifelong fans and those just discovering Sue Miller for the first time, here is a rich and gorgeously layered tale of a family breaking apart and coming back together again: Sue Miller at her inimitable best.",
        "Category": " Fiction , Psychological",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "The Leadership Challenge: How to Keep Getting Extraordinary Things Done in Organizations",
        "Authors": "By Kouzes, James M. and Posner, Barry Z.",
        "Description": "Completely revised and updatedI not only enjoyed it...I found myself constantly nodding and saying to myself, 'That's right! That's how it's done! That's what it feels like!' You certainly captured the essence of what I've found is at the heart of transforming leadership.-- Robert D. Haas, chairman and CEO, Levi Strauss & Co.The leadership book that outshines them all, updated for today's new business realities. With an expanded research base of 60,000 leaders, this second edition captures the continuing interest in leadership as a critical aspect of human organizations. It offers a broader scope of leaders in every industry and walk of life, including the education and nonprofit fields, and examines the era's hottest issues -- the new cynicism, the electronic global village, evolving employee-employer relationships -- in keeping pace with our ever-changing world. The classic five-point guide to better leadership, however, remains as useful as ever.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Friendly Fish (Button Books)",
        "Authors": "By McLean, Wendy, Texidor, Dee (ILT), and Jexidor, Dee (ILT)",
        "Description": "The friendly fish have fun gliding with the stingrays, hiding with the seahorses, and feeding with the lobster.",
        "Category": " Juvenile Fiction , Concepts , Counting & Numbers",
        "Publisher": "Book Company Intl",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Sport in Art from American Museums: The Director's Choice : Inaugural Exhibition of the National Art Museum of Sport",
        "Authors": "By Rhodes, Reilly (EDT)",
        "Description": "The companion volume to a touring exhibition. Some 65 paintings, sculptures, and watercolors, reproduced in color, depict scenes of sport, sportsmen, and champion animals as represented by such artists as Winslow Homer, Thomas Eakins, Red Grooms, Andy Warhol, and Andrew Wyeth. Each reproduction is accompanied by commentary from the director of the participating museum. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Art , General",
        "Publisher": "Palgrave Macmillan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "What to Have for Dinner: 32 Easy Menus for Every Night of the Week",
        "Authors": "By Stewart, Martha and Martha Stewart Living (EDT)",
        "Description": "All the recipes from \"What to Have for Dinner, \" one of the most popular features of Martha Stewart Living Magazine, are collected here in one beautifully illustrated volume. Organized by season, the book gathers 30 simply laid-out menus for four, complete with a preparation schedule. Includes a resource guide for flatware, napkins, plates, and related items. 200 color photos.",
        "Category": " Cooking , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.33",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "One Day Nature Trips in and Around Washington, D.C. Beauty & Bounty",
        "Authors": "By Ockershausen, Jane",
        "Description": "",
        "Category": "",
        "Publisher": "Epm Pubns Inc",
        "Price Starting With ($)": "7.58",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Converting to Judaism: Choosing to Be Chosen : Personal Stories",
        "Authors": "By Weiss, Bernice K. (EDT) and Silverman, Sherie Lerner",
        "Description": "Over the years, Rabbi Bernice Kimel Weiss has shepherded hundreds of non-Jewish students into the family of the Jewish people. For most, the interest in Judaism is sparked by a decision to marry a Jewish man or woman. But that is only the beginning. In the gentle hands of a teacher who has witnessed and understands their turmoil, their conflicts, their tears, they bare their personal struggles. What emerge are amazing,  powerful, soul-stirring stories of re-creation - the extraordinary adventure of becoming a Jew at the turn of the 21st century. An Asian-American whose father owns a Japanese restaurant marries a secular Jew but leads him to Orthodox Judaism; a Belgian raised by nuns meets a Jew and finds her faith in Israel; a former Sunday school teacher from a small farm town falls in love with a Jewish girl and with her faith as well; an African-American woman lawyer, a Harvard graduate, discovers Judaism and keeps kosher in a small southern town: their varied stories and eight more are revealed in these pages. The twists and turns and the direction their lives ultimately take are a source of inspiration to those contemplating Judaism, and to all in search of faith. They are a gift to the Jewish people.",
        "Category": " Religion , Judaism , Rituals & Practice",
        "Publisher": "Simcha Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Our Government and the Arts: A Perspective from the Inside",
        "Authors": "By Biddle, Livingstone L.",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Americans for the Arts",
        "Price Starting With ($)": "5.23",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Kim (Classic, 20th-Century, Penguin)",
        "Authors": "By Kipling, Rudyard and Said, Edward W. (EDT)",
        "Description": "Kim, an Irish orphan, accompanies a holy man on his journey throughout India and his quest for a mystical river",
        "Category": " Juvenile Fiction , People & Places , Middle East",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Just a bite",
        "Authors": "By Tyrer, Polly",
        "Description": "Shares recipes for appetizers featuring fish, meat, vegetables, eggs, pastries, and fruit, and includes suggestions for dips or fondues",
        "Category": "",
        "Publisher": "Prentice Hall Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "If Football's a Religion, Why Don't We Have a Prayer?: Philadelphia, Its Faithful, and the Eternal Quest for Sports Salvation",
        "Authors": "By Longman, Jere",
        "Description": "The last time a Philadelphia professional sports team won a championship, Ronald Reagan was in the White House and Return of the Jediwas number one at the box office. No city with all four major sports -- football, basketball, baseball and hockey -- has gone longer without a championship. The local NFL franchise, the Eagles, has not won a titlesince 1960, putting its devoted fans through decades of futility and heartbreak.But finally, in 2004, following three consecutive wrenching losses in the NFC championship game, the beleaguered Eagles finally had a shot. After superstar wide receiver Terrell Owens injured his ankle, the fans reacted with a peculiar blend of hope and dread, but stuck by the team. And when Owens returned for the Super Bowl, the city sat poised, at long last, on the verge of sporting salvation.In the tradition of Fever Pitch and Rammer Jammer Yellow Hammer, and peppered with riotous anecdotes about the superfans, grandstand brawlers and football lunatics who make Philadelphia one of the most entertaining places in America to watch a game, If Football's a Religion, Why Don't We Have a Prayer? is the hilarious day-by-day account of the operatic passion of Eagle fans, as it threatens to spin out of control in the dizzying buildup to the team's first appearance in the Super Bowl since 1981. From the city's annual Wing Bowl, a near-mythological gastronomic fete in which contestants attempt to devour their weight in chicken wings, to oversize and outlandish Eagle lawn decorations, to hygiene-defying contests for playoff tickets, Eagle enthusiasm is raised to a bizarre new level. Even Pennsylvania's governor, Ed Rendell, a season-ticket holder, gets in on the act, splitting his duties between the state house and a local sports cable channel, where he spends two hours analyzing each Eagles game.With unprecedented detail and firsthand reporting, New York Times sportswriter and longtime resident of Philadelphia Jere Longman reveals what happens when the losingest sports town in America finally has a shot at winning it all.",
        "Category": " Sports & Recreation , Football",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Como Lidiar con los Ex: Hombres, Mujeres... y Fantasmas del Pasado (Spanish Edition)",
        "Authors": "By Collins, Maria Antonieta",
        "Description": "Porque no hay quinto malo...En el verano del 2004, María Antonieta Collins se pre-paraba para escribir su quinto libro, cuando de repente se vio propulsada al mismísimo centro de una telenovela mexicana. Después de casi una década de estar felizmente casada con su esposo, Fabio, su armoniosa existencia familiar se tornó en un huracán cuando la ex esposa de su marido reapareció intempestivamente en sus vidas. La mujer, una rusa que Fabio no había visto en más de trece años, llegó un día a Miami con las intenciones de recobrar a su ex marido y sacudir los cimientos de la vida que María Antonieta y Fabio tanto habían luchado por conseguir.Enfrentada a esta difícil situación, María Antonieta tenía dos opciones: podía tomar el camino fácil y separarse de Fabio, o podía tomar el más difícil y aprender a no dejarse vencer por una situación que nada tenía que ver con ella. Entonces, con el valor y la perseverancia que la caracterizan, María Antonieta decidió ponerle buena cara al mal tiempo, y luchar de una vez por todas por el hombre que ama.En este, su quinto libro, María Antonieta cuenta la historia de este doloroso momento de su vida y se adentra en el imprevisible mundo de los ex esposos, ex esposas, ex novios y ex novias. Hoy en día, todo el mundo tiene un \"ex\" y para sobrevivir a lo que puede llegar a ser una experiencia desgarradora y aniquilante, hay que saber mantenerse firme, y confiar tanto en sí mismo como en la persona que se ama. A través de la pesadilla que tuvo que vivir con la ex esposa de su marido, y los muchos otros \"ex\" de su vida, María Antonieta ayuda una vez más a sus lectores, ofreciéndoles su humor y sus consejos más acertados para aprender a tomar la decisión adecuada en el momento adecuado.",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "Rayo",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "The Great Smelling Bee (Rotten School #2)",
        "Authors": "By Stine, R. L. and Park, Trip (ILT)",
        "Description": "Sherman Oaks Is A Rat.  Sherman is so spoiled and rich that he threw away his allowance because some of the hundred-dollar bills were wrinkled! He and his goody-goody friends and Nyce House are always trying to get Bernie Bridges and his Rotten House buddies into trouble. Well Bernie's in big trouble now. Bernie has a dog in his room, Sherman know it -- and there are NO PETS ALLOWED at Rotten School! Bernie has to find a way to hide Gassy, his dog. But the dog stinks. Hey, why do you think they call him Gassy?",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "A Field Guide to Pennsylvania State History",
        "Authors": "By Sheldon, George G.",
        "Description": "",
        "Category": "",
        "Publisher": "London PRC",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Raising Their Voices: The Politics of Girls' Anger",
        "Authors": "By Brown, Lyn Mikel",
        "Description": "Two fourteen-year-old girls, fed up with the \"Hooters\" shirts worn by their male classmates, design their own rooster logo: \"Cocks: Nothing to crow about.\" Seventeen-year-old April Schuldt, unmarried, pregnant, and cheated out of her election as homecoming queen by squeamish school administrators, disrupts a pep rally with a protest that engages the whole school.Where are spirited girls like these in the popular accounts of teenage girlhood, that supposed wasteland of depression, low self-esteem, and passive victimhood? This book, filled with the voices of teenage girls, corrects the misperceptions that have crept into our picture of female adolescence. Based on the author's yearlong conversation with white junior-high and middle-school girls--from the working poor and the middle class--Raising Their Voices allows us to hear how girls adopt some expectations about gender but strenuously resist others, how they use traditionally feminine means to maintain their independence, and how they recognize and resist pressures to ignore their own needs and wishes.With a psychologist's sensitivity and an anthropologist's attention to cultural variations, Lyn Brown makes provocative observations about individual differences in the girls' experiences and attitudes, and shows how their voices are shaped and constrained by class--with working-class girls more willing to be openly angry than their middle-class peers, and yet more likely to denigrate themselves and attribute their failures to personal weakness.A compelling and timely corrective to conventional wisdom, this book attunes our hearing to the true voices of teenage girls: determined, confused, amusing, touching, feisty, and clear.",
        "Category": " Psychology , Psychotherapy , Child & Adolescent",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Hard Love",
        "Authors": "By Wittlinger, Ellen",
        "Description": "Since his parents' divorce, John's mother hasn't touched him, her new fiancé wants them to move away, and his father would rather be anywhere than at Friday night dinner with his son. It's no wonder John writes articles like \"Interview with the Stepfather\" and \"Memoirs from Hell.\" The only release he finds is in homemade zines like the amazing Escape Velocity by Marisol, a self-proclaimed \"Puerto Rican Cuban Yankee Lesbian.\" Haning around the Boston Tower Records for the new issue of Escape Velocity, John meets Marisol and a hard love is born.  While at first their friendship is based on zines, dysfuntional families, and dreams of escape, soon both John and Marisol begin to shed their protective shells. Unfortunately, John mistakes this growing intimacy for love, and a disastrous date to his junior prom leaves that friendship in ruins. Desperately hoping to fix things, John convinces Marisol to come with him to a zine conference on Cape Cod. On the sandy beaches by the Bluefish Wharf Inn, John realizes just how hard love can be.  With keen insight into teenage life, Ellen Wittlinger delivers a story of adolescence that is fierce and funny -- and ultimately transforming -- even as it explores the pain of growing up.",
        "Category": " Young Adult Fiction , Romance , General",
        "Publisher": "S&S Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Complete Home Storage (Sunset)",
        "Authors": "By Sunset Books (COR), Braasch, Barbara, and Kessler, Lisa Stockwell",
        "Description": "Complemented by 350 photographs, this handy guide to hundreds of storage solutions for every room in the house offers a create array of ideas and projects designed to control clutter and enhance the design of one's home, with step-by-step instructions and information on tools, materials, techniques, and other resources. Original.",
        "Category": " House & Home , Design & Construction",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Half Magic",
        "Authors": "By Eager, Edward and Bodecker, N. M. (ILT)",
        "Description": "Four children spending their summer in a city apartment enjoy a series of fantastic adventues by double-wishing on an ancient coin.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Harcourt Childrens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "The Bostonians",
        "Authors": "By James, Henry",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Vintage Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Over a Barrel: Breaking the Mideast Oil Cartel",
        "Authors": "By Learsy, Raymond J.",
        "Description": "Longtime commodities trader Raymond J. Learsy lifts the veil of the Mideast oil cartel, showing how OPEC manipulates the oil markets and destabilizes the world's economy. With refreshing candor and an insider's perspective, Learsy explains how OPEC:twists bogus perceptions of oil scarcity to hike prices and gain political poweris compromised by Islamist terrorist connections that fuel anti-American hatred with dollars from our own walletskeeps Third-World nations in abject poverty despite their rich oil depositsand became the de facto master of Iraq's newly liberated oil fieldsA sharp, sweeping survey of OPEC's methods of economic dominance, this book explains how to bust the Mideast oil cartel and chart our own course toward energy independence.",
        "Category": " Political Science , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "The Middle Ages",
        "Authors": "By Gillon",
        "Description": "The pictures in this coloring book are real illustrations from the Middle Ages, dating from 1475 to 1500. Included are a knight swallowed by a monster, scenes from the bible, battles and combats, Jerusalem, agricultural activities, animals, much more. Over 50 illustrations.",
        "Category": " Juvenile Nonfiction , Activity Books",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1971"
        }
    },
    {
        "Title": "Beyond the Wardrobe: The Official Guide to Narnia",
        "Authors": "By Kirk, Elizabeth J.",
        "Description": "Includes movie images from The Chronicles of Narnia: The Lion, the Witch and the Wardrobe by Walt Disney Pictures and Walden Media!Beyond the Wardrobe is the first official full-color guide to C. S. Lewis's best-selling fantasy classics that comprise The Chronicles of Narnia. This extravagant companion is perfect for established fans and newcomers to the books as well as for those who have seen the movie The Chronicles of Narnia: The Lion, the Witch and the Wardrobe.Take an exciting tour through the series that has been heralded as the standard by which all fantasy realms must be measured.Everything there is to know is here:Find out about C. S. Lewis and the mythical and historical origins of Narnia.Watch the great tale unfold book by book as you journey to the Lone Islands, cross the Lantern Waste and stand atop Aslan's How.Discover the powers and magic behind the characters.Witness battles of epic proportions between good and evil.Lavishly illustrated with original artwork and archival photos as well as images from the spectacular movie, this indispensable volume takes readers beyond the wardrobe and into one of the great classic series of all time.",
        "Category": " Performing Arts , Film , Guides & Reviews",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Photo Keepsakes",
        "Authors": "By Oxmoor House",
        "Description": "",
        "Category": " Crafts & Hobbies , Framing",
        "Publisher": "Leisure Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Women at the Crossroads: A Path Beyond Feminism and Traditionalism",
        "Authors": "By Malcolm, Kari Torjesen",
        "Description": "",
        "Category": " Religion , Ethics",
        "Publisher": "Intervarsity Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1982"
        }
    },
    {
        "Title": "Quest for the Presidency 1992",
        "Authors": "By Miller, Mark, Defrank, Thomas M., Goldman, Peter Louis (EDT), and Murr, Andrew (CON)",
        "Description": "Quest for the Presidency 1992 reveals for the first time the full story of what really happened in the tumultuous 1992 presidential election.  With unparalleled access to the inner workings of the various campaigns, Newsweek's award-winning team of reporters gathered the in-depth stories of the candidates; their handlers, pollsters, and supporters; and their strategies, strengths, and weaknesses. Woven together here in spellbinding and insightful narrative, these accounts reveal the changing order of American politics, which saw the strongest third-force challenge in eighty years, and the changing portrait of the American voter, more cynical yet more involved in shaping the political process than ever before.  The rich reporting and you-are-there intimacy of private meetings, confidential conversations, informal war-gaming sessions, and other key moments in the campaigns provide new insight into the players and events of this critical election year.  A broad array of never-before-published campaign documents and sixty-one of Newsweek's best on-the-scene photographs flesh out the record. The result offers an essential guide to understanding not only the Clinton candidacy but also the Clinton presidency; keen human understanding of George Bush's fall; and a hint of how a Texas billionaire's down-home style may have changed the political terrain forever.",
        "Category": " Political Science , Political Process , General",
        "Publisher": "Texas A&M University Press",
        "Price Starting With ($)": "7.35",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "The Merriam-Webster Thesaurus",
        "Authors": "By Merriam-Webster",
        "Description": "\"A treasury of word choices.  Over 157,000 synonyms, antonyms, related and contrasted words, and idioms. More than 5,000 examples of word usage. Brief definitions of shared meanings.\"",
        "Category": " Reference , Thesauri",
        "Publisher": "Merriam-Webster",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "The Bad Behavior of Belle Cantrell: A Novel",
        "Authors": "By Despres, Loraine",
        "Description": "Belle Cantrell felt guilty about killing her husband and she hated that. Feeling guilty, that is. A lady shouldn't do something she's going to feel guilty about later, was a rule Belle kept firmly in mind.So begins The Bad Behavior of Belle Cantrell, a story of murder, adultery, and regular church attendance, which introduces Belle Cantrell as a beautiful young widow with a rebellious streak, years before she will become grandmother to Sissy LeBlanc, the feisty main character of Loraine Despres's bestselling The Scandalous Summer of Sissy LeBlanc.The year is 1920, prohibition is in full swing, women are clamoring for the vote, and a narrow-minded intolerance is on the rise. Life isn't easy for an unmarried woman, not in a little town like Gentry, Louisiana, especially after she's sent to jail for swimming in an indecent bathing costume with a group of suffragists.It's not as if Belle doesn't know how to behave. She knows the rules. She keeps the Primer of Propriety firmly in mind. But sometimes -- most of the time -- she has to twist the rules a little, or break them, or give them a permanent kink, because they all say the same thing: \"Don't.\"And a girl has got to live.After a year and a half of mourning, Belle decides to get on with her life and kicks off a season of tumult that will change her and Gentry forever.Sexy, sassy, with laugh-out-loud humor and a cast of zany characters you won't forget, The Bad Behavior of Belle Cantrell is a big comic love story and a page-turner. But it delves deeper, as Belle struggles to find her moral center and stand up to forces that are determined to destroy the soul of a town and the people she loves.",
        "Category": " Fiction , Historical , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The State of Working America, 1998-99",
        "Authors": "By Mishel, Lawrence, Bernstein, Jared, and Schmitt, John",
        "Description": "Examines the distribution of income and wealth in the U.S.",
        "Category": " Business & Economics , Economics , General",
        "Publisher": "Cornell University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Committed to Memory: 100 Best Poems to Memorize",
        "Authors": "By Hollander, John (EDT), Boland, Eavan (EDT), and Academy of American Poets (COR)",
        "Description": "Poet John Hollander has divided the poems into tales, sonnets, songs, meditations and counsels. Published in partnership with The Academy of American Poets.",
        "Category": " Poetry , General",
        "Publisher": "Turtle Point Press / Books & Co",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "The Complete Book of Birdhouse Construction for Woodworkers (Dover Woodworking)",
        "Authors": "By Campbell, Scott D.",
        "Description": "Here is a complete, down-to-the-last-detail guide for building attractive, sturdy, and genuinely inhabitable wooden birdhouses that will add a touch of natural beauty to garden, backyard, or anywhere else they are placed. Step-by-step instructions, clear diagrams, and many helpful illustrations and tables are included. All designs can be adapted to the use of simple hand tools ― saw, hammer, screwdriver ― making these projects ideal for woodworkers of all ages and levels of experience. Includes clear, easy-to-follow coverage for these topics: the selection of woods, helpful construction tips and techniques, hanging and supporting birdhouses, inspection and cleaning, proper placement, construction of pest guards, and much more.More than just a collection of projects, this complete guide shows not only how to construct birdhouses, but also how to insure that birds will actually be able to nest in them. It even shows how to attract specific species: bluebirds, doves, finches, swallows, and many others. Included is much valuable and practical information not found in the usual craft book: nesting requirements for each species, proper size of entrance holes, data on the habitats and behavior of particular types of birds, and more.The rewards and satisfaction of building your own well-designed, durable birdhouse make this book a welcome addition to the library of the experienced craftsman as well as beginning and intermediate woodworkers.",
        "Category": " Crafts & Hobbies , Woodwork",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "Sales Wizard's Secrets of Sales Management",
        "Authors": "By Brian L. Jeffrey",
        "Description": "",
        "Category": "",
        "Publisher": "Salesforce Training & Consulting",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "A Curtain of Green: and Other Stories",
        "Authors": "By Welty, Eudora",
        "Description": "This is the first collection of Welty’s stories, originally published in 1941. It includes such classics as “A Worn Path,” “Petrified Man,” “Why I Live at the P.O.,” and “Death of a Traveling Salesman.” The historic Introduction by Katherine Anne Porter brought Welty to the attention of the american reading public.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1979"
        }
    },
    {
        "Title": "Unity in Diversity: Italian Communism and the Communist World",
        "Authors": "By Blackmer, Donald L. M.",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "The MIT Press",
        "Price Starting With ($)": "29.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Hope: Looking at the End of Time, Studies from Revelation (201 Deeper Bible Study)",
        "Authors": "By Serendipity House",
        "Description": "",
        "Category": "",
        "Publisher": "Serendipity",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Corning Glass Center",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Corning Glass Works",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1958"
        }
    },
    {
        "Title": "Get Your Golf In Shape",
        "Authors": "By Thomas, Heather",
        "Description": "",
        "Category": "",
        "Publisher": "Springfield Pub. Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Snobbery: The American Version",
        "Authors": "By Epstein, Joseph",
        "Description": "Joseph Epstein's highly entertaining new book takes up the subject of snobbery in America after the fall of the prominence of the old Wasp culture of prep schools, Ivy League colleges, cotillions, debutante balls, the Social Register, and the rest of it. With ample humor and insight, Epstein uncovers the new outlets upon which the old snobbery has fastened: food and wine, fashion, high-achieving children, schools, politics, health, being with-it, name-dropping, and much else, including the roles of Jews and homosexuals in the development of snobbery. He also raises the question of whether snobbery might, alas, be a part of human nature. Snobbery: The American Versionis the first book in English devoted exclusively to the subject since Thackeray's THE BOOK OF SNOBS.",
        "Category": " Social Science , Customs & Traditions",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Making Your Own Gourmet Coffee Drinks: Espressos, Cappuccinos, Lattes, Mochas, and More!",
        "Authors": "By Tekulsky, Mathew",
        "Description": "Mathew Tekulsky chronicles the history of coffee drinking, surveys the types of beans and blends available, reviews coffee-making accessories and their uses, and dispenses tips for brewing a perfect cup of smooth, flavorful coffee. An appendix lists sources for gourmet coffee beans and flavorings and coffee-making equipment. 10 line drawings.",
        "Category": " Cooking , Methods , Gourmet",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Ageless Beauty: A Woman's Guide to Lifelong Beauty and Well-Being",
        "Authors": "By Haddon, Dayle",
        "Description": "The spokeswoman-model for L'Ore+a7al's Ple+a7nitude skin-care products presents a comprehensive, lavishly illustrated guide for women ages forty and over to looking and feeling beautiful, including advice on cosmetics, fitness, and relaxation. 75,000 first printing. Tour.",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Family Markowitz",
        "Authors": "By Goodman, Allegra",
        "Description": "Allegra Goodman has been described as an \"altogether original talent\" (Los Angeles Times) whose writing is \"hilarious\" (New York Newsday). In The Family Markowitz, Goodman writes with charm and compassion about three generations of Markowitzes making their way in America. Among them are Rose, the cantankerous matriarch; Henry, her formerly gay but now married son who runs a Laura Ashley shop in London; her younger son Ed, a terrorism expert at Georgetown; and Ed's daughter Miriam, the medical student who, to her parents' consternation, becomes a born-again Jew. Through extraordinary crises and ordinary rituals, they assert their love and independence, and never fail to speak their minds.",
        "Category": " Fiction , General",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "In Private - In Public: The Prince and Princess of Wales",
        "Authors": "By Burnett, Alastair",
        "Description": "Shows highlights from the Royal couple's official trips to Australia, the U.S., Austria, Canada, and Japan, and provides a behind-the-scenes look at their family life and their personal staff",
        "Category": "",
        "Publisher": "Michael O'Mara Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "The World of Wines",
        "Authors": "By Churchill, Creighton",
        "Description": "",
        "Category": "",
        "Publisher": "Collier Books",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "The Only Diet There Is",
        "Authors": "By Ray, Sondra",
        "Description": "Here is a book to change your life. It is a method for losing weight through positive thinking and the changing of attitudes toward life and food.\"This, of course, is no ordinary 'diet' book...This is an extraordinary approach to weight loss--a diet of forgiveness, a fast from negative thought--and if followed one can achieve bodily perfection. The theory is simple. Though we might think it is our negative eating habits that have kept us unattractive and unhealthy, it is really our negative thoughts and feelings. It is the latter we must change for that is what is aging and killing us. If we do...we drop our fat as well, for the same mechanism that holds on to negative thoughts and feelings holds on to fat.\" --from the Preface",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Celestial Arts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "The Way Men Act: A Novel",
        "Authors": "By Lipman, Elinor",
        "Description": "Melinda LeBlanc, at 30, makes an untriumphant return to Harrow, Massachusetts, her recently gentrified hometown. She’s unmarried, romanced out, designing wedding bouquets for old classmates who hadn't known a fraction of her early popularity. So why is she alone—not counting the occasional horizontal encounter—while these dull brides have found men and happiness? Libby Getchel, who designs strange dresses in the shop next door, and Dennis Vaughan, a native son who owns the hip Brookhoppers, a fly fisherman's paradise, provide friendship in mutating forms. The Way Men Act explores age-old quandary: Can you every truly go home again? Find out in this “wise and charming novel” (Cosmopolitan).",
        "Category": " Fiction , General",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Like Normal People",
        "Authors": "By Bender, Karen E.",
        "Description": "A Los Angeles Times bestseller and one of the Washington Post's best books of the year, LIKE NORMAL PEOPLE charts the lives of \"three richly textured characters whose irreducible idiosyncrasies, griefs, longings, and loves will surely expand our sense of what it means to be like normal people\" (Chicago Tribune). The story of this family revolves around an off-kilter center: Lena, who is forty-eight years old but mentally locked in childhood. Following Lena's escape from her residential home with her troubled twelve-year-old niece and her widowed mother's search for them, Karen Bender moves deftly between past and present, through three entire lifetimes in a single day, as each character searches for love and acceptance in a world where normalcy is elusive.       \"Poignantly and brilliantly portrayed\" (TimeOut New York), LIKE NORMAL PEOPLE is a hilarious, heartbreaking, unforgettable family drama that resonates long after the last page is turned.",
        "Category": " Fiction , Sagas",
        "Publisher": "Ecco",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "ADX",
        "Authors": "By Carbonneau, Guy",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Dorrance Pub Co",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "China on stage: An American actress in the People's Republic",
        "Authors": "By Snow, Lois Wheeler",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "The Agenda for America",
        "Authors": "By Barbour, Haley",
        "Description": "Describes the fundamental philosophy of the Republican party, outlining the challenges faced by the United States, and detailing the party's economic, social, and political goals",
        "Category": " Political Science , General",
        "Publisher": "Gateway Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Yeast Connection and the Woman",
        "Authors": "By Crook, William G.",
        "Description": "Citing the wide range of symptoms that may be related to yeast imbalances, including fatigue, headache, depression, digestive, and skin disorders, a guide for women offers advice on yeast management. Original. 40,000 first printing. IP.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Professional Books",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Isle of Woman (Geodyssey)",
        "Authors": "By Anthony, Piers",
        "Description": "The history of the humankind is recreated through the experiences of members of one family as they are reincarnated throughout the planet's evolutionary history, from the dawn of time to an era in which humankind inhabits multiple worlds. 50,000 first printing.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Triumph Over Fear: A Book of Help and Hope for People with Anxiety, Panic Attacks and Phobias",
        "Authors": "By Carter, Rosalynn and Ross, Jerilyn",
        "Description": "The National Institute of Mental  Health calls anxiety disorders the most common mental  health problem in America. They are also among the  most treatable. Yet tens of millions of people  struggle with hidden fears and restricted lives  because they have not received proper diagnosis and  treatment. Triumph Over Fear  combines Jerilyn Ross's firsthand account of  overcoming her own disabling phobia with inspiring case  histories of recovery from other forms of anxiety,  including panic disorder, obsessive-compulsive  disorder, and post-traumatic stress disorder; an  post-traumatic stress disorder. State-of-the-art  information is combined with powerful self-help  techniques, together with clear indications of when to seek  additional professional help and/or medication.  Also included is the latest research on anxiety  disorders in children, plus advice for dealing with  family members and  employers.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "To the ends of the earth: The Transglobe Expedition, the first pole-to-pole circumnavigation of the globe",
        "Authors": "By Fiennes, Ranulph, Sir",
        "Description": "",
        "Category": "",
        "Publisher": "Arbor House",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Conceptual Blockbusting: A Guide to Better Ideas",
        "Authors": "By Adams, James L.",
        "Description": "",
        "Category": "",
        "Publisher": "Norton*(ww Norton Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Lord of the Isles (Lord of Isles)",
        "Authors": "By Drake, David and Hartwell, David G.",
        "Description": "In the Lord of the Isles, Drake returns to fantasy with an adventure set in an extraordinary world where the elemental forces that empower magic are rising to a thousand-year peak. Into this world, survivors from the last magical peak intrude: Tenoctris, a quiet and scholarly sorceress swept out of the past at the moment of final catastrophe as her civilization sank beneath the sea; the ghost of the greatest ruler, King Carus of the Isles; and the great magician known only as The Hooded One, who actually caused that ancient catastrophe.In the days following an unusually severe storm in a tiny seaport town, life is disrupted. First, young Garric rescues the castaway Tenoctris; then, amazingly, a huge galley lands, bearing a court envoy searching for the lost heir to a dukedom - and finding her in Sharina, Garric's sister. Immediately after the galley departs with Sharina to seek out her destiny, another party arrives by coach, led by a merchant sorcerer eager to hire Garric - who sets out with this party, accompanied by Tenoctris and by the shepherd Cashel and his sister, Ilna, both of whom are discovered to have some magical power.Garric and Sharina, Cashel and Ilna, all travel toward romance, danger, and astonishing magic that will transform them and their world.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.13",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "The Power and the Glitter : The Hollywood-Washington Connection",
        "Authors": "By Brownstein, Ronald",
        "Description": "Explores the connection between Hollywood and Washington and offers an inside look at a relationship that has transformed American political culture",
        "Category": "",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "Science for All Americans",
        "Authors": "By Rutherford, F. James and Ahlgren, Andrew",
        "Description": "In order to compete in the modern world, any society today must rank education in science, mathematics, and technology as one of its highest priorities. It's a sad but true fact, however, that most Americans are not scientifically literate. International studies of educational performance reveal that U.S. students consistently rank near the bottom in science and mathematics. The latest study of the National Assessment of Educational Progress has found that despite some small gains recently, the average performance of seventeen-year-olds in 1986 remained substantially lower than it had been in 1969.  As the world approaches the twenty-first century, American schools-- when it comes to the advancement of scientific knowledge-- seem to be stuck in the Victorian age.In Science for All Americans, F. James Rutherford and Andrew Ahlgren brilliantly tackle this devastating problem.  Based on Project 2061, a scientific literacy initiative sponsored by the American Association for the Advancement of Science, this wide-ranging, important volume explores what constitutes scientific literacy in a modern society; the knowledge, skills, and attitudes all students should acquire from their total school experience from kindergarten through high school; and what steps this country must take to begin reforming its system of education in science, mathematics, and technology.Science for All Americans describes the scientifically literate person as one who knows that science, mathematics, and technology are interdependent enterprises with strengths and limitations; who understands key concepts and principles of science; who recognizes both the diversity and unity of the natural world; and who uses scientific knowledge and scientific ways of thinking for personal and social purposes. Its recommendations for educational reform downplay  traditional subject categories and instead highlight the connections between them. It also emphasizes ideas and thinking skills over the memorization of specialized vocabulary. For instance, basic scientific literacy means knowing that the chief function of living cells is assembling protein molecules according to the instructions coded in DNA molecules, but does not mean necessarily knowing the terms \"ribosome\" or \"deoxyribonucleic acid.\"Science, mathematics, and technology will be at the center of the radical changes in the nature of human existence that will occur during the next life span; therefore, preparing today's children for tomorrow's world must entail a solid education in these areas. Science for All Americans will help pave the way for the necessary reforms in America's schools.",
        "Category": " Science , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Fundamentals of Physics: Chapters 39-45",
        "Authors": "By Halliday, David, Resnick, Robert, and Walker, Jearl",
        "Description": "",
        "Category": " Science , Physics , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Look-Alikes",
        "Authors": "By Joan Steiner",
        "Description": "",
        "Category": "",
        "Publisher": "Little & Brown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Work with Me!",
        "Authors": "By Scott, Gini Graham",
        "Description": "This hands-on guide shows anyone in an organization--workers, managers, supervisors, human resource directors, and CEOs--how to effectively channel their negative emotions.",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "Davies-Black Publishing",
        "Price Starting With ($)": "6.07",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Long Time Gone: A Novel",
        "Authors": "By Hamill, Denis",
        "Description": "Danny Cassidy couldn't remember if he'd killed the cop. So begins one man's journey through his fifty-year-old history and conscience in Long Time Gone, Denis Hamill's gripping novel set in the back streets and alleyways of Brooklyn, U.S.A.  It's the year 2001 when Danny, a divorced journalist, returns to his old neighborhood for his father's funeral. He's spent all of his adult life trying to leave Brooklyn behind him -- along with all the drugs, music, and other psychedelic memories from the sixties spent on Hippie Hill. But now that the box of rain has been opened there's no turning back, and Danny must face some painful truths about the woman he used to love -- and her father, a police officer, whom he may or may not have killed.  By turns a thriller, a detective story, and a coming-of-age tale, Long Time Gone is a bittersweet love letter to a lost New York that no reader will soon forget.",
        "Category": " Fiction , General",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "End of an Era: The Image of War, 1861-1865, Vol. 6",
        "Authors": "By Davis, William C. (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "7.73",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Ancient + Modern (Rodale Organic Style Books)",
        "Authors": "By Upton, Simon (PHT) and Inions, Cynthia",
        "Description": "Many people view ancient and modern as worlds apart, complete opposites, and opt for one or the other when it comes to designing an interior. This book shows the bold and dramatic effects that can be created by putting the two together. From a modern apartment with antique furniture to a Georgian townhouse with a white-painted contemporary interior to a conversion of a brick factory with salvage fixtures and fittings, it gives many inspiring examples of mixing the old with the new, showing how walls and floors, furniture and storage, lighting and objects can all play a part in creating the aesthetic. It offers solutions for both traditional and contemporary interiors and for every type of living space, from kitchens to home offices.--From publisher description.",
        "Category": " House & Home , Decorating & Furnishings",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Ragnarok, Vol. 6: Midnight's Masters",
        "Authors": "By Lee, Myung-Jin and Knaak, Richard A.",
        "Description": "In the time when Ragnarok, the fall of the gods, has been predicted to occur, Fenris Fenrir is on a desperate quest to locate the reincarnated Balder, to seek his help in changing the world, before the valkyries find him and civilization is doomed.",
        "Category": " Young Adult Fiction , Legends, Myths, Fables , General",
        "Publisher": "TokyoPop",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "ADSL and DSL Technologies",
        "Authors": "By Goralski, Walter",
        "Description": "An exploration of the standard that the author hopes will be the \"next big thing\" in Internet telephony.  The author traces the history of the acronym-happy industry to its humble beginnings in the days when humans did the switching to show the evolution of the technology.  Along the way he covers the architecture of the public switched telephone network (PSTN), digitizing the PSTN, ISDN, packet switching, the xDSL family of technologies, and HDSL 1 and 2.  The second half of the book covers ASDL, DSLAM, VDSL, international issues and xDSL, and current issues in DSL.  Appends information about the online ADSL Forum. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Computers , Data Transmission Systems , Broadband",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Studying history: how and why",
        "Authors": "By Daniels, Robert Vincent",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "On the Up and Up: A Survival Guide for Women Living with Men on the Down Low",
        "Authors": "By Hunter, Karen and Browder, Brenda Stone",
        "Description": "This honest, inspirational guide relates the author's struggle to overcome her husband's infidelity with other men, drawing on her childhood of innocence and naivete and detailing her powerful journey of healing and forgiveness that has allowed her to love and trust again. 75,000 first printing.",
        "Category": " Social Science , Ethnic Studies , African American Studies",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Sacred Cows Make the Best Burgers: Paradigm-Busting Strategies for Developing Change-Ready People and Organizations",
        "Authors": "By Kriegel, Robert J. and Brandt, David",
        "Description": "Outmoded beliefs, practices, and processes...why do so many business people cling to their established ways as if their lives depended on them? When they live in an era characterized by on unprecedented rate of change? When the very things they refuse to give up, the sacred cows of the business world, are the lodestones that will kill their careers and block their companies' path to success? In this insightful and unique guide, Kriegel and Brandt reveal why people hold on to the old and how to inspire them to bring on the new - to the point where they're enthusiastically turning even their favorite sacred cows into burgers.Tackling one of the most important business issues of today, the authors demonstrate why the latest panaceas - reengineering, virtual teams, outsourcing, reinventing, restructuring, downsizing - almost always prove unsuccessful. They expose how these buzzword programs overlook the most fundamental element of all business: people. After all, people are the gatekeepers of change, with the power to breathe life into a new program or kill it. If they're excited and positive, it's open sesame; if they're resistant, they'll slam the door in your face. Getting to the heart of the matter, Kriegel and Brandt show you how to coach yourself and others to create Change-Ready people.",
        "Category": " Business & Economics , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.4",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Life Strategies: Doing What Works, Doing What Matters",
        "Authors": "By McGraw, Phillip C., Ph.D.",
        "Description": "Whether its a bad relationship, a dead-end career, or a harmful habit, Dr. McGraw's 10 Life Laws will empower you to take responsibility for your own actions and break free from self-destructive patterns. Drawing upon more than fifteen years of experience, Dr. McGraw explores each of the 10 Life Laws necessary to succeed, including:  People do what works Life rewards action Life is managed, not cured There is freedom in forgiveness Filled with case studies, checklists, and strategies that will work for you, Life Strategies will provide you with the skills you need.",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Connections: Quadrant II Time Management",
        "Authors": "By Merrill, Roger A.",
        "Description": "",
        "Category": "",
        "Publisher": "Inst for Principle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "The Harvard Book: Selections from Three Centuries, Revised Edition",
        "Authors": "By Bentinck-Smith, William",
        "Description": "If Harvard can be said to have a literature all its own, then few universities can equal it in scope. Here lies the reason for this anthology--a collection of what Harvard men (teachers, students, graduates) have written about Harvard in the more than three centuries of its history. The emphasis is upon entertainment, upon readability; and the selections have been arranged to show something of the many variations of Harvard life.For all Harvard men--and that part of the general public which is interested in American college life--here is a rich treasury. In such a Harvard collection one may expect to find the giants of Harvard's last 75 years, Eliot, Lowell, and Conant, attempting a definition of what Harvard means. But there are many other familiar names - Henry Dunster, Oliver Wendell Holmes, James Russell Lowell, Henry Adams, Charles M. Flandrau, William and Henry James, Owen Wister, Thomas Wolfe, John P. Marquaud. Here is Mistress Eaton's confession about the bad fish served to the wretched students of Harvard's early years; here too is President Holyoke's account of the burning of Harvard Hall; a student's description of his trip to Portsmouth with that aged and Johnsonian character, Tutor Henry Flynt; Cleveland Amory's retelling of the murder of Dr. George Parkman; Mayor Quiney's story of what happened in Cambridge when Andrew Jackson came to get an honorary degree; Alistair Cooke's commentary on the great Harvard-Yale cricket match of 1951. There are many sorts of Harvard men in this book--popular fellows like Hammersmith, snobs like Bertie and Billy, the sensitive and the lonely like Edwin Arlington Robinson and Thomas Wolfe, and independent thinkers like John Reed. Teachers and pupils, scholars and sports, heroes and rogues pass across the Harvard stage through the struggles and the tragedies to the moments of triumph like the Bicentennial or the visit of Winston Churchill.And speaking of visits, there are the visitors too--the first impressions of Harvard set down by an assortment of travelers as various as Dickens, Trollope, Rupert Brooke, Harriet Martineau, and Francisco de Miranda, the \"precursor of Latin American independence.\"For the Harvard addict this volume is indispensable. For the general reader it is the sort of book that goes with a good living-room fire or the blissful moments of early to bed.",
        "Category": " Biography & Autobiography , Educators",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "5.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    }
]