[
    {
        "Title": "Fodor's Exploring Australia, 6th Edition (Exploring Guides)",
        "Authors": "By Fodor's Travel Publications, Inc.",
        "Description": "One of the most beautiful and popular travel destinations for Americans featuring something for everyone from the outback to Sydney.",
        "Category": " Travel , Australia & Oceania",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Chieftain",
        "Authors": "By Lamb, Arnette",
        "Description": "A MAN'S YEARNING FOR FREEDOM After seven years in the Tower of London, the infamous Highland Chieftain Drummond Macqueen saw his prison door swing open. He swore to seek revenge on the faithless bride who had betrayed him. Yet the wife he encountered seemed like a stranger -- defiant, lovely, and inexplicably changed.  A WOMAN'S DESPERATE GAMBLE At the death of her twin sister, Johanna Benison had begun a journey of no return. Now, the unexpected arrival of Drummond, the domineering Chieftain she'd believed executed long ago, threatened her precious independence. But soon her fear gave way to a soul-deep longing for the lover who stormed her castle and claimed her heart.  A PASSION NEITHER COULD DENY Through harmonious days and impassioned nights, Johanna and Drummond reveled in their happiness...until the vengeful King Edward II delivered an unholy ultimatum. Obeisance to his royal command could engender only disaster, setting a shattering price on a woman's honor and the future of their love...",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Lover's Lane",
        "Authors": "By Landis, Jill Marie",
        "Description": "For six years, Carly Nolan has built a life for herself and her son Christopher, never getting too close to anyone. Nobody in the sleepy little beach community of Twilight Cove suspects she is running—from the mistakes she made in her youth, the memory of her fiancé Rick and his unexpected death, and the rich, powerful people who want to take away her child. All that is about to change.Private investigator Jake Montgomery has been searching for the elusive Caroline Graham since the day she disappeared with Rick’s baby. When he finally finds her living under an assumed name, she’s no longer a wild teenager, but a devoted, utterly captivating single mother. Cautiously, Carly dares to trust an outsider for the first time in years. She never imagines that Jake, caught between his mission and his growing passion, poses a threat to her protected world. If her secrets are revealed, Carly risks losing the child she holds so dear—and the man who possesses the key to her heart.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Fan the Flame: Living Out Your First Love for Christ",
        "Authors": "By Stowell, Joseph M.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Moody Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "Bridal Bargains, 9th Edition: Secrets to Throwing a Fantastic Wedding on a Realistic Budget (Bridal Bargains: Secrets to Throwing a Fantastic Wedding on a Realistic Budget)",
        "Authors": "By Fields, Denise and Fields, Alan",
        "Description": "A latest edition of a guide to throwing a memorable wedding on a real-world budget makes recommendations for avoiding common scams and pitfalls, in a resource that covers everything from affordable gowns and catering myths to negotiating for a reception site and questions to ask prospective vendors. Original.",
        "Category": " Reference , Consumer Guides",
        "Publisher": "Windsor Peak Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Circle of the Lily",
        "Authors": "By Jones, Jill",
        "Description": "When a storm unearths human bones at the house in which Claire St. John provides \"ghost tours,\" an enigmatic and attractive American comes in search for his long-lost mother, only to find passion and magic with Claire.  Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Communicating for Productivity (Continuing management education series)",
        "Authors": "By D'Aprix, Roger",
        "Description": "Shows how managers can more effectively communicate with their co-workers and subordinates about work problems and goals",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1982"
        }
    },
    {
        "Title": "ENGAGEMENT WITH RHETORIC >CUST",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Pearson Custom Publishing",
        "Price Starting With ($)": "9.63",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The Memoirs of a Publisher",
        "Authors": "By Doubleday, F. N.",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday and Co.",
        "Price Starting With ($)": "8.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Ripley's Believe It or Not: Reptiles, Lizards And Prehistoric Beasts",
        "Authors": "By Zimmerman, Howard and Henderson, Elizabeth (EDT)",
        "Description": "Inside you will find amazing-but-true stories about:- The frog that's a ventriloquist- Snakes that hear with their tongues- Mokele-Mbembe, the living dinosaur- Giant crocodiles the size of a car- And crocs that honk when ready to hatch- The lizard that walks on water- The largest amphibian in nature, the flying dragon, the strange reptile with three eyes, and much, much more.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Book of Loving Thoughts",
        "Authors": "By Florence, Susan",
        "Description": "",
        "Category": "",
        "Publisher": "Peggy Pinson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "The Dare",
        "Authors": "By Kearney, Susan",
        "Description": "DORA WANTS TO MAKE LOVESpecifically, Dora wants to make love with the handsome Rystani warrior-pilot Zical. But since Dora is a computer-albeit a sentient computer-she cannot experience touch, taste and true desire. Dora's logic functions refuse to accept this, so she uses the advanced technology of the 24th century to build herself a body specifically crafted to appeal to Zical, and downloads her computer brain into it.But Dora's sassy attitude makes her too different from the women of Zical's culture. He's attracted to Dora, but he won't make love to her. And while it would be easy for Dora to adapt to his desires, she likes being smart and funny; she's becoming good at being human.When Zical accidentally summons the ancient machines that protect the galaxy from invasion, Dora's mission is to intercept them and bring them back to the galaxy's rim. Fortunately for Dora, this puts her and Zical into very close quarters for a very long time. But much has changed, and as Dora learns more about human emotions and what they mean, she realizes that she doesn't just want to make love with Zical--she wants to love him. And be loved in return.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Tor Paranormal Romance",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Lady Miracle",
        "Authors": "By King, Susan",
        "Description": "Diarmid Campbell scours a battlefield in medieval Scotland for the mysterious healer known as \"Lady Miracle,\" hoping to enlist her powers to help his ailing niece, only to lose his heart in the bargain. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Texas Indigo (Zebra Splendor Historical Romances)",
        "Authors": "By Harte, Holly",
        "Description": "Free-spirited Sheridan Kinmont accepts a job as physician in the small mining town of Shafter, Texas, only to be tempted by the hard-headed mining company manager, Shay Bannigan, who sets out to prove Sheridan unfit to be a doctor. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "An Easter Celebration: Traditions and Customs from Around the World",
        "Authors": "By Kennedy, Pamela",
        "Description": "Examines the history, symbols, and customs of Easter and Holy Week around the world",
        "Category": "",
        "Publisher": "Ideals Childrens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Loving Touches",
        "Authors": "By Kingsley, Johanna",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Ivy Books",
        "Price Starting With ($)": "5.98",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Sweethearts of the Twilight Lanes",
        "Authors": "By Jones, Luanne",
        "Description": "Frankly, My Dear...As the doyenne of Simply Southern Magazine, Tess Redding is the soul of southern hospitality -- or at least to the world around Mount Circe, Georgia. But when bad boy Flynn Garvey roars back into town, Tess's plans to leave Mount Circe are suddenly in danger of burning hotter than Atlanta after Sherman. Once upon a time the smooth-talking rebel broke her young heart, now Tess is just determined to have nothing to do with the mouth-watering, trouble-on-two-legs charmer. But then Tess and her best pals, the Sweethearts, begin to receive anonymous blackmail notes that threaten to expose their youthful follies. Having her old exploits with Flynn revealed is the last thing Tess's sweeter-than-molasses image needs, and he is the only one who can help her. So all that's left for Tess to do is put on her best pair of pumps, march right on up to the man...and fall in love all over again.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Patriot Hearts: A Novel of the Founding Mothers",
        "Authors": "By Hambly, Barbara",
        "Description": "When Martha Dandridge Custis marries her second husband, George, she never suspects that the soft-spoken Virginia planter is destined to command the founding of a nation—or that she is to be “Lady Washington,” the woman at the first President’s side. Only a select inner circle of women will know the cost of sharing a beloved man with history . . . and each will draw strength from the unique treasure given to them by a doomed queen.Seeing farm and family through each harsh New England season, Abigail Adams is sustained only by the fervent reunions stolen between John’s journeys abroad. She will face the terror of an ocean crossing to join her husband in France—and write her own page in history. And there she will cross paths with kings, commoners—and young Sally Hemings.Just as Sally had grown from a clever child to a beautiful woman, so had her relationship with Thomas Jefferson grown from a friendship between slave and master to one entangled in the complexities of black and white, decorum and desire. It is a relationship that will leave Sally to face an agonizingly wrenching choice.  Dolley Madison, too, must live with the repercussions of a forbidden love affair—although she will confront even greater trials as a President’s wife. But Dolley will become one of the best-loved ladies of the White House—and leave an extraordinary legacy of her own.A lushly written novel that traces the marriages tested by the demands of love and loyalty, Patriot Hearts offers readers a dazzling glimpse behind the scenes of a revolution, from adversity and treachery to teatime strategies, as four magnificent women shape a nation’s future.",
        "Category": " Fiction , Historical",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "A World of Ideas: A Dictionary of Important Theories, Concepts, Beliefs, and Thinkers",
        "Authors": "By Rohmann, Chris",
        "Description": "From Aristotle to Zoroaster, a comprehensive guide to the ideas, beliefs, theories, and philosophers who transformed world history presents more than two thousand entries, alphabetically organized for easy access, that cover major intellectual movements, influential thinkers, and other important topics.",
        "Category": " Reference , Dictionaries",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "The Golden Ratio: The Story of PHI, the World's Most Astonishing Number",
        "Authors": "By Livio, Mario",
        "Description": "Throughout history, thinkers from mathematicians to theologians have pondered the   mysterious relationship between numbers and the nature of reality. In this fascinating   book, Mario Livio tells the tale of a number at the heart of that mystery: phi, or   1.6180339887...This curious mathematical relationship, widely known as \"The Golden   Ratio,\" was discovered by Euclid more than two thousand years ago because of its   crucial role in the construction of the pentagram, to which magical properties had   been attributed. Since then it has shown a propensity to appear in the most astonishing   variety of places, from mollusk shells, sunflower florets, and rose petals to the   shape of the galaxy. Psychological studies have investigated whether the Golden Ratio   is the most aesthetically pleasing proportion extant, and it has been asserted that   the creators of the Pyramids and the Parthenon employed it. It is believed to feature   in works of art from Leonardo da Vinci's Mona Lisa to Salvador Dali's The Sacrament   of the Last Supper, and poets and composers have used it in their works. It has even   been found to be connected to the behavior of the stock market! The Golden Ratio is a captivating journey through art and architecture, botany and biology, physics   and mathematics. It tells the human story of numerous phi-fixated individuals, including   the followers of Pythagoras who believed that this proportion revealed the hand of   God; astronomer Johannes Kepler, who saw phi as the greatest treasure of geometry;   such Renaissance thinkers as mathematician Leonardo Fibonacci of Pisa; and such masters   of the modern world as Goethe, Cezanne, Bartok, and physicist Roger Penrose.  Wherever   his quest for the meaning of phi takes him, Mario Livio reveals the world as a place   where order, beauty, and eternal mystery will always coexist.",
        "Category": " Mathematics , Research",
        "Publisher": "Crown",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Mission-Based Management: Leading Your Not-For-Profit in the 21st Century (Wiley Nonprofit Law, Finance and Management Series)",
        "Authors": "By Brinckerhoff, Peter C.",
        "Description": "FROM THE AUTHOR OF THE \"BEST NEW NONPROFIT BOOK\"!-The Alliance for Nonprofit Management    This practical, comprehensive, and easy-to-use workbook provides key tools to help managers of nonprofits ensure that their organization pursues its mission, meets the changing needs of the community-and has enough money to make ends meet-while also satisfying the demands of funders, clientele, boards, staff, and bankers. Designed to equip nonprofit managers and other nonprofit workers with the guidance they need to do their jobs and run their organizations more effectively and efficiently, this workbook is also a hands-on tool to help implement the ideas in the author's highly regarded Mission-Based Management. Filled with indispensable checklists, worksheets, forms, displays, and hands-on suggestions, and including a companion CD-ROM, the Workbook will show you how to smoothly and successfully:  * Hone your organization's core competencies  * Focus your resources  * Improve overall mission capability  * Get the most out of group discussions  * Utilize self-assessment tools      ... and much more to help you and all involved help your organization achieve its mission",
        "Category": " Business & Economics , Nonprofit Organizations & Charities , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Better Homes and Gardens Poultry",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Corporation",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "La Farmacia Popular: Desde Remedios Caseros y Medicamentos Hasta Terapias Naturales, Todas Las Mejores Opciones Para Vencer 36 Males Comune (Spanish Edition)",
        "Authors": "By Joe Graedon",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale Press",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Borden Great American Pies",
        "Authors": "By editors at Borden's kitchen",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Mont Saint-Michel",
        "Authors": "By Lucien Bely",
        "Description": "",
        "Category": "",
        "Publisher": "QUEST FRANCE",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Great Speeches of our Time",
        "Authors": "By Williams, Hywel",
        "Description": "'Let each know that for each the body, the mind and the soul have been freed to fulfil themselves.'These powerful words, spoken by Nelson Mandela in his inaugural address as the new president of South Africa, are taken from just one of the forty important and thought-provoking speeches in this collection.Ranging from 1945 to the present day, they provide an important insight into the modern world. Inspirational speeches by Winston Churchill, Mikhail Gorbachev, Martin Luther King, Barack Obama and many others are supplemented with biographies of each speaker, as well an exploration of their words' significance and an historical account of the consequences of their oratory.This is a history of the recent and contemporary world told through the speeches that shaped it.",
        "Category": " Language Arts & Disciplines , Speech",
        "Publisher": "Quercus",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Cross-Country Cat",
        "Authors": "By Ingraham, Erick and Calhoun, Mary",
        "Description": "What kind of cat would go sliding off on skis, and who'd believe it anyway? When the family accidentally leaves Henry, their sassy Siamese, behind at the ski lodge, he takes matters into his own paws in this beguiling adventure.",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Mulberry Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "The Popular Potato: Best Recipes",
        "Authors": "By Valwyn McMonigal",
        "Description": "",
        "Category": "",
        "Publisher": "Tormont Publications",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Day of Judgment (Sean Dillon)",
        "Authors": "By Higgins, Jack",
        "Description": "May, 1963...As President John F. Kennedy prepares to make his historic visit to West Berlin, a covert group of ruthless killers prepares to strike. And only one man can stop them: Father Sean Conlin, hero of the West German resistance.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Make Your Own President",
        "Authors": "By Pastan, Amy and Mcknight, Linda",
        "Description": "A Smithsonian book that lets you mix and match the faces  and philosophies of your favorite presidentsThis interactive volume allows people of all ages to gain a new perspective on the American presidency, from George Washington to George W. Bush. Starting with twenty-four portraits of America's favorite commanders in chief, each cut into five sections -- forehead, eyes, nose, mouth, and chin -- the reader can reposition the features to create a wealth of amusing and unique composites. Biographies of the featured leaders, famous quotations reflecting their political views, and a time line of the American presidents make this a useful reference as well as a fun game that will bring hours of enjoyment to anyone who has ever wanted to put a new face on the American presidency.",
        "Category": " Reference , Quotations",
        "Publisher": "Harper-perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Where's the Power?",
        "Authors": "By Long, Charles D.",
        "Description": "",
        "Category": " Religion , Christian Rituals & Practice , General",
        "Publisher": "Xulon Press",
        "Price Starting With ($)": "10.61",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Max in Hollywood, Baby",
        "Authors": "By Kalman, Maira",
        "Description": "Max the Parisian poet dog is commissioned to write and direct his first Hollywood feature film, so he and his bride, the dazzling dalmatian Cre+a3pes Suzette, embark on a trip to Tinseltown.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Viking Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The Missing (Seasons of Grace, Book 2)",
        "Authors": "By Lewis, Beverly",
        "Description": "Readers anxiously await the second book in this moving series filled with mystery and family secrets, love and loss, heartbreak and healing.Twenty-one-year-old Grace Byler longs to find her missing mother and to uncover the secret that drove her to leave them three weeks before.  Grace suspects the reason has to do with her father and his reserved, uncommunicative ways.  This conviction led Grace to break off her betrothal to her quiet, staid beau, and she is now resigned to remain single.  But when the young Amishman she thought was courting her best friend takes a sudden interest in her, Grace is befuddled and wonders if he can be trusted.\"Englisher\" Heather Lang has come to Amish country to relive fond memories of her mother and to contemplate a grave medical prognosis of her own.  While in Bird-in-Hand, Heather meets Grace Byler and the two young women strike up a fast friendship, amazed by how well they click.Following the only clue they have, Grace and Heather travel together in hopes of finding Grace's mother and bringing her home.  Will they find what they're looking for...or something much more?",
        "Category": " Fiction , Christian , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "425 More Heartwarmin' Expressions For Crafting, Painting, Stiching and Scrapbooking, Book 2",
        "Authors": "By Ehbrecht, Shelly, Redburn, Sandy",
        "Description": "",
        "Category": "",
        "Publisher": "Crafty Secrets Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Scrapbook Embellishments (Master Series)",
        "Authors": "By Memory Makers (EDT)",
        "Description": "Embellishments are the antidotes for average, everyday scrapbook pages. They can instantly add zest to any so-so scrapbook page, transforming it into a work of art. With the right embellishments, texture and visual interest can easily be added to pages featuring children's antics, travel, romance, career, holidays and limitless other rich and memorable life experiences. Learn to embellish your pages beautifully withScrapbook Embellishments, featuring scrapbook pages from the personal albums of the Memory Makers Masters - ten of the world's top professional scrapbook artists!You'll learn to use today's most popular embellishments including:Textiles: fibers, fabric, ribbon, lace, doilies, embroidery, threadsOrganics: pressed leaves and flowers, raffia, hemp, sandMetallics: wire, mesh, embossing metal, tags, engraving, eyelets, fastenersPaper: tags, folding, punch, weaving, paper piecingBaubles: beads, buttons, sequins, jewels, rhinestones, glitter, confettiIn Scrapbook Embellishments, you'll find an astounding gallery of scrapbook pages that will inspire you to stretch your imagination and try your hand at new embellishment techniques. Whatever your preferred type of embellishment, the possibilities are endless for creating astonishingly adorned scrapbook pages.",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "Memory Makers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Organizational Architecture: Designs for Changing Organizations",
        "Authors": "By Nadler, David A., Gerstein, Marc Saul, and Shaw, Robert B.",
        "Description": "Reveals emerging techniques for answering the challenges senior managers face today: improving organizational quality, inspiring team performance, and creating powerful long-range strategy. Presents a proven model for understanding organizations and demonstrates how it can be used to effect positive change in organizational systems.",
        "Category": " Business & Economics , Organizational Behavior",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "The Search for the Gold of Tut Ankhamen",
        "Authors": "By Brackman, Arnold C.",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "9.4",
        "Publish Date": {
            "Month": "August",
            "Year": "1979"
        }
    },
    {
        "Title": "Loving Elizabeth (Zebra Splendor Historical Romances)",
        "Authors": "By Dark, Victoria",
        "Description": "Falling in love with the wounded man she nurses back to health, a pregnant Elizabeth McKay dreams of their joyous future together, until she hears that Rand Matthews is a wanted man who has been killed by a bounty hunter. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Sacajawea",
        "Authors": "By Howard, Harold P.",
        "Description": "In the saga of early western exploration a young Shoshoni Indian girl named Sacajawea is famed as a guide and interpreter for the Lewis and Clark Expedition to the Far Northwest between 1804 and 1806. Her fame rests upon her contributions to the expedition. In guiding them through the wilderness, in gathering wild foods, and, above all, in serving as an ambassadress to Indian tribes along the way she helped to assure the success of the expedition.This book retraces Sacajawea’s path across the Northwest, from the Mandan Indian villages in present-day South Dakota to the Pacific Ocean, and back. On the journey Sacajawea was accompanied by her ne’er-do-well French-Canadian husband, Toussaint Charboneau, and her infant son, Baptiste, who became a favorite of the members of the expedition, especially Captain William Clark.The author presents a colorful account of Sacajawea’s journeys with Lewis and Clark and an objective evaluation of the controversial accounts of her later years.",
        "Category": " Social Science , Ethnic Studies , Native American Studies",
        "Publisher": "OUP",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1979"
        }
    },
    {
        "Title": "Let's Make Doll Furniture",
        "Authors": "By Mercer, Eileen",
        "Description": "",
        "Category": "",
        "Publisher": "Gramercy Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "The Deepest Edge",
        "Authors": "By Hall, Jessica",
        "Description": "One of Catherine Coulter's favorite new writers makes a breathtaking debut-with the first novel in a bold new trilogy filled with modern-day passions and criminal desire...  While in Paris, Valence St. Charles, an expert on antique Asian swords, inadvertently saves the lives of the reclusive collector T'ang Jian-Shan and his daughter. Now, caught between a Chinese tong's assassins and government agents, Jian-Shan and Val have nowhere to turn but towards each other, as each clash of wills threatens to erupt in a moment of searing heat-and blinding passion...",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Passing Through (with Bob Harbick and the primetime community)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Primetime Ministries-McLean Bible Church",
        "Price Starting With ($)": "6.82",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Shooter's Bible 2003: The World's Standard Firearms Reference Book: 94",
        "Authors": "By Jarrett, William S. (EDT)",
        "Description": "",
        "Category": " Sports & Recreation , Shooting",
        "Publisher": "Stoeger Publishing Company",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The New American Heart Association Cookbook",
        "Authors": "By American Heart Association (COR)",
        "Description": "With over 150 new recipes, this volume is jam-packed with dishes that reflect the way we cook and eat today. Along with healthful versions of family favorites and comfort foods, you'll find microwave, one-dish, and quick-and-easy recipes for busy chefs on the go. You'll also find pizzas, wraps, dessert tamales, spring rolls, and other recipes with a healthful take on today's hottest cooking trends.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Times Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Daily Inspiration for Women of Color",
        "Authors": "By Zondervan",
        "Description": "No matter who we are we all need encouragement, strength and hope for each day. Every person looks for the inspiration to live life to its fullest. Daily Inspiration for Women of Color will bring joyful and uplifting promises to every day. With over 100 topics including faith, courage, peace, and salvation, every woman of color will feel God's Word speaking to her in a personal way. Daily Inspiration for Women of Color features Scripture from the beautiful King James Version.",
        "Category": " Religion , Inspirational",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Health A Guide to Wellness Workbook",
        "Authors": "By Glencoe",
        "Description": "",
        "Category": "",
        "Publisher": "Glencoe (Macmillan/McGraw-Hill)",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "What Research Has to Say About Reading Instruction",
        "Authors": "By Farstrup, Alan E. (EDT), Samuels, S. Jay (EDT), and Samuels, Jay (EDT)",
        "Description": "",
        "Category": " Education , Teaching Methods & Materials , Reading & Phonics",
        "Publisher": "International Reading Association",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Naturally Thin: Unleash Your SkinnyGirl and Free Yourself from a Lifetime of Dieting",
        "Authors": "By Frankel, Bethenny and Adamson, Eve (CON)",
        "Description": "From four-time New York Times bestselling author Bethenny Frankel, the book that started it all: Naturally Thin. Bethenny Frankel, talk show host, “Queen of Cocktails,” and “Mommy Mogul” has always had a passion for preparing and enjoying healthful, natural foods and sharing that love.The New York Times bestseller Naturally Thin shows how anyone can banish their Heavy Habits, embrace Thin Thoughts, and enjoy satisfying meals, snacks, and drinks without the guilt. Armed with Bethenny’s rules, you will say: -I know when I am really hungry -When I’m really hungry, I look for high-volume, fiber-rich foods -I can have any food I want -I love the taste of real food With more than thirty simple, delicious recipes (including her famous SkinnyGirl Margarita), a one-week program to jump-start readers on the Naturally Thin lifestyle, and warm, witty encouragement on every page, Frankel serves up a book for a healthier and thinner life.",
        "Category": " Self-help , General",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Deeper than Desire",
        "Authors": "By Holt, Cheryl",
        "Description": "With her family in dire straits, Olivia Hopkins reluctantly agrees to seek a marriage proposal from the aging Earl of Salisbury. But the plan goes awry when she finds an erotic volume in the earl's library. The book sets Olivia's body on fire. She simply cannot put it down-until she is caught red-handed by the Earl's devilishly handsome son-a man who quickens her pulse and stirs her imagination with thoughts she's never dared entertain...  Philip Paxton can't believe his good luck. Catching Olivia with the scandalous volume offers a superb chance to humiliate the father he despises. Using the book as bait, Philip lures Olivia into an electrifying affair that explodes into unbridled lessons of passion. Philip never expects to become enamored with his ravishing pupil. But what begins as a rakish scheme soon becomes a genuine affair of the heart-one that Philip will protect at any cost...",
        "Category": " Fiction , Romance , Historical , Regency",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The Puppy Whisperer: A Compassionate, Non Violent Guide to Early Training and Care",
        "Authors": "By Owens, Paul, Eckroate, Norma, and Cranendonk, Terry",
        "Description": "Following the success of his book The Dog Whisperer, Paul Owens turns his attention to puppies. In The Puppy Whisperer, Owens and his protege Terence Cranendonk offer a compassionate step-by-step guide to all things puppy, including how to:    * Evaluate temperament  * Choose the right pup personality for your family  * Monitor diet, play, and exercise  * Train and problem solve  * Provide early socialization and positive training  * Potty train, step-by-step  * Ensure safety and health care, including the latest on vaccinationsWhat reviewers are saying...       APDT CHRONICLE OF THE DOG  “I have never said this before but in this case I’m just going to say it: for its genre, this is basically a “perfect book.” There are three authors, Paul Owens, who is known as the “original dog whisperer,” author of The Dog Whisperer, and is a leading proponent of nonviolent dog training; Terence Cranendonk, who apprenticed with Mr. Owens and now is both a CPDT and CDBC, and Norma Eckroate, who writes on the holistic care of humans and animals. The book explains itself as “A Compassionate, Nonviolent Guide to Early Training and Care,” and “everything you need to raise a happy, healthy, well-behaved puppy!” And that’s exactly what it is.   The Puppy Whisperer is a medium-sized paperback with glossy covers and an eye-catching color photograph of a row of adorable puppies staring out at you on the front cover. Inside the pages are basically plain with bold black headings and cute little doggy bones used as bullets. There are several black and white photographs which are well-chosen in depicting what is being discussed. A little color within the book could have “spiced it up” a bit and perhaps made it just a tad more “reader friendly” for those who might have trouble reading a lot of text—however I don’t see this as a significant issue at all.   The book says that it will be a “compassionate step-by-step guide to all things puppy,” including how to: evaluate temperament; choose the right pup; monitor diet, play and exercise; train and problem solve; provide early socialization and positive training; potty train; and ensure safety and health care. The authors start right off asking, “Are you ready for a puppy?” and go on to explain that, along with how wonderful it is to get a new puppy, there will also be those difficult moments and the necessity of changing your lifestyle to accommodate the new family member. The authors state, “These early growth stages can get to be a tad stressful for the typical family, so … consider your financial situation, your physical capabilities, the size of your home, how physically active you are … the size, age, and temperaments of your children.” So true, and so important.   What amazed me about this book is how detailed and complete it is, in every aspect. I can’t emphasize enough that this book includes nearly every detail that a new owner should consider and learn before they get a new puppy and how to raise that little individual once he is home. The only caveat I must mention is that the authors are using clicker training and that might put off some owners—however the techniques and philosophy stand alone whether using a clicker or not. In just the first few pages the authors cover: how to evaluate puppies; temperament tests; hypoallergenic breeds; breeds and mixed breeds; size considerations; ?climate considerations; exercise needs; where to get your puppy (shelters, rescues, breeders, pet stores); breed-specific legislation and more!   The book goes on to cover all aspects of socialization; getting the puppy to be okay alone; beginning obedience commands; exercise; fears (getting the puppy used to the vacuum, for example—something so many owners have trouble with); and a detailed guide to diet and nutrition.  Near the end the book covers teaching basic command exercises, and does so in an easy-to-understand format. It breaks down an exercise into “kindergarten level” and “grade school” level—making it easy for the owner to grasp what the puppy should be able to do at each juncture. The exercises are divided into clear steps, and each section includes a “Having Problems?” set of questions that cover nearly anything that could go wrong when teaching a behavior.   I would strongly recommend this book to all beginning trainers and as a guide to families who are considering getting a new puppy—with this knowledge there should be many more well-adjusted canine companions and far fewer dogs being relinquished to shelters. This book is an admirable accomplishment.”  Valerie Pollard",
        "Category": " Pets , Dogs , General",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Undressed",
        "Authors": "By Holm, Stef Ann",
        "Description": "When her new job falls through, deputy Lanie Prescott finds herself back on the force in Majestic, Colorado, investigating a rash of brutal crimes with the help of her gorgeous replacement Paul Cabrera, an ex-Miami P.D. officer on the run from his past. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Risen indeed: studies in the Lord's resurrection",
        "Authors": "By YARNOLD, G.D",
        "Description": "",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "Paris Underground",
        "Authors": "By Hovey, Tamara",
        "Description": "Photographs, prints, and text depict the construction of the Paris subway",
        "Category": "",
        "Publisher": "Orchard Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Championship Track and Field",
        "Authors": "By ecker, tom",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Human Sexual Response",
        "Authors": "By William H. Masters, Virginia E. Johnson",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "11.09",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "The Best of 30-Minute Meals from Around the World",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "International Masters Publishers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Moody Guide to the Bible",
        "Authors": "By Dowley, Tim",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Moody Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "Beside Still Waters: Words of Comfort for the Soul",
        "Authors": "By Spurgeon, C. H. and Clarke, Roy (EDT)",
        "Description": "A collection of Scripture-based readings that offer encouragement to individuals dealing with illness, loss, or other personal problems.",
        "Category": " Religion , Devotional",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "22.75",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Resistances and Interventions: The Nature of Therapeutic Work (Classical Psychoanalysis and Its Applications)",
        "Authors": "By Langs, Robert",
        "Description": "To find more information about Rowman and Littlefield titles, please visit www.rowmanlittlefield.com.",
        "Category": " Psychology , Psychotherapy , General",
        "Publisher": "Jason Aronson, Inc.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1977"
        }
    },
    {
        "Title": "Only the Best: A Celebration of Gift Giving in America",
        "Authors": "By Jacobson, Stuart",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Harry N Abrams Inc",
        "Price Starting With ($)": "5.91",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Harrigan",
        "Authors": "By Max brand",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1973"
        }
    },
    {
        "Title": "Jackson Jones and the Puddle of Thorns",
        "Authors": "By Rosales, Melodye (ILT) and Quattlebaum, Mary",
        "Description": "Nothing but a big mess of trouble and weeds..That's what Jackson Jones thinks of the garden plot his mother gives him for his tenth birthday. What happened to the basketball he's hoped and prayed for all year?When Jackson comes up with a moneymaking scheme for the garden, it doesn't seem so bad after all. He even cuts his friends in on the action. But before long, Jackson finds out that friends and business don't always mix. When the neighborhood bully calls him \"Bouquet Jones,\" Jackson is ready to give up. Maybe gardens don't belong in cities after all....Winner of the first annual Marguerite de Angeli Prize.",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Whales and Dolphins Coloring Book (Dover Nature Coloring Book)",
        "Authors": "By Green, John",
        "Description": "Embark on your very own whale-sighting excursion with the striking coloring book collection of fascinating marine mammals.Artist John Green's carefully researched and accurately detailed drawings depict 44 species of sea-going and fresh-water animals, revealing striking characteristics of such intriguing cetaceans as the Bottlenose Dolphin, Commerson's Dolphin, the Irrawaddy Dolphin, and the Amazon Dolphin (Boutu). Also depicted are a number of common and less-common species of whale: Cuvier's Beaked Whale (Goosebeak Whale), North Atlantic Bottlenose Whale, Sperm Whale, Blue Whale, Killer Whale, and the astonishing ivory-tusked Narwhal.",
        "Category": " Juvenile Nonfiction , Science & Nature , Earth Sciences , Water (Oceans, Lakes, etc.)",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Stick Up for Yourself: Every Kid's Guide to Personal Power & Positive Self-Esteem (Revised & Updated Edition)",
        "Authors": "By Espeland, Pamela, Raphael, Lev, and Kaufman, Gershen",
        "Description": "First published in 1990, this perennial best-seller has helped countless children build self-esteem and assertiveness skills.Newly revised and updated, it’s the ultimate resource for any kid who’s ever been picked on at school, bossed around, blamed for things he or she didn’t do, or treated unfairly—and for any kid who sometimes feels frustrated, angry, powerless, or scared. Simple words and real-life examples show how children can stick up for themselves with other kids (including bullies and teasers), big sisters and brothers, even grown-ups.Kids learn how to build relationships, become responsible, manage their anger, grow a “feelings vocabulary,” make good choices, solve problems, set goals, and “store” happiness and pride. Questions from real kids are paired with answers about how to handle specific situations calmly, confidently, and effectively. A special note to parents and teachers explores the “self-esteem backlash” and explains what self-esteem really is—and why kids today need it more than ever.A wealth of practical, encouraging, realistic advice, this empowering little book is also recommended for parents, teachers, and counselors.Part of the Bully Free Kids™ line",
        "Category": " Juvenile Nonfiction , Social Topics , Self-Esteem & Self-Reliance",
        "Publisher": "Free Spirit Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "High Energy",
        "Authors": "By Joy, Dara",
        "Description": "Zanita Masterson quickly overcomes her lack of interest in science when a reporting assignment leads her to Tyberius Augustus Evans, a blue-eyed, brawny professor with a winning formula for romance. By the author of Tonight or Never. Original.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Citizens Band",
        "Authors": "By Paul Brickman, E.M. Corder",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1977"
        }
    },
    {
        "Title": "Faith Walk: A Daily Journey Through the Bible",
        "Authors": "By Kroll, Woodrow and Beckett, Tony",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "Back To The Bible",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "A Midnight Carol: A Novel of How Charles Dickens Saved Christmas",
        "Authors": "By Davis, Patricia K.",
        "Description": "1843, London. Though the approaching Christmas looks bleak at the home of the Dickens family, Charles and his pregnant wife Catherine try to maintain a good cheer for their four young children. Debts are mounting, food is scarce, and Charles' books-according to his miserly publisher-are no longer selling.The Charles has an idea, which comes to him in the ghostly form of Oliver Cromwell, the long-dead, spirit-crushing, Lord Protector of England. A Christmas Carol will be Dicken's most brilliant work yet, both for its mass appeal and underlying political message. But many sinister forces oppose the success of this literary gem. And it is only through faith, kindness and the innate goodness of mankind that A Christmas Carol will become a timeless classic-and that the young writer Charles Dickens will truly save Christmas for all of England...",
        "Category": " Fiction , Historical",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Out of Bounds and Out of Control: Regulatory Enforcement at the EPA",
        "Authors": "By Delong, James V.",
        "Description": "Does the EPA comply with the basic principles embodied in the phrase the rule of law. James DeLong says they do not. This book should frighten all who believe in the democratic process.",
        "Category": " Political Science , Reference",
        "Publisher": "Cato Institute",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Personal Finance For Dummies, 5th edition",
        "Authors": "By Tyson, Eric",
        "Description": "Too many personal finance consultants offer financial advice that ignores the big picture and instead focuses on investing. You need much more than that to plan your future. You need a broader understanding of personal finance that includes all areas of your financial life in order to become financially sound.    Personal Finance for Dummies, 5th Edition is full of detailed, action-oriented financial advice that will show you how to lower expenses and tame debts as well as invest wisely to achieve your financial goals! Now in its 5th edition, this up-to-date guide covers all the latest trends to ensure your financial stability. Just some of the updates and revisions include:    Reviews of the new and revised tax laws and how to take advantage of them  The latest scoop on Medicare and Social Security and what it means for you  Updated investment advice on mutual funds and other managed investments  Enhanced smart spending tips  Coverage of new bankruptcy laws and how to eliminate consumer debt  Smart ways to use credit and improve credit scores  Expanded coverage on educational savings options      This hands-on, straightforward guide features ways to survive life changes such as starting your first job, getting married, having children, and retiring, as well as helpful tactics for preventing identity theft and fraud. With Personal Finance for Dummies, 5th Edition, you’ll be able to achieve financial strength and start concentrating on the more important things in life!",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "7.51",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "If Your Dog Could Talk",
        "Authors": "By Fogle, Bruce",
        "Description": "Answers questions about canine instincts, communication, body language, behavior, interaction with other dogs, and training, as well as diet, travel, breeding, diseases, grooming, and preventative care, in a lavishly illustrated guide to all aspects of dog behavior. Original.",
        "Category": " Pets , Dogs , General",
        "Publisher": "DK",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Speaking effectively: A guide for Air Force speakers",
        "Authors": "By Kline, John A",
        "Description": "",
        "Category": "",
        "Publisher": "For sale by the Supt. of Docs., U.S. G.P.O",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Label Launch: A Guide to Independent Record Recording, Promotion, and Distribution",
        "Authors": "By Kalmar, Veronika",
        "Description": "Whether you're in a band, a business entrepreneur or just interested in the music business, Label Launch will let you take your fantasies of holding the reigns at your own record label into reality. In fun, easy-to-understand language Veronika Kalmar takes you step-by-step through the intricate process of running a label from the moment you think about entering the biz until your first CD, vinyl single, or demo tape rolls off the press. Topics covered include:Funding your labelManeuvering through the legal mazeSelling your product online and offPicking and signing bandsPromotion and touringAvoiding the most common pitfalls of a new labelAnd even tells you when it's time to sell out to \"the man.\"Kalmer has culled information from the best in the independent record business interviewing heads of labels who have made a great success and those that almost didn't make it.",
        "Category": " Music , Genres & Styles , Pop Vocal",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Little League Confidential",
        "Authors": "By Geist, Bill",
        "Description": "A journalist tells of his experiences coaching his son's Little League team with anecdotes about a ballerina batter, an unfair umpire uncle, and other stories that provide a fresh perspective on an American institution",
        "Category": " Sports & Recreation , Coaching , Baseball",
        "Publisher": "Island Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "If I Should Die Before I Wake",
        "Authors": "By Nolan, Han",
        "Description": "As sixteen-year-old Hilary, a neo-Nazi, lies wounded in a Jewish hospital, she slips into a coma and begins to relive the harrowing memories of Chana-a Jewish girl whose family was brutalized in the wartime ghettos and Nazi death camps of Poland. At the same time, Hilary begins to come to terms with difficult memories of her own. When she wakes, she finally finds herself on the path to recovery from a lifetime of rage and resentment. “Chana’s story . . . is brilliantly rendered.”-Booklist",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Harcourt Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The spice of life cookbook",
        "Authors": "By Wade, David",
        "Description": "",
        "Category": "",
        "Publisher": "Word Books",
        "Price Starting With ($)": "19.71",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "GEORGE WASHINGTON : A Brief Biography",
        "Authors": "By MacDonald, William",
        "Description": "",
        "Category": "",
        "Publisher": "The Mount Vernon Ladies' Association",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Fallen Hero/the Shocking True Story Behind the O.J. Simpson Tragedy",
        "Authors": "By Davis, Don",
        "Description": "Looks at the double murder of Nicole Simpson and Ronald Goldman and discusses the murder charge and attempted flight of O.J. Simpson",
        "Category": " Biography & Autobiography , Sports",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "A LICHINE NW ENC W&SP5",
        "Authors": "By Lichine, Alexis",
        "Description": "Alphabetical entries provide basic information on vineyards, wine terminology, varieties of grapes, and principal producers",
        "Category": " Cooking , Beverages , Alcoholic , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "9.16",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "The Making of a Cop",
        "Authors": "By Rachlin, Harvey",
        "Description": "Following 860 men and women through a typical training regimen in the New York City Police Academy and then into the streets of New York, the author reveals how young civilians are transformed into street-smart fighters",
        "Category": " Social Science , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Difficult Transitions: Foreign Policy Troubles at the Outset of Presidential Power",
        "Authors": "By Campbell, Kurt M. and Steinberg, James B.",
        "Description": "New presidents have no honeymoon when it comes to foreign policy. Less than three months into his presidency, for example, John F. Kennedy authorized the disastrous effort to overthrow Fidel Castro at the Bay of Pigs. More recently, George W. Bush had been in office for less than eight months when he was faced with the attacks of September 11. How should an incoming president prepare for the foreign policy challenges that lie immediately ahead? That's the question Kurt Campbell and James Steinberg tackle in this compelling book.   Drawing on their decades of government service&#151;in the corridors of Capitol Hill, the intimate confines of the White House, the State Department, and the bare-knuckles Pentagon bureaucracy&#151;Campbell and Steinberg identify the major foreign policy pitfalls that face a new presidential administration. They explain clearly and concisely what it takes to get foreign policy right from the start.  The authors set the scene with a historical overview of presidential transitions and foreign policy including case studies of such prominent episodes as the \"Black Hawk Down\" tragedy in Somalia that shook the Clinton administration in its first year and the Bush administration's handling of the collision between a U.S. reconnaissance plane and a Chinese fighter jet in the spring of 2001. They pinpoint the leading causes of foreign policy fiascos, including the tendency to write off the policies of the outgoing administration and the failure to appreciate the differences between campaign promises and policy realities. Most important, they provide a road map to help the new administration steer clear of the land mines ahead.  America's next president will confront critical foreign policy decisions from day one. Dif ficult Transitions provides essential guidance for getting those choices right.",
        "Category": " Political Science , American Government , Executive Branch",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Inside the System: a Washington Monthly Reader",
        "Authors": "By Charles and Adams, Timothy J. Peters",
        "Description": "",
        "Category": "",
        "Publisher": "Praeger",
        "Price Starting With ($)": "12.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Johnny Appleseed (Folk Tales of America)",
        "Authors": "By Goodman, Joan E. and York, Carol Beach",
        "Description": "John Chapman, the son of a Massachusetts farmer, earns the nickname Johnny Appleseed as he sets out for the Ohio Valley where he plans to plant orchards for the new settlers",
        "Category": " Technology & Engineering , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "20 Communication Tips for Couples: A 30-Minute Guide to a Better Relationship",
        "Authors": "By Barnett, Doyle",
        "Description": "Able to be read in thirty minutes, a concise and simple guide presents twenty tips designed to improve the way couples talk and listen to each other, each followed by a short explanation and examples. Original. 25,000 first printing. IP.",
        "Category": " Family & Relationships , Conflict Resolution",
        "Publisher": "New World Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "The Cook's Handbook: A comprehensive cooking course and kitchen encyclopedia with over 500 recipes",
        "Authors": "By Clements, Carole (EDT)",
        "Description": "The definitive reference book for cooks of all abilities, with 500 classic everyday recipes - a must for every kitchen library. Over 1900 photographs illustrate in clear, step-by-step sequences all the basic skills you need.",
        "Category": " Cooking , Methods , General",
        "Publisher": "Lorenz Books",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "June",
            "Year": "2014"
        }
    },
    {
        "Title": "The Wapshot Scandal",
        "Authors": "By Cheever, John",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Berlitz European Menu Reader",
        "Authors": "By Berlitz Publishing",
        "Description": "",
        "Category": " Reference , Dictionaries",
        "Publisher": "Berlitz Guides",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Bulldogs (Complete Pet Owner's Manuals)",
        "Authors": "By Maggitti, Phil and Monsalve, Tana Hakanson (ILT)",
        "Description": "Although bred originally for the \"sport\" of bullbaiting, modern bulldogs are typically civilized, loyal, and charming companions, if sometimes given to stubbornness. This illustrated manual tells dog lovers what to expect when they acquire a bulldog, as well as everything they need to know about keeping a healthy and happy pet.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Maryland Lost and Found...Again",
        "Authors": "By Meyer, Eugene L.",
        "Description": "",
        "Category": " History , United States , State & Local , General",
        "Publisher": "Woodholme House Pub",
        "Price Starting With ($)": "13.46",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Thinking About Crime, Revised Edition",
        "Authors": "By Wilson, James Q.",
        "Description": "",
        "Category": "",
        "Publisher": "Random House (Paper)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "Technology Guide for Understandable Statistics, 8th Edition",
        "Authors": "By Brase",
        "Description": "",
        "Category": " Mathematics , Probability & Statistics , General",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "A Failure of Capitalism: The Crisis of '08 and the Descent into Depression",
        "Authors": "By Posner, Richard A.",
        "Description": "The financial and economic crisis that began in 2008 is the most alarming of our lifetime because of the warp-speed at which it is occurring. How could it have happened, especially after all that we’ve learned from the Great Depression? Why wasn’t it anticipated so that remedial steps could be taken to avoid or mitigate it? What can be done to reverse a slide into a full-blown depression? Why have the responses to date of the government and the economics profession been so lackluster? Richard Posner presents a concise and non-technical examination of this mother of all financial disasters and of the, as yet, stumbling efforts to cope with it. No previous acquaintance on the part of the reader with macroeconomics or the theory of finance is presupposed. This is a book for intelligent generalists that will interest specialists as well.Among the facts and causes Posner identifies are: excess savingsflowing in from Asia and the reckless lowering of interest rates by theFederal Reserve Board; the relation between executive compensation,short-term profit goals, and risky lending; the housing bubble fuelled bylow interest rates, aggressive mortgage marketing, and loose regulations; the low savings rate of American people; and the highly leveraged balance sheets of large financial institutions.Posner analyzes the two basic remedial approaches to the crisis, which correspond to the two theories of the cause of the Great Depression:the monetarist—that the Federal Reserve Board allowed the money supply to shrink, thus failing to prevent a disastrous deflation—and the Keynesian—that the depression was the product of a credit binge in the 1920’s, a stock-market crash, and the ensuing downward spiral in economic activity. Posner concludes that the pendulum swung too far and that our financial markets need to be more heavily regulated.Read Richard Posner's blog, and his latest article in The Atlantic.",
        "Category": " Business & Economics , Economic Conditions",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Webster's New World French Dictionary: French/English English/French",
        "Authors": "By Atkins, Beryl T., Duval, Alain, and Lewis, Helene M. A. (CON)",
        "Description": "Compiled in collaboration with a team of expert linguists, the Webster's New World concise bilingual dictionaries are the perfect choice for beginning students and advanced speakers as well. Comprehensive and authoritative, yet clear and concise, the dictionaries offer a full array of features, as well as wide-ranging coverage of current expressions. Long-standing favorites in hardcover, the dictionaries will continue to be standard references for years to come -- especially now that they are available in unabridged paperback editions. More than 100,000 words, giving wide-ranging coverage of current terms and expressions. Detailed definitions so the user can understand and translate idiomatically. Extensive examples of usage, showing how translations of words can vary according to context. Verb tables, including irregular verbs Cross-references from every verb to the appropriate verb table",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Webster's New World",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Complex Organizations: A Critical Essay",
        "Authors": "By Perrow, Charles",
        "Description": "This classic in organizational theory provides a succinct overview of the principal schools of thought as it presents a critical, sociopsychological, and historical orientation to the field of organizational analysis. Vividly written, with theories made concrete by specific, student-oriented examples, it takes a critical view toward organizations, analyzing their impact on individuals, groups, and society as a whole. New chapters on economic theories of organization and the conditional power theory are among the features of this revised edition.",
        "Category": " Business & Economics , Human Resources & Personnel Management",
        "Publisher": "McGraw-Hill Humanities/Social Sciences/Languages",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Blue Dreams",
        "Authors": "By Hanley, William",
        "Description": "",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Accounting: What the Numbers Mean (Irwin Series in Undergraduate Accounting)",
        "Authors": "By Marshall, David H. and McManus, Wayne W.",
        "Description": "",
        "Category": "",
        "Publisher": "Richard d Irwin",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "What Shall I Draw (What Shall I Do Today)",
        "Authors": "By Gibson, Ray, Barlow, Amanda (ILT), and Everett, Felicity",
        "Description": "Provides step-by-step instructions for turning circles and other simple shapes into drawings of animals, people, vehicles, and other subjects.",
        "Category": " Juvenile Nonfiction , Art , Drawing",
        "Publisher": "Usborne Pub Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Alaska's Inside Passage",
        "Authors": "By Heacox, Kim",
        "Description": "",
        "Category": "",
        "Publisher": "Albion Pub. Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Happy Baby: Animals",
        "Authors": "By Priddy, Roger",
        "Description": "Designed for babies and young toddlers, a sturdy rerelease of a vividly photographed introduction to the animal world features a \"soft-to-touch\" cover and labeled, colorful spot images of endearing wild and domestic creatures.",
        "Category": " Juvenile Nonfiction , Animals , General",
        "Publisher": "Priddy Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "My Shadow Ran Fast",
        "Authors": "By Sands, Bill",
        "Description": "",
        "Category": "",
        "Publisher": "Signet Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    }
]