[
    {
        "Title": "Foods That Heal: A Guide to Understanding and Using the Healing Powers of Natural Foods",
        "Authors": "By Dr. Bernard Jensen",
        "Description": "",
        "Category": "",
        "Publisher": "Avery Publishing Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Aircraft Carriers",
        "Authors": "By Antony Preston",
        "Description": "",
        "Category": "",
        "Publisher": "Bison Books Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Jessica and the Money Mix-Up (Sweet Valley Twins #39)",
        "Authors": "By Pascal, Francine",
        "Description": "Sent on an errand to deliver an envelope of money for a charity down the street, easily-distracted Jessica misplaces the money, and she and her sister must find it before their father discovers it is missing",
        "Category": " Juvenile Fiction , Visionary & Metaphysical",
        "Publisher": "Sweet Valley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "To Begin at the Beginning: An Introduction to the Christian Faith",
        "Authors": "By Copenhaver, Martin B.",
        "Description": "",
        "Category": " Religion , Christianity , General",
        "Publisher": "United Church Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Allergy Free: An Alternative Medicine Definitive Guide",
        "Authors": "By Goldberg, Burton, Kail, Konrad, and Lawrence, Bobbi",
        "Description": "In ALLERGY FREE, 25 leading physicians explain the techniques and natural substances that brought recovery to their patients. Explore dozens of self-help options for treating allergies without drugs in an interactive cross-referenced format.The authors of this thoroughly researched book designed it as an educational tool to help readers choose the best course of treatment and prevent allergies from developing in the first place. Konrad Kail, N.D., co-owner of Naturopathic Family Care in Phoenix, is a member of the Advisory Council to the National Center for Complementary and Alternative Medicine (NCCAM) at the National Institutes for Health.Permanently reverse your allergies when you learn: How to be your own allergy detective How to build up your body'¬?s defenses against allergies How to allergy-proof your home Why we'¬?re having an epidemic of asthma Why it'¬?s important to eat a varied diet How vaccinations and antibiotics set the stage for allergies How stress contributes to allergies",
        "Category": " Health & Fitness , Allergies",
        "Publisher": "Alternativemedicine.com Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "A First-Class Temperament: The Emergence of Franklin Roosevelt",
        "Authors": "By Ward, Geoffrey C.",
        "Description": "Looks at Roosevelt's career as a young lawyer, his marriage to Eleanor, and his efforts to return to politics after his bout with polio",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "7.46",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The White Wolf (A to Z Mysteries - A Stepping Stone Book(TM))",
        "Authors": "By Gurney, John Steven (ILT) and Roy, Ron",
        "Description": "Help Dink, Josh, and Ruth Rose solve mysteries from A to Z!    Kids love collecting the entire alphabet and super editions! With over 8 million copies in print, the A to Z Mysteries® have been hooking chapter book readers on mysteries and reading for years. Now this classic kid favorite is back with a bright new look!   W is for Wolf . . . Where could those wolves be? When the kids visit the Maine wilderness, they spot a white mother wolf and her babies on a cliff. But soon after that, the pups are stolen! Can Dink, Josh, and Ruth Rose sniff out the culprits?",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Julie's Wolf Pack (Julie of the Wolves)",
        "Authors": "By George, Jean Craighead and Minor, Wendell (ILT)",
        "Description": "The acclaimed final book in the trilogy that begins with the Newbery Medal-winning Julie of the WolvesIn this exciting adventure about the wolf pack that saved the life of a young girl when she was lost on the tundra, Julie has returned to her family, but her wolf pack has a story all its own.Fearless but inexperienced Kapu is now the new leader of the pack. He must protect his wolves from the threats of famine and disease and, at the same time, defend himself from bitter rivals, both inside and outside the pack, who are waiting for their chance to overthrow him. The strength of Kapu's leadership will determine not just the well-being of the pack but its very survival.Jean Craighead George's research and first-hand observation form this engrossing epic tale that's sure to draw readers into the fascinating world of wolves.Don't miss any of the books in Jean Craighead George's groundbreaking series: Julie of the Wolves, Julie, and Julie's Wolf Pack.",
        "Category": " Young Adult Fiction , Animals , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Pet-Rified!",
        "Authors": "By Marney, Dean",
        "Description": "Wondering how her beagle, Irving, has turned into a plastic lawn ornament and why her parents are acting strangely, Becky questions whether or not her weird new neighbors, who have moved into the haunted house next door, are responsible. Original.",
        "Category": "",
        "Publisher": "Apple",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "The Complete Book of Jewish Observance: A One-Volume Guide to the Ceremonies and Practices of Judaism",
        "Authors": "By Trepp, Leo",
        "Description": "A guide to the traditional Jewish religious ceremonies and prayers explains how to celebrate the holidays and describes the rituals associated with the various stages of life",
        "Category": " Religion , General",
        "Publisher": "Summit Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1980"
        }
    },
    {
        "Title": "The Transformation of War: The Most Radical Reinterpretation of Armed Conflict Since Clausewitz",
        "Authors": "By Van Creveld, Martin L.",
        "Description": "At a time when unprecedented change in international affairs is forcing governments, citizens, and armed forces everywhere to re-assess the question of whether military solutions to political problems are possible any longer, Martin van Creveld has written an audacious searching examination of the nature of war and of its radical transformation in our own time.For 200 years, military theory and strategy have been guided by the Clausewitzian assumption that war is rational—a reflection of national interest and an extension of politics by other means. However, van Creveld argues, the overwhelming pattern of conflict in the post-1945 world no longer yields fully to rational analysis. In fact, strategic planning based on such calculations is, and will continue to be, unrelated to current realities. Small-scale military eruptions around the globe have demonstrated new forms of warfare with a different cast of characters - guerilla armies, terrorists, and bandits—pursuing diverse goals by violent means with the most primitive to the most sophisticated weapons. Although these warriors and their tactics testify to the end of conventional war as we've known it, the public and the military in the developed world continue to contemplate organized violence as conflict between the super powers. At this moment, armed conflicts of the type van Creveld describes are occurring throughout the world. From Lebanon to Cambodia, from Sri Lanka and the Philippines to El Salvador, the Persian Gulf, and the strife-torn nations of Eastern Europe, violent confrontations confirm a new model of warfare in which tribal, ethnic, and religious factions do battle without high-tech weapons or state-supported armies and resources. This low-intensity conflict challenges existing distinctions between civilian and solder, individual crime and organized violence, terrorism and war. In the present global atmosphere, practices that for three centuries have been considered uncivilized, such as capturing civilians or even entire communities for ransom, have begun to reappear. Pursuing bold and provocative paths of inquiry, van Creveld posits the inadequacies of our most basic ideas as to who fights wars and why and broaches the inevitability of man's need to “play” at war. In turn brilliant and infuriating, this challenge to our thinking and planning current and future military encounters is one of the most important books on war we are likely to read in our lifetime.",
        "Category": " History , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Aerobics Program For Total Well-Being: Exercise, Diet , And Emotional Balance",
        "Authors": "By Cooper, Kenneth H.",
        "Description": "From the medical authority, whose previous bestsellers (Aerobics, The New Aerobics, The Aerobics Way, and Aerobics for Women) have sold more than 12 million copies, comes an exciting, new and comprehensive concept for total fitness. . . . Millions have benefited from Dr. Cooper’s famous aerobic exercise programs. He has revolutionized the way Americans get in shape and stay in shape. Now, he presents a complete program for total well-being—physically, nutritionally, emotionally. Discover for yourself why it is the most effective, enjoyable and medically sound approach to a lifetime of energy and good health.A program designed to bring physical and emotional health and vitality to every area of your life, including: • the 7 benefits of integrated aerobic exercise, including reduced risk of heart disease• the 4 types of exercise that have been most radically re-evaluated in terms of aerobic exercise• the 3 dozen ways to stay fit, and the 4 steps to making it fun• 3 complete weeks of nutritious menus• guidelines for the 22 components of a comprehensive medical exam, so you can work with your doctor to evaluate your level of fitness• plus, the aerobics way to diminish physical and emotional stress, enhance your sex life, and more",
        "Category": " Health & Fitness , Exercise , Aerobics",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "511 Things Only Women Understand",
        "Authors": "By Lorraine Bodger",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Daily Candy A to Z: An Insider's Guide to the Sweet Life",
        "Authors": "By",
        "Description": "The Bombshell Manual of Style meets The Lucky Shopping Manual in an alphabetized style guide from the editors of the trendsetting Web site DailyCandy.com Every morning, hundreds of thousands of women around the globe open their e-mail inboxes and indulge in the day's first treat: DailyCandy. What's DailyCandy? It's the Web site that quickly became the ultimate source for the latest need-to-know information about fashion, food, and fun. It's like getting an e-mail from your clever, unpredictable, and totally in-the-know best friend who always has the scoop on everything--from new designers, handbags, and jeans to hot restaurants, travel destinations, books, and beauty treatments. As useful as it is entertaining, DailyCandy is beloved for its writing style (insider and inclusive, witty but never pretentious) and for its beautiful watercolor illustrations. Now, for the first time ever, advice, atmosphere, and attitude will be available in book form. DailyCandy A to Z offers insider advice on 26 topics: Appearance, Brain Candy, Charm, Do-Gooding, Edibles, Fundamentals, Grand Dames, Home, Intimacy, and more. DailyCandy A to Z covers everything you need to know about living a stylish life. The book will appeal not only to the site's large and loyal fan base, but to countless other readers who have yet to discover DailyCandy.",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Where Are You, Fuzzy (The Big Comfy Couch)",
        "Authors": "By Wagner, Cheryl and Kolding, Richard (ILT)",
        "Description": "While playing hide-and-seek with Wuzzy, Fuzzy wanders outside and becomes lost in Granny's garden, but Molly comes along to save the day",
        "Category": " Juvenile Fiction , Sports & Recreation , Games",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Squanto: A Warrior's Tale",
        "Authors": "By Fontes, Ron and Korman, Justine",
        "Description": "Squanto is kidnapped to England and put on display, until he escapes and is aided in his return to America by friendly monks.",
        "Category": "",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "The Magic of Mozart: Mozart, the Magic Flute, and the Salzburg Marionettes : A Jean Karl Book",
        "Authors": "By Mozart, Wolfgang Amadeus, Costas (ILT), and Switzer, Ellen Eichenwald",
        "Description": "Color photographs of a performance of The Magic Flute by the Salzburg Marionette Theater are accompanied by a mini biography of Mozart, the story of the opera, and a history of the puppet theater.",
        "Category": "",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Grand Complication: A Novel",
        "Authors": "By Kurzweil, Allen",
        "Description": "The account begins with Alexander's job in jeopardy and his marriage destined for the Discard shelf. Enter the improbably named Henry James Jesson III, a bibliophile who hires the librarian for some after-hours research. The task: to render whole an incomplete cabinet of wonders chronicling the life of a mysterious eighteenth-century inventor. As the investigation heats up, Alexander realizes there are many more secrets lurking in Jesson's cloistered world than those found inside his elegant Manhattan town house. With a notebook tethered to his jacket, Alexander plunges headlong into the search, only to discover that the void in the cabinet is rivaled by an emptiness in his heart.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "The Castle of Llyr (Pyrdain Chronicles)",
        "Authors": "By Alexander, Lloyd",
        "Description": "In the imaginary kingdom of Prydain, Princess Eilonwy must leave her friends to go to the Isle of Mona for training as a proper princess. Because Eilonwy has magical powers, she is sought by Achren, the most evil enchantress in the land. Shortly after her arrival on the Isle of Mona, something sinister and secret befalls her. Eilonwy's loyal friends--Taran, the Assistant Pig-Keeper; Flewddur, the bard; and Prince Rhun, her intended husband--realize her peril and set out on an exciting and terrifying mission to rescue her. They encounter great forces of enil as well as private--sometimes painful--revelations in the course of their journey.",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1969"
        }
    },
    {
        "Title": "From Sea to Shining Sea: 1787-1837 (God's Plan for America)",
        "Authors": "By Marshall, Peter and Manuel, David",
        "Description": "In From Sea to Shining Sea history buffs are transported back to the post-revolutionary era to discover how God intervened on behalf of a struggling nation. This fast-paced, absorbing narrative and sequel to the bestselling The Light and the Glory covers that fragile time in America's history from 1787 to 1837 when a newborn nation faced challenges and overcame her growing pains by clinging to her Christian heritage.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Revell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Stalemate (An Eve Duncan Forensics Thriller)",
        "Authors": "By Johansen, Iris",
        "Description": "The suspense begins with a phone call and leads forensic sculptor Eve Duncan to the trail of a killer even killers fear to face.Eve Duncan has turned down the job twice already. Her skill and devotion in identifying murder victims and helping bring their killers to justice may be world-renowned. But Eve works exclusively for law enforcement and the families of the innocent, and the man on the other end of the phone is many things - none of them law-abiding or innocent.One of the world's most wanted men, little is really known about Luis Montalvo except that he is extraordinarily dangerous and that he never takes no for an answer. Now he wants Eve's help in the worst way. For he believes they have something in common - and he's about to prove it with a grisly warning.Eve will leave everything and everyone behind, even the man she trusts and loves the most, Atlanta detective Joe Quinn, to travel to Montalvo's luxurious armed compound in the Colombian jungle to identify the skull he has recovered. She has agreed to this devil's bargain to save an innocent family, but also for a reason she can't admit to Joe, to the CIA, to anyone. For the man in the jungle has promised to be able to give Eve what she wants most of all - the key to unlocking the darkest and most painful mystery of her past.But Eve is in more danger than she can imagine. As she gets closer to identifying the skull, she finds herself caught between two ruthless killers with no way out. Now, with everything on the line, Eve Duncan must make the most chilling choice of all. And if she's wrong ... she's dead.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Eyes of the Emperor",
        "Authors": "By Salisbury, Graham",
        "Description": "Eddy Okubo lies about his age and joins the army in his hometown of Honolulu only weeks before the Japanese bomb Pearl Harbor.  Suddenly Americans see him as the enemy—even the U.S. Army doubts the loyalty of Japanese American soldiers.Then the army sends Eddy and a small band of Japanese American soldiers on a secret mission to a small island off the coast of Mississippi.  Here they are given a special job, one that only they can do.  Eddy’s going to help train attack dogs. He’s going to be the bait.",
        "Category": " Young Adult Fiction , Historical , United States , 20th Century",
        "Publisher": "Wendy Lamb Books",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Monster Mad Libs",
        "Authors": "By Price, Roger and Stern, Leonard B.",
        "Description": "The idea is simple. Someone asks for a part of speech: a verb, a noun, an adjective, or an adverb. We've included definitions and examples of the parts of speech in case you've forgotten. Players call out their ideas to fill in the blanks and in the end, you have a story reeling from one silly sentence to another until nothing makes sense. That's what you call a Mad Lib&#174, the world's greatest word game. Players have been howling with friends or laughing all to themselves for over 35 years!From the creators of the original Mad Libs&#174, this group of silly and scary (not really) Mad Libs  is sure to thrill you.",
        "Category": " Juvenile Nonfiction , Games & Activities , General",
        "Publisher": "Mad Libs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1974"
        }
    },
    {
        "Title": "The New Tradition Cookbook",
        "Authors": "By Hart, Valerie",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Editech Pr",
        "Price Starting With ($)": "6.73",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "At the Plate with...Ken Griffey Jr. (Athlete Biographies)",
        "Authors": "By Christopher, Matt",
        "Description": "Ken Griffey Jr., son of former pro ballplayer Ken Griffey Sr., has baseball in his blood. From his early years hanging out at Yankee Stadium with his father through his high school days as a baseball star, Ken Jr. was destined to bring greatness to whatever team he played for. He fulfilled his destiny by helping shape his former team, the Seattle Mariners, into division champs. In 2000, Griffey took his legendary skills and famous smile to the Cincinnati Reds to try to win a World Series with his hometown team.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Sports & Recreation",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Fit to Lead: The Proven 8-Week Solution for Shaping Up Your Body, Your Mind, and Your Career",
        "Authors": "By Manz, Charles C., Neck, Christopher P. (EDT), Mitchell, Tedd L., M.D., and Thompson, Emmet C., II",
        "Description": "A proven program to help busy executives get Fit to Lead.Are you a leader at work, at the expense of your health? Did you give up exercise after college, and stop watching your diet when you made it to senior partner? Are too little sleep, fast food, and a hectic, catch-up lifestyle all you allow yourself?This proven, simple program is based on the sound principles that have helped thousands of top executives, including President George W. Bush, get - and stay - in shape. The results are not just looking and feeling better, but performing better on the job, becoming a more effective leader, and inspiring others to follow your lead. A proven program to help busy executives get Fit to Lead.Are you a leader at work, at the expense of your health? Did you give up exercise after college, and stop watching your diet when you made it to senior partner? Are too little sleep, fast food, and a hectic, catch-up lifestyle all you allow yourself?This proven, simple program is based on the sound principles that have helped thousands of top executives, including President George W. Bush, get - and stay - in shape. The results are not just looking and feeling better, but performing better on the job, becoming a more effective leader, and inspiring others to follow your lead.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Midnight Fox",
        "Authors": "By Byars, Betsy Cromer and Grifalconi, Ann (ILT)",
        "Description": "Tom hates having to spend the summer on a farm . . . until he discovers the midnight fox. No one asked Tom how he felt about spending two months on his Aunt Millie’s farm. For a city boy, the farm holds countless terrors—stampeding baby lambs, boy-chasing chickens, and worst of all, loneliness. But everything changes when Tom sees the midnight fox. He can spend hours watching the graceful black fox in the woods. And when her life—and that of her cub—is in danger, Tom knows exactly what he must do. “An exceptional book.”—Booklist  A Library of Congress Children’s Book of the Year",
        "Category": " Juvenile Fiction , Lifestyles , Farm & Ranch Life",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1981"
        }
    },
    {
        "Title": "Rama II: The Sequel to Rendezvous with Rama",
        "Authors": "By Clarke, Arthur C. and Gentry, Lee",
        "Description": "In the sequel to \"Rendezvous with Rama,\" a second Raman spacecraft is discovered approaching Earth in 2196, an event of potentially devastating consequences for humankind",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "A TAN AND SANDY SILENCE [TRAVIS MCGEE #13]",
        "Authors": "By MacDonald, John D.",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Gold Medal",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Pearl Cove (Donovans, Book 3)",
        "Authors": "By Lowell, Elizabeth",
        "Description": "It is desperation that inspires young widow Hannah McGarry to call Archer Donovan.  She saw the man only twice in the past ten years, and he struck her as a cold, ruthless piece of work.  But as a silent partner in Pearl Cove, her late husband's pearl farm business, Donovan might be willing to help her...if the price is right.At twenty-nine, Hannah has been freed to live her life again.  Now she faces the mystery of her late husband's suspicious death, the prospect of bankruptcy...and the disappearance of the Black Trinity, a necklace containing a three million dollar fortune in black pearls that was to ber her financial security.Archer Donovan would rather roget he'd ever heard of Pearl Cove.  It links him to memories of living life on the dark side, the old lure, the heart-pumping, soul-numbing certainty that there was no law, no justice, no mercy;  just hunters and the hunted.  That life taught him to trust no one but family.  But when Hannah McGarry calls in an old debt and offers a million dollars, Archer is plunged back into the hell he vowed never to revisit;  into a deadly game of mony, power, cutthroat competition, and treachery in pursuit of a stolen fortune.  At his side is a woman he shouldn't want, yet cannot resist...a woman who may know more than she's telling about her husband's death...and more than is safe to know about that dark and elusive black pearls.  With a feeding frenzy of human sharks on their tails, Archer and Hannah race through unchanted waters in search of  the fabulous Black Trinity.  And the closer they come to finding the coveted pearls, the closer they come to danger and truth-and to each other",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.3",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Food & Wine Magazine's 1999 Annual Cookbook",
        "Authors": "By Food & Wine (New York, N. Y.) (EDT)",
        "Description": "A collection of more than five hundred outstanding recipes includes submissions from Julia Child, Emeril Lagasse, Marcella Hazan, and Thomas Keller, among others, and is enhanced by photographs, wine recommendations, menu plans, and tips from accomplished chefs.",
        "Category": " Cooking , Methods , Gourmet",
        "Publisher": "Food & Wine",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "The Twelve Days of Christmas Cookbook",
        "Authors": "By Huntley, Suzanne",
        "Description": "",
        "Category": "",
        "Publisher": "Galahad Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Hell's Belles: A Tribute to the Spitfires, Bad Seeds, and Steel Magnolias of the New and Old South (Tribute to the Spitfires, Bad Seeds & Steel Magnolias of the)",
        "Authors": "By Ballenger, Seale",
        "Description": "Bad seeds, belleslettres, rule breakers, shreiking violets, bar belles how could any collections of impudent sketches that celebrates and lampoons the American Southern bell go wrong? Most of the women on these pages are instantly recognizable. Among those whose exploits or imagination vaulted them to fame are writers Carson McCullers and Anne Rice; emancipator Harriet Tubman; actress and onetime town owner Kim Basinger; exblack Panther Angela Davis; 30's outlaw Bonnie Parker; and mascara maven Tammy Faye Baker. A few littleknowns and relative newcomers have elbowed their way on stage, too.From Mama to Mammy, from Scarlett to Blanche, Hell's Bells (often exclaimed in mock piety and defining generations of Southern women) is hilarious and loving tribute to the famous and infamous females of ol' Dixie. This diverse collections features more than 200 womenaristocratic to poverty stricken, well-bred to illmannered, from Virginia to Texas (the heart of the Confederacy) who have one thing in common: a uniquely Southern take on life and a strength and a strength of character molded by their roots.",
        "Category": " Humor , General",
        "Publisher": "Conari Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Book of Fred: A Novel",
        "Authors": "By Bardi, Abby",
        "Description": "Filled with soulful humor and quiet pathos, Abby Bardi's boldly drawn first novel marks the debut of a joyfully talented chronicler of the quest for connection in contemporary life.  Mary Fred Anderson, raised in an isolated fundamentalist sect whose primary obsessions seem to involve an imminent Apocalypse and the propagation of the name \"Fred,\" is hardly your average fifteen-year-old. She has never watched TV, been to a supermarket, or even read much of anything beyond the inscrutable dogma laid out by the prophet Fred. But this is all before Mary Fred's whole world tilts irrevocably on its axis: before her brothers, Fred and Freddie, take sick and pass on to the place the Reverend Thigpen calls \"the World Beyond\"; before Mama and Papa are escorted from the Fredian Outpost in police vans; and Mary Fred herself is uprooted and placed in foster care with the Cullison family. It is here, at Alice Cullison's suburban home outside Washington, D.C., where everything really changes -- for all parties involved. Mary Fred's new guardian, Alice, is a large-hearted librarian who, several years after her divorce, can't seem to shake her grief and loneliness. Meanwhile, Alice's daughter Heather, also known as Puffin, buries any hint of her own adolescent loneliness beneath an impenetrable armor of caustic sarcasm, studied apathy, and technicolor hair. And the enigmatic Uncle Roy is Alice's perennially jobless and intensely private brother. As Mary Fred struggles to adjust to the oddities of this alien world, from sordid daytime television and processed food to aromatherapy and transsexuality, she gradually begins to have an unmistakable influence on the lives of her housemates. But when a horrifying act of violence shakes the foundations of Mary Fred's fragile new family, she finds herself forced to confront, painfully, the very nature of the way she was raised. With a knack for laying bare the absurdities of daily life, Abby Bardi captures, with grace and authority, all the ambivalence and emotional uncertainty at the heart of these quirky characters' awakenings.",
        "Category": " Fiction , Psychological",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "A Greater Freedom: Stories of Faith from Operation Iraqi Freedom",
        "Authors": "By North, Oliver and Horn, Sarah Ann",
        "Description": "Recounts the experiences during the Iraq War of American military and naval personnel who are Christians, including the crew of the USS Harry S. Truman, and their faith that the war will lead to a new day for Christianity in Iraq.",
        "Category": " Religion , Christianity , History",
        "Publisher": "B&H Books",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Foxes in the Henhouse: How the Republicans Stole the South and the Heartland and What the Democrats Must Do to Run 'em Out",
        "Authors": "By Saunders, Dave and Jarding, Steve",
        "Description": "Like a newly discovered treasure map offering a path to buried riches, Foxes in the Henhouse is a hard-hitting political blueprint for how the Democrats can win again in the South and rural America. The authors document the Republicans' rise in the South and Midwest, expose the hypocrisy that marked their ascent, and offer a take-no-prisoners plan to kick them out.The authors know of what they speak. \"Rural strategists\" Steve Jarding and Dave \"Mudcat\" Saunders are famous for securing Democratic victories in places they shouldn't have -- most notably in Mark Warner's successful run for governor of Virginia, a campaign that wasn't afraid to use bluegrass concerts and NASCAR to get the message out.When George W. Bush swept the South clean in 2004, it was the final insult to Jarding and Saunders, two self-proclaimed \"bubbas\" on a mission to convince their fellow southerners and rural Americans that the GOP's claim of representing \"values,\" patriotism, the sportsmen, and fiscal conservatism is a disastrous farce. In addition to exposing the lies behind the gradual Republican invasion of the hinterland that began in the 1960s, they offer some surprisingly simple strategies for Democrats to capture each of these issues. Among other things, Jarding and Saunders urge Democrats to? Quit turning their noses up at the culture of rural America and talk to people where they live? Learn how to count when going after votes? Show some passion and retaliate when Republicans assassinate their charactersPacked with meticulous and shocking research findings; blunt, laugh-out-loud language; and merciless assaults on George W. Bush, Tom DeLay, Bill O'Reilly, and plenty of other right-wing charlatans, Foxes in the Henhouse is a must-read and will be one of the most talked-about books of the year and for election cycles to come.",
        "Category": " Political Science , Political Process , Political Parties",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Song",
        "Authors": "By Miller, Calvin",
        "Description": "",
        "Category": "",
        "Publisher": "Intervarsity Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "Cradle",
        "Authors": "By Clarke, Arthur C. and Lee, Gentry",
        "Description": "The multiple Hugo and Nebula Award-winning grandmaster of science fiction does for the sea in his new novel what his epic classic 2001 did for outer space. Currently in production for a major motion picture from Warner Brothers/Peter Guber.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.54",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "The Used Book Lover's Guide to New England (Used Book Lovers' Guide Series)",
        "Authors": "By Siegel, David S. and Siegel, Susan",
        "Description": "",
        "Category": " Travel , United States , Northeast , New England (CT, MA, ME, NH, RI, VT)",
        "Publisher": "Book Hunter Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "So Long, and Thanks for all the Fish",
        "Authors": "By Adams, Douglas",
        "Description": "Arthur Dent finds himself back on Earth, which has been mysteriously restored after having been demolished for a hyperspace bypass and again sets out on his travels with a girl who went mad at the Earth's destruction",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Afterglow",
        "Authors": "By Cooper, James Fenimore Jr.",
        "Description": "",
        "Category": "",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1918"
        }
    },
    {
        "Title": "The China Option",
        "Authors": "By Milton, Nancy Dall",
        "Description": "American reporter Anne Campbell is assigned to China and stumbles into various clandestine situations that lead her to an American plan for the nuclear arming of China",
        "Category": "",
        "Publisher": "Pantheon Books",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "The Slimy Stuarts",
        "Authors": "By Deary, Terry",
        "Description": "This history book describes the more gruesome side of the Stuart period. It tells why some Stuarts ate toads, snails and fleas, which king picked his nose and never washed his hands, and who wore fish on their feet. Facts about the revolting Roundheads and ghastly Guy Fawkes are given.",
        "Category": " Juvenile Nonfiction , History , Renaissance",
        "Publisher": "Gardners Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Girlfriends' Guide to Pregnancy",
        "Authors": "By Iovine, Vicki",
        "Description": "The practical, comforting, honest, and hilarious bestseller for moms-to-be, with more than one and a half million copies in print!Your doctor gives you medical advice. Your mother buys you baby clothes. But who can give you the real skinny when you’re pregnant? Your girlfriends, of course—at least, the ones who’ve been through the exhilaration and exhaustion, the agony and ecstasy of pregnancy. Four-time delivery room veteran Vicki Iovine talks to you the way only a best friend can—in the book that will go the whole nine months for every mother-to-be. In this revised and updated edition, get the lowdown on all those little things that are too strange or embarrassing to ask, practical tips, and hilarious takes on everything pregnant. What really happens to your body—from morning sickness and gas to eating everything in sight—and what it’s like to go from being a babe to having one. The Many Moods of Pregnancy—why you’re so irritable/distracted/tired/lightheaded (or at least more than usual). Staying Stylish—You may be pregnant, but you can still be the fashionista you’ve always been (or at least you don’t have to look like a walking beachball)—wearing the hippest designers and proudly showing off your bump. Pregnancy is Down To a Science—from in vitro fertilization to scheduled c-sections, there are so many options, alternatives, and scientific tests to take that being pregnant can be downright confusing! And much more! For a reassuring voice or just a few good belly laughs, turn to this straight-talking guide on what to really expect when you’re expecting.",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Twinkle, Twinkle, Little Star: and other favorite bedtime rhymes (Padded Nursery Rhyme Board Books)",
        "Authors": "By Rescek, Sanja",
        "Description": "Designed with padded covers and rounded corners, an illustrated collection of twenty familiar nursery rhymes and lullabies includes \"Are You Sleeping?,\" \"Hey Diddle Diddle,\" and \"All Through the Night.\" 15,000 first printing.",
        "Category": " Juvenile Fiction , Nursery Rhymes",
        "Publisher": "Tiger Tales",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Tidings of Great Joy",
        "Authors": "By Brown, Sandra",
        "Description": "Ria Lavender is the last woman in the world to be swept away by a smooth line and a seductive smile. Talented, sophisticated, and determined, she's carved out a place for herself in the most prestigious architectural firm in the city. And she's just beginning to savor the fruits of her success when she meets a man who will change everything.Mayor-Elect Taylor MacKensie is handsome, charming, and charismatic. Still, Ria never imagines that she'll leave a Christmas party with him, or that, caught up in the magic of a snowfall and a bottle of champagne, she'll give in to desire. But the next morning she faces the stunning truth: she's slept with a man she barely knows. And that's not the only surprise in store: eight weeks later, Ria knows she's carrying Taylor Mackensie's child.Desperate to spare her baby the pain and stigma of illegitimacy, Ria makes the only decision she can. Somehow she must persuade Taylor MacKensie to agree to a temporary marriage. Yet how do you propose marriage to a relative stranger? How do you tell him you're carrying his child? And how do you react when he meets your news with anger and disbelief?Within hours, Taylor's outrage cools and he insists that they marry immediately. Suddenly Ria is sharing his house, his name, and something infinitely more dangerous to her heart...a tenderness she never expected, a passion she can't seem to control. But afraid that Taylor's motives have no more to do with protecting his career - and his baby - than with his feelings for her, Ria will try her best to keep her distance...until the day tragedy strikes and teaches them both a lesson in miracles - and love.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Gold Miners & Guttersnipes: Tales of California",
        "Authors": "By Twain, Mark and Chowder, Ken",
        "Description": "Mark Twain's legendary insight and wit shine throughout this new selection of his writings, the first to focus on California. As a young man, the celebrated author ofHuckleberry Finn, Tom Sawyer, and other classics spent the mid-1860s in California. In this collection of essays, newspaper articles, fiction, speeches, and letters, Twain presents his notoriously unconventional views on a state booming in the wake of the gold rush. His wry humor and irreverent social commentary illuminate everything from fashion, politics, and art to earthquakes, religion, and urban crime. Drawn from hard-to-find sources as well as his ever-popular books,Gold Miners and Guttersnipes: Tales of California by Mark Twain is a fresh and distinctive assortment by one of America's favorite authors.",
        "Category": " Literary Collections , Essays",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Hawaii (Eyewitness Travel Guides)",
        "Authors": "By Friedman, Bonnie, Wood, Paul",
        "Description": "",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "DK Travel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "The Pledge: One Nation Under God",
        "Authors": "By Murray, William J. and Akin, Todd (FRW)",
        "Description": "LEARN THE TRUE HISTORY OF RELIGIOUS FREEDOM IN AMERICA              AND WHAT YOU CAN DO TO PROTECT THE PLEDGE OF ALLEGIANCE! Atheist Michael Newdow is determined to remove \"under God\" from the Pledge of Allegiance. His allies in this battle are members of the 9th Federal Court of Appeals in San Francisco, the American Civil Liberties Union, and anti-Christian forces.America  was founded on Christians principles, and our system of government is based upon the belief that we are a nation \"under God.\" Our rights come from God, not from government.Learn what the Founding Fathers  believe about God and government-and why the idea of \"separation of church and state\" is nothing more than a myth created by one Supreme Court decision in 1947. Yet, that one decision has result in dozens of ill-informed rulings that have undetermined religious freedom and exalted secularism as the state-protected religion in America.The attack on the Pledge is simply one part of this ongoing war against religious freedom in America-a war waged by Newdow, the ACLU, and others.This book shows you how you can fight back against Newdow and the anti-Christians forces in the ACLU. WE must take back our nation from the secularists who seek to deny religious liberty!",
        "Category": " Religion , Religion, Politics & State",
        "Publisher": "Living Ink Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "On the Move (Minipedia)",
        "Authors": "By Philip Wilkinson",
        "Description": "",
        "Category": "",
        "Publisher": "Publisher Unknown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Cockroaches of Stay More",
        "Authors": "By Harington, Donald",
        "Description": "Squire Sam Ingledew--fighter, philosopher, and leader to his fellow cockroaches--presides bashfully over his band in the Ozark Mountains of Arkansas",
        "Category": " Fiction , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Final Appeal",
        "Authors": "By Scottoline, Lisa",
        "Description": "Grace Rossi is starting over after a divorce, and a part-time job with a federal appeals court sounds perfect. But she doesn't count on being assigned to an explosive death penalty appeal. Nor does she expect ardor in the court in the form of an affair with the chief judge. Then Grace finds herself investigating a murder, unearthing a secret bank account and following a trail of bribery and judicial corruption that's stumped even the FBI. In no time at all, Grace under fire takes on a whole new meaning.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Power, Rights, and Poverty: Concepts and Connections",
        "Authors": "By Alsop, Ruth (EDT)",
        "Description": "While the terms 'power' and 'rights' are increasingly incorporated into the language of development agencies they have yet to fully permeate the practice of poverty reduction. Acknowledging that this partly results from a lack of clarity over the concepts of power and rights and partly from questions of how to operationalize these ideas, the World Bank and the UK Department for International Development co-sponsored a series of short papers for focusing on enhancing understanding of the relationships between power, rights, and poverty reductions.Following discussion during a two day working meeting, this publication brings together the edited papers, along with a selection of supplementary materials. A first series of papers addresses competing definitions and conceptual issues around power and rights, illustrating these with experiences observing and applying the concepts in practice in different countries. Following this, papers address topics aimed at helping development practitioners to apply these concepts to their work. Part II contains the supplemental materials, including a summary of the major theoretical conceptualizations of power, and an overview of the literature on power and rights. Prepared by leading thinkers on the topics of power and rights these materials offer both development professionals and students of development studies succinct summaries of the relationship between theory and practice.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "World Bank Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "A lonely place to die: A novel of suspense",
        "Authors": "By Ebersohn, Wessel",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Whip Hand",
        "Authors": "By Francis, Dick",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "Larousse's French- English, English-French Dictionary (English and French Edition)",
        "Authors": "By Dubois, Marguerite-Marie",
        "Description": "",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Euripides I: Alcestis, The Medea, The Heracleidae, Hippolytus (The Complete Greek Tragedies)",
        "Authors": "By Euripides, Grene, David (EDT), and Lattimore, Richmond (EDT)",
        "Description": "In nine paperback volumes, the Grene and Lattimore editions offer the most comprehensive selection of the Greek tragedies available in English. Over the years these authoritative, critically acclaimed editions have been the preferred choice of over three million readers for personal libraries and individual study as well as for classroom use.",
        "Category": " Poetry , Ancient & Classical",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1955"
        }
    },
    {
        "Title": "Dark Paradise: A Novel",
        "Authors": "By Hoag, Tami",
        "Description": "“Without a doubt . . . one of the most intense suspense writers around.”—Chicago Tribune New Eden, Montana, is a piece of heaven on earth where one woman died in her own private hell. Now it’s up to ex-court reporter Marilee Jennings to decipher the puzzle of her best friend’s death. But someone has a stake in silencing her suspicion. Someone with secrets worth killing for—and the power to turn this beautiful haven into a . . . dark paradise And as Mari digs deeper beneath New Eden’s picture-perfect exterior, finding the truth is suddenly no longer a matter of justice. It’s her only hope of staying alive.",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Concise Dictionary of Literary Terms (McGraw-Hill Paperbacks)",
        "Authors": "By Shaw, Harry",
        "Description": "Defines, discusses, and illustrates approximately one thousand terms dealing with linguistics as well as literary forms, styles, and classifications",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1976"
        }
    },
    {
        "Title": "Kramer vs. Kramer",
        "Authors": "By Corman, Avery",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "December",
            "Year": "1979"
        }
    },
    {
        "Title": "Battle for the Planet of the Apes",
        "Authors": "By Gerrold, David and Niven, Larry",
        "Description": "",
        "Category": "",
        "Publisher": "Award",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Prime Witness (A Paul Madriani Novel)",
        "Authors": "By Martini, Steve",
        "Description": "A series of bizarre murders leads to the arrest of a prime suspect and sparks the most explosive trial in lawyer Paul Madriani's career. By the author of Compelling Evidence. Reprint.",
        "Category": " Fiction , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "THE QUEEN AND I",
        "Authors": "By Sue Townsend",
        "Description": "",
        "Category": "",
        "Publisher": "Mandarin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Star: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "Young, innocent and strikingly beautiful Crystal Wyatt was an outcast, envied and  resented by all but her devoted father, with whom she shared a deep love for their  remote California ranch. When her father dies, Crystal is alone and unprotected.  Devastating events shake the once peaceful valley. With nothing but her dreams, her  beauty, and her awe-inspiring voice, Crystal escapes to embark on the career that  will ultimately make her a star. But stardom itself is shadowed by danger and violence  and haunted by a memory that must be resolved before Crystal can find happiness and  peace.",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "The Murder Book (Alex Delaware)",
        "Authors": "By Kellerman, Jonathan",
        "Description": "In seventeen consecutive bestselling novels, Jonathan Kellerman has distinguished himself as the master of the psychological thriller. Now in Kellerman’s most compelling and powerful novel yet, L.A. psychologist-detective Alex Delaware confronts a long-unsolved murder of unspeakable brutality—an ice-cold case whose resolution threatens his survival, and that of longtime friend, homicide detective, Milo Sturgis.The nightmare begins when Alex receives a strange package in the mail with no return address. Inside is an ornate album filled with gruesome crime scene photos—a homicide scrapbook entitled The Murder Book. Alex can find no reason for anyone to send him this compendium of death, but when Milo views the book, he is immediately shaken by one of the images: a young woman, tortured, strangled, and dumped near a freeway ramp.This was one of Milo’s first cases as a rookie homicide cop: a vicious killing that he failed to solve, because just as he and his training partner began to make headway, the department closed them down. Being forced to abandon the young victim tormented Milo. But his fears prevented him from pursuing the truth, and over the years he managed to forget. Or so he thought.Now, two decades later, someone has chosen to stir up the past. As Alex and Milo set out to uncover what really happened twenty years ago, their every move is followed and their lives are placed in jeopardy. The relentless investigation reaches deep into L.A.’s nerve-centers of power and wealth—past and present. While peeling back layer after layer of ugly secrets, they discover that the murder of one forgotten girl has chilling ramifications that extend far beyond the tragic loss of a single life.A classic story of good and evil, sacrifice and sin, The Murder Book is a gripping page-turner that illuminates the darkest corridors of the human mind. It is a stunning tour de force.From the Hardcover edition.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Her Mother's Daughter",
        "Authors": "By French, Marilyn",
        "Description": "Anastasia, determined to break her inherited legacy of grief, becomes a successful photographer, but at age forty she finds herself emotionally destitute, like her own mother, and estranged from her children",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "The Lasko Tangent",
        "Authors": "By Patterson, Richard North",
        "Description": "\"Mr. Patterson is a natural storyteller....Fast moving...A handsome job.\"THE NEW YORK TIMESWilliam Lasko is a self-made millionaire who's got an eye for wealth and influence, the ear of the president, and a talent for using both to get what he wants. Now the Economic Crimes Commission wants the corrupt, untouchable Lasko brought down--and U.S. Attorney Christopher Paget is tapped to take on the job. To gather enough evidence to nail Lasko without alienating the White House, Paget's got to go by the book. But Lasko makes his own rules. And eliminating enemies is William Lasko's golden one....",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1985"
        }
    },
    {
        "Title": "O Is for Outlaw (Kinsey Millhone Mysteries (Paperback))",
        "Authors": "By Grafton, Sue",
        "Description": "Once Mickey Magruder was a cop with a wild streak. And Kinsey Millhone was a younger cop who adored and married him. Then Mickey was implicated in a fatal beating, and Kinsey walked out. Now, fourteen years later, she comes face-to-face with those tragic years and Mickey's harrowing downward spiral after he lost the job he loved--and the marriage he loved a little less.Mickey lies dying in an L.A. hospital. Trying to find out how Mickey got there, Kinsey uncovers evidence that he was innocent of the beating charge. But as she searches through the lives that swirled around Mickey's--lives gone wrong and lives gone well--Kinsey must also search the blind spots of her own life, including one that hides a killer.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "M is for Malice (A Kinsey Millhone Mystery, Book 13)",
        "Authors": "By Grafton, Sue",
        "Description": "At the request of the Malek family, owners of a multi-million-dollar construction company, private detective Kinsey Millhone is hired to trace the missing brother of the troubled and embattled clan, eighteen years after he had vanished without a trace",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Journey: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "Everyone knows Madeleine and Jack Hunter. Maddy is an award-winning TV anchorwoman. Jack is the head of her network. To the world, theirs is a storybook marriage. But behind the doors of their lush Georgetown home a different story emerges.Maddy has always tried to deny Jack’s subtle put-downs, control, and jealousy. She has no bruises, only the daggers of fear, humiliation, and isolation — as powerful as the gun or the fist, the wounds as deep. It seems impossible that a woman the nation idolizes lives in degradation and fear. Maddy’s secrets are well kept, even from herself.Maddy’s healing begins when she joins the First Lady’s Commission on Violence Against Women. There, she hears eerily familiar stories from terrified wives and girlfriends. And there she comes to know Bill Alexander, a distinguished diplomat. Bill suspects that something is terribly wrong in Maddy’s marriage and begs her to open her eyes.As she takes the first steps toward freedom, a remarkable series of events unfolds ... a stranger from Maddy’s past reappears ... White House headlines bring the nation to a standstill ... and a devastating tragedy forces Maddy to realize how much has been taken from her. Faced with the most difficult choice of her life, Maddy finds a strength she never knew she had and a gift that will change her life forever.With wisdom and compassion, bestselling novelist Danielle Steel reminds us that no one is exempt from the effects of abuse, in its subtlest forms. But at its core, Journey is a book about hope, about change, and about daring to be free.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Mindbend (A Medical Thriller)",
        "Authors": "By Cook, Robin",
        "Description": "Future doctor Adam Schonberg loved his wife. That was why he took a job with the giant drug firm Arolen, for the money he needed for their coming baby.   His wife, Jennifer, felt she would get the best of care at the Julian Clinic as her pregnancy progressed.   It seemed a happy coincidence that the Julian Clinic was owned by Arolen...until Adam Schonberg slowly began to suspect the terrifying truth about this connection...and about the hideous evil perpetrated on the wife he loved by the doctor she helplessly trusted...",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The Fourth Deadly Sin",
        "Authors": "By Sanders, Lawrence",
        "Description": "In the fourth best-seller of the series, former policeman Ed Delaney takes on the sensationalized case of a brutally murdered psychiatrist, investigating the six suspects who had been his patients. By the author of Guilty Pleasures. Reissue.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1986"
        }
    },
    {
        "Title": "Q is for Quarry (A Kinsey Millhone Mystery, Book 17)",
        "Authors": "By Grafton, Sue",
        "Description": "She was a \"Jane Doe,\" an unidentified white female whose decomposed body was discovered near a quarry off California's Highway 1. The case fell to the Santa Teresa County Sheriff's Department, but the detectives had little to go on. The woman was young, her hands were bound with a length of wire, there were multiple stab wounds, and her throat had been slashed. After months of investigation, the case remained unsolved. That was eighteen years ago. Now, the two men who found the body, both nearing the end of long careers in law enforcement, want one last shot at the case. Old and ill, they need someone to do the legwork for them, and they turn to Kinsey Millhone. They will, they tell her, find closure if they can just identify the victim. Kinsey is intrigued with the challenge and agrees to work with them. But revisiting the past can be a dangerous business, and what begins with the pursuit of Jane Doe's real identity ends in a high-risk hunt for her killer.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Moviola",
        "Authors": "By Kanin, Garson",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1980"
        }
    },
    {
        "Title": "Freedoms Promise (Promises Series , No 3)",
        "Authors": "By Hellman, Suzanne Drentlaw",
        "Description": "Tabitha, a young widow, leaves England for America to avoid being dependent on her late husband's family",
        "Category": " Fiction , Religious",
        "Publisher": "Chariot Victor Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Wonder Worker: A Novel (St. Benet's Trilogy)",
        "Authors": "By Howatch, Susan",
        "Description": "Young, lonely, and insecure, Alice Fletcher is on the verge of emotional collapse when she stumbles into St. Benet's Church to dodge the London drizzle. There, she witnesses a group of gifted healers led by the charismatic Nicholas Darrow. Gaining refuge at last, Alice is drawn--inexorably, seductively--into the complex network of relationships at St. Benet's healing center--as she falls immediately, dangerously, in love with Darrow himself. Yet Darrow and his cutting-edge clergy are not all what they seem. And while Nicholas's dazzling powers now threaten to ruin all he attempts to save--including his own disturbed marriage--Alice's devotion to him deepens. Then a  devastating tragedy transports her to the shocking center of truth. Yet fueled by her love for Nicholas and a boldly emerging intuition, she will hold together the lives spinning wildly out of control--as she herself is transformed forever.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Bleeding the Patient: The Consequences of Corporate Health Care",
        "Authors": "By Himmelstein, David U., Woodhandler, Steffie, and Hellander, Ida",
        "Description": "",
        "Category": " Medical , Health Care Delivery",
        "Publisher": "Common Courage Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Degree of Guilt",
        "Authors": "By Patterson, Richard North",
        "Description": "Mary Carelli, one of the most powerful women in TV journalism, is charged with the murder of Mark Ransom, America's most eminent novelist. Her attorney, Christopher Paget, sets out to shock the courtroom with revelations about Ransom as a twisted sexual predator. But as the trial unfolds, it is Paget who will be surprised...by Mary's secret motive for murder...by evidence that Mary is lying...by a woman prosecutor who believes Mary invented the story of rape...and by an enigmatic judge with an agenda of her own....",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Love Pavilion",
        "Authors": "By Scott, Paul",
        "Description": "A British intelligence officer searches the jungles of Burma for a guerrilla leader and falls in love with a Eurasian prostitute",
        "Category": " Fiction , General",
        "Publisher": "Carroll & Graf Publishers",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "SUNDOG",
        "Authors": "By Harrison, Jim",
        "Description": "Recovering from a fall down the face of a three-hundred-foot dam in South America, Robert Corvus Strang, a self-educated foreman who works on giant dam projects, recalls his hard but exhilarating life",
        "Category": " Fiction , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "7.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "McNally's Secret (Archy McNally)",
        "Authors": "By Sanders, Lawrence",
        "Description": "Playful, seductive, irresistible--this bestselling masterwork of fatal passion  and greed introduces Lawrence Sanders's most wickedly charming sleuth.  Meet Archy  McNally, a freewheeling playboy who specializes is \"Discreet Inquires\" for the rich and  not-so-discreet.  Beneath the glaring sun of Palm Beach--and behind the lowest crimes of  high society--McNally is paid to keep family skeletons in the closet.  But when it comes  to sex and scandal, McNally has a few secrets of his own...",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Agent of Vega (Permabook, No. M-4242)",
        "Authors": "By James H. Schmitz -",
        "Description": "",
        "Category": "",
        "Publisher": "Permabook",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "Richard Scarry's First Little Learners Colors",
        "Authors": "By Scarry, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "J. B. Communications, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Aldair Master of Ships",
        "Authors": "By Barrett, Neal",
        "Description": "",
        "Category": "",
        "Publisher": "DAW",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1977"
        }
    },
    {
        "Title": "The Merry Wives of Windsor (Dover Thrift Editions: Plays)",
        "Authors": "By Shakespeare, William",
        "Description": "According to legend, Queen Elizabeth I was so delighted with the character of Sir John Falstaff in Henry IV, Parts I and II, that she commanded Shakespeare to create a romantic comedy depicting the jolly old rogue in love. The obedient playwright responded with The Merry Wives of Windsor, a lively and enduring farce that offers a humorous rebuff to lechery and hypocrisy.Falstaff, whose greed and vanity overwhelm his good sense, determines to seduce a pair of well-to-do country housewives. The portly knight meets his match among the gentlewomen of Windsor, however, who counter his every stratagem with witty maneuvers of their own that expose Sir John's tomfoolery to public mirth. Familiar Shakespearean themes and devices — romance, jealousy, disguises, and mistaken identities — enrich the plot, along with a sparkling cast of supporting characters, including rival wooers, informers, and witty go-betweens.This madcap romp has been a favorite of readers and playgoers for over 400 years. Students, teachers, and all lovers of literature and drama will appreciate this inexpensive edition of an ageless comic gem.",
        "Category": " Drama , Shakespeare",
        "Publisher": "Dover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2014"
        }
    },
    {
        "Title": "Midnight Runner (Sean Dillon)",
        "Authors": "By Higgins, Jack",
        "Description": "“Death is the midnight runner.” – Arab proverb       Higgins’ last novel, Edge of Danger, was “hugely entertaining,” said the Los Angeles Times. “The publisher describes it as a powerful thriller, and it’s no lie.” At its end, the murderous Arab/English Rashid family lay decimated – but not extinct. And that may have been Sean Dillon’s fatal error.      Her brothers killed one by one, Kate Rashid swears vengeance on all who have harmed her family. Never mind that they tried to assassinate the President of the United States, that villainy ran in their veins. They were her brothers, and her enemies would pay. British agent Sean Dillon…White House operative Blake Johnson…the President himself…their time was coming, and only she knew how – or when.      Brilliantly suspenseful, Midnight Runner is further proof that, in the words of the Associated Press, “when it comes to thriller writers, one name stands well above the crowd – Jack Higgins.”",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Corruption of Blood",
        "Authors": "By Tanenbaum, Robert K.",
        "Description": "When Congress reopens the investigation into the JFK assassination, Manhattan Assistant D.A. Butch Karp is assigned to the case, but as Karp and his team uncover dramatic new evidence, they become enmeshed in a web of conspiracy that reaches to the highest levels of government. Reprint.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Murder in the Smithsonian (Capital Crime Mysteries)",
        "Authors": "By Truman, Margaret",
        "Description": "\"Nonstop action and a brillianly evocative setting make this another winner!\"BOOKLISTDr. Lewis Tunney, a brilliant historian who had stumbled onto an international art scandal, was brutally murdered in front of two hundred guests at an elegant party at the Smithsonian. When his fiancee, Heather McBea, flies in from Scotland to learn more, Mac Hanrahan, the captain in charge of the case, takes a heated interest in her. And when two more murders are committed, Hanrahan has reason to worry about Heather's sleuthing. But Heather is stubborn and insists on going her own way--right into the arms of a killer....",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Dale Brown's Dreamland",
        "Authors": "By Brown, Dale and DeFelice, Jim",
        "Description": "Hidden in the Nevada desert is America’s most advanced aerospace weapons testing facility. Dreamland is the place where the nation’s top minds come to develop artillery and aircraft that push beyond the cutting edge. And where the Air Force’s top guns come to test them—on the front lines of a new era in warfare…The fiasco of a spy’s infiltration has the Pentagon looking for an excuse to close Dreamland down. To clean up the mess—and save Dreamland from the Congressional chopping block—Lt. Colonel William Tecumseh “Dog” Bastian is sent in. He’s just the guy to shake things up…and does when a situation erupts in Somalia. Into a hotter-than-hot war zone, he sends his own daughter—the pilot of a Megafortress bomber—and a high-tech, unmanned flight system that could make or break the future of Dreamland…",
        "Category": " Fiction , War & Military",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Rainmaker",
        "Authors": "By Grisham, John",
        "Description": "It's summer in Memphis.  The sweat is sticking to Rudy Baylor's shirt and creditors are nipping at his heels.  Once he had aspirations of breezing through law school and punching his ticket to the good life.  Now he doesn't have a job or a prayer...except for one: an insurance dispute that leaves a family devastated and opens the door for a lawsuit, if Rudy can find a way to file it.By the time Rudy gets to court, a heavyweight corporate defense team is there to meet him. And suddenly he's in over his head, plunged into a nightmare of lies and legal maneuverings.  A case that started small is exploding into a thunderous million-dollar war of nerves, skill and outright violence--a fight that could cost one young lawyer his life, or turn him into the biggest rainmaker in the land....",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Dell Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "You and Your Assets: A Practical Guide to Financial Management and Estate Planning",
        "Authors": "By Dunetz, Martin R.",
        "Description": "Everyone has assets to protect.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Madison Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Lord Jim (Riverside Editions)",
        "Authors": "By Conrad, Joseph",
        "Description": "",
        "Category": " Fiction , Literary",
        "Publisher": "Wadsworth Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "The Mother-in-Law Diaries",
        "Authors": "By Dawson, Carol",
        "Description": "From Carol Dawson, \"a master of the light, suspenseful touch\" (Chicago Tribune), comes a bittersweet novel about the \"other woman\" in every marriage....  the Mother-in-Law Diaries  Lulu Penfield has had more mothers-in-law than most people could have in three lifetimes. From the maven of household hints to the glacially polite New Zealander to a reputed witch who practices voodoo on an old Raggedy Ann doll, each one of her husbands' mothers has been a singularly memorable participant in Lulu's colorful marital misadventures.  Now Lulu herself has become a mother-in-law...and as the torch is passed, Lulu cracks away at the ageless mystery of bonding with her own son's wife -- and makes some surprising discoveries as she goes.  \"Alternately hilarious and gut-wrenching\" (The Austin Chronicle), the Mother-in-Law Diaries rings true for anyone who has ever said \"I do\" -- and who didn't realize that she was marrying not one person, but two.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Gracie (Medallion Editions for Young Readers)",
        "Authors": "By Weyn, Suzanne",
        "Description": "The only tie-in book to the summer family movie about a 16-year-old girl who fought for and won the right for girls everywhere to play competitive soccer, inspired by one family's real story.Set in 1978 in South Orange, New Jersey, Gracie tells the moving story of 16-year-old Gracie Bowen (Carly Schroeder of TV's Lizzie McGuire), whose middle-class family life revolves almost entirely around soccer. Tragedy unexpectedly strikes when Gracie's older brother, star of the high school varsity team and her closest confidant, is killed in a drunk-driving accident. Wracked with grief over her family's loss, Gracie decides to fill the void left on her brother's team by petitioning the local school board to allow her to play in the boys' soccer league.At first, no one can understand what Gracie is up to, not her mom (Elisabeth Shue), her former soccer star dad (Dermot Mulroney), the team or school officials. Everyone warns Gracie that pursuing her dream is a waste of time—that soccer is a sport for boys and boys only. Undeterred, Gracie finds reserves of strength she never knew existed, and persists in changing everyone's beliefs in what she is capable of, including her own.Based on true events in the lives of the Shue family (producer and co-star Andrew Shue, Academy Award®-nominated actress Elisabeth Shue and their family), Gracie is an exciting and emotional sports story that marks the dramatic feature debut of Academy Award®-winning director Davis Guggenheim (An Inconvenient Truth). This young adult novel includes an eight-page color photo section and a Q&A with Andrew Shue and Elisabeth Shue about the real-life story behind the film. 8-page color photo insert.",
        "Category": " Juvenile Fiction , Sports & Recreation , Soccer",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The Elegant Gathering of White Snows: A Novel",
        "Authors": "By Radish, Kris",
        "Description": "Eight Women on a Journey That Will Change Their Lives as Lovers, Wives, Mothers, Daughters, FriendsJust after midnight in a small town in Wisconsin, eight women begin walking together down a rural highway. Career women, housewives, mothers, divorcées, and one ex–prom queen, they are close friends who have been meeting every Thursday night for years, sharing food, wine, and their deepest secrets. But on this particular Thursday, Susan, Alice, Chris, Sandy, Gail, Mary, Joanne, and Janice decide to disappear from their own lives.Their spontaneous pilgrimage attracts national attention and inspires other women from all across the country. As the miles fall away and the women forge ahead on their backroads odyssey—leaving small miracles in their wake—each of their histories unfolds, tales of shattered dreams and unexpected renewal, of thwarted love affairs and precious second chances.In luminous, heartwarming prose, Kris Radish deftly interweaves the women’s intimate confessions into the story of their brave, history-making walk. A breathtaking achievement, The Elegant Gathering of White Snows tells an incomparable tale of friendship and love, loss and liberation.",
        "Category": " Fiction , Literary",
        "Publisher": "Bantam Dell Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "The Young Dancer",
        "Authors": "By Bussell, Darcey and Linton, Patricia",
        "Description": "Progressing from simple steps and basic positions, to the barre, center work, and pointes, an instructive text and step-by-step photographs from the Royal Ballet School in London offer sound advice to young dance enthusiasts.",
        "Category": " Juvenile Nonfiction , Performing Arts , Dance",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "In His Light: A Path Into Catholic Belief",
        "Authors": "By Rev. William A.  Anderson",
        "Description": "",
        "Category": "",
        "Publisher": "Wm. C. Brown Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "1001 Things Your Mother Told You: (and you should have listened to!)",
        "Authors": "By Pentz, Croft M.",
        "Description": "This collection of homespun wisdom offers mother-approved proverbial sayings on over 180 topics covering body, mind, and soul. Marriage, parenting, driving, faith, character . . . Pentz has collected maternal advice on a wide range of topics, both lighthearted and serious. A great gift for graduates! After all, “an ounce of mother is worth a pound of clergy.”",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Apocalipstick: A Novel",
        "Authors": "By Margolis, Sue",
        "Description": "From the author who brought you Spin Cycle and Neurotica comes a hilarious new novel about falling in love, hating your job, and getting what you want out of life---without ever mussing your lipstick!When it comes to men, beauty columnist Rebecca Fine always seems to be on the scruffy end of the mascara wand. But all that changes the morning she meets Max Stoddart, her new colleague at the Daily Vanguard. With his upscale suit, Hugh Grant hair, and obscenely sexy good looks, he’s a single woman’s dream come true. Finally, her grandmother can stop surfing the Net for eligible Jewish males. But is Max the catch of the decade---or just a major babe magnet? Meanwhile, Rebecca’s old high school nemesis has resurfaced, a former blond bombshell called Lipstick who is now engaged to Rebecca’s widowed dad. And it’s good-bye to articles on toe cleavage when a hot tip sweeps Rebecca to the center of the Paris cosmetics world, where a miracle anti-wrinkle cream is about to be launched. That is, until she blows the whistle on a scandal that could set the beauty business---and the future of world peace---reeling. Will Rebecca win the recognition---not to mention the Pulitzer---she yearns for...and get the man of her dreams?  Stay tuned.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Delta",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Good Harbor: A Novel",
        "Authors": "By Diamant, Anita",
        "Description": "Anita Diamant, whose rich portrayal of the biblical world of women illuminated her acclaimed international bestseller The Red Tent, now crafts a moving novel of contemporary female friendship.Good Harbor is the long stretch of Cape Ann beach where two women friends walk and talk, sharing their personal histories and learning life's lessons from each other. Kathleen Levine, a longtime resident of Gloucester, Massachusetts, is maternal and steady, a devoted children's librarian, a convert to Judaism, and mother to two grown sons. When her serene life is thrown into turmoil by a diagnosis of breast cancer at fifty-nine, painful past secrets emerge and she desperately needs a friend. Forty-two-year-old Joyce Tabachnik is a sharp-witted freelance writer who is also at a fragile point in her life. She's come to Gloucester to follow her literary aspirations, but realizes that her husband and young daughter are becoming increasingly distant. Together, Kathleen and Joyce forge a once-in-a-lifetime bond and help each other to confront scars left by old emotional wounds.",
        "Category": " Fiction , Family Life",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    }
]