[
    {
        "Title": "Caroline Zucker Makes a Big Mistake (Caroline Zucker Series)",
        "Authors": "By Bradford, Jan and Ramsey, Marcy Dunn (ILT)",
        "Description": "After insisting that the redecoration of her bedroom include wallpaper with lavender daisies and yellow roses, nine-year-old Caroline changes her mind but cannot figure out what to do about her colorful mistake.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Seizing the Enigma: The Race to Break the German U-Boat Codes, 1939-1943",
        "Authors": "By Kahn, David",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Secret War: Personal Accounts of the secret heroes of World War II",
        "Authors": "By Paterson, Michael",
        "Description": "This title offers a comprehensive look at the undercover war, revealing just how much of WWII was won away from the battlefields and how each side desperately tried to get into the 'mind set' of their enemies' code makers.From the British cryptologists to the Navajo Indians whose codes helped win the war against Japan, this book reveals the stories of extraordinary people and their chance finds, lucky accidents, dogged determination and moments of sheer brilliance, to expose how the war was really won.It includes an intriguing glimpse of the early history of the computer - its spectacular uses and subsequent development. It features vivid first-hand accounts from the staff of Bletchley Park, French and Dutch resistance fighters, the American secret agents and members of the Services Liaison Unit who passed on vital coded information to field commanders. It also includes a 16 page plate section with rare archive photographs.",
        "Category": " History , Military , World War II",
        "Publisher": "David & Charles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Hide This French Book",
        "Authors": "By Roustang-Stoller, Eve-Alice",
        "Description": "It's not the French you learned in school. Learn the lingo on Love,  Sex, Extreme Sports, Video Games, Fashion, Body and Gross Bodily  Functions, Internet, Text Messaging, Gossip, Entertainment, and  Partying. Also exposed in Hide This Book are hilarious language mishaps,  social trends, and cool cultural features. Thermometers indicate how  “hot” language is, so you know when an expression is totally offensive,  completely inappropriate and downright nasty! Hear the foreign language  online, or download the audio to you iPod® or MP3 player. Entertaining  as well as enlightening, this is one language reference you'll enjoy  reading cover to cover.",
        "Category": " Reference , Dictionaries",
        "Publisher": "Hide This",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Best-Laid Plans: How Government Planning Harms Your Quality of Life, Your Pocketbook, and Your Future",
        "Authors": "By O'Toole, Randal",
        "Description": "Drawing on 30 years of experience reviewing hundreds of government plans, Randal O'Toole shows that, thanks to government planners, American cities are choked with congestion, major American housing markets have become unaffordable, and the cost of government infrastructure is spiraling out of control. The book makes the case for repeal of federal planning laws and closure of government planning offices. Every American who worries about the insidious growth of the Nanny State must read this book.",
        "Category": " Political Science , American Government , General",
        "Publisher": "Cato Institute",
        "Price Starting With ($)": "5.86",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Watching the English: The Hidden Rules of English Behaviour",
        "Authors": "By Fox, Kate",
        "Description": "The hardback bestseller now in paperback: 'An entertaining and clever book. Do read it.' -",
        "Category": " Social Science , Anthropology , Cultural & Social",
        "Publisher": "Hodder & Stoughton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Dream of Orchids",
        "Authors": "By Whitney, Phyllis A.",
        "Description": "Laurel York has dreamed of this reunion with her father, the famous writer Clifton York, for years. And when she follows him down to the exotic Florida Keys, both love and evil meet her in the form of handsome Marcus O'Neill, who welcomes her, but her two suspicious stepsisters do not. Then there is Clifton York himself, the strange man they all love, and the secret buried treasure that has lain undetected for years. Only the prize orchids waiting in the greenhouse hold the key to a life that Laurel has only dreamed about--or a nightmare that can only end in murder...",
        "Category": "",
        "Publisher": "Fawcett Crest",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "Christmas Rogues",
        "Authors": "By Potter, Patricia Ann, Jarrett, Miranda, and Mills, Anita",
        "Description": "Three holiday romances follow the stories of a vengeance-seeking drifter and the Kansas rancher he meets, a former Union officer who is despised by everyone except one special woman, and a merchant's son who challenges his father. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Anita Mills",
        "Price Starting With ($)": "5.74",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Jake'S Angel (Historical, 522)",
        "Authors": "By Foster, Nicole",
        "Description": "",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Lady Of The Knight",
        "Authors": "By Phillips, Tori",
        "Description": "Lady Of The Knight by Tori Phillips released on Jul 23, 1999 is available now for purchase.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The Potty Book for Girls (Hannah & Henry Series)",
        "Authors": "By Capucilli, Alyssa Satin, Stott, Dorothy M., and Stott, Dorothy M. (ILT)",
        "Description": "Every little girl's graduation from diapers to the potty is always a very important moment--and one to make both parents and toddlers proud! In The Potty Book, Hannah needs to have her diapers changed so she can go out and play. Then mom and dad bring home a big box, and Hannah is anxious to open it up and see what's inside. Is it a rocking chair? A bed for Teddy? No, it's a potty--which means that it's time for Hannah to graduate from her diapers. This gentle and humorous little story is charmingly illustrated and told in verse. Little girls will enjoy looking at the pictures and having the story read to them. Meanwhile, they'll start getting the idea that it's time for them to grow up, exactly like Hannah. So that at last, they'll be able to say--\"I'm off the potty!\"",
        "Category": " Juvenile Fiction , Health & Daily Living , Toilet Training",
        "Publisher": "Sourcebooks Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Wait Till Helen Comes: A Ghost Story",
        "Authors": "By Hahn, Mary Downing",
        "Description": "Beware of Helen...Heather is such a whiny little brat. Always getting Michael and me into trouble. But since our mother married her father, we're stuck with her...our \"poor stepsister\" who lost her real mother in a mysterious fire.But now something terrible has happened. Heather has found a new friend, out in the graveyard behind our home -- a girl named Helen who died with her family in a mysterious fire over a hundred years ago. Now her ghost returns to lure children into the pond...to drown! I don't want to believe in ghosts, but I've followed Heather into the graveyard and watch her talk to Helen. And I'm terrified. Not for myself, but for Heather...",
        "Category": " Juvenile Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Bride Of Spring (Seasons' Brides) (Historical, 514)",
        "Authors": "By Archer, Catherine",
        "Description": "",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Baby Animals (So Tall Board Books)",
        "Authors": "By Fujikawa, Gyo",
        "Description": "Pictures and describes the playful behavior of puppies, lion cubs, lambs, piglets, and other young animals",
        "Category": " Juvenile Fiction , Animals , General",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1963"
        }
    },
    {
        "Title": "Lady Of The Keep (Harlequin Historical, No 510).",
        "Authors": "By Schulze, Sharon",
        "Description": "",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "The Bonny Bride (Harlequin Historical Series, No. 503)",
        "Authors": "By Hale, Deborah",
        "Description": "The Bonny Bride by Deborah Hale released on Feb 23, 2000 is available now for purchase.",
        "Category": "",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Ida B.: A Novel",
        "Authors": "By Miller, Karen E. Quinones",
        "Description": "Ida B. Wells-Barnett Tower. The place held such promise when it was built in the late 1970s. It was Harlem's hope for a new beginning -- an affordable, safe residence for people who couldn't afford to live downtown. But that was more than twenty-five years ago, before the devastating crack scourge hit.   But the residents of Ida B. are resilient. They've built their own community and they look out for one another to the best of their abilities. Neighbors may argue, and even fight, but whenever one of them is in trouble, the whole building rallies around.  Twenty-five-year-old Brenda Carver is a welfare mother of four children who longs to be a writer; Rosa Rivera is an aspiring actress who will let nothing stand in the way of her career; Sharif Goldsby is a political activist determined to change the world, starting with Harlem and the Ida B. There's also Miss Jackie, the middle-aged, back-stabbing gossip; Vincent, the former bank robber turned scam artist; Mrs. Harris, the elderly neighborhood fence; and high school honor student Ricky, who hopes to be one of the scramblers on the corner -- hawking crack to passersby.  When a building resident kills herself and two of her children, the tenants make a collective vow to care for her surviving child.  But that's just the beginning of the tragedies facing the residents of the Ida B. A shocking crime occurs in the building, and everyone becomes a suspect. With accusations flying, the tight community of the Ida B. begins to collapse under the strain. And, to top it all, they learn that their home of more than twenty years is about to be torn down.   As the search for the killer intensifies, unsung heroes step forward -- at great personal risk -- to right the wrongs that have been done. In Karen E. Quinones Miller's world, the people who stand out are the people who survive, and go on, against all odds, to share their wisdom and find their dreams. In a modern take on the classic sentiment, \"There's no place like home,\" Ida B. affirms that home is a place we love, even when it is less than perfect.",
        "Category": " Fiction , Psychological",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "System analysis techniques,",
        "Authors": "By Couger, J. Daniel.",
        "Description": "",
        "Category": "",
        "Publisher": "Wiley",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Our Kind: A Novel in Stories",
        "Authors": "By Walbert, Kate",
        "Description": "00  From the award-winning author of The Gardens of Kyoto comes this witty and incisive novel about the lives and attitudes of a group of women -- once country-club housewives; today divorced, independent, and breaking the rules.  In Our Kind, Kate Walbert masterfully conveys the dreams and reality of a group of women who came into the quick rush of adulthood, marriage, and child-bearing during the 1950s. Narrating from the heart of ten companions, Walbert subtly depicts all the anger, disappointment, vulnerability, and pride of her characters: \"Years ago we were led down the primrose lane, then abandoned somewhere near the carp pond.\"  Now alone, with their own daughters grown, they are finally free -- and ready to take charge: from staging an intervention for the town deity to protesting the slaughter of the country club's fairway geese, to dialing former lovers in the dead of night.  Walbert's writing is quick-witted and wry, just like her characters, but also, in its cumulative effect, moving and sad. Our Kind is a brilliant, thought-provoking novel that opens a window into the world of a generation and class of women caught in a cultural limbo.  From the award-winning author of The Gardens of Kyoto comes this witty and incisive novel about the lives and attitudes of a group of women -- once country-club housewives; today divorced, independent, and breaking the rules.  In Our Kind, Kate Walbert masterfully conveys the dreams and reality of a group of women who came into the quick rush of adulthood, marriage, and child-bearing during the 1950s. Narrating from the heart of ten companions, Walbert subtly depicts all the anger, disappointment, vulnerability, and pride of her characters: \"Years ago we were led down the primrose lane, then abandoned somewhere near the carp pond.\"  Now alone, with their own daughters grown, they are finally free -- and ready to take charge: from staging an intervention for the town deity to protesting the slaughter of the country club's fairway geese, to dialing former lovers in the dead of night.  Walbert's writing is quick-witted and wry, just like her characters, but also, in its cumulative effect, moving and sad. Our Kind is a brilliant, thought-provoking novel that opens a window into the world of a generation and class of women caught in a cultural limbo.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Sleeping with Fear",
        "Authors": "By Hooper, Kay",
        "Description": "Fear has never been so close.…New York Times bestselling author Kay Hooper returns with a relentless thriller that brings her readers face-to-face with fear itself. In this terrifying new novel, a psychic special agent finds herself caught up in a tangled web of secrets, lies . . . and evil.Riley Crane woke up fully dressed, a gun under her pillow, and covered in blood. Even more frightening, she didn’t remember what happened the night before. In fact, she barely remembered the previous three weeks.An ex—army officer, now a federal agent assigned to the Special Crimes Unit, Riley was a chameleon–a clairvoyant who could blend in with her surroundings, be anyone or anything she chose to be. The SCU’s expert on the occult, she’d been sent to the beachfront cottage on Opal Island by her enigmatic chief, Noah Bishop, to investigate reports of dangerous occult activity. But that was three weeks ago. Now she’s awoken to discover that she’s got a sexy new man in her life and an unreliable memory, and that the clairvoyant abilities she’s always depended on to protect her are MIA. Worse yet, with SCU resources stretched thinner than ever before, Riley is alone and without backup, feeling her way through a deadly game of blindman’s buff, where no one around her is quite who or what they seem.  And a bizarre murder is only the first jarring reminder of how high the stakes really are.Bishop wants Riley off the case. So does powerful local D.A. Ash Prescott. Both her old retired army buddy Gordon Skinner and Sheriff Jake Ballard believe she can catch a vicious killer. But one of these four men knows exactly what’s going on in this coastal community, and that’s knowledge Riley desperately needs. For what Riley can’t remember is more than enough to cost her her  life. This time evil isn’t just closer than she thinks–it’s already there.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Get Dressed, Santa!",
        "Authors": "By dePaola, Tomie",
        "Description": "Prepared to take off in his jam-packed sleigh on Christmas Eve, Santa Claus realizes that he must answer the call of nature and hurriedly sheds his layers of red velvet, in a humorous and relatable die-cut board book for young readers.",
        "Category": " Juvenile Fiction , Health & Daily Living , Toilet Training",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Pawleys Island: A Lowcountry Tale",
        "Authors": "By Frank, Dorothea Benton",
        "Description": "The Lowcountry comes back to life with this brand-new novel from the New York Times bestselling author of Shem Creek.  When Becca Sims wanders into the beautiful seaside Gallery Valentine hoping to sell some of her watercolors, she has no idea her life is about to be transformed by the gallery's owner and his best friend. With the vivid, unforgettable characters, dreamy Lowcountry setting, and authentically brazen, compulsively readable Southern voice that have made her one of today's greatest storytellers, Dorothea Benton Frank delivers her most extraordinary novel yet.",
        "Category": " Fiction , General",
        "Publisher": "Berkley Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The demand for money: Theories and evidence",
        "Authors": "By Laidler, David E.W.",
        "Description": "",
        "Category": "",
        "Publisher": "Dun-Donnelley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Even Eagles Need A Push",
        "Authors": "By McNally, David",
        "Description": "",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "The Competition Solution: The Bipartisan Secret Behind American Prosperity",
        "Authors": "By London, Paul A.",
        "Description": "London, a visiting fellow at the American Enterprise Institute who served as deputy under-secretary of commerce for economics and statistics in the Clinton administration, argues that the prosperity of the 1990s was the result of political struggles over several decades that opened up markets and increased competition, rather than the changes in monetary or tax policy that most economists focus on. He contends that future prosperity will depend on maintaining competition, and shows how the lessons of the 1990s can be applied to break the local monopolies of the health care and education sectors. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Philosophy , Political",
        "Publisher": "Aei Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "With God On Our Side",
        "Authors": "By Martin, William C.",
        "Description": "The rise of the Religious Right is one of the most important political and cultural stories of our time. To many, the controversial movement threatens to upset the nation's delicate balance of religious and secular interests. To others, the Religious Right is valiantly struggling to preserve religious liberty and to prove itself the last, best hope to save America's soul. In With God on Our Side - the first balanced account of the impact of conservative Christians on post-war politics - William Martin paints a vivid and authoritative portrait of America's most powerful political interest group.",
        "Category": " Religion , General",
        "Publisher": "Broadway",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "War Letters: Extraordinary Correspondence from American Wars",
        "Authors": "By Carroll, Andrew (EDT) and Brinkley, Douglas (FRW)",
        "Description": "In 1998, Andrew Carroll founded the Legacy Project, with the goal of remembering Americans who have served their nation and preserving their letters for posterity. Since then, over 50,000 letters have poured in from around the country. Nearly two hundred of them comprise this amazing collection—including never-before-published letters that appear in the new afterword.Here are letters from the Civil War, World War I, World War II, Korea, the Cold War, Vietnam, the Persian Gulf war, Somalia, and Bosnia—dramatic eyewitness accounts from the front lines, poignant expressions of love for family and country, insightful reflections on the nature of warfare. Amid the voices of common soldiers, marines, airmen, sailors, nurses, journalists, spies, and chaplains are letters by such legendary figures as Gen. William T. Sherman, Clara Barton, Theodore Roosevelt, Ernie Pyle, Gen. Douglas MacArthur, Julia Child, Gen. Norman Schwarzkopf, and Gen. Benjamin O. Davis Sr. Collected in War Letters, they are an astonishing historical record, a powerful tribute to those who fought, and a celebration of the enduring power of letters.",
        "Category": " History , Military , United States",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "How to Change the World",
        "Authors": "By Bornstein, David",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "A Discovery of Cinema",
        "Authors": "By Dickinson, Thorold",
        "Description": "",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "The Woman Who Swallowed a Toothbrush and Other Bizarre Medical Cases",
        "Authors": "By Rob Myers",
        "Description": "",
        "Category": "",
        "Publisher": "MJF",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The FairTax Book",
        "Authors": "By Boortz, Neal and Linder, John",
        "Description": "Wouldn't you love to abolish the IRS ...Keep all the money in your paycheck ...Pay taxes on what you spend, not what you earn ...And eliminate all the fraud, hassle, and waste of our current system?Then the FairTax is for you. In the face of the outlandish American tax burden, talk-radio firebrand Neal Boortz and Congressman John Linder are leading the charge to phase out our current, unfair system and enact the FairTax Plan, replacing the federal income tax and withholding system with a simple 23 percent retail sales tax on new goods and services. This dramatic revision of the current system, which would eliminate the reviled IRS, has already caught fire in the American heartland, with more than six hundred thousand taxpayers signing on in support of the plan.As Boortz and Linder reveal in this first book on the FairTax, this radical but eminently sensible plan would end the annual national nightmare of filing income tax returns, while at the same time enlarging the federal tax base by collecting sales tax from every retail consumer in the country. The FairTax, they argue, would transform the fearsome bureaucracy of the IRS into a more transparent, accountable, and equitable tax collection system. Among other benefits, it will:Make America's tax code truly voluntary, without reducing revenueReplace today's indecipherable tax code with one simple sales taxProtect lower-income Americans by covering the tax on basic necessitiesEliminate billions of dollars in embedded taxes we don't even know we're payingBring offshore corporate dollars back into the U.S. economyEndorsed by scores of leading economists and supported by a huge and growing grassroots movement, the FairTax Plan could revolutionize the way America pays for itself. In this straight-talking book, Neal Boortz and John Linder show you how it would work—and how you can help make it happen.",
        "Category": " Business & Economics , Taxation , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Veiled Sentiments: Honor and Poetry in a Bedouin Society",
        "Authors": "By Abu-Lughod, Lila",
        "Description": "Lila Abu-Lughod lived with a community of Bedouins in the Western Desert of Egypt for nearly two years, studying gender relations and the oral lyric poetry through which women and young men express personal feelings. The poems are haunting, the evocation of emotional life vivid. But her analysis also reveals how deeply implicated poetry and sentiment are in the play of power and the maintenance of a system of social hierarchy. What begins as a puzzle about a single poetic genre becomes a reflection on the politics of sentiment and the relationship between ideology and human experience.[Note: This 1987 edition is now out of stock. A New Updated Edition is now available.]",
        "Category": " Social Science , Anthropology , General",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "A Short History of World War I",
        "Authors": "By Stokesbury, James L.",
        "Description": "World War I was a bloodletting so vast and unprecedented that for a generation it was known simply as the Great War. Casualty lists reached unimagined proportions as the same ground -- places like Ypres and the Somme -- was fought over again and again. Other major bloody battles remain vivid in memory to this day: Gallipoli and the Battle of Jutland are but two examples. Europe was at war with itself, and the effect on Western civilization was profound, its repercussions felt even today.World War I saw the introduction of modern technology into the military arena: The tank, airplane, machine gun, submarine, and -- most lethal of all -- poison gas, all received their first widespread use. Professor Stokesbury analyzes these technological innovations and the war's complex military campaigns in lucid detail. At the same time he discusses the great political events that unfolded during the war, such as the Russian Revolution and the end of the Hapsburg dynasty, putting the social and political side of the war into the context of modern European history.A Short History of World War I is the first history of this war to be written in twenty years. It incorporates recent research and current thinking about the war in a highly readable and lively style.",
        "Category": " History , Military , World War I",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1981"
        }
    },
    {
        "Title": "Wedding Song",
        "Authors": "By Mahfouz, Naguib",
        "Description": "Four characters--the leading man, the playwright, his father, and his mother--explain the genesis of a sensational new play, some interpreting it as a work of the imagination, others as a brazen confession of sordid family secrets",
        "Category": " Fiction , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Introductory Applied Physics",
        "Authors": "By Harris, Norman",
        "Description": "",
        "Category": "",
        "Publisher": "Gregg Division, McGraw-Hill",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Companion to Literature (Penguin reference books) (v. 2)",
        "Authors": "By Thorlby",
        "Description": "",
        "Category": " Literary Criticism , General",
        "Publisher": "Puffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1969"
        }
    },
    {
        "Title": "Recreation rooms (Grosset good life books)",
        "Authors": "By A. J Harmon",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Crossing Over: A Mexican Family on the Migrant Trail",
        "Authors": "By Martinez, Ruben",
        "Description": "The U.S.-Mexican border is one of the most permeable boundaries in the world, breached daily by Mexicans in search of work. Thousands die crossing the line and those who reach \"the other side\" are branded illegals, undocumented and unprotected. Crossing Over puts a human face on the phenomenon, following the exodus of the Chávez clan, an extended Mexican family who lost three sons in a tragic border accident. Martínez follows the migrants' progress from their small southern Mexican town of Cherán to California, Wisconsin, and Missouri where far from joining the melting pot, Martínez argues, the seven million migrants in the U.S. are creating a new culture that will alter both Mexico and the United States as the two countries come increasingly to resemble each other.",
        "Category": " Social Science , Anthropology , Cultural & Social",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Acts of Faith",
        "Authors": "By Caputo, Philip",
        "Description": "Philip Caputo’s tragic and epically ambitious new novel is set in Sudan, where war is a permanent condition. Into this desolate theater come aid workers, missionaries, and mercenaries of conscience whose courage and idealism sometimes coexist with treacherous moral blindness. There’s the entrepreneurial American pilot who goes from flying food and medicine to smuggling arms, the Kenyan aid worker who can’t help seeing the tawdry underside of his enterprise, and the evangelical Christian who comes to Sudan to redeem slaves and falls in love with a charismatic rebel commander. As their fates intersect and our understanding of their characters deepens, it becomes apparent that Acts of Faith is one of those rare novels that combine high moral seriousness with irresistible narrative wizardry.",
        "Category": " Fiction , War & Military",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Flawless Consulting: A Guide to Getting Your Expertise Used",
        "Authors": "By Block, Peter",
        "Description": "Focus on what makes for successful consulting with this practical, how-to-do-it guidebook. It applies to anyone who does consulting, even if you don't call yourself a consultant. Author Peter Block describes it this way: You are consulting any time you are trying to change or improve a situation but have no direct control over the implementation.Flawless Consulting delves into the science of effective consulting . . . whether on a formal client basis or working as an employee within a multilayered company. Through the use of illustrative examples, case studies, and exercises, Block details the behaviors behind interpersonal dynamics and error-free consulting.Using the techniques in this book, you will learn how to:Encourage the demand for your expertiseEnsure that your recommAndations are implemented more frequentlyDevelop a partnership role with clientsAvoid no-win consulting situationsIncrease the leverage you have with your clientsEstablish more trusting relationships with clientsFlawless Consulting points out the elements that often get in the way of productive consulting, and then shows you how to handle them and move on to clear, mutually beneficial consulting.Based on the author's extensive internal and external consulting experience, this book will serve as an in-depth guide for developing the necessary skills for getting your expertise used, even when you don't have control!",
        "Category": " Business & Economics , Consulting",
        "Publisher": "Pfeiffer",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Pathways to Discovery: Exploring America's National Trails",
        "Authors": "By Edt Crump, Donald J.",
        "Description": "",
        "Category": "",
        "Publisher": "Natl Geographic Society",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "The Reading List: Contemporary Fiction: A Critical Guide to the Complete Works of 125 Authors",
        "Authors": "By Rubel, David (EDT)",
        "Description": "Perfect for reading groups and all book lovers Here, at last, is the book to which the more than a quarter-million reading groups and book clubs in this country can turn for the answer to that pressing question: What should we read next? The Reading List illuminates the work of current novelists who have captured the imagination of the modern reader. Each entry includes critical commentary on the author's published fiction by prominent reviewers, as well as thematic and plot synopses, and a short biography. The Reading List features a broad spectrum of writers from our shores and abroad whose works are available in English. Stylistically, the authors run the gamut from Cormac McCarthy to Cristina Garcia, from Naguib Mahfouz to Barbara Kingsolver, from Jane Smiley to Salman Rushdie. Now reading groups and independent bookworms alike have a comprehensive, discriminating resource to guide them through their next literary foray.",
        "Category": " Reference , General",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "WW II: Time-Life Books History of the Second World War",
        "Authors": "By Time-Life Books",
        "Description": "Provides accounts of all events of the war, prewar and postwar actions, and illustrates and records the Apocalypse in depth",
        "Category": " History , General",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "7.98",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Wood Projects for the Home",
        "Authors": "By Hildebrand, Ron",
        "Description": "",
        "Category": " House & Home , Woodworking",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1981"
        }
    },
    {
        "Title": "How to Establish a Democracy or Improve the One You Now Have: A Practical Guide for Developing Essential Government and Business Structures and Pers",
        "Authors": "By Boek, Walter E., Ph.D.",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "College of Democracy",
        "Price Starting With ($)": "10.46",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Installing Your Own Telephones",
        "Authors": "By Publishing, Master",
        "Description": "",
        "Category": "",
        "Publisher": "Radio Shack",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Sunset Quick, Light and Healthy",
        "Authors": "By Editors of Sunset Books",
        "Description": "",
        "Category": "",
        "Publisher": "Sunset Publishing",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Antidepressant Survival Program: How to Beat the Side Effects and Enhance the Benefits of Your Medication",
        "Authors": "By Hedaya, Robert J. and Kotz, Deborah",
        "Description": "A psychopharmacologist and clinical psychiatrist offers his program for reducing the side effects of antidepressantsincluding weight gain, sexual dysfunction, and energy losswithout taking more drugs.",
        "Category": " Health & Fitness , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "I Love Colors (Look Baby! Books)",
        "Authors": "By Miller, Margaret (ILT) and Miller, Margaret",
        "Description": "An entertaining and sturdy photographic board book features full-color, close-up portraits of babies and a brilliant rainbow of their favorite things, from purple sunglasses to bright orange flowers.",
        "Category": " Juvenile Fiction , Concepts , Colors",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "World architecture : an illustrated history",
        "Authors": "By Lloyd, Seton, Copplestone, Trewin",
        "Description": "",
        "Category": "",
        "Publisher": "Hamlyn",
        "Price Starting With ($)": "9.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Dont Waste Your Sorrows: New Insight Into God's Eternal Purpose for Each Christian in the Midst of Life's Greatest Adversities",
        "Authors": "By Billheimer, Paul E.",
        "Description": "",
        "Category": " Body, Mind & Spirit , Healing , Prayer & Spiritual",
        "Publisher": "Authentic",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Where's The Big Red Doggie? (Clifford Die-cut Board Books)",
        "Authors": "By Bridwell, Norman",
        "Description": "In a sturdy die-cut Clifford book, babies can point to and identify their favorite objects and animals before locating Clifford peeking from behind the house, in a truck, or through the window.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Papercrafts: 50 Extraordinary Gifts and Projects, Step by Step",
        "Authors": "By Souter, Gillian",
        "Description": "Provides a variety of papercraft ideas that are accompanied by step-by-step instructions for such techniques as papier mache, weaving, decoupage, papercuts, paper tole, stencilling, marbling, applique, sculpture, and more. Original. 25,000 first printing.",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Amazing Poisonous Animals (Eyewitness Junior)",
        "Authors": "By Parsons, Alexandra",
        "Description": "Full-color photos & full-color illus. Authoritative, accessible, and stunningly designed, this unique photographic nature book shows beginning readers how creatures such as the Gila monster and the puffer fish use venom to kill prey and scare off predators.",
        "Category": " Juvenile Fiction , Animals , General",
        "Publisher": "Alfred a Knopf Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "A Cross Stitch Christmas: Handmade Treasures (Better Homes and Gardens)",
        "Authors": "By Meredith Books, Better Homes and Gardens",
        "Description": "Filled with ninety-nine projects that appeal to stitchers with a wide variety of interests, a collection of timeless designs includes all levels of difficulty and features the Cross Stitch and Country Crafts Mark of Excellence seal. 30,000 first printing.",
        "Category": " Crafts & Hobbies , Seasonal",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Angels Remembered",
        "Authors": "By Childs, Anne Van Wagner (EDT)",
        "Description": "A collection of cross-stitched images adapted from vintage greeting cards, lithographs, and painted masterpieces.",
        "Category": " Crafts & Hobbies , Needlework , Needlepoint",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "With a Crash and a Bang!",
        "Authors": "By Pikulski, John J",
        "Description": "",
        "Category": " Juvenile Nonfiction , Literary Criticism & Collections",
        "Publisher": "Houghton Mifflin College Div",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Kill as Few Patients as Possible: And 56 Other Essays on How to Be the World's Best Doctor",
        "Authors": "By London, Oscar",
        "Description": "",
        "Category": " Medical , Physicians",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "JavaScript for the World Wide Web, Third Edition (Visual QuickStart Guide)",
        "Authors": "By Negrino, Tom and Smith, Dori",
        "Description": "A guide for those already versed in HTML explains how to use the programming language to work with frames, browser windows, Dynamic HTML, cookies, plug-ins, and Visual Tools",
        "Category": " Computers , Programming Languages , Java",
        "Publisher": "Peachpit Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Perl and CGI for the World Wide Web (Visual QuickStart Guide)",
        "Authors": "By Castro, Elizabeth",
        "Description": "Taking a visual approach, this guide uses ample screen stills to explain the basic components of Perl, and show how to install and customize existing CGI scripts to build interactivity into Web sites. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Computers , Programming Languages , JavaScript",
        "Publisher": "Peachpit Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "XML for the World Wide Web",
        "Authors": "By Castro, Elizabeth",
        "Description": "[There is a new edition of this book: XML, Second Edition: Visual QuickStart Guide by Kevin Howard Goldberg (ISBN: 0-321-55967-3)]Web-maven Elizabeth Castro, who has penned Peachpit books on HTML,Perl and CGI, and Netscape, now tackles XML--an indispensable tool for creating personalized, updated content for each visitor on your site. Whether you build Web pages for a living or you're taking on anew hobby, XML for the World Wide Web contains everything you need to create dynamic Web sites by writing XML code, developing custom XML applications with DTDs and schemas, transforming XML into personalized Web content through XSLT-based transformations, and professionally formatting XML documents with Cascading Style Sheets.The real power of XML lies in combining information from various sources and generating personalized content for different visitors.Castro's easy-to-follow graphics show exactly what XML looks like,and her real-world examples explain how to transform and streamline your Web-site creation process by automatically updating content.",
        "Category": " Computers , Programming Languages , HTML",
        "Publisher": "Peachpit Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Better Homes and Gardens New Crockery Cooker Cook Book",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "Presents crockery-cooker recipes for foods such as pot roast, Irish stew, clam chowder, baked beans, pumpkin bread, and Tex-Mex chili",
        "Category": " Cooking , General",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "America Out of the Ashes: True Stories of Courage and Heroism",
        "Authors": "By Jeff O'Leary",
        "Description": "Provides accounts of true stories of courage and hope from the victims and rescuers of the terrorist attacks on the World Trade Center and the Pentagon.",
        "Category": " Religion , Inspirational",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Girls' Night Out",
        "Authors": "By Valdes-Rodriguez, Alisa, Giffin, Emily, Gore, Kristin, Bagshawe, Tilly, Matthews, Carole (EDT), Mlynowski, Sarah (EDT), and Manby, Chris (EDT)",
        "Description": "25 stories from the hottest female writers on the scene.Too tired to doll up and head out for a night on the town? (It happens to the best of us.) Just dip into this year's must-read collection for a Girls' Night Out to remember and indulge in tales of reunions and weddings, sisters and friends, endings and beginnings.... No waiting in line, no wardrobe malfunctions, no jockeying for position as you try to catch the bartender's eye. With a lineup of fantastic writers like Meg Cabot (The Boy Next Door), Emily Giffin (Something Borrowed), Kristin Gore (Sammy's Hill), Emma McLaughlin & Nicola Kraus (The Nanny Diaries), Alisa Valdes-Rodriguez (The Dirty Girls Social Club) and Lolly Winston (Good Grief), you'll be hanging with the VIPs all night long!Net proceeds to benefit War Child and No Strings.Unfortunately, this title is not available to Canadian residents.",
        "Category": " Fiction , Women",
        "Publisher": "Red Dress Ink",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Barnes & Noble Thesaurus of Computer Science: The Principles of Computer Science Explained and Illustrated",
        "Authors": "By Godman, Arthur",
        "Description": "",
        "Category": " Computers , General",
        "Publisher": "Barnes Noble",
        "Price Starting With ($)": "8.34",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "The Widow's Kiss",
        "Authors": "By Feather, Jane",
        "Description": "Jane Feather has won legions of fans with her irresistible romances that deftly blend mystery and intrigue with exquisitely passionate romance. Now the New York Times-bestselling author of The Least Likely Bride has penned another seductive tale, the unforgettable story of a beautiful noblewoman who has lost four husbands under mysterious circumstances, and the man who is sent to find out if she is an unlucky victim of fate -- or a black widow whose abundant charms hide a heart of ice....As a lone and wealthy widow in Henry VIII's kingdom, Lady Guinevere Mallory knew that she was in a precarious position. But she never imagined that when danger arrived, it would be in the form of Hugh of Beaucaire, a man with the bluest eyes she'd ever seen. A man of such power and determination that when he rode up to Mallory Hall, intent on claiming a vast tract of her land, Guinevere couldn't suppress a frisson of fear ... or deny a shiver of anticipation.A seasoned soldier, Hugh had seen his share of battle and known his share of women. But nothing had prepared him for the reality of Guinevere -- a woman so elegant and alluring, with luminous eyes and hair the color of palest wheat. And when she smiled her damnable smile, so filled with invitation, Hugh found himself confused, aroused, and infuriated. For he suspected that the widow had committed the blackest of crimes.How else could a woman of eight and twenty have been so unfortunate as to bury four wealthy husbands? How else could she have managed to persuade each of them to sign a marriage contract she herself had drawn up -- documents that ensured she would inherit everything they owned upon their deaths?As Guinevere stalls for time, Hugh begins to investigate her mysterious and tarnished past. Yet even as they try to fathom each other's motives, temptation explodes into a consuming passion, clouding their minds to the coming peril. Whatever Hugh uncovers, he must escort Guinevere to London to face the king and the terrifying and ruthless power of the Lord Privy Seal. And if Guinevere is indeed charged with murder, Hugh knows there's only one way he can save her -- by taking the risk that he will become the next victim of the widow's kiss....",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Crockett's Flower Garden",
        "Authors": "By Crockett, James Underwood",
        "Description": "Provides fundamental information on starting, planting, propagating, growing, and pest controlling ninety-four different kinds of annuals, biennials, perennials, roses and bulbs",
        "Category": " Gardening , Flowers , General",
        "Publisher": "Little Brown",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1981"
        }
    },
    {
        "Title": "The McGraw-Hill Guide to English Literature: William Blake to D.H. Lawrence",
        "Authors": "By Lawrence, Karen, Seifter, Betsy, and Ratner, Lois",
        "Description": "Provides chronologies for thirty-five poets and novelists, including Coleridge, Tennyson, Eliot, Dickens, and Woolf, and includes essay questions and answers concerning their major works",
        "Category": " Literary Criticism , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "The Little Book of Kitchen Table Wisdom",
        "Authors": "By Remen, Rachel Naomi and Berg, Jacqueline M. (EDT)",
        "Description": "As a physician, a professor of medicine, a therapist, and a long-term survivor of chronic illness, Dr. Rachel Remen, author of the inspirational classic Kitchen Table Wisdom, has a unique perspective on healing. Here are the passages, quotes, and stories from Kitchen Table Wisdom that have profoundly affected her legions of fans. The result is a guide to inner healing that everyone will cherish, and such spiritual issues as suffering, meaning, love, faith, and miracles that everyone can learn from and live by.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Fatal Defect:: Chasing Killer Computer Bugs",
        "Authors": "By Peterson, Ivars",
        "Description": "More than ever, our society depends on the reliable - if not always correct - functioning of computers. Computers amplify not only our genius but our flaws, sometimes to intolerable extremes. Author Ivars Peterson traces the lurching history of software development and describes how misconceptions and mistakes have become an inextricable part of computer programs and systems. He creates fascinating and colorful profiles of the people who hunt down these elusive computer bugs and struggle to make an inherently fallible system less treacherous. He also offers dozens of detailed examples of how computer failures occur - some amusing, some annoying, others terrifying, even fatal.Each computer failure is a reminder that we all pay a price for sloppy thinking in software development, for making the rush to market a more important consideration than safety and reliability. No software can ever be guaranteed 100 percent bug-free, but if we analyze our past mistakes and rethink our approach to computers, we can defuse some ticking time bombs and create a more trustworthy next generation of computers.",
        "Category": " Computers , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "America Goes to War: The Civil War and Its Meaning in American Culture",
        "Authors": "By Catton, Bruce",
        "Description": "The distinguished historian discusses the issues and events in the Civil War that have great relevance for modern American society",
        "Category": " History , United States , General",
        "Publisher": "Wesleyan University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Presidential elections and American politics: Voters, candidates, and campaigns since 1952 (Dorsey series in political science)",
        "Authors": "By Asher, Herbert B",
        "Description": "",
        "Category": "",
        "Publisher": "Dorsey Press",
        "Price Starting With ($)": "8.44",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Film theory and criticism;: Introductory readings",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Investor's Business Daily Guide to the Markets",
        "Authors": "By Investor's Business Daily",
        "Description": "From the Foreword by Charles Schwab\"The Investor's Business Daily Guide to the Markets is. . .clear, concise, innovative, and authoritative, giving you the information you need to make important investment decisions with confidence. Whether you're a new or experienced investor, you'll learn a great deal from this book. What a pleasure it is to discover a book that tells it like it is with no hidden agendas. It's sure to pay you dividends and capital gains again and again in the years ahead.\"\"Before investing in the markets, you should invest in this book.\" --Alice Kane Executive Vice President, New York Life Insurance Company\"Investor's Business Daily Guide to the Markets is the quintessential guide for anyone interested in gaining insight and helpful information about the financial markets.\" --Louis G. Navellier, President, Navellier & Associates Inc., Editor, MPT Review.\"A great book for people who want to understand the markets. Don't miss this comprehensive roundup--the mutual funds chapter alone is worth the price of the book.\" --James M. Benham, Chairman of the Board, Benham Funds.\"Developing an investment portfolio is like building a house: you must start with a solid foundation. This book gives you the investment foundation you need. Buy it before you put another dollar in stocks, bonds, or mutual funds.\"--Ted Allrich. author, The Online Investor \"The On-line Investor\" (America Online).\"Bill O'Neil, for years the unheralded hero of institutional investors worldwide, began offering his expertise to the individual investor over ten years ago through Investor's Business Daily newspaper. Now his Investor's Business Daily Guide to the Markets takes the next step for investors by putting basic financial information into meaningful terms and useful strategies. This is a 'must read' for all investors --big and small.\" --Richard W. Perkins, CFA, President and Portfolio Manager, Perkins Capital Management, Inc.",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.4",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Forever, Erma: Best-Loved Writing From America's Favorite Humorist",
        "Authors": "By Bombeck, Erma",
        "Description": "\"A lot of columnists write words to end up in the Congressional Record or on the president's desk or at the Pulitzer Committee's door. But Erma Bombeck went us all one better. Her words won her the permanent place of honor in American life: the refrigerator door. Now we are again at wit's end.\"--Ellen Goodman\"Erma Bombeck may be gone, but she'll live forever in her columns. A fitting finale for the much-loved humorist.\" --Booklist\"Forever, Erma is a modest measure of our loss.\" --The New York Times Book ReviewErma Bombeck's own aversion to producing books of column collections over the years made the family and publisher of the hardcoverForever, Erma apprehensive about its public acceptance.The pubic proved Erma's misgivings were unfounded. Within nine weeks of the publication date, the book had climbed to number three onThe New York Times best-seller list. It remained on the list for a total of fifteen weeks. Over 400,000 copies had been bought by her loyalists and their friends and families.The success of the hardcover edition expands Erma's literary legacy. Now the paperback edition ofForever, Erma will reach new generations. We all see ourselves in her words.Only the emotional spectrum of this book matches its topical diversity. One's feelings are reminiscent of the same warmth and tenderness only Erma could portray, and readers will be delighted to find their favorite selections. Included with 188 other columns are her first, \"Children Cornering the Coin Market,\" from January 1965, and her last one, \"Let's Face It,\" from April 1996.As in the hardcover edition, a tribute chapter includes remembrances from some of Erma's family, friends, and colleagues, including Phil Donahue, Art Buchwald, and Ellen Goodman.Readers around the world loved Erma Bombeck and cherished every one of her columns.Forever, Erma, will give them a classic way to hold on to this most gifted writer. As Phil Donahue said, \"We shall never see the likes of her again. She was real and she brought us down to earth--gently, generously, and with brilliant humor. When the scholars gather hundreds of years from now to learn about us, they can't know it all if they don't read Erma.\"",
        "Category": " Humor , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Culturally Incorrect: How Clashing Worldviews Affect Your Future",
        "Authors": "By Parsley, Rod",
        "Description": "Left. Right. Red. Blue. Political actors. Acting politicians.Exhausted soccer moms; overwhelmed and overworked dads; and frightened and confused kids. Addicted athletes and violet hip-hop artists swagger through million-dollar mansions dripping with \"bling,\" while teachers who sacrifice their lives to educate the next generation call a first-floor apartment home and sell their jewelry for textbooks.From the East Coast to the West, and all the states in between, this country divides itself. The dichotomy is so great, in fact, that many of us can describe ourselves using one of two words: Liberal or Conservative. And we all have an opinion. Ask anyone you see on the street, however, and most will agree on one thing: We're witnessing our nation's demise.In Culturally Incorrect, Rod Parsley addresses this social, political, spiritual and philosophical polarization with unabashed candor. \"The minds and hearts of this generation have become the theater of conflict,\" he writes. \"It is a war of competing, mutually exclusive ways of viewing the universe and man's place in it. It is a clash of paradigms, of value systems, and of visions for the future.\"We can run, we can hide . . . or we can engage. Read this book. And choose.",
        "Category": " Political Science , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Entrepreneurial Faith: Launching Bold Initiatives to Expand God's Kingdom",
        "Authors": "By Kallestad, Walt, Caldwell, Kirbyjon, and Sorensen, Paul",
        "Description": "",
        "Category": " Religion , Leadership",
        "Publisher": "WaterBrook Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Rise and Shine: A Wake-Up Call",
        "Authors": "By Swindoll, Charles R.",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Estate Planning Basics",
        "Authors": "By Clifford, Denis",
        "Description": "Make your estate planning as painless as possible with Estate Planning Basics. This book provides concise, straightforward and easy-to-read explanations of the major components of estate planning, so that you don't have to spend hours wading through endless options, most of which apply to the wealthy. Learn about: § choosing beneficiaries § estate planning by parents with minor children § wills § living trusts § other probate-avoidance methods, including using a retirement plan like an IRA or 401(k) as an estate planning device § estate taxes, and tax reduction methods § trusts for people in second marriages, or for those leaving property to a disabled person § planning for the handling of medical and financial decisions if one becomes incompetent",
        "Category": " Law , Reference",
        "Publisher": "Nolo",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "The Night Country",
        "Authors": "By Eiseley, Loren C.",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Crisp: Basics of Budgeting: A Practical Guide to Better Business Planning (Crisp Fifty-Minute Books)",
        "Authors": "By Dickey, Terry",
        "Description": "The title of this clearly written book says it all.",
        "Category": " Business & Economics , Budgeting",
        "Publisher": "Crisp Learning",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Financial Analysis: The Next Step (50 Minute Series)",
        "Authors": "By Gill, James O.",
        "Description": "",
        "Category": "",
        "Publisher": "Crisp Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Getting Results with Curriculum Mapping",
        "Authors": "By Jacobs, Heidi Hayes (EDT)",
        "Description": "Curriculum mapping is said to remove the clutter that may interfere with learning and teaching. It sorts lessons and units into consistent plans that teachers, schools, and districts can access to ensure content is consistent and also progresses along with students. Jacobs and her contributors describe how to set up a mapping project, work on the project as a team, and use mapping in special settings such as in an independent or alternative school. They show how to create consistent benchmarks and use the resulting maps to integrate new technology, new data, decision-making structures, and staff development opportunities. The appendices include samples. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Education , Curricula",
        "Publisher": "ASCD",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "You Gotta Be the Book: Teaching Engaged and Reflective Reading With Adolescents (Language & Literacy Series)",
        "Authors": "By Wilhelm, Jeffrey D.",
        "Description": "",
        "Category": " Education , Teaching Methods & Materials , Reading & Phonics",
        "Publisher": "Teachers College Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "The World According to Garp",
        "Authors": "By John irving",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1979"
        }
    },
    {
        "Title": "God's Abundance",
        "Authors": "By Miller, Kathy C.",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday Direct Inc.",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Great Housewives of Art Revisited",
        "Authors": "By Swain, Sally",
        "Description": "A portrait of life in an artist's home presents paintings of Mrs. da Vinci Losing Weight, Mrs. Doccio Changing a Diaper, and twenty-three other tributes to the women behind the world's greatest artists. Original.",
        "Category": " Humor , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "The Well-Filled Tortilla Cookbook",
        "Authors": "By Wise, Victoria and Hoffman, Susanna",
        "Description": "Like a blank canvas but much tastier, the ubiquitous corn or flour tortilla is the perfect vehicle for every sort of food. And taco-making-the art of filling tortillas with dozens of zesty and unexpected concoctions-turns the ordinary into the irrepressible.Victoria Wise and Susanna Hoffman, both life-long tortilla aficionados, fill them with Fiesta Ground Beef, Chicken Mole, Spicy Shrimp Salad, Green Olive Cilantro Salsa Ancho Chili Sauce, Pear Lime Salsa, and much more.Here are over 200 recipes for well-filled tortillas. Tacos from around the world-Portuguese-style Grilled Fish Taco, Oriental Stir-Fry Beef Taco, Thai-Style Shrimp Taco, add variety to the spice of such Cal-Mex favorites as Basic Beef Fajita Taco, Black Bean Taco, Chorizo Taco, Snapper Vera Cruz Taco, and Taco de Carnitas. Dessert tacos and tostada sundaes bring the most festive food into the most festive course.Whether store-bought or home-pressed (the recipes are here, for corn and flour), a stack of tortillas means delicious, down-home, fun food for any occasion-to eat with your fingers in messy splendor. Selection of the Book-of-the-Month Club's The Good Cook Club. 250,000 copies in print.",
        "Category": " Cooking , Reference",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Good Housekeeping Best Recipes 1998: Plus Kitchen Tools, Techniques & Tips (Good Housekeeping Annual Recipes)",
        "Authors": "By Good Housekeeping Institute (EDT)",
        "Description": "Covering a wide range of occasions from festive holiday fare to easy week-night dishes, three hundred hundred recipes--thrice tested by the food editors of Good Housekeeping--are complemented by more than one hundred full-color photographs and cooking suggestions.",
        "Category": " Cooking , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Better Homes and Gardens New Dieter's Cook Book",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "Contains some 400 low-cal/low-fat recipes, each with a nutrition analysis and color photograph. Includes a section on nutrition facts, calorie-trimming cooking methods, exercise hints, tips on dieting and a two week menu plan. Published by Better Homes and Gardens Books, LS-348, 1716 Locust Street, Des Moines, IA 50309-3023. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Cooking , Reference",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "7.93",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Worlds Top Retirement Havens",
        "Authors": "By Cooper, Marian",
        "Description": "",
        "Category": "",
        "Publisher": "Agora, Incorporated",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Big Book of Family Fun",
        "Authors": "By Dillow, Linda and Arp, Claudia",
        "Description": "",
        "Category": " Games , General",
        "Publisher": "Heritage Builders Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "Tell No One",
        "Authors": "By Coben, Harlan",
        "Description": "For Dr. David Beck, the loss was shattering. And every day for the past eight years, he has relived the horror of what happened. The gleaming lake. The pale moonlight. The piercing screams. The night his wife was taken. The last night he saw her alive. Everyone tells him it’s time to move on, to forget the past once and for all. But for David Beck, there can be no closure. A message has appeared on his computer, a phrase only he and his dead wife know. Suddenly Beck is taunted with the impossible–that somewhere, somehow, Elizabeth is alive. Beck has been warned to tell no one. And he doesn’t. Instead, he runs from the people he trusts the most, plunging headlong into a search for the shadowy figure whose messages hold out a desperate hope. But already Beck is being hunted down. He’s headed straight into the heart of a dark and deadly secret–and someone intends to stop him before he gets there.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Grace and Power: The Private World of the Kennedy White House",
        "Authors": "By Smith, Sally Bedell",
        "Description": "In GRACE & POWER: THE PRIVATE WORLD OF THE KENNEDY WHITE HOUSE, New York Times bestselling author Sally Bedell Smith takes us inside the Kennedy White House with unparalleled access and insight. Having interviewed scores of Kennedy intimates, including many who have never spoken before, and drawing on letters and personal papers made available for the first time, Smith paints a richly detailed picture of the personal relationships behind the high purpose and poiltical drama of the twentieth century's most storied presidency.At the dawn of the 1960s, a forty-three-year-old president and his thirty-one-year-old first lady – the youngest couple ever to occupy the White House – captivated the world with their easy elegance and their cool conviction that anything was possible. Jack and Jackie Kennedy gathered around them an intensely loyal and brillant coterie of intellectuals, journalists, diplomats, international jet-setters and artists. Perhaps as never before, Washington was sharply divided between the “ins” and the “outs.” In his public life, JFK created a New Frontier, stared down the Soviets, and devoted himself to his wife and children. As first lady, Jackie mesmerized foreign leaders and the American people with her style and sophistication, creating a White House renowned for its beauty and culture. Smith brilliantly recreates the glamorous pageant of the Kennedy years, as well as the daily texture of the Kennedys’ marriage, friendships, political associations, and, in Jack’s case, multiple love affairs. Smith’s striking revelations include new information about what drew Jack to his numerous mistresses – and what effects the relationships ultimately had on the women; about the rivalries and resentments among Kennedy’s advisers; and about the poignant days before and after Kennedy’s assassination.Smith has fashioned a vivid and nuanced portrait not only of two extraordinary individuals but of a new age that sprang to life around them. Shimmering with intelligence and detail, GRACE AND POWER is history at its finest.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Best American Travel Writing 2003",
        "Authors": "By Wilson, Jason (EDT) and Frazier, Ian (EDT)",
        "Description": "Since its inception in 1915, the Best American series has become the premier annual showcase for the country's finest short fiction and nonfiction. For each volume, a series editor reads pieces from hundred of periodicals, then selects between fifty and a hundred outstanding works. That selection is pared down to the twenty or so very best pieces by a guest editor who is widely recognized as a leading writer in his or her field. This unique system has helped make the Best American series the most respected -- and most popular -- of its kind.   More and more readers are discovering the pleasures of armchair travel through the hugely successful Best American Travel Writing, now in its fourth adventurous year. Journey through the 2003 volume from Route 66 to the Arctic; go deep into Poland's Tatra Mountains and through the wildest jungle in Congo. Selections this year are from equally far-flung sources, including Outside, Food & Wine, National Geographic Adventure, Potpourri, and The New Yorker.Rebecca Barry Peter Canby Christopher Hitchens Kira Salak Andrew Solomon William T. Vollmann",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "1001 Surprising Things You Should Know about God",
        "Authors": "By MacGregor, Jerry, Prys, Marie, and Wallace, Donna",
        "Description": "",
        "Category": " Religion , Biblical Reference , General",
        "Publisher": "Baker Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Gorky Park",
        "Authors": "By Smith, Martin Cruz",
        "Description": "\"Brilliant...One of the best books of the season.\"ASSOCIATED PRESSA triple murder in a Moscow amusement center: three corpses found frozen in the snow, faces and fingers missing. Chief homicide investigator Arkady Renko is brilliant, sensitive, honest, and cynical about everything except his profession. To identify the victims and uncover the truth, he must battle the KGB, FBI, and New York police as he performs the impossible--and tries to stay alive doing it.",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "Happy House Plants",
        "Authors": "By Rutherford, Violet",
        "Description": "",
        "Category": "",
        "Publisher": "JBG Publishing",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Natural Cures \"They\" Don't Want You to Know About",
        "Authors": "By Trudeau, Kevin",
        "Description": "",
        "Category": "",
        "Publisher": "ALLIANCE PUBLISHING GROUP",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "It's Getting Ugly Out There: The Frauds, Bunglers, Liars, and Losers Who Are Hurting America",
        "Authors": "By Cafferty, Jack",
        "Description": "Very little of my backstory qualifies as Hallmark Card material, but it may help you to make sense of the way I see and interpret what's going on around me.-Jack CaffertyFor the millions who watch the \"\"Cafferty File\"\" on CNN's The Situation Room, Jack Cafferty stands for common sense-the much-needed voice of reason who skewers right-wing nut jobs and liberal eggheads alike. For years, he's voiced the views, hopes, and fears of the average American in inimitable style. Now, in It's Getting Ugly Out There, he brings that level-headed wisdom to bear on the most critical issues facing us today-and explains why Americans must take our country back from those who are harming it.\"\"It's been a target-rich seven years for someone like me who enjoys pushing people's buttons and sticking pins in things that need pricking, from rich and fatuous celebrities offering foreign policy analysis to the latest lying Beltway blowhard impaling himself on his sword of pomposity. . . . Anyone familiar with my daily 'Cafferty File' segments on CNN's The Situation Room knows I'm not exactly what you'd call the mainstream media's poster boy for feel-good news and commentary. In your face is more like it.\"\"\"\"I'm no shrink, but I have the sense Bush has carried an angry chip on his shoulder much of his pampered life, seething just beneath the good-old-boy surface.\"\"\"\"The bottom line is that our government no longer works for us. The government works for the lobbyists who have had a big hand in influencing (if not helping to draft) legislation favoring not the average American citizen but instead big business: health insurance, pharmaceutical and oil companies, and defense contractors, among others. These are the guys who can make the kinds of political contributions that are needed to finance today's multi-million-dollar political campaigns.\"\"\"\"We want our troops home, but we also want a new army of elected officials to march into Washington and take a fresh, uncorrupted look at the needs of the vast majority of Americans. If these two parties, however 2008 breaks, can't fix what's broken, this way of life as we've known it may vanish into some deep, dark crevasse.\"\"",
        "Category": " Political Science , American Government , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    }
]