[
    {
        "Title": "Animalia",
        "Authors": "By Base, Graeme",
        "Description": "More than three million copies of Animalia have been sold around the world, making Graeme Base’s amazing alliterative alphabet book one of the most beloved titles of the past quarter century. To celebrate thirty years, Abrams is proud to publish a special anniversary edition. Animalia’s incredible imaginary world intrigues all readers. Each page includes hidden objects and ideas: start with “A is for An Armoured Armadillo Avoiding an Angry Alligator” and you’ll find aprons, ants, aces, Atom-brand anchovies, and much more. The rest of the alphabet is just as much fun!",
        "Category": " Juvenile Nonfiction , Animals , General",
        "Publisher": "Abrams Books for Young Readers",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Green Tea",
        "Authors": "By Taylor, Nadine",
        "Description": "Including more than one dozen recipes for drinks and desserts, a guide to the healing properties of green tea describes how it acts as a stronger antioxidant than certain vitamins, inhibits blood clots better than aspirin, and more. Original.",
        "Category": " Health & Fitness , Herbal Medications",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Fighting Forces: An Illustrated Anatomy of the World's Great Armies",
        "Authors": "By Bennett, Richard",
        "Description": "Provides information on twenty-five top land armies covering such topics as weapons and equipment, combat units, current alliances, and peacekeeping commitments.",
        "Category": " History , Military , General",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Today's gourmet II: Light and healthy cooking for the '90s (Jacques Pepin's Today's Gourmet)",
        "Authors": "By Pepin, Jacques",
        "Description": "A collection of one hundred recipes from the host of PBS's Today's Gourmet features such dishes as Lobster in Artichoke Bottoms, Tuna Steak au Poivre, Chicken in Coriander Sauce, Red Pepper Pasta with Walnuts, and others. Original. 50,000 first printing.",
        "Category": "",
        "Publisher": "Kqed",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Spanish Now!: A Level-One Worktext/El Espanol Actual! : Primer Programa",
        "Authors": "By Wald, Heywood, Silverstein, Ruth J., and Pomerantz, Allen",
        "Description": "Includes sections on structure, verbs, vocabulary, idioms, reading and listening comprehension, writing, and Hispanic culture.",
        "Category": "",
        "Publisher": "Barron's Educational Series, Incorporated",
        "Price Starting With ($)": "6.72",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Sunset Cooking for Two: Delicious Recipes for All Occasions (Sunset)",
        "Authors": "By Bunting, Tori Ritchie",
        "Description": "Recipes for a variety of foods from sandwiches to fillet of sole are scaled down for serving one or two people and take into consideration appetites and time limitations of working couples",
        "Category": " Cooking , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Martha Stewart's Hors d'Oeuvres: The Creation and Presentation of Fabulous Finger Foods",
        "Authors": "By Stewart, Martha",
        "Description": "Martha Stewart shares her ideas for delectable finger foods to serve at 13 different parties. Includes 150 original recipes, tips on sophisticated presentation, and nearly 200 glorious full-color photographs.175 full-color photographs.",
        "Category": " Cooking , Reference",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Wok Cook Book",
        "Authors": "By Editors of Sunset Books",
        "Description": "",
        "Category": "",
        "Publisher": "Lane Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1978"
        }
    },
    {
        "Title": "The Ultimate Tea Diet: How Tea Can Boost Your Metabolism, Shrink Your Appetite, and Kick-Start Remarkable Weight Loss",
        "Authors": "By Ukra, Mark",
        "Description": "Tea has been widely recognized for its amazing health benefits. It can help:Boost the immune systemLower blood sugar and cholesterolPrevent cavities and tooth decaySlow the aging processDecrease high blood pressurePrevent arthritisSharpen mental focus and concentrationReduce the risk of stroke, heart disease, cancer,and more ...Now, it's time for tea to be recognized, not only for all of these wonderful health benefits, but also for its ability to help tea drinkers lose weight. The Ultimate Tea Diet harnesses tea's incredible weight-loss potential in a straightforward plan for losing weight in a safe and healthy way. Simply find a tea you love, drink it all day, follow an easy food plan, and see the pounds fall off. Tea's ability to encourage weight loss comes from the synergy of its three main ingredients: caffeine to stimulate, L-theanine to neutralize the harmful side effects of caffeine and act as an appetite suppressant, and EGCG, which causes you to burn fat faster and more efficiently. In other words, tea reduces your appetite and stimulates your metabolism.Don't worry—you won't go hungry on the Ultimate Tea Diet. The food plan includes tasty tea-based meals for breakfast, lunch, and dinner as well as tempting choices for midday snacks and sweet treats. All are made deliciously with tea so not only is your food incredibly flavorful, but you're also getting the health and weight-loss benefits in every single bite you enjoy. Drinking tea—and maintaining a conscientious focus on good health—can easily become a way of life. Slim down to a leaner, more energetic, and healthier you with the Ultimate Tea Diet.",
        "Category": " Cooking , Beverages , Coffee & Tea",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Earl Mindell's New Vitamin Bible",
        "Authors": "By Mindell, Earl and Mundis, Hester",
        "Description": "America's #1 Vitamin Book-With Extensive New Material, Special Sections, and a Total Guide to Good Health This classic guide has been completely updated to put the information you need at your fingertips: to live healthier, better, and longer. Discover: * how to maximize the effectiveness of your vitamins and supplements-by taking them in the right combinations and avoiding problems * new antiaging vitamins and supplements-they will keep your skin and body healthy and young-looking * the art of personalizing your dietary regimen-to fit your lifestyle, your health profile, and even your job * natural alternatives to hormone replacement therapy (HRT), Viagra, Prozac, and Valium * expanded sections on nutraceuticals, homeopathy, and aromatherapy-and how to find the best practitioners in these fields * healing regimens-for heart patients, stroke victims, diabetics, and arthritis sufferers * new warnings-about dangerous drug interactions and \"miracle cures.\" Plus! Expanded sections on herbal teas and tinctures, beauty aids, diets, salt and sugar intake, and new ways to boost your energy level, fertility, and sex life.",
        "Category": " Health & Fitness , Diet & Nutrition , Vitamins",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Dear Cora . . . ",
        "Authors": "By Holmes, Cora",
        "Description": "",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Country Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "What Your Doctor May Not Tell You About Menopause (TM): The Breakthrough Book on Natural Hormone Balance (What Your Doctor May Not Tell You About...(Paperback))",
        "Authors": "By Lee, John R. and Hopkins, Virginia",
        "Description": "The Revolutionary Book About Bioidentical Hormone Replacement Therapy Now Fully Revised and Updated Over a decade ago, Dr. John Lee first published his startling conclusions about conventional hormone replacement therapy (HRT): synthetic hormones don't work as predicted and, worse, they pose a health threat to women. His findings touched off a storm of controversy. But years later, research has proved him right. Now millions of women concerned about aging must decide whether or not to undergo synthetic hormone replacement therapy-and suffer its side effects and increased health risks. Hundreds of thousands of women have listened to Dr. Lee's potentially life-saving advice and followed his groundbreaking, natural hormone program-experiencing amazing results. Newly revised and updated, this revolutionary book has the latest research, and Dr. Lee's effective plan for restoring balance using bioidentical hormones, including natural progesterone. Discover the benefits of his breakthrough program: * Reduce or eliminate premenopausal and menopausal symptoms * Help eliminate hormone-related problems such as osteoporosis, hot flashes, night sweats, vaginal dryness, weight gain, and fibrocystic breasts * Reduce \"middle age\" weight gain * Help restore sex drive * Protect against breast cancer * Maintain mental acuity * Help stop and reverse osteoporosis * Restore energy and vibrancy...slow the signs of aging.",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Balance",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "...And Then God Created Cat",
        "Authors": "By Morrison, Tomi",
        "Description": "",
        "Category": "",
        "Publisher": "The Oliver House",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "The Heart of Change: Real-Life Stories of How People Change Their Organizations",
        "Authors": "By Kotter, John P. and Cohen, Dan S.",
        "Description": "Why is organizational change so hard? Because in order to make any transformation successful, you must change more than just the structure and operations of an organization?you need to change people’s behavior. And that is never easy.The Heart of Change is your guide to helping people think and feel differently in order to meet your shared goals. According to bestselling author and renowned leadership expert John Kotter and coauthor Dan Cohen, this focus on connecting with people’s emotions is what will spark the behavior change and actions that lead to success. The Heart of Change is the engaging and essential complement to John Kotter’s international bestseller Leading Change.Building off of Kotter’s revolutionary eight-step process, this book vividly illustrates how large-scale business change can work. With real-life stories of people in organizations, the authors show how teams and individuals get motivated and activated to overcome obstacles to change?and produce spectacular results. Kotter and Cohen argue that change initiatives often fail because leaders rely too exclusively on data and analysis to get buy-in from their teams instead of creatively showing or doing something that appeals to their emotions and inspires them to spring into action. They call this the see-feel-change dynamic, and it is crucial for the success of any true organizational transformation.Refreshingly clear and eminently practical, The Heart of Change is required reading for anyone facing change and looking to build their leadership skills.Published by Harvard Business Review Press.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Harvard Business Review Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Pursuit of Justice",
        "Authors": "By Latt, Mimi",
        "Description": "Mimi Latt, author of the bestselling Powers of Attorney, is back with a gripping novel of a woman caught in a web of murder and legal intrigue, played out against Los Angeles's world of high-stakes lawyers and ruthless power brokers.  In Pursuit of Justice, she tells the David-and-Goliath story of Rebecca Morland, a young attorney who finds herself pitted against powerful legal and financial giants.  Rebecca Morland had a rosy future. She and her husband, Ryan, recently named a partner at one of Los Angeles's most prestigious law firms, were happy together and making plans to start a family. Then one night at a party, on a yacht owned by a wealthy and politically ambitious businessman, Ryan vanished. Two days later his body was found, and Rebecca's life was irrevocably turned upside down.  Suddenly she is faced with the question: How well did she know her husband? Were the rumors true that he had been depressed and drinking heavily the night he disappeared? Did he in fact embezzle funds from the law firm? Rebecca had sensed he was keeping something from her, but she has no idea what it could have been. When the police are only too happy to close the case, calling it a suicide, Rebecca refuses to accept that verdict.  Determined to find out what really happened to her husband, Rebecca sets out to discover the truth. What she doesn't realize is that in her pursuit of justice, she is putting her own life in grave danger.  Clearly someone wanted her husband out of the way; will they now succeed in stopping her as well?  There is no shortage of suspects...  Brandon Taylor: Head of the law firm of Taylor, Dennison & Evans and a candidate for California's open Senate seat. He had been Ryan's mentor and had recently named Ryan as his campaign manager. Was Brandon really the benign father figure that he appears to be?  Catherine Dennison: Another partner in the firm and a tenacious trial lawyer to whom winning is everything. As Ryan's rival and jealous ex-lover, she had a need for power. Did it drive her over the edge?  John Evans: Brandon's conniving nephew had always resented his uncle's affection for Ryan. Did his conviction that heading the law firm was his birthright give him a motive to take Ryan out of the picture?  Paul Worthington: Multimillionaire real-estate developer and Brandon's political opponent, whose dreams go beyond the Senate. His popularity had shot up in the polls since Ryan's death. Ryan disappeared from his yacht. Was Paul in any way responsible? And then there is his elegant socialite wife, Diana. To what lengths would she have gone to aid and abet her husband's ambitions?  Maxwell Holmes: A sinister political insider, aware of everyone's secrets and not above using them for his own advantage. Powerful and determined enough to put the man he wants in the Senate. Did Ryan get in his way?  With a cast of characters as intriguing and glamorous as they are devious and cunning, Pursuit of Justice keeps the reader turning the pages until the last",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Evil, Inc.",
        "Authors": "By Kaplan, Glenn",
        "Description": "Ken Olson thought he had it all—a loving wife, a beautiful baby, and a career on the fast track. But soon after his big promotion, his whole world is shattered by a monstrous crime. A crime committed by the CEO of his own company. A crime his company will cover up at any cost. Stripped of everything but his passion to bring the CEO to justice, Olson uncovers the dark and dangerous world behind the corporate jets and executive mansions—the private armies of mercenary killers who do the corporation’s dirtiest work under the guise of “plausible deniability,” the offshore banking havens with their clandestine black-hole accounts, and the relentless greed of the lucky few at the top.           Olson's struggle pits him against a host of deadly rivals—the most brutal killer in the international private military underworld, the network anchorwoman with a beautiful face and not a hint of conscience, the aristocrat who pulls the strings of power and never dirties his hands, the hot young actress who makes sex a tool of deception, and, of course, his own chief executive, a bloodthirsty psychopath who has hijacked the corner office.            Set against the backdrop of today’s business world, where mega-mergers slash thousands of jobs and yield million-dollar executive payouts, Evil, Inc. is a thrilling, ticking time bomb of a story—a tale of one man’s fight against the vicious, backstabbing politics of the corporation, where ruthless power mongers rule and human life counts for nothing against the bottom line.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "All We Know of Heaven: A Novel",
        "Authors": "By Rougeau, Remy",
        "Description": "With \"careful prose and a tone of humble striving\" (New York Times Book Review), this revelatory first novel by a cloistered monk traces a young man's search for wisdom among the inhabitants of a Cistercian monastery. In 1973, Paul Seneschal, a shy nineteen-year-old from rural Manitoba, takes flight from the world behind the wrought iron gates of St. Norbert Abbey. Here forty monks grow their own food, wake at three in the morning to pray, and converse largely through a spare but expressive vocabulary of hand signals. Renamed Brother Antoine, Paul strives for wisdom and holiness, yet life within the cloister can't block out all of humanity's foibles. One monk lapses into pyromania; another, a French Canadian, attacks any English-speaker who gets too close; another resembles \"a bald Martha Ray.\" We soon see that even in this rarefied realm, human folly nestles cheek by jowl with the divine. A wise yet refreshingly humorous account of a life of faith, ALL WE KNOW OF HEAVEN offers an a fascinating glimpse into a quiet world that very few people know about.",
        "Category": " Fiction , Religious",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Chronic Fatigue, Fibromyalgia, and Lyme Disease, Second Edition: An Alternative Medicine Definitive Guide (Alternative Medicine Guides)",
        "Authors": "By Goldberg, Burton",
        "Description": "Chronic fatigue, fibromyalgia, and Lyme disease can be permanently reversed using nontoxic alternative treatments. In this authoritative guide, more than 30 leading physicians explain their holistic diagnostic and treatment methods. Each chapter has been updated to reflect the latest research and therapeutic approaches to treating-and ultimately reversing-these debilitating conditions. Written by the authors of the acclaimed ALTERNATIVE MEDICINE: THE DEFINITIVE GUIDE (more than 600,000 copies sold), this book shows how to regain vitality, say goodbye to muscle pain, peak your immune system, and shake off depression with clinically proven therapies.The first edition sold more than 100,000 copies and is recognized as the leading alternative medicine guide to chronic fatigue.Contains new chapters on Lyme disease and holistic treatment options.Three million Americans suffer from chronic fatigue and an estimated three to six million suffer from fibromyalgia, 86 percent of whom are women.",
        "Category": " Health & Fitness , Diseases , Musculoskeletal",
        "Publisher": "Celestial Arts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Our Daily Meds: How the Pharmaceutical Companies Transformed Themselves into Slick Marketing Machines and Hooked the Nation on Prescription Drugs",
        "Authors": "By Petersen, Melody",
        "Description": "In the last thirty years, the big pharmaceutical companies have transformed themselves into marketing machines selling dangerous medicines as if they were Coca-Cola or Cadillacs. They pitch drugs with video games and soft cuddly toys for children; promote them in churches and subways, at NASCAR races and state fairs. They’ve become experts at promoting fear of disease, just so they can sell us hope.  No question: drugs can save lives. But the relentless marketing that has enriched corporate executives and sent stock prices soaring has come with a dark side. Prescription pills taken as directed by physicians are estimated to kill one American every five minutes. And that figure doesn’t reflect the damage done as the overmedicated take to the roads.  Our Daily Meds connects the dots for the first time to show how corporate salesmanship has triumphed over science inside the biggest pharmaceutical companies and, in turn, how this promotion driven industry has taken over the practice of medicine and is changing American life.  It is an ageless story of the battle between good and evil, with potentially life-changing consequences for everyone, not just the 65 percent of Americans who unscrew a prescription cap every day. An industry with the promise to help so many is now leaving a legacy of needless harm.",
        "Category": " Business & Economics , Industries , General",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Schaum's Quick Guide to Writing Great Essays",
        "Authors": "By McClain, Molly and Roth, Jacqueline D.",
        "Description": "The Fastest, Easiest Way to Learn: Schaum's Quick GuidesThese concise, quick reference guides are perfect for business people, writers, and students at all levels. Written by top experts, they offer readers the easiest, most efficient strategies to master or learn a new skill. All Schaum's Quick Guides include do's and don'ts for avoiding common errors, handy checklists, and practice exercises for building skills quickly.",
        "Category": " Language Arts & Disciplines , Rhetoric",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Vegetarian Meals Good Housekeeping Favorite Recipes (Favorite Good Housekeeping Recipes)",
        "Authors": "By The Editors of Good Housekeeping",
        "Description": "Healthful, nutritious, and most of all, delicious: with 155 mouthwatering recipes, Good Housekeeping shows you how easy it can be to put a meat-free meal on the table that everyone in the family will love. More and more people are going vegetarian?but how can you create a balanced, nourishing dinner without meat that also whets the family’s appetite? Good Housekeeping has the tasty answers, with expert advice from a recognized nutritionist on all the basics, including how to make sure the food is rich in protein, vitamins, and other nutrients. The appealing and temptingly diverse dishes?shown in enticing color photos?include soups and stews, one-dish dinners, quick and easy suppers, lunches and brunches, and main-dish salads. Who could resist Classic Risotto, Spinach and Corn Quesadillas, Red Bean and Collard Gumbo, or Portobello Burgers?  Special tips throughout the book explain simple cooking techniques, smart time-savers, and where to find the right ingredients.",
        "Category": " Cooking , Vegetarian",
        "Publisher": "Hearst",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Smoothies: Over 100 Fabulous Blended Drinks from Breakfast Boosters to Indulgent Treats",
        "Authors": "By Pickford, Louise and Wallace, Ian (ILT)",
        "Description": "",
        "Category": " Cooking , Beverages , Juices & Smoothies",
        "Publisher": "Ryland Peters & Small",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Happy Family: Poems",
        "Authors": "By Shore, Jane",
        "Description": "Jane Shore is among the most gifted and accomplished poets writing in America. Profoundly moving and meticulously crafted, Happy Family brilliantly traces the scope of a woman's life from childhood to her own parenthood.",
        "Category": " Poetry , American , General",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Drowning Ruth",
        "Authors": "By Schwarz, Christina",
        "Description": "Deftly written and emotionally powerful, Drowning Ruth is a stunning portrait of the ties that bind sisters together and the forces that tear them apart, of the dangers of keeping secrets and the explosive repercussions when they are exposed. A mesmerizing and achingly beautiful debut.Winter, 1919. Amanda Starkey spends her days nursing soldiers wounded in the Great War. Finding herself suddenly overwhelmed, she flees Milwaukee and retreats to her family's farm on Nagawaukee Lake, seeking comfort with her younger sister, Mathilda, and three-year-old niece, Ruth. But very soon, Amanda comes to see that her old home is no refuge--she has carried her troubles with her. On one terrible night almost a year later, Amanda loses nearly everything that is dearest to her when her sister mysteriously disappears and is later found drowned beneath the ice that covers the lake. When Mathilda's husband comes home from the war, wounded and troubled himself, he finds that Amanda has taken charge of Ruth and the farm, assuming her responsibility with a frightening intensity. Wry and guarded, Amanda tells the story of her family in careful doses, as anxious to hide from herself as from us the secrets of her own past and of that night.Ruth, haunted by her own memory of that fateful night, grows up under the watchful eye of her prickly and possessive aunt and gradually becomes aware of the odd events of her childhood. As she tells her own story with increasing clarity, she reveals the mounting toll that her aunt's secrets exact from her family and everyone around her, until the heartrending truth is uncovered.Guiding us through the lives of the Starkey women, Christina Schwarz's first novel shows her compassion and a unique understanding of the American landscape and the people who live on it.",
        "Category": " Fiction , Historical",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Mission Not Accomplished: How George Bush Lost the War on Terrorism",
        "Authors": "By Turner, William W.",
        "Description": "",
        "Category": " Social Science , Reference",
        "Publisher": "Penmarin Books Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Pocket Muse: Ideas and Inspirations for Writing",
        "Authors": "By Wood, Monica",
        "Description": "Novelist, short story writer, and part-time teacher Wood offers first aid for aspiring writers who find nothing in their world interesting enough to write about: quotations and black-and-white photographs. The volume is small enough to carry in pocket or purse, but visible enough to spark conversation if held correctly. The Muse has no index or bibliography (or cell phone number). Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Reference , Writing Skills",
        "Publisher": "Writers Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Little Women: The Children's Picture Book",
        "Authors": "By Alcott, Louisa May, Lawlor, Laurie, and Swicord, Robin",
        "Description": "This lavishly illustrated book recasts for a whole new generation of children, from ages three and up, the touching drama of the March family--spirited Jo, beautiful Meg, sensitive Beth, and romantic Amy--as they make their transition from girlhood to womanhood. Children's Picture Book. Ages 3 up. 42 color photographs throughout from the hit film starring Winona Ryder.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Newmarket Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2012"
        }
    },
    {
        "Title": "Medical Myths That Can Kill You: And the 101 Truths That Will Save, Extend, and Improve Your Life",
        "Authors": "By Snyderman, Nancy L., M.D.",
        "Description": "Do you know what’s really good for you?In this age of countless miracle cures, it’s vital to separate the myths that endanger your health from the medical facts you need.  FACT: Unfiltered coffee can clog your arteries.FACT: Donating blood may lower your risk of heart disease.FACT: You don’t really need eight glasses of water a day.FACT:Coughing won’t help if you’re having a heart attack. (But aspirin will!)We’ve become a nation of cyberchondriacs, diagnosing ourselves with false information and half-truths found on sketchy websites. In Medical Myths That Can Kill You, Dr. Nancy Snyderman, chief medical editor for NBC News, provides clear, practical, scientifically proven advice that can lead you to a healthier, happier life.Discover the simple, everyday things that affect well-being, and get the information you need to revitalize your body, maintain your longevity, manage your care, and possibly even save a life–yours.",
        "Category": " Medical , General",
        "Publisher": "Crown Archetype",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "An Occasion of Sin",
        "Authors": "By Greeley, Andrew M.",
        "Description": "The relationship between a cardinal and a beautiful woman comes under scrutiny when the cardinal is martyred and becomes a candidate for sainthood",
        "Category": " Fiction , Religious",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "The Eat-Clean Diet Workout: Quick Routines for Your Best Body Ever (with DVD)",
        "Authors": "By Reno, Tosca",
        "Description": "Eating Clean gets and keeps you lean. But if you want your metabolism to burn faster than ever before; if you want to shape the body you've always wanted; then The Eat-Clean Diet Workout is for you.Think fitness comes only with hour upon hour of exercise? Nope! Tosca will show you that you can have a better body than you ever dreamed possible, in 30 minutes a day, four days a week. Don't believe it? You will, 'cause Tosca's workout will get you there.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "The Candida Control Cookbook: What You Should Know and What You Should Eat to Manage Yeast Infections (New Revised & Updated Edition)",
        "Authors": "By Burton, Gail and Rosenbaum, Michael E. (INT)",
        "Description": "",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Aslan Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "In the Heart of the Country: A Novel",
        "Authors": "By Coetzee, J M",
        "Description": "A story told in prose as feverishly rich as William Faulkner's, In the Heart of the Country is a work of irresistable power. J.M. Coetzee's latest novel, The Schooldays of Jesus, is now available from Viking. Late Essays: 2006-2016 will be available January 2018. On a remote farm in South Africa, the protagonist of J. M. Coetzee's fierce and passionate novel watches the life from which she has been excluded. Ignored by her callous father, scorned and feared by his servants, she is a bitterly intelligent woman whose outward meekness disguises a desperate resolve not to become \"one of the forgotten ones of history.\" When her father takes an African mistress, that resolve precipitates an act of vengeance that suggests a chemical reaction between the colonizer and the colonized—and between European yearnings and the vastness and solitude of Africa. With vast assurance and an unerring eye, J. M. Coetzee has turned the family romance into a mirror of the colonial experience.",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1982"
        }
    },
    {
        "Title": "The Evolution Book",
        "Authors": "By Stein, Sara",
        "Description": "How did life begin? What makes the continents move? Are Birds really dinosaurs? The answers to such questions can be discovered by reading the ancient messages left on the earth. Sara Stein, author of The Science Book and The Body Book, involves children, who are earth's newest inhabitants, in exploring beaches, mountains, woodlands, and swamps and unlocking the ancient secrets of the world. Scores of fascinating projects range from raising tadpoles and preserving snake skins and paw prints to making a plankton net, a plant press, and seaweed pudding. Hundreds of drawings and photographs are featured throughout. Selection of the Children's Book-of-the-Month Club. Winner of the New York Academy of Sciences Children's Science Book Award, First Prize. Suitable for ages 10-14. 73,000 copies in print.",
        "Category": " Juvenile Nonfiction , Science & Nature , Biology",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Isis Rising",
        "Authors": "By Stewart, Jean",
        "Description": "",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Rising Tide Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "New American Cheese, The",
        "Authors": "By Jacobs, Martin (PHT), Jacobs, Martin, Werlin, Laura, and Jenkins, Steven (FRW)",
        "Description": "Celebrating the great cheese renaissance in America, this luscious illustrated cookbook pays tribute to the nation's new love affair with a favorite food, looking at the art of cheesemaking and sharing a host of inventive recipes designed to make cheese lovers smack their lips. BOMC.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "The Sneaky Chef: Simple Strategies for Hiding Healthy Foods in Kids' Favorite Meals",
        "Authors": "By Lapine, Missy Chase",
        "Description": "Parents will do almost anything to get their kids to eat healthier, but unfortunately, they&#39;ve found that begging, pleading, threatening, and bribing don&#39;t work. With their patience wearing thin, parents will &#147;give in” for the sake of family peace, and reach for &#147;kiddie” favorites-often nutritionally inferior choices such as fried fish sticks, mac n&#39; cheese, Pop-sicles, and cookies. Missy Chase Lapine, former publisher of Eating Well magazine, faced the same challenges with her two young daughters, and she sought a solution. Now in The Sneaky Chef, Lapine presents over 75 recipes that ingeniously disguise the most important superfoods inside kids&#39; favorite meals. With the addition of a few simple make-ahead purees or clever replacements, (some may surprise you!) parents can pack more fiber, vitamins, and antioxidants in their kids&#39; foods. Examples of &#147;Sneaky” recipes include: No Harm Chicken Parm Power Pizza Incognito Burritos Guerilla Grilled Cheese Brainy Brownies Health-by-Chocolate Cookies Quick fixes for Jell-O(R)",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Running Press Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Angels All Over Town",
        "Authors": "By Rice, Luanne",
        "Description": "New York Times bestselling author Luanne Rice made her triumphant debut with this delicately drawn but emotionally powerful portrait of a woman’s extraordinary journey of the heart and soul–a timeless story of love, sisterhood, and the hope that emerges even out of heartbreak....Una Cavan doesn’t believe in ghosts. But ghosts seem to believe in her. At least, her father’s ghost does, walking into and out of her life as casually as if he were entering and exiting a room. Una has always believed the Cavan women had the power of witches, and from the beaches of Connecticut to the bustle of New York City they’ve shared the special unbreakable bond of sisters. No man has been able to come between them…until Lily marries the “perfect” man and begins to drift away and Margo gets engaged. With another failed relationship behind her, and a thriving career as an actress ahead of her, Una wonders if she’s destined to be alone–or if there isn’t something more, something magical that life has in store for her. Then an unexpected encounter gives her the answer she’s been seeking….",
        "Category": " Fiction , Family Life",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Prescription for Nutritional Healing, 4th Edition",
        "Authors": "By Balch, Phyllis A.",
        "Description": "Natural health's number-one bestseller for more than twenty years, completely revised and updated.  With more than five million copies sold, Prescription for Nutritional Healing is the most trusted, comprehensive source on dietary supplements, vitamins, minerals, and herbs. A pioneer in the field of nutritional healing, Phyllis Balch passionately and meticulously researched and compiled this groundbreaking book. Now, a generation later, her message has more relevance than ever: consume fresh foods, avoid processed foods and those high in saturated fat, and optimize your intake of essential nutrients with the right supplements. Today's well-stocked vitamin and natural-health stores can be confusing, and people need Balch's clear, concise, landmark guide.  To help them make sense of the mind-numbing array of choices that are available, readers of Prescription for Nutritional Healing will:  - learn the basics of good nutrition; - find out how to balance vitamins and minerals so that the body can properly absorb both; - determine how best to treat 250 problems-from abscesses to wrinkles-using herbs, nutrition, and supplements; and - get the facts on other complementary therapies, like ayurveda, biofeedback, chiropractic care, and more. Prescription for Nutritional Healing is an essential resource for  every health-minded consumer.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Avery Trade",
        "Price Starting With ($)": "27.83",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Williams-Sonoma Essentials of Healthful Cooking: Recipes and Techniques for Wholesome Home Cooking",
        "Authors": "By Williams, Chuck (EDT), Hess, Mary Abbot (EDT), Jacobi, Dana (CON), Simmons, Marie (CON), Tucker (PHT), and Hossler (PHT)",
        "Description": "A fresh approach to healthy cooking emphasizes the creative use of ingredients to ensure maximum freshness, flavor, and nutrition and presents more than 130 tempting recipes, full-color photographs of every finished dish, how-to images to teach a variety of cooking techniques, nutritional sidebars, a detailed glossary, and suggestions for alternative toppings, sauces, and accompaniments. 20,000 first printing.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Turkish Gambit (Erast Fandorin)",
        "Authors": "By Bromfield, Andrew (TRN) and Akunin, Boris",
        "Description": "“[An] elegantly spun yarn . . . Akunin’s wonderful novels are always intricately webbed and plotted.”–The Providence JournalIt is 1877, and war has broken out between Russia and the Ottoman Empire. In the treacherous atmosphere of a Russian field army, former diplomat and detective extraordinaire Erast Fandorin stumbles upon his most confounding case. Its difficulties are only compounded by the presence of Varya Suvorova, a deadly serious (and seriously beautiful) woman with revolutionary ideals who has disguised herself as a boy in order to reunite with her respected comrade and fiancé. Even after Fandorin saves her life, Varya can hardly bear to thank such a “lackey of the throne” for his efforts. When Varya’s fiancé is accused of espionage and faces execution, however, she must turn to Fandorin to find the real culprit . . . a mission that forces her to reckon with his courage, deductive mind, and piercing gaze.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Mastering the Grill: The Owner's Manual for Outdoor Cooking",
        "Authors": "By Joachim, David and Schloss, Andrew",
        "Description": "Grilling is a science, and it's only when you understand the science of grilling that you can transform it into an art. That's what makes Mastering the Grill a standout on the cookbook shelf. From equipment (grill types and tools) to fire (wood, charcoal, or gas) to ingredients (meat, poultry, fish, and vegetables), the authors have shared their impressive grilling know-how to explain the whys and the howsand guarantee the wowsclearly and comprehensively. In addition to hundreds of tips and techniques, this ultimate guide is packed with how-to illustrations and mouthwatering photographs plus 350 surefire recipeseverything from rubs and marinades to appetizers, entrees, side dishes, and desserts. Mastering the Grill is a master class in cooking, destined to become a sauce-stained, well-thumbed classic.",
        "Category": " Cooking , Methods , Barbecue & Grilling",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "8.37",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Cover & Bake (Best Recipe)",
        "Authors": "By Cook's Illustrated Magazine (EDT), Burgoyne, John (ILT), Van Ackere, Daniel J. (PHT), and Tremblay, Carl (PHT)",
        "Description": "Presents more than two hundred one-dish recipes, including such traditional favorites as lasagna, pot roast, chicken pot pie, and baked macaroni and cheese.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Cook's Illustrated",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "In the Garden of the North American Martyrs",
        "Authors": "By Wolff, Tobias",
        "Description": "",
        "Category": "",
        "Publisher": "Distributed by W.W. Norton & Co., Inc.,c1981.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Angel Carver",
        "Authors": "By Thomas, Rosanne Daryl",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Hard Call: Great Decisions and the Extraordinary People Who Made Them",
        "Authors": "By McCain, John and Salter, Mark",
        "Description": "At some point in our lives, we all face tough decisions and have to make that hard call. In this remarkable book, Senator McCain and Mark Salter use experiences of both extraordinary people and people in extraordinary circumstances to dramatically describe the anatomy of a great decision. Highlights include:- Henry Ford's decision to sacrifice his company's competitive edge by reducing the work day and guaranteeing a minimum wage.- Branch Rickey's decision to offer Jackie Robinson a contract to play for the Brooklyn Dodgers in the face of public opposition.- Ellen Johnson-Sirleaf 's decision to return to wartorn Liberia after receiving an economics degree from Harvard.- General Fred Weyand's decision to redeploy fifteen of his battalions despite resistance from senior American military commanders in Vietnam.- And much more.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Twelve",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Silent No More: Bringing moral clarity to America…while freedom still rings",
        "Authors": "By Parsley, Rod",
        "Description": "A CALL FOR CLARITY IN A CONFLICTED CULTURE Cutting through the clutter of conflicting extremes, Rod Parsley has a perspective that enables him to see clearly and speak forthrightly to the issues of our time. Parsley believes a consensus of common sense can be crafted even in the midst of inflamed and polarized passions.IT'S TIME TO SPEAK OUT!\" America's future depends on moral champions like Rod Parsley.\"-The Honorable Walter Jones, U.S. Congressman, North CarolinaThis book should inspire men and women of faith...and make 'values voters' a force that politicians can no longer ignore.\" -The Honorable Kenneth Blackwell, Secretary of State, Ohio\"Silent No More does not merely lay out the scope of the challenge, but also offers the information and action steps essential to the solution.\" -The Honorable Tony Perkins, President, Family Research Council\"Rod Parsley is the real deal-a bold, dynamic man of faith who's committed to doing the right thing no matter what. This book...is a proven, winning game plan.\" -Ted Haggard, Sr. Pastor, New Life Church, Colorado President, National Association of Evanelicals",
        "Category": " Religion , Religion, Politics & State",
        "Publisher": "Frontline",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "The One:  A Realistic Guide To Choosing Your Soul Mate",
        "Authors": "By Young, Ben and Adams, Sam",
        "Description": "In their bestselling book, The Ten Commandments of Dating, Ben Young and Samuel Adams showed singles how to date effectively. Now \"The One\" shows Christians who to date and how to negotiate the difficulties of choosing a soul mate. The biggest question on the minds of the 78 million singles in America is simply this: \"How can I find the right one?\" This book answers that question, giving entertaining yet practical advice for that seemingly endless quest to find \"TheOne.\" This book emphasizes free will, personal responsibility, proactivity, and preparation, helping singles avoid the pitfalls of dangerous beliefs and hyper-spirituality. Single Christians will learn what approaches to avoid in mate selection, recognize the myths about finding true love, and learn practical strategies for finding the right person to marry.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.3",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The Ezekiel Option: A Jon Bennett Series Political and Military Action Thriller (Book 3)",
        "Authors": "By Rosenberg, Joel C.",
        "Description": "Book 3 in the Last Jihad seriesOver 375,000 sold!More than 3,000 5-star ratings on Goodreads“One of the most entertaining and thought-provoking novelists of our day. Regardless of your political views, you’ve got to read his stuff.” —Rush Limbaugh, radio hostWhen Russia’s richest oil baron is killed, Moscow suddenly teeters on the verge of political chaos. Tehran races to complete its nuclear arsenal. Washington finds herself dangerously divided from her European allies. A new evil looms on the horizon. A dictator is rising in Russia. Iran is feverishly building nuclear weapons. A new axis of evil is emerging, led by Moscow and Tehran. And Jon Bennett and Erin McCoy, two senior White House advisors, find themselves facing the most chilling question of their lives: is the world rushing to the brink of an apocalypse prophesied more than 2,500 years ago?",
        "Category": " Fiction , Christian , Suspense",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Decorating 1-2-3 (Home Depot ... 1-2-3)",
        "Authors": "By Home Depot (EDT)",
        "Description": "From the experts at America's leading home center comes an array of stylish decorating projects for the home in a home design resource that includes more than one hundred separate projects, more than one thousand full-color photographs, and hundreds of helpful decorating tips. 225,000 first printing.",
        "Category": " House & Home , Decorating",
        "Publisher": "The Home Depot",
        "Price Starting With ($)": "7.42",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Consumer's Guide to Psychotherapy",
        "Authors": "By Goleman, Daniel and Engler, Jack",
        "Description": "Explains when therapy should be considered, offers advice on selecting, contracting, and paying a therapist, and discusses professional ethics, psychiatric disorders, and the behavioral problems of children",
        "Category": " Health & Fitness , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Questions of Life: A Practical Introduction to the Christian Faith",
        "Authors": "By Gumbel, Nicky",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "David C. Cook",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Stardust on My Pillow: Stories to Sleep On",
        "Authors": "By Clairmont, Patsy",
        "Description": "Best-selling Author and Beloved Storyteller Patsy Clairmont Takes an All-New Approach to Her Message of Encouragement, Healing, and Hope.From \"Boxed In,\" the story of a woman making a startling discovery about a distant aunt she never really knew, to \"Cloistered,\" the tale of a severely phobic woman being gently wooed back into life, popular speaker and writer Patsy Clairmont has crafted a beautiful and impressive first collection of short fiction. Through the fourteen tales featured in Stardust on My Pillow, Patsy sensitively explores the themes of compassion and kindness, holiness and hope, while providing beautifully written inspiration for all of us who desire to spread a little stardust of our own. Quotes:\"Patsy Clairmont has a sensitive and compassionate voice as a storyteller.\"-Francine Rivers, author\"I rarely read fiction, but when I do it had better be good. Well, let me tell you, friends, this is good. It incorporates Patsy's extraordinary communication skills with her unique ability to weave a charming and fantastic story. Plan to stay up late and be dazzled by stardust.\"-LuciSwindoll, author and speaker\"Like a vase holding a spring bouquet, Patsy's book holds a wonderful variety of stories, each one with emotional color and a lingering fragrance all its own.\"-Ken Gire, author \"As endearing as Patsy herself, these honest, poignant tales bring home messages of grace, truth, and above all, hope.\"        -Liz Curtis Higgs, author and speaker\"Patsy's short stories are sure to warm your heart and soul. Simply one of the most delightful reading experiences I've had in a long time.\"-Shelley Breen, Point of GraceShort Stories to Bolster Your SpiritPetite, playful, and profound. These words help to describe Patsy Clairmont's size, message, and humor. Gifted with both a quick wit and a sure command of God's Word, Patsy can simultaneously bring laughter to her audiences while imparting deep, life-changing insights. Known today as a best-selling author and popular speaker who addresses thousands of women at national conferences, Patsy once suffered as a prisoner in her own home because of agoraphobia (fear of open spaces). Her experience has given her a deep appreciation of God's healing power. In Stardust on My Pillow, Patsy courageously and skillfully breaks new ground, offering her message of God's grace for the first time through the medium of short fiction. In fourteen touching and tender tales, she explores the mystery and faithfulness of God's goodness and love, as experienced and demonstrated by his people.",
        "Category": " Religion , Christianity , Literature & the Arts",
        "Publisher": "WaterBrook Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The Complete Book of Exercise Walking",
        "Authors": "By Yanker, Gary D.",
        "Description": "Discusses the importance of walking for physical fitness, describes techniques of walking, and explains how to convert walking activities into an exercise program",
        "Category": " Medical , General",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2013"
        }
    },
    {
        "Title": "Playwright and Historical Change: Dramatic Strategies in Brecht, Hauptmann, Kaiser and Wedekind",
        "Authors": "By Shaw, Leroy R.",
        "Description": "",
        "Category": " Literary Criticism , General",
        "Publisher": "Univ of Wisconsin Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1970"
        }
    },
    {
        "Title": "Chronicles of the Crusades (Penguin Classics)",
        "Authors": "By Villehardouin, Geoffroi De",
        "Description": "Two famous, firsthand accounts of the holy war in the Middle Ages translated by Margaret R. B. Shaw Originally composed in Old French, the two chronicles brought together here offer some of the most vivid and reliable accounts of the Crusades from a Western perspective. Villehardouin's Conquest of Constantinople, distinguished by its simplicity and lucidity, recounts the controversial Fourth Crusade, which descended into an all-out attack on the E astern Christians of Byzantium. In Life of Saint Louis, Joinville draws on his close attachment to King Louis IX of France to recall his campaigning in the Holy Land. Together these narratives comprise a fascinating window on events that, for all their remoteness, offer startling similarities to our own age.For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "Category": " History , Military , General",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1963"
        }
    },
    {
        "Title": "Best \"Thinking Machine\" Detective Stories",
        "Authors": "By Futrelle, Jacques",
        "Description": "A collection of unique detective stories starring the famed Thinking Machine, Augustus Van Dusen, whose incredible mind solves seemingly impossible problems",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Dover Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "What is GOD Like? The Biblical God for Contemporary Man",
        "Authors": "By Lescelius, Robert H.",
        "Description": "",
        "Category": "",
        "Publisher": "Roadbuilding for Revival Series",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Spurgeon & Revival: Only a Revived Church Brings Glory to God",
        "Authors": "By Lescelius, Robert H.",
        "Description": "",
        "Category": "",
        "Publisher": "Revival Literature",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Word of God on Trial",
        "Authors": "By robert-j-barnett",
        "Description": "",
        "Category": "",
        "Publisher": "Revival Literature",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Turn Your Church Inside Out: Building a Community for Others",
        "Authors": "By Kallestad, Walt",
        "Description": "",
        "Category": " Religion , Christian Ministry , Pastoral Resources",
        "Publisher": "Augsburg Fortress Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Government Nannies",
        "Authors": "By Duffy, Cathy",
        "Description": "",
        "Category": " Political Science , American Government , General",
        "Publisher": "Noble Pub Assoc/Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Beach Babe (Babymouse #3)",
        "Authors": "By Holm, Jennifer L. and Holm, Matthew",
        "Description": "NEW YORK TIMES bestselling and Newbery Honor winning author Jennifer Holm teams up with Matthew Holm to bring you a fully illustrated graphic novel series packed with humor and kid appeal—BABYMOUSE!    With multiple Children's Choice awards and over 1.7 million books in print, kids, parents, and teachers agree that Babymouse is perfect for fans of Junie B. Jones, Ivy and Bean, Big Nate, Dork Diaries, and the Ramona chapter books!Grab your sunglasses! School’s out and Babymouse is headed to the beach for a week  of sun, sand, surfing, snorkeling, and sharks! That’s right, folks . . . sharks! Looks like Babymouse’s summer fun isn’t shaping up quite the way she expected! Will  Babymouse survive her summer vacation? Will she be the surfing star she dreams of  being . . . or is she sharkbait?! Find out in Beach Babe—the 3rd hilarious, action-packed installment of the beloved Babymouse graphic novel series!Here's what people are saying about Babymouse! The  Chicago Sun-Times: \"Move over, Superman, here comes  Babymouse!\" Starred Review, The Horn  Book: \"Nobody puts Babymouse in the corner!\"  Booklist: \"Cute, smart, sassy Babymouse is fun and funny, and this book, like its  predecessors, will draw reluctant readers as well as Babymouse fans.\"The Bulletin: \"An almost absurdly likeable  heroine.\"",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Random House Graphic",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Ahab's Wife: Or, The Star-Gazer: A Novel",
        "Authors": "By Naslund, Sena Jeter and Wormell, Christopher (ILT)",
        "Description": "From the opening line--\"Captain Ahab was neither my first husband nor my last\"--you will know that you are in the hands of a masterful storyteller and in the company of a fascinating woman hero. Inspired by a brief passage in Melville's Moby-Dick, where Captain Ahab speaks passionately of his young wife on Nantucket, Una Spenser's moving tale \"is very much Naslund's own and can be enjoyed independently of its source.\" (Newsday) The daughter of a tyrannical father, Una leaves the violent Kentucky frontier for the peace of a New England lighthouse island, where she simultaneously falls in love with two young men. Disguised as a boy, she earns a berth on a whaling ship where she encounters the power of nature, death, and madness, and gets her first glimpse of Captain Ahab. As Naslund portrays Una's love for the tragically driven Ahab, she magnificently renders a real, living marriage and offers a new perspective on the American experience. Immediately immersed in this world, the reader experiences a brilliantly written, vibrant, uplifting novel--a bright book of life. Ahab's Wife was a main selection of the Book of the Month Club, chosen by Time magazine as one of the top five novels of 1999, selected by Book Sense as one of the top five books of the year, chosen by the New York Times as a Notable Book of 1999, and chosen as a Best Book by Publishers Weekly.Ahab's Wife is being reprinted in Australia and England, translated into German, Hebrew, Spanish and Portuguese.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "HarpPeren",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Tree of Life",
        "Authors": "By Nissenson, Hugh",
        "Description": "Traces the life and relationships of New Englander Tom Keene, as he and other settlers struggle for survival in Richland County, Ohio, the furthest reaches of the American frontier in 1811-12",
        "Category": " Fiction , Historical",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "The contemporary presidency",
        "Authors": "By Dorothy Buckton James",
        "Description": "Traces the changes and trends in the president's power and role since Franklin D. Roosevelt",
        "Category": "",
        "Publisher": "Pegasus",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "The Long Surrender",
        "Authors": "By Davis, Burke",
        "Description": "Chronicles the collapse of the Confederacy and the flight of Jefferson Davis and his cabinet in an effort to escape capture and surrender",
        "Category": " History , United States , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "29.96",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "Painless Algebra (Painless Series)",
        "Authors": "By Long, Lynette and Morehouse, Hank (ILT)",
        "Description": "For students who are intimidated by all forms of math, here is a set of easy steps that lead to an understanding of elementary algebra. The author defines all terms, points out potential pitfalls in algebraic calculation, and makes problem solving a fun activity. New in this edition are painless approaches to understanding and graphing linear equations, solving systems of linear inequalities, and graphing quadratic equations.  Barron’s popular Painless Series  of study guides for middle school and high school students offer a lighthearted, often humorous approach to their subjects, transforming details that might once have seemed boring or difficult into a series of interesting and mentally challenging ideas. Most titles in the series feature many fun-to-solve “Brain Tickler” problems with answers at the end of each chapter.",
        "Category": " Mathematics , Algebra , General",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Psychotherapy with Children",
        "Authors": "By Gardner, Richard A.",
        "Description": "",
        "Category": " Psychology , Clinical Psychology",
        "Publisher": "Jason Aronson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Haunted Animals: True Ghost Stories",
        "Authors": "By Zullo, Allan",
        "Description": "Presents nine tales involving a variety of animal ghosts",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Horace's School: Redesigning the American High School (Study of High Schools)",
        "Authors": "By Sizer, Theodore R.",
        "Description": "An educational expert offers a proposal for the restructuring of America's high schools that respects old traditions, yet moves forward to prepare adolescents for the future",
        "Category": " Education , Secondary",
        "Publisher": "Houghton Mifflin School",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Intelligent Guide to Texas Hold'em Poker",
        "Authors": "By Braids, Sam",
        "Description": "Whether you're an expert or a first-time player, this concise, comprehensive guide, is packed with tips and information you need to know. For beginners, you'll learn the rules of Texas Hold'em, basic strategy, and how to play in a cardroom. More advanced players will benefit from statistical charts, vignettes from actual poker games, and detailed information on how the social and psychological aspects of the game determine strategy.Readers also learn the unique view that an expert chess player brings to analyzing poker, as author Sam Braids compares and contrasts the two games, Look inside for some of the charts and information---in highly usable formats---you can put to use right now:\"An excellent book for the losing player looking to win or for the novice looking to learn the game for the first time, Braids excels in explaining the sometimes-confusing concepts necessary for profitable Texas Hold'em play, by breaking down the subject into meaningful bite-sized pieces. He then includes many actual hand situations to illustrate the clear points he is making. This is a masterful book, and an excellent addition to the poker literature.\"---Ashley Adams, Host of the radio show House of Cards",
        "Category": " Games , Card Games , Poker",
        "Publisher": "Intelligent Games Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Understanding Eternal Security (The in Touch Study Series)",
        "Authors": "By Stanley, Charles F.",
        "Description": "Dr. Charles Stanley's new series of Bible study guides feature insights and wisdom of this beloved pastor and author.  Small groups and individuals who want a Bible study that's spiritually sound and practical will find a wealth of ideas to help them understand and apply the Scriptures to the real world.  Each title takes a unique fourfold approach to get the most out of Bible study time - emphasizing personal identification with the Scripture passage, recognition of your emotional response, reflection of the passage's meaning and application, and taking steps to apply what's been learned.  This is a sound way to explore the Word of God.",
        "Category": " Religion , Biblical Studies , Bible Study Guides",
        "Publisher": "Nelson Reference & Electronic Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Cultivating a Life for God: Multiplying Disciples Through Life Transformation Groups",
        "Authors": "By Neil Cole",
        "Description": "",
        "Category": "",
        "Publisher": "Church Smart Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Disappointment with God",
        "Authors": "By Yancey, Philip",
        "Description": "Philip Yancey has a gift for articulating the knotty issues of faith. In Disappointment with God, he poses three questions that Christians wonder but seldom ask aloud: Is God unfair? Is he silent? Is he hidden? This insightful and deeply personal book points to the odd disparity between our concept of God and the realities of life. Why, if God is so hungry for relationship with us, does he seem so distant? Why, if he cares for us, do bad things happen? What can we expect from him after all? Yancey answers these questions with clarity, richness, and biblical assurance. He takes us beyond the things that make for disillusionment to a deeper faith, a certitude of God's love, and a thirst to reach not just for what God gives, but for who he is.",
        "Category": " Religion , Christian Living , Personal Growth",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "60-Second Shiatzu: How to Energize, Erase Pain and Conquer Tension in One Minute",
        "Authors": "By Shaw, Eva",
        "Description": "Explains the use of Japanese pressure and massage techniques for relaxation and pain relief and briefly discusses the history of shiatzu",
        "Category": "",
        "Publisher": "Henry Holt & Co (P)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "Harlequin Pink: A Girl In A Million",
        "Authors": "By Neels, Betty and Itoh, Kako (ILT)",
        "Description": "Dark Horse Manga and Harlequin Books are delighted to present a shining new line of books that marry two of the most successful phenomenon to hit bookstores - bestselling Harlequin romance fiction and female-friendly Japanese manga! These sparkling manga adaptations of Harlequin's best-selling titles are a romantic step above much of the cookie-cutter manga hitting the shelves today.   A vacation fling was completely out of character for old-fashioned Carol, but her attraction to intriguing, older Marius tempted her to break her own rules. The next thing she knew, though, he'd turned up working at her hospital! Does she have what it takes to attract - much less keep the attentions of - this intimidating, sophisticated, and utterly compelling man?",
        "Category": " Young Adult Fiction , Comics & Graphic Novels , Manga",
        "Publisher": "Dark Horse",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Chasing Shakespeares",
        "Authors": "By Smith, Sarah",
        "Description": "With this exhilarating novel from the author the San Francisco Chronicle calls \"daring\" and \"splendid,\" Sarah Smith cuts to the heart of one of literature's most fascinating and enduring mysteries: the enigma of Sir William Shakespeare.  Meet Joe Roper, a thoroughly modern graduate student who has landed the job of a lifetime working in the famed Kellogg Collection of Elizabethan texts and curiosities. He's been passionate about Shakespeare since reading a duct-taped paperback copy of Macbeth as a kid. But if all the world's a stage, Joe's working-class roots do little to prepare him for his role in the academic arena. Enter Posy Gould, stage right. A glamorous rising star at Harvard, she insists that a letter Joe's found, signed by one W. Shakespeare of Stratford, is a career-making discovery for them both -- particularly because the letter suggests that the plays were not written from Shakespeare's quill. What follows is a literary adventure story that places Joe and Posy in a world where the London Eye looks out over Shakespeare's city, Hollywood producers rub elbows with the Queen's court, and an unsolved mystery spans across five centuries and two continents. A first-rate thriller from one of the masters of the genre, Chasing Shakespeares is also an enduring tale about love, art, and poetic justice.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "A place called school: Prospects for the future (A Study of schooling in the United States)",
        "Authors": "By Goodlad, John I",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw Hill Book co.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Planet Janet",
        "Authors": "By Sheldon, Dyan",
        "Description": "\"The fast-paced, clever writing . . . will keep teens eagerly reading and sharing passages with each other to the end.\" — BOOKLISTWith a Mad Cow for a mother, an eccentric psychotherapist for a father, and a dweeble for an older brother, it's no wonder sixteen-year-old Janet Bandry is ready to enter the Dark Phase of her life. As this determined British teenager sees it, the DP requires dressing in black, listening to jazz when she can find the right radio station, and thinking about Deep and Meaningful Things — when she isn't thinking about boys, what color to dye her hair, or whether her nose piercing is infected. Told in diary entries with a comical dose of melodrama, PLANET JANET shares the painfully funny travails of a winning new heroine who just knows she is destined for greatness.",
        "Category": " Young Adult Fiction , School & Education , General",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Last Known Victim",
        "Authors": "By Spindler, Erica",
        "Description": "August 2005.Amid death and destruction, hurricane-savaged New Orleans has a new dark force to fear.As the rescue efforts unfold, a grisly discovery is made at one of the massive refrigerator 'graveyards.' One of these metal hulks contains six human hands&#151;all female, all right hands. The press has dubbed the unknown perpetrator 'The Handyman.' But with no way to trace the origin of this refrigerator, and with evidence lost to time and the elements, the case dead-ends.Captain Patti O'shay is a straight-arrow, by-the-book cop who is assigned to the case. Her tough, unflinching character is fractured when her husband and fellow police captain is found murdered&#151;surprised by looters taking advantage of the post-storm chaos.August 2007Patti, still grieving and disillusioned, gets a call from homicide: skeletal remains have been unearthed in City Park. The unknown victim&#151; a female&#151;is missing her right hand. But for Patti, this grave holds something even more shocking. Found beside the victim's bones is her husband's police badge.Casting aside the very 'rule book' by which she has lived her life, Patti is fearless&#151;but so is the killer. As he stalks her she is forced to question all she believes in, to doubt the code she has lived by&#151;because she knows that if she doesn't find The Handyman first, she will become his last known victim.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "The Tortilla Curtain (Penguin Books with Reading Guides)",
        "Authors": "By Boyle, T. Coraghessan",
        "Description": "T.C. Boyle's tragicomic, award-winning novel about assimilation, immigration, and the price of the American dream    'A masterpiece of contemporary social satire . . . Turning the collective face of Mexican immigration into one ordinary human being, and walking many bruising miles in Candido's cheap shoes, is Mr. Boyle's gift to our collective conscience. But what makes The Tortilla Curtain good reading for any political stripe is that the author neither romanticizes the newcomers nor demonizes those who would pull up the ladder behind them.' 'The Wall Street JournalTopanga Canyon is home to two couples on a collision course. Los Angeles liberals Delaney and Kyra Mossbacher lead an ordered sushi-and-recycling existence in a newly gated hilltop community: he a sensitive nature writer, she an obsessive realtor. Mexican illegals Candido and America Rincon desperately cling to their vision of the American Dream as they fight off starvation in a makeshift camp deep in the ravine. And from the moment a freak accident brings Candido and Delaney into intimate contact, these four and their opposing worlds gradually intersect in what becomes a tragicomedy of error and misunderstanding.",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Thriller: Stories To Keep You Up All Night",
        "Authors": "By Patterson, James (EDT)",
        "Description": "Featuring North America's foremost thriller authors, Thriller is the first collection of pure thriller stories ever published. Offering up heart-pumping tales of suspense in all its guises are thirty-two of the most critically acclaimed and award-winning names in the business. From the signature characters that made such authors as David Morrell and John Lescroart famous to four of the hottest new voices in the genre, this blockbuster will tantalize and terrify.Lock the doors, draw the shades, pull up the covers and be prepared for Thriller to keep you up all night.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Right Attitude to Rain (An Isabel Dalhousie Mystery)",
        "Authors": "By McCall Smith, Alexander",
        "Description": "ISABEL DALHOUSIE - Book 3 Nothing captures the charm of Edinburgh like the bestselling Isabel Dalhousie series of novels featuring the insatiably curious philosopher and woman detective.  Whether investigating a case or a problem of philosophy, the indefatigable Isabel Dalhousie, one of fiction’s most richly developed amateur detectives, is always ready to pursue the answers to all of life’s questions, large and small.The delectable new installment in the bestselling and already beloved adventures  of Isabel Dalhousie and her no-nonsense housekeeper, Grace.When friends from Dallas  arrive in Edinburgh and introduce Isabel to Tom Bruce – a bigwig at home in Texas  – several confounding situations unfurl at once. Tom’s young fiancée’s roving eye  leads Isabel to believe that money may be the root of her love for Tom. But what,  Isabel wonders, is the root of the interest Tom begins to show for Isabel herself?  And she can’t forget about her niece, Cat, who’s busy falling for a man whom Isabel  suspects of being an incorrigible mama’s boy. Of course Grace and Isabel’s friend  Jamie counsel Isabel to stay out of all of it, but there are irresistible philosophical  issues at stake – when to tell the truth and when to keep one’s mouth shut, to be  precise – and philosophical issues are meat and drink to Isabel Dalhousie, editor  of the Review of Applied Ethics. In any case, she’s certain of the ethical basis  for a little sleuthing now and again – especially when the problems involve matters  of the heart.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "River's Edge (Cape Refuge Series #3)",
        "Authors": "By Terri Blackstock",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Julia Child & More Company",
        "Authors": "By Child, Julia",
        "Description": "Julia Child's inimitable ways of coping with common kitchen dilemmas are shared along with menus and recipes that range from a vegetarian caper and lobster souffle to a country dinner of leek and rabbit pie",
        "Category": "",
        "Publisher": "Alfred A Knopf",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1979"
        }
    },
    {
        "Title": "Chuck Close: Up Close",
        "Authors": "By Greenberg, Jan and Jordan, Sandra",
        "Description": "Illustrates the life and struggles of American artist Chuck Close, who overcame learning disabilities as a child and fought paralysis as an adult to become a celebrated portrait painter with works appearing at New York's Museum of Modern Art.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Art",
        "Publisher": "Dk Ink",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "River Song",
        "Authors": "By Lesley, Craig",
        "Description": "As he grows older and reevaluates his life, Danny Kachiah is sure he wants to teach his son the traditional Nez Perce ways and convince him to give up the rodeo, while also being unsure of how to handle his marriage-minded ex-sister-in-law",
        "Category": "",
        "Publisher": "Laurel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Computer Consultant's Guide: Real-Life Strategies for Building a Successful Consulting Career",
        "Authors": "By Ruhl, Janet",
        "Description": "THE COMPUTER CONSULTANT'S GUIDEIf you're serious about striking out on your own as a computer consultant, you don't need a pep talk. You need reliable, authoritative information that will prepare you for the realities of independent consulting. You need to meet experienced consultants who have learned from their own successes and failures and who can teach you what it takes to develop a consultant mentality, attract and hold clients, set realistic prices, collect your money, run a business on your own, avoid tax problems, and much more.In this Second Edition of The Computer Consultant's Guide, Janet Ruhl introduces you to more than 150 practicing computer consultants. In their own words, these professionals tell you how they feel about their work, what problems they commonly encounter, which real-world solutions worked for them, and which didn't. You'll even get to listen in on disagreements over touchy subjects such as when to discount rates and whether to insist on a written contract. You'll hear both sides of every question and decide for yourself which approach is right for you.The Computer Consultant's Guide doesn't stop there. In excerpts from in-depth interviews with leading consultants, Ruhl addresses a host of important issues that will affect your day-to-day life as a consultant and could make or break your future: insurance requirements, effective image building, marketing techniques that work, and managing the client relationship.New information in this Second Edition includes tax requirements and standard business practices for Canadian, U.K., and European consultants; and new tips and tricks from working consultants as well as ideas on how to use the Internet and World Wide Web to support and enhance your business. This practical, down-to-earth handbook also includes updated resource lists, extensive up-to-date information based on Janet Ruhl's popular Web-based Real Rate Survey, IRS rules for establishing independent contractor status, and the ICCA's model consulting contract.If you're serious about becoming a computer consultant, or even if you're just thinking about it, this book gives you a clear picture of what you're up against, prepares you to meet the challenges of launching your business, and helps you avoid the common errors that most fledgling consultants make. No, you don't need a pep talk. You need The Computer Consultant's Guide, Second Edition.\"Read it twice and heed every word.\" -- CompuServe Magazine\"Belongs on the reading list of all prospective and current computer consultants.\" -- Library Journal\"250 pages of solid advice for anyone considering the consulting life.\" -- Software Development\"I took the leap [into consulting] 11 years ago, and I wish I had had The Computer Consultant's Guide for advice. . . . Janet Ruhl's recommendations fit my experience right down the line.\" -- Harry Green, President Pacific Netcom Inc.\"An excellent reference for the newcomer. . . 'old pros' will want a copy as well.\" --Deborah Sampson, President Independent Computer Consultants AssociationThe Computer Consultant's Guide, Second Edition, offers valuable guidance on every aspect of starting and managing a successful computer consulting business. It points out potential problems, solid solutions, and valuable resources, and covers everything you need to know to: Set up your business and establish your image * Master essential business and marketing skills * Find and manage the highest paying clients * Set fees and bid on the big jobs * Handle important tax and accounting issues * Work through brokers with confidence",
        "Category": " Business & Economics , Consulting",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "The Great Unraveling: Losing Our Way in the New Century (Updated and Expanded)",
        "Authors": "By Krugman, Paul R.",
        "Description": "\"This national bestseller chronicles the dangers of an administration that has raised dishonesty to dizzying heights. Economist Paul Krugman exposes the facts that speak for themselves. From identifying the flaws in George W. Bush's economic plans to telling the story behind California's energy crisis, to revealing the administration's reasons for going to war in Iraq, Krugman offers justification for his criticisms and sets the first years of the twenty-first century in a stark new light. This up-to-date edition includes a new introduction and other material that reflect the events of 2004\"--Jacket.",
        "Category": " Political Science , American Government , National",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Poems and Sketches of E. B. White",
        "Authors": "By White, E. B.",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1983"
        }
    },
    {
        "Title": "Aspen in Color, 2nd: Seasons of a Mountain Town",
        "Authors": "By Ohlrich, Warren",
        "Description": "Here is a view of Aspen and the surrounding Rocky Mountains through a collection of timeless color photographs by local photographers. This book combines the images of nature from the Aspen area with photographs of the town, characterizing nature in its many moods, and chronicling the activities of the city's residents and visitors.",
        "Category": "",
        "Publisher": "People's Press",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "When Day Breaks (Key News Thrillers)",
        "Authors": "By Clark, Mary Jane",
        "Description": "",
        "Category": "",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Puss 'n Cahoots: A Mrs. Murphy Mystery (Mrs. Murphy Mysteries)",
        "Authors": "By Brown, Rita Mae, Brown, Sneaky Pie, and Gellatly, Michael (ILT)",
        "Description": "Rita Mae Brown is back in the saddle with her feline partner-in-crime, Sneaky Pie Brown, in this latest mystery centering on a killing in horse country. This time Mary Minor \"Harry\" Haristeen, the sleuthing cats Mrs. Murphy and Pewter, along with corgi Tee Tucker, must use a little horse sense to catch a runaway killer.Instead of a proper second honeymoon, the newly remarried Harry and Fair Haristeen leave cozy Crozet, Virginia, for Shelbyville, Kentucky, site of the famous saddlebred horse show. There they'll visit dear friends Joan Hamilton and Larry Hodge and enjoy a week among some of the finest horses, trainers, and riders in the country.But soon after they arrive, events veer mysteriously - and murderously - off course. First, Joan's ruby and sapphire horsehead heirloom pin is stolen from her private box at the fairgrounds. Next, a young film star's prize three-gaited mare disappears into thin air. There is no lack of suspects, from hotheaded trainers and jealous rivals to vicious ex-spouses. Then a body is found flagrantly murdered and it's obvious to Harry that someone at Shelbyville is sending a strong message: winning is only secondary - first prize is survival.As Harry searches for clues, rediscovers life as a married woman, and deals with her upcoming fortieth birthday, her four-legged detective friends are already on the case. But is animal instinct any match for human depravity? Especially with two humans to protect and a killer on the prowl?",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Garfield: The Complete Cat Book",
        "Authors": "By Steneman, Shep",
        "Description": "Photographs and Garfield cartoons and asides illustrate useful and amusing information about the different breeds of cats and their care, true cat stories, and legends, folktales, and poems featuring cats",
        "Category": " Technology & Engineering , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1981"
        }
    },
    {
        "Title": "Tales of the City",
        "Authors": "By Maupin, Armistead",
        "Description": "The acclaimed best-seller by the author of Significant Other, Babycakes, and Sure of You follows the experiences of Anna Madrigal, doyenne of 28 Barbary Lane. Reprint. TV tie-in. 75,000 first printing. $30,000 ad/promo.",
        "Category": "",
        "Publisher": "Perennial (HarperCollins)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Mixed blessing",
        "Authors": "By McMillon, Doris",
        "Description": "",
        "Category": "",
        "Publisher": "McMillon",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Wise Poison",
        "Authors": "By David Rivard",
        "Description": "",
        "Category": "",
        "Publisher": "Graywolf Press, 1996",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Right Man for the Job: A Novel",
        "Authors": "By Magnuson, Mike",
        "Description": "Gunnar and Dewy are \"repo\" men -- one white, one black -- who work for a furniture and appliance rental company in a tough, inner-city neighborhood.  Dewy, a foul-mouthed realist, happily takes Gunnar under his wing and tries to teach him how to maneuver safely through the dangers of the Columbus, Ohio, streets.  Together they devise increasingly ingenious ways to reclaim properly from their most recalicitrant customers.  They become fixated in particular on a woman who will not respond to any of their attempts to repossess her furniture.  Both Dewy and the customer refuse to give in.  And thus the stage is set for a series of events that send Gunnar's life spiraling out of control.",
        "Category": " Fiction , Psychological",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Swan: A Novel from the author of Under the Tuscan Sun",
        "Authors": "By Mayes, Frances",
        "Description": "A haunting southern tale of long-buried family secrets by the New York Times bestselling author of Under the Tuscan Sun and Under MagnoliaIn her celebrated memoirs of life in Tuscany, Frances Mayes writes masterfully about people in a powerful and shaping place. In Swan, her first novel, she has created an equally intimate world, rich with striking characters and intriguing twists of fate, that hearkens back to her southern roots.The Masons are a prominent but now fragmented family who have lived for generations in Swan, an edenic, hidebound small town in Georgia. As Swan opens, a bizarre crime pulls Ginger Mason home from her life as an archeologist in Italy: The body of her mother, Catherine, a suicide nineteen years before, has been mysteriously exhumed. Reunited on new terms with her troubled, isolated brother J.J., who has never ventured far from Swan, the Mason children grapple with the profound effects of their mother's life and death on their own lives. When a new explanation for Catherine’s death emerges, and other closely guarded family secrets rise to the surface as well, Ginger and J.J. are confronted with startling truths about their family, a particular ordeal in a family and a town that wants to keep the past buried.Beautifully evoking the rhythms and idiosyncrasies of the deep South while telling an utterly compelling story of the complexity of family ties, Swan marks the remarkable fiction debut of one of America’s best-loved writers.",
        "Category": " Fiction , Literary",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Staring at the Sun (Perennial Fiction Library)",
        "Authors": "By Barnes, Julian",
        "Description": "In the course of what is, superficially, an ordinary life, whose dates span the 1920s to the year 2021, Jean Serjeant, a woman of exceptional curiosity, muses on diverse questions, great and small",
        "Category": " Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    }
]