[
    {
        "Title": "Cruel & Unusual (Kay Scarpetta Mysteries)",
        "Authors": "By Cornwell, Patricia Daniels",
        "Description": "Trying to solve the murder of a thirteen-year-old boy, Dr. Kay Scarpetta and police lieutenant Pete Marion race against time to find a killer after the fingerprints of a recently executed murderer turn up at a new crime scene. Reissue.",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Stars of the Opera, 1950 1985 in Photographs",
        "Authors": "By Camner, James (EDT)",
        "Description": "",
        "Category": " Photography , General",
        "Publisher": "Dover Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "Liberating Everyday Genius",
        "Authors": "By Jacobsen, Mary-Elaine",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Practical C++ Programming (Nutshell Handbooks)",
        "Authors": "By Oualline, Steve",
        "Description": "Fast becoming the standard language of commercial software development, C++ is an update of the C programming language, adding object-oriented features that are very helpful for today's larger graphical applications.Practical C++ Programming is a complete introduction to the C++  language for the beginning programmer, and also for C programmers  transitioning to C++.  Unlike most other C++ books, this book emphasizes  a practical, real-world approach, including how to debug, how to make your  code understandable to others, and how to understand other people's code.Almost as important, this book is written in the readable style that has  made Nutshell Handbooks® famous.Topics covered include:Good programming styleC++ syntax, what to use and what not to useC++ class designDebugging and optimizationAt the end of each chapter are a number of exercises you can use to make  sure you've grasped the concepts.  Solutions to most are provided.Practical C++ Programming describes standard C++ features that are supported by all UNIX C++ compilers (including gcc) and DOS/Windows  and NT compilers (including Microsoft Visual C++).Comparison: Practical C++ Programming vs. C++: The Core  LanguageO'Reilly's policy is not to publish two books on the same topic for the same audience.  We'd rather spend twice the time on making one book the industry's best.  So why do we have two C++ tutorials?  Which one should you get?The answer is they're very different.  Steve Oualline, author of the  successful book Practical C Programming, came to us with the idea  of doing a C++ edition.  Thus was born Practical C++ Programming.   It's a comprehensive tutorial to C++, starting from the ground up.  It also  covers the programming process, style, and other important real-world issues.   By providing exercises and problems with answers, the book helps you make  sure you understand before you move on.While that book was under development, we received the proposal forC++: The Core Language.  Its innovative approach is to cover only a subset of the language -- the part that's most important to learn first -- and to assume readers already know C.  The idea is that C++ is just too complicated to learn all at once.  Instead, you learn the basics solidly  from this short book, which prepares you to start programming and to  understand some of the other C++ books you'll need for reference.These two books are based on different philosophies and are for different  audiences.  But there is one way in which they work together.  If you are  a C programmer, we recommend you start with C++: The Core Language,  then read about advanced topics and real-world problems in Practical C++  Programming.",
        "Category": " Computers , Programming Languages , C++",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Michael Langford's 35mm Handbook",
        "Authors": "By Langford, Michael",
        "Description": "A comprehensive guide to the use of a 35mm camera includes discussions of lenses, thr various types of film, photographic portraits, and flash equipment",
        "Category": "",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "X Users Guide Motif R5: Motif Edition vol. III (Definitive Guides to the X Window System)",
        "Authors": "By O'Reilly, Tim and Quercia, Valerie",
        "Description": "The X Window System User's Guide, Motif Edition, orients the new user to window system concepts and provides detailed tutorials for many client programs, including the xterm terminal emulator and the window  manager. Building on this basic knowledge, later chapters explain how  to customize the X environment and provide sample configurations.This alternative edition of the User's Guide highlights the Motif  window manager for users of the Motif graphical user interface. Revised for Motif 1.2 and X11 Release 5.Topics include:Starting the system and opening windowsUsing the xterm terminal emulator and window managersMost standard release clients, including programs for graphics, printing, font manipulation, window/display information, removing windows, as well as several \"desktop\" utilitiesCustomizing the window manager, keyboard, display, and certain basic features of any client programUsing and customizing the mwm window manager, for those using theOSF/Motif graphical interfaceSystem administration tasks, such as managing fonts, starting X automatically, and using the display manager, xdm, to run X on single or multiple displaysMaterial covered in this second edition includes:Overview of the X Color Management System (Xcms)Creating your own Xcms color databaseTutorials for two \"color editors\": xcoloredit and xticiUsing the X font serverTutorial for editres, a resource editorExtensive coverage of the new implementations of bitmap and xmagOverview of internationalization featuresFeatures common to Motif 1.2 applications: tear-off menus and drag-and-drop",
        "Category": " Computers , Operating Systems , General",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "7.4",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "The Plug-in Drug: Television, Children, and the Family; Revised Edition",
        "Authors": "By Winn, Marie",
        "Description": "Details the ways in which the mere act of television-watching can affect a child's behavior, intelligence, and ability to communicate and shows how some parents have rescued their children from this drug",
        "Category": " Performing Arts , Television , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "Only a Gringo Would Die for an Anteater: The Adventures of a Veterinarian",
        "Authors": "By Milts, Michael H.",
        "Description": "",
        "Category": "",
        "Publisher": "Norton",
        "Price Starting With ($)": "5.93",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The Gulf Crisis: Background and Consequences",
        "Authors": "By Ibrahim, Ibrahim",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Center for Contemporary Arab",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "The Monticello Cook Book",
        "Authors": "By Uva Hospital Circle (EDT)",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Dietz Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1950"
        }
    },
    {
        "Title": "Grounded for Life?!: Stop Blowing Your Fuse and Start Communicating with Your Teenager",
        "Authors": "By Tracy, Louise Felton",
        "Description": "Offers advice on improving communication with teenagers by giving them more responsibility for themselves and by allowing them to learn from their actions through natural consequences",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Parenting Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "How to Get What You Want and Want What You Have: a Practical Guide to Personal Success",
        "Authors": "By Gray, John",
        "Description": "",
        "Category": "",
        "Publisher": "Harper-Collins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Rise of Big Business, 1860-1910 (American History Series)",
        "Authors": "By Porter, Glenn",
        "Description": "Examines the economic and technological factors contributing to the vertical and horizontal development of large-scale enterprises, noting the impact of corporate growth on American society",
        "Category": "",
        "Publisher": "H. Davidson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Who Are the Amish",
        "Authors": "By Good, Merle",
        "Description": "Describes the history and culture of the Amish, looks at their schools, farming methods, courtship, weddings, family life, and community activities, and discusses their interactions with the outside world",
        "Category": "",
        "Publisher": "Good Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "The Sky's the Limit: A Defense of the Earth",
        "Authors": "By Nichols, John Treadwell",
        "Description": "In the tradition of Thoreau, Edward Abbey, and Annie Dillard, The Sky's the Limit is an environmental manifesto, with 68 lyrical photographs of an untouched mesa near the author's home in Taos, New Mexico. A provocative essary on the fate of our planet complements these full-color images.",
        "Category": " Photography , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "High Country Hunting (Hunter's Information Series)",
        "Authors": "By Bare, Lloyd",
        "Description": "",
        "Category": "",
        "Publisher": "Minnetonka, Minn. : North American Hunting Club, 1989",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Creation: Facts of Life",
        "Authors": "By Parker, Gary E.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Master Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Earth: An Introduction to Physical Geology",
        "Authors": "By Lutgens, Frederick K. and Tarbuck, Edward J.",
        "Description": "",
        "Category": "",
        "Publisher": "Merrill Pub Co",
        "Price Starting With ($)": "7.62",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Five Days to an Organized Life",
        "Authors": "By Hedrick, Lucy H.",
        "Description": "Shows how to reach one's goals through the use of rewards, explains how to break down large projects into smaller, more manageable tasks, stresses the importance of making notes, and  discusses calendars and to-do lists",
        "Category": " Business & Economics , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Looking at Earth",
        "Authors": "By Strain, Priscilla and Engle, Frederick",
        "Description": "Published in association with the Smithsonian Institute/National Air & Space Museum, this topographical portrait of Earth features stunning visual images collected by spacecraft and remote-sensing equipment.",
        "Category": " Science , General",
        "Publisher": "Turner Pub",
        "Price Starting With ($)": "7.82",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Black and Blue: A Novel",
        "Authors": "By Quindlen, Anna",
        "Description": "With this stunning novel about a woman and a marriage that begins in passion and becomes violent, the Pulitzer Prize--winning journalist and bestselling author of One True Thing and Object Lessons moves to a new dimension as a writer of superb fiction. \"If literature were judged solely by its ability to elicit strong emotions,\" Kirkus Reviews said about One True Thing, \"columnist-cum-novelist Quindlen would win another Pulitzer.\"  And the same will be said about Black and Blue, a brilliant novel of suspense, substance, and importance.In Black and Blue, Fran Benedetto tells a spellbinding story: how at nineteen she fell in love with Bobby Benedetto, how their passionate marriage became a nightmare, why she stayed, and what happened on the night she finally decided to run away with her ten-year-old son and start a new life under a new name. Living in fear in Florida--yet with increasing confidence, freedom, and hope--Fran unravels the complex threads of family, identity, and desire that shape a woman's life, even as she begins to create a new one. As Fran starts to heal from the pain of the past, she almost believes she has escaped it--that Bobby Benedetto will not find her and again provoke the complex combustion between them of attraction and destruction, lust and love.Black and Blue is a beautifully written, heart-stopping story in which Anna Quindlen writes with power, wisdom, and humor about the real lives of men and women, the varieties of people and love, the bonds between mother and child, the solace of family and friendship, the inexplicable feelings between people who are passionately connected in ways they don't understand. It is a remarkable work of fiction by the writer whom Alice Hoffman has called \"a national treasure.\"",
        "Category": " Fiction , Literary",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "America, Russia, and the Cold War, 1945-1975 (Wiley Biomedical-Health Publication)",
        "Authors": "By LaFeber, Walter",
        "Description": "",
        "Category": "",
        "Publisher": "John Wiley & Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The Honeymoon Is Over",
        "Authors": "By Boone, Pat and Boone, Shirley",
        "Description": "",
        "Category": "",
        "Publisher": "Creation House",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The Parables of Jesus: Glimpses of the New Age",
        "Authors": "By Neal F Fisher",
        "Description": "",
        "Category": "",
        "Publisher": "United Methodist Church",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The Story of Small Pine - Pop-up Book (Mini Pop-up Storybook, 3)",
        "Authors": "By Landoll",
        "Description": "",
        "Category": "",
        "Publisher": "Landoll",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Yazoo: Law and Politics in the New Republic",
        "Authors": "By Magrath, C Peter",
        "Description": "",
        "Category": "",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1967"
        }
    },
    {
        "Title": "Ideals Christmas, 1984 (Ideals Christmas)",
        "Authors": "By Pohl, Kathleen S. (editor)",
        "Description": "",
        "Category": "",
        "Publisher": "Ideals Publishing Corp, Milwaukee, Wis",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Baltimore: Captured Memories",
        "Authors": "By Miller, Roger",
        "Description": "",
        "Category": "",
        "Publisher": "Image Pub Co Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "The river people",
        "Authors": "By Wayre, Philip",
        "Description": "",
        "Category": "",
        "Publisher": "Taplinger Pub Co",
        "Price Starting With ($)": "6.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Freedom from Chronic Pain: The Breakthrough Method of Pain Relief Based on the New York Pain Treatment Prog",
        "Authors": "By Marcus, Norman J., M.D. and Arbeiter, Jean S.",
        "Description": "A leading researcher in pain treatment presents a breakthrough drug-free system for dealing with chronic pain, showing in careful steps how sufferers can master techniques involving exercise, nutrition, and coping mechanisms that master pain. 35,000 first printing.",
        "Category": " Health & Fitness , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Estrogen",
        "Authors": "By Heilman, Joan Rattner and Nachtigall, Lila",
        "Description": "Discusses the effects of estrogen on the body",
        "Category": " Health & Fitness , General",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Tough Minded Faith for Tender Hearted People",
        "Authors": "By Schuller, Robert H.",
        "Description": "",
        "Category": "",
        "Publisher": "Nelson, Thomas@ Publishing Co",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Wealthy and Wise: Secrets About Money",
        "Authors": "By Steiger, Heidi L. (EDT) and Berman, Neuberger",
        "Description": "Wealthy & Wise provides rare insight into the techniques that wealthy people use to build and protect their wealth, so that they can enjoy life to its fullest. Readers will learn how to address the real-life issues that money creates, such as raising children in an affluent household, finding fulfillment in work, and developing a long-term wealth management strategy. The book addresses both the practical and the emotional challenges of wealth, with tips on how to enjoy it too. From prenuptial agreements to family meetings to trusts and charitable foundations, Wealthy & Wise provides useful, comprehensive advice for anyone who has wealth, or aspires to wealth.Neuberger Berman (New York, NY) is a leading investment advisory company. For more than sixty years, it has provided clients with a broad range of investment products, services, and strategies, including asset management, wealth management, and trust services. Heidi L. Steiger is an Executive Vice President and head of the firm's private asset management business.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Marcus, a novel of the youngest apostle",
        "Authors": "By Chinn, Laurene Chambers",
        "Description": "",
        "Category": "",
        "Publisher": "Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Prevention's Anti-Aging Secrets",
        "Authors": "By Editorial Staff",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Tek Lords (Jake Cardigan)",
        "Authors": "By Shatner, William",
        "Description": "Jake Cardigan discovers the connection between a brutal murder and a synthetic plague that had killed his ex-wife, and it is all linked to the Tek cartel, purveyors of the computerized drug crippling the futuristic society",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Remembering The Bone House: An Erotics of Place and Space",
        "Authors": "By Mairs, Nancy",
        "Description": "The author recreates her girlhood, adolescence, and young adulthood as wife and mother, detailing her battles with depression, agoraphobia, and multiple sclerosis",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Promises from God's Word for Every Moment of Life",
        "Authors": "By James C. Galvin~Christopher D. Hudson~Diane Krusem",
        "Description": "",
        "Category": "",
        "Publisher": "World Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "On This Spot: Pinpointing the Past in Washington, D.C.",
        "Authors": "By Evelyn, Douglas E. and Dickson, Paul",
        "Description": "Describes the background and folklore of historic sites throughout the city",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "Farragut Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Area handbook for the People's Republic of China",
        "Authors": "By Whitaker, Donald P",
        "Description": "",
        "Category": "",
        "Publisher": "For sale by the Supt. of Docs., U.S. Govt. Print. Off.]",
        "Price Starting With ($)": "9.1",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "The Naval Institute Guide to Combat Fleets of the World 1993: Their Ships, Aircraft, and Armament",
        "Authors": "By Prezelin, Bernard (EDT) and Baker, A. D., III (TRN)",
        "Description": "There have been few times in modern naval history when the compositions of the fleets of the world have been so radically altered and without major conflict being the cause. Derived from unclassified publications and correspondence from around the world, this guide provides a basis for tracking not only new shipbuilding programs but also recent transfers of ships and technology. The text has been revised and reformatted, and some 80% of the photography is new to this edition. The guide presents the complete programs of all the world's navies, coast guards, ands paranaval forces. Naval vessels large and small, in service and under construction, are fully described, along with naval aircraft and weapons systems and sensors. 9.25x12.25\" Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "Naval Institute Press",
        "Price Starting With ($)": "12.18",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "Container Gardening (Southern Living Garden Guide)",
        "Authors": "By Southern Living Magazine (EDT), Chaplin, Lois Trigg, and Greer, Jennifer",
        "Description": "",
        "Category": " Gardening , Regional , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "American Mosaic",
        "Authors": "By Morrison, Joan and Zabusky, Charlotte Fox",
        "Description": "Personal stories of a cross section of twentieth-century immigrants discuss their dreams, ambitions, and problems in leaving their homeland",
        "Category": " Social Science , Reference",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1982"
        }
    },
    {
        "Title": "When and How to Use Mental Health Resources : A Guide for Stephen Ministers, Stephen Leaders and Church Staff",
        "Authors": "By Haugk, Kenneth C., McKay, William J., Perry, R. Scott, Paap, David A.",
        "Description": "",
        "Category": "",
        "Publisher": "Stephen Ministries",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "I'll Cry When I Kill You",
        "Authors": "By Israel, Peter",
        "Description": "When cantankerous author Raul Bashard is murdered during his birthday celebration at a science fiction convention, Manhattan attorney Charles Camelot and his irreverent assistant, Philip Revere, set out to find the killer",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mysterious Pr",
        "Price Starting With ($)": "26.36",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "100 Nineteenth-Century Rhyming Alphabets in English",
        "Authors": "By Baldwin, Ruth Marie",
        "Description": "The library of Ruth M. Baldwin contains, at the present time, about 35,000 titles and editions of children’s books in English, all before 1900 and mostly from the nineteenth century. Though a small part of the out­pouring of children’s books in English in the nineteenth century?estimated to be as much as a quarter of a million volumes?her library is probably unique in its equal representation of American and English children’s books. How many of the books published were rhyming alphabets is difficult to say. These hundred books presented here, certainly a small part of the whole, bear publication dates around the early part of the second half of the century, and represent the whole century well, for true children’s book publishing did not precede this by much. Children and readers in general as well as students of children’s literature should find this book of books interesting. The alphabets repro­duced here are included in their entirety, many of them in color, and are grouped thematically under such topics as nature, animals, and farm life.",
        "Category": " Juvenile Nonfiction , Concepts , Alphabet",
        "Publisher": "Southern Illinois University Press",
        "Price Starting With ($)": "58.61",
        "Publish Date": {
            "Month": "August",
            "Year": "1972"
        }
    },
    {
        "Title": "The New Rules of Money: 88 Simple Strategies for Financial Success Today",
        "Authors": "By Edelman, Ric",
        "Description": "Are You Playing  By the New Rules?Forget what you know about personal finance.  The old rules no longer apply.  Ric Edelman&#39;s 88 strategies, tailor-made for  today&#39;s economy, will show you how to achieve financial success.  Ric is famous for making personal finance fun, and you&#39;ll discover how easy it is to put his advice into action!Is it smart to buy company stock with your 402 (k) plan?  Discover the right way to handle your company retirement plan.  See Rule #85 Learn why you must carry a big, long mortgage -- and never pay it off!  See Rule #21Learn why not to invest in the new Roth IRA-and discover the most powerful anti-tax investment available today.  See Rules #69 and #76Planning to retire?  Learn why you won&#39;t -- and what you must do instead. See Rule #88Find out why those who invest in S&P 500 Index Funds will wish they hadn&#39;t. See Rule #36Learn why that higher - paying job could actually cost you money.  See Rule #32",
        "Category": " Business & Economics , Finance , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Awakening Your Child's Natural Genius",
        "Authors": "By Armstrong, Thomas",
        "Description": "Advises how children can achieve full potential through at-home activities and offers suggestions for expanding a child's natural and often unrecognized ability",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "The Schwarzbein Principle: The Truth about Losing Weight, Being Healthy and Feeling Younger",
        "Authors": "By Schwarzbein, Diana and Deville, Nancy",
        "Description": "This groundbreaking book dispels the myths perpetuated by some bestselling diet books that may help people lose weight, but will put them on the fast track to disease. Based on sound research and the success of thousands of people, The Schwarzbein Principle proves that excess weight, degenerative disease and accelerated aging can be controlled — and reversed — in a healthful way.  The Schwarzbein Principle is a holistic guide to achieving lasting weight loss, normalizing metabolism and maintaining ideal body composition through lifestyle and nutrition. By bringing the internal systems into balance, the Schwarzbein program has been proven to: reverse type II diabetes; free people from food cravings for chocolate, caffeine and sugar; cure depression and mood swings; and reduce body fat while building lean tissue. The nutritional program consists of two phases —Healing and Maintenance — which are easy to adopt into any lifestyle. Instead of shunning fat, the program advocates eating all of the good fats and proteins your body needs as well as an unlimited portion of non-starchy carbohydrates. By incorporating the lifestyle components of stress management, exercise and eliminating harmful stimulants, program participants experience renewed energy and vitality.",
        "Category": " Medical , Diet Therapy",
        "Publisher": "Health Communications Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Come Walk With Me",
        "Authors": "By Cutshall, Mark and Cheatham, Melvin L.",
        "Description": "The true story of one doctor's fascinating journey, a patient's courageous struggle, and the faith they both shared.Sometimes without warning, a person walks into your world and changes everything - your career, your future, your life. For Dr. Melvin Cheatham, that person was Stanley Cheborge. AndCome Walk With Me is the story of their rare and moving friendship. This triumphant account of how incurable suffering united two very different people shows how a patient taught his doctor some of life's most deep and powerful lessons.The road that Dr. Cheatham and Stanley walked covers dissapointment, hope, sorrow, and faith. Come, step along the path and you will see how far a friendship can lead.",
        "Category": " Religion , Christian Ministry , Missions",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Ansel Adams: The Spirit of Wild Places (Art Series)",
        "Authors": "By Nash, Eric Peter",
        "Description": "A treasury of Ansel Adam's works as commissioned by the National Park Service in 1941 features more than 120 spectacular images including the Grand Canyon, Yellowstone, Yosemite, the Grand Tetons, and other magnificent wilderness areas.",
        "Category": " Photography , Individual Photographers , General",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "The Smoking Gun: A Dossier of Secret, Surprising, and Salacious Documents",
        "Authors": "By Bastone, William (EDT), Green, Daniel (EDT), Glauber, Barbara, and Glauber, Barbara (EDT)",
        "Description": "From the creators of the Web site thesmokinggun.com comes an entertaining selection of previously unpublished documents-including FBI files, morgue and police reports, and court transcripts-that shed new light on some of the most bizarre and scandalous news stories of recent history, Ted Kaczynski's requests for a sex change and Burt Reynolds debts to toupee companies. Original. 40,000 first printing.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.45",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Bare Barging In Burgundy: Boating, Exploring, Wining & Dining (Capital Travels)",
        "Authors": "By Kloman, Erasmus H.",
        "Description": "",
        "Category": " Travel , Europe , France",
        "Publisher": "Capital Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Colorado Guide (4th ed)",
        "Authors": "By Caughey, Bruce and Winstanley, Dean",
        "Description": "Describes points of interest in each region of the state, and recommends festivals, cultural events, scenic drives, hotels, and restaurants",
        "Category": " Travel , United States , West , Mountain (AZ, CO, ID, MT, NM, NV, UT, WY)",
        "Publisher": "Fulcrum Pub",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "The Fairy Tale Detectives (The Sisters Grimm, Book 1)",
        "Authors": "By Ferguson, Peter (ILT) and Buckley, Michael",
        "Description": "In paperback for the first time, the Sisters Grimm take readers to a world where fairy tales are fact and not everyone is who they seem!In book one of this bestselling series, sisters Sabrina and Daphne are sent to live with their mysterious grandmother, Relda Grimm. The sisters learn they are descendants of the Brothers Grimm, whose famous book of fairy tales is actually a collection of case files. The girls are the latest in a long line of fairy-tale detectives, and their new hometown is filled with Everafters (as magical folks like to be called)—some good and some very, very bad. When a mysterious Everafter sets a giant loose on the town, it’s up to the Sisters Grimm to save the day.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Amulet Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "The Leveling Wind: Politics, the Culture, and Other News, 1990-1994",
        "Authors": "By Will, George F.",
        "Description": "This volume, the fifth collection of George F. Will's essays on America's political tumults and cultural controversies, makes clear that he deserves to be ranked in the American tradition of high journalism, a tradition that extends back through Walter Lippmann and H. L. Mencken to Edwin Lawrence Godkin.With wit, erudition, and craftsmanship that readers of 480 newspapers and Newsweek have enjoyed for twenty years, Will assesses the triumphs, misadventures, and foibles of the past four years. During this period George Bush's presidency, filled with \"verbal fender-benders\" and policy disappointments, paved the way for the ebullient Bill Clinton, that enthusiast of government of whom Will says, \"American government is failing at such fundamental tasks as providing streets free of gunfire and schools with high standards, and yet at this moment, when government's reputation is deservedly rotten, Clinton says that it is competent to plan the future.\"Many of the institutions that should sustain our fraying society, says Will, have been populated by men and women like the Clintons who came of age in the 1960s, a decade that gave legitimacy to a \"perverse premise - that the social order is an infringement on freedom rather than freedom's foundation.\"\"The idea is abroad,\" writes Will, \"that there is no moral heritage worth 'imposing' on children, respect for whom requires that their 'values' be regarded as a matter of taste.\" We are, Will observes, increasingly unable to talk about race, or equality, or art, or literature without using these subjects as \"a mere index of who has power and whom the powerful victimize.\"Of today's confused political goals and public ideals, Will says, \"The age that pushes hard against [us] is not something that has just befallen us. We made it; are making it. Much of it comes from the top down, a trickle-down culture that begins with the idea that the good life consists of satisfying every impulse. Many intellectuals have helped supplant the moral categories essential to civilized living, replacing them with a thin-gruel vocabulary of 'lifestyles' and 'values' and 'self-esteem.'\"In this moment of diminished vision and cloudy moral precepts, \"society's forces for order are no match for today's popular culture.\" Will reminds us, through vivid portraits of Americans striving hard to knit the social fabric back together, and through his witty, memorable stories of watching his own children grow, that we disregard society's seamlessness at our peril. His hopeful conclusion is that the human decency that abounds in America is our primary bulwark against \"the accelerating failure to (in the Constitution's words) insure domestic tranquility.\"",
        "Category": "",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "At Risk",
        "Authors": "By Rimington, Stella",
        "Description": "An announcement is made at a meeting of the British Intelligence Joint Counter-Terrorist group: “The opposition may be about to deploy an invisible.” An “invisible” is CIA-speak for the ultimate intelligence nightmare: a terrorist who is an ethnic native of the target country and who can therefore cross its borders unchecked, move around the country unquestioned, and go unnoticed while setting up the foundation for monstrous harm. Intelligence officer Liz Carlyle has had to prove herself in countless ways as she’s come up through the ranks of the traditionally all-male world of Britain’s Security Service, MI5. But this announcement marks the start of an operation that will test all her hard-won knowledge and experience–and her intelligence and courage–as nothing has before. Having analyzed information from her agents, she realizes that there is indeed an imminent terrorist threat. She may even have the invisible’s point of entry. But what she cannot draw out of all the “chatter” is the invisible’s identity and intended target. With each passing hour, the danger increases. As the desperate hunt continues, it becomes clear that Liz’s intuitive skills, her ability to get deep inside her enemy’s head, are her best hope for tracking down the terrorist. But will that be enough? And can she succeed in time to avert a disaster?Drawing from her experience as the first woman director general of MI5, Stella Rimington gives us a story that is smart, tautly drawn, and suspenseful from first to last. At Risk is a stunning debut novel that plunges us headlong into today’s shadowy and fever-pitched battle between terrorism and Intelligence.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Knopf",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Murder at the Margin",
        "Authors": "By Marshall Jevons",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Horton & Daughters",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Garden of Beasts: A Novel of Berlin 1936",
        "Authors": "By Deaver, Jeffery",
        "Description": "In the most ingenious and provocative thriller yet from the acclaimed New York Times bestselling author Jeffery Deaver, a conscience-plagued mobster turned government hitman struggles to find his moral compass amid rampant treachery and betrayal in 1936 Berlin.  Paul Schumann, a German American living in New York City in 1936, is a mobster hitman known as much for his brilliant tactics as for taking only \"righteous\" assignments. But then Paul gets caught. And the arresting officer offers him a stark choice: prison or covert government service. Paul is asked to pose as a journalist covering the summer Olympics taking place in Berlin. He's to hunt down and kill Reinhard Ernst -- the ruthless architect of Hitler's clandestine  rearmament. If successful, Paul will be pardoned and given the financial means to go legit; if he refuses the job, his fate will be Sing Sing and the electric chair.  Paul travels to Germany, takes a room in a boardinghouse near the Tiergarten -- the huge park in central Berlin but also, literally, the \"Garden of Beasts\" -- and begins his hunt. In classic Deaver fashion, the next forty-eight hours are a feverish cat-and-mouse chase, as Paul stalks Ernst through Berlin while a dogged Berlin police officer and the entire Third Reich apparatus search frantically for the American.  Garden of Beasts is packed with fascinating period detail and features a cast of perfectly realized locals, Olympic athletes and senior Nazi officials -- some real, some fictional. With hairpin plot twists, the reigning \"master of ticking-bomb suspense\" (People) plumbs the nerve-jangling paranoia of prewar Berlin and steers the story to a breathtaking and wholly unpredictable ending.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "John Philip Sousa and the national anthem",
        "Authors": "By Delaplaine, Edward S",
        "Description": "",
        "Category": "",
        "Publisher": "Great Southern Press",
        "Price Starting With ($)": "7.71",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Josh and Satch: The Life and Times of Josh Gibson and Satchel Paige",
        "Authors": "By Holway, John",
        "Description": "Provides a season by season acccount of the lives and careers of baseball greats Satchel Paige and Josh Gibson, discussing their years in the Negro leagues, their achievements, and their election to the Baseball Hall of Fame",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Carroll & Graf Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Modern American Women: A Documentary History",
        "Authors": "By Ware, Susan (EDT)",
        "Description": "A collection of primary source documents for the American women's history course, 'Modern American Women: A Documentary History' focuses on events and developments involving women from 1890 to the present. New material includes documents on anti-lynching activism and Indian relocation, excerpts from 'The Vagina Monologues' by Eve Ensler, expanded chapters on 'Sexuality and the Body' and 'The State of the Movement for Women's Equality'. New part introductions provide historical context for and identify key themes that emerge from the documents in each of the book's three parts while headnotes, suggestions for further reading and photo essays supplement this already thorough and intimate look at women's history in the 20th century.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "McGraw-Hill College",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "The Cycle of Leadership: How Great Leaders Teach Their Companies to Win",
        "Authors": "By Tichy, Noel M. and Cardwell, Nancy",
        "Description": "In The Leadership Engine, Noel Tichy showed how great companies strive to create leaders at all levels of the organization, and how those leaders actively develop future generations of leaders.  In this new book, he takes the theme further, showing how great companies and their leaders develop their business knowledge into ⳥achable points of view,⟳pend a great portion of their time giving their learnings to others, sharing best practices, and how they in turn learn and receive business ideas/knowledge from the employees they are teaching. Calling this exchange a virtuous teaching cycle, Professor Tichy shows how business builders from Jack Welch at GE to Joe Liemandt at Trilogy create organizations that foster this knowledge exchange and how their efforts result in smarter, more agile companies, and winning results. Some of these ideas were showcased in Tichy′s recent Harvard Business Review article entitled, ⍯ Ordinary Boot Camp.\" Using examples from GE, Ford, Dell, Southwest Airlines and many others, Tichy presents and analyzes these principles in action and shows how managers can begin to transform their own businesses into teaching organizations and, consequently, better-performing companies",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Web of Inclusion",
        "Authors": "By Helgesen, Sally",
        "Description": "The twenty-first century economy is fluid, technology-driven, based on creativity and relationships. Yet most businesses and organizations are still structured like nineteenth-century factories, forcing workers into cookie cutter roles. The model Sally Helgesen puts forth in The Web of Inclusion represents a fully realized vision of the information-age organization: the web of inclusion. A web is natural, organic, not modeled on a machine. Like a spider's web, a web of inclusion is both a structure and an ever-evolving process, constantly changing to meet the demands of the business environment.Building a web of inclusion means that ideas come from all employees, not just from the top down; that what individuals do in the workplace depends on their talents, not on their titles; that a premium is placed on flexibility; that the edges of the web of inclusion connect with people outside the organization: customers, suppliers, joint-venture partners, the mass media.Helgesen lays out the theory behind her provocative vision of a new style of management, then profiles five organizations that have achieved extraordinary success by adopting webs of inclusion: the hi-tech Intel in Silicon Valley; the Miami Herald, a traditional media company; Beth Israel Hospital in Boston; Nickelodeon in New York; and Anixter Inc., a cable and wire vendor based in Chicago. Each profile vividly demonstrates a different advantage of the web of inclusion.",
        "Category": " Business & Economics , Total Quality Management",
        "Publisher": "Doubleday Business",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Kitplane Construction",
        "Authors": "By Wanttaja, Ron",
        "Description": "Now completely updated and improved, Kitplane Construction, Second Edition, guides you to building and flying the kitplane of your dreams.",
        "Category": "",
        "Publisher": "Tab Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Weathering The Wilderness: The Sierra Club Guide To Practical Meteorology",
        "Authors": "By Reifsnyder, William E.",
        "Description": "Describes the climatologies of eight North American recreation areas and introduces outdoorsmen to the basic principles of meteorology, weather hazards, and the systematic techniques for weather forecasting",
        "Category": " Science , General",
        "Publisher": "Sierra Club Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1980"
        }
    },
    {
        "Title": "8 Weeks to Optimum Health",
        "Authors": "By Weil, Andrew",
        "Description": "2 cassettes / 3 hoursRead by the Author, Dr. Andrew WeilListen to the good doctor!In Eight Weeks to Optimum Health, Dr. Andrew Weil translates the brilliant insights and discoveries he outlined in his acclaimed bestseller, Spontaneous Healing, into a practical plan of action: a week-by-week, step-by-step program for enhancing and protecting present and lifelong health. The Eight-Week Program sets up a foundation for healthy living that will keep your body's natural healing system in peak working order. With clearly defined and authoritatively informed recommendations, Dr. Weil explains how to* Build a lifestyle that protects you from premature illness and disability* Fine-tune your current eating habits so that your diet is more nutritious* Walk and stretch in regimens that satisfy weekly exercise requirements* Safeguard your healing system by adding four antioxidant supplements--vitamin C and E, selenium, and mixed carotenes--to your diet* Incorporate five basic breathing exercises for greater relaxation and energy* Benefit from visualization, overcome sleeping problems, and test and filter your water supply* Make art, music, and the natural world more important parts of your lifePLUS--a dozen tailored programs that address the specific needs of pregnant women, senior citizens, overweight people, and those at risk for cancer.",
        "Category": " Health & Fitness , Health Care Issues",
        "Publisher": "Random House Audio",
        "Price Starting With ($)": "5.11",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Public Management Strategies: Guidelines for Managerial Effectiveness (Jossey Bass Public Administration Series)",
        "Authors": "By Bozeman, Barry and Straussman, Jeffrey D.",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Jossey-Bass Inc Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Adolescent Mothers in Later Life (Human Development in Cultural and Historical Contexts)",
        "Authors": "By Furstenberg, Frank F., Brooks-Gunn, J., and Morgan, S. Philip",
        "Description": "This landmark study traces the life histories of approximately 300 teenage mothers and their children over a seventeen-year period.  From interview data and case studies, it provides a vivid account of the impact of early childbearing on young mothers and their children.    Some remarkable and surprising results emerge from this unique study of the long term adaptation to early parenthood.  It also offers new insights into the unexplored connections between mothers' careers and the development of their children. Adolescent Mothers in Later Life will be  an invaluable resource for all those interested in teenage pregnancy.",
        "Category": " Psychology , Developmental , Child",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Two fighters and two fines;: Sketches of the lives of Matthew Lyon and Andrew Jackson,",
        "Authors": "By Campbell, Tom W",
        "Description": "",
        "Category": "",
        "Publisher": "Pioneer Publishing Company",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "January",
            "Year": "1941"
        }
    },
    {
        "Title": "An Affair of State: The Investigation, Impeachment, and Trial of President Clinton",
        "Authors": "By Posner, Richard A.",
        "Description": "President Bill Clinton's year of crisis, which began when his affair with Monica Lewinsky hit the front pages in January 1998, engendered a host of important questions of criminal and constitutional law, public and private morality, and political and cultural conflict. In a book written while the events of the year were unfolding, Richard Posner presents a balanced and scholarly understanding of the crisis that also has the freshness and immediacy of journalism. Posner clarifies the issues and eliminates misunderstandings concerning facts and the law that were relevant to the investigation by Independent Counsel Kenneth Starr and to the impeachment proceeding itself. He explains the legal definitions of obstruction of justice and perjury, which even many lawyers are unfamiliar with. He carefully assesses the conduct of Starr and his prosecutors, including their contacts with the lawyers for Paula Jones and their hardball tactics with Monica Lewinsky and her mother. He compares and contrasts the Clinton affair with Watergate, Iran-Contra, and the impeachment of Andrew Johnson, exploring the subtle relationship between public and private morality. And he examines the place of impeachment in the American constitutional scheme, the pros and cons of impeaching President Clinton, and the major procedural issues raised by both the impeachment in the House and the trial in the Senate. This book, reflecting the breadth of Posner's experience and expertise, will be the essential foundation for anyone who wants to understand President Clinton's impeachment ordeal.",
        "Category": " Law , Constitutional",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Our America - Little Stories for Young Patriots",
        "Authors": "By Constance (ed) Holland",
        "Description": "",
        "Category": "",
        "Publisher": "McLoughlin Bros., Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1941"
        }
    },
    {
        "Title": "Infinite in All Directions",
        "Authors": "By Dyson, Freeman",
        "Description": "Paper reprint of the Harper & Row edition of 1988. It is a revision of Dyson's Gifford Lectures delivered in Aberdeen in 1985. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Science , Philosophy & Social Aspects",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Regard sur les Francaises: Xe siecle-XXe siecle (French Edition)",
        "Authors": "By Michèle Sarde",
        "Description": "",
        "Category": "",
        "Publisher": "STOCK",
        "Price Starting With ($)": "5.38",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "How to Do Everything with Your Palm Handheld",
        "Authors": "By Johnson, Dave and Broida, Rick",
        "Description": "Introduces the features of the Palm handheld, covering applications, accessories, shortcuts, integration with Microsoft Office, Internet connections, scheduling, games, troubleshooting, upgrading, and other devices using the Palm OS.",
        "Category": " Computers , Hardware , Personal Computers , General",
        "Publisher": "Osborne/McGraw-Hill",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "One of a kind: A biblical view of self-acceptance",
        "Authors": "By Smith, M. Blaine",
        "Description": "",
        "Category": "",
        "Publisher": "InterVarsity Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Dr. Quake (Destroyer)",
        "Authors": "By Sapir, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Pinnacle",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "A Long Row of Candles: Memoirs & Diaries, 1934-1954",
        "Authors": "By Sulzberger, C. L.",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan Company",
        "Price Starting With ($)": "6.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "The Life of Christ: Images from the Metropolitan Museum of Art",
        "Authors": "By Burn, Barbara (COM)",
        "Description": "Shows paintings from the museum's collection that depicts events in Jesus's life from the Annunciation to the Ascension, and includes selections from the Gospels",
        "Category": " Art , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Weber's Art of the Grill Deck: Recipes for Outdoor Living (Discerning Tastes)",
        "Authors": "By Turner, Tim (PHT) and Purviance, Jamie",
        "Description": "Here's everything you need for great grilling and easy outdoor entertaining from Webers grilling experts-all in a portable deck. These convenient cards can follow you from grocery to kitchen to grill, and include over 50 recipes from classic steaks and burgers to Prosciutto-Wrapped Shrimp, Jalapeno-Citrus Tuna Steaks, and Garlic-and-Mint-Roasted Chicken. Each recipe is accompanied by a lavish photograph, plus helpful grilling tips to make outdoor cooking a breeze.",
        "Category": " Cooking , Methods , Barbecue & Grilling",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Yellowthread Street (A Rinehart suspense novel)",
        "Authors": "By Marshall, William Leonard",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Holt, Rinehart and Winston",
        "Price Starting With ($)": "25.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The starry stripy blanket",
        "Authors": "By Kirk, Ellen",
        "Description": "",
        "Category": "",
        "Publisher": "Michael Friedman Pub. Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Langenscheidt's Standard French Dictionary: French-English, English-French (English and French Edition)",
        "Authors": "By Urwin, Kenneth",
        "Description": "Provides the definitions of over 70,000 entries in English and French",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Langenscheidt Pub Inc",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "Royal Gardens",
        "Authors": "By Strong, Roy",
        "Description": "",
        "Category": "",
        "Publisher": "BBC Books; Conran Octopus Limited",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The Book of Energy: Invigorating Ways to Revitalize Your Life",
        "Authors": "By Blanche, Cynthia",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Moment of Creation: Big Bang Physics from before the First Millisecond to the Present Universe",
        "Authors": "By James S. Trefil",
        "Description": "",
        "Category": "",
        "Publisher": "Charles Scribner's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Western Maryland College: The formative years, 1866-1947",
        "Authors": "By Schofield, Samuel Biggs",
        "Description": "",
        "Category": "",
        "Publisher": "Western Maryland College",
        "Price Starting With ($)": "8.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The Red Smith Reader",
        "Authors": "By Anderson, Dave (EDT)",
        "Description": "One hundred twenty-eight of the late, Pulitzer Prize-winning sportswriter's columns profile sports celebrities and chronicle great sports events, spanning fifty-five years",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "UNIX Made Easy: The Basics & Beyond!",
        "Authors": "By Muster, John",
        "Description": "Provides an overview of the UNIX operating system; discusses files, directories, shells, windows, and utilities; and discusses basic system administration tasks",
        "Category": " Computers , Operating Systems , UNIX",
        "Publisher": "McGraw-Hill Osborne Media",
        "Price Starting With ($)": "7.56",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Provencal Light",
        "Authors": "By Shulman, Martha Rose",
        "Description": "The author of Mediterranean Light presents more than two hundred recipes, with nutritional counts and a lively narrative, that capture the essence of fish dishes, salads, breads, desserts, soups, and other foods and dishes of Provence.",
        "Category": " Cooking , Reference",
        "Publisher": "Bantam",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "A Visual Motor Gestalt Test and Its Clinical Use",
        "Authors": "By Bender, Lauretta",
        "Description": "",
        "Category": "",
        "Publisher": "The American Orthopsychiatric Association",
        "Price Starting With ($)": "21.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1938"
        }
    },
    {
        "Title": "The VICTORS : Eisenhower and His Boys: The Men of World War II",
        "Authors": "By Ambrose, Stephen E.",
        "Description": "From America’s preeminent military historian, Stephen E. Ambrose, comes the definitive telling of the war in Europe, from D-Day, June 6, 1944, to the end, eleven months later, on May 7, 1945.This authoritative narrative account is drawn by the author himself from his five acclaimed books about that conflict, most particularly from the definitive and comprehensive D-Day and Citizen Soldiers, about which the great Civil War historian James McPherson wrote, “If there is a better book about the experience of GIs who fought in Europe during World War II, I have not read it. Citizen Soldiers captures the fear and exhilaration of combat, the hunger and cold and filth of the foxholes, the small intense world of the individual rifleman as well as the big picture of the European theater in a manner that grips the reader and will not let him go. No one who has not been there can understand what combat is like but Stephen Ambrose brings us closer to an understanding than any other historian has done.” The Victors also includes stories of individual battles, raids, acts of courage and suffering from Pegasus Bridge, an account of the first engagement of D-Day, when a detachment of British airborne troops stormed the German defense forces and paved the way for the Allied invasion; and from Band of Brothers, an account of an American rifle company from the 506th Parachute Infantry Regiment who fought, died, and conquered, from Utah Beach through the Bulge and on to Hitter's Eagle’s Nest in Germany. Stephen Ambrose is also the author of Eisenhower, the greatest work on Dwight Eisenhower, and one of the editors of the Supreme Allied Commander's papers. He describes the momentous decisions about how and where the war was fought, and about the strategies and conduct of the generals and officers who led the invasion and the bloody drive across Europe to Berlin. But, as always with Stephen E. Ambrose, it is the ranks, the ordinary boys and men, who command his attention and his awe. The Victors tells their stories, how citizens became soldiers in the best army in the world. Ambrose draws on thousands of interviews and oral histories from government and private archives, from the high command—Eisenhower, Bradley, Patton—on down through officers and enlisted men, to re-create the last year of the Second World War when the Allied soldiers pushed the Germans out of France, chased them across Germany, and destroyed the Nazi regime.",
        "Category": " History , United States , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "New York State: Gateway to America",
        "Authors": "By Ellis, Donald Maldwyn",
        "Description": "",
        "Category": "",
        "Publisher": "Windsor Pubns",
        "Price Starting With ($)": "8.3",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "The Boxcar Children (The Boxcar Children, No. 1) (The Boxcar Children Mysteries)",
        "Authors": "By Warner, Gertrude Chandler",
        "Description": "Four orphans take shelter in an old, red boxcar during a storm, and, determined to make it on their own, they turn it into a safe, cozy home.",
        "Category": " Juvenile Fiction , Family , Siblings",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Book of Lilies",
        "Authors": "By Smith, Mark",
        "Description": "Provides information on the histories, characteristics, and cultivation of more than fifty varieties of lilies",
        "Category": " Technology & Engineering , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Career Renewal: Tools for Scientists and Technical Professionals",
        "Authors": "By Rosen, Stephen and Paul, Celia",
        "Description": "I have seen how Stephen Rosen has helped a number of scientists change their careers successfully. This well-written book distills his experience, knowledge and humor in way that can help many others who are thinking about changing succeed as well.\"--DAVID Z. ROBINSON, Carnegie Commission on Science, Technology, and Government, New York",
        "Category": " Science , General",
        "Publisher": "Academic Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Economics of Computers: Costs, Benefits, Policies and Strategies",
        "Authors": "By Gotlieb, C. C.",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.87",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "An Ornery Bunch: Tales and Anecdotes Collected by the WPA Montana Writer's Project 1935-1942",
        "Authors": "By Hiller, Megan (EDT), Newby, Rick (EDT), Peterson, Elaine (EDT), Swaney, Alexandra (EDT), and Writers' Program of the Work Projects Administration (COR)",
        "Description": "Collection of stories from the Montana Writer's Project of the Works Progress Administration (WPA) based on oral history interviews and researched folklore.",
        "Category": " Travel , United States , West , Mountain (AZ, CO, ID, MT, NM, NV, UT, WY)",
        "Publisher": "TwoDot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Nothing to Lose",
        "Authors": "By Friedman, Lisa",
        "Description": "",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Creative Arts Book Company",
        "Price Starting With ($)": "9.68",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Creative Natural Cooking: Revised Edition",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    }
]