[
    {
        "Title": "Hitty Her First Hundred Years",
        "Authors": "By Field, Rachel and Lathrop, Dorothy P. (ILT)",
        "Description": "Hitty is a doll of great charm and character. It is indeed a privilege to publish her memoirs, which, besides being full of the most thrilling adventures on land and sea, also reveal her delightful personality. One glance at her portrait will show that she is no ordinary doll. Hitty, or Mehitable as she was really named, was made in the early 1800s for Phoebe Preble, a little girl from Maine. Young Phoebe was very proud of her beautiful doll and took her everywhere, even on a long sailing trip in a whaler. This is the story of Hitty's years with Phoebe, and the many that follow in the life of a well-loved doll.",
        "Category": " Juvenile Fiction , Toys, Dolls & Puppets",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Grandmas at Bat (I Can Read Level 2)",
        "Authors": "By McCully, Emily Arnold (ILT) and McCully, Emily Arnold",
        "Description": "In this quirky duo’s third adventure, the Grandmas pitch in to help when Pip’s regular baseball coach contracts the chicken pox. But the trouble is, neither of them know beans about the game. ‘A double-threat winner, combining the humor of the two grandmas with enough play-by-play description to gladden the hearts of young baseball fans.’ –– H.  ‘Baseball action and amusingly caricatured grandmas are deftly drawn.’ –– K.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The Iraq War: The Military Offensive, from Victory in 21 Days to the Insurgent Aftermath",
        "Authors": "By Keegan, John",
        "Description": "The 2003 Iraq war remains among the most mysterious armed conflicts of modernity. In The Iraq War, John Keegan offers a sharp and lucid appraisal of the military campaign, explaining just how the coalition forces defeated an Iraqi army twice its size and addressing such questions as whether Saddam Hussein ever possessed weapons of mass destruction and how it is possible to fight a war that is not, by any conventional measure, a war at all.Drawing on exclusive interviews with Donald Rumsfeld and General Tommy Franks, Keegan retraces the steps that led to the showdown in Iraq, from the highlights of Hussein’s murderous rule to the diplomatic crossfire that preceded the invasion. His account of the combat in the desert is unparalleled in its grasp of strategy and tactics. The result is an urgently needed and up-to-date book that adds immeasurably to our understanding of those twenty-one days of war and their long, uncertain aftermath.",
        "Category": " History , Military , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Alex Cross's TRIAL (Alex Cross Adventures, 1)",
        "Authors": "By Patterson, James and Dilallo, Richard",
        "Description": "Written in the fearless voice of Detective Alex Cross, Alex Cross's Trial is a #1 New York Times bestseller of murder, love, and above all, bravery.From his grandmother, Alex Cross has heard the story of his great uncle Abraham and his struggles for survival in the era of the Ku Klux Klan. Now, Alex passes the family tale along to his own children in a novel he's written-a novel called Trial.As a lawyer in turn-of-the-century Washington D.C., Ben Corbett represents the toughest cases. Fighting against oppression and racism, he risks his family and his life in the process. When President Roosevelt asks Ben to return to his home town to investigate rumors of the resurgence of the Ku Klux Klan there, he cannot refuse. When he arrives in Eudora, Mississippi, Ben meets the wise Abraham Cross and his beautiful granddaughter, Moody. Ben enlists their help, and the two Crosses introduce him to the hidden side of the idyllic Southern town. Lynchings have become commonplace and residents of the town's black quarter live in constant fear. Ben aims to break the reign of terror-but the truth of who is really behind it could break his heart. Written in the fearless voice of Detective Alex Cross, Alex Cross's Trial is a gripping story of courage in the face of prejudice and terror.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Gary Rhodes Fabulous Food",
        "Authors": "By Lane, Sandra (PHT) and Rhodes, Gary",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "6.22",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Journeys to the Heart of Baltimore",
        "Authors": "By Olesker, Michael",
        "Description": "In Journeys to the Heart of Baltimore, veteran journalist Michael Olesker writes of Baltimore's melting pot in all its rollicking, sentimental, good-natured, and chaotic essence. The stories come from neighborhood street corners and front stoops, playgrounds and school rooms, churches and synagogues, and families gathered around late-night kitchen tables.The D'Alesandro political dynasty comes to life here, and so do Lenny Moore and Artie Donovan of the legendary Baltimore Colts. The old East Baltimore ethnic enclaves nurture youngsters named Barbara Mikulski and Ted Venetoulis, and out of West Baltimore comes the future Afro-American newspaper publisher Jake Oliver.Journeys to the Heart of Baltimore is a delightful reminder of the nation's ethnic and racial mosaic, home to a future governor named Martin O'Malley and a future U.S. Representative named Dutch Ruppersberger. Boys from Baltimore's Little Italy, like John Pica, go off to fight a war in Italy when they know their allegiance is being tested. And a city struggles through racial convulsions, remembered by those such as John Steadman and Father Constantine Sitaris.",
        "Category": " Social Science , Discrimination & Race Relations",
        "Publisher": "Johns Hopkins University Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "The Day Before America",
        "Authors": "By MacLeish, William H. and Bryant, Will (ILT)",
        "Description": "History and prehistory come alive in this extraordinary account of America as it was before it got its name. William H. MacLeish paints a heart-rending portrait of the lush, miraculous New World on the eve of the Encounter - the arrival of the first Europeans, after which nothing would be the same. Drawing on the work of anthropologists, geologists, and other academic experts, MacLeish roams over 18,000 years of the continent's history, exploring the role of climate and human activity in preparing the world that we have inherited. The Day Before America is studded with fascinating information on the awesome changes wrought by the ice age (and the inevitability of its return), the ecological effects of hunting and early agriculture, the astonishing variety of Indian civilizations, and the transformations in the continent's nature over the past five hundred years. It is a book informed by a deep commitment to the wonder and sacredness of the natural world. At bottom, it is a statement of belief in an unsentimental environmentalism - an effort to see our world in the longest view, and to value it all the more for that.",
        "Category": " History , United States , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Happy Cooking: More Light Classics from Today's Gourmet",
        "Authors": "By Pepin, Jacques",
        "Description": "Gathers recipes for appetizers, main dishes, side dishes, breads, and desserts, and includes a nutritional analysis of each meal",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Bay Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "The Yeast Syndrome",
        "Authors": "By John Parks Trowbridge, Morton Walker",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "The Big Lifters",
        "Authors": "By Ing, Dean",
        "Description": "Business tycoon and engineer John Wesley Peel matches wits with Middle Eastern terrorists, the trucking industry, and its unions as he struggles to build an innovative spaceship, the Big Lifter",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "19.97",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "From A French Country Kitchen - The Culinary Tradition Of La Madeleine French Bakery & Cafe",
        "Authors": "By Esquerre, Monique And Patrick",
        "Description": "",
        "Category": "",
        "Publisher": "la Madeleine French Bakery",
        "Price Starting With ($)": "6.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Bugle,: A puppy in old Yorktown (Tip-top elf book)",
        "Authors": "By Andrews, Mary Evans",
        "Description": "",
        "Category": "",
        "Publisher": "Rand McNally",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1958"
        }
    },
    {
        "Title": "The New Guide to Compact Discs 1988 (PENGUIN GUIDE TO COMPACT DISCS AND DVDS)",
        "Authors": "By March, Ivan, Greenfield, Edward, and Layton, Robert",
        "Description": "",
        "Category": " Music , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "6.43",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Getting more done in less time-- & having more fun doing it!",
        "Authors": "By Phillips, Mike",
        "Description": "",
        "Category": "",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Sense and Sensibility (Barnes & Noble Classics Series) (B&N Classics)",
        "Authors": "By Austen, Jane and Engel, Laura",
        "Description": "Sense and Sensibility, by Jane Austen, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics: New introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.Jane Austen’s first published novel, Sense and Sensibility is a wonderfully entertaining tale of flirtation and folly that revolves around two starkly different sisters, Elinor and Marianne Dashwood. While Elinor is thoughtful, considerate, and calm, her younger sister is emotional and wildly romantic. Both are looking for a husband, but neither Elinor’s reason nor Marianne’s passion can lead them to perfect happiness—as Marianne falls for an unscrupulous rascal and Elinor becomes attached to a man who’s already engaged.    Startling secrets, unexpected twists, and heartless betrayals interrupt the marriage games that follow. Filled with satiric wit and subtle characterizations, Sense and Sensibility teaches that true love requires a balance of reason and emotion.Laura Engel received her BA from Bryn Mawr College and her MA and PhD from Columbia University. She has taught in independent schools in New York city and is now a visiting assistant professor of English at Macalester College. Her previous publications include essays on the novelists A. S. Byatt and Edna O’Brien. Her forthcoming book is a biography of three eighteenth-century British actresses.",
        "Category": " Fiction , Classics",
        "Publisher": "Barnes Noble Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "THE AUTHENTIC LIBRETTOS OF THE FRENCH AND GERMAN OPERAS: CARMEN, FAUST, MANON, TALES OF HOFFMAN, LAKME, HANSEL & GRETEL..",
        "Authors": "By Author Unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1939"
        }
    },
    {
        "Title": "Great Mysteries of History",
        "Authors": "By Platnick, Kenneth B.",
        "Description": "Challenges the reader's imagination with a collection of unsolved, mysterious events involving celebrated persons in history",
        "Category": "",
        "Publisher": "Hippocrene Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Thomas Jefferson: A Strange Case of Mistaken Identity",
        "Authors": "By Mapp, Alf J.",
        "Description": "A monumental reassessment of Jefferson's character and impact... —Booklist",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Madison Books",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The Ghost of KRZY (Bloodhounds, Inc #1)",
        "Authors": "By Myers, Bill",
        "Description": "Sean and Melissa, a brother and sister detective team, investigate some thefts and mysterious electrical disturbances at their father's radio station.",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Business Style Handbook: An A-to-Z Guide for Writing on the Job with Tips from Communications Experts at the Fortune 500",
        "Authors": "By Greene, Brenda and Cunningham, Helen",
        "Description": "In the everyday work world, most professionals are on their own when it comes to writing reports, memos, proposals, and other necessary correspondence. The Business Style Handbook is a practical and comprehensive guide that focuses specifically on the writing issues that frequently arise on the job. Insights and feedback from Fortune 500 communications executives provide tips and advice on improving writing style and effectiveness, while more than 1,200 alphabetized entries cover the essentials of style and usage, grammatical concepts, and more.",
        "Category": " Business & Economics , Business Writing",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "The Unofficial Guide to Acing the Interview",
        "Authors": "By Tullier, L. Michelle and Unofficial Panel (EDT)",
        "Description": "In the United States, over 131 million people are in the job market. With the work force expected to grow 11 percent by 2005 to more than 147 million jobs, candidates need a hard-hitting guide that will set them apart from the competition. In addition, readers already employed need to keep up-to-date on current trends in interviewing strategies, practices, and techniques. This no-nonsense guide provides in-depth coverage and proven methods that sell job hunters even to the toughest interviewer. The Unofficial Guide to Acing the Interview arms job hunters with winning strategies that help them: Get noticed with attention-grabbing cover letters and resumes Successfully research the employer, including industry issues, trends, and problems Smooth problem areas such as employment gaps Get the salary they want Answer even the most offbeat questions Follow-up successfully to ensure a second meeting",
        "Category": " Business & Economics , Careers , Job Hunting",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Angels in America: A Gay Fantasia on National Themes, Part 2 : Perestroika (Angels in America)",
        "Authors": "By Kushner, Tony",
        "Description": "Dramatizes the effects of AIDS on the United States through the experiences of lawyer Roy Cohn, a Mormon couple, and a young man called Prior Walter",
        "Category": " Drama , General",
        "Publisher": "Theatre Communications Group",
        "Price Starting With ($)": "18.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Natural Fat-Loss Pharmacy",
        "Authors": "By Preuss, Harry",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale Press, Inc.",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Balanchine's Complete Stories of the Great Ballets, Revised and Enlarged",
        "Authors": "By Balanchine, George",
        "Description": "A short history of the ballet and a review of Balanchine's own career as ballet master and choreographer accompany the stories of more than four hundred ballets",
        "Category": " Performing Arts , General",
        "Publisher": "Doubleday & Company",
        "Price Starting With ($)": "19.7",
        "Publish Date": {
            "Month": "November",
            "Year": "1977"
        }
    },
    {
        "Title": "The Three Little Pigs (Sleepy Time Stories)",
        "Authors": "By CHRISTINE DEVERELL",
        "Description": "",
        "Category": "",
        "Publisher": "Grandreams Books Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "HOWARD'S SCREECHY VIOLIN (READY READER STORYBOOK, THIRD GRADE)",
        "Authors": "By Nancy Parent",
        "Description": "",
        "Category": "",
        "Publisher": "Modern Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Elmo's 12 Days of Christmas (Jellybean Books(R))",
        "Authors": "By Albee, Sarah, Henson, Jim, Children's Television Workshop (COR), and Swanson, Maggie (ILT)",
        "Description": "Sesame Street monster Elmo relates his own monster version of the traditional Christmas song.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Contemporary Strategy Analysis, Third Edition (Blackwell Business)",
        "Authors": "By Grant, Robert M.",
        "Description": "",
        "Category": " Business & Economics , Strategic Planning",
        "Publisher": "Wiley-Blackwell",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Zel",
        "Authors": "By Napoli, Donna Jo",
        "Description": "High in the mountains, Zel lives with her mother, who insists they have all they need -- for they have each other. Zel's life is peaceful and protected -- until a chance encounter changes everything. When she meets a beautiful young prince at the market one day, she is profoundly moved by new emotions. But Zel's mother sees the future unfolding -- and she will do the unspeakable to prevent Zel from leaving her...\"Will leave readers spellbound.\"-- Publishers Weekly, starred review",
        "Category": " Young Adult Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Baby's First Book (Little Golden Book)",
        "Authors": "By Williams, Garth (ILT) and Williams, Garth",
        "Description": "Garth Williams writes and illustrates a sweet, simple book about all the things important to Baby: his bowl, his spoon, a bird singing outside the window, and of course, Teddy Bear! Our youngest readers will love poring over Williams's cozy, large-scale pictures.",
        "Category": " Juvenile Nonfiction , Language Arts , Vocabulary & Spelling",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Darklost",
        "Authors": "By Farren, Mick",
        "Description": "Los Angeles--City of Angels, city of dreams. But sometimes the dreams become nightmares.Having fled New York, Victor Renquist and his small group of Nosferatu are striving to reestablish their Colony in Los Angeles. They have become a deeper, darker part of the city's nightlife. And Hollywood's glitterati are hot on the scent of a new thrill, one that outshines all others--immortality.But someone, somewhere, is meddling with even darker powers, powers that even the Nosferatu fear. Someone is attempting to summon the entity of ancient evil known at Cthulhu.And Renquist must overcome dissent in his own Colony, solve the riddle of the Darklost (a being brought  partway along the Nosferatu path and then abandoned), and combat powerful enemies to save the world--of humans!",
        "Category": " Fiction , Horror",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Illustrated Stratford Shakespeare",
        "Authors": "By Exeter, Shakespeare",
        "Description": "",
        "Category": "",
        "Publisher": "Chancellor",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "True Prosperity",
        "Authors": "By Robison, James",
        "Description": "In the church we often see two extreme views of prosperity. One says that Christians should have nothing; another says Christians should have it all. InTrue Prosperity, James Robison explains how we can experience true prosperity by living in the freedom of sacrificial giving—of all our resources, including finances, time, gifts, and abilities. By adopting a “river mentality,” we can benefit as we allow the resources that God has entrusted to us to “flow through” to benefit others.",
        "Category": " Religion , Inspirational",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Exploring the Da Vinci Code: Investigating the Issues Raised by the Book and Movie",
        "Authors": "By Strobel, Lee and Poole, Garry",
        "Description": "Exploring the Da Vinci Code takes you on a fascinating journey to London, Paris, and California with Lee Strobel and Garry Poole as they investigate the claims made by Dan Brown in his novel, The Da Vinci Code. It provides quick, straightforward answers to the most troubling aspects of the popular novel and major motion picture, which is scheduled to release in theatres May 19, 2006. This outreach book is designed so readers can give multiple copies to friends, family, coworkers---anyone who may be struggling with the misconceptions fostered by The Da Vinci Code. Exploring the Da Vinci Code is not to be confused with Zondervan's DVD Group discussion resource, Discussing the Da Vinci Code. The latter links a DVD to a group discussion guide and equips group members to personally combat the misunderstandings that many readers of The Da Vinci Code have.",
        "Category": " Religion , Christian Education , Adult",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Backgrounds to medieval English literature (A Random House study in language and literature, SLL7)",
        "Authors": "By Ackerman, Robert William",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Learning in Adulthood: A Comprehensive Guide (Jossey Bass Higher & Adult Education Series)",
        "Authors": "By Merriam, Sharan B. and Caffarella, Rosemary S.",
        "Description": "\"An essential volume in adult education.\"--Choice\"Merriam and Caffarella provide an excellent resource whose value will last until the appearance of the third edition.\"--Continuing Higher Education ReviewThe second edition of Learning in Adulthood integrates the most important contributions to adult learning in the last decade. The result is an updated, comprehensive synthesis of what we now know about adult learning--including the context in which it takes place, who the participants are, what they learn and why, the nature of the learning process itself, major theoretical developments, and much more. Sharan Merriam and Rosemary Caffarella reveal how sociocultural influences can create specific developmental needs and interests, and how such social factors as race, class, and gender can shape learning. From this background, they construct a more inclusive perspective on adult learning, guiding readers toward new ways of thinking about teaching, learning, and the broader social implications of adult education.",
        "Category": " Education , Educational Psychology",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Tess of the d'Urbervilles, Introduction and notes by David Galef",
        "Authors": "By Hardy, Thomas and Galef, David",
        "Description": "&&LDIV&&R&&LDIV&&R&&LI&&RTess of the d'Urbervilles&&L/I&&R, by &&LB&&RThomas Hardy&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&RHighly controversial because of its frank look at the sexual hypocrisy of Victorian society, &&LB&&RThomas Hardy&&L/B&&R’s &&LI&&RTess of the D’Urbervilles&&L/I&&R was nonetheless a great commercial success when it appeared in 1891. It is now considered one of the finest novels in English.&&LBR&&R&&LBR&&RUsing richly poetic language to frame a shattering narrative of love, seduction, betrayal, and murder, Hardy tells the story of Tess Durbeyfield, a beautiful young woman living with her impoverished family in Wessex, the southwestern English county immortalized by Hardy. After the family learns of their connection to the wealthy d’Urbervilles, they send Tess to claim a portion of their fortune. She meets and is seduced by the dissolute Alec d’Urberville and secretly bears a child, Sorrow, who dies in infancy. A very different man, Angel Clare, seems to offer Tess love and salvation, but he rejects her—on their wedding night—after learning of her past. Emotionally bereft, financially impoverished, and victimized by the self-righteous rigidity of English social morality, Tess escapes from her vise of passion through a horrible, desperate act.&&LBR&&R&&LBR&&RWith its compassionate portrait of a young rural woman, powerful criticism of social convention, and disarming consideration of the role of destiny in human life, &&LI&&RTess of the D’Urbervilles&&L/I&&R is one of the most moving and memorable of Hardy’s novels.&&LBR&&R&&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R&&LSTRONG&&RDavid Galef&&L/B&&R&&L/B&&R has published nine books: the novels &&LI&&RFlesh&&L/I&&R and &&LI&&RTurning Japanese;&&L/I&&R two children's books, &&LI&&RThe Little Red Bicycle&&L/I&&R and&&LI&&R Tracks;&&L/I&&R two translations of Japanese proverbs, &&LI&&REven Monkeys Fall from Trees&&L/I&&R and &&LI&&REven a Stone Buddha Can Talk;&&L/I&&R a work of literary criticism, &&LI&&RThe Supporting Cast;&&L/I&&R an edited anthology of essays called &&LI&&RSecond Thoughts: A Focus on Rereading;&&L/I&&R and, most recently, the short-story collection &&LI&&RLaugh Track.&&L/I&&R In addition, he has written more than seventy short stories for magazines ranging from the British &&LI&&RPunch&&L/I&&R to the Czech &&LI&&RPrague Revue,&&L/I&&R the Canadian &&LI&&RPrism International,&&L/I&&R and the American &&LI&&RShenandoah.&&L/I&&R His essays and reviews have appeared in the &&LI&&RNew York Times, Newsday,&&L/I&&R the &&LI&&RVillage Voice, Twentieth Century Literature, The Columbia History of the British Novel,&&L/I&&R and many other places. He is a professor of English at the University of Mississippi, where he also administers the M.F.A. program in creative writing. &&L/P&&R&&L/DIV&&R",
        "Category": " Fiction , Classics",
        "Publisher": "Barnes Noble Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "I Want to Be a Fire Fighter (Sesame Street)",
        "Authors": "By Children's Television Workshop (COR), Cooke, Tom (ILT), and Maifair, Linda Lee",
        "Description": "Grover learns how fire fighters put out fires, steer hook and ladder trucks, wash fire trucks, and handle the hoses.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Italian Classics (Best Recipe)",
        "Authors": "By Cook's Illustrated Magazine (EDT), Burgoyne, John (ILT), Tremblay, Carl (PHT), and Van Ackere, Daniel (PHT)",
        "Description": "Favorite Italian dishes updated for the home cook. What's the best way to prevent ricotta cheesecake from becoming watery? Is there a trick for coaxing more flavor from basil when making pesto? Does bread flour self-raising flour make better pizza dough? In an exhaustive effort to answer these questions and hundreds more, the editors of \"Cook's Illustrated\" magazine have conducted hundreds of kitchen tests. The result is \"Italian Classics\", a 496-page award-winning cookbook packed with recipes, food tastings, equipment testings, and cooking tips straight from the Cook's Illustrated test kitchen. Designed with the home cook in mind, this collection of classic Italian recipes has been stripped to the bone and then reworked, updated, and improved so that each recipe is as close to foolproof as we can make it. More than 300 recipes cover the wide range of Italian home cooking, from Tuscan pork roast, and risotto, to tomato and bread soup, vegetable lasagne, and strawberries with balsamic vinegar. Learn to cook less well-known regional recipes such as steak Fiorentina, baked peaches stuffed with amaretti, and stracotto, an Italian pot roast. \"Italian Classics\" also contains more than 225 illustrations that will show you techniques such as how to peel garlic cloves quickly, how to roll out pasta dough, and how to assemble tiramisu. The book also includes dozens of no-nonsense equipment ratings and taste tests of supermarket ingredients. Find out why American pastas are every bit as good as Italian brands, which grater makes quick work of Parmesan cheese, and which electronic scale is our \"best buy\". You will also learn which type of pork chop - centre-cut or rib - is best for cooking and what the difference is between pancetta and bacon.",
        "Category": " Cooking , Regional & Ethnic , Italian",
        "Publisher": "America's Test Kitchen",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Party Entertaining",
        "Authors": "By Rh Value Publishing",
        "Description": "More than two hundred and fifty sweet and savory recipes for appetizers, snacks, main courses, and desserts, gathered from all over the world, turn any occasion into something truly special.",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Schaum's Outline of Digital Principles",
        "Authors": "By Tokheim, Roger L.",
        "Description": "If you want top grades and thorough understanding of digital principles, this powerful study tool is the best tutor you can have! It takes you step-by-step through the subject and gives you accompanying related problems with fully worked solutions. You also get additional problems to solve on your own, working at your own speed. (Answers at the back show you how you’re doing.) Famous for their clarity, wealth of illustrations and examples—and lack of dreary minutiae—Schaum’s Outlines have sold more than 30 million copies worldwide. This guide will show you why!",
        "Category": " Technology & Engineering , Electronics , Circuits , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Greatest Football Games of All Time",
        "Authors": "By Sports Illustrated (EDT) and Hersch, Hank",
        "Description": "Profiles the most exciting games in professional football history",
        "Category": " Sports & Recreation , Football",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The Squire's Tale (The Squire's Tales, 1)",
        "Authors": "By Morris, Gerald",
        "Description": "Growing up an orphan in an isolated cottage in the woods, young Terence never expected much adventure. But upon the arrival of Gawain, his life takes a surprising turn. Gawain is destined to become one of the most famous knights of the Round Table. Terence becomes Gawain's squire and leaves his secluded life for one of adventure in King Arthur's court. In no time Terence is plunged into the exciting world of kings, wizards, knights, wars, magic spells, dwarfs, damsels in distress, and enchanters. As he adjusts to his new life, he proves to be not only an able squire but also a keen observer of the absurdities around him. His duties take him on a quest with Gawain and on a journey of his own, to solve the mystery of his parentage. Filled with rapier-sharp wit, jousting jocularity, and chuckleheaded knights, this is King Arthur's court as never before experienced.",
        "Category": " Young Adult Fiction , Legends, Myths, Fables , Arthurian",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Webster's New Pocket Dictionary",
        "Authors": "By Webster's New College Dictionary (COR)",
        "Description": "From the publishers of Webster&#39;s New World® Dictionary:      • The clearest, most concise definitions     • Over 35,000 entries     • The ideal portable companion to Webster&#39;s New Pocket Thesaurus       • Portable—ideal for school or work",
        "Category": " Reference , Dictionaries",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "STORMY : Misty's Foal",
        "Authors": "By Henry, Marguerite",
        "Description": "",
        "Category": "",
        "Publisher": "Rand McNally and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Roget's Pocket Thesaurus",
        "Authors": "By Houghton Mifflin Company",
        "Description": "Roget's Pocket Thesaurus is a handy guide to key English synonyms. Main entries contain full paragraphs detailing nuances of meaning and usage among related synonyms, often including example sentences or phrases. Other entries provide a core meaning and a selected list of the most important synonyms.  A convenient appendix groups related nouns, adjectives, prefixes, and suffixes ? a browser's delight.",
        "Category": " Reference , Thesauri",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Crossing (The Border Trilogy)",
        "Authors": "By McCarthy, Cormac and Pitt, Brad (NRT)",
        "Description": "2 cassettes / 3 hoursRead by Brad PittBrad Pitt reads Cormac McCarthy's The Crossing.Following All the Pretty Horses in Cormac McCarthy's Border Trilogy,The Crossing is a novel whose force of language is matched only by its breadth of experience and depth of thought.In the bootheel of New Mexico hard on the frontier, Billy and Boyd Parham are just boys in the years before the Second World War, but on the cusp of unimaginable events.  First comes a trespassing Indian and the dream of wolves running wild amongst the cattle lately brought onto the plain by settlers -- this when all the wisdom of trappers has disappeared along with the trappers themselves.  And so Billy sets forth at the age of sixteen on an unwitting journey into the souls of boys and animals and men.  Having trapped a she-wolf he would restore to the mountains of Mexico, he is long gone and returns to find everything he left behind transformed utterly in this absence.  Except his kid brother, Boyd, with whom he strikes out yet again to reclaim what is theirs -- thus crossing into \"that antique gaze from whence there could be no way back forever.\"An essential novel by any measure,",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Random House Audio",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "How to Pick a Peach: The Search for Flavor from Farm to Table",
        "Authors": "By Parsons, Russ",
        "Description": "Critics greeted Russ Parsons’ first book, How to Read a French Fry, with raves. The New York Times praised it for its “affable voice and intellectual clarity”; Julia Child lauded it for its “deep factual information.” Now in How to Pick a Peach, Parsons takes on one of the hottest food topics today. Good cooking starts with the right ingredients, and nowhere is that more true than with produce. Should we refrigerate that peach? How do we cook that artichoke? And what are those different varieties of pears? Most of us aren’t sure. Parsons helps the cook sort through the produce in the market by illuminating the issues surrounding it, revealing intriguing facts about vegetables and fruits in individual profiles about them, and providing instructions on how to choose, store, and prepare these items. Whether explaining why basil, citrus, tomatoes, and potatoes should never be refrigerated, describing how Dutch farmers revolutionized the tomato business in America, exploring organic farming and its effect on flavor, or giving tips on how to recognize a ripe melon, How to Pick a Peach is Parsons at his peak.",
        "Category": " Cooking , Specific Ingredients , Vegetables",
        "Publisher": "Harvest",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Boots on the Ground: A Month with the 82nd Airborne in the Battle for Iraq",
        "Authors": "By Zinsmeister, Karl",
        "Description": "Includes 32 color photos taken by the author during the month he was embedded with the 82nd in Kuwait and Iraq.This is a riveting account of the war in Iraq moving north with the 82nd Airborne. Units of the 82nd depart Kuwait and convoy to Iraq's Tallil Air Base en route to night-and-day battles within the major city of Samawah and its intact bridges across the Euphrates. Boots on the Ground quickly becomes an action-filled microcosm of the new kinds of ultramodern war fighting showcased in the overall battle for Iraq. At the same time it remains specific to the daily travails of the soldiers. Karl Zinsmeister, a frontline reporter who traveled with the 82nd, vividly conveys the careful planning and technical wizardry that go into today's warfare, even local firefights, and he brings to life the constant air-ground interactions that are the great innovation of modern precision combat.What exactly does it feel like to travel with a spirited body of fighting men? To come under fire? To cope with the battlefield stresses of sleep-deprivation, and a steady diet of field rations for weeks on end? Readers of this day-to-day diary are left with not only a flashing sequence of strong mental images, but also a notion of the sounds and smells and physical sensations that make modern military action unforgettable.Ultimately, Boots on the Ground is a human story: a moving portrayal of the powerful bonds of affection, trust, fear, and dedication that bind real soldiers involved in battle. There are unexpected elements: The humor that bubbles up amidst dangerous fighting. The pathos of a badly wounded young boy. The affection openly exhibited by many American soldiers--love of country, love of family and hometown, love of each other. This is a true-life tale of superbly trained men in extraordinary circumstances, packed with concrete detail, often surpassing fiction for sheer drama.Includes 32 color photos taken by the author during the month he was embedded with the 82nd in Kuwait and Iraq.This is a riveting account of the war in Iraq moving north with the 82nd Airborne. Units of the 82nd depart Kuwait and convoy to Iraq's Tallil Air Base en route to night-and-day battles within the major city of Samawah and its intact bridges across the Euphrates. Boots on the Ground quickly becomes an action-filled microcosm of the new kinds of ultramodern war fighting showcased in the overall battle for Iraq. At the same time it remains specific to the daily travails of the soldiers. Karl Zinsmeister, a frontline reporter who traveled with the 82nd, vividly conveys the careful planning and technical wizardry that go into today's warfare, even local firefights, and he brings to life the constant air-ground interactions that are the great innovation of modern precision combat.What exactly does it feel like to travel with a spirited body of fighting men? To come under fire? To cope with the battlefield stresses of sleep-deprivation, and a steady diet of field rations for weeks on end? Readers of this day-to-day diary are left with not only a flashing sequence of strong mental images, but also a notion of the sounds and smells and physical sensations that make modern military action unforgettable.Ultimately, Boots on the Ground is a human story: a moving portrayal of the powerful bonds of affection, trust, fear, and dedication that bind real soldiers involved in battle. There are unexpected elements: The humor that bubbles up amidst dangerous fighting. The pathos of a badly wounded young boy. The affection openly exhibited by many American soldiers--love of country, love of family and hometown, love of each other. This is a true-life tale of superbly trained men in extraordinary circumstances, packed with concrete detail, often surpassing fiction for sheer drama.",
        "Category": " History , Middle East , General",
        "Publisher": "Truman Talley Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The years of the pilgrimage",
        "Authors": "By Davis, Kenneth Sydney",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "8.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1948"
        }
    },
    {
        "Title": "Crash Proof: How to Profit From the Coming Economic Collapse",
        "Authors": "By Downes, John and Schiff, Peter D.",
        "Description": "The economic tipping point for the United States is no longer theoretical. It is a reality today. The country has gone from the world's largest creditor to its greatest debtor; the value of the dollar is sinking; domestic manufacturing is winding down - and these trends don't seem to be slowing. Peter Schiff casts a sharp, clear-sighted eye on these factors and explains what the possible effects may be and how investors can protect themselves. For more than a decade, Schiff has not only observed the U.S. economy, but also helped his clients reposition their portfolios to reflect his outlook. What he sees is a nation facing an economic storm brought on by growing federal, personal, and corporate debt, too-little savings, a declining dollar, and lack of domestic manufacturing. Crash-Proof is an informed and informative warning of a looming period marked by sizeable tax hikes, loss of retirement benefits, double digit inflation, even - as happened recently in Argentina - the possible collapse of the middle class. However, Schiff does have a survival plan that can provide the protection that readers will need in the coming years.",
        "Category": " Business & Economics , Forecasting",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "The Presence: A Novel",
        "Authors": "By Saul, John",
        "Description": "“Enough smoothly crafted suspense to keep readers turning pages long after dark.”—The Seattle TimesBeyond the sparkling Hawiian beaches, masked by the deceptive beauty of the rainforest, evil awaits sixteen-year-old Michael Sundquist and his mother, Katharine, and anthropologist who has come to the Islands to study the unusual skeletal remains unearthed on the volcanic flanks of Halekala, Maui.Yet far below the black depths of the Pacific a mysterious substance snakes through undiscovered fissures in the ocean floor, as nature itself seems to portend the terror to come.Then, with the sudden, unexpected death of Michael’s friend, a disturbing truth dawns: the corporation that is funding Katherine’s dig has a far greater investment than she ever imagined—an investment in medical terror. And her son may be part of their hideous grand plan. . . . “A suspenseful thriller . . . provocative . . . Nicely done, indeed.”—Kirkus Reviews“Classic Saul . . . A potent brew.”—Publishers Weekly",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "The Other Side of Morality",
        "Authors": "By Ridenour, Fritz",
        "Description": "",
        "Category": "",
        "Publisher": "Regal Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Ultimate Chocolate",
        "Authors": "By Lousada, Patricia and O'Leary, Ian (PHT)",
        "Description": "A delectable collection of more than one hundred deep, dark, and delicious recipes for birthdays, Valentine' Day, and other chocolate-worthy occasions is highlighted by three hundred mouth-watering photographs and detailed instructions. 25,000 first printing.",
        "Category": " Cooking , Courses & Dishes , Chocolate",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "The Light of Evening",
        "Authors": "By O'Brien, Edna",
        "Description": "In this contemporary story with universal resonance, Edna O'Brien delves deep into the intense relationship that exists between a mother and daughter who long for closeness yet remain eternally at odds.  From her hospital bed in Dublin, the ailing Dilly Macready eagerly awaits a visit from her long-estranged daughter, Eleanora.  Years before, Eleanora fled Ireland for London when her sensuous first novel caused a local scandal.  Eleanora's peripatetic life since then has brought international fame but personal heartbreak in her failed quest for love. Always, her mother beseeches her to return home, sending letters that are priceless in their mix of love, guilt, and recrimination. For all her disapproval, Dilly herself knows something of Eleanora's need for freedom: as a young woman in the 1920s, Dilly left Ireland for a new life in New York City. O'Brien's marvelous cinematic portrait of New York in that era is a tour-de-force, filled with the clang and clatter of the city, the camaraderie of the working girls against their callous employers, and their fierce competition over handsome young men. But a lover's betrayal sent Dilly reeling back to Ireland to raise a family on a lovely old farm named Rusheen. It is Rusheen that still holds mother and daughter together.  Yet Eleanora's visit to her mother’s sickbed does not prove to be the glad reunion that Dilly prayed for.  And in her hasty departure, Eleanora leaves behind a secret journal of their stormy relationship -- a revelation that brings the novel to a shocking close.Brimming with the lyricism and earthy insight that are the hallmarks of Edna O'Brien's acclaimed fiction, The Light of Evening is a novel of dreams and attachments, lamentations and betrayals.  At its core is the realization that the bond between mother and child is unbreakable, stronger even than death.",
        "Category": " Fiction , Family Life",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Sex Sleep Eat Drink Dream: A Day in the Life of Your Body",
        "Authors": "By Ackerman, Jennifer",
        "Description": "Did you know that you can tell time in your sleep? That women have more nightmares than men? Or that up to half of the calories you consume can be burned off simply by fidgeting? In Sex, Sleep, Eat, Drink, Dream, acclaimed science writer Jennifer Ackerman takes us on an astonishing and illuminating tour of the human body during a typical day, from waking in the morning to the reverie of sleep and dreams.   Most of us are familiar with the concept of circadian rhythms, the idea that the human body maintains its own internal clock. Recent scientific advances reveal the importance of synchronizing our actions with our biological rhythms — and show how defying them can cause us real harm. With Ackerman as our guide we learn the best time of day to take a nap, give a presentation, take medication, and even drink a cocktail, along with a host of other useful and curious facts. Entertaining and deeply practical, this book will make readers think of their bodies in an entirely new way.",
        "Category": " Science , Life Sciences , Human Anatomy & Physiology",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "The discipline of raising children",
        "Authors": "By Treadwell, Mose A",
        "Description": "",
        "Category": "",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "The Kitchen Idea Book",
        "Authors": "By Bouknight, Joanne Kellar",
        "Description": "Readers will be inspired by this series of visual ideas for some of the most-used rooms in the house. Each book is rich with beautiful color photographs, practical sidebars -- and designs of all kinds that will appeal to a wide range of tastes and budgets.The Kitchen Idea Book guides homeowners through a world of kitchen design options with clarity and wit. The book features hundreds of clever ideas, rich illustrations, and more than 400 color photos, line drawings, and floor plans.",
        "Category": " Architecture , General",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Claude Monet",
        "Authors": "By Nunhead, Nancy",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "What's Hatching Out of That Egg?",
        "Authors": "By Lauber, Patricia",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "Amazing Questions & Answers",
        "Authors": "By Pickering, James",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "LearningPlus Mathematics; An Innovative Instructional Handbook For Building Mathematics Skills",
        "Authors": "By Educational Testing Service",
        "Description": "",
        "Category": "",
        "Publisher": "6851548",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Tension Getters",
        "Authors": "By Yaconelli, Mike and Lynn, David (EDT)",
        "Description": "Strategies for dealing with problems and making decisions in a moral way.",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Hello, Cupcake!: Irresistibly Playful Creations Anyone Can Make",
        "Authors": "By Richardson, Alan and Tack, Karen",
        "Description": "Witty, one-of-a-kind imaginative cupcake designs using candies from the local convenience store. America’s favorite food photography team, responsible for the covers of America’s top magazines, shows how to create funny, scary, and sophisticated masterpieces, using a zipper lock bag and common candies and snack items. With these easy-to-follow techniques, even the most kitchen-challenged cooks can:raise a big-top circus cupcake tier for a kid’s birthdayplant candy vegetables on Oreo earth cupcakes for a garden partytrot out a line of confectionery “pupcakes” for a dog fancierserve sausage and pepperoni pizza cupcakes for April Fool’s Daybewitch trick-or-treaters with chilly ghost chocolate cupcakescreate holidays on icing with turkey cupcake place cards, a white cupcake Christmas wreath, and Easter egg cupcakes No baking skills or fancy pastry equipment is required. Spotting the familiar items in the hundreds of brilliant photos is at least half the fun.",
        "Category": " Cooking , Courses & Dishes , Cakes",
        "Publisher": "Harvest",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Gotta Keep on Tryin': A Novel",
        "Authors": "By Deberry, Virginia and Grant, Donna",
        "Description": "From the bestselling authors of Tryin' to Sleep in the Bed You Made comes a heartwarming tale of how true friendship can overcome life's obstacles.  Gayle Saunders and Patricia Reid have been lifelong friends, as close as sisters. When they were teens their dreams led them down separate paths and away from each other. But they reunited as adults, drawn back together by a bond of friendship that stood the test of time.   Now Pat and Gayle co-own the Ell & Me Company, a business they founded based on a character Gayle created years ago for her daughter. Things are going well, but real-life dramas ensue as each must face issues from the past in order to protect the future.   Pat and Marcus look like the perfect twenty-first-century couple -- smart, talented, each at the helm of a high-profile enterprise and at the top of their game. But behind closed doors their marriage is challenged by the stresses of a two-entrepreneur household. Will their professional pursuits leave them time for each other and a family, or carry them into the arms of others? Will a paternity claim prove to be too much of an obstacle to overcome?   Gayle faces her own family drama and struggles to maintain control of her life. Despite dating other men, has she ever really gotten over her ex-husband, Ramsey, the gambler who left her and their daughter, Vanessa, in financial ruin? Gayle bends over backward to provide a stable, comfortable home for Vanessa, and support her dream of becoming a dancer. And Vanessa, a rebellious and hurtful teen, seems just as devoted to making Gayle pay for every mistake she has ever made. And what ever happened to Ramsey?   In Gotta Keep on Tryin', Virginia DeBerry and Donna Grant bring us heroines who remind you, for better and worse, of women everywhere -- women who know that true friendship keeps us grounded. And when things get rough the bond between women can be stronger than any trials we face.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Great Books for High School Kids: A Teacher's Guide to Books That Can Change Teens' Lives",
        "Authors": "By Ayers, Rick (EDT) and Crawford, Amy (EDT)",
        "Description": "Teachers Rick Ayers and Amy Crawford always wanted to find a guide to the vast world of great books for teenagers-one that didn't talk down or moralize. When they couldn't find one, they set out to create it. An early prototype offered at Cody's Bookstore in Berkeley, California, was an instant success. Great Books for High School Kids is the culmination of their efforts.Collecting recommendations and essays from colleagues and advisers around the country, this is a rollicking, thoughtful, against-the-grain guide that challenges stodgy notions of what great books are and what kids are ready for.The book starts with seven essays by high school teachers about exciting, exemplary experiences they have had reading books with students in the classroom-from Dorothy Allison's Bastard Out of Carolina to Toni Morrison's Song of Solomon to Aeschylus's Oresteia trilogy.Augmented by an index of more than seventy subjects, the book also has an annotated list of hundreds of Recommended Great Books. The recommendations are playful and irreverent, ambitious and entertaining, and they go way beyond traditional reading lists. From classics to the unexpected, from literary novels to nonfiction, some drama, and even a little poetry, these are all books that teenagers have read with pleasure and can read on their own.Great Books for High School Kids is an invitation and a sourcebook for inspiring passionate, lifelong readers-a book that could seriously change the lives of teachers, of families, and of kids.",
        "Category": " Education , Secondary",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "New York Then and Now (Then & Now)",
        "Authors": "By Witheridge, Annette",
        "Description": "",
        "Category": " Photography , Subjects & Themes , Architectural & Industrial",
        "Publisher": "Thunder Bay Press",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Best American Essays 2006",
        "Authors": "By Slater, Lauren (EDT) and Atwan, Robert (EDT)",
        "Description": "\"The essays in this volume are powerful, plainspoken meditations on birthing, dying, and all the business in between,\" writes Lauren Slater in her introduction to the 2006 edition. \"They reflect the best of what we, as a singular species, have to offer, which is reflection in a context of kindness. The essays tell hard-won tales wrestled sometimes from great pain.\"The twenty powerful essays in this volume are culled from periodicals ranging from The Sun  to The New Yorker, from Crab Orchard Review  to Vanity Fair.  In \"Missing Bellow,\" Scott Turow reflects on the death of an author he never met, but one who \"overpowered me in a way no other writer had.\" Adam Gopnik confronts a different kind of death, that of his five-year-old daughter's pet fish -- a demise that churns up nothing less than \"the problem of consciousness and the plotline of Hitchock's Vertigo.\"A pet is center stage as well in Susan Orlean's witty and compassionate saga of a successful hunt for a stolen border collie. Poe Ballantine chronicles a raw-nerved pilgrimage in search of salvation, solace, and a pretty brunette, and Laurie Abraham, in \"Kinsey and Me,\" journeys after the man who dared to plumb the mysteries of human desire. Marjorie Williams gives a harrowing yet luminous account of her life with cancer, and Michele Morano muses on the grammar of the subjunctive mood while proving that \"in language, as in life, moods are complicated, but at least in language there are only two.\"",
        "Category": " Literary Collections , American , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Why I Left Jihad: The Root of Terrorism and the Return of Radical Islam",
        "Authors": "By Shoebat, Walid",
        "Description": "A fascinating and scholarly work, this book is based on ten years of research and intense study. It turns the spotlight on traditional Christian interpretation of Israel's position in the biblical prophecies through textual and historical accuracy; it shows how radical Islam fits the description of the End-Times threat.",
        "Category": " Religion , Meditations",
        "Publisher": "Top Executive Media",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Spiritual Growth of Children: Helping Your Child Develop a Personal Faith (Focus on the Family)",
        "Authors": "By Trent, John (EDT), Osborne, Rick (EDT), and Brunner, Kurt (EDT)",
        "Description": "This lead product from Focus on the Family provides parents with a resource to help their children develop a personal faith. The book provides an overview of children's spiritual capacity and understanding at different age levels. It also includes practical advice to help parents be the spiritual “trainers” of their children through engaging activities, exercises, and projects that can be completed individually or as a family.FEATURESOverview of children's spiritual capacity and understanding at different agesOffers rationale for teaching specific spiritual principles and disciplines Equips parents to train children by providing engaging activities, exercises, and projects to complete individually or as a familyGreat tool for parents and educators of children ages 0-12 Shows parents how to make a spiritual training plan",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Focus on the Family",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Frontier Family Life: A Photographic Chronicle of the Old West",
        "Authors": "By Bell, Marianne",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "6.72",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Eleanor Roosevelt: A Life of Discovery (Newbery Honor Book)",
        "Authors": "By Freedman, Russell",
        "Description": "The intriguing story of Eleanor Roosevelt traces the life of the former First Lady from her early childhood through the tumultuous years in the White House to her active role in the founding of the United Nations after World War II. A Newberry Honor Book.",
        "Category": " Young Adult Nonfiction , Biography & Autobiography , Historical",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Made in the U.S.A.",
        "Authors": "By Letts, Billie",
        "Description": "The bestselling author of WHERE THE HEART IS returns with a heartrending tale of two children in search of a place to call home.  Lutie McFee's history has taught her to avoid attachments...to people, to places, and to almost everything. With her mother long dead and her father long gone to find his fortune in Las Vegas, 15-year-old Lutie lives in the god-forsaken town of Spearfish, South Dakota with her twelve-year-old brother, Fate, and Floy Satterfield, the 300-pound ex-girlfriend of her father. While Lutie shoplifts for kicks, Fate spends most of his time reading, watching weird TV shows and worrying about global warming and the endangerment of pandas. As if their life is not dismal enough, one day, while shopping in their local Wal-Mart, Floy keels over and the two motherless kids are suddenly faced with the choice of becoming wards of the state or hightailing it out of town in Floy's old Pontiac. Choosing the latter, they head off to Las Vegas in search of a father who has no known address, no phone number and, clearly, no interest in the kids he left behind.MADE IN THE U.S.A. is the alternately heartbreaking and life-affirming story of two gutsy children who must discover how cruel, unfair and frightening the world is before they come to a place they can finally call home.",
        "Category": " Fiction , Literary",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "CNBC 24/7 Trading : Around the Clock, Around the World",
        "Authors": "By Rockefeller, Barbara",
        "Description": "\"Marshall McLuhan said, 'We have become a global village,' CNBC has helped lead the way in creating a global village for the financial markets. Readers will finish CNBC 24/7 Trading feeling smarter about the markets and really understanding how important it is to be in the information flow.\" -Mary Meeker, Managing Director, Morgan Stanley Dean Witter\"CNBC 24/7 Trading unlocks the mystery of how individual investors can invest and trade everywhere all the time. This book will become the investment bible that levels the playing field between Wall Street and Main Street.\" -Robert J. Froehlich, Vice Chairman, Kemper Funds Group Managing Director, Scudder Kemper Investments\"TD Waterhouse has operations in eight countries, so we see that growth in international investing is accelerating. To be successful investing around the globe, investors need both information and insight. CNBC 24/7 Trading covers what individual investors need to know in a thorough, easy to understand way.\" -Steve McDonald, CEO, TD WaterhouseFrom the Foreword\"CNBC 24/7 Trading . . . embraces the reality that the markets never stand still . . . this book is a guide to the emerging 24/7 marketplace, a road map to the potential rewards for investors who can grasp that marketplace's opportunities and understand its risks.\"-Sue Herera\"This definitive book on investing in the 24/7 markets provides the comprehensive tools for active investors and market pros alike. Offering information and advice on trading, obtaining research, measuring market volatility, and assessing local market risk, no smart investor should venture without it.\" -Linda R. Killian, CFA, Principal, Renaissance Capital",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "You: Being Beautiful - The Owner's Manual to Inner and Outer Beauty",
        "Authors": "By Oz, Lisa, Roizen, Michael F., M.D., Oz, Mehmet, M.D., Spiker, Ted, Hallgren, Gary (ILT), Wynett, Craig, and Perry, Arthur W.",
        "Description": "Most people think that beauty revolves around such things as lipstick, sweet eyes, or skinny jeans -- all those things that we can see (and obsess over) in the mirror. But the fact is that beauty isn't some superficial pursuit, and it's not some random act that you can thank (or curse) your ancestors for.   There are, in fact, scientific standards to beauty. Beauty is purposeful, because it's how humans have historically communicated who we are to potential mates. Beauty, in fact, is really about your health and happiness.   In this groundbreaking book, Dr. Michael F. Roizen and Dr. Mehmet C. Oz bust the myths and stereotypes about the way we view ourselves -- and how we define beauty. In these pages, you'll find out why beauty isn't as much about your vanity as it is about your humanity. The doctors take a scientific, informative, and entertaining look at the three levels of beauty and explain how they all work together to form a complete and authentic YOU. Those three levels of beauty are:    Looking Beautiful: Your appearance influences your self-esteem and has major health implications. Here, the docs will tell you how you can look the way you want.   Feeling Beautiful: So what if you have luscious lips or gorgeous locks if your joints creak and you have the energy of a rug? The docs will tell you how to improve your energy levels, beat back your life-altering aches and pains, and come to grips with some of life's toughest stresses.   Being Beautiful: By improving your relationships with your loved ones as well as with others, you'll be well on your way to finding true happiness. That's the ultimate goal: Having all three levels of beauty working together so you can have a happy and healthy life.    You'll start off by taking the ultra-revealing and validated YOU-Q Test to help you assess where you are on your own beauty scale and where you want to be. Take the test, see how well you do; then use the book to help you improve your score.   With their usual candor and honesty, Dr. Roizen and Dr. Oz break down the mechanics of beauty and explain how little adjustments in your routine can help you become a happier, healthier person. You will learn about the biology of beauty, take YOU Tests to determine where you are on the beauty scale, get tons of YOU Tips to help you improve your life, as well as learn the secrets of the Ultimate Beautiful Day.   From hair to toenails, Dr. Roizen and Dr. Oz go through every part of your body to explain how different foods, vitamins, creams, gels, and injections can really boost your looks. They scrutinize the beauty myths that bombard us every day and offer an unbiased perspective on which ones cause more harm than good. You will be able to revamp your beauty regimen (or start a new one from scratch). They'll also take a close look at chronic pain, mood swings, low energy, and financial stresses. And they'll dive into the science of building relationships, finding happiness, and using spirituality to help you define your own levels of true beauty.   Dr. Roizen and Dr. Oz act as tour guides navigating the tricky but exciting terrain of today's beauty industry. YOU: Being Beautiful is your all-inclusive ticket into the world -- the real world -- of beauty.",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "Free Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Wicked (Pretty Little Liars, Book 5)",
        "Authors": "By Shepard, Sara",
        "Description": "#1 New York Times bestselling seriesThe fifth book in the #1 New York Times bestselling series that inspired the hit ABC Family TV show Pretty Little Liars.In idyllic Rosewood, Pennsylvania, four very pretty girls just can't help but be bad. Hanna will do anything to be Rosewood's queen bee. Spencer's digging up her family's secrets. Emily can't stop thinking about her new boyfriend. And Aria approves a little too strongly of her mom's taste in men. The girls think they’re in the clear now that Ali's killer is finally behind bars. But someone new is mimicking “A’s” blackmailing ways with wicked and mysterious messages. And it’s only a matter of time before they let some secrets slip.Full of unexpected twists and shocking revelations, Wicked is the fifth book in New York Times bestselling author Sara Shepard’s compelling Pretty Little Liars series.",
        "Category": " Young Adult Fiction , Social Themes , Friendship",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Ghost Train to the Eastern Star: On the Tracks of the Great Railway Bazaar",
        "Authors": "By Theroux, Paul",
        "Description": "Thirty years after the epic journey chronicled in his classic work The Great Railway Bazaar, the world’s most acclaimed travel writer re-creates his 25,000-mile journey through eastern Europe, central Asia, the Indian subcontinent, China, Japan, and Siberia.Half a lifetime ago, Paul Theroux virtually invented the modern travel narrative by recounting his grand tour by train through Asia. In the three decades since, the world he recorded in that book has undergone phenomenal change. The Soviet Union has collapsed and China has risen; India booms while Burma smothers under dictatorship; Vietnam flourishes in the aftermath of the havoc America was unleashing on it the last time Theroux passed through. And no one is better able to capture the texture, sights, smells, and sounds of that changing landscape than Theroux.Theroux’s odyssey takes him from eastern Europe, still hung-over from communism, through tense but thriving Turkey into the Caucasus, where Georgia limps back toward feudalism while its neighbor Azerbaijan revels in oil-fueled capitalism. Theroux is firsthand witness to it all, traveling as the locals do—by stifling train, rattletrap bus, illicit taxi, and mud-caked foot—encountering adventures only he could have: from the literary (sparring with the incisive Nobel laureate Orhan Pamuk) to the dissolute (surviving a week-long bender on the Trans-Siberian Railroad). And wherever he goes, his omnivorous curiosity and unerring eye for detail never fail to inspire, enlighten, inform, and entertain.PAUL THEROUX was born in Medford, Massachusetts, in 1941 and published his first novel, Waldo, in 1967. His fiction includes The Mosquito Coast, My Secret History, My Other Life, Kowloon Tong, Blinding Light, and most recently, The Elephanta Suite. His highly acclaimed travel books include Riding the Iron Rooster, The Great Railway Bazaar, The Old Patagonian Express, Fresh Air Fiend, and Dark Star Safari. He has been the guest editor of The Best American Travel Writing and is a frequent contributor to various magazines, including The New Yorker. He lives in Hawaii and on Cape Cod.",
        "Category": " Travel , Asia , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Joining (Shefford Series, 2)",
        "Authors": "By Lindsey, Johanna",
        "Description": "The remarkable Lindsey magic is stronger than ever! The spectacular #1 bestselling author returns with a glorious tale of passion and duty set in medieval England. A betrothal has been announced that will join together Britain's two most powerful families , a union of wealth and influence to rival even the King's himself. But not only does the dangerously ambitious King John oppose this wedding, but Milisant and Wulfric : the intended bride and groom , are equally unhappy with the arrangement. Two passionate, headstrong people, they resent being thrown together for purely dynastic reasons. But fate's many twists and turns , and the unpredictable predilections of two unconquerable hearts will turn an unwanted marriage of convenience into a true and eternal joining of desire and love.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Painless Geometry (Painless Series)",
        "Authors": "By Long, Lynette and Kerr, Tom (ILT)",
        "Description": "Titles in Barron's Painless Series are textbook supplements designed especially for classroom use by middle school and high school students. The approach of each title is an appeal to students who think that the subject is boring, or too difficult, or both. The authors, all experienced educators, take a light approach, showing kids what is most interesting about each subject, and how seemingly difficult problems can be transformed into fun quizzes, brain-ticklers, and challenging puzzles with rational solutions. Geometry becomes painless—and even fun—once students learn the subject's basic components and see how solving any geometric problem is fitting parts together to solve an intriguing puzzle. They learn the meaning of postulates and theorems, discover angles of all kinds, find the relationships that exist between parallel and perpendicular lines, and discover the characteristics of shapes such as triangles, quadrilaterals, and circles. The author introduces real-world geometry experiments to make concepts less abstract, offers study strategies, and demonstrates how mini-proofs are the first step toward understanding formal geometry proofs.",
        "Category": " Mathematics , Geometry , General",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "A Reason to Live",
        "Authors": "By Powell, Donalyn",
        "Description": "Describes how to conquer suicidal thoughts, abandon unreal expectations about life, and find answers through God.",
        "Category": " Social Science , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "The Thief and the Beanstalk: A Further Tales Adventure (Further Tales Adventures)",
        "Authors": "By Catanese, P. W. and Gazsi, Ed",
        "Description": "Everyone knows the story of Jack and the beanstalk. Everyone also knows that Jack's little adventure made him a very rich man. But what they don't know is what happened a long time after Jack....  That's where Nick comes in. Orphaned and desperate, Nick joins a rugged band of thieves in hopes of a warm meal and a little protection. In exchange Nick must help them break into the lavish white castle rumored to belong to an old man named Jack. Legend says it's full of riches from Jack's quest up a magical beanstalk decades ago.  When Nick's dangerous mission leads him straight to Jack, he sees a chance to climb the famed beanstalk himself. But what Nick doesn't know is that things are different from when Jack made his climb. There are new foes at the top now. Ones with cruel weapons and foul plans -- plans that could destroy the world as Nick knows it. Will Nick come down the beanstalk a hero? Will he come down at all?",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Living Financially Free",
        "Authors": "By Paris, James L.",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Cinderella's Party Clothes: A Little Look-Look Book",
        "Authors": "By Hapka, Cathy, Mateu (ILT), and Mones (ILT)",
        "Description": "",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.59",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Bacchus and Me: Adventures in the Wine Cellar",
        "Authors": "By McInerney, Jay",
        "Description": "Jay McInerney on wine? Yes, Jay McInerney on wine!  The best-selling novelist has turned his command of language and flair for metaphor on the world of wine, providing this sublime collection of untraditional musings on wine and wine culture that is as fit for someone looking for “a nice Chardonnay” as it is for the oenophile.On champagne: “Is Dom Pérignon worth four bottles of Mo‘t & Chandon? If you are a connoisseur, a lover, a snob, or the owner of a large oceangoing craft, the answer . . . is probably yes.”On the difficulty of picking a wine for a vegetarian meal: “Like boys and girls locked away in same-sex prep schools, most wines yearn for a bit of flesh.”On telling the difference between Burgundy and Bordeaux: “If it’s red, French, costs too much, and tastes like the water that’s left in the vase after the flowers have died, it’s probably Burgundy.”On the fungus responsible for the heavenly flavor of the dessert wine called Sauternes: “Not since Baudelaire smoked opium has corruption resulted in such beauty.”Includes new material plus recommendations on the world’s most romantic wines and the best wines to pair with a meal",
        "Category": " Cooking , Beverages , Alcoholic , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Never Burn a Witch: A Rowan Gant Investigation",
        "Authors": "By Sellars, M. R.",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Willowtree Pr Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Why We Love Dogs: A Bark & Smile Book",
        "Authors": "By Levin, Kim and O'Neill, John",
        "Description": "This endearing gift book celebrates the unique connection between dogs and their human companions.There are reasons dogs are our best friends: They are loyal, affectionate, and totally committed to us. Or as photographer/writer Kim Levin puts it: \"Because they look us in the eye.\" \"Because they have wrinkles, too.\" \"Because they are family.\"In this charming book, Levin artfully combines photographs with simple, insightful prose; the result is an ode that celebrates the wonders of dogs. Soulful beagle eyes. A grinning hound luxuriating in the sun. In these poignant photos, Levin captures each dog's essence and illuminates the myriad reasons why we love dogs. In America alone, 40 million people own more than 50 million dogs. Of those dedicated dog owners, about 13 million Americans say they're as attached to their dogs as they are to their best friends; some six million people rank their dogs right up there with their children. That's why everyone who has ever cherished a beloved dog-whether large or small, pure-bred or mutt-will delight in this book filled with heartwarming words and pictures to commemorate their special closeness.",
        "Category": " Pets , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Playing with Fire (Silver Dragons, Book 1)",
        "Authors": "By MacAlister, Katie",
        "Description": "Gabriel Tauhou, the leader of the silver dragons, can’t take his eyes of May Northcott—not even when May, who has the unique talent of being able to hide in the shadows, has slipped from everyone else’s sights. May, however, has little time for Gabriel—not when she’s hiding from the Otherworld law, hunting down a blackmailer, and trying to avoid a demon lord’s demands. But her ability to withstand Gabriel’s fire marks her as his mate, and he has no intention of letting her disappear into the darkness she seems to prefer. Then May is ordered to steal one of Gabriel’s treasures—an immensely important relic of all dragonkin—and he must decide which to protect: his love or his dragons.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "What Happened to MY World: Helping Children Cope with Natural Disaster and Catastrophe",
        "Authors": "By Jim Greenman",
        "Description": "",
        "Category": "",
        "Publisher": "Comfort for Kids",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Moonshine (Cal Leandros)",
        "Authors": "By Thurman, Rob",
        "Description": "After saving the world from his fiendish father's side of the family, Cal Leandros and his stalwart half-brother Niko have settled down with new digs and a new gig-bodyguard and detective work. And in New York City, where preternatural beings stalk the streets just like normal folk, business is good. Their latest case has them going undercover for the Kin-the werewolf Mafia. A low-level Kin boss thinks a rival is setting him up for a fall, and wants proof. The place to start is the back room of Moonshine-a gambling club for non-humans. Cal thinks it's a simple in-and-out job. But Cal is very, very wrong.  Cal and Niko are being set up themselves-and the people behind it have a bite much worse than their bark...",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Cancun & The Yucatan (Eyewitness Top 10 Travel Guides)",
        "Authors": "By Rider, Nick",
        "Description": "Provides information on attractions, beaches, outdoor activities, restaurants, accommodations, shopping, and nightspots in Cancâun and the Yucatâan Peninsula.",
        "Category": " Travel , Mexico",
        "Publisher": "DK Eyewitness Travel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Untamed",
        "Authors": "By Roberts, Nora",
        "Description": "Lion trainer Jovilette Wilder finds herself falling in love with Keane Prescott, a lawyer who inherits ownership of the circus.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Alphas",
        "Authors": "By Harrison, Lisi",
        "Description": "At OCD the losers are tormented.At Alpha Academy, they're sent home.Skye Hamilton has scored an invitation to the ultra-exclusive Alphas-only boarding school where beta is spelled LBR . What happens when the country's best, brightest, and hawtest begin clawing and scratching their way to the top?",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Poppy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Boys R Us",
        "Authors": "By Harrison, Lisi",
        "Description": "Massie Block: After disbanding the Pretty Committee, Massie takes charge like Visa, forming OCD's hawtest clique yet: Massie And Crew. Even though money can't buy love, it can buy new friends . . . or at least model-actresses who will act like your besties until you get real ones. Lights, camera, MACtion! Alicia Rivera: Hearts her new role as alpha of the Soul-M8s, BOCD's first ever boy-girl clique. But when the boys head back to the newly renovated Briarwood Academy, will the remaining Soul-M8s become 4Squares? Dylan Marvil: Is happy times ten to finally have a crush who's crushing back, especially since they luh-v all the same things: marshmallows, lip-kissing, and chugging Red Bull. Buuuuuuuuurrrrrrrp! Kristen Gregory: Scored three goals on the soccer field last week-and Massie's crush . . . which earned her an ejection from her ex-BFF's heart. Can Massie forgive and forget, or is Kristen out of the game forever? Claire Lyons: Has declared herself neutral in the battle of the cliques. But dividing her time among Massie, the Soul-M8s, and Cam has left her stretched thinner than extra-small Spanx. Can she get her friends to reunite, or will she be forced to pick a side once and for all? The Clique . . . the only thing harder than getting in is staying in.",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Poppy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "The Berenstain Bears and the Summer Job (Cub Club)",
        "Authors": "By Stan Berenstain, Jan Berenstain",
        "Description": "",
        "Category": "",
        "Publisher": "Reader's Digest Kids",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "When Somebody Loves You Back",
        "Authors": "By Morrison, Mary B.",
        "Description": "With a promising NBA career on the horizon, Darius Jones, engaged to Fancy, who is now pregnant, finds his life in chaos when a potential health issue threatens to destroy everything and a shocking secret forces him to retrace his past with the help of his biological father and an ex-lover.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Roadwork! (Disney/Pixar Cars) (Step into Reading)",
        "Authors": "By Mawhinney, Art (ILT) and Lagonegro, Melissa (EDT)",
        "Description": "Lightning McQueen from Disney/Pixar Cars cleans up the town in this Step 2 Step Into Reading reader! Ready, set, GO! Lightning McQueen, the rookie hot-shot race car, is screaming his way down the track on his way to winning the Piston Cup. But when he gets stuck in a slow little town called Radiator Springs, McQueen must learn a valuable lesson about friendship-fast. This beautifully illustrated Read-Aloud Storybook is the complete retelling of Disney/Pixar Cars.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Secret of Happiness:  Jesus' Teaching on Happiness as Expressed in the Beatitudes",
        "Authors": "By Graham, Billy",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday & Co.",
        "Price Starting With ($)": "15.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "Maroo of the Winter Caves",
        "Authors": "By Turnbull, Ann",
        "Description": "This enduring survival story set at the end of the last Ice Age has been in print for over 20 years. When Maroo and her family become trapped on the Great Plain in blizzard conditions and with little food, they have only one chance of survival: for Maroo and her younger brother, Otak, to reach the winter camp and get help. The fastest trail to the camp is over the White Mountain, where there are treacherous glaciers, steep climbs, and mountain spirits. With the rest of their family depending on them, Maroo and Otak set out alone. But when Otak goes missing, Maroo is forced to make the most difficult of all decisions: to stay and search for her brother or to continue on to the camp in order to save the rest of her family. This modern classic offers readers a gripping tale of survival as well as a vivid portrait of prehistoric people.",
        "Category": " Juvenile Fiction , Historical , Prehistory",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Living for Others When You'd Rather Live for Yourself (Biblical renewal series)",
        "Authors": "By Getz, Gene",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Gospel Light Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "1, 2, 3 John: How Should a Christian Live? (Fisherman Bible Studyguide Series)",
        "Authors": "By Brestin, Dee",
        "Description": "Walk in the LightCenturies ago, the apostle John wrote to new believers to instruct them in how to live godly lives. Today, John's words still hold truth and power as we struggle and triumph in our desire to \"walk in the light\" with God and others. 1,2,3 John: How Should a Christian Live? invites us to grow in maturity as God's children while we learn more about what it means to live a radically transformed life.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Shaw Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    }
]