[
    {
        "Title": "Golf is Not a Game of Perfect",
        "Authors": "By Rotella, Robert J. and Cullen, Robert",
        "Description": "Filled with insightful stories about golf, Dr. Bob Rotella’s delightful book will improve the game of even the most casual weekend player.Dr. Bob Rotella is one of the hottest performance consultants in America today. Among his many professional clients are Nick Price (last year's Player of the Year), Tom Kite, Davis Love III, Pat Bradley, Brad Faxon, John Daly, and many others. Rotella, or “Doc,” as most players refer to him, goes beyond just the usual mental aspects of the game and the reliance on specific techniques. What Rotella does here in this extraordinary book, and with his clients, is to create an attitude and a mindset about all aspects of a golfer's game, from mental preparation to competition. The most wonderful aspect of it all is that it is done in a conversational fashion, in a dynamic blend of anecdote and lesson. And, as some of the world's greatest golfers will attest, the results are spectacular. Golfers will improve their golf game and have more fun playing. Some of Rotella's maxims include: -On the first tee, a golfer must expect only two things of himself: to have fun, and to focus his mind properly on every shot. -Golfers must learn to love 'the challenge when they hit a ball into the rough, trees, or sand. The alternatives—anger, fear, whining, and cheating—do no good. -Confidence is crucial to good golf. Confidence is simply the aggregate of the thoughts you have about yourself. -It is more important to be decisive than to be correct when preparing to play any golf shot or putt. Filled with delightful and insightful stories about golf and the golfers Rotella works with, Golf Is Not a Game of Perfect will improve the game of even the most casual weekend player.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "God Has Ninety-Nine Names: A Reporter's Journey Through a Militant Middle East",
        "Authors": "By Miller, Judith",
        "Description": "Judith Miller has spent much of her life in the Middle East covering the region from Jerusalem and Tel Aviv to Teheran, from Amman to Algiers and Khartoum.Miller takes us deep within the militant Islamic movements in ten Middle Eastern countries: Egypt, Saudi Arabia, Sudan, Algeria, Libya, Lebanon, Syria, Jordan, Israel, and Iran. She shows that as there is no unified Arab world, so there is no unified Islam, for even in the Koran, God has ninety-nine names.The militant Islamic movements that Miller describes are as different as the countries in which they have arisen. Seeking to replace secular government with holy writ, some of these radical groups propose nonviolent change, while others take to their guns, but the tendency for all these movements is to shift opportunistically between persuasion and violence as the regimes they oppose weaken under crushing demographic and developmental burdens.Relying on her personal relationships with leaders as diverse as Libya's vain and mercurial Qaddafi, Jordan's contemplative yet fearless King Hussein, and Israel's late Yitzhak Rabin, Miller introduces her readers to the region's ruling powers. She shows that their methods of combating militant Islam are as diverse as the Islamic movements themselves, ranging from the murderous state terror of Syria's Hafiz Assad to the policy of cooptation practiced by Saudi Arabia's autocratic king.Miller offers abundant evidence to convince advocates of human rights to mistrust the intentions of these movements as she documents the threat many of them pose to women, intellectuals, Christians, and other minorities in the Middle East. But she also shows how the failure of most Middle Eastern governments to combat, much less solve, the problems of underdevelopment has permitted these militant groups to flourish and in some cases, perhaps, eventually to prevail.",
        "Category": " Political Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Science Matters",
        "Authors": "By Hazen, Robert M.",
        "Description": "Explains the basic scientific principles that govern our world, and shows how they manifest themselves in our everyday lives",
        "Category": " Science , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Killing Time: A Novel",
        "Authors": "By Howard, Linda",
        "Description": "In 1985, with much fanfare, a time capsule was buried under the front lawn of a small-town county courthouse, to be reopened in 2085. But just twenty years later, in the dead of night, the capsule is dug up, its contents stolen. That same night, one of the contributors to the capsule is brutally slain in his home - with no sign of forced entry or indication of a struggle. One by one, others who had placed items in the time capsule are murdered.Besides his suspicions about the sudden, mysterious appearance of Nikita Stover, the chief investigator, Knox Davis, has absolutely no leads. And while Nikita's no murderer, she seems to be hiding plenty of secrets. With more at stake than anyone else realizes, the smart-talking Nikita is determined to catch this cunning killer - while at the same time battling her own deepening feelings for a man and for a world in which she doesn't belong.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Tyrannosaur Canyon",
        "Authors": "By Preston, Douglas J.",
        "Description": "A moon rock missing for thirty years...Five buckets of blood-soaked sand found in a New Mexico canyon...A scientist with ambition enough to kill...A monk who will redeem the world...A dark agency with a deadly mission...The greatest scientific discovery of all time...What fire bolt from the galactic dark shattered the Earth eons ago, and now hides in that remote cleft in the southwest U.S. known as . . . Tyrannosaur Canyon? The stunning new masterwork from the acclaimed best-selling author, recently hailed by Publishers Weekly as \"better than Crichton.\"",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "The Cat I.Q. Test",
        "Authors": "By Miller, Melissa",
        "Description": "Is your beloved feline cunningly clever or blissfully ignorant? Melissa Miller, author of the bestselling Dog I.Q. Test, has designed an I.Q. test that lets you grade your pet against the domestic cat population. Find out how your cat rates on everything from compatibility, intelligence, and sensitivity to charm, curiosity, and imagination.And how do you measure up as an owner? Find out with a test that assesses your knowledge of your responsibilities, and your attitude toward your cat. Filled with humorous anecdotes, unforgettable stories, and fascinating facts, this book is a must for every cat owner - and it just may offer new insights into the perfect owner-cat relationship.",
        "Category": " Pets , Cats , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Sea Change (Jesse Stone Novels)",
        "Authors": "By Parker, Robert B.",
        "Description": "Paradise, Massachusetts, police chief Jesse Stone faces the case of his career in the newest novel in the bestselling series.  When a woman's partially decomposed body washes ashore in Paradise, Massachusetts, police chief Jesse Stone is forced into a case far more difficult than it initially appears. Identifying the woman is just the first step in what proves to be an emotionally charged investigation. Florence Horvath was an attractive, recently divorced heiress from Florida; she also had a penchant for steamy sex and was an enthusiastic participant in a video depicting the same. Somehow the combination of her past and present got her killed, but no one is talking-not the crew of the Lady Jane, the Fort Lauderdale yacht moored in Paradise Harbor; not her very blond, very tan twin sisters, Corliss and Claudia; and not her curiously affectless parents, living out a sterile retirement in a Miami high rise. But someone-Jesse-has to speak for the dead, even if it puts him in harm's way.",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "On Power and Ideology: The Managua Lectures",
        "Authors": "By Chomsky, Noam",
        "Description": "One of Chomsky's most accessible books, this succinct series of lectures lays out the parameters of his foreign policy analysis.",
        "Category": " Political Science , Political Ideologies , General",
        "Publisher": "South End Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Giving The Love That Heals",
        "Authors": "By Hendrix, Harville and Hunt, Helen",
        "Description": "Harville Hendrix has illuminated the paths to healthy, loving relationships in his New York Times bestsellers Getting the Love You Want and Keeping the Love You Find. Now, with his coauthor and wife, Helen Hunt, he brings us to a new understanding of the most profound love of all -- by helping parents nurture their own development as they encourage emotional wholeness in their children.This groundbreaking book offers a unique opportunity for personal transformation: by resolving issues that originated in our own childhood, we can achieve a conscious, and thus healthier, relationship with our children, regardless of their age. Harville Hendrix and Helen Hunt help us explore: -The Imago -- the fantasy partner that our unconscious mind constructs from those we loved as a child, a that has guided our search for a life partner -Maximizer and Minimizer parents -- the defensive styles that internally shape what we say and how interact with our children -A Parenting Process that helps to end the \"cycle of wounding\" -- the handing-down of wounding we received as children -- as we raise our own children -Safety, Support, and Structure -- how to give children what they really need from us -Modeling Adulthood -- using our healed sense of self as a model for our children. With other practical, insightful approaches that can powerfully shape the parent-child bond, Giving the Love that Heals gives us the keys to helping our children to become healthy, responsible, and caring people.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Cry, the Beloved Country (Cliffs Notes)",
        "Authors": "By Peterson, Richard O. and Fitzwater, Eva",
        "Description": "The original CliffsNotes study guides offer a look into critical elements and ideas within classic works of literature.CliffsNotes on Cry, the Beloved Country takes you into a compassionately told story set in the troubled and changing South Africa in the 1940s.Focusing on a people who are caught between two worlds — the old with its rituals and and respect and the new with its lack of values and order — this study guide explores a novel of social protest through character analyses and critical essays. Other features that help you figure out this important work includeProfile of the author Alan Paton's life and workHistorical background of the troubled and changing South Africa of the 1940sCharacter web and in-depth analyses of the major rolesSummaries and commentaries for each chapter within the bookReview questions and suggestions for theme topicsClassic literature or modern-day treasure — you'll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1970"
        }
    },
    {
        "Title": "Man and Boy",
        "Authors": "By Parsons, Tony",
        "Description": "A fabulously engaging and exciting novel about a man who has to learn about life and love the hard way.",
        "Category": " Fiction , General",
        "Publisher": "Harper-Collins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "The Lunch-Box Chronicles: Notes from the Parenting Underground",
        "Authors": "By Winik, Marion",
        "Description": "Child Magazine Best Book of the Year\"For me, parenting is like dieting. Every day, I wake up filled with resolve and good intentions, perfection in view, and every day I somehow stray from the path. The difference is with dieting, I usually make it to lunch. . . .\"With the candor and often hilarious outlook that have made her a beloved commentator on NPR, Marion Winik takes the reader on an unforgettable journey through modern parenthood, with all of its attendant anxieties and joys.A single mother with two small boys, Winik knows exactly what she's talking about, from battles over breakfast and bedtime to the virtues of pre-packaged food and weightier issues like sex education and sibling rivalry. Part memoir and part survival guide,The Lunch-Box Chronicles is an engaging philosophy of parenting from a staunch realist, who knows that kids and their parents both will inevitably fall far short of perfection, and that a \"good enough mom\" really is, in fact, good enough.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "To Kill The Pope: An Ecclesiastical Thriller (Lisa Drew Books)",
        "Authors": "By Szulc, Tad",
        "Description": "From the author of Pope John Paul II: A Biography comes a chillingly authentic conspiracy thriller based on actual, never-before-revealed facts surrounding the assassination attempt against Pope John Paul II.  \"One moment, the white-clad figure, holding on to the iron bar at the back seat of the white Jeep with the left hand, was blessing the faithful in a slow, circular motion of the right hand as the vehicle advanced gently through the human mass filling St. Peter's Square in the Vatican under the azure-blue sky of the May afternoon. The next moment, the figure in white was slumped, seemingly lifeless, in a pool of crimson blood sloshing in the rear of the Jeep...\"  In May 1981, in the middle of the slow tour among pilgrims on St. Peter's Square, Gregory XVII, the beloved but often controversial French pope, is shot at close range. The would-be assassin is quickly caught and identifies himself as Agca Circlic, a Turk belonging to a terrorist group. But the recovering Gregory XVII -- who has both deep faith and a philosophical turn of mind -- is not satisfied with Circlic's arrest and sets out to discover who really wants him dead. He arranges to recruit Tim Savage, an American Jesuit and former CIA case officer, who soon discovers that the plot to kill the Pope originated not in the Middle East but very close to home.  To Kill the Pope is a fictional treatment of the real-life assassination attempt on Pope John Paul II. In the course of researching his acclaimed biography of the Pope, Tad Szulc uncovered the truth about the conspiracy. The fictional format was chosen because, out of deference to his top-level sources, he could not reveal real names or disclose specific details. This information -- including actual CIA testimony before United States Senate committees, the Agency's internal reports, French Secret Service involvements, and findings by Italian courts and Interpol -- forms the basis for a shocking thriller that sheds new light on a key event in recent history.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The Facts about Fats: A Consumer's Guide to Good Oils",
        "Authors": "By Finnegan, John",
        "Description": "Explains the body's need for fatty acids, recommends the most healthful oils, and discusses weight management",
        "Category": " Medical , Physiology",
        "Publisher": "Celestial Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Life Is Goodbye Life Is Hello",
        "Authors": "By Bozarth, Alla Renee",
        "Description": "",
        "Category": "",
        "Publisher": "Hazelden Publishing & Educational Services",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "Judaism: The Key Spiritual Writings of the Jewish Tradition",
        "Authors": "By Hertzberg, Arthur (EDT)",
        "Description": "The first edition of this book, published in 1961, was a classic overview of the Jewish religion. Arthur Hertzberg combined a superbly chosen anthology of the great writings of the Jewish tradition with incisive commentary and explanation. In 1991, Rabbi Hertzberg produced the first revised edition of this famous book, in which he addressed such contemporary issues as the rights of women, medical ethics, the Holocaust, Arabs and Jews, and homosexuality. These new discussions were incorporated into the earlier writings on the key ideas of Judaism: the chosen people, the Law, God, the Holy Land, the cycle of the year, prayer, immortality, sin and atonement, the nature of man, and the purpose of creation.In his interpretations of the contemporary controversies, Arthur Hertzberg provided moving testimony to the integrity of the Jewish spirit through the ages. Many of the discussions of the first edition were rewritten to take into account the various forms of Judaism in the last two centuries, whether Orthodox, Conservative, or Reform. This revised edition, an integrated whole, provides a readable, contemporary, and authoritative overview of the nature of the Jewish religion.\"The demands of justice and the fear of sin,\" wrote Rabbi Hertzberg, \"have been debated in the last three decades by men and women who care passionately about the issues of our time.\" This book is the result of a lifetime of study and reflection by one of the most distinguished authorities on Judaism.",
        "Category": " Religion , Judaism , General",
        "Publisher": "Touchstone Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "The Art of Getting Your Own Sweet Way",
        "Authors": "By Crosby, Philip B.",
        "Description": "A successful executive explains the techniques and strategies he uses to analyze and manage day-to-day problems",
        "Category": " Business & Economics , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "Toons for Our Times: A Bloom County Book of Heavy Metal Rump 'N Roll",
        "Authors": "By Breathed, Berke",
        "Description": "Cartoons deal with computer hackers, personal ads, political campaigns, rock musicians, and toxic waste",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "9.68",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Jumping the Curve: Innovation and Strategic Choice in an Age of Transition",
        "Authors": "By Imparato, Nicholas and Harari, Oren",
        "Description": "Foreword by Tom PetersInternationally known management consultants Nicholas Imparato and Oren Harari connect the big picture of our changing civilizations with the specific practical actions that managers have to take to produce results today. All organizations are faced with the same challenge: the need to jump the curve to make significant, discontinuous leaps in their thinking, whether about product, technology, or management style. The alternative to follow current practices all the way to their inevitable decline is unacceptable. The authors show us that it is also unnecessary.Drawing on numerous personal interviews with innovative leaders around the world, as well as research and first-hand observation, Imparato and Harari identify the four strategic imperatives--innovation, intelligence, coherence, and responsibility--that will enable companies to successfully jump the curve and thrive in the emerging epoch. And they show how cutting-edge companies and leaders are translating these imperatives into action.Not since the dawn of the Modern Age some five hundred years ago has civilization undergone the kind of profound, rapid-fire changes we're experiencing today. Even organizations that are adapting, growing and innovating have the gnawing sense that obsolescence is right around the corner. Jumping the Curve offers perspective and guidance for doing business at this unique moment in time. It connects the big picture of our changing world with the practical actions managers must take now to position their organizations for success in a new epoch we can't yet fully see or understand.",
        "Category": " Business & Economics , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Retire Worry-Free: Third Edition",
        "Authors": "By Kiplinger's Personal Finance Magazine",
        "Description": "Experts from a leading personal finance periodical lead readers of all ages through retirement planning, from determining a financial goal to developing an investment strategy and maximizing benefits from company savings plans. Original. IP.",
        "Category": " Business & Economics , Personal Finance , Budgeting",
        "Publisher": "Kiplinger Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Probe (Star Trek)",
        "Authors": "By Bonanno, Margaret Wander",
        "Description": "The dramatic reappearance of the mysterious probe that had once nearly destroyed Earth leads Captain Kirk, Mr. Spock, and the crew of the Enterprise on a perilous journey into the far reaches of the galaxy. 50,000 first printing.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Conceptual Selling",
        "Authors": "By Miller, Robert B.",
        "Description": "Outlines new techniques to change the structure of face-to-face selling and use a systematic process to produce significant and reliable sales increases",
        "Category": " Business & Economics , Sales & Selling",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Gail Brown's All-New Instant Interiors: Decorate With Fabric, Fast",
        "Authors": "By Brown, Gail",
        "Description": "Includes step-by-step instructions for table toppers, napkins, curtains, comforters, pillows and pillow covers, lampshades, and other decorative accessories, some of which can be constructed without sewing",
        "Category": " Art , General",
        "Publisher": "Open Chain Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The 30-Minute Decorator (The Home Magic Decorating Series)",
        "Authors": "By Eaglemoss (EDT)",
        "Description": "Includes quick ideas for creating cushions, swags, bed drapes, and flower arrangements; displaying objects; and decorating lamps",
        "Category": " House & Home , Decorating & Furnishings",
        "Publisher": "Betterway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Is There No Place on Earth for Me?",
        "Authors": "By Sheehan, Susan",
        "Description": "\" A brilliantly documented chronicle of young woman's long struggle with schizophrenia.\"-- Willard Gaylin, The New Republic\"Sylvia Frumkin,\" highly intelligent young girl, became a schizophrenic in her late teens and spent most of the next seventeen years in anti out of mental institutions. Susan Sheehan, a talented reporter followed \"Sylvia\" for almost a year talking with and observing her listening to her monologues, sitting in on consultations with doctors, even for a period sleeping in the bed next to her in a mental hospital.\"Susan Sheehan has committed an extraordinary act of journalism....She brings relentless intelligent attention to bear on a particular case, a journalistic practice that almost always results in new and disturbing insights into those mindless generalities and prejudice and certitudes we tend to carry around with us.\" -- Meg Greenfield, front page Washington Post Book World\"Sheehan is tenacious, observant and unsentimental. The history of a single patient leads us into a maze of understaffed institutions, bureaucratic fumbling, trial-and-error treatment and familial incomprehension. Though Sheehan keeps herself invisible, her sympathy is palpable.\"-- Walter Clemons, NewsweekBy the author of Lift for Me Ain't Been No Crystal Stair",
        "Category": " Psychology , Psychopathology , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1983"
        }
    },
    {
        "Title": "Downtown Doonesbury (Doonesbury Book)",
        "Authors": "By Trudeau, G. B.",
        "Description": "Zonker buys 153 pounds of his favorite vegetable and begins a serious romance in England, Roland Hedley exposes a true Gramm-Rudman horror story, and Mike and J.J. are in deep shock",
        "Category": "",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Jerusalem the Golden",
        "Authors": "By Margaret Drabble",
        "Description": "",
        "Category": "",
        "Publisher": "Popular Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Travels With Alice",
        "Authors": "By Trillin, Calvin",
        "Description": "",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Ticknor & Fields",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "RUSSIAN JOURNAL V127",
        "Authors": "By Lee, Andrea",
        "Description": "“A subtly crafted reflection of both the bleak and golden shadings of Russian life . . . Its tones belong more to the realm of poetry than journalism.” –The New York Times Book ReviewAt age twenty-five, Andrea Lee joined her husband, a Harvard doctoral candidate in Russian history, for his eight months’ study at Moscow State University and an additional two months in Leningrad. Published to enormous critical acclaim in 1981, Russian Journal is the award-winning author’s penetrating, vivid account of her everyday life as an expatriate in Soviet culture, chronicling her fascinating exchanges with journalists, diplomats, and her Soviet contemporaries. The winner of the Jean Stein Award from the National Academy of Arts and Letters–and the book that launched Lee’s career as a writer–Russian Journal is a beautiful and clear-eyed travel-writing classic.“[Lee] takes us wherever she is, conveying a feeling of place and atmosphere that is the mark of real talent.”–The Washington Post Book World“A book of very great charm . . . [Lee] records what she saw and heard with unassuming delicacy and exactness.”–NewsweekFrom the Trade Paperback edition.",
        "Category": " Travel , Russia",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "Blue Smoke and No Mirrors (The Destroyer, No. 78)",
        "Authors": "By Murphy, Warren and Sapir, Richard",
        "Description": "Remo must tear himself away from a luscious beauty and Chiun from a fascination with the supernatural in order to track the robber of radioactive secrets who manages to make entrance into a top-secret nuclear missile facility a piece of cake",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "The Foursome: A Novel",
        "Authors": "By McAllister, Troon",
        "Description": "Golf fiction’s finest hustler—The Green's Eddie Caminetti—returns in a laugh-out-loud novel featuring a foursome of upwardly mobile golf fanatics who get their just rewards.Tired of hustling for something as ordinary as money, Eddie Caminetti sets his sights slightly higher than other men's pockets:  he goes after their souls.  He now presides over Swithen Bairn, an exquisite secret golf course that’s a kind of twisted Fantasy Island where the arrogant and pompous find their cherished dreams suddenly transformed into their worst nightmares.  When four enviably successful business/golf junkies are lured to Swithen Bairn by an irresistible offer— \"the most memorable golf vacation you ever had or you don't pay\" —the old adage that you can learn more about people during one round of golf than you can by living next door to them for six months comes hilariously and powerfully true.Mixing equal parts of suspense, hilarity, and raw human drama, Troon McAllister deftly shows readers what can happen when money, friendship, ambition, and greed converge explosively in a single round of golf.",
        "Category": " Fiction , Sports",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Conversations With God : An Uncommon Dialogue (Book 2)",
        "Authors": "By Walsch, Neale Donald",
        "Description": "...this paradigm shift will take great wisdom, great courage, and massive determination. For fear will strike at the heart of these concepts, and call them false. Fear will eat at the core of these magnificent truths, and render them hollow....Yet you will not have, cannot produce, the society of which you have always dreamed unless and until you see with wisdom and clarity the ultimate truth: that what you do to others, you do to yourself; what you fail to do for others, you fail to do for yourself; that the pain of others is your pain, and the joy of others your joy, that when you disclaim any part of it, you disclaim a part of yourself.Now is the time to reclaim yourself. Now is the time to see yourself again as Who You Really Are, and thus, render yourself visible again. For when you, and your true relationship with God become visible, then We are indivisible.And nothing will ever divide Us again.",
        "Category": " Body, Mind & Spirit , Parapsychology , General",
        "Publisher": "Hampton Roads Pub Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Purple Cane Road: A Novel (Dave Robicheaux Mysteries)",
        "Authors": "By Burke, James Lee",
        "Description": "Dave Robicheaux has spent his life confronting the age-old adage that the sins of the father pass on to the son. But what was his mother's legacy? Dead to him since his youth, Mae Guillory has been shuttered away in the deep recesses of Robicheaux's mind. He's lived with the fact that he would never really know what happened to the woman who left him to the devices of a whiskey-driven father. But deep down, Dave still feels the loss of his mother and knows that the infinite series of disappointments in her life could not have come to a good end.While helping out an old friend, Dave is stunned when a pimp looks at him sideways and asks if he is the son of Mae Guillory, the whore a bunch of cops murdered thirty years ago. Her body was dumped in the bayou bordering Purple Cane Road, and the cops who left her there are still on the job.Dave's search for his mother's killers leads him to the darker places in his past, and solving this case teaches him what it means to be his mother's son.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Strokes of Genius (Penguin Sports Library)",
        "Authors": "By Boswell, Thomas",
        "Description": "Essays discuss golf courses and tournaments, top players, the life of the professional golfer, and the Senior Tour",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Children of God: A Novel (The Sparrow Series)",
        "Authors": "By Russell, Mary Doria",
        "Description": "In Children of God, Mary Doria Russell further establishes herself as one of the most innovative, entertaining and philosophically provocative novelists writing today.The only member of the original mission to the planet Rakhat to return to Earth, Father Emilio Sandoz has barely begun to recover from his ordeal when the So-ciety of Jesus calls upon him for help in preparing for another mission to Alpha Centauri. Despite his objections and fear, he cannot escape his past or the future.Old friends, new discoveries and difficult questions await Emilio as he struggles for inner peace and understanding in a moral universe whose boundaries now extend beyond the solar system and whose future lies with children born in a faraway place.Strikingly original, richly plotted, replete with memorable characters and filled with humanity and humor, Children of God is an unforgettable and uplifting novel that is a potent successor to The Sparrow and a startlingly imaginative adventure for newcomers to Mary Doria Russell’s special literary magic.",
        "Category": " Fiction , Religious",
        "Publisher": "Fawcett Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Buying and Selling a Home (Buying & Selling a Home)",
        "Authors": "By Kiplinger",
        "Description": "",
        "Category": " Business & Economics , Sales & Selling , General",
        "Publisher": "Kiplinger Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Loving Relationships",
        "Authors": "By Ray, Sondra",
        "Description": "Argues that human relations can be improved by changing one's thoughts, reexperiencing one's birth to heal its trauma, and learning to master one's body, achieving physical immortality",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "Celestial Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Little People Big Book About Ourselves",
        "Authors": "By Fisher-Price",
        "Description": "A collection of original stories, classic fairy tales, non-fiction pieces, poems, activities, and games.",
        "Category": "",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "The Blue Edge of Midnight",
        "Authors": "By King, Jonathon",
        "Description": "Featuring ex-cop Max Freeman, The Blue Edge of Midnight marks the debut of a powerful new crime series.  \"The Blue Edge of Midnight is a terrific book that begins the run of a great new talent in Jonathon King. From start to finish it is full of true character and jagged surprises. King adds new dimensions of depth and substance to the modern crime novel.\" (Michael Connelly)  Max Freeman's old life ended on a night that will haunt him forever. The night he killed a twelve-year-old child in self-defense in a Philadelphia shootout. The night he stopped being a cop. Now he lives an existence of solitary confinement on the edge of the Florida Everglades, where he answers to no one but the demons that eat away at his conscience.  Until the night he finds the corpse of a child beside an ancient river. The night Max Freeman's past explodes into the present.  Suddenly, Freeman is thrust into the center of the search for a killer responsible for a string of grisly slayings that is baffling both local authorities and the F.B.I.  Distrusted as an outsider by the longtime residents of the Glades and pulled into the case as suspect by the police, Freeman must walk a tenuous tightrope of distrust on both sides of the law. When another child goes missing, all eyes turn to Freeman-and the ex-cop, driven by his old habits and the memories of that long-ago Philadelphia midnight, knows that he has no choice but to hunt down the seemingly unstoppable murderer himself.  An electrifying story of crime, punishment, and one man's personal redemption played out against a backdrop of wild natural beauty in conflict with the modern urban world, The Blue Edge of Midnight heralds the arrival of a stunning new voice in contemporary crime fiction.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Sowing the Dragon's Teeth: Land Mines and the Global Legacy of War",
        "Authors": "By Winslow, Philip C.",
        "Description": "A foreign correspondent surveys the enormous human damage done by the millions of anti-personnel land mines in scores of countries around the world, detailing the lives of the victims and assessing the ways the mines might be removed.",
        "Category": " History , World",
        "Publisher": "Beacon Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Luck of O'Reilly: A Biography of Tony O'Reilly",
        "Authors": "By Fallon, Ivan",
        "Description": "Henry Kissinger calls him \"Renaissance Man.\" For fifteen years Tony O'Reilly has been one of the most successful executives in America, the highest paid man in the country in 1992 with $75 million. When he took over as CEO of the century-old H.J. Heinz Company in 1979, the company's value was less than $800 million. Today it is over $9 billion, with fewer shares in issue - and over 90 percent of the increase created during the O'Reilly years, the reign of the first non-Heinz to become chairman. It was a stock market miracle, but for those who knew Tony O'Reilly, the turnaround did not come as a surprise.",
        "Category": " Business & Economics , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "The Personality Puzzle",
        "Authors": "By Funder, David C.",
        "Description": "Organized according to the six main domains of modern personality psychology, David Funder’s market-leading text shows students the field as it exists in the present. By incorporating significant coverage of the great theorists of personality psychology throughout, the book helps students understand how the field developed. And by showcasing the questions driving the research of today, The Personality Puzzle enables students to see the exciting future of the discipline.For the Fifth Edition, every chapter has been updated. A new illustration program supports visual learners with updated versions of the book’s much-loved cartoons and new in-text features to help students visualize and remember concepts. The text covers classic theories of personality as well as all the latest findings, including up-to-date coverage of the biological domain, new material on cross-cultural psychology, and expanded treatment of positive psychology.As always, The Personality Puzzle is a book that students will read, enjoy, and remember, with a writing style that is engaging, distinctive, and humorous.",
        "Category": " Psychology , Personality",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Chemistry Made Simple",
        "Authors": "By Hess, Fred C. and Thomas, Arthur Louis",
        "Description": "For almost four decades, Made Simple books have set the standard for continuing education and home study. In answer to the changing needsof today's marketplace, the Made Simple series for the '90s presents a thoroughly up-to-the-minute portfolio of skills, information, and experience, with revised and updated editions of bestselling titles, plus a whole range of new subjects from personal finance to office management to desktop publishing.B & W illustrations throughout",
        "Category": " Science , Chemistry , General",
        "Publisher": "Main Street Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "The Big Time: Harvard Business School's Most Successful Class--And How It Shaped America",
        "Authors": "By Shames, Laurence",
        "Description": "Chronicles and celebrates the unusual success story of Harvard Business School's class of 1949, which includes more corporate presidents, policymakers, CEO's, and millionaires than any other comparable group",
        "Category": " History , United States , 20th Century",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "The Nixon watch",
        "Authors": "By Osborne, John",
        "Description": "",
        "Category": "",
        "Publisher": "Liveright",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Just Do It: The Nike Spirit in the Corporate World",
        "Authors": "By Katz, Donald R.",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Adams Media Corp",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The Barker Street Regulars",
        "Authors": "By Conant, Susan",
        "Description": "An avid devotion to the words of Sir Arthur Conan Doyle, and an equally avid devotion to dogs, combine to draw Holly Winter and her two beloved malamutes, Rowdy and Kimi, into one of Conant's most original and entertaining mysteries to date.Rowdy has finished his training as a therapy dog and now accompanies Holly on weekly visits to the Gateway Nursing Home, where they meet Althea Battlefield, still formidable at the age of ninety, and her two elderly, admiring cohorts, Hugh and Robert - all fanatic devotees of the Master (as they call Sherlock Holmes). When Althea's grandnephew is murdered at the home of her younger sister, Ceci, everyone is horrified, but it's the plight of Ceci herself - who is being victimized by an unscrupulous animal psychic - that finally unites this unlikely group in a crime-stopping spree that requires not only the finely tuned ratiocination of the Holmes admirers but the eager cooperation of an outraged Holly and the very particular talents of her willing canine accomplices.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "The Cold Moon: A Lincoln Rhyme Novel",
        "Authors": "By Deaver, Jeffery",
        "Description": "On a freezing December night, with a full moon hovering in the black sky over New York City, two people are brutally murdered -- the death scenes marked by eerie, matching calling cards: moon-faced clocks inves-tigators fear ticked away the victims' last moments on earth. Renowned criminologist Lincoln Rhyme immediately identifies the clock distributor and has the chilling realization that the killer -- who has dubbed himself the Watchmaker -- has more murders planned in the hours to come.   Rhyme, a quadriplegic long confined to his wheelchair, immediately taps his trusted partner and longtime love, Amelia Sachs, to walk the grid and be his eyes and ears on the street. But Sachs has other commitments now -- namely, her first assignment as lead detective on a homicide of her own. As she struggles to balance her pursuit of the infuriatingly elusive Watchmaker with her own case, Sachs unearths shocking revelations about the police force that threaten to undermine her career, her sense of self and her relationship with Rhyme. As the Rhyme-Sachs team shows evi-dence of fissures, the Watchmaker is methodically stalking his victims and planning a diabolical criminal masterwork.... Indeed, the Watchmaker may be the most cunning and mesmerizing villain Rhyme and Sachs have ever encountered.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Amber Beach",
        "Authors": "By Lowell, Elizabeth",
        "Description": "Honor Donovan is a shrewd businesswoman, yet she has been shut out of Donovan International by her father and four brothers. When her favorite brother Kyle vanishes, along with a fortune in stolen amber, Honor's questions are ignored by the Donovan males. Defying them, she heads to the San Juan Islands of the Pacific Northwest in search of answers.Honor needs a guide because she knows nothing about running a boat--and she knows nothing about Jake Mallory until he answers her ad. One of the things she doesn't know is that Jake is much more than a fishing guide. Until Kyle disappeared, Jake was brokering amber deals in the Baltic for Donovan International. Honor is completely unaware of the old wars, new politics, greed, and stolen amber that have lured ruthless, high-stakes players from around the globe.Jake wants no part of the intrigue, or of a Donovan woman in his life, but he suspects the Donovans have set him up to take the fall for Kyle's treachery. The way Jake sees it, some Donovan is going to pay for his troubles, and it just may turn out to be HonorJake and Honor cast off on a journeys moldering with distrust, betrayal, vengeance... and temptation. A hunger grows between them that is as dangerous as the secrets they keep. Alone at sea, they pursue the stubborn mystery of the Amber Room, flee from relentless enemies, and fight against trusting each other. Yet when Honor and Jake dare to confide in one another, they face a final truth: the penalty for betrayal is death; the reward is a lifetime...together.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Broken Covenant: American Foreign Policy and the Crisis Between the U.S. and Israel",
        "Authors": "By Arens, Moshe",
        "Description": "In this no-holds-barred account, Moshe Arens, Israel's former Foreign Minister and Defense Minister, lays bare the harsh realities of U.S.-Israeli relations during the tumultuous period of the Palestinian uprising known as the Intifada and the climactic Persian Gulf War. During those years, diplomatic relations between Jerusalem and Washington plummeted, as President George Bush's administration, in pursuit of U.S. interests in the Middle East, interfered in Israeli domestic politics, refused Israel vital military intelligence during the Gulf War, and attempted to bring down Israel's democratically elected government.",
        "Category": " Political Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "The Coming Economic Earthquake",
        "Authors": "By Burkett, Larry",
        "Description": "Views the American economy, the national debt, and the future from a Christian perspective",
        "Category": " Business & Economics , General",
        "Publisher": "Moody Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The SEA HUNTERS: True Adventures with Famous Shipwrecks",
        "Authors": "By Cussler, Clive and Dirgo, Craig",
        "Description": "Clive Cussler is acclaimed worldwide as the Grandmaster of Adventure, and his series of novels starring his action hero Dirk Pitt now have over 70,000,000 copies in print.  Whether it's deep-sea diving, climbing mountains,  or driving classic automobiles, adventure is at the heart of Cussler's life. As Cussler himself writes, \"Providing my readers adventure tales based around a devil-may-care character by the name of Dirk Pitt is only one chapter of my existence. I'm addicted to the challenge of the search, whether it's for lost ship- wrecks, airplanes, steam locomotives, or people.\"  In The Sea Hunters, his first nonfiction book, Cussler explores the special world of undersea adventure  that inspired and has its fictional parallel in the Dirk Pitt novels. He describes his lifelong love for the sea and ships, and how his involvement with the search for John Paul Jones's famous Revolutionary War ship, the Bonhomme Richard, led to his establishing the NUMA (National Underwater and Marine Agency) Foundation, a nonprofit organization  dedicated to the discovery and preservation of historic shipwrecks.  From the more than sixty shipwrecks Cussler and his NUMA volunteers have found, he has chosen the twelve most interesting, whether because of the ship's history, the circumstances of its sinking, or the trouble,  frustration, and peril that were encountered while trying to find the sunken wreck.  With the same wonderful storytelling that Cussler brings to his novels, he describes his searches for such ships as the Union 24-gun frigate Cumberland, sunk during the Civil War by the Confederate ironclad CSS Virginia (formerly the Merrimack); the Confederate Hunley, which became the first submarine in history to sink a warship; the  U-21, a German U-boat, which during World War I became the first sub to sink a warship and escape; and the American troop transport Leopoldville, which was destroyed by a German submarine on Christmas Eve, 1944, with huge loss of life; as well as Engine #51, the lost locomotive of Kiowa Creek, which roared off a storm-weakened high bridge in 1878.  The wrecks date as far back as 1840 and span the continental United States, the Atlantic Ocean, and the North Sea.  As he does in the Dirk Pitt novels, Cussler opens each story with a creative dramatization of the ship and the way she met her end, then brings the story into the present as he describes the immense research and careful preparation so often necessary to find a long lost ship.  For example, he describes the tragic fate of the steamboat Lexington, which burst into flames in the frigid winter of 1840, causing the loss of over 150 lives -- but sparing Henry Wadsworth Longfellow, who missed the trip only because he arrived at the dock seconds too late.  There's also the odd fate of the steamboat Charleston, which became the warship Zavala and which was so horribly damaged in a terrible Atlantic storm in 1842 that it was abandoned in a Galveston, Texas, marsh, and slowly sank from view. In tracing its location, Clive Cussler finally found it -- under a parking lot!  Dramatic, compelling, and personal, Clive Cussler's The Sea Hunters is as exciting and satisfy- ing as the best of his Dirk Pitt novels.",
        "Category": " History , Military , Naval",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "SAMURAI (Aventura)",
        "Authors": "By Endo, Shusaku",
        "Description": "In 1613, with plans to open a trade route between Mexico and Japan, four Samurai and an ambitious Franciscan missionary embark on a journey that takes them to Mexico and Rome and back again to a Japan torn by strife",
        "Category": " Fiction , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1984"
        }
    },
    {
        "Title": "Net Gain: Expanding Markets through Virtual Communities",
        "Authors": "By Hagel, John and Armstrong, Arthur",
        "Description": "Net Gain identifies where the next level of value lies on the Internet and lays out the first economic model to quantify the revenue potential and the investment required to build a successful virtual community. From the offerings of commercial online services such as the Motley Fool Investment group to Internet communities of book lovers, Net Gain offers a multitude of real-world scenarios and lessons for building value and creating competitive edge. The authors clearly show that in order to compete in the online economy, you must establish an entirely new approach to product development, marketing, customer service, and distribution, and rethink your company's relationships to customers, suppliers, and competitors. And they show you how to do it.",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "Harvard Business Review Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Madelaina",
        "Authors": "By Morgan, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Pinnacle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1979"
        }
    },
    {
        "Title": "Design and Figure Carving",
        "Authors": "By Tangerman, E. J.",
        "Description": "Historically surveys the decorative and architectural motifs of the last six thousand years, and provides detailed instructions for designing, blocking, and carving toys, furniture, figurines, and bas reliefs",
        "Category": " Crafts & Hobbies , Carving",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Shadow of Fu Manchu #6 (Vintage Pyramid F-837)",
        "Authors": "By Sax Rohmer",
        "Description": "",
        "Category": "",
        "Publisher": "Pyramid Books",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "The Chinese Gold Murders (Judge Dee Mysteries)",
        "Authors": "By Gulik, Robert Hans Van",
        "Description": "Soon after taking up his first magisterial post in the godforsaken district of Peng-lai, Judge Dee must look into the murder of his predecessor. His job is complicated by the simultaneous disappearnce of his chief clerk and the new bride of a wealthy local shipowner. \"The China of old, in Mr. van Gulik's skilled hands, comes vividly alive again.\"--Allen J. Hubin, New York Times Book Review\"If you have not yet discovered Judge Dee, I envy you that initial pleasure . . . the discovery of a great detective story. For the magistrate of Poo-yan belongs in that select group headed by Sherlock Holmes.\"--Robert Kirsch, Los Angeles TimesRobert van Gulik (1910-67), a Dutch diplomat and an authority on Chinese history and culture, drew his plots from the popular detective novels that appeared in seventeenth-century China.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "August",
            "Year": "1979"
        }
    },
    {
        "Title": "Bernard Shaw, Vol. 1: 1856-1898 - The Search for Love",
        "Authors": "By Holroyd, Michael",
        "Description": "Commissioned by the Shaw estate. This first of three volumes follows him to his marriage in 1898. Includes over 30 photographs. The bibliography will be published as a fourth volume. The set promises to eclipse previous GBS biographies and to rise to eminence among all literary  lives.  Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "The Adventures of Huckleberry Finn (Bantam Classics)",
        "Authors": "By Twain, Mark",
        "Description": "Adventures of Huckleberry Finn is essential to the understanding of the American soul. The recent discovery of the first half of Twain's manuscript, long thought lost, made front-page news. And this unprecedented edition, which contains for the first time omitted episodes and other variations present in the first half of the handwritten manuscript, as well as facsimile reproductions of thirty manuscript pages, is indispensable to a full understanding of Adventures of Huckleberry Finn. The changes, deletions, and additions that Mark Twain made in the first half of the original manuscript (changes that are larger and more numerous and significant than those he made in the second half) indicate that he frequently checked his impulse to write an even darker, more confrontational work than the book he finally published. He deleted an episode in which whites at a religious camp meeting try to avoid the embraces of a black slave woman - a woman who may think, mistakenly, that she has just been freed. And even in its smallest variations - such as the consistent alteration of vicious rawhide whippings to ordinary cowhide whippings - the original manuscript demonstrates the skill, the restraint, and the constraints that affected Mark Twain's creative process.",
        "Category": "",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1981"
        }
    },
    {
        "Title": "Anne of Windy Poplars (Anne of Green Gables)",
        "Authors": "By Montgomery, L. M.",
        "Description": "Anne Shirley has left Redmond College behind to begin a new job and a new chapter of her life away from Green Gables. Now she faces a new challenge: the Pringles. They're known as the royal family of Summerside - and they quickly let Anne know she is not the person they had wanted as principal of Summerside High School. But as she settles into the cozy tower room at Windy Poplars, Anne finds she has great allies in the widows Aunt Kate and Aunt Chatty - and in their irrepressible housekeeper, Rebecca Dew. As Anne learns Summerside's strangest secrets, winning the support of the prickly Pringles becomes only the first of her triumphs.",
        "Category": "",
        "Publisher": "Starfire",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "God's Most Precious Jewels Are Crystallized Tears",
        "Authors": "By Johnson, Barbara",
        "Description": "The Queen of Encouragement has brought a dozen amazing friends to inspire and encourage  you!Barbara Johnson's heart-touching, laughter-laced story has given hope to millions of readers worldwide. Now she brings together twelve courageous women who have triumphed over challenges and endured heart-rending losses. With Christlike serventhood, they have reached beyond their own anguish to extend a helping hand to others in need, turning their tears of heartache into jewels of blessing. In their awe-inspiring stories, you will meet women who have faced:a husband's brutal murderthe death of a young childpoverty and bigotryeating disordersan adult child's homosexualitythe death of two sons due to AIDSabusive marriagesheartbreaking divorcefamily members' estrangementclinical depressionphysical disabilitya husband's struggle with homosexualityToday these women, like Barbara, spread hope and joy wherever they go. To celebrate their ministry of encouragement, each of their stories concludes with Barbara's trademark collection of wit and laughter. Open this book and find a pathway out of sorrow and into the sunlight of a life warmed by love and filled with meaning. Read these stories and learn how to turn misery into ministry.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Clinical Psychopharmacology",
        "Authors": "By Bernstein, Jerrold G. (EDT)",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Year Book Medical Pub",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Basics of Personal Protection: A Practical Handgun Handbook",
        "Authors": "By NRA",
        "Description": "",
        "Category": "",
        "Publisher": "National Rifle Assn",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Myst: The Official Strategy Guide (Secrets of the Games Series)",
        "Authors": "By Barba, Rick and Demaria, Rusel",
        "Description": "",
        "Category": " Games , Video & Electronic",
        "Publisher": "Prima Games",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "365 Travel Games & Activities",
        "Authors": "By Zukowski, Stan",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Human Anatomy Coloring Book: an Entertaining and Instructive Guide to the Human Body - Bones, Muscles, Blood, Nerves and How They Work (Coloring Books) (Dover Children's Science Books)",
        "Authors": "By Matt, Margaret",
        "Description": "From a biological point of view, the human body is an infinitely complex marvel of fine design, superbly adapted to its functions by eons of evolutionary development. Hundreds of specialized organs, bones, muscles, nerve fibers, blood vessels, and other anatomical features comprise an interdependent network of bodily systems that enables the human organism to survive. Now the component parts of this intricate flesh-and-bone machine can be absorbed and understood by means of an ingenious format: a coloring book that can help mature children and adult colorists learn anatomy.An affordable anatomy class, this easy learning study aid contains careful, scientifically accurate line renderings of the body's organs and major systems: skeletal, muscular, nervous, digestive, reproductive, and more. A total of 43 coloring pages (often with several illustrations on each) offers numerous views, cross-sections, diagrams and detailed closeups, labelled and numbered to correspond with suggestions for coloring. These suggestions are specially designed to emphasize the structural relationship in the body. By working through each system, the reader will gain not only an intimate knowledge of the location, appearance and role of the body parts, this learning tool will also be laying the groundwork for more sophisticated studies of anatomy.",
        "Category": " Juvenile Nonfiction , Science & Nature , Anatomy & Physiology",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "Shield of David .The Story of Israel's Armed Forces",
        "Authors": "By Yigal Allon and Illustrator-Photos",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "6.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Golf For Dummies (For Dummies (Computer/Tech))",
        "Authors": "By Huggan, John and McCord, Gary",
        "Description": "Golf is a simple game. You have a bunch of clubs and a ball. You have to hit the ball with a club into a series of holes laid out in the middle of a large, grassy field. As simple as it is, many people believe golf is the hardest game in the world. If you’re like most golfers, you play the sport for fun, relaxation, and a chance to get out and enjoy the great outdoors. If you’re like Arnold Palmer, Jack Nicklaus, or Tiger Woods, you get to do all that – and make a gazillion dollars to boot!Golf for Dummies, 2nd Edition, is a valuable tool for men and women of all ages who want to know more about golf or improve their game. Whether you’re new to golf or a long-time duffer, this updated version of the bestselling guide will get you into the swing of things by helping you to:Master grip, stance, and swingFix common faultsImprove your puttingKnow the score on rules and etiquetteTake advantage of high-tech equipmentShape up with golf-specific exercisesDiscover how to take strokes off your game by improving the technique of your swing with step-by-step photos. Then master the all important putt to even better your score. Golf For Dummies, 2nd Edition, also covers the following topics and more:How to choose your golf balls and clubsGetting and staying in golf shapeGetting the most from your lessonsWhere to play and who to play withDeveloping your own swingPutting, chipping, and pitchingSpecial shots, conditions, and considerationsAuthor and CBS television golf analyst Gary McCord is a PGA Senior Tour champion and a golf instructor to many celebrities.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Eternity Road",
        "Authors": "By McDevitt, Jack",
        "Description": "The Roadmakers left only ruins behind - but what magnificent ruins!Their concrete highways still cross the continent. Their shattered towers still gleam on the banks of the Mississippi. Their cups and combs and jewelry are found in every Illyrian home. The lost race left behind a legend, as well - a hidden sanctuary called Haven, where a few Roadmakers hid from the mysterious Plague that destroyed their world, and where even now the secrets of their civilization might still be found.Chaka's brother was one of those who sought to find Haven and never returned. But now Chaka has inherited a rare Roadmaker artifact - a book called A Connecticut Yankee in King Arthur's Court - which has inspired her to follow in his footsteps. A red-haired young woman with a hunter's eyes, Chaka gathers an unlikely band including an aging scholar, an amateur soldier, and a mystic healer. With a reluctant leather-clad frontiersman as a guide, they set out to follow the collapsed roadways north toward the dragon-haunted ruins of Chicago and the thundering cataract Nyagra.On their journey they will encounter blood-thirsty river pirates, electronic ghosts still mourning their lost civilization, and machines that skim over the ground and even into the air. And they will learn the truth about their own mysterious past.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Harper Prism",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Nell Hill's Style At Home",
        "Authors": "By Garrity, Mary Carol, Caldwell, Mary, McCay, Bryan E. (PHT), Nell Hill's (Shop) (COR), and McCay, Bryan E.",
        "Description": "Atchison, Kansas, used to be known as the hometown of Amelia Earhart. Now it's famous for two shops -- Nell Hill's and G. Diebolt's. Behind these two magical emporiums of home furnishings is Mary Carol Garrity, whose loyal customers come from across the country to seek her advice in decorating. Now Mary Carol has created a compilation of her favorite tips, tricks, and techniques in Nell Hill's Style At Home. Within its beautifully illustrated pages, Mary Carol tells readers where she gets her ideas, how to reflect their own style at home, and once they've made their home perfect, how to take it apart and do it again an even better way. Readers are guaranteed unlimited inspiration with Mary Carol's unique blend of style, creativity, and common sense. Learn how to create collections, group and regroup favorite accessories, and mix and match styles and sets of china fearlessly. Learn how to create still lifes with tableaux of your favorite things, corral them on trays, fence them in with stacks of books, and feature odd pieces of glass -- decanter stoppers, old bottles, vases without flowers -- as art. Learn how to personalize your rooms in unexpected ways: Recruit a platter as a kitchen sink backsplash or a cake stand as a soap dish.",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "The Skin Type Solution: A Revolutionary Guide to Your Best Skin Ever",
        "Authors": "By Baumann, Leslie, M.D.",
        "Description": "From Dr. Leslie Baumann, a world-renowned dermatologist, comes a program that’s revolutionizing the way people everywhere think about–and shop for–skin care. Now you can identify and buy the products that are right for your true skin type. Answer the Baumann questionnaire inside this book and within minutes you can learn…As everyone knows, all skin is not created equal. But whereas previous books identified only four basic skin types, through her cutting-edge clinical research in Miami Beach, Dr. Leslie Baumann discovered that there are actually sixteen distinctly different skin types–each with unique needs all its own. But caring for your skin doesn’t have to be complicated. As Director of Cosmetic Dermatology at the Miller School of Medicine at the University of Miami, Dr. Baumann has tested her program on thousands of patients, developing a system that is already transforming dermatology. Now her proven program is available to you. You’ll discover: • Your personal skin type profile detailing exactly what will work–and what won’t–for your unique complexion • An extensive product guide to name brands suited to every skin type and budget, including cleansers, moisturizers, toners, sun blocks, foundations, and much more  • Natural health and dietary advice for beautiful skin • Tips on preventing skin aging and “problem” skin • The latest information on the new world of prescription products, facials, chemical peels, Retin-A, Botox, and collagen injections  So take the questionnaire, discover your type, and find the products you need to look like a million bucks without spending a fortune. With this book in hand, you’ll save time, money–and something even more valuable: your skin.",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "Bantam",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "In the Line of Duty: A Tribute to New York's Finest and Bravest",
        "Authors": "By Kerik, Bernard B. (EDT), Von Essen, Thomas (FRW), Kerik, Bernard B. (FRW), and Von Essen, Thomas (EDT)",
        "Description": "On September 11, 2001, with the terrorist attack on the twin towers of the World Trade Centre in New York City, the United States entered one of the greatest trials in its history. There were thousands of deaths in the wake of that tragedy -- and thousands of heroes. Led by Police Commissioner Bernard B. Kerik and Fire Commissioner Thomas Von Essen, the New York Police Department (NYPD) and the New York Fire Department (FDNY) banded together in courage and hope during the rescue and recovery effort. In the Line of Duty salutes the brave men and women of those two departments, who proved to the nation and the world the strength and heroism of the American people. Through over 100 pages of black and white photographs (and 16 pages of full colour), this memorial volume documents the heroism of New York's Finest and Bravest in the hours and days following the disaster. With a Foreword in tribute to the search and rescue teams -- and their fallen comrades -- by Commissioner Kerik, and filled with the inspirational words of national and spiritual leaders, In the Line of Duty bears witness to the indomitable spirit of the American people.",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "Harper Design",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "The Revolution From Rosinante",
        "Authors": "By Gilliland, Alexis A.",
        "Description": "",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1981"
        }
    },
    {
        "Title": "DOS For Dummies Quick Reference (For Dummies Quick References)",
        "Authors": "By Harvey, Greg",
        "Description": "Suitable for both beginning and advanced users of this popular operating system, this easy-to-use manual is designed to guide users through the important commands and hidden troublespots of the DOS operating system. Original.",
        "Category": " Computers , Operating Systems , General",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Dune: The Machine Crusade",
        "Authors": "By Herbert, Frank, Herbert, Brian, and Anderson, Kevin J.",
        "Description": "The breathtaking vision and incomparable storytelling of Brian Herbert and Kevin Anderson's Dune: The Butlerian Jihad, a prequel to Frank Herbert's classic Dune, propelled it to the ranks of  speculative fiction's classics in its own right. Now, with all the color, scope, and fascination of the prior novel, comes Dune: The Machine Crusade.   More than two decades have passed since the events chronicled in The Butlerian Jihad. The crusade against thinking robots has ground on for years, but the forces led by Serena Butler and Irbis Ginjo have made only slight gains; the human worlds grow weary of war, of the bloody, inconclusive swing from victory to defeat. The fearsome cymeks, led by Agamemnon, hatch new plots to regain their lost power from Omnius--as their numbers dwindle and time begins to run out. The fighters of Ginaz, led by Jool Noret, forge themselves into an elite warrior class, a weapon against the machine-dominated worlds. Aurelius Venport and Norma Cenva are on the verge of the most important discovery in human history-a way to \"fold\" space and travel instantaneously to any place in the galaxy. And on the faraway, nearly worthless planet of Arrakis, Selim Wormrider and his band of outlaws take the first steps to making themselves the feared fighters who will change the course of history: the Fremen.Here is the unrivaled imaginative power that has put Brian Herbert and Kevin Anderson on  bestseller lists everywhere and earned them the high regard of readers around the globe. The fantastic saga of Dune continues in Dune: The Machine Crusade.",
        "Category": " Fiction , Science Fiction , Space Opera",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Comets: Readings from Scientific American",
        "Authors": "By Brandt, John C. (ILT)",
        "Description": "",
        "Category": "",
        "Publisher": "W H Freeman & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1981"
        }
    },
    {
        "Title": "Nicolaides The Natural Way to Draw: A Working Plan for Art Study",
        "Authors": "By Nicolaides, Kimon",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Houghton Mifflin Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1975"
        }
    },
    {
        "Title": "Live and Learn and Pass It on: People Ages 5 to 95 Share What They'Ve Discovered About Life, Love, and Other Good Stuff (Live & Learn & Pass It on)",
        "Authors": "By Brown, H. Jackson (EDT)",
        "Description": "A collection of wisdom from people aged five to ninety-five features the things they have learned in their lives and shows readers that wisdom has no age. Original.",
        "Category": "",
        "Publisher": "Rutledge Hill Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Buying the night flight: The autobiography of a woman foreign correspondent (Radcliffe biography series)",
        "Authors": "By Geyer, Georgie Anne",
        "Description": "",
        "Category": "",
        "Publisher": "Delacorte Press/Seymour Lawrence",
        "Price Starting With ($)": "26.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "New York September Eleven Two Thousand One",
        "Authors": "By Baravalle, Giorgio (EDT), Modine, Cari (EDT), Chomsky, Noam (CON), Chopra, Deepak (CON), Dryfuss, Richard (CON), Friedman, Thomas L. (CON), Ghosh, Amitav (CON), Hamid, Mohsin (CON), Kennedy, Robert F., Jr. (CON), Modine, Matthew (CON), Moyers, Bill D. (CON), Neeson, Liam (CON), and Rivers, Joan (CON)",
        "Description": "Presents testimonials, personal stories, essays, poems, and images from a range of contributors about the September 11 terrorist attacks and the acts of heroism and good will in the aftermath of the attacks.",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "De.Mo",
        "Price Starting With ($)": "6.11",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Snow-walker",
        "Authors": "By Fisher, Catherine",
        "Description": "Since Gudrun came from the frozen mists beyond the edge of the world, the Jarl's people have obeyed her in hatred andterror. But the enchantress has one weakness: a son, Kari,  banished to a forbidding fortress in the north, never seen by the Jarl's people. In secret they wonder: Are the rumors true? Was he born a monster?Now Jessa and her cousin Thorkil have been exiled to the north, and if they survive the journey, they will find the truth: Is Kari a beast? Or the means to stop the sorceress?",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Greenwillow Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Circling the Globe: A Young Peoples Guide to Countries and Cultures of the World",
        "Authors": "By Grabham (EDT)",
        "Description": "Highlighted by thousands of illustrations, photographs, and maps, a continent-by-continent tour of the nations of the world provides a close-up look at each country's history, politics, economics, religion, culture, and daily life.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "8.14",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "None to Accompany Me",
        "Authors": "By Gordimer, Nadine",
        "Description": "In an extraordinary period immediately before the first non-racial election and the beginning of majority rule in South Africa, Vera Stark, the protagonist of Nadine Gordimer's passionate new novel, weaves a ruthless interpretation of her own past into her participation in the present as a lawyer representing blacks in the struggle to reclaim the land. The return of exiles is transforming the city, and through the lives of Didymus Maqoma, his wife Sibongile, and their lovely daughter who cannot even speak her parents' African language, the reader experiences the strange passions, reversals, and dangers that accompany new-won access to power.All must change: Didymus, once a major actor in the resistance, making way for Sibongile's emergence as a political figure; Vera, working through the consequences of a lifetime's commitments to a new kind of relationship with a new man of the times, Zeph Rapulana.",
        "Category": " Fiction , Literary",
        "Publisher": "Farrar Straus & Giroux",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "The Quality School",
        "Authors": "By Glasser, William",
        "Description": "\"This should be required reading by every school administator, every teacher, every board member and all university faculty involved in the training of teachers. There is no doubt that we need to squeeze all blame, all coerion and all criticism out of any people-related business. Not until we realize that schools are in a people business will we ever be able to make meaningful changes.\"--Dr. Albert Mamary, former superintendent of schools, Johnson City, New York",
        "Category": " Psychology , Education & Training",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "FDR: The Beckoning of Destiny, 1882-1928 (1882-1928: A History)",
        "Authors": "By Davis, Kenneth S.",
        "Description": "",
        "Category": "",
        "Publisher": "History Book Club",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Coffin Quilt: The Feud between the Hatfields and the McCoys",
        "Authors": "By Rinaldi, Ann",
        "Description": "Fanny McCoy has lived in fear and anger ever since that day in 1878 when a dispute with the Hatfields over the ownership of a few pigs set her family on a path of hatred and revenge. From that day forward, along the ragged ridges of the West Virginia-Kentucky line, the Hatfields and the McCoys have operated not withing the law but within mountain codes of their own making. In 1882, when Fanny's sister Roseanna runs off with young Johnse Hatfield, the hatred between the two clans explodes.As the killings, abductions, raids, and heartbreak escalate bitterly and senselessly, Fanny, the sole voice of reason, realizes that she is powerless to stop the fighting and must learn to rise above the petty natures of her family and neighbors to find her own way out of the hatred.",
        "Category": " Young Adult Fiction , Historical , United States , 19th Century",
        "Publisher": "CY",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Jesus I Never Knew Participant's Guide",
        "Authors": "By Yancey, Philip",
        "Description": "Get ready to encounter the Jesus You Never Knew!  Discover for Yourself Why No One Who Meets Him Ever Stays the Same!  Welcome to a journey that will challenge you--and change you.  A journey that will expand--and very likely redefine--your understanding of the person, teachings, and life of Jesus Christ.  One that will lead you beyond familiar images of Christ to discover Jesus as you've never known him: radical, compelling, compassionate, bold, incisive, and ultimately satisfying.  This Participant's Guide is your ticket to transformative insights, invigorating discussions, and personal applications as you travel through the 14 sessions of the Jesus I Never Knew curriculum.  Prepare yourself for life-changing encounters with the Jesus of the Gospels. . .and discoveries as refreshing, unpredictable, and exciting as the person you're about to meet.",
        "Category": " Religion , Education",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Breakfast With Friends: Seasonal Menus to Celebrate the Morning",
        "Authors": "By Alston, Elizabeth",
        "Description": "Directed to those who want to entertain unconventionally, the author offers seasonally and regionally based breakfast recipes, shopping lists, preparation techniques, and special diets",
        "Category": " Cooking , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Plucked Again!: The Great Chicken Rebellion",
        "Authors": "By Rouse, William D.",
        "Description": "",
        "Category": " Fiction , Humorous",
        "Publisher": "iUniverse",
        "Price Starting With ($)": "6.9",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "The Hazards of walking and other memos from your bureaucrats",
        "Authors": "By Fenn, Donna and Trueblood, Carol",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Pulse",
        "Authors": "By Buchanan, Edna",
        "Description": "With the perfect wife, two beautiful daughters and a successful business, Frank Douglas had everything to live for. But someone else had to die first. If Daniel Alexander had not committed suicide, Frank Douglas would never have lived to see his forty-fifth birthday. Alexander's heart now beats strong and sure in Douglas's chest. The donated organ has given the successful Miami businessman a second chance but it gives him no peace. Disturbed by nagging feelings of guilt and uncertainty, Frank sets out to discover all he can about the benefactor whose death gave him life. His search leads him to Rory Alexander--Daniel's beautiful, enigmatic wife-and to troubling questions and shocking revelations about the late man's affairs. Why, for example, have the profits from Alexander's seemingly successful business ventures mysteriously vanished? And why is Rory so unshakably certain that her husband was murdered? A numbers man, Frank Douglas needs to have the figures add up--and that need is drawing him and a seductive, distraught widow across the length of a nation, and deep into something corrupt and twisted and deadly. And suddenly the new life he was granted is in serious peril, threatened by secrets, lies, human savagery and greed. . .and by the true dark nature of the heart that is now pumping the lifeblood through his body.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Silent Treatment",
        "Authors": "By Palmer, Michael",
        "Description": "With his wife, Evie, scheduled for surgery the next day, Dr. Harry Corbett goes to the hospital for what he hopes will be a quiet evening of reconciliation. In recent weeks Evie, never quick to share her feelings, has been more closed and distant than ever.But when Harry reaches Evie's room, it is too late for reconciliation. Shockingly, without warning, Evie is dead. The police suspect homicide. And their only suspect is Dr. Harry Corbett.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The Parsifal Mosaic",
        "Authors": "By Ludlum, Robert",
        "Description": "Michael Havelock’s world died on a moonlit beach on the Costa Brava as he watched his partner and lover, double agent Jenna Karas, efficiently gunned down by his own agency. There’s nothing left for him but to quit the game, get out. Then, in one frantic moment on a crowded railroad platform in Rome, Havelock sees Jenna. Racing around the globe in search of his beautiful betrayer, Havelock is now marked for death by both U.S. and Russian assassins, trapped in a massive mosaic of treachery created by a top-level mole with the world in his fist: Parsifal.Praise for Robert Ludlum and The Parsifal Mosaic“[Robert] Ludlum’s narrative imagination is a force of nature.”—The New York Times“As fast-paced and absorbing as any he’s written.”—Newsday“The suspense never lets up.”—The Atlanta Journal-Constitution“A crackling good yarn.”—Los Angeles Times Book ReviewBONUS: This edition includes an excerpt from Robert Ludlum’s The Bourne Identity.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "The Miracle of Recovery: Healing for Addicts, Adult Children and Co-Dependents",
        "Authors": "By Cruse, Sharon Wegscheider",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Hci",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "A Small Town Called Hibiscus",
        "Authors": "By Hua, Gu",
        "Description": "",
        "Category": "",
        "Publisher": "Foreign Languages Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "It happened in Washington County",
        "Authors": "By Musey, Reuben L",
        "Description": "",
        "Category": "",
        "Publisher": "Washington County Bicentennial Committee",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Stock Car Racing",
        "Authors": "By Holder, Bill",
        "Description": "",
        "Category": "",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The Trials of Rumpole",
        "Authors": "By Mortimer, John Clifford",
        "Description": "The irrepressible English barrister becomes involved with cases of shoplifting, murder, art theft, and mistaken identity as he represents a minister, an actress, a racist Parliamentary candidate, and others",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1981"
        }
    },
    {
        "Title": "Pee Wee Scouts: Blue Skies, French Fries",
        "Authors": "By Delton, Judy",
        "Description": "\"Rat's knees!\" said Molly Duff.  \"School starts tomorrow.\" Luckily, the  Pee Wee  Scouts have a meeting the next day. That's  when they find out about the big surprise   ahead. At the Pee Wee weenie roast, their Scout  leader, Mrs. Peters, tells them  about a football game  coming up. A Pee Wee football game. \"We're  going to play  against Troop 15 from Oakdale,\"  she says. \"Yeah!\" cheers Roger  White. \"We'll win!\" Every day,  under blue skies, the Pee Wees practice hard.  Rachel cheers. Roger  tries. But Sonny just wants french  fries. Team spirit is what it takes. Can  Troop  23 win the big game?",
        "Category": " Juvenile Fiction , Sports & Recreation , Soccer",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    }
]