[
    {
        "Title": "Celebrate Virginia! The Hospitality, History and Heritage of Virginia",
        "Authors": "By Crutchfield, James Andrew, Fullinwider, Rowena J., and Jeffery, Winette Sparkman",
        "Description": "\"Celebrate Virginia!\" is a celebration of all that is Virginia. It honors the unparalleled heritage of hospitality and history for which Virginia is renowned. This beautiful cookbook features a combination of recipes, interesting historical sidebars, and anecdotal descriptions of food-related products for which Virginia is known. Recipes are both contemporary and historical, as are the many culinary traditions found throughout the book. For example, the book describes the unique \"Shad Planking\" tradition held each year, and the history of tea. Numerous recipes attributed to Virginia's celebrated sons and daughters are included, such as Senator John Warner's recipe for Crab Cakes.",
        "Category": " Cooking , Regional & Ethnic , American , Middle Atlantic States",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "A Short Guide to Writing About History, 4th Edition",
        "Authors": "By Marius, Richard and Page, Melvin E.",
        "Description": "An ideal accessory in any history course that requires writing, A Short Guide to Writing About History stresses thinking and writing like a historian.    This engaging and practical little text helps the readers get beyond merely compiling dates and facts; it teaches them how to incorporate their own ideas into their papers and to tell a story about history that interests them and their peers. Covering both brief essays and the documented resource paper, this book explores the writing and researching processes, different modes of historical writing including argument and concludes with guidelines for improving style.    For any one who will need to write about history.",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Longman Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "No Compromise Decorating",
        "Authors": "By Lynette Jennings",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Ortho's All About Patios",
        "Authors": "By Miller, Martin and Erickson, Larry (EDT)",
        "Description": "A practical guidebook with straightforward instructions for designing and building a patio.Expert tips, timesaving techniques, and practical solutions for creating patios with an updated look.",
        "Category": " House & Home , Do-It-Yourself , Masonry",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Devil in the Junior League",
        "Authors": "By Lee, Linda Francis",
        "Description": "The Junior League of Willow Creek, Texas, is tres exclusive. Undesirables need not apply. Fredericka Mercedes Hildebrand Ware (Frede to her friends) is a member beyond reproach...until her life begins to unravel. When her husband betrays her, steals her money, and runs off to places unknown, it's something Frede would rather keep under wraps. The last thing she needs is to become fodder for the JLWC gossip mill. And to make matters worse, there's only one person in town who stands a chance at helping her get revenge: Howard Grout, a tasteless, gold-chain-wearing lawyer who has bought his way into Frede's tony neighborhood. But htere's a price: She has to get his tacky, four-inch-stiletto-and-pink-spandex-wearing wife Nikki into the Junior League. Linda Francis Lee has written an hysterical novel about the creme de la creme of Texas society, the lengths to which one woman goes to bring her cheating husband to justice, and how taking on what seems like a \"Mission Impossible\" can change you in ways you could never have imagined.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Jackson & Perkins Selecting, Growing and Combining Outstanding Perennials: Mid-Atlantic and New England Edition",
        "Authors": "By Dunn, Teri, Heriteau, Jacqueline, Viette, Andre, and Viette, Mart",
        "Description": "\"Outstanding Perennials\" is the book for those who want the latest developments and trends in Perennials, from new varieties to design ideas.\"Outstanding Perennials\" is available in six regional editions. Authors are among the most highly respected gardening experts in their individual regions and share their advice on the Perennials that perform best in their area.Gardeners will be attracted to \"Outstanding Perennials\" for the same level of trust associated with Jackson & Perkins Roses.\"Outstanding Perennials\" gives gardeners advice on how to select, plant, grow, and provide care for Perennials.An added bonus, Outstanding Perennials offers valuable design ideas, based on great Perennial and Rose combinations.",
        "Category": " Gardening , Regional , New England (CT, MA, ME, NH, RI, VT)",
        "Publisher": "Cool Springs Pr",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "All Kinds of Friends : Standard Anthology",
        "Authors": "By Harcourt School Publishers Staff",
        "Description": "",
        "Category": "",
        "Publisher": "HARCOURT SCHOOL PUBLISHERS",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "The Power of God's Word for Fathers",
        "Authors": "By Countryman",
        "Description": "",
        "Category": " Family & Relationships , Parenting , Fatherhood",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Scribbler of Dreams",
        "Authors": "By Mary E. Pearson",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Beijing Doll",
        "Authors": "By Sue, Chun, Goldblatt, Howard, and CHUNSHU",
        "Description": "Banned in China for its candid exploration of a young girl's sexual awakening yet widely acclaimed as being \"the first novel of 'tough youth' in China\" (Beijing Today),Beijing Doll cuts a daring path through China's rock-and-roll subculture. This cutting edge novel -- drawn from the diaries the author kept throughout her teenage years -- takes readers to the streets of Beijing where a disaffected generation spurns tradition for lives of self expression, passion, and rock-and-roll. Chun Sue's explicit sensuality, unflinching attitude towards sex, and raw, lyrical style break new ground in contemporary Chinese literature.",
        "Category": " Fiction , Women",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "100 Questions & Answers About Crohn's Disease and Ulcerative Colitis: A Lahey Clinic Guide",
        "Authors": "By Warner, Andrew S., M.D. and Barto, Amy E., M.D.",
        "Description": "Drawn from questions asked by their patients with inflammatory bowel disease--IBD is the collective term for Crohn's disease and ulcerative colitis, Drs. Warner and Barto (gastroenterologists with the Lahey Clinic, Burlington, Massachusetts) answer questions about concerns ranging from treatment options and diet to IBD in pregnancy and children. The guide includes patients' perspectives about coping with IBD, resources, and a glossary. Annotation ©2007 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Medical , Oncology , General",
        "Publisher": "Jones & Bartlett Learning",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "My Utmost For His Highest: Limited PB Edition",
        "Authors": "By Chambers, Oswald",
        "Description": "A powerful devotional - quality packaging - tremendous price. You get it all in My Utmost for His Highest, Updated Edition, a limited-time promotional version! The My Utmost for His Highest promotion is back and it's better than ever! Welcome old friends and introduce new readers to Oswald Chambers's classic devotional-in the updated language edition of editor James Reimann. This 400 page paperback - in a solid yet handy trim size - features the complete devotional text plus topic and scripture indexes.",
        "Category": " Religion , Christian Life , Devotional",
        "Publisher": "Discovery House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Science Experiments You Can Eat: Revised Edition",
        "Authors": "By Cobb, Vicki, Cain, David (ILT), and Lippman, Peter J. (ILT)",
        "Description": "Science never tasted so good!Dig into a feast of fun—where you’re the scientist and the kitchen is your laboratory! Discover what it takes to make sugar crystallize into rock candy, what moisture has to do with popping popcorn, and how proteins are essential in making cakes and muffins rise. And after you’ve tested your theories and made some amazing discoveries, you can actually eat your results!Vicki Cobb’s Science Experiments You Can Eat has stood the test of time, filling the minds—and stomachs—of kids for more than forty years. Now with revised and updated material that includes clever new procedures, many new experiments, and vital information on nutrition, a whole new generation of readers can devour this cornucopia of food for thought.",
        "Category": " Young Adult Nonfiction , Science & Nature , Experiments & Projects",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "Play it Again (From the Files of Madison Finn, Book 3)",
        "Authors": "By Dower, Laura",
        "Description": "Madison tries to figure out who her real friends are after she is made stage manager of the school musical.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Volo",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The Dead Beat: Lost Souls, Lucky Stiffs, and the Perverse Pleasures of Obituaries (P.S.)",
        "Authors": "By Johnson, Marilyn",
        "Description": "Marilyn Johnson was enthralled by the remarkable lives that were marching out of this world—so she sought out the best obits in the English language and the people who spent their lives writing about the dead. She surveyed the darkest corners of Internet chat rooms, and made a pilgrimage to London to savor the most caustic and literate obits of all. Now she leads us on a compelling journey into the cult and culture behind the obituary page and the unusual lives we don't quite appreciate until they're gone.",
        "Category": " Language Arts & Disciplines , Journalism",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Mummy's Curse Book (#TV-1) (The Young Indiana Jones Chronicles, Tv-1)",
        "Authors": "By Stine, Megan, Stine, H. William, Lucas, George, and Hales, Jonathan",
        "Description": "Nine-year-old Indy's excitement at learning about archaeology from none other than Lawrence of Arabia soon sours when a man guarding a newly opened tomb is murdered. Simultaneous.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Just For Kicks",
        "Authors": "By Andersen, Susan",
        "Description": "Las Vegas showgirl Carly Jacobsen keeps finding out the hard way that her idea of fun differs radically from that of her neighbor Wolfgang Jones.Sure, he looks incredible, and he seems to have a thing for her legs, but the man's a robot. So what's with their chemistry? Wolf has noticed Carly's legs, because they're always tangled up in leashes attached to her ridiculous assortment of pets. She's a pain, she's wacky, she's always in the way and yet for some reason he can't keep her out of his thoughts.When a moment of weakness leads to some serious sheet-scorching sex, the two discover at least one area where they do both have fun. But outside the bedroom the stakes are getting higher, and love might come down to a roll of the dice&#133;.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Icing On The Cake",
        "Authors": "By Castoro, Laura",
        "Description": "When Liz Talbot's husband left her for a woman half her age, Liz put all her passions into her bakery. The problem is that fad diets and fitness crazes are ruining sales and she's barely staying afloat. Liz's luck seems to be changing when her ex dies without changing his will, leaving her the main beneficiary. Unfortunately one of the things she inherits is the advertising agency she left behind to pursue her dream of baking. Her partner? The newly widowed husband stealer—Brandi, with a heart over the i. As the new co-owner of Talbot Advertising, in the toilet since the death of her ex (that's right, she's now the proprietor of two failing businesses), Liz is more determined than ever to break out and make a name for herself as an artisan baker extraordinaire, providing her products can catch the eye of the Nabisco Food scout  who is as elusive as he is mysterious.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Mrs. Miracle (Angels)",
        "Authors": "By Macomber, Debbie",
        "Description": "If you like Debbie Macomber's Christmas novels and her Angel series, don't miss this fan favorite, also a motion picture from the Hallmark Channel.They call her Mrs. Miracle…Seth Webster’s heart never healed after he lost his adored wife. Now, with Christmas approaching, wild twin boys to raise alone, a home in chaos, and the latest in a long line of exasperated housekeepers quitting in disgust, Seth needs more than help to keep his family together . . . he needs a miracle.And then one arrives on his doorstep. Her name is Mrs. Merkle, but the kids call her “Mrs. Miracle”—and from the moment the warm, knowing, and very patient nanny appears, everything is different. Her sassy spirit is infectious, and it gives Seth the courage to approach Reba, a beautiful travel agent who’s been hurt and betrayed, and is afraid to ever love again. Through the magic of faith—and with a little help from a children’s Christmas pageant and a lot of encouragement from Mrs. Miracle—Seth and Reba might just be able to find a Christmas miracle of their very own: true love.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Japanese Street Slang",
        "Authors": "By Constantine, Peter",
        "Description": "Japanese Street Slang  is the first and only exposé of the rough and ready, raw and down-dirty street language as it is used in Japan today. Here's how they really speak: The hustlers and high rollers, the teens and Tokyo yuppies, the gangsters and their ladies of the night. Witty mini-essays trace the fascinating origins of many expressions and the rollicking example sentences reveal just how and where they may be heard.    WARNING: Many of the expressions featured in this book are extremely potent. Beware of using them inadvertently—mass panic might ensue.",
        "Category": " Foreign Language Study , Japanese",
        "Publisher": "Weatherhill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Anyone But You",
        "Authors": "By Crusie, Jennifer",
        "Description": "For Nina Askew, turning forty means freedom—from the ex-husband, freedom from their stuffy suburban home, freedom to focus on what she wants for a change. And what she wants is something her ex always vetoed—a puppy. A bouncy, adorable puppy. Instead she gets&#133;Fred.Overweight, middle-aged, a bit smelly and obviously depressed, Fred is light-years from perky. But he does manage to put Nina in the path of Alex Moore, her gorgeous, younger-by-a-decade neighbor.Alex seems perfect—he's a sexy, seemingly sane, surprisingly single E.R. doctor—but the age gap convinces Nina that anyone but Alex would be better relationship material. But with every silver-haired stiff she dates, the more she suspects it's the young, dog-loving doc she wants to sit and stay!",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Getting Rid Of Bradley",
        "Authors": "By Crusie, Jennifer",
        "Description": "A rollicking contemporary romance follows Lucy Savage as she goes up against her cheating ex-husband, recovers from a horrid dye job that has left her hair green, and joins forces with sexy cop Zack Warren when someone tries to kill her. Reprint.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Charlie All Night (MIRA)",
        "Authors": "By Crusie, Jennifer",
        "Description": "Dumped and fired, radio producer Allie McGuffey is taking her new project, temporary DJ Charlie Tenniel, with her on her climb to the top, where despite his objections and the fact that he is totally wrong for her, Charlie and Allie fall into success--and into bed. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Over the Edge (Troubleshooters, Book 3)",
        "Authors": "By Brockmann, Suzanne",
        "Description": "Suzanne Brockmann has taken romantic suspense by storm with her action-packed thrillers. Now she has written the most gripping novel of her career–an unforgettable story of an explosive hostage situation in which two people are caught between the call of duty and the lure of destiny.Her passion is flying. As one of the best helicopter pilots in the naval reserves, Lieutenant Teri Howe is strong, dedicated, and highly skilled–until a past mistake surfaces, jeopardizing everything she’s worked for.Rock steady Senior Chief Stan Wolchonok has made a career of tackling difficult challenges. So it’s no surprise when he comes to Teri’s aid, knowing that his personal code of honor–and perhaps his heart–will be at risk. But when a jet carrying an American senator’s daughter is hijacked, Stan’s unflinching determination and Teri’s steadfast courage are put to the ultimate test. The rescue mission will be daring and dangerous. But somewhere between peril and resolution, the line between friends and lovers begins to blur, pushing both their lives over the edge. . . .",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Ivy Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "This Heart of Mine",
        "Authors": "By Phillips, Susan Elizabeth",
        "Description": "New York Times bestselling author Susan Elizabeth Phillips magic is vibrantly alive, and it's on display in This Heart of Mine, the fifth book in her wildly popular Chicago Stars series!Molly Somerville loves her career as the creator of the Daphne the Bunny children's book series, but the rest of her life could use some improvement. She has a reputation for trouble that started even before she gave away her fifteen-million-dollar inheritance. Then there's her long-term crush on the quarterback for the Chicago Stars football team her sister owns—that awful, gorgeous Kevin Tucker, a man who can't even remember Molly's name!One night Kevin barges into Molly's not-quite-perfect life and turns it upside down. Unfortunately, the Ferrari-driving riving, poodle-hating jock isn't as shallow as she wishes he were, and she soon finds herself at a place called Wind Lake. Surrounded by paintbox cottages, including a charming old bed-and-breakfast, Molly and Kevin battle their attraction and each other as they face one of life's most important lessons. Sometimes love hurts, sometimes it makes you mad as hell, and sometimes—if you're lucky—it can heal in a most unexpected way.",
        "Category": " Fiction , Women",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Match Me If You Can (Chicago Stars, 6)",
        "Authors": "By Phillips, Susan Elizabeth",
        "Description": "You met star quarterback Kevin Tucker in This Heart of Mine. Now get ready to meet his shark of an agent, Heath Champion, and Annabelle Granger, the girl least likely to succeed.Annabelle's endured dead-end jobs, a broken engagement . . . even her hair's a mess! But that's going to change now that she's taken over her late grandmother's matchmaking business. All Annabelle has to do is land the Windy City's hottest bachelor as her client, and she'll be the most sought-after matchmaker in town.Why does the wealthy, driven, and gorgeous sports agent Heath Champion need a matchmaker, especially a red-haired screw-up like Annabelle Granger? True, she's entertaining, and she does have a certain quirky appeal. But Heath is searching for the ultimate symbol of success -- the perfect wife. And to make an extraordinary match, he needs an extraordinary matchmaker, right?Soon everyone in Chicago has a stake in the outcome, and a very big question: When the determined matchmaker promised she'd do anything to keep her star client happy . . . did she mean anything? If Annabelle isn't careful, she just might find herself going heart-to-heart with the toughest negotiator in town.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Honey Moon",
        "Authors": "By Phillips, Susan Elizabeth",
        "Description": "Challenged to retain her child star glory into adulthood, passionate Honey Jane Moon changes the destinies of Dash Coogan, who has outgrown his career ambitions, and Eric Dillon, a seductive Hollywood bad boy with a painful secret. Reissue.",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "It Had to Be You (Chicago Stars, 1)",
        "Authors": "By Phillips, Susan Elizabeth",
        "Description": "The Windy City isn’t quite ready for Phoebe Somerville -- the outrageous, curvaceous New York knockout who has just inherited the Chicago Stars football team. And Phoebe is definitely not prepared for the Stars’ head coach Dan Celebow, a sexist jock taskmaster with a one-track mind. Celebow is everything Phoebe abhors. And the sexy new boss is everything Dan despises -- a meddling bimbo who doesn’t know a pigskin from a pitcher’s mound.So why is he drawn to the shameless sexpot like a heat-seeking missile? And why does the coach’s good ol’ boy charm leave cosmopolitan Phoebe feeling awkward, tongue-tied....and ready to fight?The sexy, heartwarming, and hilarious \"prequel\" to New York Times bestselling author Susan Elizabeth Phillips’ This Heart of Mine -- her sensational bestsellng blockbuster -- It Had To Be You is an enchanting story of two stubborn people who believe in playing for keeps.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Jazz Styles: History and Analysis",
        "Authors": "By Gridley, Mark C.",
        "Description": "A text for courses in jazz appreciation, focusing on American instrumental jazz and emphasizing descriptions of jazz styles rather than a decade-by-decade chronicle. Contains chapter summaries, b&w photos, a chronology, guides to jazz albums and videos, and separate appendices on elements of music for musicians and nonmusicians. In this sixth edition chapters begin on the same page numbers as the fifth. Music cassettes/CD-ROMs are available. For high school through college students with no previous knowledge of music. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Music , Genres & Styles , Jazz",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Saving the Tropical Forests",
        "Authors": "By Gradwohl, Judith and Greenberg, Russell",
        "Description": "",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Island Press",
        "Price Starting With ($)": "5.3",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Death by Chocolate: The Last Word on a Consuming Passion",
        "Authors": "By Desaulniers, Marcel and Grand, Michael (PHT)",
        "Description": "This book is about obsession, cravings, and licit indulgences. It is about deliriously delicious, silkily sensuous, soul-stirring chocolate desserts, about Rabelaisian pleasures, and fantasies come true.These seductive cakes, elegant ice creams, lustrous sauces, mouthwatering truffles, divine wafers, and unbelievably satisfying brownies are all from the kitchen of Marcel Desaulniers, a truly inspired chef.At the Trellis Restaurant, in Colonial Williamsburg, Marcel Desaulniers has created a unique and innovative cuisine. One of the joys of the Trellis is its extraordinary desserts: Chocolate Phantasmagoria, White and Dark Chocolate Dacquoise, and Death by Chocolate — to name just a few. The recipes for these and other magnificent desserts are now revealed, detailed with foolproof, step-by-step instructions. Following the author's invaluable advice, the home cook can successfully create even the most elaborate of these chocolate wonders.From a unique Chocolate Chip Cookie that will make all others pale by comparison to Simply the Best Chocolate Brownie, from Ebony and Ivory Chocolate Truffles to White Chocolate Ice Cream, from Double Mocha Madness to a fantastic Chocolate Wedding Cake, the kaleidoscopic glories of Marcel Desaulniers' chocolate repertoire are presented here in full color, each as delightful to make as it is to eat. This is a book for endless pleasure.",
        "Category": " Cooking , Courses & Dishes , Chocolate",
        "Publisher": "Rizzoli",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "The Essential Gardener: Annuals, Perennials, Bulbs, Roses, Trees, Shrubs, Herbs, Vegetables : The Best Plants for Design and Cultivation",
        "Authors": "By Fell, Derek",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "The Divorce Remedy: The Proven 7-Step Program for Saving Your Marriage",
        "Authors": "By Davis, Michele Weiner",
        "Description": "Michele Weiner-Davis offers an empowering and encouraging guide for revitalizing marriage and building stronger, more loving bonds.Michele Weiner-Davis goes beyond her marriage-saving bestseller, Divorce Busting, with this empowering and encouraging guide for revitalizing marriage and building stronger, more loving bonds. In a down-to-earth style that is free of psychobabble, Weiner-Davis outlines a realistic, solution-oriented seven-step program for managing marital problems, which, when left unchecked, can drain the life out of a relationship. Using revealing anecdotes and in-depth case studies, she illustrates practical ways for marriage partners to -avoid the “divorce trap” -identify specific marriage-saving goals -move beyond ineffective, hurtful ways of interacting -become an expert on “doing what works” -overcome infidelity, Internet obsessions, depression, sexual problems, and midlife crises -get your marriage back on track—and keep it there Rescue your marriage with the proven techniques of The Divorce Remedy—sound, sensible advice from a renowned relationship expert!",
        "Category": " Family & Relationships , Divorce & Separation",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Unveiling the DIVA Mystique: Taking Victorious Living to the Next Level (Hammond, Michelle Mckinney)",
        "Authors": "By McKinney Hammond, Michelle",
        "Description": "",
        "Category": " Psychology , Applied Psychology",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Why Jesus Matters: The Eternal Impact of One Extraordinary Life",
        "Authors": "By Bickel, Bruce and Jantz, Stan",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Tentacles!: Tales of the Giant Squid (Step into Reading)",
        "Authors": "By Redmond, Shirley Raye and Barnard, Bryn (ILT)",
        "Description": "For centuries, sailors have handed down stories of the giant squid. They say this mysterious monster of the deep chases ships and battles whales. They say it can weigh up to 1,000 pounds and that its eyes can be as big as a human head! Are these stories fact or fantasy? Find out in this exciting beginning reader.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "The Professor's House",
        "Authors": "By Cather, Willa",
        "Description": "A professor in his middle fifties, forced to face the reality of growing old, finds life has changed too quickly",
        "Category": "",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1973"
        }
    },
    {
        "Title": "Click & Close",
        "Authors": "By Sherry, Jim and Tuccillo, John A.",
        "Description": "",
        "Category": " Business & Economics , Real Estate , General",
        "Publisher": "Dearborn Real Estate Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "A Small Death in Lisbon",
        "Authors": "By Wilson, Robert",
        "Description": "When Inspector Ze Coelho investigates the murder of a young girl living in modern Portugal, he discovers that the crime is somehow linked to Nazi misdeeds six decades earlier in this gritty, suspenseful tale. Winner of the Gold Dagger Award for Best Crime Novel. Reprint.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Berkley Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Peace for a Woman's Soul",
        "Authors": "By Zondervan Publishing",
        "Description": "In a world that is so uncertain, peace is something we all need. God has promised us his peace that is beyond anything we could imagine. Explore the path to that peace through the inspirational writings of Patsy Clairmont, Marilyn Meberg, Luci Swindoll, Thelma Wells, Barbara Johnson and Sheila Walsh in this beautiful gift book.",
        "Category": " Religion , Inspirational",
        "Publisher": "Inspirio",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "The Secret of Loving",
        "Authors": "By McDowell, Josh",
        "Description": "McDowell explores the values and qualities that will help the reader, whether single or married, be the right person for someone else.",
        "Category": " Religion , Christian Life , Relationships",
        "Publisher": "Tyndale House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Breakwater (Cold Ridge, 5)",
        "Authors": "By Neggers, Carla",
        "Description": "When Alicia Morrow, a former co-worker at the U.S. Department of Justice, is found dead outside of her bayside cottage, Quinn Harlow, while investigating on her own, finds an ally in Huck McCabe, an undercover agent who is after the same people who murdered her friend. Original.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Godfather Returns: A Novel",
        "Authors": "By Winegardner, Mark and Puzo, Mario",
        "Description": "THE MISSING YEARS FROM THE GREATEST CRIME SAGA OF ALL TIMEThirty-five years ago, Mario Puzo’s great American tale, The Godfather, was published, and popular culture was indelibly changed. Now, in The Godfather Returns, acclaimed novelist Mark Winegardner continues the story–the years not covered in Puzo’s bestselling book or in Francis Ford Coppola’s classic films. It is 1955. Michael Corleone has won a bloody victory in the war among New York’s crime families. Now he wants to consolidate his power, save his marriage, and take his family into legitimate businesses. To do so, he must confront his most dangerous adversary yet, Nick Geraci, a former boxer who worked his way through law school as a Corleone street enforcer, and who is every bit as deadly and cunning as Michael. Their personal cold war will run from 1955 to 1962, exerting immense influence on the lives of America’s most powerful criminals and their loved ones, including Tom Hagen, the Corleone Family’s lawyer and consigliere, who embarks on a political career in Nevada while trying to protect his brother;Francesca Corleone, daughter of Michael’s late brother Sonny, who is suddenly learning her family’s true history and faces a difficult choice;Don Louie Russo, head of the Chicago mob, who plays dumb but has wily ambitions for muscling in on the Corleones’ territory;Peter Clemenza, the stalwart Corleone underboss, who knows more Family secrets than almost anyone;Ambassador M. Corbett Shea, a former Prohibition-era bootlegger and business ally of the Corleones’, who wants to get his son elected to the presidency–and needs some help from his old friends;Johnny Fontane, the world’s greatest saloon singer, who ascends to new heights as a recording artist, cozying up to Washington’s power elite and maintaining a precarious relationship with notorious underworld figures;Kay Adams Corleone, who finally discovers the truth about her husband, Michael–and must decide what it means for their marriage and their children andFredo Corleone, whose death has never been fully explained until now, and whose betrayal of the Family was part of a larger and more sinister chain of events.Sweeping from New York and Washington to Las Vegas and Cuba, The Godfather Returns is the spellbinding story of America’s criminal underworld at mid-century and its intersection with the political, legal, and entertainment empires. Mark Winegardner brings an original voice and vision to Mario Puzo’s mythic characters while creating several equally unforgettable characters of his own. The Godfather Returns stands on its own as a triumph–in a tale about what we love, yearn for, and sometimes have reason to fear . . . family.From the Hardcover edition.",
        "Category": " Fiction , Sagas",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Business of Graphic Design, 1st Edition",
        "Authors": "By Gold, Ed",
        "Description": "A survey of the graphic design business discusses its role in the American economy, the characteristics of successful graphic design businesses, management, finance, promotion, and other important topics",
        "Category": " Art , General",
        "Publisher": "Watson-Guptill",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "First Day Of School - Pbk (Giant First Start Reader)",
        "Authors": "By Goodman, Joan E. (ILT) and Jackson, Kim",
        "Description": "Beginning readers will enjoy this tale of Cindy, a little girl who finds that her misgivings about the first day of school are totally unfounded",
        "Category": "",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Encyclopedia of Southern Culture",
        "Authors": "By Wilson, Charles Reagan and Ferris, William",
        "Description": "The American South is a geographical entity, a historical fact, a place in the imagination, and the homeland of an array of Americans who consider themselves southerners.  The region is often shrouded in romance and myth, but its realities are as intriguing, as intricate, as its legends.The Encyclopedia of Southern Culture is \"the first attempt ever\" notes U.S. News & World Report, \"to describe every aspect of a region's life and thought, the impact of its history and policies, its music and literature, its manners and myths, even the iced tea that washes down its catfish and cornbread.\"There are many Souths, many southerners.  The region's fundamental uniqueness, in fact, lies in its peculiar combination of cultural traits, a somewhat curious, often elusive blend created by blacks and whites who have lived together for more than 300 years.  In telling their stories, the Encyclopedia of Southern Culture ranges from grand historical themes to the whimsical; from the arts and high culture (William Faulkner and Leontyne Price) to folk culture (quilts, banjos, and grits) to popular culture (Gilley's and Gone With the Wind).The Encyclopedia's definition of the South is a cultural one: the South is found wherever southern culture is found.  Although the focus is on the eleven states of the former Confederacy, this volume also encompasses southern outposts in midwestern and middle-Atlantic border states, even the southern pockets of Chicago, Detroit, and Bakersfield.To foster a deeper understanding of the South's cultural patterns, the editors have organized this reference book around twenty-four thematic sections, including history, religion, folklore, language, art and architecture, recreation, politics, the mythic South, urbanization, literature, music, violence, law, and media.  The life experiences of southerners are discussed in sections on black life, ethnic life, and women's life.  Throughout, the broad goal is to identify the forces that have supported either the reality or the illusion of the southern way of life -- people, places, ideas, institutions, events, symbols, rituals, and values.The Encyclopedia of Southern Culture was developed by the Center for the Study of Southern Culture at the University of Mississippi. Contributors to the volume include historians, literary critics, sociologists, anthropologists, geographers, linguists, theologians, folklorists, architects, ecologists, lawyers, university presidents, newspaper reporters, magazine writers, and novelists.",
        "Category": " Reference , Encyclopedias",
        "Publisher": "The University of North Carolina Press",
        "Price Starting With ($)": "36.61",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "God Bless America",
        "Authors": "By Johnson, Susan, Matuszak, Pat",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "What Is God Like",
        "Authors": "By Erickson, Mary E. and Nelson, Anita C. (ILT)",
        "Description": "Uses Bible verses describing God to explain His many attributes and how He cares for us.",
        "Category": " Religion , General",
        "Publisher": "Chariot Family Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "I Love My Daddy Because...",
        "Authors": "By Wolff, Ashley (ILT) and Porter-Gaylord, Laurel",
        "Description": "Endearing illustrations and simple phrases combine in a book that shows how animal fathers care for their babies with the same tender love as human fathers do, and the line, \"He sings me songs,\" shows a gray wolf crooning to his cub.",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "Dutton Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Crabby Road: More Thoughts on Life From Maxine (A Shoebox Greetings Book)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Hallmark Cards, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Nativity",
        "Authors": "By Wijngaard, Juan (EDT) and Wungaard, Juan (ILT)",
        "Description": "The King James version of the biblical story of how a brightly shining star guided three wise men of the east to Bethlehem, where the infant Jesus lay cradled in a manger",
        "Category": " Juvenile Nonfiction , Religion , General",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Let's Go Rock Collecting (Let'S-Read-And-Find-Out Science. Stage 2)",
        "Authors": "By Keller, Holly (ILT) and Gans, Roma",
        "Description": "Holly Keller has created vivacious new paintings for this favorite Reading Rainbow title about geology. Readers follow two enthusiastic rock hounds around the globe as they add to their collection. Along the way they will learn how sedimentary, metamorphic, and igneous rocks are formed. From the Egyptian pyramids to Roman roads, from the diamond ring on your finger to the pebbles under your feet'rocks are everywhere!",
        "Category": " Juvenile Nonfiction , Science & Nature , Earth Sciences , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Heartland Cooking Crockery Favorites:  Traditional American Recipes",
        "Authors": "By Giedt, Frances Towner",
        "Description": "Inspired by the rich culinary traditions of America's heartland, a mouthwatering collection of one hundred delectable recipes for robust dishes includes such specialties as Stuffed Cabbage Rolls, Winter Vegetable Soup, and Roasted Turkey Breast Stuffed with Herbs.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "The Rage of Innocence: A Novel",
        "Authors": "By Pease, William D.",
        "Description": "An attractive and highly intelligent police detective, Christine Boland, forms the brilliant centerpiece of William D. Pease's explosive novel of psychological suspense. Detective Boland is assigned to investigate the death of socialite Marian Avery, whose body is found in her grand house in fashionable southern Maryland. Beside her sits the Averys' ten-year-old son, Ned, huddled in a silent, shock-induced world of his own that no one is able to penetrate. The murder confounds Boland and her fellow detectives. The evidence of burglary seems only to be a cover-up to confuse the police. Why, Christine wonders, would anyone want to kill Marian Avery?Soon Marian's husband, Cooper Avery, son of a former Maryland congressman, becomes the chief suspect when he gives the police a false story of his whereabouts at the time of the murder. Almost without trying, the police also uncover a motive: money. The police learn that Avery, the president of his wife's family's multimillion-dollar business, Thurston Construction, was having an affair. His lover was a woman executive at the company trying to take over Thurston. Marian's father, Ed Thurston, was fighting the takeover but Avery would make tens of millions if it happened. Avery controls Marian's shares but her father has been urging her to get them back. But if Marian were dead... The evidence mounts and Avery is indicted.All of Christine's colleagues believe that Avery is the killer, but Christine thinks they are just eager to solve a high-profile case. Certain that they are wrong, and powerless to stop the case from going forward, Christine steps over the line, and when she does she finds her own life and her passionate affair with the sculptor Alex Trigorin being drawn into the vortex. Working alone and against time, Detective Boland painstakingly uncovers long-buried Avery family secrets, finding clues from other times and other places, from the red-baiting of the McCarthy era to the tragic life of a small child growing up in Strasbourg, France.The novel's finale, the trial of Cooper Avery with its compelling and authentic courtroom scenes and the unpredictable revelations that follow, is certain to hold you in its spellbinding power.William D. Pease, whose first novel, Playing the Dozens, had Nelson DeMille comparing him to \"Dashiell Hammett at his best,\" continues brilliantly in the footsteps of Hammett in this intricate and irresistible second novel.",
        "Category": " Fiction , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Trivia Mania: Science and Nature",
        "Authors": "By Einstein, Xavier",
        "Description": "Offers a thousand questions and answers about medicine, biology, chemistry, geology, astronomy, computer science, and physics",
        "Category": " Games , Trivia",
        "Publisher": "Zebra Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1984"
        }
    },
    {
        "Title": "The Little Lady Agency",
        "Authors": "By Browne, Hester",
        "Description": "Hilarious and warmhearted, this \"deliciously addictive\" (Cosmopolitan) debut romantic comedy stars a woman who goes from doormat to diva when she sets up shop as the ultimate freelance girlfriend.    Melissa Romney-Jones can bake a perfect sponge cake, type her little heart out, and plan a party blindfolded. But none of that has helped her get far in life or in love. When she gets fired -- again -- she decides to market her impeccable social skills to single men. To avoid embarrassing her father, a Member of Parliament, Melissa dons a blond wig and becomes Honey, a no-nonsense bombshell who helps clueless bachelors shop, entertain, and navigate social minefields. She even attends parties if a client needs a \"date.\" But when a dashing American starts to request Honey's services on a regular basis, it's only a matter of time before Honey's and Melissa's worlds collide....",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Great Source Writer's Express: Student Edition  Grade 4 Handbook (hardcover) 2000",
        "Authors": "By Sebranek, Patrick, Nathan, Ruth, Krenzke, Chris (ILT), Kemper, Dave (EDT), and Krevzke, Chris (ILT)",
        "Description": "Covers the process of writing, forms of expression, research tools, proof reading, editing, and grammar.",
        "Category": " Juvenile Nonfiction , Language Arts , Composition & Creative Writing",
        "Publisher": "Great Source",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "HOODLUM EMPIRE  the Survival of the Syndicate",
        "Authors": "By Richard Hammer",
        "Description": "",
        "Category": "",
        "Publisher": "Playboy Press",
        "Price Starting With ($)": "14.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Secret Garden (Treasury of Illustrated Classics)",
        "Authors": "By Burnett, Frances Hodgson (EDT)",
        "Description": "Ten-year-old Mary comes to live in a lonely house on the Yorkshire moors and discovers an invalid cousin and the mysteries of a locked garden.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Modern Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Good Peoples",
        "Authors": "By Major, Marcus",
        "Description": "In this debut novel, Marcus Major exposes the flip side of the dating game, as a professional black male ready for love and commitment pursues an independent woman who has walked off with his heart. Set in a suburb of Philadelphia, Good Peoples peels back the bravado of brotherhood to reveal the delicate line a man must walk between sensitivity and weakness, strength and machismo, pride and defiance.",
        "Category": " Fiction , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "1,001 Gardening Secrets (The Experts Never Tell You) (2004-05-03)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "FC&A",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Bech at Bay: A Quasi-Novel (Quasi-Novels)",
        "Authors": "By Updike, John",
        "Description": "Henry Bech, the moderately well known Jewish-American writer who served as the hero of John Updike's previous Bech: A Book (1970) and Bech Is Back (1982), has become older but scarcely wiser. In these five new chapters from his life, he is still at bay, pursued by the hounds of desire and anxiety, of unbridled criticism and publicity in a literary world ever more cheerfully crass. He fights intimations of annihilation in still-Communist Czechoslovakia, while promiscuously consorting with dissidents, apparatchiks, and Midwestern Republicans. Next, he succumbs to the temptations of power by accepting the presidency of a quaint and cosseted honorary body patterned on the Académie Française. Then, the reader finds him on trial in California and on a criminal rampage in a gothic Gotham, abetted by a nubile sidekick called Robin. Lastly, our septuagenarian veteran of the literary wars is rewarded with a coveted medal, stunning him into a well-deserved silence. It's not easy being Henry Bech in the post-Gutenbergian world, but somebody has to do it, and he brings to the task an indomitable mixture of grit and ennui.",
        "Category": " Fiction , Literary",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Seeking the Heart of Wisdom: The Path of Insight Meditation (Shambhala dragon editions)",
        "Authors": "By Kornfield, Jack and Goldstein, Joseph",
        "Description": "The path of insight meditation is a journey of understanding our bodies,  our minds, and our lives, of seeing clearly the true nature of experience. For those who are treading this path, as well as those just starting out, Seeking the Heart of Wisdom will be a welcome companion along the way. Born out of the authors' twelve- year collaboration in teaching  intensive meditation retreats throughout the world, it guides the reader in developing the openness and compassion that are at the heart of this spiritual practice.  Among the topics covered are:   - The hindrances to meditation—ranging from doubt and fear to painful  knees—and skillful means of overcoming them   - How compassion can arise in response to the suffering we see in our own lives and in the world   - How to integrate a life of responsible action and service with a meditative life based on nonattachment   - The law of karma and how it enables us to actively create our reality   These and other discussions are accompanied by specific exercises and practices to help readers deepen their understanding of the subjects.",
        "Category": " Religion , Buddhism , General",
        "Publisher": "Shambhala",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "Petrified Fact: Stories of Bizarre Behavior That Really Happened, Mostly",
        "Authors": "By Rowland Tim",
        "Description": "",
        "Category": "",
        "Publisher": "High Peaks Publishing",
        "Price Starting With ($)": "5.73",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Life Expectancy",
        "Authors": "By Koontz, Dean R.",
        "Description": "With his bestselling blend of nail-biting intensity, daring artistry, and storytelling magic, Dean Koontz returns with an emotional roller coaster of a tale filled with enough twists, turns, shocks, and surprises for ten ordinary novels. Here is the story of five days in the life of an ordinary man born to an extraordinary legacy—a story that will challenge the way you look at good and evil, life and death, and everything in between.Jimmy Tock comes into the world on the very night his grandfather leaves it. As a violent storm rages outside the hospital, Rudy Tock spends long hours walking the corridors between the expectant fathers' waiting room and his dying father's bedside. It's a strange vigil made all the stranger when, at the very height of the storm's fury, Josef Tock suddenly sits up in bed and speaks coherently for the frist and last time since his stroke.What he says before he dies is that there will be five dark days in the life of his grandson—five dates whose terrible events Jimmy will have to prepare himself to face. The first is to occur in his twentieth year; the second in his twent-third year; the third in his twenty-eighth; the fourth in his twenty-ninth; the fifth in his thirtieth.Rudy is all too ready to discount his father's last words as a dying man's delusional rambling. But then he discovers that Josef also predicted the time of his grandson's birth to the minute, as well as his exact height and weight, and the fact that Jimmy would be born with syndactyly—the unexplained anomal of fused digits—on his left foot. Suddenly the old man's predictions take on a chilling significance.What terrifying events await Jimmy on these five dark days? What nightmares will he face? What challenges must he survive? As the novel unfolds, picking up Jimmy's story at each of these crisis points, the path he must follow will defy every expectation. And with each crisis he faces, he will move closer to a fate he could never have imagined. For who Jimmy Tock is and what he must accomplish on the five days when his world turns is a mystery as dangerous as it is wondrous—a struggle against an evil so dark and pervasive, only the most extraordinary of human spirits can shine through.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "London Bridges (Alex Cross, 10)",
        "Authors": "By Patterson, James",
        "Description": "Alex Cross must face the world's most dangerous agents, criminals, and assassins. The fate of the world rests in his hands.In broad desert daylight, a mysterious platoon of soldiers evacuates the entire population of Sunrise Valley, Nevada. Minutes later, a huge bomb detonates a hundred feet above the ground and lays waste to homes, cars, and playgrounds: a town annihilated in an instant. The Russian supercriminal known as the Wolf claims responsibility for the blast.Alex Cross is on vacation in San Francisco with his girlfriend, Jamilla Hughes, when he gets the call. World leaders have just four days to prevent an unimaginable cataclysm. Racing down the hairpin turns of the Riviera in the most unforgettable finale James Patterson has ever written, he confronts the truth of the Wolf's identity, a revelation that even Cross himself may be unable to survive.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Vision",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Taking the Stand: The Testimony of Lieutenant Colonel Oliver L. North",
        "Authors": "By North, Oliver L. and Schorr, Daniel (EDT)",
        "Description": "Includes complete testimony of Lieutenant-Colonel Oliver L. North before the Select Committee of the House and Senate on July 7-14, 1987",
        "Category": "",
        "Publisher": "POCKET",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "The National Society of Film Critics on Movie Comedy",
        "Authors": "By Byron, Stuart and Weis, Elisabeth",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "7.47",
        "Publish Date": {
            "Month": "December",
            "Year": "1977"
        }
    },
    {
        "Title": "American Memoir",
        "Authors": "By John W. Dodds",
        "Description": "",
        "Category": "",
        "Publisher": "Popular Library,",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "The Virginal Conception and Bodily Resurrection of Jesus",
        "Authors": "By Brown, Raymond E.",
        "Description": "A noted Catholic scholar offers biblical evidence that challenges the historicity of the Church's most cherished beliefs",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Paulist Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Scrolls From the Dead Sea 1993 Paperback Edition",
        "Authors": "By Sussmann, Ayala and Peled, Ruth",
        "Description": "Issued in conjunction with an exhibition organized by the Library of Congress, this catalog brings together 12 of the best-preserved and least-known Dead Sea Scrolls in color photographs, Hebrew transcriptions, and English translations as well as a hundred related artifacts excavated at Qumran, the nearby archaeological site whose inhabitants may have produced the scrolls. Interpretive essays provide the historical background of the scrolls as they explore the translated texts and the various theories about the Qumran community. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Religion , Biblical Criticism & Interpretation , Old Testament",
        "Publisher": "Archetype Press, Inc.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Trivia Mania: Movies",
        "Authors": "By Einstein, Xavier",
        "Description": "Over one thousand little-known facts about movies, actors and actresses, and moviemakers are compiled in this quiz for trivia buffs and Trivial Pursuit players",
        "Category": " Games , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1984"
        }
    },
    {
        "Title": "Webster's New World dictionary of computer terms",
        "Authors": "By Merriam-Webster, Webster's",
        "Description": "Defines terms and concepts related to computers, programming, telecommunications, electronics, and information science",
        "Category": "",
        "Publisher": "Webster's New World",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "From Learning to Earning: Yahoo! HotJobs Success Strategies for New Grads (HotJobs Career Advisors)",
        "Authors": "By Finnigan, Dan and Karasu, Marc",
        "Description": "Yahoo! HotJobs is the online destination for more than four million job seekers and hiring companies each month. Now, for the first time, the experts at Yahoo! HotJobs share their job-hunting expertise in this must-have book for new grads. This authoritative guide steers new job seekers toward fulfilling careers—and prepares them for the inevitable obstacles ahead. Included are surefire strategies for finding entry-level positions, as well as tips for transforming their limited experience into winning resumes, acing the interview, negotiating, and successfully transitioning into the working world. With hot tips from America’s top business leaders, recruiter cheat sheets, and useful exercises, From Learning to Earning will take readers from zero experience to the experience of a lifetime.Dan Finnigan is Executive Vice President and General Manager of Yahoo! HotJobs. Marc Karasu is Senior Vice President of Marketing. Yahoo! is the No. 1 Internet brand globally and the most trafficked Internet destination worldwide.",
        "Category": " Business & Economics , Careers , Job Hunting",
        "Publisher": "Sterling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Getting Burned (Nancy Drew All New Girl Detective #20)",
        "Authors": "By Keene, Carolyn",
        "Description": "When the animal shelter where Nancy volunteers mysteriously burns down, Nancy and her friends decide to raise money to rebuild it by organizing a rock concert, but somebody keeps trying to foil their plans.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Jacques Pepin's Table: The Complete Today's Gourmet",
        "Authors": "By Pepin, Jacques",
        "Description": "Low on drudgery, high on joie de vivre, Jacques Pepin's Table showcases Pepin's inimitable cooking and teaching style, presenting more than three hundred recipes from all three seasons of the popular Today's Gourmet series, along with complete menu and wine suggestions, and more than a hundred instructional tips and techniques on everything from butterflying chicken breasts or peeling asparagus to freezing and then baking a souffle. A nutritional analysis is provided for each dish, as are comments on the nutritional value of various ingredients. Gorgeous food photography and hundreds of Pepin's own delightful drawings are interspersed.",
        "Category": " Performing Arts , Television , General",
        "Publisher": "KQED Books",
        "Price Starting With ($)": "14.92",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "WHATEVER BECAME OF ...? All New Eleventh Series: 100 Profiles of the Most-Asked-About Movie, TV, and Media Personalities. Hundred s of ... Dates, etc., on Celebrities. 227 Then-and-no",
        "Authors": "By Lamparski, Richard",
        "Description": "",
        "Category": " Reference , General",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Sweeter Than the Rose (Christmas Remembered, Book 7)",
        "Authors": "By Childs, Anne Van Wagner (EDT)",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "New York Cabbie Cookbook",
        "Authors": "By Garrison, Holly, Winston, Ellen Mary, and Winston, Mary Ellen",
        "Description": "Hailing from lands far and wide, New York City cab drivers are as unique and diverse as the city itself. Mixing local color with global flavor, The New York Cabbie Cookbook is an international melting pot of favorite homeland recipes, liberally spiced with insider tips and observations about life behind the steering wheel from the drivers who contributed them. Included are 120 hearty recipes, from more than 25 countries, for such international dishes as Russian Appetizer Salad, Moroccan Chicken Pie, Senegalese Beef Stew, Arroz con Pollo, Polish Potato Pancakes, Colombian Black Cake, Irish Lamb Stew, Dim Sum, Moussaka, and Paella. From Pakistan to Greece, from Moscow to Hong Kong, get a taste of what New York's unofficial ambassadors are serving up.",
        "Category": " Cooking , Regional & Ethnic , General",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Marathoning for Mortals: A Regular Person's Guide to the Joy of Running or Walking a Half-Marathon or Marathon",
        "Authors": "By Bingham, John and Hadfield, Jenny",
        "Description": "Once considered a feat for superhuman athletes, the marathon is now within every mortal's grasp. Former couch potato John Bingham has joined forces with coach Jenny Hadfield to create a winning plan that works for every mortal--even you.In Marathoning for Mortals, you'll find the courage to train, the willpower to persevere, and the tenacity to finish one mile after another. John and Jenny stick with you every step of the way, from your first insecure thoughts to your last-minute jitters to your supreme joy at the finish line. In Marathoning for Mortals, you'll find:8 training programs to run, run-walk, walk-run, or walk the half-marathon and marathonThe advice you need to physically, mentally, and spiritually reach your dreamsTips to help you customize your training, buy the right shoes and apparel, and eat the best foodsGuidance for common motivational, physical, and emotional roadblocksJoin John and Jenny on an amazing transformative journey where the finish line is just the beginning.",
        "Category": " Sports & Recreation , Running & Jogging",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Lose Weight the Smart Low-Carb Way: 200 High-Flavor Recipes and a 7-Step Plan to Stay Slim Forever",
        "Authors": "By Newman, Bettina",
        "Description": "From Atkins to The South Beach Diet, low-carb diets have taken the country by storm. But many require that you give up virtually all carbohydrates--even healthy foods like fruits, vegetables, and whole grains.Breakthrough research into how and why low-carb diets work convinced dietitian Bettina Newman that limiting the intake of carbohydrates can lead to safe, healthy weight loss--if it's done right. Teaming up with Prevention, America's premier health magazine, she developed a moderate, nutritionally sound low-carb approach to weight loss.Here she offers her simple, seven-step plan for shedding pounds the smart, healthy low-carb way--along with 200 low-carb recipes for such great-tasting dishes as Whole Grain Pancakes with Berry Cream Syrup, Pesto Chicken Sandwich with Roasted Peppers, Slivered Pork with Vegetables and Pasta, and Cantaloupe Sorbet, everything from snacks, soups, and sandwiches to main-course dishes, easy one-dish dinners, and even desserts!",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Chesapeake Bay Cooking: The Companion Cookbook to the Public Television Series",
        "Authors": "By Bell, Harriet (EDT) and Shields, John",
        "Description": "Loosen your belts and get ready to chow down on a pile of steamed blue crabs, dine on a Maryland plantation-style feast, or graze through the stalls of Baltimore's Cross Street Market with television host and \"Culinary Ambassador of the Bay,\" John Shields.  In this companion cookbook to the 26-part public television series, take a delicious tour with Shields along the Chesapeake's 4,600 miles of pristine coastline and through the bountiful farmlands of Delaware, Maryland, and Virginia.In Chesapeake Bay Cooking with John Shields, you will learn how to prepare 190 recipes from this mid-Atlantic region's culinary fare, including rockfish and gumbos, duck and Maryland fried chicken, beaten biscuits and the famous Lady Baltimore cake.  Best of all, you'll learn everything you need to know about the undisputed star of Chesapeake cuisine--crabs. Shields's book includes plenty of helpful crabformation--how to buy, cook, hammer, and eat blue crabs, why you never eat the \"devil,\" and how to tell the difference between \"jimmies\" (male crabs) and \"sooks\" (female crabs).With John Shields as your guide, drop in on the locals, who, for generations, have made this region one of the most popular destinations on the East Coast. Visit Crisfield, home to the Miss Crustacean beauty pageant, where you can sample the crispy, sweet, fried soft-shell crabs. Don't miss the rambunctious two-day chicken festival on the Delmarva Peninsula, where \"there's a whole lot of frying chicken going on.\"  And, since Shields always loves a party, you'll join the Biddlecomb family for a real Virginia-style Fourth of July, where the menu includes Miss Lorraine's Barbecued Chicken, Lady Liberty Seafood Salad, and Pickled Watermelon Rind.  And you can't leave Baltimore without visiting Little Italy to share a meal of Rockfish Braised in Gravy with home cook Carmella Sartori.Here are satisfying foods, easy-to-prepare recipes, and the people who've kept Chesapeake cuisine cooking for centuries--all brought home to you by the region's favorite son, John Shields.",
        "Category": " Cooking , Regional & Ethnic , American , Middle Atlantic States",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "How Would You Move Mount Fuji? Microsoft's Cult of the Puzzle - How the World's Smartest Company Selects the Most Creative Thinkers",
        "Authors": "By Poundstone, William",
        "Description": "For the first time, William Poundstone reveals the toughest questions used at Microsoft and other Fortune 500 companies - and supplies the answers. He traces the rise and controversial fall of employer-mandated IQ tests, the peculiar obsessions of Bill Gates (who plays jigsaw puzzles as a competitive sport), the sadistic mind games of Wall Street (which reportedly led one job seeker to smash a forty-third-story window), and the bizarre excesses of today's hiring managers (who may start off an interview with a box of Legos or a game of virtual Russian roulette).",
        "Category": " Business & Economics , Careers , General",
        "Publisher": "Little, Brown, and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Jimmy the Wags: Street Stories of a Private Eye",
        "Authors": "By Wagner, James and Picciarelli, Patrick",
        "Description": "After twenty-two years as a New York cop, Jimmy the Wags thought he's seen it all, but it wasn't until he retired and set up as a private eye that his real education began.  Now, in his own inimitable voice, he tells a true-life story with all the action, adventure, and atmosphere of Wiseguy or Serpico -- a colorful cautionary tale that reads like fiction.His first private job was to bodyguard a gaggle of Saudi princes and right away Wags was on a roll: debt collections, a blackmail case, and a divorce surveillance that gives new meaning to the phrase \"man's best friend\"; movie stars, private jets, car chases, even a helicopter getaway under fire during an international child custody kidnapping. As the stories pile up, the money gets better and the players get bigger...until he settles in as security chief of an upscale strip club and suddenly finds himself trapped between the Mafia and a psychotic enforcer for the Russian mob.An up-close-and-personal look at a world we rarely see, from an honest-to-God character whose walk on the wild side ended up on the wrong side of the law.",
        "Category": " Social Science , General",
        "Publisher": "William Morrow and Company, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Weight Watchers Light & Easy Cookbook",
        "Authors": "By Weight Watchers",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Cities Back from the Edge: New Life for Downtown (Automation)",
        "Authors": "By Gratz, Roberta Brandes and Mintz, Norman",
        "Description": "\"A love song for the city . . . [this] volume, attractivelypackaged and richly illustrated, is really a cookbook for downtownrevitalization.\" --Wall Street Journal  In this pioneering book on successful urban recovery, two urbanexperts draw on their firsthand observations of downtown changeacross the country to identify a flexible, effective approach tourban rejuvenation. From transportation planning and sprawlcontainment to the threat of superstore retailers, they address ahost of key issues facing our cities today.  Roberta Brandes Gratz (New York, NY), an award-winning journalistand urban critic, is author of the urban design classic The LivingCity. A former staff reporter for the New York Post, Gratz haswritten for the New York Times Magazine and other publications.Norman Mintz (New York, NY) has played a leading role in the fieldof downtown revitalization for more than twenty-five years. He isDesign Director at the 34th Street Partnership in New York City anda consultant on downtown revitalization across the country.",
        "Category": " Political Science , Public Policy , City Planning & Urban Development",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Shattered Mirrors: Our Search for Identity and Community in the AIDS Era",
        "Authors": "By Price, Monroe E.",
        "Description": "Looks at the impact AIDS is having on American consciousness, eroding some traditional barriers while enlarging others, and examines the challenges to public health and government's role in the crisis.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Memories of Times Past",
        "Authors": "By Burke, Nichelle",
        "Description": "",
        "Category": " History , United States , General",
        "Publisher": "Ideals Childrens Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Movie Book: The 1930's",
        "Authors": "By Brockman, Alfred",
        "Description": "More than 5000 photographs show the year-by-year review of the movies of the 1930s",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "12.06",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "The Official James Bond 007 Movie Book",
        "Authors": "By Hibbin, Sally",
        "Description": "Describes the production and plot of each James Bond film from \"Dr. No\" to \"The Living Daylights,\" with additional details on 007's women, colleagues, adversaries, and his ingenious gadgets and weaponry",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "The Busby Berkeley book",
        "Authors": "By Tony Thomas",
        "Description": "",
        "Category": "",
        "Publisher": "A & W Visual Library",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "To The Storm: The Odyssey of a Revolutionary Chinese Woman",
        "Authors": "By Daiyun, Yue and Wakeman, Carolyn",
        "Description": "To the Storm by Yue Daiyun and Carolyn Wakeman is the fascinating story of Yue Daiyun, a faculty member at Beijing University. Yue Daiyun was a revolutionary from her early school days. She had been a child during the anti-Japanese war and hated the Guomundang. Accepted as a student at Beida in 1948, she joined the Communist Party&#39;s underground Democratic youth League and became a Party member the following year and helped with the Liberation of Beijing. While a student at Beida, she served as a delegate at the Prague 2nd World Student Congress in 1950 and worked in the countryside on land reform in 1951-52. Then she graduated from Beida and became a faculty member in the literature department. She married her husband, Lao Tang, the day after their graduation. He obtained a faculty position in the philosophy department. Both were loyal to Chairman Mao and the goals of the Revolution. Their lives went smoothly for several years until 1958. Yue Daiyun taught Chinese literature and took part in many activities on campus. She read many Western books and supported the formation of a new literary magazine on campus. This eventually brought her into conflict with the authorities and the beginning of two decades of problems and persecution for her and her family. The Party had encouraged openness and criticism of its mistakes and deficiencies in the system. Yue Daiyun had taken part in the discussions, believing that she was helping to build a better China. Summoned to a meeting at her department one day, she was denounced as a rightist. She did not understand what she did wrong, but she was quickly relieved of her teaching duties and sent to the countryside to work and live with the peasants for two years. This was the first of her suspensions from teaching. Both Yue Daiyun and her husband, Lao Tang, were caught up in the persecution and violence of the Cultural Revolution. They had spent two years at a cadre school in Liyouhoz and when they returned to Beijing, Lao Tang was selected to work on a special task force called Liang Xaio. This brought Lao Tang and the group into close association with Jiang Qing and the Gang of Four. When the Gang of Four was arrested, Lao Tang suffered through a year long investigation before being cleared. Throughout this time their family suffered from the persecution of others. In the end, the authorities admitted that they were wrong in their case against her and reinstated her Party membership. In this interesting autobiography, Yue Daiyun tells her story of the life she and her family lived during these somewhat violent and terror-filled years in China.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "Beyond Bullet Points: Using Microsoft PowerPoint to Create Presentations That Inform, Motivate, and Inspire (Bpg-Other)",
        "Authors": "By Atkinson, Cliff",
        "Description": "Unload those boring, bullet-riddled slides—and unlock the amazing story buried in your presentation! In BEYOND BULLET POINTS, communications expert Cliff Atkinson shares his innovative three-step system for increasing the impact of your communications with Microsoft PowerPoint. He guides you, step by step, as you discover how to combine the tenets of classic storytelling with the power of the projected media to create a rich, engaging experience. He walks you through his easy-to-use templates, plus 50 advanced tips, to help build your confidence and effectiveness—and quickly bring your ideas to life!FOCUS: Learn how to distill your best ideas into a crisp and compelling narrative. CLARIFY: Use a storyboard to clarify and visualize your ideas, creating the right blend of message and media.ENGAGE:Move from merely reading your slides to creating a rich, connected experience with your audience—and increase your impact!Inside!: See sample storyboards for a variety of presentation types—including investment, sales, educational, and training.",
        "Category": " Computers , Desktop Applications , Presentation Software",
        "Publisher": "Microsoft Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Lucy's Adventure: The Quest for Aslan, the Great Lion (Narnia)",
        "Authors": "By Flexer, Michael",
        "Description": "C.S. Lewis's The Lion, The Witch and The Wardrobe has been a fantasy classic for more than fifty years and is now a major motion picture!At first Lucy Pevensie is sad when she is sent with her sister and brothers to the countryside to escape the dangers of wartime London. But when they arrive, something wonderful happens: A game of hide-and-seek turns into the adventure of a lifetime! In the magical land of Narnia, Lucy and her brothers and sister meet Aslan, the Great Lion, who calls them to fulfill their destiny -- free Narnia from the evil White Witch!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "HarperCollins Narnia",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Hugs for Grandma: Stories, Sayings, and Scriptures to Encourage and Inspire the Heart",
        "Authors": "By Weiss, Leann and Howard, Chrys",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Howard Publishing",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The New York times at the movies",
        "Authors": "By Keylin",
        "Description": "",
        "Category": "",
        "Publisher": "Arno Press",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Meat Classics (Anne Willan's Look & Cook)",
        "Authors": "By Willan, Anne",
        "Description": "Provides simple illustrated instructions for a round-the-world tour of meat dishes, from such American favorites as chili and barbecued steak through continental classics like carpaccio and pot-au-feu. 40,000 first printing.",
        "Category": " Cooking , Specific Ingredients , Meat",
        "Publisher": "Dk Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Look & Cook Chicken Classics: The Ultimate Step-By-Step Guide to Mastering Today's Cooking- with Success Every Time!",
        "Authors": "By Willan, Anne",
        "Description": "Hands-on culinary instruction, preparation tips, and hundreds of close-up, step-by-step photographs accompany a collection of more than fifty delectable recipes for chicken.",
        "Category": " Cooking , Specific Ingredients , Poultry",
        "Publisher": "Dorling Kindersley Inc.",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Look & Cook: Italian Country Cooking- The Ultimate Step-By-Step Guide to Mastering Today's Cooking with Success Every Time! (Anne Willan's Look & Cook)",
        "Authors": "By Willan, Anne",
        "Description": "Step-by-step instructions and photographs, preparation tips, and illustrated lists of ingredients and equipment accompany a collection of regional Italian recipes",
        "Category": " Cooking , Regional & Ethnic , Italian",
        "Publisher": "Dorling Kindersley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Country Acres: Country Wisdom for the Working Landscape",
        "Authors": "By Larkin, David and Larkin, Sabra Elliott",
        "Description": "Here is the successor to COUNTRY WISDOM, the first in David Larkin's series of handsomely illustrated and informative books about country ways and country life. COUNTRY ACRES takes the reader from the country house to its outbuildings - barns, sheds, cribs - and on to its gardens, fields, trees, and ponds. In his charming fashion, Larkin offers information and guidance for country-lovers of all levels of sophistication, explaining how fields get their size and shape; how best to use the tools of country work, from grub hoe to chainsaw; why you should (or shouldn't) grow potatoes; how to farm your trees and grow fish as a food source; and how best to pick and store your crops. All these and hundreds of other topics are covered in this artfully designed volume, with more than two hundred full-color photographs and drawings. Much more than a how-to book, COUNTRY ACRES is about the art of understanding the country.",
        "Category": " House & Home , Outdoor & Recreational Areas",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    }
]