[
    {
        "Title": "Uno: Blue-Ribbon Beagle (All Aboard Reading)",
        "Authors": "By Spinner, Stephanie",
        "Description": "Presents the story of Uno, the winner of the 2008 Westminster Kennel Club best-in-show and the first beagle to receive this award.",
        "Category": " Juvenile Nonfiction , Animals , General",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Crush Alert (Beacon Street Girls #14)",
        "Authors": "By Bryant, Annie",
        "Description": "Meet the Beacon Street Girls...They're real, they're fun - they're just like you!    Love is in the air at Abigail Adams Junior High. There's a big dance coming up, and the BSG are having fun thinking up dream dates. But as the day of the dance approaches, things start to get complicated. Why is Dillon paying more attention to Avery than Maeve? And why is Nick spending so much time with Chelsea, when everyone knows he and Charlotte are made for each other? Who will the BSG share the last dance with?",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Algebra II For Dummies",
        "Authors": "By Sterling, Mary Jane",
        "Description": "Besides being an important area of math for everyday use, algebra is a passport to studying subjects like calculus, trigonometry, number theory, and geometry, just to name a few. To understand algebra is to possess the power to grow your skills and knowledge so you can ace your courses and possibly pursue further study in math.Algebra II For Dummies is the fun and easy way to get a handle on this subject and solve even the trickiest algebra problems. This friendly guide shows you how to get up to speed on exponential functions, laws of logarithms, conic sections, matrices, and other advanced algebra concepts. In no time you’ll have the tools you need to:Interpret quadratic functionsFind the roots of a polynomialReason with rational functionsExpose exponential and logarithmic functionsCut up conic sectionsSolve linear and non linear systems of equationsEquate inequalitiesSimplifyy complex numbersMake moves with matricesSort out sequences and setsThis straightforward guide offers plenty of multiplication tricks that only math teachers know. It also profiles special types of numbers, making it easy for you to categorize them and solve any problems without breaking a sweat. When it comes to understanding and working out algebraic equations, Algebra II For Dummies is all you need to succeed!",
        "Category": " Mathematics , Algebra , General",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "The Substitooth Fairy (Disney's Mickey and friends storybook)",
        "Authors": "By Margaret Snyder",
        "Description": "",
        "Category": "",
        "Publisher": "Merrigold Press",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Tribulation The Novel",
        "Authors": "By Lalonde, Peter and Lalonde, Paul",
        "Description": "This novelization based on the bestselling video by the same name tells a compelling story of endtimes through the trials of one family. Surrounded by his loving wife, his sister and his wacky brother-in-law, life had always made sense to Tom Canboro, a decorated police detective. But one evening all of that changed. As Tom battles more than thieves and thugs, he becomes entangled in the activities of an underground group who possess frightening psychic powers. Suddenly he finds these powers unleashed and directed at his family! Before he can reach them however, a mysterious force takes control of his car and rushes him head-on into an oncoming truck. He wakes up-years later-in a hospital bed, and finds himself in a world unlike anything he could have ever imagined. Is the devil really running the world or is this a result of the brain damage he must have suffered in the accident? It doesn't take Tom long to realize prophecy is coming to pass right before his eyes, and the souls of millions are hanging in the balance.",
        "Category": " Fiction , Religious",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Junebug in Trouble",
        "Authors": "By Mead, Alice",
        "Description": "It’s been several busy months since Junebug and his family moved away from their old housing project. Now Junebug is ecstatic about seeing his best friend Robert again at the beach on Labor Day weekend. But Robert’s with Trevor, another project pal, who happens to be a gang member with a gun. Junebug’s scared of Robert joining Trevor’s gang and wonders if he can stop him.At home, Junebug thinks about the father he hardly knows. He has been in prison for over six years. Maybe he’s really innocent, but if not, will people think that Junebug will grow up to be like him?",
        "Category": " Juvenile Fiction , People & Places , United States , African American",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Learning to Light: Easy and Affordable Techniques for the Photographer",
        "Authors": "By Hicks, Roger and Schultz, Frances",
        "Description": "A guide for amateur photographers to creating effective lighting. Explains techniques such as modifying light and setting up a studio, and equipment including suggested lighting kits. Then presents examples and lighting diagrams for still lifes, portraits and nudes, and architecture. Includes a glossary without pronunciation. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Photography , Techniques , General",
        "Publisher": "Amphoto Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Big Bird's Animal Game (A Golden Sturdy Shape Book / Sesame Street)",
        "Authors": "By Allen, Constance, Children's Television Workshop (COR), and Cooke, Tom (ILT)",
        "Description": "Big Bird asks the reader to guess what animals make certain sounds.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Embrace the Night (Cassandra Palmer)",
        "Authors": "By Chance, Karen",
        "Description": "View our feature on Karen Chance's Embrace the Night.Cassandra Palmer may be the world's chief clairvoyant, but she's still magically bound to a master vampire. Only an ancient book called the Codex Merlini possesses the incantation to free Cassie-but harnessing its limitless power could endanger the world...Read Karen Chance's posts on the Penguin Blog.",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Grandmas Always Have Time (Stories to Warm the Heart)",
        "Authors": "By Rebecca Christian",
        "Description": "",
        "Category": "",
        "Publisher": "5332502",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "What-the-Dickens: The Story of a Rogue Tooth Fairy",
        "Authors": "By Maguire, Gregory",
        "Description": "\"Gregory Maguire does for the dark and stormy night what he did for witches in Wicked.\" — THE NEW YORK TIMES BOOK REVIEWA terrible storm is raging, and Dinah is huddled by candlelight with her brother, sister, and cousin Gage, who is telling a very unusual tale. It’s thestory of What-the-Dickens, a newly hatched orphan creature who finds he has an attraction to teeth, a crush on a cat named McCavity, and a penchant for getting into trouble. One day he happens upon a feisty girl skibberee working as an Agent of Change — trading coins for teeth — and learns of a dutiful tribe of tooth fairies to which he hopes to belong. As his tale unfolds, however, both What-the-Dickens and Dinah come to see that the world is both richer and far less sure than they ever imagined.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "And Both Were Young",
        "Authors": "By L'Engle, Madeleine",
        "Description": "Flip doesn't think shell ever fit in at the Swiss boarding school.  Besides being homesick for her father and Connecticut, she isn't sophisticated like the other girls, and discussions about boys leave her tongue-tied.  Her happiest times are spent apart from the others, sketching or wandering in the mountains.But the day she's out walking alone and meets a French boy, Paul, things change for Flip.  As their relationship grows, so does her self-confidence.  Despite her newfound happiness, there are times when Paul seems a stranger to her.  And since dating is forbidden except to seniors, their romance must remain a secret.  With so many new feelings and obstacles to overcome in her present, can Flip help Paul to confront his troubled past and find a future?",
        "Category": "",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1983"
        }
    },
    {
        "Title": "Where Is Baby's Birthday Cake?: A Lift-the-Flap Book (Lift-The-Flap Book (Little Simon))",
        "Authors": "By Katz, Karen and Katz, Karen (ILT)",
        "Description": "It’s Baby’s birthday, but where is Baby’s cake? Little ones will love lifting the large, sturdy flaps to find Baby’s birthday cake in this new Karen Katz board book. Children will discover fun, festive objects under each flap until they finally find Baby’s yummy birthday cake on the final page of this adorable title.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , General",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Homer & Langley: A Novel",
        "Authors": "By Doctorow, E. L.",
        "Description": "From Ragtime and Billy Bathgate to The Book of Daniel, World’s Fair, and The March, the novels of E. L. Doctorow comprise one of the most substantive achievements of modern American fiction. Now, with Homer & Langley, this master novelist has once again created an unforgettable work.Homer and Langley Collyer are brothers–the one blind and deeply intuitive, the other damaged into madness, or perhaps greatness, by mustard gas in the Great War. They live as recluses in their once grand Fifth Avenue mansion, scavenging the city streets for things they think they can use, hoarding the daily newspapers as research for Langley’s proposed dateless newspaper whose reportage will be as prophecy. Yet the epic events of the century play out in the lives of the two brothers–wars, political movements, technological advances–and even though they want nothing more than to shut out the world, history seems to pass through their cluttered house in the persons of immigrants, prostitutes, society women, government agents, gangsters, jazz musicians . . . and their housebound lives are fraught with odyssean peril as they struggle to survive and create meaning for themselves. Brilliantly conceived, gorgeously written, this mesmerizing narrative, a free imaginative rendering of the lives of New York’s fabled Collyer brothers, is a family story with the resonance of myth, an astonishing masterwork unlike any that have come before from this great writer.",
        "Category": " Fiction , Literary",
        "Publisher": "Random House",
        "Price Starting With ($)": "26.96",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "The Upside of Down: Finding Hope When It Hurts",
        "Authors": "By Joseph M. Stowell",
        "Description": "",
        "Category": "",
        "Publisher": "Graham, Billy Evangelistic Ass",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Billy Graham Selections \"FOUNDATIONS for LIFE\" Reflections on Joyful Obedience....",
        "Authors": "By Billy Graham Selections",
        "Description": "",
        "Category": "",
        "Publisher": "Billy Graham Library -",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "A Savvy Christian's Guide to Life",
        "Authors": "By Lawrence, Tracey D.",
        "Description": "The Savvy Christian's Guide to Life tackles 40 life issues for Christians and provides a quick-hitting and creative \"tutorial\" that includes a powerful overview of the topic, followed by keen insights from a variety of experts, case studies, practical solutions, and action steps.Topics include-Dialoging with people of other faithsCounseling someone who is suicidalStarting and incorporating a new ministryParenting a rebellious kidBeing generous-even when money is tight Bringing up spirituality with non-Christians in a natural and non-threatening mannerDiscovering individual talents, purpose, and calling in lifeand much more...",
        "Category": " Religion , Christian Living , Spiritual Growth",
        "Publisher": "Integrity House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Shake It Up, Baby!",
        "Authors": "By Katz, Karen and Katz, Karen (ILT)",
        "Description": "Reach up high! Count one, two, three. Shake your rattle. . . . Shout, “Hooray for me!” Brightly colored images and playful text will guide little ones through this new Karen Katz book that comes complete with a rattle embedded in its spine! This new title is certain to entertain and excite babies for hours!",
        "Category": " Juvenile Fiction , Concepts , Sounds",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "A Trailside Guide: Cross-Country Skiing (Trailside Guides)",
        "Authors": "By Cazeneuve, Brian",
        "Description": "Add to that a superb aerobic  workout and you have the perfect cold-season  sport. It's as easy-going as a spin around the  nearest meadow, as thrilling as telemarking down a mountain, as rewarding as hut-to-hut touring in the backcountry. Includes full-color illustrated, step-by-step sections on the basics, and advanced instruction on telemark and skating technique.",
        "Category": " Sports & Recreation , Skiing",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Who Speaks For Islam?: What a Billion Muslims Really Think",
        "Authors": "By Esposito, John L. and Mogahed, Dalia",
        "Description": "Based on the largest study of its kind, this book is the first to present the fascinating findings of the Gallup Poll of the Muslim World.The horrific events of 9/11 dramatically intensified what many saw as an ongoing conflict between the U.S. and parts of the Muslim world. Extremism has grown exponentially as Muslims and non-Muslims alike continue to be victims of global terrorism. Terrorist attacks have occurred from Morocco to Indonesia and from Madrid to London, as U.S.-led wars rage in Iraq and Afghanistan. As of this writing, war and terrorism have already claimed more than 300,000 lives since 9/11; the vast majority have been civilians. As we face savage actions in a world that seems ever more dangerous and out of control, we are confronted daily by analysis from terrorism experts and pundits who see the religion of Islam as responsible for global terrorism. At the same time, terrorist groups like al-Qaeda beam messages throughout the world that demonize the West as the enemy of Islam, responsible for all the ills of the Muslim world. Amid the rhetoric of hate and growing violence, both anti-Americanism in the Muslim world and Islamophobia — discrimination against or hostility toward Islam or Muslims — have increased precipitously. In the aftermath of 9/11, President George W. Bush emphasized that America was waging war against global terrorism, not against Islam. However, the continued acts of a terrorist minority, coupled with statements by preachers of hate (Muslim and Christian) as well as anti-Muslim talk show hosts and political commentators have inflamed our emotions and distorted our views. The religion of Islam and the mainstream Muslim majority have been conflated with the beliefs and actions of an extremist minority. The result was reflected in a USA Today/Gallup poll, which found substantial minorities of Americans admitting to negative feelings or prejudice against Muslims and favoring heightened security measures with Muslims to help prevent terrorism. Nearly one-quarter of Americans, 22%, say they would not want a Muslim as a neighbor; fewer than half believe U.S. Muslims are loyal to the United States; and 44% say Muslims are too extreme in their religious beliefs. Are the growing violence and negative perceptions on all sides only a prelude to an inevitable all-out war between the West and 1.3 billion Muslims? The vital missing piece among the many voices weighing in on this question is the actual views of Muslim publics. With all that is at stake for U.S. and Muslim societies, indeed for the future of the world, the time has come to democratize the debate. Who Speaks for Islam? Listening to the Voices of a Billion Muslims is about this silenced majority. It is the product of a mammoth Gallup research study over the last six years. Gallup conducted tens of thousands of face-to-face interviews with residents of more than 35 predominantly Muslim nations. Gallup’s sample represents urban and rural, young and old, educated and illiterate, women and men. In total, we surveyed a sample representing over 90% of the world’s 1.3 billion Muslims, including Muslims in the West, making this the largest, most comprehensive study of contemporary Muslims ever. The concept of this book is simple. After collecting vast amounts of data representing the views of the world’s Muslims, we asked the questions everyone wants answers to: What is at the root of anti-Americanism in the Muslim world? Who are the extremists? Is democracy a desired construct among Muslims, and if so, what might it look like? What do Muslim women really want? With questions in hand, we let the empirical evidence — the voices of a billion Muslims, not individual “experts” or “extremists,” dictate the answer.",
        "Category": " Political Science , Political Freedom",
        "Publisher": "Gallup Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Mountain Bike Like a Champion",
        "Authors": "By Pavelka, Ed and Overend, Ned",
        "Description": "Master the techniques of America's greatest rider with Mountain Bike Like a Champion.* Glide over rocks, logs, and ledges* Attack steep climbs and rapid descents* Carve through curves and turns* Train smart, then ride to winImprove your performance with these tips, techniques, and off-road tales from mountain biking legend Ned Overend.\"At the 1990 world championships in Durango, Colorado, Thomas Frischknecht and I were locked in a dogfight.... At the start of the fourth and final lap was a pitch of rocky, loose trail that went straight up the face of a ski run.... My Swiss rival had been dismounting and running this climb while I stayed on my bike. On previous laps, I'd opened a little gap, so I knew this would be my chance. I attacked when Thomas got off again. He never caught me.... To ride that steep trail, I had to use five climbing techniques. There's no reason why you can't make them part of your arsenal, too.\"",
        "Category": " Sports & Recreation , Cycling",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Putting it all together",
        "Authors": "By Robinson, Brooks",
        "Description": "",
        "Category": "",
        "Publisher": "Hawthorn Books",
        "Price Starting With ($)": "61.67",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Out of the Ordinary",
        "Authors": "By Dave Kyllonen",
        "Description": "",
        "Category": "",
        "Publisher": "Home Fire Family Ministries",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Israel's Anointing: Your Inheritance And End-Time Destiny Through Israel",
        "Authors": "By Teplinsky, Sandra and Goll, James W. (FRW)",
        "Description": "As the biblical clock counts down, the destinies of Israel and the Church are converging. As God's people, both Jew and Gentile, make themselves ready as his warrior bride, Christians will face increasing spiritual warfare that intersects with warfare in the natural realm. Sandra Teplinsky calls Jewish believers to stand firm in these times of intensified opposition and make themselves ready as the bride of Christ. Israel's Anointing encourages believers to take up the biblical mandate to make Israel jealous, to help God's chosen people see this company of militant lovers in whose midst Yeshua dwells--and want him at last. Anyone with a love for Israel and an eye toward the end times will connect with this powerful book.",
        "Category": " Religion , Christianity , Pentecostal & Charismatic",
        "Publisher": "Chosen Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Under Cover: The Promise of Protection Under His Authority",
        "Authors": "By Bevere, John",
        "Description": "To walk in true spiritual authority, a believer must be submitted to God's sovereign authority. In this book, best-selling author John Bevere shows readers how submission to this divine order grants the Kingdom's provision and protection, in this Christian classic approaching 500K copies sold.This well-loved writer effectively uses his personal mistakes to illustrate riveting truths about repentance and forgiveness. As he focuses on the true authority of God, he is careful to explain by example the important difference between \"submission\" and \"obedience.\"The same struggle with divine authority is also represented through the lives of John the Baptist, the Apostle Paul, and other biblical figures. An especially helpful book for Christians who want to develop a serious pursuit of God.",
        "Category": " Religion , Christianity , Pentecostal & Charismatic",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "He Chose the Nails",
        "Authors": "By Lucado, Max",
        "Description": "Linger on the hill of Calvary.Rub a finger on the timber and press the nail into your hand.Taste the tinge of cheap wine and feel the scrape of a thorn on your brow.Touch the velvet dirt, moist with the blood of God.Allow the tools of torture to tell their story.Listen as they tell you what God did to win your heart.",
        "Category": " Religion , Christian Living , Inspirational",
        "Publisher": "W Publishing Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "The Electrician's Toolbox Manual (ARCO'S ON-THE-JOB REFERENCE SERIES)",
        "Authors": "By Miller, Rex",
        "Description": "Identifies hand tools, describes troubleshooting techniques, and discusses formulas, blueprints and measurements",
        "Category": " Technology & Engineering , General",
        "Publisher": "Arco Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Smart Power: Toward a Prudent Foreign Policy for America",
        "Authors": "By Carpenter, Ted Galen",
        "Description": "Noting a remarkable record of belligerence in recent US history, Carpenter (defense and foreign policy studies, Cato Institute) argues that American foreign policy is beset by three major problems: an unwillingness to terminate or reconsider the security obligations build up during the Cold War, a casual extension of security commitments to new client states that are even less relevant than the traditional Cold War-era allies to American security needs, and an increased willingness to intervene militarily in murky and often internecine conflicts. This demonstrates to Carpenter that the US foreign policy elite is unable to either establish proper priorities or to develop an analytical framework for assessing strategic choices. He applies this perspective to a number of significant foreign policy issues, including the Iraq debacle; the \"War on Terror;\" threatened war against Iran; broader Middle East regional issues; policy towards the Koreas; Taiwan policy; the relationship with China; NATO, the Balkans, and relations with Russia; the \"War on Drugs;\" and the relationship between foreign policy and domestic liberty. Annotation ©2008 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , International Relations , Diplomacy",
        "Publisher": "Cato Institute",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Timeless Values",
        "Authors": "By Exley, Helen (EDT)",
        "Description": "",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Helen Exley Gift Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "American enterprise--free and not so free",
        "Authors": "By Cramer, C. H",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "8.5",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Freaked Out (Beacon Street Girls #7)",
        "Authors": "By Bryant, Annie",
        "Description": "Julia Faber's Hawaiian-themed birthday bash is the talk of Abigail Adams Junior High, but one of the Beacon Street Girls doesn't get an invitation. Should the others be loyal to their slighted friend and miss the party of the year? And Maeve's got more than the party on her mind: She's in deep trouble in math class and afraid she may have to repeat seventh grade.   It's no wonder the BSG are freaking out!",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "8.37",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Coffeehouse Theology",
        "Authors": "By Thomas, Jim",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "The Pretty One",
        "Authors": "By Klam, Cheryl",
        "Description": "All Megan Fletcher had wanted was to be like her sister Lucy: a beautiful, thin girl whom everyone at the Chesapeake School for Performing Arts worshipped and adored. While Lucy was a star actress with lots of fans, Megan had always been hiding behind the set designs that she and her best friend Simon had created, hoping that no one would notice her.And then one day, life as Megan knew it had changed forever. Megan wasin an accident that disfigured her face and plastic surgeons had torestructure it very carefully. Only no one would have thought that whenthe bandages came off, Megan would be even more beautiful than Lucy . . .",
        "Category": " Young Adult Fiction , Family , Siblings",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Even Firefighters Go to the Potty: A Potty Training Lift-the-Flap Story",
        "Authors": "By Wax, Wendy, Gilpin, Stephen (ILT), and Wax, Naomi",
        "Description": "Clang! Clang! Clang! The fire truck is pulling out of the station. But wait! Where is the firefighter going? To the potty! Even firefighters go to the potty! Toddlers are uneasy about toilet training. And in most cases, even if they know they have to go, sometimes they are too busy to bother. In this hilarious gate-fold story, each person--from a firefighter on the way to answer a fire alarm to a zoo keeper on the way to feed the polar bears--stops what they are doing to go to the potty. With humor and no pedantics, toddlers learn that everybody uses the potty.",
        "Category": " Juvenile Fiction , Health & Daily Living , Toilet Training",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "The Smart Woman's Guide to Plastic Surgery : Essential Information from a Female Plastic Surgeon",
        "Authors": "By Loftus, Jean M., M.D.",
        "Description": "Whether it is for augmentation, liposuction, or a lift, women often go into plastic surgery without being aware of all the aspects.  This book, written by a female plastic surgeon, gives an objective, knowledgeable overview of the different procedures and includes topics such as decision making, smart questions to ask, expectations, possible complications, and recovery.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "7.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Fortunes of Indigo Skye",
        "Authors": "By Caletti, Deb",
        "Description": "I suddenly see where I'm standing, and that's at the edge of change - really, really big change.   Eighteen-year-old Indigo Skye feels like she has it all - a waitress job she loves, an adorable refrigerator-delivery-guy boyfriend, and a home life that's slightly crazed but rich in love. Until a mysterious man at the restaurant leaves her a 2.5 million-dollar tip, and her life as she knew it is transformed.   At first its amazing: a hot new car, enormous flat-screen TV, and presents for everyone she cares about. She laughs off the warnings that money changes people, that they come to rely on what they have instead of who they are. Because it won't happen...not to her. Or will it? What do you do when you can buy anything your heart desires -- but what your heart desires can't be bought?   This is the story of a girl who gets rich, gets lost, and ultimately finds her way back - if not to where she started, then to where she can start again.",
        "Category": " Young Adult Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Cold War 1945-1991 2e",
        "Authors": "By Smith, Joseph",
        "Description": "This book provides a concise analysis of relations between the United States and the Soviet Union during the whole period of the Cold War from 1945 to 1991. It explains the rise of the two superpowers immediately after World War II. The author describes the growing confrontation between East and West in Europe dating from the announcement of the Truman Doctrine in 1949 to the construction of the Berlin Wall in 1961. Full attention is paid to the extension of the conflict beyond Europe. The analysis covers superpower relations in the 1970s and the developments of the 1980s that led to the end of the Cold War.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "John Wiley & Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Dance With Me! (All Aboard Reading Station Stop 1)",
        "Authors": "By Bryant, Megan E.",
        "Description": "When Strawberry Shortcake and her friend Ginger both want to do the ballet solo in the dance show, they decide to do a duet instead so they do not have to compete against each other. Original.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Airplane Flight!: A Lift-the-Flap Adventure",
        "Authors": "By Hill, Susanna Leonard and Larranaga, Ana Martín (ILT)",
        "Description": "In the cockpit Captain Bright Makes sure everything works right. Wing flaps open. Wing flaps close. Lights shine bright on tail and nose. Susanna Leonard Hill's rhythmic text and Ana Martin Larranaga's simple but enticing art will take young readers on an exciting airplane ride! Kids can lift the10 flaps throughout the book to make their flying and reading experience more fun! Fasten your seatbelt and fly above the sky with this interactive book that's shaped like an airplane. This format is perfect for young children who are going on a plane for the first to one-hundredth time!",
        "Category": " Juvenile Fiction , Imagination & Play",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Back To The Divide",
        "Authors": "By Dewan, Ted (ILT) and Kay, Elizabeth",
        "Description": "The thrilling sequel to the fantastical novel THE DIVIDE, which PUBLISHERS WEEKLY called \"inviting...with a nicely constructed cliff-hanger [that leaves readers]...hungry for the next.\"After his adventures in THE DIVIDE, Felix lives quietly at home with his parents. But Snakeweed, the arch villain, is still at large. Having failed to sell bad magic to the real world, he wants to go back home. All he needs to get there is the spell hidden in Felix's notebook. So Snakeweed pays a visit to Felix--and freezes his parents with a horrible curse that begins to spread like a magical disease. Soon the curse is effecting everything--and the Earth itself may be in danger. Felix must return to The Divide to find the counter-charm that can cure his parents...and save the world!",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Chicken House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "City of Bath (Pitkin Guides)",
        "Authors": "By Wright, Reginald W.M., Lester, Geoffrey",
        "Description": "",
        "Category": "",
        "Publisher": "Jarrold Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "Procedures for the Office Professional: Text/Data Disk Package",
        "Authors": "By Fulton-Calkins, Patsy and Hanks, Joanna D.",
        "Description": "Procedures for the Office Professional is a comprehensive textbook designed to prepare the office professional to fulfill a challenging role in today's workplace. Employees must be able to adjust to a diversified workforce with emerging technologies and be prepared to function in an expanding and global marketplace. The twenty-chapter text contains six Parts that focus on The 21st Century Office; Office Technology; Office Communication; Records Management; Meetings, Travel, & Financial Documents; and the Office Professional's Career.",
        "Category": " Business & Economics , Management",
        "Publisher": "South-Western Educational Pub",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Neela: Victory Song (Girls of Many Lands)",
        "Authors": "By Divakaruni, Chitra Banerjee and Howell, Troy (ILT)",
        "Description": "In 1939, twelve-year-old Neela meets a young freedom fighter at her sister's wedding and soon after must rely on his help when her father fails to return home from a march in Calcutta against British occupation. Simultaneous.",
        "Category": " Juvenile Fiction , Historical , General",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "My Baby & Me Story Bible",
        "Authors": "By Harrast, Tracy",
        "Description": "My Baby & Me Story Bible helps little hearts learn to love the Bible. And when Mommy&apos;s there, learning God&apos;s Word is fun! - Fun and easy 'do together' activities strengthen parent-child bonds and help your child learn. - Colorful pictures captivate young imaginations and make Bible stories come alive. - Simple language speaks in a special way to your child. - 80 stories talk about all the most important events in the Bible and make key themes of obedience and thankfulness fun to learn!",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "Zondervan Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "I Can Draw Animals: Draw-Along Fun for Beginning Artists",
        "Authors": "By Foster, Walter",
        "Description": "",
        "Category": " Juvenile Fiction , Art & Architecture",
        "Publisher": "WiSHING WELL BOOKS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "I Can Draw Horses & Ponies",
        "Authors": "By Thomspon, Joan (ILT)",
        "Description": "",
        "Category": " Juvenile Fiction , Art",
        "Publisher": "Walter Foster Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "I Can Draw Everything (I Can Draw : No 8)",
        "Authors": "By Foster, Walter",
        "Description": "",
        "Category": " Juvenile Fiction , Art & Architecture",
        "Publisher": "WiSHING WELL BOOKS",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Planning a Better Kitchen: A Guide to Imaginative Designing and Decorating Your Kitchen",
        "Authors": "By Creative Homeowner",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "Creative Homeowner Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Elmo's Play Day",
        "Authors": "By Spence, Anne",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International 1/1/",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Lowe's Complete Bathroom (Lowe's Home Improvement)",
        "Authors": "By Lowe's",
        "Description": "",
        "Category": " House & Home , Design & Construction",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "The Presidents: A Reference History",
        "Authors": "By Graff, Henry F. (EDT)",
        "Description": "Provides a detailed reference guide to all the American presidents, discussing their administrations, policies, and practices, and exploring the key events and accomplishments of each administration.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Scribner",
        "Price Starting With ($)": "8.35",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Alexander, Who's Not (Do You Hear Me? I Mean It!) Going to Move",
        "Authors": "By Viorst, Judith, Preiss-Glasser, Robin (ILT), and Cruz, Ray (CRT)",
        "Description": "Alexander is not going to leave his best friend Paul. Or Rachel, the best babysitter in the world. Or the Baldwins, who have a terrific dog named Swoozie. Or Mr. and Mrs. Oberdorfer, who always give great treats on Halloween. Who cares if his father has a new job a thousand miles away? Alexander is not -- Do you hear him? He Means it! -- going to move. Alexander's back, facing another of childhood's trials and tribulations with Judith Viorst's trademark humor and keen sense of what's important to kids.",
        "Category": " Juvenile Fiction , Interactive Adventures",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Off the Shelf Cooking",
        "Authors": "By Holcomb, Carrie E. (EDT)",
        "Description": "It's a brand-new series for today's busy cooks from your trusted source in cooking!Off the Shelf provides convenience-based recipes for quick-fix meals. Each recipe is by the Better Homes and Gardens Test Kitchen and features the best quality step-saving convenience foods such as prepared sauces, seasoning packets, prepackaged rice and pasta mixes, and more allowing dinner to be ready in minutes!Dozen of helpful hints, cooking tips and special icons make cooking easy, fun and fast without sacrificing taste. It's a brand-new series for today's busy cooks from your trusted source in cooking!Off the Shelf provides convenience-based recipes for quick-fix meals. Each recipe is by the Better Homes and Gardens Test Kitchen and features the best quality step-saving convenience foods such as prepared sauces, seasoning packets, prepackaged rice and pasta mixes, and more allowing dinner to be ready in minutes!Dozen of helpful hints, cooking tips and special icons make cooking easy, fun and fast without sacrificing taste.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Whose Mouse Are You? (Aladdin Books)",
        "Authors": "By Kraus, Robert and Aruego, Jose (ILT)",
        "Description": "A lonely little mouse has to be resourceful to bring his family back together.In a series of delightfully imaginary achievements, “nobody’s mouse” transforms himself into the beloved hero of his mother, father, sister, and brand-new baby brother. In their very first collaboration, Robert Kraus and Jose Aruego give charm and validity to one of childhood’s more difficult experiences. Tender and catchy, Robert Kraus’s rhyming text, combined with Jose Aruego’s large, vibrantly clever illustrations, makes for a storytime classic.",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "The Complete Guide to Ceramic & Stone Tile (Black & Decker)",
        "Authors": "By Editors of Creative Publishing, international, The Editors of Creative Publishing",
        "Description": "Ceramic tile has been a premium building material for literally thousands of years. And for good reason-no material is more attractive or durable. Today, ceramic and stone tile is enjoying even greater popularity. Once the territory of skilled trade professionals, tile can now be installed with using modern thin-set adhesives, backer boards, and cutting tools that are easily usable by do-it-yourselfers of modest abilities. The Complete Guide to Ceramic & Stone Tile shows how to use these time-saving techniques and materials in virtually any tile application a homeowner is likely to encounter, both indoors and outdoors.Though installing ceramic tile can still be time consuming, it is no longer particularly difficult, which makes it an ideal project for do-it-yourselfers. Homeowners can save hundreds-or even thousands-of dollars by doing the work themselves. In addition to its practical benefit, ceramic and stone tile lends itself to creative expression. A routine countertop installation these days can become an exciting and unique design statement by including custom hand-painted tiles, which are now commonly available at specialty tile stores. Readers of this book will not only master the basics of tile installation, they will discover hundreds of purely decorative ways to use ceramic tile around the house.The Complete Guide to Ceramic & Stone Tile begins by teaching readers how to design a custom interior using tile, then presents in-depth, step-by-step information on all types of tile installation, including floors, walls, patios, countertops, backsplashes, and shower stalls. The book even includes decorative mosaic treatments that can be used to create ornamental tabletops, coffeetables, and garden planters. Learn how to work with all types of tile in addition to ceramic, including quarry tile, terra cotta, and natural stone.",
        "Category": " House & Home , Do-It-Yourself , Carpentry",
        "Publisher": "Creative Pub Intl",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Mommy Hugs (Classic Board Books)",
        "Authors": "By Katz, Karen",
        "Description": "Mommy and Baby's day is filled with lots of hugs and love!   Mommy and Baby can now count and cuddle as they hug and read about Baby's day of fun in this book ideal for even the youngest reader!",
        "Category": " Juvenile Fiction , Concepts , Counting & Numbers",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Daddy Hugs (Classic Board Books)",
        "Authors": "By Katz, Karen",
        "Description": "Counting hugs throughout the day is a fun way for Daddy and baby to spend time together in a simple counting book with full-color illustrations celebrating the loving bond between a father and his child.",
        "Category": " Juvenile Fiction , Concepts , Counting & Numbers",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Lessons on Christian Living: Eight Life-Changing Bible Studies and Memory Verses for Growing Christians (Growing in Christ)",
        "Authors": "By Navigators",
        "Description": "In this corresponding study by The Navigators to Lessons on Assurance, you will learn to recognize the importance of the Bible, the church, good works, witnessing, and more in your daily life. A great study for new Christians or in a missional setting. 8 lessons",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "NavPress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Desert Kingdom: Rajputs of Bikaner",
        "Authors": "By Naveen Patnaik",
        "Description": "",
        "Category": "",
        "Publisher": "Weidenfeld & Nicolson",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "A Childs Life of Mary Baker Eddy, Illustrated by L. Franklin Van Zelm",
        "Authors": "By Hay, Ella H.",
        "Description": "",
        "Category": "",
        "Publisher": "Boston Mass. The Christian Science Publishing Society",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1942"
        }
    },
    {
        "Title": "Yertle the Turtle and Other Stories",
        "Authors": "By Seuss, Dr.",
        "Description": "Dr. Seuss presents three modern fables in the rhyming favorite Yertle the Turtle and Other Stories. The collection features tales about greed (“Yertle the Turtle”), vanity (“Gertrude McFuzz”), and pride (“The Big Brag”). In no other book does a small burp have such political importance! Yet again, Dr. Seuss proves that he and classic picture books go hand in hand.",
        "Category": " Juvenile Fiction , Animals , Turtles",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "18.3",
        "Publish Date": {
            "Month": "April",
            "Year": "1958"
        }
    },
    {
        "Title": "Sew Easy Papercrafting: Creative Paper Projects Featuring Fabric, Stitching & Notions",
        "Authors": "By Meier, Rebekah",
        "Description": "It really is sew easy!Even if you've never sewn a single stitch, you'll soon be adding the warmth and flair of fabric and sewing to your papercrafts with the help ofSew Easy Papercrafting.You'll be guided gently through the basic techniques with step-by-step photographs that teach you everything you need to know to get started, including:Easy techniques for incorporating the beauty and texture of fabric to projects without sewing a stitchSimple hand-embroidery stitches you can master in minutesClever ways to combine fabric and paper with stunning resultsAnd the over 20 projects for cards, boxes, books, picture frames and more will keep you in stitches, no matter what your sewing skill level.You don't need to be a seamstress to have fun with fabric and sewing notions–start sewing your papercrafts today!",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Toddlerhood: Scrapbooking Your Child's Early Years",
        "Authors": "By Davis, Karen E. (EDT)",
        "Description": "Scrapbook the non-stop energy of the toddler years!How quickly newborns turn into toddlers. And when they do, watch out world! The sweet and silly moments, the mischief and mayhem all need to be preserved so that they can become tomorrow's funny stories and happy memories.In Toddlerhood, over 150 amazing scrapbook pages and projects will inspire you to create great scrapbook pages about your little one that document this amazing time of growing and learning.Look inside to find:Captivating scrapbook pages and projects covering all aspects of toddler life - growing and learning, favorite things, family and friends, daily life and adventures in the worldExciting crafting projects including growth chart, lunch box album, tooth fairy tin, routine chart, and mini albumsTons of techniques and fun ideas to spark the imagination of every scrapbookerLet Toddlerhood inspire you to seize the moment (and your photos and scrapbook supplies) to create your own pages and projects before your toddler zooms on to the next fun and exciting stage!",
        "Category": " Crafts & Hobbies , Scrapbooking",
        "Publisher": "Memory Makers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "How to Do Everything with Your iPod & iTunes, Third Edition",
        "Authors": "By Hart-Davis, Guy",
        "Description": "This fully updated edition of the best-selling guide to the world’s favorite MP3 player explains how to maximize the iPod, iPod mini, iPod shuffle, and iTunes. Readers will learn to use the device with a Mac or PC, load music from CDs, the iTunes Music Store, or other sources, create playlists, track appointments, carry contacts and notes, and back up data files. Tips on getting high quality sound, troubleshooting the iPod, adding fun peripherals, and maximizing battery life as well as information on digital file formats (MP3 and AAC) and digital rights management are also included.",
        "Category": " Games , Video & Electronic",
        "Publisher": "McGraw-Hill Osborne Media",
        "Price Starting With ($)": "5.78",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "A Dark, Dark Tale (Picture Puffin Books)",
        "Authors": "By Brown, Ruth",
        "Description": "Children will be swept away by this dark and fascinating adventure of a black cat who travels through all of the shadowy corners of the nearby woods and house. “A splendid choice for group story time.”—School Library Journal",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Halloween",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Victory Club",
        "Authors": "By Hatcher, Robin Lee",
        "Description": "",
        "Category": "",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Rhymes and Stories (Read-A-Picture Books)",
        "Authors": "By Marks, Burton",
        "Description": "Presents short verses in words and rebuses",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.73",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Precalculus Enhanced With Graphing Utilities",
        "Authors": "By Mccombs, Mark F.",
        "Description": "",
        "Category": " Mathematics , Calculus",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Print's Best Typography: Winning Designs from Print Magazine's National Competition",
        "Authors": "By Silver, Linda (EDT)",
        "Description": "Designers can do more with type today than they ever dreamed of - thanks mainly to the computer. This spectacular collection showcases the very latest typographic trends in magazines, ads, direct mail, book covers, business forms, etc. - with all the work selected from winners in PRINT's Regional Design Annual. The 175 full-color examples add up to an incomparable overview of evolving type usage in U.S. print design.The typography reproduced here adorns communications for such major industries as publishing, including book covers and editorial spreads from national magazines and newspapers; entertainment, including posters for theater and musical events as well as CD packages for famous pop performers; and healthcare, including an ad for mammogram screening and a point-of-purchase display for a vitamin company. Among the many superb type solutions are a car dealership's controversial anti-drunk-driving billboard, a brochure promoting a Checker cab for hire, and ads for an erotic baker. There are also highly effective pieces for all those people and companies who service the graphic design field - designers, illustrators, photographers, paper companies, color separators, printers, and, of course, typographers.This delightful collection of outstanding typography covers a wide spectrum of design styles and will be a valuable reference tool for years to come.",
        "Category": " Design , Graphic Arts , Typography",
        "Publisher": "R C Pubns",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Horses Of The World",
        "Authors": "By Rh Value Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "The Fundamentals of Riding",
        "Authors": "By Rees, Lucy",
        "Description": "Discusses the psychology and physics of riding, and covers the basics of Eastern and Western riding",
        "Category": " Sports & Recreation , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Natural Landscaping: Gardening with Nature to Create a Backyard Paradise (Rodale Garden Book)",
        "Authors": "By Roth, Sally",
        "Description": "Whether you yearn for a colorful meadow garden splashed with asters and black-eyed Susans, a shady garden filled with graceful woodland wildflowers and feathery ferns, or a poolside planting lush with Japanese iris and astilbes, Natural Landscaping can help you make your gardening dreams a landscape reality. Page after page of this stunning book shows you the beauties and benefits of a natural garden. And a garden that takes its inspiration from nature is a beacon to birds, butterflies, toads, and other wild creatures. Author Sally Roth has a lifetime's experience creating natural landscapes. In this beautifully designed, lavishly illustrated book, she tells you everything you need to know about creating a natural landscape. You'll find:* Chapters on meadow and prairie gardens, woodland and shade gardens, water and bog gardens, gardens for songbirds and hummingbirds, and gardens to attract butterflies and moths.* Step-by-step projects for building special garden features. The easy-to-follow instructions and illustrations take you through the basics of creating such exciting garden additions as a waterfall and a bluebird nest box. You'll learn how to install garden lighting to add a glow to walkways, create a bubbling spring for birds, build a rustic bench, and more.* Garden plans for such varied gardens as a moonlight garden, a birdseed garden, and a hummingbird garden. You'll find nine beautifully illustrated plans that show you exactly how to create special natural gardens. You can follow the plans exactly or adapt them for your own needs.* Effective gardening techniques, each explained with step-by-step illustrations. You'll learn the easiest way to strip sod for a new garden, how to saw through a limb without damaging the tree, an effortless way to propagate your plants, and how to control problems organically. With these simple instructions, every gardener-- even a beginner-- can create and maintain a lush natural landscape.* Profiles of delightful natural landscapes created by gardeners across the country. Each profile features a different kind of natural landscape, from a prairie planting to a butterfly garden to a yard designed just for the birds. The gardeners talk about their inspirations and share valuable tips on how to create your own version.* Scores of quick-reference charts show you the best plants for every type of natural landscape. No matter where you live, you'll find a selection of the best plants for your area-- whether you're looking for flowers to attract hummingbirds, grasses for a prairie garden, shrubs for your woodland garden, plants to soften a pool's edge, flowers for a night garden, or wildflowers for your sunny meadow garden. You'll find helpful charts of the best plants for each garden style, conveniently located at the end of each chapter.With lively, authoritative text and more than 250 gorgeous color photos and illustrations, Natural Landscaping is an indispensable guide to a lush, inviting garden that's full of the beauty of nature.",
        "Category": " Gardening , Landscape",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Wide Angle: National Geographic Greatest Places",
        "Authors": "By Protzman, Ferdinand (EDT)",
        "Description": "In 250 glorious photographs Wide Angle: National Geographic Greatest Places showcases every part of the world.  Delving deeply into our century-old picture archive, our new book-the third in the \"greatest photographs\" series-presents the world's hugely diverse places with epic grandeur, unparalleled intimacy, romantic beauty, and gritty realism.  The photographs are landscapes, cityscapes, famous landmarks, and unfamiliar spots that reveal special qualities of geography or culture we might otherwise never see.National Geographic's quest since its founding in 1888 has been to describe \"the world and all that's in it.\"  To fulfill that quest, photographers set out to document every imaginable place on earth, from the most remote to the most familiar; from the most primitive to the most sophisticated. National Geographic photographers have recorded the world's places close up, in sweeping breadth, in depth, and over time. Wide Angle is divided into twelve chapters, each depicting a unique geography (see list below) and the culture and nature that inhabit it. Chapters are introduced by short, 1,500-word essays. The book's length-504 pages-allows us to develop each chapter to look carefully and deeply at a region's special qualities. The geography and the life within it comes forward with its own unique character, its own special and unforgettable sense of place.\"EAST AND SOUTHEAST ASIA\"OCEANIA\"CENTRAL AND SOUTH ASIA\"MIDDLE EAST\"NORTHERN EUROPE\"CENTRAL & EASTERN EUROPE\"WESTERN AND SOUTHERN EUROPE\"NORTH AFRICA\"SUB-SAHARA AFRICA\"NORTH AMERICA\"THE CARIBBEAN, MESO- AND SOUTH AMERICA\"POLAR REGIONS",
        "Category": " Photography , General",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "9.5",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Heaven How to Get There",
        "Authors": "By Moody, D. L.",
        "Description": "",
        "Category": "",
        "Publisher": "Whitaker House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "Hewlett-Packard? Official Scanner Handbook",
        "Authors": "By Busch, David D., Krzywicki, Susan, and Burden, Laurel",
        "Description": "Hewlett-Packard® Official Scanner Handbook Equip Your Creativity Whether you are looking to buy your first scanner or to get more out of the one you already own, you'll find all the information you need about how scanners work and how much you can do with them in the Hewlett-Packard® Official Scanner Handbook.Find out what you really need to look for when selecting a scannerMaster the basics of resolution, interpolation, and color calibrationTurn any typed documents into editable textDiscover some simple tricks for getting better scansSelect the best image-editing software for retouching and dressing up scansOptimize color for traditional printing and for Web publishingLearn what to do when your scanner won't cooperate?or troubleshooting 101Create custom cards, decals, book covers, party favors, fabric, and even wallpaperDiscover new ways to use your scanner?from screensavers to business presentations to Web artWith more than 40 step-by-step projects covering a wide range of activities for both home and business, this engaging guide will help you produce distinctive documents and designs, showing you throughout how to use your scanner more efficiently?and always more creatively. Reader Level: Beginning to Intermediate Shelving Category: Hardware/Scanners www.idgbooks.com",
        "Category": " Computers , Data Transmission Systems , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.9",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "The Touch: A Novel",
        "Authors": "By McCullough, Colleen",
        "Description": "Not since The Thorn Birds has Colleen McCullough written a novel of such broad appeal about a family and the Australian experience as The Touch.  At its center is Alexander Kinross, remembered as a young man in his native Scotland only as a shiftless boilermaker's apprentice and a godless rebel. But when, years later, he writes from Australia to summon his bride, his Scottish relatives quickly realize that he has made a fortune in the gold fields and is now a man to be reckoned with.  Arriving in Sydney after a difficult voyage, the sixteen-year-old Elizabeth Drummond meets her husband-to-be and discovers to her dismay that he frightens and repels her. Offered no choice, she marries him and is whisked at once across a wild, uninhabited countryside to Alexander's own town, named Kinross after himself. In the crags above it lies the world's richest gold mine.  Isolated in Alexander's great house, with no company save Chinese servants, Elizabeth finds that the intimacies of marriage do not prompt her husband to enlighten her about his past life -- or even his present one. She has no idea that he still has a mistress, the sensual, tough, outspoken Ruby Costevan, whom Alexander has established in his town, nor that he has also made Ruby a partner in his company, rapidly expanding its interests far beyond gold. Ruby has a son, Lee, whose father is the head of the beleaguered Chinese community; the boy becomes dear to Alexander, who fosters his education as a gentleman.  Captured by the very different natures of Elizabeth and Ruby, Alexander resolves to have both of them. Why should he not? He has the fabled \"Midas Touch\" -- a combination of curiosity, boldness and intelligence that he applies to every situation, and which fails him only when it comes to these two women.  Although Ruby loves Alexander desperately, Elizabeth does not. Elizabeth bears him two daughters: the brilliant Nell, so much like her father; and the beautiful, haunting Anna, who is to present her father with a torment out of which for once he cannot buy his way. Thwarted in his desire for a son, Alexander turns to Ruby's boy as a possible heir to his empire, unaware that by keeping Lee with him, he is courting disaster.  The stories of the lives of Alexander, Elizabeth and Ruby are intermingled with those of a rich cast of characters, and, after many twists and turns, come to a stunning and shocking climax. Like The Thorn Birds, Colleen McCullough's new novel is at once a love story and a family saga, replete with tragedy, pathos, history and passion. As few other novelists can, she conveys a sense of place: the desperate need of her characters, men and women, rootless in a strange land, to create new beginnings.",
        "Category": " Fiction , General",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Morning And The Evening",
        "Authors": "By Williams, Joan",
        "Description": "",
        "Category": "",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "15.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "New Living Heart Diet",
        "Authors": "By Debakey, Michael E. (EDT), Gotto, Antonio M., Scott, Lynne W., Foreyt, John P., McMann, Mary, Jaax, Suzanne, Simpson, Suzanne, and Brauchi, Daniele",
        "Description": "Provides more than three hundred heart-smart recipes that range from favorite American classics to vegetarian and ethnic dishes, and incorporates the latest information on heart disease and diet.More than ten years ago, a team of heart specialists and dietitians at Baylor College of Medicine and The Methodist Hospital in Houston, Texas, created the Living Heart Diet for their patients. Their best-selling book explained the relationship between nutrition and heart disease and helped change America's eating habits. Updated and completely revised, The New Living Heart Diet incorporates the latest information on how to minimize your risk factors for coronary heart disease and reflects changes in our tastes and eating habits. Drawing on recent research in health and nutrition, the New Living Heart Diet helps you make food and lifestyle choices to control blood cholesterol and triglyceride levels, blood pressure, weight, and diabetes. It clarifies information about vitamins and minerals, interprets the new nutrition labels, and explains how to select among the array of foods in supermarkets. Also included is a special chapter on vegetarian eating. More than 300 new or revised recipes—along with breakfast, lunch, dinner, and holiday menus—are provided to make healthy cooking and eating convenient. The recipes and menus have easy-to-understand nutrient analyses and feature traditional American as well as international dishes. From the detailed guides for selecting food when eating out to the comprehensive tables describing the nutrient content of common foods, the New Living Heart Diet makes it easy for readers to enjoy delicious, healthy eating every day. “...includes the latest information on how to minimize risk factors for coronary heart diseases, clarifies infor- mation about vitamins and minerals, interprets the new nutrition labels, & explains how to select proper food.”",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Still Lake",
        "Authors": "By Stuart, Anne",
        "Description": "Moving to Vermont with her mother and half sister to fulfill her lifelong dream of opening a charming country inn, Emilia Davis, the proud owner of an old farmhouse, which was the site of a brutal triple murder years earlier, finds her life in danger when the accused killer returns to clear his name. Original.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "American Furniture: Understanding Styles, Construction, and Quality",
        "Authors": "By Kirk, John T.",
        "Description": "Starting with the wood itself, Kirk (art history, Boston U.) provides a guide through the often complex visual thinking that underlies a compelling design, offering insights and observations into what makes a piece successful. He juxtaposes genuine works and fakes, enabling the reader to judge both quality and authenticity. In extensively illustrated sequences, he presents each style and explores regional difference. Finally, he moves to the American Arts and Crafts movement, and ends with a look at how earlier styles were revived and adapted in the 1930s and 1940s. Contains 251 illustrations, including 57 color plates. Oversize: 8.5x12",
        "Category": " Antiques & Collectibles , Furniture",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "6.7",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Complete Earth",
        "Authors": "By Palmer, Douglas",
        "Description": "Reproducing one of the most advanced satellite surveys of Earth in its entirety, The Complete Earth explores our planet, explaining the how and when of its mountain ranges, deserts, ice-sheets, volcanoes and oceans.From pole to pole. The Complete Earth presents one of the most advanced portraits of our planet ever created Within these pages, data from NASA's most advanced Earth observing satellites has been combined to produce a cloud-free, digital atlas of the entire planet-a mappamundi for the Information Age.At a scale of 53 kilometres to every centimetre (93 miles to an inch), we can trace the Amazon from Andean headwaters to Atlantic mouth, explore the trackless sand seas of the Sahara, and follow the corrugated ridges of hills and mountains that mark the front-line of India's continental collision with Eurasia. We can track the ebb and flow of seasons across the globe, watching snows fall in the North as they melt in the South and desert lands bloom and fade as rains come and go.Combining NASA's digital portrait of the planet with high resolution satellite imagery that zooms in on noteworthy features-from volcanoes to asteroid craters, river deltas to glaciers-The Complete Earth creates an unprecedented view of our planet's face. Social and political boundaries are invisible and irrelevant, what we see instead is the landscape of the whole Earth - the mountains and deserts, seas and oceans that have shaped human history. Yet this configuration of rock and water represents a fleeting geological moment, having existed for no more than 4 million years-a mere 0.01 percent of the planet's lifetime. But look closer and a deeper past emerges. Earth's 4.5 billion year history can be reconstructed from the layered, twisted and folded rocks that adorn its surface.To understand how to read the planet's deep history, The Complete Earth descends far beneath the continents and oceans to reveal the tectonic plates they rest on. It explains how the ceaseless jostling of these plates has sculpted Earth's ever-changing face and tracks their movements over millennia to reconstruct global views of not only the planet's past, but also its future.",
        "Category": " Science , Earth Sciences , General",
        "Publisher": "Quercus",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Big Book of Customer Service Training Games (Big Book Series)",
        "Authors": "By Carlaw, Peggy and Deming, Vasudha Kathleen",
        "Description": "Help your employees to excel in dealing with the public with this stimulating, fun-filled collection of customer service training games.  Designed not only to teach important skills but also to spark enthusiasm and a high level of involvement in the participants, these games utilize entertaining and instructive techniques such as role-playing, charades, brainstorming, and debate. As a result of these exercises, employees will learn how to create a rapport with the customer, how to focus on the unique needs of individual customers, how to maintain a positive attitude, and more.",
        "Category": " Business & Economics , Human Resources & Personnel Management",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Collector's Encyclopedia of McCoy Pottery",
        "Authors": "By Huxford, Bob and Huxford, Sharon",
        "Description": "The most popular writers in the pottery field compiled this richly informative deluxe guide featuring hundreds of pieces of McCoy pottery, and for over 20 years it has been the best resource for collectors. Large color photos fill this deluxe guide which has been updated to reflect the current market values. 1999 values. 8.5 X 11.",
        "Category": " Antiques & Collectibles , Pottery & Ceramics",
        "Publisher": "Collector Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Our Country's Presidents",
        "Authors": "By Bausum, Ann",
        "Description": "The author of Dragon Bones and Dinosaur Eggs follows the nation's Chief Executives through wars, depressions, civil rights movements, the race for space, and more, giving a sense of the man, his life, and his time. Teacher's Guide available.",
        "Category": " Juvenile Nonfiction , History , United States , General",
        "Publisher": "National Geographic Kids",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Webster's New World German Dictionary: German/English English/German",
        "Authors": "By Peter Terrel, Horst Kopleck",
        "Description": "Compiled in collaboration with a team of expert linguists, the Webster&#39;s New World concise bilingual dictionaries are the perfect choice for beginning students and advanced speakers as well. Comprehensive and authoritative (yet clear and concise), the dictionaries offer a full array of features. Long-standing favorites in hardcover, the dictionaries will continue to be standard references for years to come.More than 100,000 words, giving wide-ranging coverage of terms and expressionsDetailed definitions so the user can understand and translate idiomaticallyExtensive examples of usage, showing how translations of words can vary according to contextVerb tables, including irregular verbsCross-references from every verb to the appropriate verb table",
        "Category": " Foreign Language Study , German",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Atlas of the Ancient World: Charting the Great Civilizations of the Past",
        "Authors": "By Oliphant, Mrs. (Margaret)",
        "Description": "An illustrated exploration of the ancient world looks at the cultures of Mesopotamia, the Near East, Egypt, Persia, prehistoric Europe, Greece, the Roman world, India, China, and the Americas. 25,000 first printing.",
        "Category": " History , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "7.46",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "The Titanic, End of a Dream",
        "Authors": "By Wade, Wyn Craig",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1980"
        }
    },
    {
        "Title": "The Anchor Atlas of World History, Vol. 1 (From the Stone Age to the Eve of the French Revolution)",
        "Authors": "By Kinder, Hermann",
        "Description": "",
        "Category": " Travel , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Cars (A Read-Aloud Storybook)",
        "Authors": "By Marsoli, Lisa Ann (ADP)",
        "Description": "Ready, set, GO! Lightning McQueen, the rookie hot-shot race car, is screaming his way down the track on his way to winning the Piston Cup. But when he gets stuck in a slow little town called Radiator Springs, McQueen must learn a valuable lesson about friendship—fast. This beautifully illustrated Read-Aloud Storybook is the complete retelling of Disney presentation of a Pixar film latest computer-animated film,Cars.",
        "Category": " Juvenile Fiction , Transportation , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Beyond Innocence (A Beyond Novel)",
        "Authors": "By Holly, Emma",
        "Description": "Emma Holly turns up the heat in this sinfully sensuous story of a family plagued by scandal&#151;and a shy young woman who discovers a passion beyond her wildest dreams…When her beloved father passes away, Florence Fairleigh finds herself alone in the world. All she wants is a man who will treat her kindly and support her financially&#151;and she’s come to London to find him… Edward Burbrooke thinks marriage is the only way to save his brother Freddie&#151;and their family&#151;from scandalous ruin. As head of the family, Edward has vowed to find Freddie a bride&#151;and fast…Thrown together by Edward, Florence and Freddie make a perfect pair&#151;until Edward realizes he has feelings for his brother’s betrothed. The sight of her nubile young body makes his blood burn with lust. The sound of her voice makes his heart warm with love. And the sweet taste of her kiss makes him wonder if he isn’t making a terrible mistake….",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Here Come the Backyardigans!",
        "Authors": "By Burgess, Janice and Hunt, Gary (ILT)",
        "Description": "MEET THE BACKYARDIGANS!Uniqua's search for her friend Pablo turns into a fantasy adventure as she visits the desert, the jungle, a pirate ship, and more! Along the way she meets her friends Tyrone, Austin, and Tasha.But where is Pablo?This innovative format has fuzzy pages and dimensional, cut-out board pieces throughout. Young readers will love the surprising transformations that occur as they turn each page.",
        "Category": " Juvenile Fiction , Interactive Adventures",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "The Whole World's Crazy (Amelia Rules!)",
        "Authors": "By Gownley, Jimmy and Gownley, Jimmy (ILT)",
        "Description": "Meet Amelia Louise McBride.    She's nine years old, a former New Yorker who's now living in a small town after her parents decided to get divorced, and dealing with everything from being the new kid in school to getting her first kiss. But you know what? She's got her mom and her aunt Tanner (who happens to be an ex-rock star) and her friends Reggie, Rhonda, and Pajamaman, and everything's going to be okay. Except, of course, when it isn't.   In this first book of Amelia's adventures, Amelia and her friends take on bullies (and Santa!), barely survive gym class, and receive a disgustingly detailed explanation of the infamous Sneeze Barf.",
        "Category": " Juvenile Fiction , Comics & Graphic Novels , General",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "American Chopper At Full Throttle",
        "Authors": "By Flaherty, Mike and Erickson, Larry, Editor",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Corporation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Hidden Treasures",
        "Authors": "By White, E. G.",
        "Description": "",
        "Category": "",
        "Publisher": "Inspiration Books East, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "To Have and to Hold: A Novel (Returning Home)",
        "Authors": "By Michaels, Fern",
        "Description": "Bestselling author Fern Michaels has won the hearts of readers worldwide with her sweeping novels of women coping with the challenges of love. In To Have and to Hold, she tells the compelling story of a woman who harnesses tragedy and grows courageously—strong, independent, and free to love.   TO HAVE AND TO HOLD   It is 1970 and Kate Starr is the perfect wife and the perfect mother. But soon after her husband leaves for Vietnam, he is listed as MIA. Suddenly Kate must raise their two daughters by herself and struggle with the U.S. government to get news of her husband. Her fight to be heard is the beginning of a new Kate Starr. Twenty years later, she has educated herself, started a successful business, and finally found love again—in this incredibly moving novel that traces the awakening of a remarkable woman who learns that sometimes in order to keep love in our hearts, we have to let it go.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Soups (Williams-Sonoma Kitchen Library)",
        "Authors": "By Williams, Chuck (EDT), Rosenberg, Allan (PHT), and Kolpas, Norman",
        "Description": "Offers a variety of recipes for both hot and cold soups featuring vegetables, fruit, poultry, meat, or seafood, and includes tips on kitchen equipment, making basic stocks, and adding flavorful garnishes",
        "Category": " Cooking , Courses & Dishes , Soups & Stews",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "False Prophet",
        "Authors": "By Kellerman, Faye",
        "Description": "When health spa owner Lilah Brecht is found beaten, raped, and robbed in her own home, Pete Decker takes the case despite his reservations about Lilah's claims to psychic power. Reprint.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "The Everything Home-Based Business Book",
        "Authors": "By Savage, Jack",
        "Description": "",
        "Category": "",
        "Publisher": "F & W Publications",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Volunteer Vacations: Short-Term Adventures That Will Benefit You and Others",
        "Authors": "By McMillon, Bill, Cutchins, Doug, and Geissinger, Anne",
        "Description": "For those looking for a way to make a difference while on vacation--simultaneously getting away and using their talents to improve the world--this guide shows you how a short-term volunteer stint can transform your life as much as the people, animals, and ecology you choose to help. This fully updated edition is filled with in-depth information and profiles of more than 150 select organizations running thousands of quality programs in the United States and around the world. Inside, you’ll discover ways to Map rock art in South Africa Tutor children in the Navajo Nation in Arizona Build houses in Honduras Teach art lessons in Ghana's only children's gallery Restore wetlands in Colorado Rehabilitate wounded elephants in IndiaEach listing includes complete contact information with locations, costs, dates, and project details you won’t find anywhere else. In addition, it features some of the better established long-term projects as well as organizations specifically tailored for families, seniors, and people with disabilities. Stories from recent volunteers and a host of photographs help you further imagine your volunteer adventure. Bill McMillon is a high school teacher. Doug Cutchins is the director of social commitment at Grinnell College. Anne Geissinger is a part-time photographer. Ed Asner is a professional actor. He appeared on The Mary Tyler Moore Show, for which he won an Emmy, and the series Lou Grant. He also appeared on the television series Studio 60 on the Sunset Strip.",
        "Category": " Reference , Directories",
        "Publisher": "Chicago Review Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Protector of the Flight (The Summoning, Book 3)",
        "Authors": "By Owens, Robin D.",
        "Description": "If horses could fly&#133;then Calli Torcher might ride again.But a devastating accident left her in such painshe thought the chimes and chanting in her earswere a hallucination&#133;until she found herselftransported to another world, and met the Lladranans who had Summoned her.Lladrana was a parallel, magical earth filledwith exotic creatures, noble humans andenchantments—all threatened by anencroaching evil.And when the mighty volarans stoppedobeying the Chevaliers, the flying horses'unexpected rebellion had thrown Lladranainto an uproar. In desperation, the sorcerers had sought help from afar—and gotten Calli. If she could fulfill this mission, perhaps shewould also finally find all she had longedfor—a mate, a home, a family. Butagainst this great darkness, she hadno battle experience, no strategyplans. She had only a bondwith horses.&#133;",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Luna",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    }
]