[
    {
        "Title": "Storyteller's Daughter",
        "Authors": "By Shah, Saira",
        "Description": "The vivid, often startling memoir of a young woman shaped by two dramatically disparate worlds. Saira Shah is the English-born daughter of an Afghan aristocrat, inspired by his dazzling stories to rediscover the now lost life their forebears presided over for nine hundred years within sight of the minarets and lush gardens of Kabul and the snow-topped mountains of the Hindu Kush. Part sophisticated, sensitive Western liberal, part fearless, passionate Afghan, falling in love with her ancestral myth–chasing Afghanistan–Shah becomes, at twenty-one, a correspondent at the front of the war between the Soviets and the Afghan resistance. Then, imprisoning herself in a burqa, she risks her life to film Beneath the Veil, her acclaimed record of the devastation of women’s lives by the Taliban. Discovering her extended family, discovering a world of intense family ritual, of community, of male primacy, of arranged marriages, and finding at last the now war-ravaged family seat, she discovers as well what she wants and what she rejects of her extraordinary heritage.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Missionary and the Libertine Love and War in East and West",
        "Authors": "By Buruma, Ian",
        "Description": "The author of Anglomania explores the synergy between Eastern and Western thought in this collection of twenty-five insightful and eclectic essays on topics ranging from biographical profiles and popular culture to literary criticism.  12,500 first printing.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Little Wilson and Big God",
        "Authors": "By Burgess, Anthony",
        "Description": "Offers a portrait of the author's first forty years, from his childhood in Manchester to the moment when, having been told he was dying, he began to write seriously",
        "Category": " Literary Criticism , General",
        "Publisher": "Grove Pr",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "The Patriot Chiefs: A Chronicle of American Indian Resistance",
        "Authors": "By Josephy, Alfin M.",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1969"
        }
    },
    {
        "Title": "My Soul in Silence Waits: Meditations on Psalm 62 (Cloister Books)",
        "Authors": "By Guenther, Margaret",
        "Description": "In these reflections on Psalm 62 Margaret Guenther provides the foundation for a time of reflection and retreat without ever leaving home.",
        "Category": " Religion , Christian Ministry , Evangelism",
        "Publisher": "Cowley Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Tax Racket: Government Extortion From A to Z",
        "Authors": "By Gross, Martin L.",
        "Description": "Criticizes government taxation policies, identifies hidden and unfair taxes, and suggests changes to the federal tax system",
        "Category": " Business & Economics , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The Rule of Four",
        "Authors": "By Caldwell, Ian and Thomason, Dustin",
        "Description": "An ivy league murder, a mysterious coded manuscript, and the secrets of a Renaissance prince collide memorably in The Rule of Four—a brilliant work of fiction that weaves together suspense and scholarship, high art and unimaginable treachery.It's Easter at Princeton.  Seniors are scrambling to finish their theses.  And two students, Tom Sullivan and Paul Harris, are a hair's breadth from solving the mysteries of the Hypnerotomachia Poliphili—a renowned text attributed to an Italian nobleman, a work that has baffled scholars since its publication in 1499. For Tom, their research has been a link to his family's past—and an obstacle to the woman he loves. For Paul, it has become an obsession, the very reason for living.  But as their deadline looms, research has stalled—until a long-lost diary surfaces with a vital clue.  And when a fellow researcher is murdered just hours later, Tom and Paul realize that they are not the first to glimpse the Hypnerotomachia 's  secrets. Suddenly the stakes are raised, and as the two friends sift through the codes and riddles at the heart of the text, they are beginnning to see the manuscript in a new light—not simply as a story of faith, eroticism and pedantry, but as a bizarre, coded mathematical maze. And as they come closer and closer to deciphering the final puzzle of a book that has shattered careers, friendships and families, they know that their own lives are in mortal danger.  Because at least one person has been killed for knowing too much.  And they know even more.From the streets of fifteenth-century Rome to the rarified realm of the Ivy League, from a shocking 500 year-old murder scene to the drama of a young man's coming of age, The Rule of Four takes us on an entertaining, illuminating tour of history—as it builds to a pinnacle of nearly unbearable suspense.",
        "Category": " Fiction , Literary",
        "Publisher": "The Dial Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Conquering Diabetes: A Cutting-Edge, Comprehensive Program for Prevention and Treatment",
        "Authors": "By Peters, Anne L., M.D. and Harmel, Mark (PHT)",
        "Description": "The definitive guide to identifying and treating diabetes and prediabetes by a world-renowned pioneer in diabetes treatment and management.  Diabetes has struck Americans in epidemic proportions, and its complications-which are entirely preventable-can be devastating. As a result, the majority of the 60 million Americans afflicted with prediabetes or diabetes are confused, frightened, and are often receiving sub-par treatment from well-intentioned doctors who simply don't have the experience with the disease to give patients the care they desperately need. This book, written by a world-renowned pioneer in diabetes treatment who has already written the textbook on the topic for physicians, is a cutting-edge, comprehensive program to reverse prediabetes and to treat both types of diabetes, including: what foods to eat/avoid, which medications help/hurt, and how to get the best treatment from your doctor.  As one of the top twenty physicians treating diabetes in America, director of the USC Clinical Diabetes Programs, and the physician currently in charge of developing the nation's largest outreach program for community-based diabetes prevention and treatment, Dr. Anne Peters treats a spectrum of patients, from Hollywood producers, writers, and stars who frequent her clinic in Beverly Hills to the poor who populate her free clinic in East L.A.  Authoritative and reassuring, Dr. Peters' Prescription will arm readers and their physicians with the latest findings on the diabetes epidemic, helping them to confront the disease effectively and exponentially increase their quality of life.",
        "Category": " Health & Fitness , Diseases , Diabetes",
        "Publisher": "Hudson Street Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "discovering ballet in association with the royal ballet",
        "Authors": "By May, Robin",
        "Description": "",
        "Category": "",
        "Publisher": "Enigma",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Quick Easy Sewing Projects (Singer Sewing Reference Library)",
        "Authors": "By Singer Sewing",
        "Description": "",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "Cy Decosse",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "American Blessings: A Celebration of Our Country's Spirit",
        "Authors": "By Running Press, Washburn, Michael (EDT), and Oyama, Susan (EDT)",
        "Description": "",
        "Category": " Social Science , Customs & Traditions",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Galileo's Daughter: A Historical Memoir of Science, Faith and Love",
        "Authors": "By Sobel, Dava",
        "Description": "",
        "Category": "",
        "Publisher": "Walker & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Beyond Interdependence: The Meshing of the World's Economy and the Earth's Ecology",
        "Authors": "By Macneill, Jim, Winsemius, Pieter, and Yakushiji, Taizo",
        "Description": "Over the last year, the world has seen some cataclysmic changes. Eastern Europe is no longer yoked with Soviet communism, Germany is again a single, powerful nation, and Russia itself is pursuing a free-market economy at an almost frantic pace. Yet as we focus on the triumph of democracy, it is easy to overlook the potentially catastrophic changes that face the world environment, changes that are inextricably linked to the workings of the political and economic institutions of our time.Beyond Interdependence builds upon the Brundtland Commission's landmark reportOur Common Future, a book that has been hailed as \"the most important document of the decade on the future of the world\" and has sold over one-half million copies in nineteen foreign languages. Dr. Jim MacNeill, the principal author of both works, has in this latest study extended the Commission's analysis of the critical relationships between the global environment, the world economy, and the international order. Together with his eminent colleagues, Pieter Winsemius and Taizo Yakushiji, MacNeill shows that while our global economy and ecology have become completely interlocked, they have remained separate in our institutions, and in the minds of our policymakers. The result is a wide range of domestic and international policies that are accelerating the depletion of Earth's basic ecological (and economic) capital--its rivers, lakes, and oceans, its soils and forests, its flora and fauna, and its ozone shield. These short-sighted policies also threaten us in the next century with a greater rise in global warming and sea level than have occurred in the ten-thousand years since the last ice age. The authors argue that this environmental degradation and resource depletion will be the principal source of interstate conflict in the post-cold war world.Providing a fresh analysis of the issues of global change, and taking into account such recent events as the tidal-shift in East/West relations and the G7 Economic Summit in Houston,Beyond Interdependence shows how industrialized nations can take unilateral action to address environmental threats while improving macroeconomic efficiency and international competitiveness. It also demonstrates how developed nations can negotiate a series of mutually advantageous \"bargains\" with Eastern European and Third World nations.With its incisive analysis and far-reaching recommendations for policy reform, Beyond Interdependence shows us how we can act urgently but intelligently to advance our common future.",
        "Category": " Computers , Computer Science",
        "Publisher": "Oxford University Press, USA",
        "Price Starting With ($)": "5.45",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "I Spy Fun House: A Book of Picture Riddles",
        "Authors": "By Marzollo, Jean and Wick, Walter (PHT)",
        "Description": "With 24 million copies sold, the bestselling I Spy series is being relaunched with new designs and foil covers.This bestselling book features riddles that send readers searching through 13 photographs with a fun house theme.",
        "Category": " Juvenile Nonfiction , Games & Activities , Puzzles",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "A Stranger is Watching",
        "Authors": "By Clark, Mary Higgins",
        "Description": "Four people whose lives have been shattered by a murder find themselves in continuing conflict as the hour of the convicted murderer's execution approaches",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1980"
        }
    },
    {
        "Title": "Making Connections: The Relational Worlds of Adolescent Girls at Emma Willard School",
        "Authors": "By Gilligan, Carol, Lyons, Nona P., and Hanmer, Trudy J. (EDT)",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Bombardiers: A Novel of Business",
        "Authors": "By Bronson, Po",
        "Description": "The bombardiers in Po Bronson's novel are bond salespeople at the firm of Atlantic Pacific, grunts who wake up at 4 a.m. to hustle financial products they barely understand. They work the phones, shout the morning line, sacrifice their personal lives, and push themselves to the physical limit to meet their quotas. They are soldiers of an economic superpower, ragtag troops staking the front line of American corporate influence.The reluctant hero of Bombardiers is Sidney Geeder, King of Mortgages, who dreams of cashing in his lucrative company stock and quitting his job. The only one who can replace him is Eggs Igino, a rebellious boy wonder who refuses to be seduced by the money or intimidated by management threats. When Eggs Igino mysteriously disappears, Sid is caught in the ensuing havoc and eventually is forced to choose between his promised pay-out and his long-anticipated freedom.Sid and Eggs are joined in the trenches by an unforgettable group of salespeople: Lisa Lisa, a woman tough enough to call Alan Greenspan a peckerhead but incapable of keeping a lover; Nickel Sansome, a bald company man who couldn't sell mittens in a snowstorm; and Coyote Jack, the sales manager so overwhelmed by corporate ambition that he forces his traders to sell more bonds than they can handle.As the deals swirl, faster and riskier and bigger, the transactions become increasingly bizarre: shifting around the debt of failed savings and loans, financing investment in bankrupt Eastern European nations, and, finally, arranging a corporate takeover of certain assets in the Dominican Republic (in this case, the entire country).Set at the nexus of pure capitalism, the Information Economy, and high technology, Bombardiers will change the way you think about modern business.",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "The proud decades: America in war and in peace, 1941-1960",
        "Authors": "By Diggins, John P",
        "Description": "",
        "Category": "",
        "Publisher": "Norton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "King Edward III",
        "Authors": "By Packe, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Routledge Kegan & Paul",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "Greek masterworks of art",
        "Authors": "By Wegner, Max",
        "Description": "",
        "Category": "",
        "Publisher": "G. Braziller",
        "Price Starting With ($)": "7.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Cooking with Grease: Stirring the Pots in America",
        "Authors": "By Brazile, Donna",
        "Description": "Cooking with Grease is an inspiring, behind-the-scenes memoir of the life and times of a tenacious political organizer and the first African-American woman to head a major presidential campaign.  Donna Brazile fought her first political fight at age nine -- campaigning (successfully) for a city council candidate who promised a playground in her neighborhood. The day after Martin Luther King Jr. was assassinated, she committed her heart and her future to political and social activism. By the 2000 presidential election, Brazile had become a major player in American political history -- and she remains one of the most outspoken and forceful political activists of our day.  Brazile grew up one of nine children in a working-poor family in New Orleans, a place where talking politics comes as naturally as stirring a pot of seafood gumbo -- and where the two often go hand in hand. Growing up, she learned how to cook from watching her mother, Jean, stir the pots in their family kitchen. She inherited her love of reading and politics from her grandmother Frances. Her brothers Teddy Man and Chet worked as foot soldiers in her early business schemes and in her voter registration efforts as a child.  Cooking with Grease follows Donna's rise to greater and greater political and personal accomplishments. But each new career success came with its own kind of heartache, especially in her greatest challenge: leading Al Gore's 2000 campaign, making her the first African American to lead a major presidential campaign.  Cooking with Grease is an intimate account of Donna's thirty years in politics. Her witty style and innovative political strategies have garnered her the respect and admiration of colleagues and adversaries alike -- she is as comfortable trading quips with Karl Rove as she is with her Democratic colleagues. Her story is as warm and nourishing as a bowl of Brazile family gumbo.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "East of the Sun: The Epic Conquest and Tragic History of Siberia",
        "Authors": "By Bobrick, Benson",
        "Description": "In sweep, color, and grandeur, the conquest and settlement of Siberia compares with the winning of the American West. It is the greatest pioneering story in human history, uniquely combining the heroic colonization of an intractable virgin land, the ghastly dangers and high adventure of Arctic exploration, and the grimmest saga of penal servitude in the chronicles of man. Four hundred years of continual human striving chart its course, a drama of unremitting extremes and elemental confrontations, pitting man against nature, and man against man. East of the Sun, a work of panoramic scope and brilliance, is the first complete account of this strange and terrible story.To most Westerners, Siberia is a vast and mysterious place. The richest resource area on the face of the earth, its land mass covers 5 million square miles - 7 1/2 percent of the total land surface of the globe. From the first foray in 1581 across the Ural Mountains by a band of Cossack outlaws to the fall of Gorbachev, East of the Sun is history on a grand scale. With vivid immediacy, Bobrick describes the often brutal subjugation of Siberia's aboriginal tribes and the cultures that were destroyed; the great eighteenth-century explorations that defined Siberia's borders and Russia's attempt to \"extend\" Siberia further with settlements in Alaska, California, and Hawaii; and the transformation of Siberia into a penal colony for criminal and political exiles, an experiment more terrible than Australia's Botany Bay. There is the building of the stupendous Trans-Siberian Railway across seven time zones; Siberia's key role in the bloody aftermath of the October Revolution in 1917; and Stalin's dreaded Gulag, which corrupted its very soil.Today, Siberia is the hope of Russia's future, now that all her appended republic have broken away. Its story has never been more timely.",
        "Category": " History , General",
        "Publisher": "Poseidon Pr",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Adventures in Ocean Exploration : From the Discovery of the Titanic to the Search for Noah's Flood",
        "Authors": "By McConnell, Malcolm and Ballard, Robert D.",
        "Description": "Few men know the ocean as well as Robert Ballard. A pioneering  marine scientist, he has dived in submersibles in all the  planet's oceans, contributed key pieces to such scientific  puzzles as plate tectonics and deep-ocean biology, and located  scores of wrecked ships all over the world, included the doomed  liner Titanic and the battered hulk of the German battleship  Bismarck. Now, in this generously illustrated chronicle of our  age-old fascination with the sea, he interweaves his experiences  at the heart of modern undersea exploration with a vivid account  of thousands of years of seafaring and discovery, as his own most  exciting and important dives become the starting points for an  odyssey through time that introduces the greatest sailors and  voyages of history and sketches the evolution of ships and  navigation from the first reed boats to the nuclear submarines of  today.",
        "Category": " Science , Earth Sciences , Oceanography",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "7.61",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Coming on Home Soon (Caldecott Honor Book)",
        "Authors": "By Woodson, Jacqueline and Lewis, Earl B. (ILT)",
        "Description": "Jacqueline Woodson is the 2018-2019 National Ambassador for Young People’s LiteratureAda Ruth's mama must go away to Chicago to work, leaving Ada Ruth and Grandma behind. It's war time, and women are needed to fill the men's jobs. As winter sets in, Ada Ruth and her grandma keep up their daily routine, missing Mama all the time. They find strength in each other, and a stray kitten even arrives one day to keep them company, but nothing can fill the hole Mama left. Every day they wait, watching for the letter that says Mama will be coming on home soon. Set during World War II, Coming On Home Soon has a timeless quality that will appeal to all who wait and hope.",
        "Category": " Juvenile Fiction , Historical , United States , 20th Century",
        "Publisher": "Nancy Paulsen Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "A Wok For All Seasons",
        "Authors": "By Yan, Martin",
        "Description": "This companion to the author's twenty-six part PBS series features more than one hundred recipes, including recipes for one-dish meals, banquets and special occasions, vegetarian meals, and Chinese adaptations of Western favorites",
        "Category": " Cooking , Methods , Wok",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Favorite Meals from Williamsburg",
        "Authors": "By Sheppard, Donna C.",
        "Description": "",
        "Category": "",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "9.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Memoirs of a Cook: Yesterday and Today",
        "Authors": "By Knopf, Mildred O.",
        "Description": "Presents a wide-ranging collection of personal recipes interspersed with recollections of memorable meals and the special occasions on which some of these dishes were served",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "A Summons to Memphis",
        "Authors": "By Taylor, Peter Hillsman",
        "Description": "Winner of the 1987 Pulitzer Prize for Fiction.\"American readers demand novels, and now Peter Taylor has given them one; to say that it is every bit as good as the best of his short stories is the highest compliment it can be paid.\"THE WASHINGTON POST BOOK WORLDWhen Phillip Carver receives, on a lonely Sunday evening, two successive telephone calls from his sisters, begging him to leave his home in Manhattan and return immediately to Memphis, he is slow to agree. His sisters, middle-aged and unmarried, want his help in averting the remarriage of their father, an elderly widower. And although Phillip wants no part in such manipulations, he finds himself unable to refuse to make the trip South...and into his own past.",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "The Science in Science Fiction",
        "Authors": "By Nicholls, Peter",
        "Description": "An illustrated survey of the actual science behind recent science fiction investigates the frontiers of contemporary scientific knowledge and the possibility, and probability, of starships, cyborgs, time travel, and other \"science-fiction\" phenomena",
        "Category": " Science , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Close Combat: Book VI of the Corps",
        "Authors": "By Griffin, W. E. B.",
        "Description": "Millions of readers have been swept away by W. E. B. Griffin's novels of the Marine Corps, a series that has only grown stronger and more popular with each volume. And now Close Combat - Volume VI - brings the saga of The Corps during World War II into ever more dramatic arenas.As the Japanese forces close in for an all-out effort to recapture Guadalcanal from the American forces occupying the island, many fates converge and intertwine. First Lieutenant William Dunn, twenty-one years old but already one of only two pilots remaining from his fighter squadron's original sixteen, must learn what it is like to lead men - and to lose them....Hot-tempered Sergeant Thomas McCoy finds he has a hero's welcome waiting stateside - if he can avoid a court-martial first....On a bloody island, Major Jake Dillon discovers just how much combat is involved in a combat correspondent's life....First Lieutenant R. B. Macklin, a consummate bully, is put on a War Bond tour so he will not endanger his own men....General Fleming Pickering, on a ticklish diplomatic mission, attempts to balance the hot and mighty temperaments of Douglas MacArthur, OSS chief Bill Donovan and Secretary of the Navy Frank Knox....Corporal Robert Easterbrock, still wet behind the ears, discovers that the price of success in wartime may be uncomfortably high....From the Solomons to Australia to Washington, D.C., old faces and new - generals, captains, privates, wives and sweethearts - find themselves faced with the challenge of their lives.This is the story of the men of the Marine Corps, their loves and loyalties, of an elite fraternity united by courage and honor. Filled with crackling realism and adventure, rich characters, real heroes, and that special flair for the military heart and mind that make Griffin's novels so loved, Close Combat is a dramatic, captivating novel, further proof, in the words of Tom Clancy, that \"W. E. B. Griffin is a storyteller in the grand tradition.\"",
        "Category": " Fiction , War & Military",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Healing ADD : Simple Exercises That Will Change Your Daily Life",
        "Authors": "By Hartmann, Thom",
        "Description": "Offers simple psychological exercises designed to produce positive changes in children and adults with Attention Deficit Disorder, based on the theory that ADD is a survival strategy rather than a medical disorder. Reprint. 25,000 first printing. Tour. IP.",
        "Category": " Psychology , Psychopathology , General",
        "Publisher": "Underwood-Miller",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Biopotency: A Guide in Sexual Success",
        "Authors": "By Berger, Richard E. and Berger, Deborah",
        "Description": "A former Director of the Atomic Energy Commission recounts the development of the atomic bomb and discusses U.S. nuclear policy and the pros and cons of nuclear power",
        "Category": " Family & Relationships , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Masterpieces of Mystery and Suspense",
        "Authors": "By Greenberg, Martin Harry (EDT)",
        "Description": "Forty mystery stories include works by Edgar Allan Poe, Agatha Christie, Arthur Conan Doyle, Ellery Queen, Ross Macdonald, John MacDonald, Ruth Rendell, Dick Francis, P.D. James, Bill Pronzini, Donald Westlake, and Lawrence Block",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Movie Masterminds",
        "Authors": "By Bergan, Ronald and Karney, Robyn",
        "Description": "",
        "Category": "",
        "Publisher": "Portland House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "Little Lamb's Easter Surprise (Sparkling Egg Books)",
        "Authors": "By McQueen, Lucinda (ILT) and Shaw, Gina",
        "Description": "While playing in the meadow, Little Lamb discovers the joys of an Easter egg hunt and makes a new friend, in a shaped, holiday board book which features non-toxic glitter on every page.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Easter & Lent",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "London Bridges (Alex Cross Novel)",
        "Authors": "By Patterson, James",
        "Description": "In broad desert daylight, a mysterious platoon of soldiers evacuates the entire population of Sunrise Valley, Nevada. Minutes later, a huge bomb detonates a hundred feet above the ground and lays waste to homes, cars, and playgrounds: a town annihilated in an instant.Alex Cross is on vacation in San Francisco with his girlfriend, Jamilla Hughes, when he gets the call. The Russian supercriminal known as the Wolf claims responsibility for the blast. The Wolf is the deadliest nemesis Cross has ever faced, and the fact that he is still at large is agonizing for Cross and his new bosses at the FBI.Major cities around the globe, including London, Paris, and New York, are threatened with total destruction. The Wolf has proven he can do it - the only question is, can anyone stop him in time? Surveillance film of the blast reveals the presence of another of Alex Cross's most dangerous enemies, the ruthless assassin known as the Weasel. The thought of these two dark geniuses joining forces makes Alex's blood run cold.World leaders have just four days to prevent an unimaginable cataclysm. In a matter of hours, Cross is catapulted into an international chase of astonishing danger. Joining forces with Scotland Yard and Interpol, Alex fights his way through a torrent of false leads, impersonators, and foreign agents before he gets close to the heart of the crimes.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Paint Recipes: A Step-by-Step Guide to Colors and Finishes for the Home",
        "Authors": "By Wagstaff, Liz",
        "Description": "Both an easy-to-use how-to-guide and an eye catching style book, this innovative painting manual shows homeowners, designers, and craftspeople how to create 50 beautiful paint effects&#151;from ageing and verdigris to stippling and trompe l'oeil&#151;in more than 150 gorgeous colors for walls, floors, ceilings, and furniture. Handy features include chapters laid out like recipes, complete with \"ingredients,\" equipment, and step by step instructions to inspire do-it-yourselfers at every level of experience. With a comprehensive source listing; beautiful, full color photography; and a striking design&#151;plus a durable, wipe clean cover to resist splatters at the work site&#151;Paint Recipes offers the perfect combination of practicality and style, all at a terrific price.",
        "Category": " House & Home , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Pull Yourself Up By Your Bra Straps: And Other Quacker Wisdom",
        "Authors": "By Bice, Jeanne",
        "Description": "Jeanne Bice is funny, vivacious, and larger than life. She's also a self-made woman. Ten years ago, when she began selling her line of \"Quacker Factory\" brand clothing on QVC, she barely had two pennies to rub together. But from the moment she hit the airwaves, she became one of the network's most popular guests. While her sparkly, whimsical sweaters drew raves, viewers really tuned in for Jeanne herself--for her wit and wisdom, and for her inspiring story of pulling herself up--well, by her bra straps. Now Jeanne has compiled her signature stories and the lessons she's learned into a quirky, quacky book that will resonate with her fans--thousands of women who call themselves \"Quackers\" and greet one another by saying, \"Quack, quack, quack!\"Each chapter is a colorful lesson told in Jeanne's folksy, endearing voice, with advice like \"If you can't lose it, decorate it!\" and \"Take a leap--and grow your wings on the way down.\" Reading these stories will lift your spirits, bring a smile to your face, and empower you to make your dreams come true.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Intelligence in War: Knowledge of the Enemy from Napoleon to Al-Qaeda",
        "Authors": "By Keegan, John",
        "Description": "In fiction, the spy is a glamorous figure whose secrets make or break peace, but, historically, has intelligence really been a vital step to military victories? In this breakthrough study, the preeminent war historian John Keegan goes to the heart of a series of important conflicts to develop a powerful argument about military intelligence. In his characteristically wry and perceptive prose, Keegan offers us nothing short of a new history of war through the prism of intelligence. He brings to life the split-second decisions that went into waging war before the benefit of aerial surveillance and electronic communications. The English admiral Horatio Nelson was hot on the heels of Napoleon’s fleet in the Mediterranean and never knew it, while Stonewall Jackson was able to compensate for the Confederacy’s disadvantage in firearms and manpower with detailed maps of the Appalachians. In the past century, espionage and decryption have changed the face of battle: the Japanese surprise attack at the Battle of the Midway was thwarted by an early warning. Timely information, however, is only the beginning of the surprising and disturbing aspects of decisions that are made in war, where brute force is often more critical.Intelligence in War is a thought-provoking work that ranks among John Keegan’s finest achievements.",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Along with Youth: Hemingway, the Early Years",
        "Authors": "By Griffin, Peter",
        "Description": "Peter Griffin has drawn upon a wealth of previously unpublished material--including numerous letters and five of Hemingway's early short stories that appear here in their entirety--to trace the formative years of one of America's Most celebrated and influential authors.     This book examines in richer detail than any previous biography Hemingway's midwestern childhood, his relations with his parents, his journalistic apprenticeship, and his experiences as a Red Cross volumteer during World War I.  It sheds new light on his wartime romance with Agnes Kurowsky, his first love, and the circumstances surrounding his wounding and convalescence.  It closes with Hemingway at the brink of the literary career that would bring him worldwide acclaim.  As the brisk narrative moves from Illinois to Kansa City on to New York and then Europe, Griffin paints a vivid picture of the people, places and events that shaped Hemingway as a man and a writer.  This is the first installment of what promises to become the difinitive Hemingway biography for this generation.  In a foreword to the book, Jack Hemingway, Ernest's first son, writes that Griffin's \"insights and his innate skills have enabled him to bring a far different view of Hemingway as a developing human being.\"  This book, he says, \"has shown me insights into my own father's character and behavior I would not have thought possible in view of the time lapse between Hemingway's death and the research Griffin accomplished.\"",
        "Category": " History , Middle East , Israel & Palestine",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Sundari",
        "Authors": "By Davis, Rocky",
        "Description": "",
        "Category": "",
        "Publisher": "Barre / Westover",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Child of Her People",
        "Authors": "By Cameron, Anne",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Spinsters Ink",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Healing Voices: Feminist Approaches to Therapy With Women (JOSSEY BASS SOCIAL AND BEHAVIORAL SCIENCE SERIES)",
        "Authors": "By Laidlaw, Toni Ann and Malmo, Cheryl",
        "Description": "Combines theory, case studies, and personal accounts of therapy to describe a variety of innovative techniques including guided imagery, role-playing, storytelling, music, hypnosis, and massage that therapists can use to help women identify and express feelings, understand their experiences, and find solutions to problems. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Medical , General",
        "Publisher": "Jossey-Bass Inc Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "The Future Global Challenge: A Predictive Study of World Security, 1977-1990",
        "Authors": "By Brown, Neville",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Crane Russak & Co",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "February",
            "Year": "1978"
        }
    },
    {
        "Title": "The Executioner",
        "Authors": "By Pendleton, Don",
        "Description": "",
        "Category": "",
        "Publisher": "Pinnacle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Uncle John's Fourth Bathroom Reader",
        "Authors": "By Bathroom Readers' Institute",
        "Description": "Here's a pot-pourri of stimulating reading...for moments when nothing but the most absorbing material will do! No more frantic searches at the last minute for that perfect magazine article. No agonizing choices between light reading and the serious stuff. This little volume has it all: Entertainment, humor, education, trivia, science, history, pop culture...and more! And it's even divided by length-you can spend a minute with the Quickies, relax with Normal-Length articles, or really get comfortable with Long Items.With Uncle John's Bathroom Reader strategically placed in your home, you'll settle in happily and read about:-The origin of common words and phrases-The 7 wonders of the ancient world-The origin of Ronald -Elvis's letter to Richard Nixon-The curse of King Tut-World-class winners & losers-Famous pirates-And a host of great bathroom topics",
        "Category": " Humor , Form , Trivia",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "The Good Fight: Why Liberals---and Only Liberals---Can Win the War on Terror and Make America Great Again",
        "Authors": "By Beinart, Peter",
        "Description": "Once upon a time, liberals knew what they believed. They believed America must lead the world by persuasion, not command. And they believed that by championing freedom overseas, America itself could become more free. That liberal spirit won America's trust at the dawn of the cold war. Then it collapsed in the wake of Vietnam. Now, after 9/11, and the failed presidency of George W. Bush, America needs it back.In this powerful and provocative book, Peter Beinart offers a new liberal vision, based on principles liberals too often forget: That America's greatness cannot simply be asserted; it must be proved. That to be good, America does not have to be pure. That American leadership is not American empire. And that liberalism cannot merely define itself against the right, but must fervently oppose the totalitarianism that blighted Europe a half century ago, and which stalks the Islamic world today.With liberals severed from their own history, conservatives have drawn on theirs—the principles of national chauvinism and moral complacency that America once rejected. The country will reject them again, and embrace the creed that brought it greatness before. But only if liberals remember what that means. It means an unyielding hostility to totalitarianism—and a recognition that defeating it requires bringing hope to the bleakest corners of the globe. And it means understanding that democracy begins at home, in a nation that does not merely preach about justice, but becomes more just itself. Peter Beinart's The Good Fight is a passionate rejoinder to the conservatives who have ruled Washington since 9/11. It is an intellectual lifeline for a Democratic Party lying flat on its back. And it is a call for liberals to revive the spirit that swept America, and inspired the world.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Proof Positive",
        "Authors": "By Margolin, Phillip",
        "Description": "New York Times bestselling author Phillip Margolin returns with a shocking and enthralling thriller about the way CSI evidence can be misused by a killer with his own twisted sense of justice.Doug Weaver is a defense attorney who always believes the best of his clients, and Jacob Cohen, on trial for murder, is no exception. Jacob may be homeless and mentally ill, but Doug can't imagine that this meek and intensely religious man could have killed and dismembered a woman. Yet Bernard Cashman, a forensic expert at the Oregon State Crime Lab, finds evidence that indisputably connects Cohen with the crime.Frustrated and confused, Doug consults Amanda Jaffe, star of Margolin's spine-tingler Wild Justice. Amanda and her father, Frank, are working on a case that seems completely unrelated—gangster Art Prochaska is accused of murdering an informer. When Amanda starts looking too closely at the seemingly air-tight evidence in these two apparently unconnected cases, people start to die—and she discovers that a madman with the power to alter the truth is on the loose.From the author whose writing the Chicago Tribune called \"twisted and brilliant\" and hailed by Lisa Scottoline as \"genuinely surprising,\" Proof Positive promises an unbeatable combination of inside-CSI detail and intriguing insights into the minds of criminals and the attorneys who defend them—and, of course, the plot twists, stay-up-all-night suspense, and gasp-inducing surprises that are Phillip Margolin's undisputed trademark.",
        "Category": " Fiction , Legal",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Romo: My Life on the Edge--Living Dreams and Slaying Dragons",
        "Authors": "By Schefter, Adam, Towle, Philip, and Romanowski, Bill",
        "Description": "Off the field, Bill Romanowski was a caring father and devoted husband.On the field, Romo was unstoppable, terrorizing the NFL for sixteen brutal years.Some players called him a throwback, some called him mean, some called him dirty. But they all respected him and would much rather have played with him than against him. Coaches loved Romo for the heart and soul he gave to the game. He was rewarded with two Pro Bowl appearances and four Super Bowl rings, but it all came at a heavy price: dozens of concussions that have led to dizzy spells, memory lapses . . . and questionable choices that undermined his integrity. Would he do it all over again? Romo the intimidating linebacker would in a heartbeat. Bill Romanowski, however, would do things differently today.Whether it was in high school, at Boston College, or with the NFL, Romo vowed to himself that he would outwork and outhustle everyone else. Practice? Loved it; he'd play like it was a game and attack his teammates as if they were opponents. Game day? He'd work himself into a state of invincibility. If you were a tight end, running back, or quarterback with the wrong uniform, you were marked for elimination. Nutrition? He would consult top nutritionists, looking for the best foods, an extraordinary range of supplements, and alternative remedies, anything that would help give him an edge. It would lead to a controversial relationship with BALCO.Treatment? He would try almost anything that would help with his performance, keep his body healthy, and help it recover from the beatings he took and gave on Sundays. Phentermine, THG, hyperbaric chambers, IVs. He would experiment with substances and methods that the NFL had never heard of, and he'd become an expert who teammates and friends would turn to. Endurance? He never missed a game to injury, and once played an entire season with a partially torn knee ligament. Intimidation? From trash talk to mind games to nasty hits and breaking fingers, Romo would roam the field seeking confrontation -- and usually find it.Through it all -- through his years with the San Francisco 49ers, the Philadelphia Eagles, the Denver Broncos, and the Oakland Raiders -- Romo was driven by something else: the fear of failure, the fear of losing it all. Who knew what a head coach or an owner would be thinking or what young player was in the wings ready to take his hard-won position. He didn't dare allow someone else to decide his fate, so he did whatever it took to live his dreams and ward off the dragons of self-doubt that pushed him . . . until his body betrayed him and his morality was compromised.Romo is a jolting, candid, and inspiring rocket ride into the heart of the NFL and a look at what it costs to be an elite athlete today in a world of impossible expectations.  Read it -- and try not to wince.",
        "Category": " Sports & Recreation , Football",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Dark Tort: A Novel of Suspense (Goldy Culinary Mysteries)",
        "Authors": "By Davidson, Diane Mott",
        "Description": "The New York Times bestselling author cooks up a knockout treat featuring the irrepressible caterer Goldy Schulz\"I tripped over the body ofDusty Routt at half past ten on thenight of October 19. . . .\"Goldy Schulz has a lucrative new gig, preparing breakfasts and conference-room snacks for a local law firm. It's time-consuming, but Goldy is enjoying it -- until the night she arrives to find Dusty, the firm's paralegal, dead.The poor young woman also happened to be Goldy's friend and neighbor, and now Dusty's grieving mother begs Goldy to find out who murdered her daughter.Just because the police are on the case doesn't mean Goldy can't do a little snooping herself. While catering a party at the home of one of the firm's lawyers, she manages to overhear an incriminating conversation and ends up discovering a few clues in the kitchen.Before long, Goldy is knee-deep in suspects, one of whom is incredibly dangerous and very liable to cook Goldy's goose.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Lance Armstrong's War: One Man's Battle Against Fate, Fame, Love, Death, Scandal, and a Few Other Rivals on the Road to the Tour de France",
        "Authors": "By Coyle, Daniel",
        "Description": "“A velvety mix of vivid, sophisticated prose, Raymond Carver’s unerring eye for nuance, and John Irving’s irreverent, unflinching humor….An intimate look inside the maelstrom of professional cycling.”—Boston Globe Daniel Coyne’s New York Times bestseller Lance Armstrong’s War takes a fascinating, in-depth  look at a staggeringly talented yet  flawed sports hero as he faced his greatest test: a record sixth straight Tour de France victory. Now with a new epilogue covering Armstrong's quest to win an 8th Tour de France, this “intimate, insightful, unflinching look at the greatest athlete of our time” (Jon Krakauer) explores the remarkable drive and accomplishments of a controversial champion—a must read for fans of John Feinstein and David Halberstam, as well as readers of Lance Armstrong’s own It’s Not About the Bike and Every Second Counts.",
        "Category": " Sports & Recreation , Cycling",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The Ribbajack: and Other Curious Yarns",
        "Authors": "By Jacques, Brian",
        "Description": "A collection of six short stories which feature a variety of monstrous creatures by the author of the Redwall series.  What if revenge were a monster of your own creation?nbsp; IF all you needed to summon this monster was enough hatred and enough imagination?nbsp; Which of you would really be the monster? One boy is about to find out. The New York Times bestselling author Brian Jacques ( Loamhedge; The Angel's Command ) spins six all-new tales of horror and suspense. Read on, but be careful of what brewsin your heart.nbsp; You may just find yourself the next victim of the Ribbajack.A collection of six short stories which feature a variety of monstrous creatures by the author of the Redwall series.",
        "Category": " Young Adult Fiction , Horror",
        "Publisher": "Philomel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "An Open Heart: Practicing Compassion in Everyday Life",
        "Authors": "By Dalai Lama XIV and Vreeland, Nicholas (EDT)",
        "Description": "Compassion-sympathy for the suffering of others and the desire to free them from it-is wrestled with in all spiritual traditions. Yet how does one actually become a compassionate person? What are the mechanisms by which a selfish heart is transformed into a generous heart? In this acclaimed bestseller, His Holiness the Dalai Lama writes simply and powerfully about the everyday Buddhist practice of compassion, offering a clear, practical, inspiring introduction to the Buddhist path to enlightenment.",
        "Category": " Philosophy , Religious",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Prom",
        "Authors": "By Anderson, Laurie Halse",
        "Description": "High school senior Ashley Hannigan doesn't care about prom, but she's the exception. It's pretty much the only good thing at her urban Philadelphia high school, and everyone plans to make the most of it-especially Ash's best friend, Natalia, who's the head of the committee. Then the faculty advisor is busted for taking the prom money, and Ash suddenly finds herself roped into putting together a gala dance out of absolutely nada. But she has help-from her large and loving (if exasperating!) family, from Nat's eccentric grandmother, from her fellow classmates. And in putting the prom together, Ash learns that she has choices about her life after high school. Prom has everything that award-winning author Laurie Halse Anderson is known for-humor, poignancy, teen readers' tough issues dealt with head-on, and a voice teen readers will recognize as their own.",
        "Category": " Young Adult Fiction , Family , General",
        "Publisher": "Viking Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Lighting the Way: Nine Women Who Changed Modern America",
        "Authors": "By Schiff, Karenna Gore",
        "Description": "Provides an inspirational and illuminating study of nine women who transformed modern America through their battle against inequity and social injustice, including Ida B. Wells-Barnett, Mother Jones, Alice Hamilton, Frances Perkins, Viriginia Durr, Septima Clark, Dolores Huerta, Dr. Helen Rodriguez-Trias, and Gretchen Buchenholtz. 75,000 first printing.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Miramax",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Rage and Fire: A Life of Louise Colet : Pioneer Feminist, Literary Star, Flaubert's Muse",
        "Authors": "By Gray, Francine du Plessix",
        "Description": "In this ground-breaking biography of a heroic feminist and literary figure, novelist and essayist Francine du Plessix Gray brilliantly resurrects one of the most fascinating women of the nineteenth century.To English-language readers, the flamboyant and beautiful Louise Colet (1810-1876) is best known as Gustave Flaubert's great love; as a central model for Emma Bovary; and as the recipient of Flaubert's most treasured letters, a voluminous six-year correspondence that offers his most eloquent statements on literature and an invaluable chronicle of Madame Bovary's composition.What is less known about Louise Colet is that at the apogee of her career she was, along with George Sand, one of the most famous women writers in France, a prolific author equally fluent in poetry, fiction, historical essays, and journalism. Known as \"the Muse,\" Colet presided over a renowned salon of mid-nineteenth-century Paris. At age twenty-nine she won the poetry prize of the Academie Francaise, and she went on to receive the prize three more times in the next fourteen years, more often than any other woman in French history. The confidante of Madame Recamier, Victor Hugo, and Leconte de Lisle and a lover of Alfred de Vigny and Alfred de Musset, this self-supporting single mother refused to share her home with a man lest it compromise the principle of liberty she lived by. In her work, Louise Colet was one of the first nineteenth-century authors to explore the historical causes of female alienation; in her private life, she pioneered a new model of womanhood in an age when the only sanctioned options for women were \"housewife or whore.\"Drawing from Colet's recently discovered journals, which, like Flaubert's letters, can be startlingly erotic, Gray vividly brings to life this formidable woman's world and unmasks the astonishing sexual and social mores of nineteenth-century France. Written in a novelistic, richly detailed style but researched with meticulous scholarship, this biography portrays the complexities of a woman who ascended to fame and literary respectability through her talent and a willful spirit that refused to acknowledge the word \"no.\"",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Moses the Kitten",
        "Authors": "By Herriot, James and Barrett, Peter",
        "Description": "A bedraggled orphaned kitten is nursed back to health on a Yorkshire farm and when he recovers turns out to have a very unusual idea about the identity of his mother.",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "129.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Ebb of the river",
        "Authors": "By Mears, Richard Chase",
        "Description": "",
        "Category": "",
        "Publisher": "Wyndham Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Witness: For the Prosecution of Scott Peterson",
        "Authors": "By Frey, Amber",
        "Description": "The press has been filled with information and misinformation about the true nature of Islam. Hasan represents what is left out of the daily newspapers and explains why being a Muslim is not merely a matter of birth, but it is a matter of choice. In the wake of 9–11, the activities of Osama Bin Laden and Hamas, and the most recent Gulf War, the western press has been filled with information and mis–information about the true nature of Islam. Is it a feudal misogynist belief system that is a threat to Western values? Is it an ideology of oppression? Or, is it a religion that is as varied as Christianity; a \"big tent\" that includes not only bomb–throwing ideologues, but also those committed to an authentic spirituality that embraces many of the values shared by the mainstream in Europe and America? Why I am a Muslim is an attempt to grapple with these issues. Part memoir, part polemic, it represents the side of Islam that is left out of the daily newspapers. For Hasan, being a Muslim is not merely a matter of birth, but it is a matter of choice. In seven chapters, she presents seven reasons why she is committed to Islam and why it is a viable spiritual option for anyone. 1. Because I was born Muslim. 2. Because Islam gives me a direct relationship with God. 3. Because Islam has a rich mystical tradition in Sufism. 4. Because Islam allows and expects me to make mistakes. 5. Because Islam is ethnically diverse. 6. Because Islam is a woman&#39;s religion. 7. Because being Muslim makes me a better American (and being American makes me a better Muslim).",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Regan Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Fanatics & Fools: The Game Plan for Winning Back America",
        "Authors": "By Huffington, Arianna",
        "Description": "A scathing critique of the American political system looks at how America's political leaders on a state and national level have cheated and deceived voters and how political corruption has disenfranchised Americans of all political beliefs. 150,000 first printing.",
        "Category": " Political Science , General",
        "Publisher": "Miramax",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Random House Word Menu: New and Essential Companion to the Dictionary",
        "Authors": "By Glazier, Stephen",
        "Description": "The ultimate word and idea resource for anyone who is curious about language or wants to write creatively. Like a fantastic restaurant menu with hundreds of vocabulary categories and thousands of tempting choices.More than a dictionary, the Random House Word Menu arranges words in a logical structure - with nearly 800 divisions and 75,000 entries. More than a thesaurus, it also provides definitions - describing words clearly and concisely. And it's fully indexed to help you find the words you need.Seven major sections - Nature, Science and Technology, Domestic Life, Institutions, Arts and Leisure, Language, and The Human Condition - cover an encyclopedic range of subjects. This organizational focus enables the reader to distinguish and compare similar or related words in ways that are impossible in most alphabetical reference works.Take a quick course in the terminology of an unfamiliar field.Discover different ways of saying the same thing.Correctly employ technical terms and jargon.Match a known meaning to an unknown word.The Random House Word Menu is an invaluable source of information for browsers, students and teachers, writers and editors, translators, secretaries, and all business people and professionals.",
        "Category": " Reference , Word Lists",
        "Publisher": "Random House Reference",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Education of a Coach",
        "Authors": "By Halberstam, David",
        "Description": "Bill Belichick is one of the most intriguing yet enigmatic figures in contemporary American sports. He is the best professional football coach of our era, and his New England Patriot teams are the winners of three of the last four Super Bowls - including one of the most stunning upsets in that championship series. Yet until now, Belichick has deliberately stayed as far from the spotlight as possible, proving himself as elusive as he is talented.In The Education of a Coach, writer-historian David Halberstam paints a portrait of a man and his profession, revealing both the intimate world of Bill Belichick and the unique abilities that make him so successful: His exceptional intelligence, his ability to break down and exploit game film, his singular discipline, and his almost unmatched work ethic. Working with an unusual degree of cooperation from Belichick, Halberstam shows us a man acutely aware of all the forces in contemporary sports that work against the old-fashioned concept of team, who has somehow managed to change his players' view of how the game should be played. The result is a book not just about Bill Belichick, but about what it means to be a leader.",
        "Category": " Sports & Recreation , Coaching , Football",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Backstabber: A Hitchcock Sewell Mystery (Hitchcock Sewell Mysteries)",
        "Authors": "By Cockey, Tim",
        "Description": "He's suave, he's sexy, he's cool . . . and he's an undertaker. Hitchcock Sewell is back in one of the funniest and most fast-paced novels yet, in Tim Cockey's celebrated award-winning series.A man has been murdered in his kitchen. And the apparent killer wants Hitch to scoop up the body and take it away . . . before the police have arrived. Meanwhile, across town, Hitch smells a rat--maybe two--in the nursing home where an old friend of his has taken up residence. With his matchless wit and uncommon ability to dig out the truth, Hitch is once again up to his old tricks . . . and mystery readers couldn't be happier.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "The Brilliant Bean: Sophisticated Recipes for the World's Healthiest Food",
        "Authors": "By Stone, Sally and Stone, Martin",
        "Description": "Describes different kinds of beans, and provides recipes for appetizers, terrines, soups, pasta and rice dishes, side dishes, main dishes, salads, desserts and baked goods that feature beans",
        "Category": " Cooking , Reference",
        "Publisher": "Bantam",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Concord River",
        "Authors": "By Richardson, Laurence Eaton",
        "Description": "",
        "Category": "",
        "Publisher": "Barre Publishers",
        "Price Starting With ($)": "12.63",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Etiology Treat Bulim",
        "Authors": "By Johnson, Craig and Connors, Mary E.",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "An Illustrated History of the Navies of World War II",
        "Authors": "By Preston, Antony",
        "Description": "",
        "Category": "",
        "Publisher": "Hamlyn",
        "Price Starting With ($)": "7.07",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Samuel Pepys: A Life",
        "Authors": "By Coote, Stephen",
        "Description": "Based in large part on Pepys' famous diary, this biography tells of his humble childhood as the son of a tailor, and his career and success leading him to positions in Parliament and the Admiralty. Coote (an author) tells of Pepys' private life, including a picture of his relationship with his wife (and, his relationships with other women as well). Pepys' more conventional friendships with actors, scientists, and statesmen are also detailed.  Sixteen pages of black and white illustrations are included.  First published by Hodder and Stroughton in 2000.. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Palgrave Macmillan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Dramatic soundings;: Evaluations and retractions culled from 30 years of dramatic criticism",
        "Authors": "By Gassner, John",
        "Description": "",
        "Category": "",
        "Publisher": "Crown Publishers",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Morale",
        "Authors": "By Gardner, J.w.",
        "Description": "",
        "Category": " Literary Criticism , General",
        "Publisher": "Norton",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The Catch Colt.",
        "Authors": "By O'hara, Mary",
        "Description": "",
        "Category": " Drama , American , General",
        "Publisher": "Dramatists Play Service, Inc.",
        "Price Starting With ($)": "37.58",
        "Publish Date": {
            "Month": "October",
            "Year": "1964"
        }
    },
    {
        "Title": "Children Are from Heaven: Positive Parenting Skills for Raising Cooperative, Confident, and Compassionate Children",
        "Authors": "By Gray, John",
        "Description": "This brilliantly original and practical system for parenting children is the brainchild of John Gray, whose Men Are from Mars, Women Are from Venus books and seminars have helped millions of adults communicate more effectively and lovingly with each other. Based on this idea that children respond better to positive rather than negative reinforcement, the Children Are from Heaven program concentrates on rewarding, not punishing, children and fostering their innate desire to please their parents.Central to this approach are the five positive messages your children need to learn again and again:It's okay to be different.It's okay to make mistakes.It's okay to express negative emotions.It's okay to want more.It's okay to say no, but remember Mom and Dad are the bosses.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Your Money or Your Life",
        "Authors": "By Cavuto, Neil",
        "Description": "As the host of Fox News Channel's Your World with Neil Cavuto and Cavuto on Business, Neil Cavuto reports on today's most influential business leaders and newsmakers. His great talent is to get beneath the issues, connecting people to the events that define them and changing the way that Americans think about their money. Ending each show with a provocative, insightful commentary, Cavuto stirs people to see the world in a new light, calling on them to think beyond the stories at hand and challenging people to reevaluate the world that they live in.In Your Money or Your Life, Cavuto compiles the best of these commentaries in one volume, creating a collection that is at once witty, thought-provoking, and inspiring. Covering a variety of topics—from remembering life before 9/11, to providing tips for empty nesters—Cavuto presents a wry yet evocative look at our world, one that speaks to the heart of the American condition. Spanning one of the most tumultuous decades in memory—from the wild and chaotic Clinton years through the sobering challenges of the War on Terror—Cavuto's words offer a window into our America at its best and its worst.",
        "Category": " Performing Arts , Television , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Watching America  (What Television Tells Us About Our Lives)",
        "Authors": "By Lichter, S. Robert, Rothman, Stanley, and Lichter, Linda S.",
        "Description": "Examines how social issues have been presented in television programs from the 1950s to the present",
        "Category": " Social Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Southeast Asia: A History",
        "Authors": "By Williams, Lea E.",
        "Description": "Southeast Asia's recent turbulent history is described as well as the struggles that have taken place from the time of the prehistoric folk migrations",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1976"
        }
    },
    {
        "Title": "Baby Shower Book",
        "Authors": "By Glendenning, Pauline",
        "Description": "Forget showers filled with boring and embarrassing games&#151;today's baby showers are all about fun for the mommy-to-be and her guests! From invitations and games to menus and favors, The Everything Baby Shower Book, 2nd Edition helps you organize an entertaining and low-fuss party that everyone will enjoy. With dozens of party theme ideas, you'll find a party to suit any personality, including:A piano bar sing-along for a Broadway Baby EventA retro slumber party for the Girlfriends Go Wild BashHenna tattooing at the Belly Bump RevelryFortune-telling with tea leaves at the Tranquili-Tea GatheringA cooking competition at the Red Wagon Food Challenge ShowerTailgating and grilling fun at a Shower for DadsThe Everything Baby Shower Book, 2nd Edition helps you throw a shower that will be the envy of every mommy-to-be!",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "The Art of Fiction",
        "Authors": "By Gardner, John",
        "Description": "This guide to creative writing by the acclaimed novelist examines diverse facets of writing technique and contains analyses of works by writers from Homer to Mark Twain",
        "Category": " Literary Criticism , Books & Reading",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "No Jacket Required: Another Great Collection of Recipes from Incircle",
        "Authors": "By Lee, Marianna (EDT), Crampton, Michael (ILT), and Marcus, Neiman",
        "Description": "The third recipe book--whose proceeds will go to the Literacy Volunteers of America--compiled by the Neiman Marcus store contains more than two hundred and fifty recipes for casual but elegant dining, selected by five top chefs.",
        "Category": " Cooking , Regional & Ethnic , International",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Pushing the Envelope: All the Way to the Top",
        "Authors": "By MacKay, Harvey",
        "Description": "The author of the best-selling Swim with the Sharks Without Being Eaten Alive applies his business savvy to such topics as gaining the competitive edge, essential leadership qualities, balance, and productivity. 150,000 first printing. Tour.",
        "Category": " Business & Economics , Motivational",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Two Nations Black and White Separate Hostile Unequal",
        "Authors": "By Hacker, Andrew",
        "Description": "Why, despite continued efforts to increase understanding and expand opportunities, do black and white Americans still lead separate lives, continually marked by tension and hostility? In his much-lauded classic, newly updated to reflect the changing realities of race in our nation, Andrew Hacker explains the origins and meaning of racism and clarifies the conflicting theories of equality and inferiority. He paints a stark picture of racial inequality in America -- focusing on family life, education, income, and employment -- and explores the current controversies over politics, crime, and the causes of the gap between the races. Illuminating and oftentimes startling,Two Nations demonstrates how race has defined America's history and will continue to shape its future.",
        "Category": " Social Science , Discrimination & Race Relations",
        "Publisher": "Scribners",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "The Chez Eddy Living Heart Cookbook",
        "Authors": "By Gotto, Antonio M., Jr.",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster Books",
        "Price Starting With ($)": "5.23",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "The Power & the Glory: An Illustrated History of the U.S. Military",
        "Authors": "By Sullivan, Robert (EDT), Life Magazine (EDT), Life Books (COR), and Dole, Bob (INT)",
        "Description": "A colorful history of the United States military--Army, Navy, Air Force, and Marines--presents more than one hundred illustrations and photographs covering everything from George Washington's Revolutionary War army to the war in Afghanistan. 30,000 first printing.",
        "Category": " History , Military , General",
        "Publisher": "Life",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Autobiography of a Fat Bride: True Tales of a Pretend Adulthood",
        "Authors": "By Notaro, Laurie",
        "Description": "The author of the New York Times bestseller The Idiot Girls’ Action-Adventure Club tackles her biggest challenge yet: grown-up life.In Autobiography of a Fat Bride, Laurie Notaro tries painfully to make the transition from all-night partyer and bar-stool regular to mortgagee with plumbing problems and no air-conditioning. Laurie finds grown-up life just as harrowing as her reckless youth, as she meets Mr. Right, moves in, settles down, and crosses the toe-stubbing threshold of matrimony. From her mother's grade-school warning to avoid kids in tie-dyed shirts because their hippie parents spent their food money on drugs and art supplies; to her night-before-the-wedding panic over whether her religion is the one where you step on the glass; to her unfortunate overpreparation for the mandatory drug-screening urine test at work; to her audition as a Playboy centerfold as research for a newspaper story, Autobiography of a Fat Bride has the same zits-and-all candor and outrageous humor that made Idiot Girls an instant cult phenomenon. In Autobiography of a Fat Bride, Laurie contemplates family, home improvement, and the horrible tyrannies of cosmetic saleswomen. She finds that life doesn't necessarily get any easier as you get older. But it does get funnier.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Villard",
        "Price Starting With ($)": "7.72",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Lifespan Development",
        "Authors": "By Turner, Jeffrey S. and Helms, Donald B.",
        "Description": "",
        "Category": " Psychology , Developmental , General",
        "Publisher": "Harcourt College Pub",
        "Price Starting With ($)": "7.6",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Heroes of World War II",
        "Authors": "By Cross, Robin",
        "Description": "From Dunkirk and Salerno to Leyte, a collection of fifty gripping accounts of heroism on land, sea, and air during World War II investigates heroes of both the Allied and Axis sides of the war, illustrated with photographs and maps.",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "God's Choice: Pope Benedict XVI and the Future of the Catholic Church",
        "Authors": "By Weigel, George",
        "Description": "From the bestselling author of Witness to Hope comes an inside account of the election of Pope Benedict XVI and an unflinching view of the Catholic Church at the dawn of a new era.  After 25 years of John Paul II′s guidance, the Catholic Church is entering a new age, with its bedrock traditions intact but pressing questions of its vitality to address in a rapidly changing world. Beginning with a portrait of John Paul′s last months, God′s Choice will then offer an account of the complex conclave process that produced Benedict XVI as the next pope. Drawing on Weigel′s unprecedented access during the post-John Paul II intrerregnum, readers will be offered an inside view of the issues and personalities that shaped the conclave′s deliberations. Weigel will also survey the current state of the Church around the world: the remarkable vitality of Catholicism in Africa; the new center of the world′s Catholic population -- Latin America; the collapse of Catholic faith and practice in much of western Europe, contrasted with its strength in Poland and other parts of the post-communist world; the continuing struggles of Catholicism in Asia; the vibrancy of some aspects of Catholic life in the United States, even as the Church in America struggles to overcome its recent experience of scandal. God′s Choice will paint a personal portrait of the new pope and analyze the crucial issues facing world Catholicism in the first decades of the 21st century. It will be a major reference point for anyone seeking to understand the Catholic future, and the larger human future the Church will help to shape.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Trojan Horse (Mack Bolan, The Executioner, No 110)",
        "Authors": "By Pendleton, Don",
        "Description": "Mack Bolan works undercover to break up a German-Arab terrorist alliance determined to use nuclear warheads and nerve gas to build the Fourth Reich",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Gold Eagle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Schott's Sporting, Gaming, and Idling Miscellany",
        "Authors": "By Schott, Ben",
        "Description": "From the author of the international bestsellers Schott's Original Miscellany and Schott's Food and Drink Miscellany comes the third and most playful installment in the series: a miscellanist's wisdom from the worlds of sports, games, and idling.What other sporting book will explain the rules of elephant polo; the perils of the Cresta Run; the link between crosswords and the devil; the story behind the Nike \"swoosh\"; or why surfing is the \"Sport of Kings\" (in Hawaii)? Which other volume will list the seven deadly sins of golf; the secrets of Houdini's Code; or the myriad personalities of the Pac-Man ghosts? Where else will you stumble across an account of Evel Kneival's broken bones, a detailing of Mike Tyson's tattoos, the nicknames for classic poker-hands, or every sporting ailment from jogger's nipple to housemaid's knee? You don't have to be a sports fanatic to enjoy this irresistible volume of factual odds and ends. Schott's Sporting, Gaming, and Idling Miscellany scores big with its fascinating hodge-podge of sports- and activity-related trivia.",
        "Category": " Reference , Trivia",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Creating Well-Being: The Healing Path to Love, Peace, Self-Esteem and Happiness",
        "Authors": "By Friedman, Philip H.",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "R & E Pub",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Tiger War (Mack Bolan No 61)",
        "Authors": "By Pendleton, Don",
        "Description": "",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Gold Eagle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "Ya-Yas in Bloom",
        "Authors": "By Wells, Rebecca",
        "Description": "For readers everywhere who are ga-ga for the Ya-Yas and clamoring for more and for those who are lucky enough to be discovering the Ya-Yas for the first time, comes a new book about the incomparable Sisterhood, bursting with life and funnier than ever....An emotionally charged addition to Rebecca Wells' award-winning bestseller Little Altars Everywhere and #1 New York Times bestseller Divine Secrets of the Ya-Ya Sisterhood, YA-YAS IN BLOOM reveals the roots of the Ya-Yas' friendship in the 1930s and roars with all the raw power of Vivi Abbott Walker's 1962 T-Bird through sixty years of marriage, child-raising, and hair-raising family secrets.When four-year-old Teensy Whitman prisses one time too many and stuffs a big old pecan up her nose, she sets off the chain of events that lead Vivi, Teensy, Caro, and Necie to become true sister-friends.  Told in alternating voices of Vivi and the Petite Ya-Yas, Siddalee and Baylor Walker, as well as other denizens of Thornton, Louisiana, YA-YAS IN BLOOM show us the Ya-Yas in love and at war with convention.  Through crises of faith and hilarious lapses of parenting skills, brushes with alcoholism and glimpses of the dark reality of racial bigotry, the Ya-Ya values of unconditional loyalty, high style, and Cajun sass shine through.  Necies wise credo, \"Just think pretty pink and blue thoughts,\" helps too...But in the Ya-Yas' inimitable way, these four remarkable women also teach their children about the Mysteries: the wonder of snow in the deep South, the possibility that humans are made of stars, and the belief that miracles do happen.  And they need a miracle when old grudges and wounded psyches lead to a heartbreaking crime...and the dynamic web of sisterhood is the only safety net strong enough to hold families together and endure.After two bestsellers and a blockbuster movie, the Ya-Yas have become part of American culture -- icons for the power of women's friendship. YA-YAS IN BLOOM continues the saga, giving us more Ya-Ya lore, spun out in the rich patois of the Louisiana bayou country and brim full of the Ya-Ya message to embrace life and each other with joy.",
        "Category": " Fiction , Sagas",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "How to Raise Your Self-Esteem: The Proven Action-Oriented Approach to Greater Self-Respect and Self-Confidence",
        "Authors": "By Branden, Nathaniel",
        "Description": "Of all the judgments you make in life, none is as  important as the one you make about yourself. The  difference between low self-esteem and high  self-esteem is the difference between passivity and  action, between failure and success. Now, one of  America's foremost psychologists and a pioneer in  self-esteem development offers a step-by-step guide to  strengthening your sense of self-worth. Here are  simple, straightforward and  effective techniques that will dramatically improve  the way you think and feel about yourself. You'll  learn: How to break free of negative  self-concepts and self-defeating behavior. How  to dissolve internal barriers to success in work  and love. How to overcome anxiety,  depression, guilt and anger. How to conquer the  fear of intimacy and success. How to find  -- and keep -- the courage to love yourself.  And much more.",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Judaism (Art of World Religons)",
        "Authors": "By Kaniel, Michael",
        "Description": "The development of Jewish art from the formative period of Judaism through the twentieth century reflects the religion's concern for the spiritual elevation of humanity and is shown with illuminated manuscripts and synagogue mosaics",
        "Category": " Art , General",
        "Publisher": "Blandford Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "Decorating With Paint & Wall Coverings",
        "Authors": "By Atkinson, Scott (EDT)",
        "Description": "Offers advice on decorating with color, shows how to paint, paper, and decorate with fabric, and explains the techniques used to put up paneling",
        "Category": " House & Home , Decorating",
        "Publisher": "Lane Pub. Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "If Only You Knew How Much I Smell You: True Portraits of Dogs",
        "Authors": "By Shaff, Valerie, Blount, Roy, Jr., and Shaff, Valerie (PHT)",
        "Description": "In black-and-white photographs, an accomplished commercial photographer captures more than fifty canine countenances accompanied by humorous verses written from the dogs' point of view that illuminate their quizzical expressions. 40,000 first printing.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Bulfinch",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Building a sustainable society",
        "Authors": "By Brown, Lester Russell",
        "Description": "",
        "Category": "",
        "Publisher": "Norton",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The Road to the White House",
        "Authors": "By Harold (Edited by) Faber",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill Book Company",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "The J. Paul Getty Museum Guide to the Villa and Its Gardens",
        "Authors": "By J Paul Getty Museum",
        "Description": "",
        "Category": " Art , Collections, Catalogs, Exhibitions , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Rural America: A Pictorial Folk Memory",
        "Authors": "By Shafer, Mary A.",
        "Description": "",
        "Category": "",
        "Publisher": "Willow Creek Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "The literary gourmet;: The pleasure of reading about wonderful food in scenes from great literature, the delight of savoring it in the recipes of ... little known facts about the art of cooking",
        "Authors": "By Wolfe, Linda",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    }
]