[
    {
        "Title": "The Magic of Blood",
        "Authors": "By Gilb, Dagoberto",
        "Description": "Dagoberto Gilb is a powerful and important new talent in American fiction. Fresh, funny, relentless, and beautifully crafted, his writing possesses that rare Chekhovian ability to perfectly capture the nuances of ordinary life and make it resonate with unexpected meaning.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Taking Sides",
        "Authors": "By Soto, Gary",
        "Description": "Lincoln is in a jam when his basketball team at his new school--where the students are rich and mostly white--faces his old team from the barrio on the boards. How can he play his best against his friends? No matter who wins, it looks like it will be lose-lose for Lincoln.",
        "Category": " Young Adult Fiction , Social Themes , Friendship",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "National Geographic Guide to Great Weekend Getaways",
        "Authors": "By National Geographic Society (U. S.) (EDT)",
        "Description": "At a time when people are traveling closer to home, the National Geographic Guide to Weekend Getaways offers travelers unique and interesting ways to escape their busy lives and discover the beauty and attractions of America. Each getaway in this guide focuses on a fun and relaxing theme?such as jazz, Old West, Cajun cooking, gardens, wine tasting, art, and architecture. Thoroughly planned and tested by National Geographic?s expert regional travel writers, the getaways range from a Hudson River weekend, featuring its Gilded Ages estates, to an architectural weekend in Miami, featuring the art-deco gems of South Beach, to a cowboy weekend in Texas Hill Country, and much more. Packed with guidance and practical information, including recommendations of charming inns, bed & breakfasts, and noteworthy restaurants, and loose itineraries that allow weekenders to set their own pace, this guide makes getting away from it all easy to accomplish?and easy to enjoy.",
        "Category": " Travel , Canada , General",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Gotham Diaries",
        "Authors": "By Lee, Tonya Lewis and Anthony, Crystal McCrary",
        "Description": "A hilarious first novel that provides a peek into the world of the super-rich, super-connected African Americans in Manhattan.Lauren is trying to be an independent woman, starting her own documentary film company, but it's difficult when you're married to Ed Thomas, one of the wealthiest African-American businessmen in the country--and particularly when he seems to have a roving eye. Manny is an up-and-coming gay real estate agent who arrived in Manhattan from Alabama with only the clothes on his back. He's made his way to the top of his profession--yet he still wants more. Tandy is one of the \"ladies who lunch\"--but she's desperate to reinvent herself and find a new source of cash flow.As we follow these three and other characters in this compelling first novel, we see the fascinating world of New York City's upper-crust African American society with all their scandals, foibles and skeletons in the closet revealed.",
        "Category": " Fiction , Literary",
        "Publisher": "Hyperion-Acquired Assets",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "A Woman's Journey to God",
        "Authors": "By Borysenko, Joan",
        "Description": "Asking why Western women are dropping out of traditional religion in record numbers, the best-selling author of A Woman's Book of Life probes the disconnect between patriarchal religion and women's experience and shows women the path to spiritual healing. Reprint.",
        "Category": " Body, Mind & Spirit , Healing , General",
        "Publisher": "Riverhead Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "The Year's Best Science Fiction: Twenty-First Annual Collection (No. 21)",
        "Authors": "By Dozois, Gardner R. (EDT)",
        "Description": "The stories in this collection imaginatively take readers far across the universe, into the very core of their beings, to the realm of the Gods, and to the moment just after now.  Included are the works of masters of the form and the bright new talents of tomorrow.  This book is a valuable resource in addition to serving as the single best place in the universe to find stories that stir the imagination and the heart.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "English as a Second F*cking Language: How to Swear Effectively, Explained in Detail with Numerous Examples Taken From Everyday Life",
        "Authors": "By Johnson, Sterling",
        "Description": "In the English language, swearing is essential to effective communication. In this hilarious and illuminating guide, you will learn just how to do it - no f*cking problem. Whether you want to succeed in business, school, or social circles, a strong command of vocabulary is absolutely necessary. Just imagine a stranger to our shores, trying to comprehend the following conversation: John: Mary, would you like to attend the opera this evening?Mary: F*cking-A. should I wear my black dress?John: Why the f*ck not?Mary: F*cked if I know-Oh, f*ck! I just remembered. It got f*cked up in the wash.John: Well, f*ck the opera. Let's stay home and f*ck.Mary: Good f*cking idea.English as a Second F*cking Language (ESF*L) is the perfect way for nonnative speakers to learn the basics of swearing. At the same time, it also offers native speakers a wide variety of twists and new refinements. Page after page, ESF*L provides a smorgasbord of swearing synonyms designed to boost your vocabulary-everything from the conventional d*mn and sh*t to a host of more inventive terms that would make any truck driver blush. And when you're finished reading, our Final F*cking Exam is the perfect test of your swearing skills. You'll be surprised by how much you've learned!“Great f*cking book!” —Stephen King",
        "Category": " Reference , Word Lists",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Human Cloning and Human Dignity: The Report of the President's Council On Bioethics",
        "Authors": "By Kass, Leon R.",
        "Description": "Few avenues of scientific inquiry raise more thorny ethical questions than the cloning of human beings, a radical way to control our DNA. In August 2001, in conjunction with his decision to permit limited federal funding for stem-cell research, President George W. Bush created the President's Council on Bioethics to address the ethical ramifications of biomedical innovation. Over the past year the Council, whose members comprise a team of leading scientists, doctors, ethicists, lawyers, humanists, and theologians, has discussed and debated the pros and cons of cloning, whether in the service of producing children or as an aid to scientific research. The questions the Council members confronted do not have easy answers, and they did not seek to hide theirdifferences behind an artificial consensus. Rather, the Council decided to allow each side to make its own best case, so that the American people can think about and debate these questions, which go to the heart of what it means to be a human being. Justas the dawn of the atomic age created ethical dilemmas for the United States, cloning presents us with similar quandaries that we are sure to wrestle with for decades to come.Presents the report submitted by the President's Council on Bioethics, including historical aspects of cloning, public policy options and recommendations, and ethical aspects of cloning.",
        "Category": " Medical , Health Care Delivery",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Collins Practical Gardener: Trees and Shrubs: What to Grow and How to Grow It (HarperCollins Practical Gardener)",
        "Authors": "By Rushforth, Keith D.",
        "Description": "Striking color photographyBoth Latin and common names always listedClear, easy-to-follow, step-by-step instructions for key tasksIndispensable charts detailing flowering and growth patterns, color, and essential notesComprehensive information on bamboos, ferns, palms, conifers, and other trees and shrubsUseful hints and tips from the experts",
        "Category": " Gardening , Shrubs",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "The Art of Fine Cigars",
        "Authors": "By Andriote, John-Manuel, Falk, Andrew E., Perez, B. Henry, and Gleason, James V. (PHT)",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Bulfinch Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Unholy Fire: A Novel of the Civil War",
        "Authors": "By Mrazek, Robert J.",
        "Description": "John “Kit” McKittredge is a young Federal officer from Maine who is terribly wounded in one of the first battles of the Civil War.  Still unfit for active duty after nine months in hospital, he is recruited by an unorthodox colonel named Valentine Burdette to work in the Provost Marshal General’s office in Washington.  The beleaguered Capital, now swollen to seven times its pre-war population, is filled with saloons, brothels, spies, thieves and murderers.  It is also rife with official corruption and political intrigue. While investigating what appears to be a routine case of military procurement fraud, Kit becomes embroiled in the murder of a beautiful young woman who has had the misfortune to attend the birthday party of Union General Joseph Hooker, the notorious and charming libertine.The investigation leads Kit through a series of harrowing adventures—both on the battlefield and in the Capital’s darkest dens of depravity—until he and Val Burdette must confront a vast criminal conspiracy that threatens both their own lives as well as the fate of the Republic.  This riveting thriller by the award-winning author of the critically-acclaimed Stonewall’s Gold hauntingly brings to life one of the most dramatic periods of the Civil War.",
        "Category": " Fiction , Historical",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Disney's Family Story Collection (Volume II)",
        "Authors": "By Driscoll, Laura, Hapka, Catherine, and Neye, Emily",
        "Description": "With stories about compassion, kindness, and integrity, Disney's Family Story Collection Volume 2 teaches important messages to today's children. Adapting more than 30 different Disney movies and featuring both old and new favorites, this lavish collection includes 75 heartwarming stories and life lessons for the whole family to share together.",
        "Category": " Juvenile Fiction , Social Themes , Values & Virtues",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Our Mysterious Ocean : Windows on Science Series",
        "Authors": "By Riley, Peter D., Margreaves, Toni (ILT), Hargreaves, Toni (ILT), and Edwards, Brin (ILT)",
        "Description": "A journey into the undersea world includes illustrations, photographs, fun activities, and, on each page, see-through acetates which show plants and animals in their natural environment, beginning with a coral reef and ending on the floor of the deepest ocean.",
        "Category": "",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "My Invented Country: A Memoir",
        "Authors": "By Allende, Isabel and Peden, Margaret Sayers",
        "Description": "Isabel Allende evokes the magnificent landscapes of her country; a charming, idiosyncratic Chilean people with a violent history and an indomitable spirit; and the politics, religion, myth, and magic of her homeland that she carries with her even today.The book circles around two life-changing moments. The assassination of her uncle Salvador Allende Gossens on September 11, 1973, sent her into exile and transformed her into a literary writer. And the terrorist attacks of September 11, 2001, on her adopted homeland, the United States, brought forth an overdue acknowledgment that Allende had indeed left home. My Invented Country, mimicking the workings of memory itself, ranges back and forth across that distance between past and present lives. It speaks compellingly to immigrants and to all of us who try to retain a coherent inner life in a world full of contradictions.",
        "Category": " Travel , South America , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Dora Goes to School (Dora the Explorer)",
        "Authors": "By Roper, Robert (ILT) and Valdes, Leslie",
        "Description": "Dora and Boots see their teacher riding her bike on the way to school. But the bike gets a flat tire, and the teacher needs to get to school before her students! Will Dora and Boots save the school day? Find out in this exciting interactive adventure.",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "The Geneva Accord: And Other Strategies for Healing the Israeli-Palestinian Conflict (The Terra Nova Series)",
        "Authors": "By Lerner, Michael",
        "Description": "Using the Geneva Accord as a springboard for a discussion of the issues surrounding the supposedly unsolvable problem of Isreali-Palestinian peace, one of America's most respected Jewish peace activists, Michael Lerner, looks at the arguments against the Accord from both the Israeli right and the Palestinian left. He examines Ariel Sharon's security wall, the calls for a one-state solution, and proposals to boycott Israeli goods. Ultimately, Lerner offers a set of strategic directions, appealing to both Jews and non-Jews, to change American foreign policy.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "North Atlantic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Eternity, Vol. 1",
        "Authors": "By Jin-Ryong, Park and Yong-Gwan, Shin",
        "Description": "",
        "Category": " Comics & Graphic Novels , Manga , General",
        "Publisher": "Tokyopop",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Leo Rosten's Carnival of Wit: From Aristotle to Woody Allen",
        "Authors": "By Rosten, Leo Calvin (EDT)",
        "Description": "Gathers aphorisms about a variety of subjects from acting and advice to wordplay and youth",
        "Category": " Reference , Quotations",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "The Legend of the Bluebonnet",
        "Authors": "By dePaola, Tomie",
        "Description": "When a killing drought threatens the existence of the tribe, a courageous little Comanche girl sacrifices her most beloved possession--and the Great Spirit's answer results not only in much needed rain but a very special gift in return.\"An ideal complement to Native American and Texas studies...\"Booklist",
        "Category": " Juvenile Fiction , People & Places , United States , Native American",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Restoration: A Novel of Seventeenth-Century England (Tie-In Edition)",
        "Authors": "By Tremain, Rose",
        "Description": "In seventeenth-century England, the King ensures his mistress's safety by having Robert Merivel, son of a glovemaker, marry her, but Merivel falls in love with his wife, is cast out of courtly life, and finds refuge working with the insane at New Bedlam",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Penguin Group USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Staying Sane When Your Family Comes to Visit",
        "Authors": "By Brodowsky, Pamela K. and Fazio, Evelyn M.",
        "Description": "Maybe your mother-in-law snoops but \"doesn't judge.\" Perhaps grandpa hogs the bathroom, or your cousin frequently \"just needs a place to crash.\" Whatever the specifics, it's hard to grin and bear it. From the trenches of these anxiety-inducing and guilt-ridden occasions, here are true stories of inspiration and humor about coping with family personality traits, group dynamics, bad habits, and irritating mannerisms that can drive a sane person crazy. Misery loves company and sometimes the only advice we'll take is from someone who has already stood in our shoes. Whether it is about giving up smoking, trying to lose weight, or having in-laws move in for a month, the Staying Sane series provides readers with just this kind of been-there, done-that commiseration. Each Staying Sane volume is filled with sometimes humorous (laughter is the best medicine, after all!), sometimes inspiring but always sanity-saving success stories of how other people have overcome obstacles or have risen above the situations in question. Practical tips and coping strategies lighten the reader's load throughout. Bibliotherapy of the first order, the Staying Sane guides will support beleaguered readers as they strive to persevere through the duration of their particular challenge.",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Quarterlife Crisis: The Unique Challenges of Life in Your Twenties",
        "Authors": "By Robbins, Alexandra and Wilner, Abby",
        "Description": "While the midlife crisis has been thoroughly explored by experts, there is another landmine period in our adult development, called the quarterlife crisis, which can be just as devastating. When young adults emerge at graduation from almost two decades of schooling, during which each step to take is clearly marked, they encounter an overwhelming number of choices regarding their careers, finances, homes, and social networks. Confronted by an often shattering whirlwind of new responsibilities, new liberties, and new options, they feel helpless, panicked, indecisive, and apprehensive.Quarterlife Crisis is the first book to document this phenomenon and offer insightful advice on smoothly navigating the challenging transition from childhood to adulthood, from school to the world beyond. It includes the personal stories of more than one hundred twentysomethings who describe their struggles to carve out personal identities; to cope with their fears of failure; to face making choices rather than avoiding them; and to balance all the demanding aspects of personal and professional life.  From \"What do all my doubts mean?\" to \"How do I know if the decisions I'm making are right?\" this book compellingly addresses the hardest questions facing young adults today.",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Chinese in Plain English",
        "Authors": "By De Mente, Boye",
        "Description": "This helpful book presents the basics of the challenging Chinese language.  Chinese language is \"romanized\" and is therefore truly in plain English.",
        "Category": " Foreign Language Study , Chinese",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "What Every Landlord Needs to Know: Time and Money-Saving Solutions to Your Most Annoying Problems",
        "Authors": "By Jorgensen, Richard H.",
        "Description": "Everything that new and veteran landlords need to know to protect their most valuable investments How do I raise the rent? How do I legally turn down a prospective tenant? How do I evict a current tenant? These are just a few of the problems that plague both new and established landlords. What Every Landlord Needs to Know provides effective solutions for everything from property and tenant issues to maintenance and repair problems, to legal obligations and responsibilities. This comprehensive guide also offers preventive tips to avert the most common problems. Landlord Richard Jorgensen:  Helps landlords maximize the screening power of the rental application and credit report  Covers basic maintenance and preventive measures that save time and money  Explains what to do if a tenant won't pay the rent  Gives tips for critical (and anxietyproducing) personal interaction between landlord and tenant for each problem  Includes a sample rental application, lease, and credit check, as well as a list of credit bureaus and landlord associations",
        "Category": " Business & Economics , Real Estate",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Power Sales Writing",
        "Authors": "By Hershkowitz, Sue A.",
        "Description": "Power Sales Writing is a brisk, no-nonsense guide to writing sales messages guaranteed to grab and hold a prospect's attention.With this book in hand, everyone from salespeople to marketing managers to business executives will quickly and painlessly master the essence of effective sales writing to win the sale or client. This book includes:Lists of power words and phrases Editing and revision techniques Tips on how to break bad news and achieve desired outcomes Advice on translating sales skills into copy Techniques for getting prospects to act by articulating their needs",
        "Category": " Business & Economics , Sales & Selling , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Everyday Math Demystified",
        "Authors": "By Gibilisco, Stan",
        "Description": "This book provides a review of high school level mathematics and is designed as a self-study aid. Chapters cover number operations, variables, extreme numbers, measurements, algebra, beginning statistics, probability, geometry, graphs, intro trigonometry, vectors, exponentials and logarithms, and simple classical physics. \"Open-book\" quizzes, \"closed-book\" tests, and a final exam are included, along with their answer keys. Annotation ©2005 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Mathematics , Arithmetic",
        "Publisher": "McGraw-Hill Professional",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "The Secret Service: The Hidden History of an Enigmatic Agency",
        "Authors": "By Melanson, Philip H. and Stevens, Peter F.",
        "Description": "A comprehensive history of the Secret Service provides coverage of assassinations and assassination attempts, presidential demands on the agency, the impact of a Secret Service career on its agents, and issues surrounding agency failures and gender gaps. Reprint.",
        "Category": " Political Science , Law Enforcement",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "How the Light Gets In",
        "Authors": "By Hyland, M. J.",
        "Description": "Lou Connor, a precocious, gifted, and unhappy sixteen-year-old, is offered a place as an exchange student in the United States, something that she hopes will take her far away from her bleak life of poverty in Sydney, Australia. Having endured a childhood with an emotionally crass, deadbeat family, she welcomes the opportunity to live the middle-class life she has long dreamed of. But soon after she moves in with her host family, the Hardings - who live in a prefabricated mansion in a nameless Chicago suburb - Lou's acute need for acceptance and love runs up against the Hardings' suffocating pursuit of a particular form of suburban perfection.How the Light Gets In is a portrait of a girl on the verge of adulthood whose world - like Holden Caulfield's before her - is full of mixed messages.",
        "Category": " Fiction , Literary",
        "Publisher": "Canongate U.S.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Love Letters and Two Other Plays: The Golden Age, What I Did Last Summer (Plume Drama)",
        "Authors": "By Gurney, Albert Ramsdell",
        "Description": "FINALIST FOR THE PULITZER PRIZE FOR DRAMAIn such critically acclaimed plays as The Dining Room and The Cocktail Hour, A. R. Gurney has wittily captured the manners of upper-middle-class WASP America, but never as gracefully or with such dazzling economy as in Love Letters.  Tracing the lifelong correspondence of the staid, dutiful lawyer Andrew Makepeace Ladd III and the lively, unstable artist Melissa Gardner, the story of their bittersweet relationship gradually unfolds from what is written—and what is left unsaid—in their letters.  A smash hit both off and on Broadway, Love Letters captures Andy and Melissa with a precision of detail and depth of feeling that only Gurney can command.  Two other, thematically related plays by Gurney, The Golden Age and What I Did Last Summer, are included, providing a trio of wry and affectionate paeans to love lost, found, and fleetingly glimpsed.",
        "Category": " Drama , American , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Persian Pickle Club",
        "Authors": "By Dallas, Sandra",
        "Description": "It is the 1930s, and hard times have hit Harveyville, Kansas, where the crops are burning up, and there's not a job to be found. For Queenie Bean, a young farm wife, a highlight of each week is the gathering of the Persian Pickle Club, a group of local ladies dedicated to improving their minds, exchanging gossip, and putting their quilting skills to good use. When a new member of the club stirs up a dark secret, the women must band together to support and protect one another. In her magical, memorable novel, Sandra Dallas explores the ties that unite women through good times and bad.",
        "Category": " Fiction , Historical",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Sandcastles: Great Projects: From Mermaids to Monuments",
        "Authors": "By Frankeny, Frankie (PHT) and Mitchell, Patti",
        "Description": "Sandcastles is the ultimate guide to the ultimate summer pastime--playing in the sand. Featuring the wonderful photographs of Frankie Frankeny (Snowmen), Sandcastles includes over 30 sand sculptures from the whimsical to the majestic, complete with easy-to-follow instructions. Adults and kids can work together to create gloriously impermanent structures by the sea--or even in a backyard sandbox. Pass the time with an ancient sundial. Sail alongside the seas in a sand schooner. Sunbathe with a mermaid. Put up a beach house for your lazy pup. Or for the truly ambitious, recreate some northern Spanish architecture with a rendition of the Gehry Bilbao Guggenheim. For sand sculptors young and old, this delightful volume is filled with the joys found in a summer day in the sand. Sandcastles is a joint project with the non-profit Leap Foundation, which hosts a sandcastle extravaganza each summer, where artists, architects, and kids of all ages construct inspiring sand creations.",
        "Category": " Crafts & Hobbies , Holiday & Seasonal",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "The Yale Guide to Children's Nutrition",
        "Authors": "By Tamborlane, William V. (EDT), Weiswasser, Janet Z. (EDT), Fung, Teresa (EDT), Held, Nancy A. (EDT), and Liskov, Tara Prather (EDT)",
        "Description": "What is the healthiest diet for an infant? What constitutes a nutritious school lunch? How do I deal with my adolescent's eating needs and habits? Will my children receive proper nutrients if they are sick, very athletic, or vegetarians? This authoritative resource answers these and dozens of other questions, not only presenting the latest scientific knowledge about nutrition but also providing recipes from famous chefs for delicious and healthy dishes. The book, written by physicians and dietitians at the Yale University School of Medicine, an international leader in pediatric teaching, research, and clinical care, as well as by dietitians, nurses, and social workers at the Yale-New Haven Children's Hospital, is the most authoritative, comprehensive, and informative guide to childhood nutrition ever produced.",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "The Easter Beagle Returns!",
        "Authors": "By Alfonsi, Alice (ADP), Schulz, Charles M., Lobianco, Nick (ILT), and Lobianco, Peter (ILT)",
        "Description": "It's Easter time again, and everyone eagerly awaits the return of the world-famous Easter Beagle. Everyone, that is, except for Charlie Brown, since the Easter Beagle never brings him anything. As the hours pass, there's still no sign of the egg-bearing Beagle. Will Easter be spoiled for the whole gang?",
        "Category": " Juvenile Fiction , Animals , Dogs",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "B Is for Betsy (Betsy (Paperback))",
        "Authors": "By Haywood, Carolyn and Haywood, Carolyn (ILT)",
        "Description": "Carolyn Haywood's stories about her irrepressible character Betsy have never been out of print, and now, thanks to dynamic new covers, the Betsy books will find their way onto the bookshelves of modern young readers--and into the hearts of a whole new generation. Betsy is scared about going to first grade, but it turns out school is a great place. She learns about tadpoles and the true meaning of Thanksgiving, makes new friends, and has more fun than she'd ever imagined.",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Understanding and Teaching the Bible (Lead Books)",
        "Authors": "By Jeske, Richard L.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Fortress Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1981"
        }
    },
    {
        "Title": "Farwell's Rules of the Nautical Road",
        "Authors": "By Smith, Richard A. and Bassett, Frank E.",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Naval Institute Press",
        "Price Starting With ($)": "8.5",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Killed: Great Journalism Too Hot to Print (Nation Books)",
        "Authors": "By Wallis, David (EDT) and Wallis, David (INT)",
        "Description": "Killed resurrects remarkable articles that prestigious publications such as The New Yorker, the New York Times Magazine, Harper's, and Rolling Stone assigned to accomplished writers for sizeable fees, then discarded for reasons having nothing to do with their quality and everything to do with their potential for unwanted controversy, political incorrectness, or undue pressure from an advertiser. Read for the first time Mike Sager’s profile of Palestinian militants involved in the intifada of 1987 that was killed by the Washington Post Magazine because his story did not side with Israel, and Ted Rall’s essay on his deadbeat dad that was deemed too dark by the New York Times Magazine for its Father’s Day issue. While the notion of a killed article is nothing new, the breakneck pace of media consolidation has raised the stakes for contrarian writers and readers as independent publishers dwindle. Killed arises out of this moment, bringing these outstanding pieces of censored journalism into the public arena for the first time. Some of the other contributors included are Rich Cohen, Daniel Asa Rose, Alec Wilkinson, Noam Chomsky, Douglas Rushkoff, Pat Jordan, Robert Fisk, Clive Thompson, Silvana Paternostro, Glenn O'Brien, Christopher Hitchens, Gore Vidal, and Luc Sante.",
        "Category": " Literary Criticism , General",
        "Publisher": "Nation Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Contents Under Pressure",
        "Authors": "By Zeises, Lara M.",
        "Description": "A fresh, honest look at the difficult choices and unexpected joys in a girl’s life under pressure.Lucy Doyle is about to explode. She’s sure her name might as well be Loser because she‘s never, ever been kissed. To make matters worse, nearly all of her friends have left her behind for boys. Even Lucy’s favorite brother doesn’t seem to have time for her anymore. He’s just moved home from college with a distant new attitude and a big-haired girlfriend Lucy can’t stand. Freshman year is definitely not off to a good start.So when Lucy attracts the attention of Tobin Scacheri, the junior everyone wants to date, she can barely believe her luck. Tobin’s cute and funny, and he might like Lucy as much as she likes him. But Lucy’s brother has a secret that will turn her already mixed-up world completely upside down. Now, Lucy must figure out how far she’s willing to take her relationship with Tobin—and how to deal with a brother who’s not as perfect as she thought.",
        "Category": " Young Adult Fiction , Family , Siblings",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Mammoth Book of Sex, Drugs and Rock 'n' Roll",
        "Authors": "By Driver, Jim (EDT)",
        "Description": "Filled with a colorful cast of rock icons, this illustrated guide to rock music history focuses on the stars whose talent and excesses fueled the rock legend--including Jimi Hendrix, the Rolling Stones, Jim Morrison, the Sex Pistols, Madonna, and others. Original.",
        "Category": " History , General",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "A Little New York Cookbook",
        "Authors": "By Bloch, Barbara and David, Susan (ILT)",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Camp",
        "Authors": "By Eisner, Michael D.",
        "Description": "Over the years, as a camper and a counselor, Disney CEO Michael Eisner absorbed the life lessons that come from sitting in the stern of a canoe or meeting around a campfire at night. With anecdotes from his time spent at Keewaydin and stories from his life in the upper echelons of American business that illustrate the camp's continued influence, Eisner creates a touching and insightful portrait of his own coming-of-age, as well as a resounding declaration of summer camp as an invaluable national institution.",
        "Category": " Sports & Recreation , Camping",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "I'm Not in the Mood: What Every Woman Should Know About Improving Her Libido",
        "Authors": "By Reichman, Judith, M.D.",
        "Description": "The \"hormone of desire,\" testosterone, acts on the brain to stimulate sexual interest, sensitivity to sexual stimulation, and orgasmic ability in both sexes. The amount of testosterone circulating in a woman's blood declines by about 50 percent between her twenties and fifties. The most common complaint associated with this decline is a seemingly unexplainable decrease or loss of sexual desire and enjoyment.In I'm Not in the Mood, Dr. Reichman reveals the effectiveness of small doses of testosterone in reviving sexual desire and pleasure for women. Questions answered and topics discussed include:Why and when do women make male hormones?Where do all our male hormones go?Behavior, life changes, and medical problems that affect our libidoMedications that affect our libidoWill creams, pills, lozenges, patches, or shots help?When you should see a psychiatrist, psychologist, or sex therapistHow to discuss libido issues with your doctorHow to reach your biologic sexual potential       The \"hormone of desire,\" testosterone, acts on the brain to stimulate sexual interest, sensitivity to sexual stimulation, and orgasmic ability in both sexes. The amount of testosterone circulating in a woman's blood declines by about 50 percent between her twenties and fifties. The most common complaint associated with this decline is a seemingly unexplainable decrease or loss of sexual desire and enjoyment.In I'm Not in the Mood, Dr. Reichman reveals the effectiveness of small doses of testosterone in reviving sexual desire and pleasure for women. Questions answered and topics discussed include:Why and when do women make male hormones? Where do all our male hormones go? Behavior, life changes, and medical problems that affect our libido Medications that affect our libido Will creams, pills, lozenges, patches, or shots help? When you should see a psychiatrist, psychologist, or sex therapist How to discuss libido issues with your doctor How to reach your biologic sexual potential",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Disney's Americana Storybook Collection (Disney Storybook Collections)",
        "Authors": "By Disney Book Group",
        "Description": "A beautifully illustrated volume features seventeen Disney classics, including the legendary stories of Paul Bunyan and Pecos Bill, tales of historical figures like Ben Franklin and Paul Revere, and other all-American favorites.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Anthologies",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "American Yoga: The Paths And Practices of America's Greatest Yoga Masters",
        "Authors": "By Ryan, Andy and Schneider, Carrie",
        "Description": "",
        "Category": " Health & Fitness , Yoga",
        "Publisher": "BARNES & NOBLE",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Why Sleeping Dogs Lie",
        "Authors": "By Howard, Tracie",
        "Description": "Journalist Mallory Baylor has been hiding a secret from her ex-lover Saxton McKensie, a high-powered attorney engaged to TV superstar Deena Ingram, who knows nothing about their past affair.",
        "Category": " Fiction , General",
        "Publisher": "NAL Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Parenting a Child With Diabetes : A Practical, Empathetic Guide to Help You and Your Child Live with Diabetes",
        "Authors": "By Loring, Gloria",
        "Description": "A practical primer to fostering a child with diabetes.  Addresses the most acute facts about diabetes care and maintenance including how insulin works, available tools for blood-sugar control, and extensive nutritional information.  Provides an overview of how to combine insulin, exercise, and a diabetes diet low in fat, salt, and sugar to overcome the obstacles of blood-sugar control.  An essential guide for the parents of a diabetic child.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Real-World Fitness: Fun and innovative ways to help you sneak in activity at home, at work and with the kids",
        "Authors": "By Kaehler, Kathy and Olson, Cheryl K.",
        "Description": "Featuring:Exercises that get reasults for each part of your body--arms and upper body, legs, buttocks, and abs.Advice and motivation to help you squeeze fitness into your busiest daysEasy steps to better, healthier eating--without dieting Featuring:Exercises that get reasults for each part of your body--arms and upper body, legs, buttocks, and abs.Advice and motivation to help you squeeze fitness into your busiest daysEasy steps to better, healthier eating--without dieting",
        "Category": " Health & Fitness , General",
        "Publisher": "Golden Guides from St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Buy, Rent and Sell: How to Profit by Investing in Residential Real Estate",
        "Authors": "By Irwin, Robert",
        "Description": "The time has never been better for investing in real estate, and this book arms the millions of investors who are returning to real estate as an established instrument of wealth creation with surefire strategies for making a killing in the real estate market. Due to the pent-up demand for housing caused by the lull in housing starts during the 90s, as many as 11 million would-be American home-owners are currently vying for a rapidly dwindling pool of available properties. In Buy, Rent, and Sell Bob Irwin, one of America’s most well-known and respected real estate author/experts,  provides nuts-and-bolts advice and guidance on how to find good investment properties, how to successfully rent them, and how to quickly turn them around for a  profit. Written in Irwin’s trademark down-to-earth, jargon-free style, Buy, Rent, and Sell is an indispensable guide for novices as well as experienced real estate investors.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Love Monkey: A Novel",
        "Authors": "By Smith, Kyle",
        "Description": "Many men aim high; Tom Farrell dares to be average. While his friends accumulate wedding rings, mortgages, and even, alarmingly, babies, Tom still lives alone in his rented apartment with nothing but condiments and alcohol in his refrigerator. He spends Saturday mornings watching cartoons and eating Cocoa Puffs out of an Empire Strikes Back bowl, and devotes the rest of the weekend to his other favorite hobbies: sports and girls. His credo, to think and act like a thirteen-year-old boy at all times, has worked well enough to land him a decent job writing headlines for the New York Tabloid. But neither his personal life nor his professional life has any forward momentum; he's occupied the same cubicle since the first George Bush was president and is currently \"between girlfriends.\" At thirty-two, it starts to occur to him: There's a fine line between picky and loser.Enter a sly, beautiful coworker named Julia. After a few torrid dates, Tom is hooked. \"She's like cleaning behind my refrigerator. A once-in-a-lifetime thing.\" But the closer he gets to Julia, the more elusive she becomes. Frustrated, Tom seeks the dubious advice of his buddy Shooter, a shallow sexual gladiator, and wonders why he keeps getting into arguments with Bran, his smart, sarcastic \"default date.\" But then tragedy strikes, and everyone's attitudes toward life and love change -- and even Tom begins to see himself in a new light.By turns riotous and tenderhearted, Kyle Smith's Love Monkey is the most candid and excruciatingly funny exploration of the male mind and libido since High Fidelity.",
        "Category": " Fiction , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Girl, 15, Charming but Insane",
        "Authors": "By Limb, Sue",
        "Description": "Life was tragic enough before this spring started. With a distinct lack of boobage and an arse so big that birds of prey could nest within its shadows, Jess Jordan is saddled with the Goddess Flora for a best friend, a Britney Spears look-alike so gorgeous that one grain of her divine dandruff could make the blind see again. Jess knows that her soul mate is Ben Jones, a divine mixture of Leonardo diCaprio, Prince William, and Brad Pitt who oozes mystery and charisma. But the campaign to get Ben to notice her brings on a cavalcade of mortification and disaster, including, but not limited to, a minestrone soup explosion that takes place in her bra and a schoolwide viewing of a videotape that features a topless Jess referring to her breasts as “Bonnie” and “Clyde.”Meanwhile, Jess’s death-obsessed Granny moves into her bedroom, along with her grandfather’s remains; her hypochondriac dad, who sends her daily “horrorscopes” like “You will fall asleep with your mouth open, and a family of earwigs will move in,” acts strange about Jess staying with him this summer; and her longtime friend Fred, a television violence addict and closet thumbsucker, has decided that he can’t stand being around her. Jess is determined to make things right . . . but with her offbeat sense of humor and her wildly active imagination, things get complicated along the way.",
        "Category": " Young Adult Fiction , Humorous , General",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Swimming Sweet Arrow : A Novel",
        "Authors": "By Gibbon, Maureen",
        "Description": "Evangeline Starr Raybuck -- plain-spoken, lusty, and hardworking -- and June Keel are high school seniors, best friends going out with best friends, working together at Noecker's chicken farm after school. Vangie and June make out with their boyfriends together in the same car; they pass dirty notes to each other during the day at school. They tell each other everything: \"That was the kind of friends we were\".After they graduate, things begin to shift. Vangie gets a job waitressing and moves in with Del; June, unable to get a job anywhere but the local factory, moves in with Ray and his older brother Luke. As they become more involved in their lives with their men, they see each other infrequently, but not so seldom that it doesn't become clear to Vangie that there's something dangerous going on, that June has crossed a line with the men in her life that even Vangie would not.",
        "Category": " Fiction , General",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "War Stories: Remembering World War II",
        "Authors": "By Ambrose, Stephen E. (FRW) and Mullener, Elizabeth",
        "Description": "War Stories chronicles 53 personal testimonies of virtually every major event from World War II by residents of New Orleans-from a Polish army officer who was defending his homeland the day of the German invasion to a member of the honor guard aboard the U.S.S. Missouri the day the Japanese signed the surrender papers. This one-of-a-kind memorial represents journalist Elizabeth Mullener's 12-year dedication to preserving eyewitness accounts of the most devastating conflict in human history.",
        "Category": " History , Military , World War II",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Poker Night: Winning at Home, at the Casino, and Beyond",
        "Authors": "By Vorhaus, John",
        "Description": "\"You can do things in a poker game that you'd never get away with in polite society.\"Thus proclaims poker strategist, columnist, and author John Vorhaus in this smart, funny, and practical guide to mastering the fine art of the home poker game (in other words, entertaining your friends while deftly picking them clean).Covering everything from the absolute basics to advanced points of strategy and smarts, Poker Night is an essential and entertaining manual for everyone who wants to excel at the most popular poker game in the world-- the home game, where the pots aren't cut and the winning gets personal.  Topics include:*Setting up and running rules that create a great game*Understanding your opponents, including their \"tells\"*Avoiding common and not-so-common mistakes*Understanding faive-card draw, seven-card stud, split-pot games, Texas hold'em, as well as homegrown variations and entertaining twists*Advice for no-limit hold'em tournaments, the latest trend in home play*A glossary of poker terms to have you slingin' the slang like a champFilled with hilarious observations and hard-nosed strategies for beating the rules, this smart, sassy, and readable handbook holds the key to your poker success-- whether you're just learning or you already know the difference between a fishhook and a dead man's hand.  Share it with friends at your own risk.",
        "Category": " Games , Card Games , Poker",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Mother-Daughter Movies: 101 Films to See Together",
        "Authors": "By Rogers, Rosemary, Michlin, Nell Rogers, and Bode, Christine Ernst",
        "Description": "Nobody has a perfect mother. And, despite what some pushy moms would have us believe, nobody has a perfect daughter, either. It's sometimes hard to communicate with each other, but what can you do?  Should you turn to Dr. Phil, psychotropic drugs, a hit man? No! Here's the solution: It's so simple, so obvious, so painless---the movies!Drawing on more than twenty years of watching movies together, real-life mother and daughter Rosemary Rogers and Nell Rogers Michlin offer plot synopses, cast reviews, and behind-the-scenes gossip for more than one hundred of their all-time-favorite movies, including invaluable ratings you won't find anywhere else, such as:*Bonding Potential: Looking for serious mother-daughter time? Try one of their top picks, like Terms of Endearment, Freaky Friday, or The Joy Luck Club.*Hunk Factor: Hannah and Her Sisters may only rate a 1 (Michael Caine and Woody Allen have other important qualities....), but School Ties, with a shirtless Matt Damon, Ben Affleck, and Brendan Fraser, gets a well-earned 10.*Hankie Factor: Because sometimes we all need a good cry.*Squirming in Your Seat Watching a Sex Scene with Your Mother/Daughter: Trust us, you'll want to know ahead of time.Wise and witty, Mother-Daughter Movies offers a fresh perspective on life's most important issues---from family conflict to surviving high school to understanding when tweezed eyebrows can totally change your life. Nobody has a perfect mother. And, despite what some pushy moms would have us believe, nobody has a perfect daughter, either. It's sometimes hard to communicate with each other, but what can you do?  Should you turn to Dr. Phil, psychotropic drugs, a hit man? No! Here's the solution: It's so simple, so obvious, so painless---the movies!Drawing on more than twenty years of watching movies together, real-life mother and daughter Rosemary Rogers and Nell Rogers Michlin offer plot synopses, cast reviews, and behind-the-scenes gossip for more than one hundred of their all-time-favorite movies, including invaluable ratings you won't find anywhere else, such as:*Bonding Potential: Looking for serious mother-daughter time? Try one of their top picks, like Terms of Endearment, Freaky Friday, or The Joy Luck Club.*Hunk Factor: Hannah and Her Sisters may only rate a 1 (Michael Caine and Woody Allen have other important qualities....), but School Ties, with a shirtless Matt Damon, Ben Affleck, and Brendan Fraser, gets a well-earned 10.*Hankie Factor: Because sometimes we all need a good cry.*Squirming in Your Seat Watching a Sex Scene with Your Mother/Daughter: Trust us, you'll want to know ahead of time.Wise and witty, Mother-Daughter Movies offers a fresh perspective on life's most important issues---from family conflict to surviving high school to understanding when tweezed eyebrows can totally change your life.",
        "Category": " Performing Arts , Film , Guides & Reviews",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Ten Commandments of Success",
        "Authors": "By Belasco, James A.",
        "Description": "",
        "Category": " Business & Economics , Leadership",
        "Publisher": "New Millenium",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Buried Fire",
        "Authors": "By Stroud, Jonathan",
        "Description": "Deep in the English countryside, the unearthing of an ancient Celtic cross awakens an imprisoned dragon and unleashes a smoldering evil. Less than a mile away, 13-year-old Michael McIntyre falls asleep on a lush green hill, and wakes up with frightening and sinister new abilities. Michael possesses the four gifts of the dragon-and he's not the only one, nor is he the most powerful. The others, whose identities will be slowly revealed, offer Michael powers beyond his wildest dreams if he will keep their secret safe. Now he must choose: give up these astonishing but devastating new abilities and help his family and friends banish the evil that lies beneath their fragile earth, or join the others in their crusade to protect their gifts and set the dragon free - a choice that may well destroy everyone Michael loves. Those with power will stop at nothing to keep its secret, while those without it need Michael's protection to survive. Buried Fire combines elements of fantasy and mythology in a spellbinding tale of good versus evil.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Pearl Diver: A Novel (The Rei Shimura Series, 7)",
        "Authors": "By Massey, Sujata",
        "Description": "The seventh book in Sujata Massey's Agatha and Macavity Award–winning mystery series is a witty, suspenseful story that takes its young sleuth into the Washington DC restaurant world.  A dazzling engagement ring and the promise of a fresh start bring antiques dealer and sometime sleuth Rei Shimura to Washington, DC. But just as she's starting to settle down –catching up with a long–lost cousin and undertaking a lucrative commission furnishing a trendy Japanese restaurant nearby – things begin to go haywire. First, her cousin vanishes from the restaurant's opening–night party, and then Rei is drafted to help find a Japanese war bride who disappeared 30 years earlier.  The search for both missing women becomes suspiciously linked, and along the way, Rei faces truths about herself that may change her destiny – if she lives long enough.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "What Liberal Media?: The Truth About Bias and the News",
        "Authors": "By Alterman, Eric",
        "Description": "The question of whose interests the media protects—and how—has achieved holy-grail-like significance. Is media bias keeping us from getting the whole story? If so, who is at fault? Is it the liberals who are purported to be running the newsrooms, television and radio stations of this country, duping an unsuspecting public into mistaking their party line for news? Or is it the conservatives who have identified media bias as a reliably inflammatory rallying cry around which to consolidate their political base as they cynically “work the refs?” The media has become so pervasive in our lives that regardless of exactly where on the ideological fence you sit, the question of media bias has become all but unavoidable.Most of the criticism (and anger) has so far emanated from the political Right, which has offered us the rather unconvincing argument that a systematic Left bias is destroying the quality of news and debate in our country today. Journalist and historian Eric Alterman begs to differ.What Liberal Media? confronts the question of liberal bias and, in so doing, provides a sharp and utterly convincing assessment of the realities of political bias in the news. In distinct contrast to the conclusions reached by Ann Coulter, Bernard Goldberg, Sean Hannity, and Bill O’Reilly, Alterman finds the media to be, on the whole, far more conservative than liberal, though it is possible to find evidence for both views. The fact that conservatives howl so much louder and more effectively than liberals is one significant reason that big media is always on its guard for “liberal” bias but gives conservative bias a free pass. After reading What Liberal Media? you will understand that the real news story of recent years is not whether this newspaper, or that news anchor, is biased but rather to what extent the entire news industry is organized to communicate conservative views and push our politics to the right—regardless of how “liberal” any given reporter may be.",
        "Category": " Language Arts & Disciplines , Journalism",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Jerusalem's Hope (Zion Legacy, Book 6)",
        "Authors": "By Thoene, Bodie and Thoene, Brock",
        "Description": "Sales of more than seven million copies have taken Bodie and Brock Thoene's historical fiction to the top of bestseller lists and built them a fervent following. Jerusalem's Hope, the final volume in their superb Zion Legacy series, continues the story-within-a-story of The Jerusalem Scrolls and Stones of Jerusalem. Israeli strategist Moshe Sachar has taken refuge in a secret tunnel, beneath the Temple Mount, from the battle chaos of the 1948 war of independence. Now, he opens another of the temple's ancient scrolls and plunges into the supreme drama of the first century A.D. As word spreads of the miracles performed by a charismatic but mysterious prophet, Yeshua, people whose lives he has touched are caught up in destiny. A Roman centurion-in love with a Hebrew beauty-is torn between admiration and duty. Three \"sparrows,\" ragamuffin orphan boys in hiding with Yeshua, are his vital messengers to a shepherd in Bethlehem. As all these characters converge on the dangerous road to Jerusalem at Passover, Jerusalem's Hope delivers the timely and sweeping climax fans have been waiting for.",
        "Category": " Fiction , Literary",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Mammoth Book of Fighter Pilots: Eyewitness Accounts of Air Combat from the Red Baron to Today's Top Guns (Mammoth Books)",
        "Authors": "By Lewis, Jon E. (EDT)",
        "Description": "From yesteryear’s flying aces to today’s top guns, The Mammoth Book of Fighter Pilots presents, in the words of the combat pilots who fought them, fifty incredible air battles that have shaped military history in the twentieth century. Veteran anthologist Jon E. Lewis has assembled firsthand accounts from all the great military campaigns of aerial warfare, including World Wars I and II, the Spanish Civil War, Korea, Vietnam, the Falklands, the Gulf, and Bosnia. Page after exciting page of this singular collection brings into vivid play the exploits of such legendary pilots as Manfred von Richtofen, Eddie Rickenbacker, Douglas Bader, and Johnnie Johnson; the Luftwaffe World War II aces Heinz Knoke, Gerd Barkhorn, and Johannes Steinhoff; and forty other brave airmen from America, Britain, France, Japan, Russia, and North Korea. Here, too, are the planes in which these pilots flew into modern history?the Spitfire, the Mustang, the Me 109, the Zero, the F-16, the MiG, and the Harrier. Together with the death-defying drama of combat, this volume vividly captures other facets of the fighter pilot’s life, including the perils of bailing out in enemy territory, the daily horrors of internment in a Japanese POW camp, and a harrowing account of being shot down in a blazing Spitfire. The true-life aerial combat adventures in this stirring collection provide a vicarious, adrenaline-fueled expedition into the shell-blasted skies of war in the twentieth century.",
        "Category": " History , Military , Weapons",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "How Schools Shortchange Girls: The AAUW Report : A Study of Major Findings on Girls and Education",
        "Authors": "By American Association of University Women, AAUW members",
        "Description": "This eye-opening study served as a wake-up call, exposing the systematic bias that girls face in education. While girls and boys enter school roughly equal in measured ability, by age fifteen girls have poor self-images and constrained views of their futures. In addition to a wealth of data, the report also suggests specific strategies to effect changes. This book catalyzed local, state, and national action, and today few conversations about gender and education in the academic and research communities neglect to mention this watershed report.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Marlowe & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Beyond the Words: The Three Untapped Sources of Creative Fulfillment for Writers",
        "Authors": "By Goldberg, Bonni",
        "Description": "Explores three less-practiced aspects of the creative writing process to counsel writers on how to form ideas, finalize a draft, and take appropriate measures upon completion, in an encouraging guide that discusses motives and choices. By the author of Room to Write. Original. 15,000 first printing.",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Modernity & Tradition",
        "Authors": "By Al-Farsy, Fouad",
        "Description": "Al-Farsy offers an assessment of progress in the Kingdom of Saudi Arabia, providing an overview of the most ambitious development program in history, setting the Kingdom in a global political and economic context. He shows how rapid progress was achieved in the only country on earth which uses the Koran as its constitution without diminishing its distinctive Islamic identity. The author is Deputy Minister of Information, Kingdom of Saudi Arabia. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " History , Middle East , General",
        "Publisher": "Routledge",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Lupus Q&A: Everything You Need to Know, Revised Edition",
        "Authors": "By Lahita, Robert G. and Phillips, Robert H.",
        "Description": "A rheumatologist and a psychologist offer an informative and compassionate perspective on coping with lupus for patients and their families. Lupus is a chronic autoimmune disease that is difficult to diagnose, and the symptoms-from achy joints to skin rashes-often mimic those of other diseases. Based on extensive research and clinical experience, Lupus Q&A answers the myriad questions of the more than 1.4 million lupus patients in this country. The book demystifies lupus by explaining diagnosis, symptoms, treatments, medication, and the psychological impact of the disease.",
        "Category": " Health & Fitness , Diseases , General",
        "Publisher": "Avery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Wedding Readings: Centuries of Writing and Rituals on Love and Marriage",
        "Authors": "By Munro, Eleanor C. (EDT)",
        "Description": "This rich collection of writings on the nature of love and commitment has long delighted brides and grooms of every denomination. Culled from both sacred and secular texts, and suitable for either traditional or informal wedding ceremonies, these selections might be included in Catholic, Protestant, Jewish, interfaith, and non-denominational exchanges of vows. Among the passages appropriate for readings by parents, friends, or the bride and groom are selections from Plato and Sappho, Rilke and Auden, Ecclesiastes and Euripedes, Shakespeare and Donne, pascal and Montaigne, Emily Dickinson and Anne Morrow Lindbergh. There are love songs from the Aztecs and Eskimos, Hindu and African wedding prayers, a Buddhist marriage homily, a Shaker hymn, and Irish blessing, excerpts from Coptic Orthodox and Greek Orthodox marriage services, and passages from the Old and New Testaments, some familiar, some surprising. With myriad choices, Wedding Readings will help you add a special, personal touch to your marriage ceremony.",
        "Category": " Reference , Weddings",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Christianity in the Twenty-first Century: Reflections on the Challenges Ahead",
        "Authors": "By Wuthnow, Robert",
        "Description": "In the year 2000--and beyond--what will the church be like? What challenges will it face? Will the church be able to provide a strong sense of community? Will it be an ethical force in the lives of Americans? And what role will religion play in politics and in the marketplace?In Christianity in the 21st Century Robert Wuthnow reflects on these provocative questions as he seeks to identify changes that are taking place now in American society that churches must address if they are to remain vital in the future. He foresees five critical areas--institutional, ethical, doctrinal, political, and cultural--in which major challenges will arise, then meets the thorny issues head-on. How will churches' resource bases, their very identity, and their capacity to carry on their spiritual traditions be altered? till they continue to function as sources of caring in a needy world? What impact will the resurgence of fundamentalism have, and how will moderate and liberal congregations react? How will the political activities of churches influence their capacity to be heard in the public arena, and what will the impact be of pluralism and the prevailing materialism of our society?Drawing on a wide range of first-hand observations and research, Wuthnow demontrates that in each of these five areas people of faith have strong reasons to enter the next century with confidence in their religious institutions. But he also highlights worrisome signs, and points to specific areas that need to be addressed to ensure the continuing vitality for Christianity in America--not least among these are the rampant individualism that erodes spiritual communities and the religious infighting that diminishes the Christian sense of unity.The onset of a new millennium affords a historic opportunity to take stock of the present situation and to plan for the future--in the years ahead, much reflection is likely to occur about all our major institutions.Christianity in the 21st Century aims to contribute to those reflections by offering a sobering, realistic, and ultimately hopeful assessment of where the church is now, and where the church is headed.",
        "Category": " Literary Collections , Ancient & Classical",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Don't Buy the Lie: Discerning Truth in a World of Deception (invert)",
        "Authors": "By Matlock, Mark",
        "Description": "This book helps teenagers understand how to think clearly and biblically about supernatural events. Every day we hear of supernatural phenomenon—from Ouija boards to crop circles to psychics on TV—and it’s difficult for teens to know how to distinguish between genuine and counterfeit occurrences. Author Mark Matlock, who has conducted a research project with Barna Research on Teens and the Supernatural and is a member of the international community of illusionists, presents clear principles and intriguing examples that teach teens how to respond to the supernatural with wisdom, discernment, and without being duped. Using the Acts community at Berea as a model, Matlock identifies “thinking traps” that lead to deception, such as not balancing the mind and emotions, mixing truth with lies, and making false association. With clarity, he shows readers how to find Christ, and provides biblical answers to frequently asked questions about such things as Ouija boards, psychics, angels, and demons. Upside-down. Turned around. Sound like a typical day for you? invert books meet you where you are—in the twisted, flipped around places in your life. You’ve got so many relationships to focus on—God, others, and even yourself—invert books will help you figure out how to give yourself fully to all of them. invert tackles the difficult topics that are important to you—and will help you turn to focus on God more clearly.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Zondervan/Youth Specialties",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Recipes for Surfaces: Volume II: New and Exciting Ideas for Decorative Paint Finishes",
        "Authors": "By Drucker, Mindy and Rosen, Nancy",
        "Description": "This gourmet guide to home decoration picks up where its top-selling predecessor, Recipes for Surfaces, leaves off. Illustrated with stunning full-color photographs and featuring more than thirty clear, concise recipes for everything from marble and metallic finishes to specialty finishes such as ragging, stenciling, and decoupage, Recipes for Surfaces Volume II helps you transform walls, doors, floors, and furniture into a visual feast.   Leopard skin stenciling  Brick Finish  Moire  Copper verdigris  Bronze verdigris  Red marble",
        "Category": " Crafts & Hobbies , Painting",
        "Publisher": "Fireside",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The Secret of Castle Cant",
        "Authors": "By Christiana, David (ILT) and Bath, K. P.",
        "Description": "After years of being a loyal servant to the family of the Baron of Cant, Lucy is shocked to discover that she was an orphan and the true heir to the throne of Cant and so now must decide whether to remain devoted to her long-time employees or stand with her real family as they prepare a revolt to win back her rightful kingdom.",
        "Category": " Juvenile Fiction , Social Themes , New Experience",
        "Publisher": "Little, Brown Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Works on Paper: The Craft of Biography and Autobiography",
        "Authors": "By Holroyd, Michael",
        "Description": "Holroyd (a biographer of Lytton Strachey, Bernard Shaw, and others) has gathered essays, lectures, and short reviews produced over the last 25 years into a collection that will appeal to those who love biography and British life and fiction.  In addition to Strachey and Shaw, writers featured include H.G.  Wells, Rebecca West, Evelyn Waugh, and Gwen John. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Literary Collections , Essays",
        "Publisher": "Counterpoint",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Latino Wave: How Hispanics Are Transforming Politics in America",
        "Authors": "By Ramos, Jorge and Fitz, Ezra E.",
        "Description": "With a population of 40 million and growing, the United States witnessed Latinos becoming the largest minority in America in 2003—creating a voting bloc with the potential to determine the outcome of elections throughout the nation.\u2028In The Latino Wave, award-winning journalist Jorge Ramos argues that the political party that can correctly understand the wants and needs of Hispanics will triumph at the polls. Ramos deftly clarifies these points, among many others, and explains why it&#39;s necessary to bridge the gap of misunderstanding that exists between Latinos and non-Latinos.With insight from the nation&#39;s Latino political luminaries and interviews with Hispanics living across the United States, Ramos reveals who these New Americans really are—and what it means for the country.",
        "Category": " Social Science , Ethnic Studies , Hispanic American Studies",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Heartsongs",
        "Authors": "By Stepanek, Mattie J. T.",
        "Description": "A new edition of the beloved poetry collection includes sixteen pages of new poems and illustrations, written by eleven-year-old muscular dystrophy patient Mattie Stephanek, sharing his feelings and thoughts about his life, death, nature, faith, and hope. 250,000 first printing.",
        "Category": " Poetry , Subjects & Themes , Inspirational & Religious",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "How to Raise a Child with a High EQ: A Parents' Guide to Emotional Intelligence",
        "Authors": "By Shapiro, Lawrence E.",
        "Description": "Studies show that emotional intelligence -- the social and emotional skills that make up what we call character -- is more important to your child's success than the cognitive intelligence measured by IQ.  And unlike IQ, emotional intelligence can be developed in kids at all stages.Filled with games, checklists and practical parenting techniques, How to Raise a Child with a High EQ  will help your child to cope with -- and overcome -- the emotional stress of modern times and the normal problems of growing up.",
        "Category": " Self-help , Emotions",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The Painted Pig: A Mexican Picture Book",
        "Authors": "By Morrow, Elizabeth Cutter and D'Harnoncourt, Rene (ILT)",
        "Description": "When the toymaker forgets to make him a piggy bank, a young Mexican boy finds some clay and tries to make one of his own. Includes historical notes on Mexican folk art and the author's experiences in Mexico as the wife of the United States ambassador in the 1920s.When the toymaker forgets to make him a piggy bank, a young Mexican boy finds some clay and tries to make one of his own.",
        "Category": " Juvenile Fiction , People & Places , Caribbean & Latin America",
        "Publisher": "Univ of New Mexico Pr",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The New Dickson Baseball Dictionary",
        "Authors": "By Dickson, Paul",
        "Description": "From Abner Doubleday to Zurdo, from its thorough bibliography to its innovative thesaurus, this indispensable baseball resource is “that rarest of sports books, a valuable reference work that provides absorbing and enlightening reading” (Sports Illustrated). Winner of the Society of american Baseball Researchers Award. Black-and-white photographs.",
        "Category": " Reference , Dictionaries",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Wagon Train (Rise and Shine) (Penguin Young Readers, Level 3)",
        "Authors": "By Kramer, Sydelle and Ray, Deborah Kogan (ILT)",
        "Description": "What was it like to head out west in a covered wagon? How did the pioneers get their wagons over rugged mountains and across wide rivers? Hop aboard the wagon train and find out what life was like for American pioneers!",
        "Category": " Juvenile Nonfiction , History , United States , 19th Century",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "The Nation, 1865-1990: Selections from the Independent Magazine of Politics and Culture",
        "Authors": "By Heuvel, Katrina Vanden (EDT), Doctorow, E. L. (INT), and Navasky, Victor (AFT)",
        "Description": "This landmark anthology celebrates The Nation's 125th anniversary with the best of the magazine's articles, essays, poems, and drawings. Contributors include  Henry James, Sinclair Lewis, Willa Cather, H. L. Mencken, W. E. B. DuBois, Adolf Hitler, Langston Hughes, Ezra Pound, Moshe Menuhin, Albert Einstein, James Thurber, Emma Goldman, Federico Garcia Lorca, Bertrand Russell, Thomas Mann, W. B. Yeats, W. H. Auden, Jean-Paul Sartre, James Agee, Wallace Stephens, Lawrence Ferlinghetti, Ralph Nader, Slyvia Plath, Hunter S. Thompson, Pablo Neruda, Kurt Vonnegut, Gore Vidal, Carlos Fuentes, Daniel Singer, Alice Walker, and many more.",
        "Category": " Political Science , Essays",
        "Publisher": "Thunder's Mouth Press",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Best Food Writing 2002",
        "Authors": "By Hughes, Holly (EDT)",
        "Description": "Best Food Writing 2002 assembles, for the third year, the most exceptional writing from the past year's books, magazines, newspapers, newsletters, and websites. Contributors include Jeffrey Steingarten, Ruth Reichl, Calvin Trillin, Amanda Hesser, and dozens more. Within its six sections&#151;Stocking the Larder, Home Cooking, Someone's in the Kitchen, Dining Around, Food Fights, and Personal Tastes&#151;read our best writers on everything from the year's most celebrated chefs to extraordinary restaurant experiences, from the latest trends in ingredients and equipment to unforgettable memoirs inspired by cooking and eating. Neither cook nor food lover should be without this remarkable annual collection.",
        "Category": " Cooking , Essays & Narratives",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Nasty People: How to Stop Being Hurt by Them without Stooping to Their Level",
        "Authors": "By Carter, Jay",
        "Description": "Fourteen years since its first publication, the bestsellerNasty People has been revised and updated to cover the motivations of nasty people, how to avoid confrontation with a nasty boss, how to handle a nasty spouse, and much more, including:How to break the cycle of nastiness A new understanding of personality disorders and depression Narcissism, nasty behavior, and self-doubt Nasty people and self-validation The role adrenaline plays in nasty behavior and our responses to it. Everyone knows a person who has been hurt, betrayed, or degraded by nasty individuals or has experienced it themselves. In three books, Jay Carter, Psy. D., shows readers how to stop this cycle of overt and covert abuse, without resorting to nasty tactics. Now for the first time, this series is released together to cover all areas of dealing with difficult people. With straight-talking advice, real-life anecdotes, and psychology that makes sense, Carter explains how to handle and stop painful behavior that harms both the perpetrator and the victim.",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "The McGraw-Hill 36-Hour Real Estate Investment Course",
        "Authors": "By Cummings, Jack",
        "Description": "",
        "Category": " Business & Economics , Real Estate , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Life Beyond: Compelling Evidence for Past Lives and Existence After Death",
        "Authors": "By Holzer, Hans",
        "Description": "In this carefully researched book, Hans Holzer, one of the world's leading investigators of the supernatural, presents compelling accounts of encounters with the spirit world.  Filled with astounding information about what awaits us after the grave, Life Beyond documents true case histories of individuals who have stood at the threshold of another dimension, lived in previous incarnations, or had first-hand experiences with others who have passed over.",
        "Category": " Body, Mind & Spirit , Reincarnation",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.4",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "The Zen of Zim: Baseball, Beanballs and Bosses",
        "Authors": "By Zimmer, Don, Madden, Bill, and Piniella, Lou (FRW)",
        "Description": "Don Zimmer is baseball. His first book, Zim-A Baseball Life, was a New York Times bestseller and one of the best baseball memoirs ever published. Now, in The Zen of Zim, one of baseball's most beloved figures offers readers an insightful look into the baseball of yesterday and today. Baseball fans will love hearing Zim's positions on such things as pitching inside, managing, bosses, and more.With more than fifty-six years in baseball, Don Zimmer had seen it all, or so he thought before he ran into George Steinbrenner. Here Zimmer provides a revealing account of his eight years as Joe Torre's right-hand man-and the jealousy, vindictiveness, and pettiness that ultimately destroyed a twenty-five-year friendship with Steinbrenner.Zim will also discuss the circumstances that led to his charging onto the field at Fenway Park and throwing a haymaker at Boston Red Sox pitcher Pedro Martinez. He'll share with readers what it was like to work for other baseball owners; shed new light on general managers like Branch Rickey and Dan Duquette; and critique the managing styles of some of the most famous and notorious skippers of the twentieth century, from Casey Stengel and Earl Weaver to Gene Mauch and Billy Martin. In a chapter called \"What Have They Done to My Game?,\" Zim will offer a crash course in baseball anthropology, describing how the game and its players have changed over the past fifty years and showing how big money and free agency have destroyed clubhouse camaraderie and turned a team sport into a transient game. In contrast, he celebrates his close-knit teammates on the 1955 Brooklyn Dodgers team and the lifelong friendships that were made.Zim has seen it all, and here readers learn even more of his life and dreams and of baseball through a half century of experience. It is a story jam-packed with laughs and anecdotes, with excitement and comedy. And it is superbly told.",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Big Hair",
        "Authors": "By Innes-Smith, James",
        "Description": "A hair-raising journey through the era when big was king.In the beginning, there was the hair. And some of the hair was bad, but it was small. As men and women everywhere worked to improve and increase their lot, however, they stumbled onto some of humankind's most miraculous innovations: spray, gel, mousse, crimping irons, and of course, the perm. With these new tools, people everywhere suddenly found themselves able to coax their lank, lifeless tresses toward glorious new heights. The age of big hair had begun.Now, the greatest of these bouffants, afros, rakes, beehives, and Flock-of-Seagulls have been plucked from their spots in hairdressers' windows and given the respect they so clearly demand. Bigger and badder than you ever dreamed possible,Big Hair goes out to all those people of yesteryear who were unafraid to think BIG.",
        "Category": " Humor , General",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "These United States: Original Essays by Leading American Writers on Their State Within the Union (Nation Books)",
        "Authors": "By Leonard, John (EDT)",
        "Description": "These United States is a landmark original anthology that includes essays by Sherman Alexie on Washington, Annie Proulx on Wyoming, James Lee Burke on Louisiana, Tony Hillerman on New Mexico, Molly Ivins on Texas, Diane McWhorter on Alabama, Frank Conroy on Iowa, and Charles Bowden on Arizona. Edited by John Leonard&#151;mixed-media critic for CBS News Sunday Morning&#151;this work truly represents America from the bottom up, as seen by its leading writers and essayists. It is one of the most original and redemptive books in years.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Bold Type Books",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Successful Time Management: A Self-Teaching Guide",
        "Authors": "By Ferner, Jack D.",
        "Description": "A proven action plan for enhancing your most precious resource--time Do you feel bogged down by paperwork, routine chores, and interruptions? Have you told yourself that if you only had more time you could accomplish more in your professional and personal life? This practical guide shows you how to manage your time most efficiently and effectively. Revised and expanded to include the latest strategies and equipment, Successful Time Management, Second Edition, helps you develop and enact an action plan to get more done at work and at home. Jack Ferner's interactive, step-by-step approach offers:* Clear-cut, easy-to-follow guidelines on how to recognize, analyze, and fix existing time-management problems* Proven strategies for establishing clear goals, setting priorities, and committing to a course of action* Expert tips on controlling interruptions, saying no when necessary, and delegating* Dozens of helpful charts and planning worksheets, skill-building exercises, and actual cases\"Imaginative and provocative.a readable and interesting treatment of a subject that all may find profitable..Recommended.\" --Academy of Management Review \"One of the best single publications to help the individual.become more proficient in time management..Belongs in the library of every manager.\" --Training World",
        "Category": " Business & Economics , Time Management",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Nerds 2.0.1",
        "Authors": "By Segaller, Stephen",
        "Description": "A companion book to the PBS television series chronicles the thirty-year development of the Internet from its beginnings as a cold war effort to build a network of government computers in order to save money",
        "Category": " Humor , General",
        "Publisher": "TV Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Algebra for the Clueless",
        "Authors": "By Miller, Robert",
        "Description": "Student tested and approved! If you suffer from math anxiety, then sign up for private tutoring with Bob Miller! Do sets, theorems, and equations leave your head spinning? If so, you are like hundreds of thousands of other students who face math--especially, algebra--with fear. Luckily, there is a cure: Bob Miller's Clueless series! Like the teacher you always wished you had (but never thought existed), Bob Miller brings a combination of knowledge, empathy, and fun to the often-troubling subject of algebra. He breaks down the learning process in an easy, nontechnical way and builds it up again using his own unique methods. \"Basically, the Clueless books are my notes. Exactly the way I teach: friendly, clear...with some humor and plenty of emotion!!\" Meant to bridge the gulf between the student, the textbook, and the teacher, Algebra for the Clueless is packed with all the information you need to conquer algebra. This extensive guide gives you: anxiety-reducing features on every page; easy-to-grasp methods that make algebra understandable; bite-sized math portions that fit short study sessions (and short attention spans); full explanations of basic principles to make hard problems easy; quick tips for solving difficult problems; . \"I am always delighted when a student tells me that he or she hated math...but taking a class with me has made math understandable...even enjoyable.\" Now it's your turn. Sharpen your #2 pencils, and let Bob Miller show you how to never beclueless again!",
        "Category": " Mathematics , Study & Teaching",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Peace Kills: America's Fun New Imperialism",
        "Authors": "By O'Rourke, P. J.",
        "Description": "One of the nation's most controversial journalists and humorists offers another hard-hitting survey of the foibles of American foreign policy, recounting his experiences among consumers in Kuwait, in security obsessed airports around the globe, and in Kosovo, where \"NATO tried to start World War III without hurting anyone.\" 100,000 first printing. $75,000 ad/promo.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Atlantic Monthly Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Healthy Kids: Help Them Eat Smart and Stay Active--for Life!",
        "Authors": "By Henner, Marilu and Henner, Lorin",
        "Description": "We all want our children to be fit and healthy, but the current invasion of fast food, sugary snacks, and oversize portions are creating an epidemic of overweight, inactive, and unhealthy kids. The powerful influences of the fast-food industry, omnipresent junk food advertising, and the vicious cycle of TV, computer games, and Internet addictions only make our children more susceptible to a sedentary lifestyle and a lifetime of bad habits and obesity. Now, health pioneer and dedicated mom Marilu Henner says it's time to say good-bye to sugarcoated cereals, artificially colored cheese puffs, oceans of sugary soft drinks, nutritionally deficient school lunches, and fastfood supermeals!As Marilu explains, parents who want the best for their children need to feed them fresh, whole foods to grow by. In Healthy Kids she shows you how to create a healthy, balanced lifestyle for your kids and how to make the transition from dairy-, fat-, sugar-, and chemical-laden foods to the vibrant, natural, nourishing foods we were all meant to eat.Healthy Kids offers a proven plan to help parents and kids alike learn to eat healthier and feel better. Inspiring and enjoyable to read, it features:More than 100 mouthwatering recipes your children will loveHelpful, creative suggestions on getting your child into the habit of exerciseScores of tips on transitioning from dead food to live foodA special For Kids Only section with fabulous food-based puzzles, games, and challengesAge-specific recommendations for what foods your children might likeTimesaving shopping lists and helpful food preparation chartsExpert advice from pediatricians, physical trainers, teachers, and expert nutritionists on all aspects of nourishing your familyAs Marilu says, Healthy Food = Healthy Children. And Healthy Kids provides the essential information on creating a lifetime of nutritional eating habits for your growing children.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Feast of India: A Legacy of Recipes and Fables",
        "Authors": "By Rani",
        "Description": "\"Traditional curries and kabobs, pilao and dals--some 150 in all.... What differentiates this from the standard compendiums is Rani's nod to the past and the present.\" --Booklist",
        "Category": " Cooking , Regional & Ethnic , Indian & South Asian",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Darwin's Spectre",
        "Authors": "By Rose, Michael R.",
        "Description": "Extending the human life-span past 120 years. The \"green\" revolution. Evolution and human psychology. These subjects make today's newspaper headlines. Yet much of the science underlying these topics stems from a book published nearly 140 years ago--Charles Darwin's On the Origin of Species. Far from an antique idea restricted to the nineteenth century, the theory of evolution is one of the most potent concepts in all of modern science. In Darwin's Spectre, Michael Rose provides the general reader with an introduction to the theory of evolution: its beginning with Darwin, its key concepts, and how it may affect us in the future. First comes a brief biographical sketch of Darwin. Next, Rose gives a primer on the three most important concepts in evolutionary theory--variation, selection, and adaptation. With a firm grasp of these concepts, the reader is ready to look at modern applications of evolutionary theory. Discussing agriculture, Rose shows how even before Darwin farmers and ranchers unknowingly experimented with evolution. Medical research, however, has ignored Darwin's lessons until recently, with potentially grave consequences. Finally, evolution supplies important new vantage points on human nature. If humans weren't created by deities, then our nature may be determined more by evolution than we have understood. Or it may not be. In this question, as in many others, the Darwinian perspective is one of the most important for understanding human affairs in the modern world. Darwin's Spectre explains how evolutionary biology has been used to support both valuable applied research, particularly in agriculture, and truly frightening objectives, such as Nazi eugenics. Darwin's legacy has been a comfort and a scourge. But it has never been irrelevant.",
        "Category": " Science , Life Sciences , Evolution",
        "Publisher": "Princeton University Press",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Virgin: Prelude to the Throne",
        "Authors": "By Maxwell, Robin",
        "Description": "...a riveting portrait of Elizabeth I as a romantic and vulnerable teenager, dangerously awakening to a perilous liaison with the wrong man.  England, 1547: King Henry is dead. Elizabeth's half-brother, nine-year-old Edward, is king in name only. Thomas Seymour, brother to the ambitious duke who has seized power in this time of crisis, calculatingly works his way into Elizabeth's home in genteel Chelsea House. He marries Henry's widow, Catherine Parr, and uses his venerable charms and sexual magnetism to indulge his infatuation for young Elizabeth. Caught hopelessly under Thomas Seymour's spell, surrounded by kind friends and hidden enemies, Elizabeth can only follow her heart to ensure survival.  \"History doesn't come more fascinating\" (Entertainment Weekly) than in the enthralling novels of Robin Maxwell. Virgin is her crowning achievement in a stunning trilogy that \"brings all of bloody Tudor England vividly to life\" (Publishers Weekly, starred review).",
        "Category": " Fiction , Historical , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The Woman Who Laughed at God: The Untold History of the Jewish People (Compass)",
        "Authors": "By Kirsch, Jonathan",
        "Description": "Who is a Jew? In this colorful, eye-opening work, bestselling author and lecturer Jonathan Kirsch takes us on a three-thousand-year tour of Jewish identity and diversity and offers answers to this complex and difficult question. Kirsch reveals that Judaism has never been a religion of strict and narrow orthodoxy. For every accepted tradition in Jewish faith there are countertraditions rooted in biblical antiquity: the Maccabee freedom fighters who closed the Bible and picked up swords, dervish-like ecstatics who claimed to enjoy direct communication with God even after they had been excommunicated by a distrustful rabbinate, and courageous men and women who were the forgotten heroes of the Holocaust. With drama and narrative verve, Kirsch explores these and many other \"Judaisms\" that make up the rich tapestry of Jewish identity.",
        "Category": " Religion , History",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Simon & Schuster's Guide to Saltwater Fish and Fishing",
        "Authors": "By Mojetta, Angelo",
        "Description": "Discusses the equipment and techniques of ocean fishing, and provides information on all species recognized by the International Game Fish Association as well as many others of interest for angling or food",
        "Category": " Nature , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Language Arts Grade 1: Build Learning Skills (Premium Education Series)",
        "Authors": "By Learning Horizons",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "Learning Horizons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Anne Frank: Beyond the Diary - A Photographic Remembrance",
        "Authors": "By Van Der Rol, Ruud and Verhoeven, Rian",
        "Description": "Anne Frank lived a life filled with the enthusiasms and hopes shared by many young women coming into adulthood.  But the times Anne lived in and wrote of in her diary made her simple life extraordinary.  In over one hundred photographs, many which have never been published, this poignant memoir brings to life the harrowing story of one young Jewish woman's struggle to survive during a period of history which must never be forgotten. \"All libraries will want this: for classroom units studying the Holocaust, for kids reading the diary, for everyone who remembers it.\"  - Booklist",
        "Category": " Juvenile Nonfiction , History , Holocaust",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Teach Yourself French Verbs",
        "Authors": "By Coggle, Paul (EDT) and Weston, Marie-Therese",
        "Description": "Master the verbs of a new language without intimidating textbooks or confusing chartsLearning verbs and remembering their correct usage is a daunting task for anyone studying a new language. The experts at Teach Yourself have developed the Teach Yourself Verbs series to deal with this perplexing yet necessary part of language learning. Perfect for students at any level of experience, the Teach Yourself Verbs series will increase their knowledge and proficiency and give their language confidence the boost it needs.Each book contains:Helpful hints on learning verb forms Explanation of various tenses and their useage Verb categories, their patterns, and their conjugations Full coverage of the main tenses for frequently used verbs, arranged alphabetically for quick and easy reference Examples of the verbs in everyday use, with colloquial expressions and keywords based on the verbs A glossary of verbs with details of the patterns they follow",
        "Category": " Language Arts & Disciplines , Grammar & Punctuation",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Mini Mysteries: 20 Tricky Tales to Untangle (American Girl Library)",
        "Authors": "By Walton, Rick",
        "Description": "Presents twenty short mystery tales for young readers which contain hidden clues, with the answers under the flaps at the end of the book.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "American Girl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The Dough Book",
        "Authors": "By Joner, Tone",
        "Description": "",
        "Category": " Crafts & Hobbies , Dough",
        "Publisher": "David Porteous Editions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Bob Miller's Geometry for the Clueless, 2nd edition (Bob Miller's Clueless)",
        "Authors": "By Miller, Robert",
        "Description": "An easy-to-use guide that takes the fear out ofgeometryBob Miller’s Geometry for the Clueless tackles a subjectmore than three million students face every year.Miller acts as a private tutor, painstakingly coveringthe high school curriculum as well as post secondarycourses in geometry.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    }
]