[
    {
        "Title": "1,628 Country Shortcuts: From 1,628 Country People",
        "Authors": "By Reiman, Roy (Editor)",
        "Description": "",
        "Category": "",
        "Publisher": "Reiman Assoc",
        "Price Starting With ($)": "18.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Butcher Bird",
        "Authors": "By Ing, Dean",
        "Description": "Uncovering the existence of a strange hunter-killer aircraft that strikes down men in the Middle East before moving to the Western Hemisphere, a U.S. intelligence team must discover who is in control of it before becoming the next target. Reprint.",
        "Category": " Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "The Best Little Girl in the World",
        "Authors": "By Steven Levenkron",
        "Description": "",
        "Category": "",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Filled with wonder: The life of Winfield M. Kelly, Jr",
        "Authors": "By Arena, Ronald J",
        "Description": "",
        "Category": "",
        "Publisher": "Arena Communications",
        "Price Starting With ($)": "48.56",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Pairing",
        "Authors": "By Bach, George R. and Deutsch, Ronald M.",
        "Description": "",
        "Category": "",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Dead Girls Are Easy (Nicki Styx, Book 1)",
        "Authors": "By Garey, Terri",
        "Description": "There's something about almost dying that makes a girl rethink her priorities. Take Nicki Styx—she was strictly goth and vintage, until a brush with the afterlife leaves her with the ability to see dead people.Before you can say boo, Atlanta's ghosts are knocking at Nicki's door. Now her days consist of reluctantly cleaning up messes left by the dearly departed, leading ghouls to the Light . . . and one-on-one anatomy lessons with Dr. Joe Bascombe, the dreamy surgeon who saved her life. All this catering to the deceased is a real drag, especially for a girl who'd rather be playing hanky-panky with her hunky new boyfriend . . . who's beginning to think she's totally nuts.But things get even more complicated when a friend foolishly sells her soul to the devil, and Nicki's new gift lands her in some deep voodoo.As it turns out for Nicki Styx, death was just the beginning.",
        "Category": " Fiction , Gothic",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Angel with Attitude (Warner Forever)",
        "Authors": "By Rowen, Michelle",
        "Description": "Valerie Grace isn't quite sure how she went from heavenly angel to plunging into the killer whale tank at Niagara Falls' MarineLand, but that's what's happened. All she knows is that earth can be a tough place for a fallen angel, what with all the demon Tempters lurking around every corner, anxious to recruit her to the \"other team\" - the evil team. All she can do is keep an eye out for the elusive Key to Heaven, try to help people, and hope that somebody up there notices what an angel she is, even if she's not literally one anymore. And try to avoid that really cute tempter, the one with the pale gray eyes and hypnotic smile, the one that makes her forget her own name and the fact that she's supposed to be a good girl.",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Forever",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "The Last Guardian of Everness (Chronicles of Everness)",
        "Authors": "By Wright, John C.",
        "Description": "The  rave reviews for John Wright's science fiction trilogy, The Golden Age, hail his debut as the most important of the new century. Now, in The Last Guardian of Everness, this exciting and innovative writer proves that his talents extend beyond SF, as he offers us a powerful novel of high fantasy set in the modern age. Young Galen Waylock is the last watchman of the dream-gate beyond which ancient evils wait, hungry for the human world.  For a thousand years, Galen's family stood guard, scorned by a world which dismissed the danger as myth. Now, the minions of Darkness stir in the deep, and the long, long watch is over. Galen's patient loyalty seems vindicated.  That loyalty is misplaced. The so-called Power of Light is hostile to modern ideas of human dignity and liberty. No matter who wins the final war between darkness and light, mankind is doomed either to a benevolent dictatorship or a malevolent one. And so Galen makes a third choice: the sleeping Champions of Light are left to sleep. Galen and his companions take the forbidden fairy-weapons themselves. Treason, murder, and disaster follow. The mortals must face the rising Darkness alone. An ambitious and beautifully written story, The Last Guardian of Everness is an heroic adventure that establishes John Wright as a significant new fantasist. It is just the start of a story that will conclude in the companion volume, Mists of Everness.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Tor Fantasy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "A Casebook on Henry James's the Turn of the Screw",
        "Authors": "By Willen, Gerald (editor)",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Y Crowell Company",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Future Choice: Why Network Marketing May Be Your Best Career Move",
        "Authors": "By Michael S. Clouse",
        "Description": "",
        "Category": "",
        "Publisher": "Nexera",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Slow Cooker recipe book",
        "Authors": "By Atkinson, Catherine",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "7.19",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Make-Up Book: Every Woman's Guide to the Art of Applying Make-Up",
        "Authors": "By Terri, Joy",
        "Description": "Most women use makeup every day, but few are completely satisfied with the result--or enjoy the full beauty benefits of a perfect application. A professional make-up artist gives you the tricks of the trade for flawlessly accentuating facial features and creating dynamic illusions. Know exactly what to look for in necessary tools--sponges, powder puffs, eyelash curlers, tweezers, and brushes--and identifying colors just for you. Glamorous close-up photos of models of all ages guide you through each step of application. First achieve the ideal eyebrow shape for your face. Mix and apply foundation to highlight and shade. Cover up dark rings and blemishes with concealer. Add powder. Define eyes, cheeks, lips--and voila you're gorgeous! Color charts are accompanied by candid recommendations so you're sure always to look your best.",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "Design Originals",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "The Horse Poster Book",
        "Authors": "By Allatson, Wendy",
        "Description": "",
        "Category": "",
        "Publisher": "Quercus Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "True Confessions",
        "Authors": "By Gibson, Rachel",
        "Description": "From New York Times bestselling author Rachel Gibson comes True Confessions, one of her early fan favorites. When California girl Hope Spencer arrives in Gospel, Idaho, she gets more than she bargained for—including a long, lean sheriff by the name of Dylan Taber. And when an unsolved local mystery involves them both--and when their flirting gets the better of them--Hope and Dylan know it’s time to make some true confessions . . . to each other.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Peace: The Words and Inspiration of Mahatma Gandhi (Me-We)",
        "Authors": "By Tutu, Desmond (FRW)",
        "Description": "",
        "Category": " Political Science , Peace",
        "Publisher": "Blue Mountain Arts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Negative criticism: Its swath of destruction and what to do about it",
        "Authors": "By Simon, Sidney B.",
        "Description": "Probes the motivations behind and the destructive effects of negative criticism, providing strategies for handling negative criticism and for avoiding the use of this tactic in dealing with friends, associates, and loved ones",
        "Category": "",
        "Publisher": "Argus Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Dr. Paula's Good Nutrition Guide For Babies, Toddlers, And Preschoolers",
        "Authors": "By Elbirt, Paula M.",
        "Description": "Children's eating habits change often between infancy and preschool. Dr. Paula's Good Nutrition Guide for Babies, Toddlers, and Preschoolers provides nutrition guidelines for young children and gives parents confidence in this confusing and important area.Pediatrician Paula Elbirt discusses nutrition by age group. Breastfeeding, formula, solids, allergy issues, gas, and burping are issues for infants. Topics for toddlers include creating a healthful diet, snacks, whole versus skim milk, tantrums and food, and eating styles. Food issues change again for preschoolers, and include friends' influence on eating habits, what to do when a child is cranky from hunger, and much more. Sample recipes and menus are provided for each group.Dr. Elbirt describes important differences between emerging eating disorders and odd but harmless food preferences kids embrace briefly and then discard. Whether they have \"fussy eaters\" or are looking for better ways to provide their children with the best nutrition, Dr. Paula's Good Nutrition Guide for Babies, Toddlers, and Preschoolers has the information parents need.",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Little Men (Signet Classics)",
        "Authors": "By Alcott, Louisa May",
        "Description": "Presents the classic story of young orphan boys growing up and learning honesty and self-reliance at the unorthodox New England school run by Jo March and her husband.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Signet Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "The Wishbones",
        "Authors": "By Perrotta, Tom",
        "Description": "Everything is going pretty well for Dave Raymond. He's 31, but he still feels young. He's playing guitar with the Wishbones, a New Jersey wedding band, and while it isn't exactly the Big Time, it is music. He has a roof over his head...well, it's his parents' roof, but they don't hassle him much. Life isn't perfect. But it isn't bad. Not bad at all. But then he has to blow it all by proposing to his girlfriend.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "The Heretic's Daughter",
        "Authors": "By Kent, Kathleen",
        "Description": "A woman condemned by the truth. Her daughter saved by a lie.Salem, 1752. Sarah Carrier Chapman, weak with infirmity, writes a letter to her granddaughter that reveals the secret she has closely guarded for six decades: how she survived the Salem Witch Trials when her mother did not.Sarah's story begins more than a year before the trials, when she and her family arrive in a New England community already gripped by superstition and fear. As they witness neighbor pitted against neighbor, friend against friend, the hysteria escalates--until more than two hundred men, women, and children have been swept into prison. Among them is Sarah's mother, Martha Carrier. In an attempt to protect her children, Martha asks Sarah to commit an act of heresy--a lie that will most surely condemn Martha even as it will save her daughter.This is the story of Martha's courageous defiance and ultimate death, as told by the daughter who survived.",
        "Category": " Fiction , Sagas",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "The Blue Ice",
        "Authors": "By Innes, Hammond",
        "Description": "",
        "Category": "",
        "Publisher": "Ballentine",
        "Price Starting With ($)": "6.01",
        "Publish Date": {
            "Month": "January",
            "Year": "1948"
        }
    },
    {
        "Title": "The Problem Of The Soul: Two Visions Of Mind And How To Reconcile Them",
        "Authors": "By Flanagan, Owen J.",
        "Description": "\"Science has always created problems for traditional ways of seeing things, but now the problem has become acute. Traditional humanistic ideas about the basic nature of humanity are under attack as never before. The very attributes that make us human - free will, the permanence of personal identity, the existence of the soul - are undermined and threatened by the current revolution in the science of the mind. If the mind is the brain, and therefore a physical object subject to deterministic laws, how canwe have free will? If most of our thoughts and impulses are unconscious, how can we be morally responsible for what we do? If brains and bodies are constantly undergoing change, how can our identities be constant?\" \"The Problem of the Soul shows the way out of these seemingly intractable paradoxes. Framing the conflict in terms of two dominant visions of the mind - the \"manifest image\" of humanistic philosophy and theology, and the scientific image - renowned philosopher Owen Flanagan demonstrates that there is, in fact, common ground, and that we need not give up our ideas of moral responsibility and personal freedom in order to have an empirically sound view of the human mind. With implications ranging from the stem-cell debate and the teaching of evolution to everyday life, this is a profoundly relevant work of philosophy for the common reader.\"--BOOK JACKET.",
        "Category": " Science , Philosophy & Social Aspects",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "The Divorce Culture: Rethinking Our Commitments to Marriage and Family",
        "Authors": "By Whitehead, Barbara Dafoe",
        "Description": "the author's Atlantic Monthly article \"Dan Quayle Was Right\" ignited a media debate on the effects of divorce that rages still. In this book she expands her argument, making it clear Americans need to strengthen their resolve with regard to divorce prevention, new ways of thinking about marriage, and a new consciousness about the meaning of committment. 240 pp. Author tour. Radio satellite tour. 60,000 print.",
        "Category": " Family & Relationships , Divorce & Separation",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "I Love You",
        "Authors": "By Schutz, Susan Polis",
        "Description": "Poems deal with the meaning of love and the challenges of maintaining a love relationship",
        "Category": " Poetry , American , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Grave Surprise (Harper Connelly Mysteries, Book 2)",
        "Authors": "By Harris, Charlaine",
        "Description": "Psychic sleuth Harper Connelly travels to Memphis and ends up involved in a case of murder times three in this mystery from #1 New York Times bestselling author Charlaine Harris.At the request of anthropology professor Clyde Nunley, Harper and her stepbrother Tolliver come to Memphis, Tennessee, to demonstrate her unique talent—in an old cemetery. Nunley is skeptical, even after Harper senses—and finds—two bodies in the grave beneath her feet. One of a man centuries-dead. The other, a young girl, recently deceased, whom Harper had once tried, and failed, to locate. But Harper’s new investigation into the crime yields yet another surprise: the next morning, a third body is found—in the very same grave...",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Cherishable: love and marriage",
        "Authors": "By Augsburger, David W",
        "Description": "",
        "Category": "",
        "Publisher": "Herald Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Chinchillas (Complete Pet Owner's Manuals)",
        "Authors": "By Roder-Thiede, Maike, Steimer, Christine (PHT), and Brandstetter, Johann (ILT)",
        "Description": "Unveils the myths and mysteries about chinchillas by explaining many intriguing facets of these extraordinary pets. Readers will learn the best ways to purchase, house, feed, breed and groom these fascinating creatures. Valuable insights into the behavior of chinchillas!",
        "Category": " Pets , Reference",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Someone Is Hiding on Alcatraz Island",
        "Authors": "By Bunting, Eve",
        "Description": "The Outlaws, the toughest gang in school, follow Danny Sullivan to Alcatraz Island after he unintentionally thwarts one member's attempt to mug an old woman. There he is trapped as they plot their revenge. PW praised Bunting's storytelling skill, saying, \"Her new novel moves swiftly, creating white-knuckle suspense and an unfudged denouement.\" (12-up)",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "Brangelina: The Untold Story of Brad Pitt and Angelina Jolie",
        "Authors": "By Halperin, Ian",
        "Description": "Ian Halperin, New York Times bestselling author of Unmasked: The Final Years of Michael Jackson, explores the relationship of the world's most famous celebrity couple with exclusive revelations and personal anecdotes. This Supercouple, unlike any other, consistently turns heads, rolls cameras, and delivers action. The rugged, yet debonair, actor Brad Pitt (Fight Club, The Curious Case of Benjamin Button, Inglorious Basterds) and the always sexy and illustrious actress Angelina Jolie (Girl Interrupted, Lara Croft: Tomb Raider, Changeling) have made a lasting impression through their movies and their magic . . .. Find out the truth behind Angelina's notorious French kiss with her brother James at the 2000 Oscars. Learn about her childhood and estrangement from her father Jon Voight. Discover the truth of Brad's marriage to everybody's friend, Jennifer Aniston, and of her readiness to have children. Read about the true circumstances of the affair between Brad and Angelina along with their stormy & unstable relationship",
        "Category": " Biography & Autobiography , Rich & Famous",
        "Publisher": "Transit Publishing, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Voltaire Candide or Optimism",
        "Authors": "By Arouet De Voltaire, Francois-Marie",
        "Description": "",
        "Category": "",
        "Publisher": "New York: Appleton-Century-Crofts, Inc. 1946",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1946"
        }
    },
    {
        "Title": "Both Sides of Time",
        "Authors": "By Caroline B. Cooney",
        "Description": "",
        "Category": "",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Adventuress",
        "Authors": "By Rama Rau, Santha",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "16.17",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Legacy (The Sharing Knife, Book 2)",
        "Authors": "By Bujold, Lois McMaster",
        "Description": "“A saga of daring deeds and unlikely romance.”—Library JournalOne of the most respected writers in the field of speculative fiction, Lois McMaster Bujold has won numerous accolades and awards, including the Nebula and Locus Awards as well as the fantasy and science fiction genre’s most prestigious honor, the Hugo Award for Best Novel, four times (most recently for Paladin of Souls). With The Sharing Knife series, Bujold creates a brand new world fraught with peril, and spins an extraordinary romance between a young farm girl and the brave sorcerer-soldier entrusted with the defense of the land against a plague of vicious malevolent beings. Legacy continues the tale of Fawn Bluefield and Dag Redwing Hickory—the dangerous repercussions of their rebellious marriage and the strengthening of their love in the face of dark magic—as duty and disaster call the Lakewalker patroller away from his new bride and toward a peril that could forever alter the lovers and their world.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Harper Voyager",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2011"
        }
    },
    {
        "Title": "Invasive Procedures",
        "Authors": "By Card, Orson Scott and Johnston, Aaron",
        "Description": "George Galen is a brilliant scientist, a pioneer in gene therapy. But Galen is dangerously insane – he has created a method to alter human DNA, not just to heal diseases, but to “improve” people – make them stronger, make them able to heal more quickly, and make them compliant to his will.Frank Hartman is also a brilliant virologist, working for the government’s ultra-secret bio-hazard agency. He has discovered how to neutralize Galen’s DNA-changing virus, making him the one man who stands in the way of Galen’s plan to \"improve\" the entire human race.This taut thriller takes the reader a few years into the future, and shows the promise and danger of new genetic medicine techniques.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "12.5",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Hannah Rose (Ahab's Legacy)",
        "Authors": "By Gouge, Louise M.",
        "Description": "Captain Ahab has become the victim of his own mad pursuit of the great white whale. Hannah, his widow and her son, Timothy, seek to distance themselves from the Ahab name by planning a trip to Europe. But during a visit to friends in Boston, Hannah encounters some prospective love interests and finds she must first search her heart regarding some important life issues, not the least of which is slavery. As she watches dedicated friends share their faith with sailors in the port city, she is challenged by how she will share her faith with others. Hannah's journey reveals the unexpected ways that God fulfills His plans for us beyond our own plans and desires.  Click Here to Meet the Author   Download the Readers' Guide.",
        "Category": " Religion , Christianity , General",
        "Publisher": "David C Cook",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Flies on the Butter",
        "Authors": "By Hildreth, Denise",
        "Description": "Can you ever really go home again?Rose Fletcher's come a long way from her South Carolina up-bringing of Sunday church and Mamaw's fried chicken. As a high-powered lobbyist in Washington, D.C., Rose has put the South behind her. But the peace and happiness she has sought eludes her. With her marriage on the brink of disaster, her mind races with the chaos her life has become.Now Rose must head south for home. She'll face her demons, relive her coming-of-age, and confront the issues that have kept her away all these years. It'll take the intervention of strangers and a painful miracle of grace to help her find that place called \"home\" once again.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Daily Light on the Daily Path",
        "Authors": "By Zondervan",
        "Description": "This is probably the most widely read collection of daily readings from the Bible ever published, and it is presented in this edition in the words of The New International Version (North American Edition). For three generations, Daily Light on the Daily Path has been a classic religious work, and it has gone through a countless number of printings. It was compiled by the descendants of the London bookseller, Samuel Bagster. Bagster's grandson, Robert, who died in 1924, wrote of the origins of this book, 'Daily Light on the Daily Path was prepared entirely within the family. Few are able to appreciate the heart-searching care with which every text was selected, the days, nay the weeks of changes, alterations and improvements, until at last each page was passed to the printer.' Here are two selections of Bible readings for every day in the year -- for Morning and Evening.",
        "Category": " Religion , Christian Life , Devotional",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1981"
        }
    },
    {
        "Title": "Letter to Philip (On How to Treat a Woman)",
        "Authors": "By Charles W. Shedd",
        "Description": "",
        "Category": "",
        "Publisher": "Spire Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "The Present Future: Six Tough Questions for the Church",
        "Authors": "By McNeal, Reggie",
        "Description": "In this provocative book, author, consultant, and church leadership developer Reggie McNeal debunks these and other old assumptions and provides an overall strategy to help church leaders move forward in an entirely different and much more effective way. In The Present Future, McNeal identifies the six most important realities that church leaders must address including: recapturing the spirit of Christianity and replacing \"church growth\" with a wider vision of kingdom growth; developing disciples instead of church members; fostering the rise of a new apostolic leadership; focusing on spiritual formation rather than church programs; and shifting from prediction and planning to preparation for the challenges of an uncertain world. McNeal contends that by changing the questions church leaders ask themselves about their congregations and their plans, they can frame the core issues and approach the future with new eyes, new purpose, and new ideas.Also available: The Present Future DVD Collection (978-0-7879-8673-5), Reggie McNeal's DVD presentation of the ideas and insights featured in his best-selling book.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "A Fine Romance: Hollywood/Broadway (The Magic. The Mahem. The Musicals.)",
        "Authors": "By Denkert, Darcie",
        "Description": "For general readers and movie lovers, this volume describes the history of movie adaptations of musicals, specifically the stories behind the making of films such as Sunset Boulevard, My Fair Lady, West Side Story, Gypsy, The Sound of Music, Cabaret, Chicago, Hello Dolly!, The Producers, and Hairspray. Incorporated are b&w and color photos of stage and movie versions (often in large two-page spreads), and quotes from stars, directors, and producers. Denkert is an entertainment attorney who has lived in New York and Los Angeles. Measurements for the book are 10.5x13\". Annotation ©2007 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Music , Genres & Styles , Musicals",
        "Publisher": "Billboard Books",
        "Price Starting With ($)": "8.65",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "New Zealand (Eyewitness Travel Guides)",
        "Authors": "By Hemphill, Kate",
        "Description": "Packed with photographs, illustrations and detailed maps, Eyewitness Travel Guide: New Zealand will lead you straight to the best attractions this exciting country has to offer. Discover New Zealand region by region; from the glistening glaciers on the West Coast to the surfers' paradise Central North Island. The guide provides insider tips every visitor needs from the country's best deep-sea fishing spots to the best bridges for bungee jumping, with comprehensive listings of the best hotels, resorts, restaurants and nightlife in each region for all budgets. There are 3D cutaways and floor-plans of all the must-see sites plus street-by-street maps of all the fascinating cities and towns of New Zealand. DKEyewitness Travel Guide: New Zealand explores the country's Maori heritage, flora and fauna, beaches and national parks, focusing on the best scenic routes from which to explore the diverse New Zealand landscape.",
        "Category": " Travel , Australia & Oceania",
        "Publisher": "DK Eyewitness Travel",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "House of Spies: Danger in the Civil War Washington",
        "Authors": "By Blair, Margaret Whitman",
        "Description": "Swept back to 1861 through the medium of Civil War photographs, Rob and Sarah find themselves in Washington, D.C., just after the Battle of Manassas and are arrested as enemy spies",
        "Category": " Juvenile Fiction , Historical , United States , 19th Century",
        "Publisher": "White Mane Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "A Time of Omens (The Westlands)",
        "Authors": "By Kerr, Kathatine",
        "Description": "While a dashing young king journeys to his throne in disguise, fulfilling an ancient prophecy, the exiled lord Rhodry travels anonymously as a mercenary. Reprint.",
        "Category": "",
        "Publisher": "Spectra",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Search Engine Optimization For Dummies, Second Edition",
        "Authors": "By Kent, Peter",
        "Description": "You have a cool Web site, and a really great product, service, or cause you want people to know about. But visitors aren’t beating down your cyber-door. What happened? The answer, most likely, is that you haven’t made your site irresistible to search engines.Search engines have a great deal of control over the volume of traffic a Web site gets, because they put your site in front of people searching for your product or service. If you know the secrets of wooing the search engines, you canGain greater visibility for your siteAdvance your position in the rankingsAvoid techniques that cause search engines to bump your site to the end of the listMake pay-per-click advertising pay offIn addition to the familiar ones like Google and Yahoo!, there are dozens of other search engines out there. Search Engine Optimization For Dummies, 2nd Edition shows you how to create a site that will pop to the top like a cork whenever people search for related products or services. It will help youBecome familiar with search engines and search directories and find out which keywords workBuild your site with techniques that search engines like and avoid the ones they don’tRegister your site with the top search systems and get it listed in directoriesFind out why links are important and see how to get other sites to link to yoursWork with Google AdWords and Yahoo! Search, and explore the best and most economical ways to use pay-per-click advertisingDiscover the common mistakes that make Web sites invisible to search enginesThere’s even a companion Web site with all the links in the book neatly (and conveniently) arranged so you don’t have to type them, plus a bonus chapter to help you power up your skills. Search Engine Optimization For Dummies, 2nd Edition has been updated with the latest information on search engines plus plenty of tips and tricks to help your site get the attention it deserves!",
        "Category": " Computers , Information Technology",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Truth About Lord Stoneville (1) (The Hellions of Halstead Hall)",
        "Authors": "By Jeffries, Sabrina",
        "Description": "Discover the roguishly handsome Sharpe siblings in the sparkling Hellions of Hallstead Hall series from New York Times bestselling author Sabrina Jeffries.Oliver Sharpe, the Marquess of Stoneville, has been London’s most notorious rake for years. Fed up with his behavior, his grandmother threatens to disinherit him if he doesn’t tame his wild ways and wed within the year. Outraged, Oliver decides to hire a woman from a brothel to pose as his fiancée to prove that he can’t be forced into marriage. When he meets Maria Butterfield, a beautiful American woman who is searching for her fiancé in the most unlikely of places, he knows she’s perfect for his ruse. But before long, Oliver finds himself willing to risk anything to make Maria his—even his heart, and the dark secret he hides inside it. With “delectably witty dialogue, subtly named characters, and scorching sexual chemistry between two perfectly matched protagonists” (Booklist), this is an unputdownable and charming romance.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "See and Explore Library: Dinosaurs and How They Lived",
        "Authors": "By Parker, Steve, Fornari, Giuliano (ILT), Lindsay, William, Ruzzier, Sergio (ILT), and Sergio, Guiliano Fornari (ILT)",
        "Description": "Describes, in text and illustrations, the physical characteristics and habits of various kinds of dinosaurs, their natural environment, and how recent discoveries have enhanced our knowledge about these prehistoric creatures.",
        "Category": " Juvenile Nonfiction , Animals , Mammals",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "History of the Pennsylvania Railroad",
        "Authors": "By Jacobs, Timothy",
        "Description": "Chronicles the famous railroad that reached record-breaking highs in gross revenues and freight tonnage and established many significant firsts in the history of the rails",
        "Category": " Transportation , Railroads , General",
        "Publisher": "Crescent",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Pictorial History Of North American Railroads",
        "Authors": "By Walter P. Gray, John P. Hankey",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "13.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "An Unfinished Woman",
        "Authors": "By Lillian Hellman",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Gulliver's Travels (Signet Classics)",
        "Authors": "By Swift, Jonathan and Damrosch, Leopold",
        "Description": "The unusual voyages and travels of Englishman Lemuel Gulliver carry him to such strange locales as Lilliput, where the inhabitants are six inches tall; Brobdingnag, a land of giants; an island of sorcerers; and a nation ruled by horses. Reissue.",
        "Category": " Fiction , Classics",
        "Publisher": "Signet Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Good to Great and the Social Sectors: Why Business Thinking is Not the Answer",
        "Authors": "By Collins, James C.",
        "Description": "Building upon the concepts introduced in Good to Great, Jim Collins answers the most commonly asked questions raised by his readers in the social sectors. Using information gathered from interviews with over 100 social sector leaders, Jim Collins shows that his \"Level 5 Leader\" and other good-to-great principles can help social sector organizations make the leap to greatness.",
        "Category": " Business & Economics , Management",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Reptiles & Amphibians (National Geographic Nature Library)",
        "Authors": "By Howell, Catherine Herbert",
        "Description": "Eye-popping, full-color close-ups of reptiles and amphibians--from leaping frogs to staring iguanas--and a variety of factual data make this a fun and informative reference book.",
        "Category": "",
        "Publisher": "Natl Geographic Soc Childrens books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "My Lady Notorious (A Mallorean Novel)",
        "Authors": "By Beverley, Jo",
        "Description": "Hailed as \"captivating\" (Booklist) and \"exquisitely sensual\" (Library Journal), Jo Beverley's Malloren novels capture the unforgettable world of Georgian England. Now her fans can discover why the book that started it all, My Lady Notorious, has been called \"storytelling at its best\" (Rendezvous).",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Vein Of Iron",
        "Authors": "By Ellen Glasgow",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt, Brace",
        "Price Starting With ($)": "25.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1935"
        }
    },
    {
        "Title": "Princess in Training: Princess Diaries, Volume VI",
        "Authors": "By Cabot, Meg",
        "Description": "Princess for president Student body president, that is. It's all the fault of Princess Mia's power-mad best friend and campaign manager, Lilly, who nominates her in the first place. This is not how Mia imagined kicking off her sophomore year, even if Grandmère thinks ruling her high school makes good practice for ruling Genovia someday. As usual, though, Mia has bigger problems to worry about. Sophomore Geometry appears to be just as hard as freshman Algebra, and a shocking B on her first English assignment has Mia reeling. And with Michael, her one true love, uptown at college, what is the point of even getting up for school in the morning? The last straw is what Lana whispers to her on the lunch line about what college boys expect of their girlfriends ... Really, it's almost more than a princess in training can bear.",
        "Category": " Young Adult Fiction , Royalty",
        "Publisher": "HARPER COLLINS PUBLISHERS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Animals as Teachers and Healers",
        "Authors": "By McElroy, Susan Chernak",
        "Description": "The author recounts her recovery from cancer, aided by her love for her dog, Keesha, and offers the stories of others whose lives have been changed by the affection, protection, and companionship provided by animals. Tour.",
        "Category": " Nature , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Center",
        "Authors": "By Shobin, David",
        "Description": "In the most advanced hospital in the world, medical computers ensure perfect care. But machines have no scruples. No compassion. No mercy. And now they have a mind of their own.Surgeon Chad Dunston helped create The Center, a revolutionary medical facility where computers, not humans, treat patients. Its cure rate is unequaled, its medical successes unrivaled...until a child named Christine Lassiter mysteriously dies. The girl's older sister Maxine can't get Christine's records, her body, or even her death certificate.Maxine wants Chad Dunston to find out what happened. But the more questions Chad asks, the more dead-end answers he receives. He has only one option left: check into The Center as a patient...and enter a machine-made nightmare, where the only way out may be death.Author of the best-selling medical thriller The Unborn, Dr. David Shobin has returned with a chilling cautionary tale about the direction of today's high-tech medicine...medical care without the caring, greed raging out of control, and deadly terror as the new specialty.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Stage Costume Techniques",
        "Authors": "By Emery, Joy Spanabel",
        "Description": "Explains how to research historical costumes, select and modify fabrics, take measurements, and create special clothing, accessories, and wigs",
        "Category": " Performing Arts , General",
        "Publisher": "Prentice Hall College Div",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1981"
        }
    },
    {
        "Title": "Working with Religious Issues in Therapy",
        "Authors": "By Robert J. and Lovinger, Sophie L.",
        "Description": "",
        "Category": " Psychology , Psychotherapy , General",
        "Publisher": "Jason Aronson, Inc.",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "Green Living: The E Magazine Handbook for Living Lightly on the Earth",
        "Authors": "By E Magazine",
        "Description": "Knowledge of environmental issues and sustainability is increasingly important as industrialization and climate change continue to wreak havoc on our ecosystems and our psyche. As temperatures rise—and icecaps shrink and storms lash our coastal areas into oblivion—being smart about carbon footprints, waste streams and consumer choices becomes increasingly important for all of us.Green Living, from the award-winning editors of E: The Environmental Magazine, offers a thorough, step-by-step plan for every making aspect of your life earth-friendly, from the laundry room to the kitchen:-Maintaining a healthy home-Going organic and avoiding genetically modified food-Finding a planet-friendly car-Making socially responsible investments-Using personal-care products free of damaging chemicalsWith advice on everything from planet-friendly cosmetics to home-based renewable energy, and straight talk on hemp, hybrids and hair dye, Green Living is the ideal reference for both the neophyte and the experienced environmentalist.",
        "Category": " Science , Life Sciences , Ecology",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Compassionate Cook: Or, Please Don't Eat the Animals!",
        "Authors": "By Newkirk, Ingrid and Peta",
        "Description": "From PETA, the largest animal rights organization in the world, comes a repackaged collection of over 200 healthy and humane vegan recipes that cover everything from breakfast to dinner and beyond.The Compassionate Cook offers easy-to-make recipes that are tasty, healthy, and most importantly, humane. This collection covers breakfast, lunch and dinner, as well as snacks, appetizers and side dishes. These inventive and fun recipes will inspire readers to experiment with new dishes, cooking methods, and ingredients. With this special selection of recipes, mindful eaters can enjoy delicious food, satisfied with the knowledge that they are helping to protect animals.",
        "Category": " Cooking , Specific Ingredients , Natural Foods",
        "Publisher": "Grand Central Life & Style",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Fifty Best American Short Stories: Classic Works by the Masters",
        "Authors": "By Foley, Martha (EDT)",
        "Description": "Presents 50 short stories, chronologically arranged, by the most distinguished American authors of the twentieth century including Ernest Hemingway, John Steinbeck, and William Faulkner",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Eat My Dust! Henry Ford's First Race (Step into Reading)",
        "Authors": "By Kulling, Monica and Walz, Richard (ILT)",
        "Description": "It’s 1901 and Henry Ford wants to build a car that everyone can own. But first he needs the money to produce it. How will he get it? He enters a car race, of course! Readers will love this fast-paced, fact-based story!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "I Want to Be A Fire Fighter (Sesame Street What Do You Want To Be When You Grow Up?, Volume 13135)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Western Publishing Company, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Oh, Brother! (Pictureback) (Ratatouille movie tie in)",
        "Authors": "By Emmons, Katherine (ADP), Roman, Claire (ADP), and Bright, Todd (ILT)",
        "Description": "Remy dreams of becoming a gourmet chef in a fancy French restaurant. Emile is happy living in the sewer and eating garbage. These two rats are as different as night and day, but they agree on one thing—they're brothers and they'll stick together through thick and thin. This full-color storybook is based on Disney ¥ Pixar's exciting and hysterical feature film Ratatouille.",
        "Category": " Juvenile Fiction , Bedtime & Dreams",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Cats: How to Take Care of Them and Understand Them",
        "Authors": "By Vriends, Matthew M., Behrend, Katrin, Wegler, Monika, and Jankovics, Gyorgy",
        "Description": "Offers advice on how to care for cats, including feeding, grooming, health care, and behavior",
        "Category": " Pets , Cats , General",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Another Language: Poetry",
        "Authors": "By Elkind, Sue Saniel and Burkhalter-Lackey, Lori (PHT)",
        "Description": "",
        "Category": " Poetry , American , General",
        "Publisher": "Papier Mache Pr",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Lifechanges: How Women Can Make Couraguous choices",
        "Authors": "By Lennox, Joan Hatch and Shapiro, Judith Hatch",
        "Description": "Offers a three-pronged approach to changing ten areas in women's lives--such as finances, relationships, and the home",
        "Category": " Psychology , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Webster's New World Pocket Dictionary",
        "Authors": "By Goldman, Jonathan L. (EDT)",
        "Description": "More than thirty thousand entries make up the bulk of this dictionary, which includes alternate spellings, cross-references, an appendix of common abbreviations, and more. Original.",
        "Category": "",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "American Heart Association's Your Heart: An Owner's Manual",
        "Authors": "By American Heart Association",
        "Description": "The American Heart Association, the country's preeminent institution for information about cardiovascular health, has produced the definitive book on caring for the heart. This interactive, prevention-oriented \"owner's manual\" for the heart provides personalized care and maintenance programs, all backed by the expertise of the AHA, that reflect the way people really live today.The American Heart Association's Your Heart An Owner's Manual will help you develop a personalized life plan that integrates nutrition, exercise, and lifestyle factors into one comprehensive program for enhanced heart health. It will help you set realistic goals, make informed eating choices, and determine what risk factors are endangering your life and what you can do to reduce them.",
        "Category": " Medical , General",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "The Merchant of Venice (The Pelican Shakespeare)",
        "Authors": "By Shakespeare, William and Braunmuller, A. R. (EDT)",
        "Description": "The acclaimed Pelican Shakespeare series edited by A. R. Braunmuller and Stephen Orgel   The legendary Pelican Shakespeare series features authoritative and meticulously researched texts paired with scholarship by renowned Shakespeareans. Each book includes an essay on the theatrical world of Shakespeare’s time, an introduction to the individual play, and a detailed note on the text used. Updated by general editors Stephen Orgel and A. R. Braunmuller, these easy-to-read editions incorporate over thirty years of Shakespeare scholarship undertaken since the original series, edited by Alfred Harbage, appeared between 1956 and 1967. With definitive texts and illuminating essays, the Pelican Shakespeare will remain a valued resource for students, teachers, and theater professionals for many years to come.   For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "Category": " Drama , Shakespeare",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Do Teddy Bears Ski?",
        "Authors": "By Sanger, Rick and Russell, Carol (ILT)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Sports & Recreation , Winter Sports",
        "Publisher": "Mountain Path Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "The train-watcher's guide to North American railroads",
        "Authors": "By Drury, George H.",
        "Description": "",
        "Category": "",
        "Publisher": "Kalmbach Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Men in Kilts",
        "Authors": "By MacAlister, Katie",
        "Description": "While attending a mystery writers' conference in Manchester, England, American Kathie Williams finds her one night of passion with Iain MacLaren, a ruggedly handsome Scotsman, turning into something more when he takes her to the Scottish Highlands to meet his family. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "My Christmas stocking (Christmas cheer books)",
        "Authors": "By Parent, Nancy",
        "Description": "",
        "Category": "",
        "Publisher": "Paradise Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "This Mighty Scourge: Perspectives on the Civil War",
        "Authors": "By McPherson, James M.",
        "Description": "The author of the Pulitzer Prize-winning Battle Cry of Freedom and theNew York Times bestsellers Crossroads of Freedom and Tried by War, among many other award-winning books, James M. McPherson is America's preeminent Civil War historian. In this collection of provocative and illuminating essays, McPherson offers fresh insight into many of the enduring questions about one of the defining moments in our nation's history.McPherson sheds light on topics large and small, from the average soldier's avid love of newspapers to the postwar creation of the mystique of a Lost Cause in the South. Readers will find insightful pieces on such intriguing figures as Harriet Tubman, John Brown, Jesse James, and William Tecumseh Sherman, and on such vital issues as Confederate military strategy, the failure of peace negotiations to end the war, and the realities and myths of the Confederacy.This Mighty Scourge includes several never-before-published essays--pieces on General Robert E. Lee's goals in the Gettysburg campaign, on Lincoln and Grant in the Vicksburg campaign, and on Lincoln as Commander-in-Chief. All of the essays have been updated and revised to give the volume greater thematic coherence and continuity, so that it can be read in sequence as an interpretive history of the war and its meaning for America and the world.Combining the finest scholarship with luminous prose, and packed with new information and fresh ideas, this book brings together the most recent thinking by the nation's leading authority on the Civil War.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Tempting Fortune",
        "Authors": "By Beverley, Jo",
        "Description": "In Georgian England, Portia St. Claire, a poverty-stricken lady, sells her virtue on the auction block to save her brother, but Bryght Malloren, a mysterious gambler, tries to save her from harm and draws her into a sensuality that could lead to madness. Reprint.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Saggy Baggy Elephant:  No Place for Me",
        "Authors": "By Ingolglia, Gina",
        "Description": "",
        "Category": "",
        "Publisher": "Merrigold Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Book of Planets",
        "Authors": "By Clint Twist",
        "Description": "",
        "Category": "",
        "Publisher": "Andromeda Children's Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Cry Havoc!: The Crooked Road to Civil War, 1861",
        "Authors": "By Lankford, Nelson D.",
        "Description": "A re-creation of the eight weeks preceding the American Civil War vividly describes such events as Lincoln's inauguration, the attack at Fort Sumter, and Lincoln's call-to-arms proclamation, in an account that also considers if the conflict could have been peaceably avoided. By the author of Richmond Burning.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Last Bachelor",
        "Authors": "By Krahn, Betina M.",
        "Description": "Remington Carr, a rakish earl and London's most infamous bachelor, matches wits with Lady Antonia Paxton, a lovely young widow who has made a career out of assisting destitute women marry well by trapping eligible bachelors in compromising positions. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "The Awakened Heart: Meditations on Finding Harmony in a Changing World (Inner Light Series)",
        "Authors": "By Robbins, John and Mortifee, Ann",
        "Description": "The author of the best-sellers, Diet for a New America and Reclaiming Our Health shows readers how to instill harmony in their lives and achieve inner peace through sixty meditations. 20,000 first printing. $25,000 ad/promo. IP.",
        "Category": " Religion , Meditations",
        "Publisher": "H. J. Kramer",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "End of the Earth: Voyages To Antarctica",
        "Authors": "By Matthiessen, Peter and Byers, Stephen",
        "Description": "End of the Earth brings to life the waters of the richest whale feeding grounds in the world, the wandering albatross with its 11-foot wingspan arching through the sky, and the habits of every variety of seal, walrus, petrel, and penguin in the area, all with boundless and contagious inquisitiveness. Magnificently written, the book evokes an appreciation and sympathy for a region as harsh as it is beautiful.“Luminous and haunting . . . the contemporary Thoreau.”—The Wall Street Journal   “[Matthiessen] doesn’t waste words, and in End of the Earth: Voyages to Antarctica, his homage to the austere splendor of that frozen continent, he hasn’t deployed a single one whose choice I would care to take issue with. . . . Matthiessen writes crusty, chiseled sentences that demand to be read slowly—the perfect prose equivalent of the landscapes he’s describing.”—The New York Times Book Review   “Matthiessen and polar landscapes seem perfectly suited. . . . I found myself constantly re-reading sentences or paragraphs to savour all of their rich resonances. . . . Few if any authors on the region have so successfully compressed . . . Antarctic life . . . and I suspect it will become standard reading.”—The Guardian",
        "Category": " Nature , Animals , Wildlife",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "A Garden of Whales",
        "Authors": "By Davis, Maggie Steincrohn and O'Connell, Jennifer Barrett (ILT)",
        "Description": "\"A rhythmic text and lush illustrations that feature cavorting, majestically powerful whales. The poetic, somewhat surreal quality of the story is appealing.\"  -- Horn Book Guide     \"This tale of deliverance unfurls in luscious prose that rolls trippingly off the tongue... With her effulgent oil pastel illustrations O'Connell fully enters Davis's dream and strikingly echoes the fluent reverie. This is a bedtime read-aloud that will set heads nodding.\"  -- Publishers Weekly     First published in 1993, A Garden of Whales is one of our most popular children's books. It is the story of a boy's fantasy of saving the whales -- a strong conservation theme carried with the empowering message that children's dreams are the roots of action.     Last night in my tub,   in my tub while I scrubbed,   I            dreamed that I lived   in the sea with the Whales.   Magnificent Whales. Mysterious Whales.   Mystical, Musical, Mountainous Whales.     The narrator of this tale is a boy who knows that whales are magnificent but endangered creatures. He wants to do anything he can to save them, and as he scrubs in his bathtub, he dreams up a plan to save the whales.     Children from all over the world also get in their bathtubs to save the whales, planting a garden of whales. He knows this is a fantasy, but the dreams of children are the roots of action, and action changes the world.",
        "Category": " Juvenile Fiction , Animals , Marine Life",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "The Not So Little Book of Dung",
        "Authors": "By Holmes, Caroline",
        "Description": "What goes in, must come out, and as soon as humans ceased to be hunter-gatherers and settled with their families and livestock into static communities, both ends needed sustainable attention. Dung from an array of sources - man, horse, blackbird, pigeon and the Beast of Paeonia - has fuelled economies, superstitions and rich rewards. In this engaging, entertaining and attractively illustrated book, Caroline Holmes explores the timeless history and architecture of dung, the product from its human, animal, bird, fish and fowl sources, the cunning devices invented for dung's effective harvest and, finally, the old adage 'where there's muck there's brass'. From successful gardeners reaping the rewards of hot beds, to farmers folding, penning and spreading for bumper harvests, Victorian millionaire guano dealers, and modern entrepreneurs producing dung-powered electricity and elephant dung paper, dung has been an extremely lucrative business. This book celebrates the worldwide testimonies to the power of dung from the humble paddy field, the cucumber frame and the moated manor to elegant pigeon towers and four-seater Georgian privies.",
        "Category": " History , Social History",
        "Publisher": "The History Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Death of a Writer: A Novel",
        "Authors": "By Collins, Michael",
        "Description": "A darkly funny novel anchored by a murder mystery, Death of a Writer explores the price of fame, the turmoil of academic life, and the precarious position of literature in American society.Once literary prodigy and now a virtual unknown, Professor E. Robert Pendleton clings hopelessly to his tenured position at a midwestern college. When a campus visit from a rival author, now superstar, tips his malaise into desperation, death seems the only remaining option. But Pendleton's suicide attempt is thwarted by a young graduate student, leaving Pendleton relegated to a wheelchair, surviving in a barely conscious state. It is then that an unpublished novel is discovered in his basement: a brilliant, semi-autobiographical story with a gruesome child murder at its core.The publication of Scream causes a storm of publicity, conferring on Pendleton the success he has always sought, when, ironically, he is no longer in a condition to appreciate it. Soon questions begin to be asked about the novel's content - in particular about the uncanny resemblance between Pendleton's fictional crime and a real-life, unresolved local murder. How did Pendleton know the case so well? And why did he bury Scream in his basement? Enter Jon Ryder, a world-weary detective, and the hunt for the murderer is on.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Come Up And See Me Sometime",
        "Authors": "By Monroe, Lucy",
        "Description": "Determined to destroy his father's business rival by using his daughter, Isabel Harrison, Alex Trahern finds his plans of revenge threatened by his growing attraction to Isabel, who is not what he had expected. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Zebra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "In The Dark",
        "Authors": "By McKinney, Meagan",
        "Description": "Just days before she is supposed to meet her estranged aunt, Alyn Blum-Jones finds out that her aunt has vanished under mysterious circumstances, and at the estate, she encounters an unfriendly household and enigmatic investigator Peter Youngblood, and is plunged into a world of unthinkable evil. Reprint.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "God's Gold: A Quest for the Lost Temple Treasures of Jerusalem",
        "Authors": "By Kingsley, Sean A.",
        "Description": "God's Gold explores the fate of the greatest biblical treasure in history, the central icons of the Jewish faith looted from the Temple of Jerusalem. The golden candelabrum, silver trumpets, and the bejeweled Table of the Divine Presence were plundered by the Roman emperor Vespasian and his son Titus in AD 70. These biblical treasures are cast adrift in Mediterranean lands and exposed to 550 years of turbulent history and the rule of four different civilizations; only an intriguing trail of clues betrays their ever-changing destiny.The Temple treasure is a priceless hoard, but it has yet greater significance as the ultimate symbol of man's communication with God. The gold's recovery is central to Israel's broken dreams of messianic redemption by building a new House of God on the Temple Mount and its hopes for a return to an age of biblical sacrifice.Using untapped historical texts and new archaeological sources, Sean Kingsley unravels the incredible history of this treasure; its character; and religious, political, and financial meaning across the ages. Unexpected discoveries send him on a physical journey to expose the treasure's destiny. From the Vatican to the Vandal palace of Carthage, Constantinople's hippodrome, and the wilderness of Judea, his remarkable quest reveals facts more astonishing than fiction.",
        "Category": " History , Ancient , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Head and Heart: American Christianities",
        "Authors": "By Wills, Garry",
        "Description": "A landmark examination of Christianity's place in American life across the broad sweep of this country's history, from the Puritans to the presidential administration of George W. Bush.  The struggle within American Christianity, Garry Wills argues, now and throughout our country's history, is between the head and the heart: between reason and emotion, Enlightenment and Evangelism. Why has this been so? How has the tension between the two poles played out, and with what consequences, over the past 400 years? How \"Christian\" is America, after all? Garry Wills brings a lifetime's worth of thought about these questions to bear on a magnificent historical reckoning that offers much needed perspective on some of the most contentious issues of our time.  A religious revolution occurred in America in the 18th century, one that saw the emergence of an Enlightenment religious culture whose hallmarks were tolerance for other faiths and a belief that religion was a matter best divorced from political institutions-the proverbial \"separation of church and state.\" Wills shows us just how incredibly radical a departure this separation was: there was simply no precedent for it. To put this leap in perspective, Wills provides a grounding in the pre-Enlightenment religion that preceded it, beginning with the early Puritans. He then provides a thrillingly clear unpacking of the steps, particularly Madison's and Jefferson's, by which church-state separation was enshrined in the Constitution, and reveals the great irony of the efforts of today's Religious Right to blur the lines between the two. In fact, it is precisely that separation that has allowed religion in America to flourish since the disestablishment of religion created a free market, as it were, and competition for souls led to the profusion of denominations across the length and breadth of the land.  As Wills examines the key movements and personalities that have transformed America's religious landscape, we see again and again the same pattern emerge: a cooling of popular religious fervor followed by a grassroots explosion in evangelical activity, generally at a time of great social transformation and anxiety. But such forces inevitably go too far, provoking a backlash as is happening right now with the forces of Creationism and the anti-abortion fundamentalists.  Garry Wills closes with a penetrating dissection of the Religious Right's current machinations and the threat they pose to the enlightened religion that has proved to be such a fertile and enduring force throughout American history. But in the end, Wills's abiding message is to be vigilant against the triumph of emotions over reason, but to know that the tension between the two is in fact necessary, inevitable, and unending.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Penguin Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "After Darke (Cooper's Corner, Book 4)",
        "Authors": "By MacAllister, Heather",
        "Description": "When they witness a mob hit while on an awkward blind date, plumber Bonnie Cooper and columnist Jaron Darke are forced to go undercover at the Twin Oaks B and B, where they must pretend to be engaged, and soon, despite their differences, the unlikely couple find love and passion. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "New Stories from the South: The Year's Best, 2007",
        "Authors": "By Jones, Edward P. (EDT) and Pories, Kathy (EDT)",
        "Description": "This year, acclaimed short-story writer ZZ Packer chooses twenty distinctive stories representing the great number of voices and narratives coming out of the South. Some of the youngest and freshest talents on the literary horizon—Bret Anthony Johnston, Kevin Brockmeier, Holly Goddard Jones—accompany well-known Southern stalwarts, including Pinckney Benedict, Clyde Edgerton, and Ron Rash. Their stories tell of life as it is now, a life not seen in romanticized Southern fiction, one where existence—both urban and rural—is as raw and risky as it is alluring. The energy of this collection courses through every one of Packer's edgy, funny, and gritty selections.",
        "Category": " Fiction , Southern",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "The Coming Storm, Large Print (Heirs of Montana 2)",
        "Authors": "By Tracie Peterson",
        "Description": "",
        "Category": "",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Tenth Muse: My Life in Food",
        "Authors": "By Jones, Judith",
        "Description": "From the legendary editor who helped shape modern cookbook publishing—one of the food world’s most admired figures—an evocative and inspiring memoir. Living in Paris after World War II, Judith Jones broke free of the bland American food she had been raised on and reveled in everyday French culinary delights. On returning to the States—hoping to bring some joie de cuisine to America—she published Julia Child’s Mastering the Art of French Cooking. The rest is publishing and gastronomic history.A new world now opened up to Jones: discovering, with her husband, Evan, the delights of American food; working with the tireless Julia; absorbing the wisdom of James Beard; understanding food as memory through the writings of Claudia Roden and Madhur Jaffrey; demystifying the techniques of Chinese cookery with Irene Kuo; absorbing the Italian way through the warmth of Lidia Bastianich; and working with Edna Lewis, Marion Cunningham, Joan Nathan, and other groundbreaking cooks. Jones considers matters of taste (can it be acquired?). She discusses the vagaries of vegetable gardening in the Northeast Kingdom of Vermont and the joys of foraging in the woods and meadows. And she writes about M.F.K. Fisher: as mentor, friend, and the source of luminous insight into the arts of eating, living, and aging.Embellished with fifty recipes—each with its own story and special tips—this is an absolutely charming memoir by a woman who was present at the creation of the American food revolution and played a seminal role in shaping it.",
        "Category": " Cooking , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Love Me Only",
        "Authors": "By Roman, Hebby",
        "Description": "Shattered by the death of her father, who held the secret formula for mining silver, Diana McFarland engages in a battle of wills with Seguin Torres--a man determined to possess the formula--and as dark secrets are revealed, Diana and Seguin succumb to the undeniable passion that flares between them. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "11.57",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "KEEPSAKE",
        "Authors": "By Rogers, Marylyle",
        "Description": "Tricked into marriage by an arrogant British duke, Lizzy Hughes of Wyoming's Double H Ranch agrees to play house in his ancestral home but refuses to share his bed. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "How to Be a Great Communicator: In Person, on Paper, and on the Podium",
        "Authors": "By Nido Qubein",
        "Description": "",
        "Category": "",
        "Publisher": "High Point University Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Benjamin Franklin: In Search of a Better World",
        "Authors": "By Talbott, Page (EDT), Dunn, Richard S. (EDT), and Van Horne, John C. (EDT)",
        "Description": "The first extensively illustrated book documenting Franklin’s life and work—a must-have for any Franklin enthusiast.Benjamin Franklin: In Search of a Better World examines the many facets of America’s most extraordinary founding father. Politician, diplomat, scientist, printer, and civic improver, Franklin influenced every aspect of American life, from his own time to the present. This book, designed to accompany the traveling Benjamin Franklin Tercentenary exhibition celebrating Franklin’s 300th birthday, includes essays by ten prominent scholars that offer an overview of Franklin’s life and  cover the full range of his interests and achievements, illustrated by more than 265 color images—portraits, manuscripts, drawings, maps, paintings, engravings, and a plethora of Franklin&#39;s possessions, from teacups to printing equipment. This comprehensive guide, combining new scholarship with unique images—many of which have never been exhibited before—will be a must-have for anyone interested in Franklin.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "7.56",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "A Treasure to Hold",
        "Authors": "By McCarthy, Kathleen",
        "Description": "Sebastion Merrick, a notorious rogue, and Isabelle Saint-Simon, the sister of the man he believes is responsible for his cousin's death, form a tentative alliance to find the truth, a search that leads them into a dangerous world of intrigue, passion, and greed, where they are torn between love and family loyalty. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "How to Save Your Own Life",
        "Authors": "By Jong, Erica",
        "Description": "Isadora Wing with two marriages and a best-selling novel behind her, reviews the stages by which her life with Bennett disintegrated and finds genuine love as well as joyous adventure and sex in the never-ever land of southern California",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1978"
        }
    }
]