[
    {
        "Title": "Patchwork for Beginners",
        "Authors": "By Green, Sylvia",
        "Description": "",
        "Category": "",
        "Publisher": "Watson-Guptill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Latin Can Be Fun: a Modern Conversational Guide",
        "Authors": "By Capellanus, Georg (Peter Needham, translator)",
        "Description": "",
        "Category": "",
        "Publisher": "BARNES & NOBLE BOOKS NY",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Pennyroyal",
        "Authors": "By Tuthill, Stacy J.",
        "Description": "",
        "Category": "",
        "Publisher": "Scop Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Oscar's silly ABC's and other stories (CTW Sesame Street book club)",
        "Authors": "By Muntean, Michaela",
        "Description": "",
        "Category": "",
        "Publisher": "Western Pub. Co. Inc., in conjunction with Children's Television Workshop",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Glow-In-The-Dark Book of the Human Skeletons (Glow-Backs)",
        "Authors": "By Novak, Michael and Sweeney, Kate (ILT)",
        "Description": "This introduction to both the solid science and spooky fun of the human skeletal system features a simple, fast-paced text which provides fascinating information about the human \"framework.\" With the lights on readers see beautifully detailed paintings of children skateboarding, playing the piano, kickboxing, and more. When the lights go out, each skeleton glows--just like an x-ray! Full color.",
        "Category": " Juvenile Fiction , Science & Technology",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Joy",
        "Authors": "By Krentz, Jayne Ann",
        "Description": "Unwilling to jump into full-time relationships, Virginia Middlebrook and A. C. Ryerson decide to test things with a getaway Caribbean trip, which is threatened when Virginia wins an emerald bracelet with a mysterious past. Reissue.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Raven's Prey",
        "Authors": "By Krentz, Jayne Ann and James, Stephanie",
        "Description": "Hiding out in Mexico after witnessing a gunrunning operation, Honor Knight is at the mercy of assassin Judd Raven whom, hired by the men she is running from, she must convince to spare her life by any means neccessary. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Where Dreams Begin",
        "Authors": "By Kleypas, Lisa",
        "Description": "New York Times bestselling author Lisa Kleypas delivers the unforgettable, sexy tale of a brash rogue who meets his equal in a woman who knows exactly what she wants . . .Zachary Bronson has built an empire of wealth and power. Now he is seeking a wife to help secure his position in the ton . . . as well as warm his bed in private. But not just any woman will do for one of London's most notorious rakes. When he meets Lady Holly Taylor, he surrenders to the temptation to take her in his arms and kiss her. Yet he's pleasantly surprised to discover her fierce passions match his own.Lady Holly Taylor is destined to spend her life playing by society's rules even when they go against her bolder instincts. But Zachary's kiss arouses her, and though his shocking offer doesn't include marriage, she is compelled to risk everything for the most forbidden passion.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Handcrafted Shelves and Cabinets",
        "Authors": "By Yepsen, Roger B., Hylton, William H., and Hodges, Marilyn",
        "Description": "Experienced cabinetmakers share advice about wood, tools, design, joinery, and finishing, and show examples of their work",
        "Category": " Technology & Engineering , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "Simply Ayurveda",
        "Authors": "By Vyas, Bharti and Warren, Jane",
        "Description": "",
        "Category": " Health & Fitness , General",
        "Publisher": "Thorsons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "God Made You Special",
        "Authors": "By Metaxas, Eric",
        "Description": "Bob’s red and round, and he bounces ‘cause he has no feet. Madame Blueberry lives in a tree. What makes her special? She’s as blue as can be. What about those French Peas? They speak with “zee accent.” Tots will discover that it’s okay to be different, because God made you special and he loves you very much. Through fun rhymes and humor, and some help from those lovable Veggies, little ones will realize that God makes everyone special!\"",
        "Category": " Juvenile Nonfiction , Religion , Christianity",
        "Publisher": "ZonderKidz",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Baseball Fever (We Both Read - Level 1-2 (Quality))",
        "Authors": "By Johnson, Meredith (ILT) and McKay, Sindy",
        "Description": "",
        "Category": " Juvenile Nonfiction , Readers , Beginner",
        "Publisher": "Treasure Bay",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Voyagers II: The Alien Within",
        "Authors": "By Bova, Ben",
        "Description": "",
        "Category": "",
        "Publisher": "Tor",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Dance To The Piper (The O'hurleys)",
        "Authors": "By Roberts, Nora",
        "Description": "Pursuing a daring dream of musical stardom, a young performer meets a high player in the industry whose professional dealings have made him a ruthless businessman, and whose fear of getting too close makes him resist an uncontrollable attraction. Reissue.",
        "Category": " Fiction , Romance , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Recruiting Love: Using the Business Skills You Have to Find the Love You Want",
        "Authors": "By Dunham, Alison Blackman and Freeman, Jessica B.",
        "Description": "",
        "Category": "",
        "Publisher": "Cyclone Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Herbs With Confidence",
        "Authors": "By Rappert",
        "Description": "",
        "Category": "",
        "Publisher": "Remembrance Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "Beyond Prozac: Brain-Toxic Lifestyles, Natural Antidotes & New Generation A",
        "Authors": "By M.D. Norden Michael J.",
        "Description": "",
        "Category": "",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Marshall, the Courthouse Mouse: A Tail of the U.S. Supreme Court",
        "Authors": "By Barnes, Peter W., Barnes, Cheryl Shaw, Barnes, Peter W. (ILT), and Barnes, Cheryl Shaw (ILT)",
        "Description": "Should mice be able to eat any cheese they please? That’s the question in front of Chief Justice Marshall J. Mouse and his mice justices in Marshall, the Courthouse Mouse. Written and illustrated by the award winning and bestselling writer/illustrator team Peter and Cheryl Barnes, Marshall, the Courthouse Mouse follows the United Mice of America’s Supreme Court as Chief Justice Marshall and his fellow mice justices debate the constitutionality of a sacred mouse law. Children will be educated and entertained as they learn about everything from petitioning the high court to handing down decisions to the laws of the land. With a ?find the turtle” activity throughout the book and a resource section for teachers and parents at the end, Marshall, the Courthouse Mouse, delights and amuses kids as they learn about the Constitution, court opinions, and our nation’s laws.",
        "Category": " Juvenile Fiction , Historical , United States , General",
        "Publisher": "VSP Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "The Cinderella Hour",
        "Authors": "By Stone, Katherine",
        "Description": "When she brings her radio talk show back home to Chicago, Snow is not welcomed with open arms as she is faced with a self-destructive mother, an heiress with a hidden agenda, and Ray, the troubled boy she once loved and with whom she shared a special relationship years ago.  100,000 first printing.",
        "Category": " Fiction , Romance , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "10.46",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Chef Paul Prudhomme's Pure Magic",
        "Authors": "By Prudhomme, Paul and Rico, Paul (PHT)",
        "Description": "Over one hundred recipes show you how to bring a symphony of flavors to everyday meals. If you're looking for satisfying deep-down tastes, look no further. Here you'll find:Sticky ChickenLotsa Crab Crab CakesSouthern Smothered SpudsSweet Potato OmeletBronzed FishFresh Garlic PastaCorn ChowderBlack Bean SoupReally Rich Beefand MushroomsAlso included are all your Louisiana favorites, such as gumbos, jambalayas, and etouffées.",
        "Category": " Cooking , Regional & Ethnic , Cajun & Creole",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The Republican Party: Its heritage and history",
        "Authors": "By Schwengel, Fred",
        "Description": "",
        "Category": "",
        "Publisher": "Acropolis Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "More Than It Hurts You: A Novel",
        "Authors": "By Strauss, Darin",
        "Description": "Read Darin Strauss's posts on the Penguin BlogJosh Goldin's happy yet unexamined existence is shattered one morning when his wife, Dori, rushes their eight-month- old son to the emergency room in severe distress. Dr. Darlene Stokes, an African-American physician and single mother, suspects Munchausen by proxy, a rarely diagnosed and controversial phenomenon where a mother intentionally harms her baby. As each of them is forced to confront a reality that has become a nightmare, Darlene, Dori, and Josh are pushed to their breaking points. Darin Strauss's extraordinary novel is set in a world turned upside down-where doctors try to save babies from their parents, police use the law to tear families apart, and the people you think you know best end up surprising you the most.",
        "Category": " Fiction , Medical",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Chandra (Signet)",
        "Authors": "By Coulter, Catherine",
        "Description": "",
        "Category": " Fiction , Romance , General",
        "Publisher": "Onyx",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "Long Way Gone",
        "Authors": "By Beah, Ishmael",
        "Description": "My new friends have begun to suspect I haven't told them the full story of my life.\"Why did you leave Sierra Leone?\"\"Because there is a war.\"\"You mean, you saw people running around with guns and shooting each other?\"\"Yes, all the time.\"\"Cool.\"I smile a little.\"You should tell us about it sometime.\"\"Yes, sometime.\"This is how wars are fought now: by children, hopped-up on drugs and wielding AK-47s. Children have become soldiers of choice. In the more than fifty conflicts going on worldwide, it is estimated that there are some 300,000 child soldiers. Ishmael Beah used to be one of them.What is war like through the eyes of a child soldier? How does one become a killer? How does one stop? Child soldiers have been profiled by journalists, and novelists have struggled to imagine their lives. But until now, there has not been a first-person account from someone who came through this hell and survived.In the #1 New York Times bestseller, A Long Way Gone, Beah, now twenty-five years old, tells a riveting story: how at the age of twelve, he fled attacking rebels and wandered a land rendered unrecognizable by violence. By thirteen, he'd been picked up by the government army, and Beah, at heart a gentle boy, found that he was capable of truly terrible acts.This is a rare and mesmerizing account, told with real literary force and heartbreaking honesty.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "FSG Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Sean's Legacy: An AIDS Awakening",
        "Authors": "By Hopkins, Robert",
        "Description": "",
        "Category": " Social Science , LGBT Studies , Gay Studies",
        "Publisher": "Triumph Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Now I Am Ninety....But It's Not My Fault!",
        "Authors": "By Harry Weiss",
        "Description": "",
        "Category": "",
        "Publisher": "Blackwater Publications",
        "Price Starting With ($)": "7.58",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Wild Washington Animal Sculptures A to Z",
        "Authors": "By Nancy Arbuthnot",
        "Description": "",
        "Category": "",
        "Publisher": "Annapolis Publishing Company",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Road to the White House 2000",
        "Authors": "By Wayne, Stephen J.",
        "Description": "",
        "Category": " Travel , United States , General",
        "Publisher": "Bedford/St. Martin's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Devil's Embrace (Devil's Duology)",
        "Authors": "By Coulter, Catherine",
        "Description": "",
        "Category": " Fiction , Romance , General",
        "Publisher": "Onyx",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "The Promise in a Kiss: A Cynster Christmas Novel",
        "Authors": "By Laurens, Stephanie",
        "Description": "What would you do if you were kissed by the most handsome stranger you'd ever seen? And what if that man was a Cynster?Every girl -- even convent-educated ones -- dreams of forbidden kisses. So when a man literally falls at Helena's feet as she's walking through the courtyard one moonlit Christmas Eve, the pretty, young comtesse d'Lisle knows he's up to no good. He's clearly a bit dangerous... and obviously caught in the middle of a clandestine rendezvous. Why else would he have risked his neck and jumped out of a window into the snow?It's wrong, it's outlandish . . . and it's the most utterly romantic gesture she's ever seen. So when the good sisters rush up, demanding to know ifshe has seen a man on the grounds, Helena ignores the years of strict upbringing that insist she reveal his presence.To lie would be a sin, but 'no one can be good all the time.As a reward for her silence, the stranger takes her in his arms and enticingly, unforgettably kisses her -- and then departs, leaving a lingering if unspoken promise of all that might be, should fate decree that they meet again. Although Helena doesn't know it, her wild Englishman is Sebastian Cynster, Duke of St. Ives, a nobleman who will prove to be her destiny.Seven years later, Helena has been transformed from a pretty schoolgirl to an aristocratic beauty. Her sparkling wit has made her sought after by London's hostesses; her considerable dowry has made winning her hand the aim of many a gentleman . . . but she is deadeningly aware of how boring so many ofthese gentlemen are.Her manipulative guardian has unexpectedly allowed her to find a husband of her own choosing, and she has no intention of marrying any man who tries to tame her. There must be someone perfect for her... someone who can live up to the promise ofthat long-ago kiss.Then, at a ball, fate strikes. Once again, it is the Christmas season, and across the crowded room Helena stands transfixed . . . for there is the man whose kiss she has never forgotten, the man of her memory whom no other has ever been able to supplant. Her wild, mysterious Englishman, Sebastian Cynster, Duke of St. Ives.One look, and he's determined to reclaim her....",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "The Hurlers: Pitching Power and Precision (World of Baseball)",
        "Authors": "By Kerrane, Kevin",
        "Description": "",
        "Category": "",
        "Publisher": "Redefinition, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Giotto's Hand (Art History Mysteries)",
        "Authors": "By Pears, Iain",
        "Description": "Following a clue provided by a dying woman's confession, General Bottando of Rome's Art Theft Squad sets off on a world-wide search for the man he calls Giotto, whom he believes is responsible for a series of major heists",
        "Category": " Fiction , Mystery & Detective , Traditional British",
        "Publisher": "Berkley Prime Crime",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Catastrophe",
        "Authors": "By Morris, Dick and McGann, Eileen",
        "Description": "#1 New York Times Bestseller! In Catastrophe, Dick Morris and Eileen McGann—authors of the megabestsellers Fleeced and Outrage—take a hard look at America in free fall and at how Barack Obama is transforming a vulnerable U.S. into a socialist state. Their seventh consecutive New York Times bestseller, Catastrophe is a call to arms for every American skeptical of Big Business and politics as usual—and a must read for fans of Bill O’Reilly, Sean Hannity, Rush Limbaugh, Michael Savage, Bernie Goldberg, and Glenn Beck.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Greece, Athens, & the Mainland (Eyewitness Travel Guides)",
        "Authors": "By Dubin, Marc S. (EDT)",
        "Description": "",
        "Category": " Travel , Europe , Greece",
        "Publisher": "DK Travel",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Bulfinch's Mythology: 2 (Studio Book)",
        "Authors": "By Bulfinch, Thomas",
        "Description": "This classic collection of Greek and Roman myths features an informative introduction by the noted scholar of mythology, Joseph Campbell, and illustrations drawn from master works of Western art",
        "Category": " Religion , General",
        "Publisher": "Studio",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "October",
            "Year": "1979"
        }
    },
    {
        "Title": "Dream Tracks: The Railroad and the American Indian, 1890-1930",
        "Authors": "By McLuhan, T. C.",
        "Description": "",
        "Category": "",
        "Publisher": "Abrams",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Deadlock",
        "Authors": "By Johansen, Iris",
        "Description": "Emily Hudson is an archeologist who travels the world in search of priceless artifacts from war-torn countries and other hot spots.    Her best friend and partner, Joel Levy, is always at her side—until one day, her entire crew is massacred and Joel and Emily are held captive. Victims of one of the most ruthless and evil human beings on earth.  For two weeks they try to survive, until Emily is the unwitting instrument in Joel’s demise.  John Garrett has worked for the CIA, MI6, and whoever else needed his services.  Now, the CIA comes calling with a desperate mission for him: save Emily Hudson.  But their may be more to this job than they let him know.  And soon, his connection to Emily has him questioning everything he thought to be true.  Emily has vengeance on her mind.  Will Garrett aid her in getting revenge?  Can Emily help him get to the truth behind a bigger conspiracy?  Or will they both die trying…With lightning-fast pacing, plot twists and shocking betrayals, Iris Johansen is at the top of her game in this latest thriller.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Arthritis and Folk Medicine",
        "Authors": "By D. C. Jarvis, M.D.",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Crest Books",
        "Price Starting With ($)": "11.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "Guide to the New MLA Style of Documentation for Users of Writting a College Handbook",
        "Authors": "By Lincoln, John E. and Heffernan, James W.",
        "Description": "",
        "Category": "",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Southern Living Landscape Book [Hardcover] [Jan 01, 2000] BENDER, Steve",
        "Authors": "By BENDER, Steve",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Baseball Fever",
        "Authors": "By Hurwitz, Johanna and Cruz, Ray (ILT)",
        "Description": "Ezra Feldman, almost ten, likes baseball more than anything else in the world. But his father cannot understand why his son would rather rot his brains watching men swinging big wooden sticks than read a book or play chess. Can an unwanted car trip, a grumpy old professor, and a surprising chess victory help father and son find a little common ground--and convince Ezra's dad that cheering for the national pastime isn't completely off base?Ezra Feldman, almost ten, likes baseball more than anything else in the world.  But his father cannot understand why his son would rather rot his brains watching men swinging big wooden sticks than read a book or play chess.  Can an unwanted car trip, a grumpy old professor, and a surprising chess victory help father and son find a little common ground--and convince Ezra's dad that cheering for the national pastime isn't completely off base?",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "The New Testament, an Introduction: Proclamation and Parenesis, Myth and History",
        "Authors": "By Perrin, Norman",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Harcourt College Pub",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "1974"
        }
    },
    {
        "Title": "The Siege",
        "Authors": "By White, Stephen",
        "Description": "Stephen White-author of over a dozen New York Times bestsellers- returns with a relentlessly propelled, thriller that will remind readers of his acclaimed Kill Me. Stephen White's Alan Gregory novels are beloved by both fans and critics-the most recent, Dead Time, was a USA Today and Book-Sense bestseller. In The Siege, Gregory's longtime friend Sam Purdy takes center stage in a story that feels ripped from tomorrow's headlines. From the first page on, readers need to be buckled in for a nonstop ride full of terror and pathos. As a lovely weekend approaches on the Yale campus it appears that a number of students-including the sons of both the Secretary of the Army and newest Supreme Court justice-may have gone missing. Kidnapping? Terrorism? The authorities aren't sure. But the high-profile disappearances draw the attention of the CIA and the FBI's vaunted Hostage Rescue Team. Attention quickly focuses on the fortress-like tomb of one of Yale's secret societies. Suspended Boulder police detective Sam Purdy soon finds himself in New Haven, where he is quickly snared by an unlikely pair of Feds: FBI agent Christopher Poe and CIA analyst Deirdre Drake. Sam, Poe, and Dee join together, desperately trying to solve the riddle of what is going on inside the windowless stone tomb on the edge of campus. The clock is pounding in their ears. The unknown enemy is playing by no known rules . . . is making no demands . . . is refusing to communicate with the hostage negotiator . . . is somehow anticipating every FBI move . . . is completely unconcerned about getting away . . . And . . . is sending students, one by one, out of the building's front door to die.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Business Essentials (5th Edition)",
        "Authors": "By Ebert, Ronald J. and Griffin, Ricky W.",
        "Description": "",
        "Category": " Business & Economics , Industries , General",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Small Stakes Hold 'em: Winning Big with Expert Play",
        "Authors": "By Malmuth, Mason, Sklansky, David, and Miller, Ed",
        "Description": "",
        "Category": " Games & Activities , Gambling , General",
        "Publisher": "Two Plus Two",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2023"
        }
    },
    {
        "Title": "My Life as Alien Monster Bait (The Incredible Worlds of Wally McDoogle #2)",
        "Authors": "By Myers, Bill",
        "Description": "\"Hollywierd\" comes to Middletown! Wally's a superstar! A movie company has chosen our hero to be eaten by their mechanical \"Mutant from Mars!\" It's a close race as to which will consume Wally first - the disaster-plagued special-effects \"monster\" or his own out-of-control pride. . . Until he learns the cost of true friendship and of God's command for humility.",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Every Child Can Succeed",
        "Authors": "By Tobias, Cynthia Ulrich",
        "Description": "This enlightening source shows parents how to utilize a “learning styles” approach to help their kids live up to their potential and find success in life.",
        "Category": " Family & Relationships , Education",
        "Publisher": "Focus on the Family",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The Pastor's Complete Guide to Personal Financial Planning",
        "Authors": "By Akin, H. L.",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Ask the Family Handyman",
        "Authors": "By Reader's Digest Association (EDT)",
        "Description": "More than one thousand answers to commonly asked questions about home improvement and repair are accompanied by step-by-step photos, illustrations, and special features explaining the latest tools, materials and techniques, short cuts, and vital safety tips.",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Treasures of the Tide",
        "Authors": "By Allen, Thomas B.",
        "Description": "Published by the National Wildlife Federation, 1400 Sixteenth Street, Washington DC 20036-2266. Distributed by The Sewall Co., Box 529, Lincoln, MA 01773. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Natl Wildlife Federation",
        "Price Starting With ($)": "7.57",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "The Wit and Wisdom of Mark Twain",
        "Authors": "By Twain, Mark and Ayres, Alex",
        "Description": "Collects quotations on a wide range of subjects, including politics, marriage, morals, money, literature, humor, and ignorance",
        "Category": " Humor , General",
        "Publisher": "Meridian",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "The Year-Round Holiday Cookbook.",
        "Authors": "By Huntley, Suzanne",
        "Description": "",
        "Category": "",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "13.47",
        "Publish Date": {
            "Month": "June",
            "Year": "1969"
        }
    },
    {
        "Title": "Discovering the wonders of our world",
        "Authors": "By Editors of Reader's Digest",
        "Description": "Hundreds of full-color photographs, illustrations, diagrams, and locator maps highlight an around-the-world tour of the marvels of the natural world, accompanied by explanations of the forces and processes that have shaped the planet. 10,000 first printing.",
        "Category": "",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "8.51",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Coral Reefs: Nature's Richest Realm",
        "Authors": "By Steene, Roger",
        "Description": "A volume on coral reef marine life covers the life and development of fish and invertebrates in such areas as the Tropical Atlantic, Indo-Pacific, East Africa, Red Sea, and Indian Ocean.",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "8.22",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "The Nature Of The Non-Western World",
        "Authors": "By Vera Micheles Dean",
        "Description": "",
        "Category": "",
        "Publisher": "Mentor Book",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Mrs Hedgehog & Her Friends For",
        "Authors": "By Rh Value Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Critical Strategies for Academic Thinking and Writing",
        "Authors": "By Kiniry, Malcolm and Rose, Mike",
        "Description": "Critical Strategies for Academic Thinking and Writing, Third Edition, is a text and reader that gets to the heart of what is so essential for success in college but is so hard for students to develop. Based on years of research on the reading and writing demands of the college curriculum, Critical Strategies teaches students the six thinking and writing strategies necessary for college-level work in any discipline and gives them practice with the kinds of material they'll use in their other college courses. Edited by Mal Kiniry and by Mike Rose, one of the most well known figures in composition studies, the streamlined third edition gives students more help and guidance to develop competence and confidence with academic work.",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Bedford/St. Martin's",
        "Price Starting With ($)": "4.93",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Pasta Tecnica",
        "Authors": "By Bruno, Pat",
        "Description": "\"Leads chefs through the pasta-making process....It's a must for everyone with a pasta machine.\" --Columbia (MD) Free Press",
        "Category": " Cooking , Specific Ingredients , Pasta",
        "Publisher": "Contemporary Books, Inc., Chicago",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "Spanish Now (Level 1 Textbook/Workbook, 6th Edition)",
        "Authors": "By Wald, Heywood, Silverstein, Ruth J., Pomerantz, Allen, and Quinones, Nathan (EDT)",
        "Description": "Includes sections on structure, verbs, vocabulary, idioms, reading and listening comprehension, writing, and Hispanic culture.",
        "Category": " Foreign Language Study , Spanish",
        "Publisher": "B E S Pub Co",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "The Men's Health Home Workout Bible",
        "Authors": "By Schuler, Lou (EDT) and Mejia, Michael (EDT)",
        "Description": "Get bigger biceps, broad shoulders, a bigger bench press, powerful legs, cut abs . . . without ever leaving your home! The body you want, in the space you have. The strength you want, with the equipment you have. The muscles you want, in the time you have. You don't need to join a gym to get in shape. In fact, for a lot of guys, the gym is an impediment to getting in shape. The crowds, the inconvenience, the intimidation, the time, the commute-- by the time you add it all up, you could end up investing 2 hours to get 45 minutes of exercise. No matter how little space you have, no matter how little equipment you have, no matter how little time you have, you can get the results you want without stepping inside a gym. The Men's Health Home Workout Bible by Lou Schuler and Michael Mejia, M.S., C.S.C.S. gives you...* Four full-body muscle plans:The Body Weight PlanThe Dumbbell PlanThe Barbell PlanThe Multistation-Machine Plan* Custom training plans for strength, fat loss, aerobic fitness, and sports performance* Buying advice for weights, benches, machines, cardio equipment, and exercise videos* Complete guidelines for turning your home into a state-of-the-art fitness centerWith beginner, intermediate, and advanced full-body workouts for each type of equipment, The Men's Health Home Workout Bible gives you more than 400 exercises altogether, photographed and fully described. From pushups to power cleans, from crunches to jump squats, we show you how to get more muscle and strength at home, whether you're a complete beginner or a competitive athlete.The Men's Health Home Workout Bible is a personal trainer, on call 24 hours a day, 7 days a week.",
        "Category": " Sports & Recreation , Bodybuilding & Weight Training",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Maze of Worlds",
        "Authors": "By Lumley, Brian",
        "Description": "Earth is under attack! Alien beings bent on our destruction have seeded the world with horrible machines capable of transforming our planet into a hellhole where only they can live. Our only hope is a small group of intrepid adventurers who just might be able to unravel the mystery of the alien machinery and turn it against these deadly enemies. The House of Doors taps the minds of its captives and creates worlds based on their worst nightmares.Jack Turnbull, once a secret service \"minder,\" now a recovering alcoholic, finds in the House of Doors alcoholic temptation beyond imagination. Angela Denholm discovers that she hasn't quite forgotten her brutal ex-husband, Rod, after all. For Spencer Gill, whose native understanding of machinery borders on the supernatural, the House of Doors is doubly dangerous. Not only is its alien technology almost too perverse for him to even begin to understand, it creates for Gill a world of useless machines that threaten his sanity.If Spencer Gill and his comrades cannot uncover the traitor in their midst, solve the maze of the House of Doors, take over its master computer, and use the aliens' own technology against them, our planet is doomed.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "7.62",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "A Sundial in a Grave: 1610: A Novel",
        "Authors": "By Gentle, Mary",
        "Description": "\"It's about sex, and cruelty, and forgiveness.\"Thus begins a sweeping historical adventure about two dueling swordsmen and the plot to kill a king in the grand tradition of Dorothy Dunnett and Alexander Dumas.The year is 1610. Continental Europe is briefly at peace after years of war, but Henri IV of France is planning to invade the German principalities. In England, only five years earlier, conspirators nearly succeeded in blowing up King James I and his Parliament. The seeds of the English Civil War and the Thirty Years War are visibly being sown, and the possibility for both enlightenment and disaster abounds.But Valentin Rochefort, duelist and spy for France's powerful financial minister, could not care less. Until he is drawn into the glittering palaces, bawdy back streets, and stunning theatrics of Renaissance France and Shakespearean London in a deadly plot both to kill King James I and to save him. For this swordsman without a conscience is about to find himself caught between loyalty, love, and blackmail, between kings, queens, politicians, and Rosicrucians -- and the woman he has, unknowingly, crossed land and sea to meet.",
        "Category": " Fiction , Historical",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Thief's Gamble (The First Tale of Einarinn)",
        "Authors": "By McKenna, Juliet E.",
        "Description": "",
        "Category": "",
        "Publisher": "Harper Prism",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Death on a silver platter (A culinary mystery)",
        "Authors": "By Hart, Ellen",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Pinky And Rex And The Double-Dad Weekend: Ready-To-Read Level 3",
        "Authors": "By Howe, James and Sweet, Melissa (ILT)",
        "Description": "Early readers will love joining best friends Pinky and Rex on their many adventures! Pinky and Rex are looking forward to a camping adventure with their dads. They'll hike in the woods and roast marshmallows over a campfire. But a thunderstorm has come along to ruin all their plans. How can the best friends save their double-dad weekend?",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Cast in Secret (Chronicles of Elantra, Book 3)",
        "Authors": "By West, Michelle and Sagara, Michelle",
        "Description": "Still avoiding magic whenever possible,Corporal Kaylin Neya relished investigatinga regular theft once again. Until she found outthe mysterious box was taken from Elani Street,where the mages and charlatans mingled, andit was sometimes hard to tell the differencebetween the two. But she was hoping thismight be a mundane case&#151;&#151;when in a back room Kaylin saw alost-looking girl in a reflective pool&#133;whocalled out Kaylin's name.Shaken, Kaylin tried to stay focused onthe case at hand. But since the stolen itemwas ancient, without a keyhole, and heldtremendous darkness inside, Kaylin knewunknown forces were again playing withher destiny&#151;and her life&#133;.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Luna",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Ghostwriter (Jake O'Hara Mystery)",
        "Authors": "By Wald, Noreen",
        "Description": "Manhattan ghostwriter Jake O'Hara races against time to find the serial killer targeting ghostwriters, before she can become the next victim, in the first volume in a new series of mysteries. Original.",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Beautified: Secrets for Women to Look Great and Feel Fabulous",
        "Authors": "By Fink, Ben (PHT), Douglas, Kyan, and Leutwyler, Henry (PHT)",
        "Description": "Enough with the guys. Ladies, it’s your turn to experience the thrill that comes from being groomed and made gorgeous by beauty expert and Queer Eye for the Straight Guy’s grooming guru, Kyan Douglas. In Beautified, Kyan shares the techniques he uses as a veteran stylist—and answers the questions posed to him by the show’s legions of female fans—to cover all the essentials that will put you on the road to being beautified (translation: looking good and feeling good), including:--hair hints on the right cut for you, at-home coloring and highlights, the perfect blow-out, proper product use, and solving problems like overprocessed locks, crunchy hair, and the inevitable bad hair day--skin secrets on facials and masks, righteous daily routines and pesky pimples, and special challenges such as tanning, tattoos, and piercings--makeup must-have advice on shopping, tools, and products, and how to use everything from foundation and concealer to blush, lipstick, and eye shadow--grooming gifts to yourself like home spa treatments and massages, beautiful brows, the prefect shave, nail know-how, the power of scent, and steps to a better smile--diet dos and don’ts that address everything from carbs vs. proteins to fats vs. fiction exercise essentials on how to energize yourself by addressing every part of your body, in regimens that range from walking to weight-training--And a chapter on your spirit workout that addresses the deeper-than-skin issues that round out a Beautified lifestyleWhether you’re looking for beautiful brows or advice on which beauty products you don’t need, Kyan will show you what you can do—right now—to put your best face forward.",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Underground",
        "Authors": "By Hill, Tobias",
        "Description": "Among the rush-hour crowds and abandoned levels of the London Underground, someone is pushing women under trains. In his search for the killer, Casimir, a Tube worker, is led ever deeper into this city beneath the city.Hunting for the clues that will lead him to the killer, Casimir is also drawn back into his own past and the terrible secrets of his Polish childhood. In subterranean London, Casimir has gone to ground. But in his desperate search, he discovers a chance for forgiveness and the emergence of a new life.",
        "Category": "",
        "Publisher": "Faber and Faber Ltd",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Real Men Last All Night: Four Steamy Novellas",
        "Authors": "By Foster, Lori, McCray, Cheyenne, Betts, Heidi, and Leigh, Lora",
        "Description": "Today's top erotic romance writers come together for a steamy read of four sexy stories about women who discover that real men last all night...Luring Lucy by Lori FosterAll Lucy was looking for when she went to her vacation home was in innocent fling to quell the yearning she had felt since her husband died four years ago. She never expected her longtime friend Bram to lure her into a love affair so hot. Cooper's Fall by Lora LeighFormer ranger turned bar owner Ethan Cooper never expected to get an eyeful of prim Miss Sarah Fox from his attic window one hot summer afternoon. But now his blood is on fire for the delicious little minx. The Edge of Sin by Cheyenne McCrayZane Steele lives a life of extraordinary danger as a government agent and has never let anyone get too close. Then he sees the one woman who changes his life forever. Wanted: A Real Man by Heidi BettsClaire left her high school sweetheart Linc, in search of a better life. Ten years later she needs his help as a U.S. Marshal to find her missing daughter…Linc's daughter. Reeling with the knowledge of a daughter he's never known, Linc sets out to claim what's his.",
        "Category": " Fiction , Romance , Collections & Anthologies",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Best Lesbian Erotica 1996",
        "Authors": "By Taormino, Tristan (EDT) and Lewis, Heather (INT)",
        "Description": "Contributions by Lucy Jane Bledsoe, Pat Califia, Trish Thomas, Linda Smukler, and Wickie Stamps highlight a collection of lesbian erotica, the first volume in a proposed annual series. Simultaneous. IP.",
        "Category": "",
        "Publisher": "Cleis Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Little Golden Book Collection: Sleepytime Tales",
        "Authors": "By Golden Books Publishing Company",
        "Description": "THESE TWO TITLES mark the debut of a beautiful new line of treasuries, perfect for gift-giving. Everyone’s favorite Little Golden Books can be found in their entirety, from Sailor Dog to I Can Fly to The Poky Little Puppy, plus new favorites, too! A supreme value at $14.95, these deluxe volumes will stand apart with their gold-edged pages, unforgettable stories, and gorgeously reproduced artwork.",
        "Category": " Juvenile Fiction , Bedtime & Dreams",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Elements of Graph Design",
        "Authors": "By Kosslyn, Stephen M.",
        "Description": "",
        "Category": "",
        "Publisher": "W H Freeman & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Ecology of Coastal Waters: A Systems Approach (Studies in Ecology)",
        "Authors": "By Mann, K. H.",
        "Description": "",
        "Category": " Science , Life Sciences , Ecology",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "20th Century America",
        "Authors": "By Traylor, Myrna E. (EDT)",
        "Description": "Provides an overview of the politics, business, scientific discoveries, arts, and lifestyles of the last century, decade by decade.",
        "Category": " Juvenile Nonfiction , History , United States , 20th Century",
        "Publisher": "Time Life Student Library",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Death on a Quiet Day",
        "Authors": "By Innes, Michael",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Perennial",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Revolutionizing Product Development: Quantum Leaps in Speed, Efficiency, and Quality",
        "Authors": "By Wheelwright, Steven C. and Clark, Kim B.",
        "Description": "Today, a company's capability to conceive and design quality prototypes and bring a variety of superior products to market quicker than its competitors is increasingly the focal point of competition, contend leading product development experts Steven Wheelwright and Kim Clark. Drawing on six years of in-depth, systematic, worldwide research, they present proven principles for developing the critical capabilities for speed, efficiency, and quality that have worked again and again in scores of successful Japanese, American, and European fast-cycle firms.  The authors argue that to survive, let alone succeed, today's companies must construct a new \"platform\" -- with new methodologies -- on which they can compete. Using their model for development strategies, Wheelwright and Clark show that firms can create a solid architecture for the integration of marketing, manufacturing, and design functions for problem solving and fast action -- particularly during the critical design-build-test cycles of prototype creation.  They demonstrate further how successful firms such as Honda in automobiles, Compaq in personal computers, Applied Materials in semi-conductors, Sony in audio equipment, The Limited in apparel, and Hill-Rom in hospital beds have employed recent methodologies to bring new products to market at break-neck speed. Such innovations include design for manufacturability, quality function deployment, computer-aided design, and computer-aided engineering.  Finally, Wheelwright and Clark emphasize the importance of learning in the organization. Companies that consistently \"design it right the first time\" and follow a path of continuous improvement in product and process development have a formidable edge in the crucial race to market.",
        "Category": " Business & Economics , Production & Operations Management",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Santa Olivia",
        "Authors": "By Carey, Jacqueline",
        "Description": "Lushly written with rich and vivid characters, SANTA OLIVIA is Jacqueline Carey's take on comic book superheroes and the classic werewolf myth.   Loup Garron was born and raised in Santa Olivia, an isolated, disenfranchised town next to a US military base inside a DMZ buffer zone between Texas and Mexico. A fugitive \"Wolf-Man\" who had a love affair with a local woman, Loup's father was one of a group of men genetically-manipulated and used by the US government as a weapon.  The \"Wolf-Men\" were engineered to have superhuman strength, speed, sensory capability, stamina, and a total lack of fear, and Loup, named for and sharing her father's wolf-like qualities, is marked as an outsider.    After her mother dies, Loup goes to live among the misfit orphans at the parish church, where they seethe from the injustices visited upon the locals by the soldiers.  Eventually, the orphans find an outlet for their frustrations: They form a vigilante group to support Loup Garron who, costumed as their patron saint, Santa Olivia, uses her special abilities to avenge the town.  Aware that she could lose her freedom, and possibly her life, Loup is determined to fight to redress the wrongs her community has suffered. And like the reincarnation of their patron saint, she will bring hope to all of Santa Olivia.",
        "Category": " Fiction , Fantasy , Paranormal",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Corporate Espionage: What It Is, Why It's Happening in Your Company, What You Must Do About It",
        "Authors": "By Winkler, Ira",
        "Description": "A former agent for the National Security Agency reveals how American companies are losing billions of dollars each year through espionage perpetrated by computer hackers and employee spies and shows how companies can defend against it. Tour. IP.",
        "Category": " Social Science , Criminology",
        "Publisher": "Prima Lifestyles",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Paulossie;: An Eskimo boy (A young owl book)",
        "Authors": "By Swim, Robert C.",
        "Description": "",
        "Category": "",
        "Publisher": "Holt, Rinehart and Winston",
        "Price Starting With ($)": "5.78",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Unanswered Questions",
        "Authors": "By Furet, Francois (EDT)",
        "Description": "Discusses Nazi policies toward the Jews, the origins of genocide, Jewish resistance, the relation of genocide to fascist ideology, and remaining questions about the rise of Nazism",
        "Category": "",
        "Publisher": "Schocken",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "The Essential Sea Kayaker: A Complete Course for the Open-Water Paddler",
        "Authors": "By Seidman, David and Singer, Andy (ILT)",
        "Description": "Discusses boats and gear, paddle strokes, maneuvers, group paddling, introducing children to the sport, and kayaking for the physically challenged",
        "Category": " Sports & Recreation , Kayaking",
        "Publisher": "Intl Marine Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Ortho's All About Kitchen Remodeling (Ortho's All About Home Improvement)",
        "Authors": "By Ortho Books, Hodgson, Larry, Riha, John, and Johnson, Karen K.",
        "Description": "Four sections include kitchen design, remodeling examples, project planning, and a construction guide.Construction guide shows all the techniques needed to remodel a kitchen.Step-by-step instructions for dismantling the old kitchen and installing cabinets and countertops, sinks and faucets, light fixtures, flooring, and appliances.Principles of kitchen design highlighted to help readers create a kitchen which fits their lifestyle.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Ortho",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "The Elements of the Grail Tradition (Elements of Series)",
        "Authors": "By Matthews, John",
        "Description": "",
        "Category": " Fiction , Fairy Tales, Folk Tales, Legends & Mythology",
        "Publisher": "Element Books Ltd.",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "German Shepherd Dog Ps 810",
        "Authors": "By Hart, Ernest",
        "Description": "Traces the history of the breed, tells how to select, feed, train, groom, and care for a German shepherd, and discusses show preparation and breeding",
        "Category": "",
        "Publisher": "TFH Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "It's Not a Glass Ceiling, It's a Sticky Floor: Free Yourself From the Hidden Behaviors Sabotaging Your Career Success",
        "Authors": "By Shambaugh, Rebecca",
        "Description": "Turn the top 7 career breakers for women into career makersStatistically, more than one-third of Fortune 500 managers are women-and yet we represent barely five percent of the top earners among executives. Usually, we blame it on men-those “old boy” networks that don't typically welcome women into “the club.” But, according to leadership coach Rebecca Shambaugh, the real obstacle to women's advancement is not a “glass ceiling.” It's the self-imposed career blocks that prevent us from moving up.These are the 7 “sticky floors”:1. Balancing Your Work and Life2. Embracing “Good Enough” in Your Work3. Making the Break4. Making Your Words Count5. Forming Your Own Board of Directors6. Capitalizing on Your Political Savvy7. Asking for What You WantAdmit it: You've probably been “stuck” in at least one or more of these situations. Maybe you're a perfectionist who has trouble letting go of a task. Maybe you're so loyal to your company that you haven't explored other career options. Maybe you're afraid of speaking up in meetings. Or maybe you're so accommodating to others' needs that you never take care of your own.This book will show you how to get unstuck from these common traps. You'll discover how other successful women have managed to break out of middle management jobs to grab the top leadership positions. You'll hear hard-won advice from working mothers who also happen to be CEOs, including proven tricks of the trade when it comes to juggling career and family. You'll learn how to conquer your insecurities, transform your thinking, tailor your behavior, and demand the kind of professional recognition you deserve. There's even a section of fill-in charts and checklists at the end of the book to help you stay on track, in control, and on the rise.Once you've freed yourself from life's sticky floors, there's nowhere to go but up.",
        "Category": " Reference , Questions & Answers",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Bringing the Jobs Home: How the Left Created the Outsourcing Crisis--and How We CanFix It",
        "Authors": "By Buchholz, Todd G.",
        "Description": "",
        "Category": " Political Science , Reference",
        "Publisher": "Sentinel HC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Single Woman of a Certain Age: 29 Women Writers on the Unmarried Midlife--Romantic Escapades, Empty Nests, Shifting Shapes, and Serene Independence",
        "Authors": "By Ganahl, Jane (EDT)",
        "Description": "In Single Woman of a Certain Age, Jane Ganahl assembles a chorus of sophisticated and witty voices for this revealing anthology about flying solo in midlife. Joyce Maynard and Dakota Cassidy try online hookups, Debra Ginsberg brings up the M-word, Cameron Tuttle goes on a date (with herself), Susan Griffin finds joy in solitude, and Rachel Toor finally finds companionship ? the four-legged kind.Reflecting on the (mostly) ups and (sometimes) downs of women cruising past 40, these writers address the challenges and rewards of growing older as a single woman: sex, loneliness, motherhood, learning to live alone, financial struggles, blossoming careers, menopause, and more. Contributors include April Sinclair, Cameron Tuttle, Spike Gillespie, Laura Fraser, Susan Griffin, Jane Juska, Joyce Maynard, Sunny Singh and more.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "New World Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The accidental President",
        "Authors": "By Sherrill, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Grossman Publishers",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "The Theater Experience",
        "Authors": "By Edwin Wilson",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill Book Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Touch the Earth: A Self-Portrait of Indian Existence",
        "Authors": "By McLuhan, T. C.",
        "Description": "",
        "Category": "",
        "Publisher": "Promontory Press",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "America and its Indians (A Children's press book)",
        "Authors": "By Leavitt, Jerome Edward",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "Capitalism: the moving target",
        "Authors": "By Silk, Leonard Solomon",
        "Description": "",
        "Category": "",
        "Publisher": "Quadrangle",
        "Price Starting With ($)": "27.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Friendship is Forever",
        "Authors": "By Harvey, Gail (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Beating the Deal Killers : Overcoming Murphy's Law (and other Sales Nightmares)",
        "Authors": "By Giglio, Stephen A.",
        "Description": "Strategies for overcoming clock-watching clients, spilled coffee, and other sales nightmares­­and closing the saleSelling is tough, and what can go wrong often will. Successful salespeople know they must prepare themselves for every potential deal-killer. Beating the Deal-Killers provides situation-specific advice for anticipating problems, handling them deftly, and returning everyone's attention to the matter at hand­­completing the sale.More than just a valuable troubleshooting guide, however, this book by award-winning sales executive Stephen Giglio gives sales pros firsthand techniques they can put into action at their next sales meeting. Battleproven tips and pointers include:How to prepare for a relaxed yet take-charge sales call Techniques, actions, and phrases for motivating a prospect 10 effective ways to field objections",
        "Category": " Medical , Physiology",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Inquisitor",
        "Authors": "By Wilson, Gayle",
        "Description": "The serial murderer dubbed the Inquisitor has already killed over a dozen women in various cities, and the authorities haven't a clue to his identity. He is organized, methodical and certain to kill again. And now he's set his sights on Birmingham psychologist Jenna Kincaid.Convinced that the Inquisitor killed his only sister, ex-army Ranger Sean Murphy has been hunting for him with one thing in mind: revenge. If his instincts are right, Jenna Kincaid will lead him to his prey.But Jenna has gotten to Sean in a way that no one has in a very long time. And now he's desperate to keep her safe —  because the madman is taking a terrifying pleasure in the game unfolding. And if the killer wins, it's Jenna who will pay the ultimate price.&#133;",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Ducks Don't Get Wet",
        "Authors": "By Augusta R. Goldin",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Y Crowell Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Chomsky for Beginners (WRITERS AND READERS BEGINNERS DOCUMENTARY COMIC BOOK, 80)",
        "Authors": "By Cogswell, David and Gordon, Paul (ILT)",
        "Description": "",
        "Category": " Political Science , Political Ideologies , General",
        "Publisher": "Writers & Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Secrets of Millionaire Moms: Learn How They Turned Great Ideas Into Booming Businesses",
        "Authors": "By Monosoff, Tamara",
        "Description": "Before they Were Millionaires they Were Moms-Just Like You!What's the difference between the most successful mom entrepreneurs and you? They believed in their ideas enough to commit to them and even in the face of adversity rarely accepted “no” for an answer. In Secrets of Millionaire Moms, mom entrepreneur Tamara Monosoff interviewed some of the most successful “Millionaire Moms” of our time including the founders of Lulu's Desserts®, Baby Einstein®, Shabby Chic®, and Airborne Health®. What she learned will help you make that leap from great idea to booming business, includingPriceless advice about business management, finances, and growthTips on balancing the business with familyWhat inspired the Millionaire Moms to take action-and what keeps them going",
        "Category": " Business & Economics , Home-Based Businesses",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Going for the Gold: Winning the Gold Medal for Financial Independence (Self-study sourcebook)",
        "Authors": "By Bissett, Lesley",
        "Description": "",
        "Category": " Self-help , General",
        "Publisher": "Skillpath Pubns Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    }
]