[
    {
        "Title": "Benji Fastest Dog in the West",
        "Authors": "By Gina Ingoglia",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Publicity: How to Get It",
        "Authors": "By Richard O'Brien",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The Chalk Garden",
        "Authors": "By Enid Bagnold",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "Betty Crocker's Best Recipes for Meat and Vegetables (Betty Crocker's Red Spoon Collection)",
        "Authors": "By Crocker",
        "Description": "Gathers recipes for roasts, skillet dishes, casseroles, soups, and stews that feature meat and vegetable combinations",
        "Category": " Cooking , General",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "How to Tempt a Duke (The Daughtry Family, 1)",
        "Authors": "By Michaels, Kasey",
        "Description": "He'd returned from war a duke. Now Rafael Daughtry was battling a force more terrifying than Napoleon's army—his family. Thankfully, his childhood friend Charlotte Seavers had agreed—reluctantly—to a bargain. While Rafe would provide her with the home she'd lost, Charlotte would provide him with a chaperone for his unruly twin sisters.But who would chaperone Rafe? For the feisty young girl he remembered had blossomed into a sensual woman—a woman whose haunting beauty and deeply kept secrets drew him like no other. Charlotte had good reason to mistrust men—yet could Rafe's sizzling seduction convince her to give in to temptation?",
        "Category": " Fiction , Romance , Historical , Regency",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "The Chicken Cookbook: Exciting Ideas for Delicious Meals",
        "Authors": "By Landolls",
        "Description": "",
        "Category": "",
        "Publisher": "Landoll Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Reunions Can Be Murder (Wwl Mystery, 475)",
        "Authors": "By Shelton, Connie",
        "Description": "When Willie McBride, a peculiar old man who is obsessed with finding gold, goes missing, Albuquerque CPA Charlie Parker, on the behest of Willie's intolerable daughter, must find him before the big family reunion, which is no easy task. Reprint.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Worldwide Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Interpreter's Concise Commentary: Acts & Paul's Letters",
        "Authors": "By Laymon, Charles (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Aristocracy and the Middle Class in Germany : Social Types in German Literature 1830 - 1900",
        "Authors": "By Ernest K. Bramsted",
        "Description": "",
        "Category": "",
        "Publisher": "Phoenix Books University of Chicago Press",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Best of Food and Wine 1987",
        "Authors": "By Wine, Food",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Growing Together in Baptism Eucharist and Ministry: A study guide F&O Paper No. 114 (Faith and Order)",
        "Authors": "By Lazareth, William H.",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "World Council of Churches",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Critics' Choice; New York Drama Critics' Circle Prize Plays, 1935-55",
        "Authors": "By GAVER, JACK",
        "Description": "",
        "Category": "",
        "Publisher": "HAWTHORN BOOKS, INC.",
        "Price Starting With ($)": "34.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "The Outlaws of Mesquite: Stories",
        "Authors": "By L'Amour, Louis",
        "Description": "Meet the frontier bad men—like Leo Carver—a man so hated that everyone in the town  of Canyon Gap planned to turn up for his hanging. Then meet those who dared to challenge  them—like Marshal Lou Morgan, who tried to save his citizens from a goldmine swindler,  only to learn that his own code of honesty made him the biggest sucker in town. There's  champion rodeo rider Marty Mahan, called a coward because he was afraid of the bronc  Ghost Maker—until he showed them the true color of his courage. Here are classic  tales of the West from the storyteller who brings to vivid life the brave men of  women who settled the North American frontier.",
        "Category": " Fiction , Westerns",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "The White Castle: A Novel",
        "Authors": "By Pamuk, Orhan",
        "Description": "From a Turkish writer who has been compared with Borges, Nabokov, and DeLillo comes a dazzling novel that is at once a captivating work of historical fiction and a sinuous treatise on the enigma of identity and the relations between East and West. In the 17th century, a young Italian scholar sailing from Venice to Naples is taken prisoner and delivered to Constantinople. There he falls into the custody of a scholar known as Hoja--\"master\"--a man who is his exact double. In the years that follow, the slave instructs his master in Western science and technology, from medicine to pyrotechnics. But Hoja wants to know more: why he and his captive are the persons they are and whether, given knowledge of each other's most intimate secrets, they could actually exchange identities. Set in a world of magnificent scholarship and terrifying savagery, The White Castle is a colorful and intricately patterned triumph of the imagination. Translated from the Turkish by Victoria Holbrook.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Garnishing and Decoration",
        "Authors": "By Biller, Rudolph",
        "Description": "Teaches a wide array of classic and modern ways for decorating food for attractive presentation",
        "Category": " Cooking , Methods , Garnishing",
        "Publisher": "Van Nostrand Reinhold",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Starlight",
        "Authors": "By Jarrett, Miranda",
        "Description": "Award-winning author Miranda Jarrett, creator of the marvelous Fairbournes, introduces a new generation in this incredible family saga.  Forced to endure London society for the sake of his younger sister, American Alexander Fairbourne longs to leave England behind him. But when a stray kitten -- all black but for a star of white -- unexpectedly wins him over, Alex allows the tiny creature to lead him to a surprising discovery...  Deemed a traitor and wanted by the British crown, Cora MacGillivray lives a shadowy life in hiding far from her beloved Scottish Highlands. Her one joy is the aVection of a black kitten -- so when it disappears, Cora is desolate with loss. Then her little Starlight miraculously returns in the arms of a handsome stranger, a man who captures Cora's heart with one charming, wicked smile. But fear and danger still haunt Cora, and only a very special magic will give her the courage to surrender to love. Includes an excerpt from Star Bright, the enthralling sequel to Starlight -- coming next month from Sonnet Books!",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "POCKET",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Royal Bride",
        "Authors": "By Wolf, Joan",
        "Description": "When her older sister elopes with her fiancT's cousin, headstrong Charity Beaufort suddenly finds herself betrothed to the enigmatic Prince Augustus of Jura, a proud warrior determined to protect his tiny country from the ravages of Napoleon by entering into a political--and marital--alliance with the English. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Forever",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Oy, Joy!",
        "Authors": "By Frank, Lucy",
        "Description": "Joy's just started high school and already her life is a mess. She can't seem to find a date who resembles a human being. Ever since her great-uncle Max moved into her family's tiny apartment, Joy has had to share a room with her little brother and she never has a moment to herself. Now, Uncle Max has decided to play matchmaker and set her up with every boy he can find. Will Joy ever get her life back on the right track?",
        "Category": " Young Adult Fiction , Family , Multigenerational",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The Case of the Philosophers' Ring by Dr. John H. Watson",
        "Authors": "By Collins, Randall",
        "Description": "",
        "Category": "",
        "Publisher": "Crown Publishers",
        "Price Starting With ($)": "32.45",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Many Waters (The Time Quartet)",
        "Authors": "By L'Engle, Madeleine",
        "Description": "A touch of computer keys, a blast of heat, and suddenly the Murry twins, Sandy and Dennys, are gasping in a shimmering desert land.",
        "Category": "",
        "Publisher": "Laurel-Leaf Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "The Pigman and Me (Bantam Starfire Books)",
        "Authors": "By Zindel, Paul",
        "Description": "The author recalls the year that he and his family lived in Travis, New York, and he was best friends with Jennifer Wolupopski and met Nonno Frankie Vivona, who became his pigman. By the author of The Pigman. Reprint.",
        "Category": "",
        "Publisher": "Starfire",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Down Home Feasts",
        "Authors": "By Williams, Sallie Y. and Cortner, Nancy G.",
        "Description": "",
        "Category": "",
        "Publisher": "Taylor Publishing Company",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Holidays Are Hell",
        "Authors": "By Pettersson, Vicki, Sands, Lynsay, Liu, Marjorie M., and Harrison, Kim",
        "Description": "This holiday, spend quality time with family and loved ones—living and dead . . .There's no place like home for the horrordays—unless you'd prefer a romantic midnight walk through a ghost-infested graveyard . . . or a haunted house candlelight dinner with the sexy vampire of your dreams. The (black) magical season is here—and whether it's a solstice séance gone demonically wrong with the incomparable Kim Harrison, a grossly misshapen Christmas with the remarkable Lynsay Sands, a blood-chilling-and-spilling New Year's with the wonderful Marjorie M. Liu, or a super-powered Thanksgiving with the phenomenal Vicki Pettersson, one thing is for certain: in the able hands of these exceptional dark side explorers, the holidays are going to be deliciously hellish!",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Fabulous No Guilt Desserts (Prevention Magazine's Quick & Healthy Low-Fat Cooking)",
        "Authors": "By Prevention Health Books",
        "Description": "Includes recipes for such dishes as baked apple fans, chocolate-orange hazelnut biscotti, peach upside-down cake, banana-carrot spice bars, apricot and plum slump, and amaretti pudding",
        "Category": " Cooking , Courses & Dishes , Desserts",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Life as We Knew It ",
        "Authors": "By Pfeffer, Susan Beth",
        "Description": "I guess I always felt even if the world came to an end, McDonald’s still would be open.High school sophomore Miranda’s disbelief turns to fear in a split second when an asteroid knocks the moon closer to Earth, like \"one marble hits another.\" The result is catastrophic. How can her family prepare for the future when worldwide tsunamis are wiping out the coasts, earthquakes are rocking the continents, and volcanic ash is blocking out the sun? As August turns dark and wintery in northeastern Pennsylvania, Miranda, her two brothers, and their mother retreat to the unexpected safe haven of their sunroom, where they subsist on stockpiled food and limited water in the warmth of a wood-burning stove.Told in a year’s worth of journal entries, this heart-pounding story chronicles Miranda’s struggle to hold on to the most important resource of all—hope—in an increasingly desperate and unfamiliar world. An extraordinary series debut!Susan Beth Pfeffer has written several companion novels to Life As We Knew It, including The Dead and the Gone, This World We Live In, and The Shade of the Moon.",
        "Category": " Young Adult Fiction , Family , General",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Caring Enough to Forgive--Caring Enough Not to Forgive",
        "Authors": "By Augsburger, David W",
        "Description": "",
        "Category": "",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1981"
        }
    },
    {
        "Title": "The Courts of Europe: Politics, Patronage, and Royalty 1400-1800.",
        "Authors": "By Dickens, Charles",
        "Description": "Reproductions of paintings and photographs of elaborate furnishings, tapestries, and royal seals lavishly illustrate essays on kings, courtiers, mistresses, churchmen, and artists connected with twelve European courts",
        "Category": " History , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "6.9",
        "Publish Date": {
            "Month": "August",
            "Year": "1977"
        }
    },
    {
        "Title": "Films of Alfred Hitchcock",
        "Authors": "By Robert A Harris, Michael S Lasky",
        "Description": "",
        "Category": "",
        "Publisher": "Citadel Press",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "The War Years, 1939-1945: Volume II of Diaries and Letters",
        "Authors": "By Harold Nicolson",
        "Description": "",
        "Category": "",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Pro and Conrad",
        "Authors": "By Conrad, Paul",
        "Description": "Focusing on the loss of leadership in the seventies, this collection of the work of a Pulitzer Prize-winning editorial cartoonist deals with Watergate, Ford's indecisiveness, Carter's vacillations, and such controversial issues as abortion and nuclear power",
        "Category": " History , General",
        "Publisher": "Neff-Kane",
        "Price Starting With ($)": "6.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "Lucky Charm (Lucky Trilogy)",
        "Authors": "By Phillips, Carly",
        "Description": "Long ago, as revenge on a Corwin who stole her son's fiancée, a witch proclaimed an eternal curse that every Corwin male who married for love would be destined to lose his woman and his fortune&#133; Derek thought he could outsmart the long-standing Corwin curse by breaking up with Gabrielle, his first love&#151;and marrying someone else. Now, divorced and broke, all he has left is his teenage daughter and a healthy respect for ancient sorcery. But then Gabrielle returns, determined to defeat the curse and rekindle their passion. But will her stubborn streak and her unwavering love be the lucky charm Derek so desperately needs?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "The Essential Tao : An Initiation into the Heart of Taoism Through the Authentic Tao Te Ching and the Inner Teachings of Chuang-Tzu",
        "Authors": "By Laozi, Cleary, Thomas F., and Chuang-Tzu",
        "Description": "Thomas Cleary's new translation of two Chinese classics describing the essential philosophy and practice of Tao, written long ago as maps of the Way: 'Tao Te Ching' and 'Chuang-tzu'. Cleary's presentation restores the power and mind-opening distinctive",
        "Category": " Religion , Eastern",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "It's Justin Time, Amber Brown (A is for Amber) (Puffin Easy-to-Read, Level 3)",
        "Authors": "By Ross, Tony (ILT) and Danziger, Paula",
        "Description": "Unlike her best friend Justin, Amber Brown loves to measure time and hopes to receive a watch on her seventh birthday, in an illustrated book for beginning readers which features a popular heroine. Reprint.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Mansfield Park (Penguin Classics)",
        "Authors": "By Austen, Jane and Tanner, Tony (EDT)",
        "Description": "The private and social worlds of three families are revealed through the experiences of the heroine, Fanny Price",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1966"
        }
    },
    {
        "Title": "Henry And Mudge In Puddle Trouble",
        "Authors": "By Rylant, Cynthia and Stevenson, Sucie",
        "Description": "Henry and his dog Mudge venture out into the wet and happy world of spring in this second Ready-to-Read book of their adventures.Henry and his 180-pound dog Mudge are best friends forever. And when spring arrives, they're ready for some puddle trouble!",
        "Category": " Juvenile Fiction , Animals , Dogs",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Colder Than Ice (Mordecai Young Series, Book 2)",
        "Authors": "By Shayne, Maggie",
        "Description": "Haunted by guilt, government agent Joshua Kendall gets a chance at redemption when he must keep Elizabeth Marcum, the woman he thought he had accidentally killed years ago, safe from a vengeful cult leader. Original.",
        "Category": " Fiction , Romance , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Mi 5",
        "Authors": "By West, Nigel",
        "Description": "Exposes the secret counterintelligence work of MI5 during World War II, including round-ups of enemy agents and the deceptions practiced on the German High Command",
        "Category": "",
        "Publisher": "Stein & Day Pub",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "August",
            "Year": "1982"
        }
    },
    {
        "Title": "The Sinai Secret (Lang Reilly Thrillers)",
        "Authors": "By Loomis, Gregg",
        "Description": "When scientists who work for him are targeted by a vicious killer, Lang Reilly, determined to find the truth, follows a twisted trail all over the world, where he discovers that the murders are linked to an ancient parchment that unlocks the secrets to a mystery that has puzzled historians for centuries. Original.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Real Fitness: 101 Games and Activities to Get Girls Going! (American Girl Library)",
        "Authors": "By Yoshizumi, Carol (ILT)",
        "Description": "A title with 101 fun ideas for games and activities to keep the female athlete and non-athlete active and fit is divided by On the Playground, Outdoors, Indoors, Around Town, and At the Pool. Original. 40,000 first printing.",
        "Category": " Juvenile Nonfiction , Health & Daily Living , Fitness & Exercise",
        "Publisher": "Amer Girl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Cut The Fat!: More Than 500 Easy and Enjoyable Ways to Reduce Fat From Every Meal",
        "Authors": "By American Dietetic Association (COR)",
        "Description": "Discusses the benefits of a low-fat diet, provides easy-to-prepare low-fat recipes, and offers practical tips for reducing fat in all eating situations and settings, including at home, in a restaurant, and using snack machines",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Frederic Remington: 173 Drawings and Illustrations",
        "Authors": "By Remington, Frederic and Pitz, Henry Clarence",
        "Description": "Superb drawings and illustrations of the American frontier in its last phase, all beautifully reproduced on coated stock. Indians, cavalrymen, cattle, buffalo, cowboys, gold seekers, gamblers, and many others. Includes \"Forsythe's Fight on the Republican River,\" \"Abandoned,\" \"An Ox Train in the Mountains,\" and more.",
        "Category": " Art , Individual Artists , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1972"
        }
    },
    {
        "Title": "Cerveteri.",
        "Authors": "By Moretti, Mario",
        "Description": "",
        "Category": "",
        "Publisher": "Novara, Instituto Geografico de Agostini, [",
        "Price Starting With ($)": "8.5",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Christmas in Washington D C (Christmas Around the World)",
        "Authors": "By WORLD BOOK",
        "Description": "Describes the traditions and customs that are part of the celebration of Christmas in Washington, D.C., as well as presenting crafts, recipes, and carols.",
        "Category": "",
        "Publisher": "World Book Company",
        "Price Starting With ($)": "29.95",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Boy Who Spoke Dog",
        "Authors": "By Morgan, Clay",
        "Description": "When Jack washes up on a mysterious island after a deadlystorm, there's no one to help him, except for the dogs. The sheepdogs on the island have eyes that speak right to Jack's heart, especially one dog—Moxie. But when angry beasts called fangos threaten to destroy the island, Jack and his companions must fight to save it. Once the battle ends, Jack is changed. Will he ever be the same again? Told from Jack's and Moxie's points of view, this adventure reveals how loyalty between boy and dog becomes a means for survival and hope.",
        "Category": " Juvenile Fiction , Animals , Dogs",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Summer of '98",
        "Authors": "By Lupica, Mike",
        "Description": "\"A wonderfully lyrical tale of the season that put poetry back into baseball. . . . The best book yet by America's finest sportswriter.\" -- Pete Hamill  \"Here is what makes Mike Lupica so good—he is a gifted writer with the skills of a first-rate reporter and the honest sentiment of a lifelong fan. Here is what makes this book so good—baseball's summer of '98 provided authentic moments of poetry and passion, the kind of stuff that shines through all the crassness and nonsense, to remind us all why we can still care. I'd say the storyteller is a damn good match for the story.\" -- Bob Costas, NBC Sports  \"This isn't just one of the best books you'll ever read about baseball. It's one of the best books you'll ever read about fathers and sons. And one more thing: in this one, I said everything Mike said I said.\" -- Yoggi Berra  \"No one writes about baseball's glorious sporting scene better than Mike Lupica, and this was one of the greatest glory years of all.\" -- Tom Brokaw, NBC News  From one of sportswriting's best-known commentators comes a funny, moving, and unconventional exploration of a glorious baseball season.   In the summer of '61, Mike Lupica's father left notes for him in the night: Maris hit another, Mantle went two-for-four, the Yanks won. That was Lupica's best summer ever. He thought he'd never have another like it—until the summer of '98, when he found himself leaving notes for his own sons: Sosa hit another, McGwire hit one back. And the Yanks won.   With humor and feeling, Lupica recaptures the season that made everyone stand up and cheer, but not in any ordinary way. His is also a story of fathers and sons—about the golden thread that stretches through baseball and, for Lupica, from his father to himself to his sons. \"I cannot tell you why baseball is passed on the way it is, more than the other sports. I just know it came first with me. It was something I shared with my father, and still share today. It was a special language we had, at the ballpark, in the front seat of a '56 Dodge, watching on television. Talking on the telephone the night McGwire hit No. 62, all that time after we had watched Maris hit No. 61. A love that fits inside a bigger love, like a ball in a mitt.\"",
        "Category": " Sports & Recreation , Baseball , Statistics",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "White Mountain",
        "Authors": "By McCall, Dinah",
        "Description": "When the fingerprints of a murder victim in New York City lead FBI agent Jack Dolan to Abbott House in Braden, Montana, he must fight his growing attraction to owner Isabella Abbott as he tries to unravel the mystery surrounding the guests of this boardinghouse, all of whom are patients of the White Mountain fertility clinic. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Heartbreaker: A Novel",
        "Authors": "By Robards, Karen",
        "Description": "While vacationing in Utah’s mountain wilderness, Lynn Nelson suddenly finds herself having to deal with her teenage daughter Rory’s raging hormones. The object of Rory’s passion is their guide, drop-dead gorgeous Jess Feldman, a man the divorced Lynn instinctively distrusts, even as she shields herself from his blazing baby blues. But after Lynn and Rory fall off a cliff of sheared rock, Jess becomes their only hope. Risking his life, he navigates them through the impenetrable forest thousands of feet below, unwittingly plunging them into a danger more menacing than they could have imagined. Exhausted and injured, all they have is one another—a terrified child, and a man and a woman who rediscover passion in each other’s arms—as they race against time for their lives.Praise for Heartbreaker   “A romantic thriller, not to be missed.”—The Philadelphia Inquirer   “Brilliant . . . Nonstop action combines with humor and romance.”—Romantic Times   “A fast-paced tale.”—The Chattanooga News",
        "Category": " Fiction , Romance , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "A short history of Mexico (Dolphin books)",
        "Authors": "By McHenry, John Patrick",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "Barbie: Love Is in the Air (Step into Reading)",
        "Authors": "By Jordan, Apple and Wolcott, Karen (ILT)",
        "Description": "Love is in the air! Barbie takes a walk and sees lovebirds resting in a tree, a child blowing a kiss to Grandma, and other signs that love is all around her. The simple, rhyming text will make little girls want to step out with Barbie and step into reading on their own.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Fancy Nancy and the Boy from Paris (I Can Read Level 1)",
        "Authors": "By O'Connor, Jane, Preiss-Glasser, Robin (ILT), and Enik, Ted (ILT)",
        "Description": "Nancy is delighted that the new boy in her class is from Paris and sets out to become his friend, then discovers that this Parisian is not quite as fancy as she had thought.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Truth or Dare (Hannah Montana #4)",
        "Authors": "By King, M. C. (ADP)",
        "Description": "Miley Stewart adores all the e-mail that Hannah Montana’s fans send her. But when she gets one from a girl at her own school, Miley takes things a few steps too far. Will Miley’s matchmaking work out? Or will it backfire, and ruin one of her closest friendships?",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Duel of Assassins",
        "Authors": "By Pollock, Daniel",
        "Description": "Taras Arensky, a highly trained killer, is summoned to the White House to protect the Soviet president--who has defected to the United States--from Marcus Jolly, a soldier of fortune in the employ of the Soviet Union",
        "Category": " Fiction , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Barbie as the Island Princess (Barbie) (Step into Reading)",
        "Authors": "By Alberto, Daisy (ADP)",
        "Description": "BARBIE¨ STARS IN another spellbinding DVD! After a shipwreck, Barbie¨ winds up on a deserted island, where she is raised by a red panda, an elephant, and a peacock. When a handsome prince rescues her, Barbie¨ must decide where she fits in best. Illustrated with full-color art from the movie, this Step 2 reader tells the story in the simple language that will help young Barbie¨ fans step into reading on their own.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "The Skeleton Inside You (Let's-Read-and-Find-Out Science 2)",
        "Authors": "By Kelley, True (ILT) and Balestrino, Philip",
        "Description": "What does your skeleton do?Your skeleton helps you leap, somersault, and touch your toes—without it, you would be as floppy as a beanbag! There are over 200 bones living and growing inside you that make up your skeleton. There are also ligaments and joints that hold your bones together, and cartilage in your bendable parts like your ears and your nose. Learn all about what a skeleton can do—because this isn&#39;t some make-believe Halloween skeleton, this is the real skeleton inside you.",
        "Category": " Juvenile Nonfiction , Science & Nature , Anatomy & Physiology",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Knock Me Off My Feet",
        "Authors": "By Donovan, Susan",
        "Description": "Autumn Adams never planned to follow in her mother's footsteps as Chicago's answer to Martha Stewart--she can't cook, doesn't clean, and would rather play soccer than discuss the joys of white bathtub grout. Then some lunatic starts sending her threats in the mail and Audie finds herself under the protection of simmering, sexy Detective Stacey Quinn, a man determined to examine her every nook, cranny, and ex-boyfriend in his effort to find the stalker. A disarming combination of macho cop and sweet charmer, Quinn is hard to resist. But with Audie's bad luck at finding and holding on to Mr. Right, she think it's best to keep her distance...Quinn soon discovers that the real Audie is an alluring blend of fantasy babe and tender-hearted female all wrapped up in what he can only hope is leopard-print underwear.  She's not what he's always pictured for himself, but could she be everything he'll ever need?Digging through Audie's many layers could turn out to be the hottest, craziest, sexiest bit of detective work Quinn has ever attempted...if it doesn't kill him first.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Cowpokes and Desperados (Culpepper Adventures)",
        "Authors": "By Paulsen, Gary",
        "Description": "During a trip to Uncle Woody's Santa Fe cattle ranch, Dunc and Amos overhear a plot to do Woody in, and the two young sleuths gear up to save the ranch. Original.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "El Diario Secreto De Da Vinci",
        "Authors": "By David Zurdo, Angel Gutierrez",
        "Description": "",
        "Category": "",
        "Publisher": "Hermetica",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "In Secret Service: A Novel",
        "Authors": "By Silver, Mitch",
        "Description": "In this debut of a uniquely talented novelist, Ian Fleming's real world of spies, love, passion, and danger is brought to life when a young woman inherits Fleming's long-hidden account of spying during World War II and must finish it to find out why people are trying to kill her.In 1964, James Bond's creator sealed a package containing a manuscript he thought no one would read until fifty years after his death. Ian Fleming was an officer in Britain's Naval Intelligence during World War II, and he had his own adventures to recount. His family ties and his career had taken him to the upper echelons of British and American society and espionage, a world where passionate affairs, exotic locations, and polite cocktail chatter were interlaced with danger, betrayal, and deceit. He'd replicated that world in his famous novels, but this manuscript contained a real spy story that would explode history when its secrets were revealed. He'd chosen the reader, and he'd have to trust she would serve the truth.In 2005, Amy Greenberg -- a young American academic with a glittering future -- is summoned to Ireland to claim the contents of her grandfather's safe deposit box, in which she finds only one thing: a manuscript by Ian Fleming. The pages detail Fleming's involvement in Allied spycraft and contain information so confidential, so potentially explosive, that Amy soon discovers that people on both sides of the Atlantic are willing to kill to maintain its secrecy. As she journeys back home with her precious cargo, Amy finds herself in a race against time -- she must unlock the manuscript's shocking and fascinating secrets and outwit the unknown assailants who would do anything to bury the truth and protect a traitor's name.Peopled with characters including Winston Churchill, Princess Diana, the Duke and Duchess of Windsor, Anthony Blunt, and FDR and illustrated with authenticating documents, In Secret Service is a historical mystery inside a contemporary thriller. The debut of an exciting new writer, this book combines impeccable research with thrilling action, in a brand-new take on espionage suspense.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Cuba, Castro, and the United States",
        "Authors": "By Bonsal, Philip Wilson",
        "Description": "A personal narrative on the diplomatic relations between Cuba and the United States furnishes a profound analysis of the dynamics of Castro's politics",
        "Category": " Political Science , General",
        "Publisher": "Univ of Pittsburgh Pr (Trd)",
        "Price Starting With ($)": "41.65",
        "Publish Date": {
            "Month": "October",
            "Year": "1971"
        }
    },
    {
        "Title": "Time Frames: The Evolution of Punctuated Equilibria (Princeton Legacy Library, 1001)",
        "Authors": "By Eldredge, Niles",
        "Description": "Scientists have recently begun to question one of the pillars of modern thought--Charles Darwin's theory of evolution. Certainly evolution occurs; but if it is a slow, continuous process by which one species gradually modifies itself into a new one, as Darwin believed, why are there so many missing links in the fossil records? Two eminent scientists, Niles Eldredge and Stephen Jay Gould, startled the world by challenging Darwin's cherished beliefs proposing instead that once a species has evolved it rarely undergoes change, and that the evolution of new species occurs only periodically, in relatively rapid spurts. In Time Frames Niles Eldredge explains how his own work with trilobite fossils led him to this unexpected conclusion, and describes the fascinating development of the new theory of punctuated equilibria.Originally published in 1989.The Princeton Legacy Library uses the latest print-on-demand technology to again make available previously out-of-print books from the distinguished backlist of Princeton University Press. These editions preserve the original texts of these important books while presenting them in durable paperback and hardcover editions. The goal of the Princeton Legacy Library is to vastly increase access to the rich scholarly heritage found in the thousands of books published by Princeton University Press since its founding in 1905.",
        "Category": " Science , Life Sciences , Evolution",
        "Publisher": "Princeton University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "The Snare of the Hunter",
        "Authors": "By MacInnes, Helen",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "Sie schrieben mir oder Was aus meinem Poesiealbum wurde.",
        "Authors": "By Brigitte B. Fischer",
        "Description": "",
        "Category": "",
        "Publisher": "Dtv",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Money Mischief: Episodes in Monetary History",
        "Authors": "By Friedman, Milton",
        "Description": "Friedman makes clear once and for all that no one is immune from monetary economics-that is, from the effects of its theory and its practices. He demonstrates through historical events the mischief that can result from misunderstanding the monetary system. Index.",
        "Category": " Business & Economics , Banks & Banking",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Harvest Home: Only Believe/Harvest of Love/The Applesauce War/Sunshine Harvest (Inspirational Romance Novella Collection)",
        "Authors": "By Spaeth, Janet, Barton, Janet Lee, Mayne, Debby, and Kennedy, Ellen Edwards",
        "Description": "",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Blind Eye",
        "Authors": "By Coffey, Jan",
        "Description": "Counting down to a Chernobyl-scale disaster, the clock starts now…Tick…Scientist Marion Kagan is the sole survivor after gunmen attack the facility where her team was working on a top secret project. Wounded and trapped in a collapsed building, Marion must stop radioactive test samples from leaking out and killing millions.…tick…In a Connecticut psychiatric hospital, Marion's twin sister, who has been in a comalike state for years, begins to thrash violently in her bed. When an experimental program is used on her to read the images of her brain, researchers are shocked at what they find.…tick…An American soldier just back from Iraq is searching for direction in his life. While he watches the news about the research facility explosion, he is unaware that fate has just chosen a direction for him—straight into a deadly game of international corporate intrigue.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "May There Be a Road: Stories",
        "Authors": "By L'Amour, Louis",
        "Description": "Spirited American stories gathered together for the first time From the coasts  of Brazil to the borders of Tibet to the very heartland of America, May There Be  a Road gathers ten previously uncollected stories that capture the magnificent scope  and sense of epic adventure that epitomize Louis L'Amour classic fiction. In these  vivid settings L’Amour takes us into the pivotal moments when lives are altered forever,  when men and women face a deadly enemy, find a kindred spirit, or confront their  own mortality.  Among the unforgettable characters we meet here are a hard-living,  hard-drinking freighter captain whose penchant for flying may change the course of  World War II . . . A lonely frontiersman who unexpectedly finds himself the protector  of two orphans . . . A boxer who accepts a gambler’s payoff and then must fight to  redeem himself . . . A detective willing to believe an unproven story in order to  discover a painful truth hidden in a small town. And in the title story L’Amour weaves  the powerful tale of a young Tibetan khan who leads a band of horsemen on a daring  escape across treacherous mountain terrain. At stake is the survival of a people  and an ancient way of life.  Evoking the American spirit of bravery, pride, adventure,  and self-reliance as few writers have, this extraordinary volume proves once again  that L’Amour has set a standard yet to be matched.",
        "Category": " Fiction , Westerns",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Sweet Liberty: Freedom's Cry/Free Indeed/American Pie/Lilly's Pirate (Inspirational Romance Collection)",
        "Authors": "By Dooly, Paige Winship, Dykes, Kristy, Mayne, Debby, Dykes, Kristy (EDT), Dooly, Paige Winship (EDT), Griffin, Pamela (EDT), and Mayne, Debby (EDT)",
        "Description": "",
        "Category": " Fiction , Romance , General",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Mini Moments with Angels",
        "Authors": "By Strand, Robert",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "New Leaf Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Conagher: A Novel",
        "Authors": "By L'Amour, Louis",
        "Description": "As far as the eye can see is a vast, empty horizon. Evie Teale has finally accepted that her husband won’t be coming home. To make ends meet she runs a temporary stage station. But though she is diligent and careful, Evie must prepare for the day when the passengers no longer come and she must protect her children in an untamed country where’s it’s far easier to die than to live. Miles away, another solitary soul battles for survival. Conagher is a lean, dark-eyed drifter who is not about to let a gang of rustlers push him around. While searching the isolated canyons for missing cattle, he finds notes tied to tumbleweeds rolling with the wind. The bleak, spare words echo Conagher’s own whispered prayers for companionship. Who is this mysterious woman on the other side of the wind? Conagher only hopes he can stay alive long enough to find her.",
        "Category": " Fiction , Westerns",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "Day of Atonement (Decker/Lazarus Novels)",
        "Authors": "By Kellerman, Faye",
        "Description": "Peter Decker of the L.A.P.D. never dreamed he'd be spending his honeymoon with his new wife, Rina Lazarus, in an Orthodox Jewish enclave in Brooklyn, New York -- or that a terrible event would end it so abruptly. But a boy has vanished from the midst of this close-knit religious community, a troubled youth fleeing the tight bonds and strictures he felt were strangling him. The runaway, Noam, is not traveling alone. A killer has taken him under his wing to introduce Noam to a savage world of blood and terror. And now Decker must find them both somewhere in America before a psychopath ends the life of a confused and frightened youngster whose only sin was to want something more.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Touchdown Trouble (Fred Bowen Sports Story Series)",
        "Authors": "By Bowen, Fred",
        "Description": "Sam loves football. Most of all he loves the feeling he gets when his team, the Cowboys, are working together—moving closer and closer to the end zone.After an important game, Sam’s pride in his football team begins to fade. The Cowboys beat the Giants in the final play with a touchdown by Sam. But later, Sam and his teammates realize that the winning touchdown was scored illegally. Now the team is divided about what to do. It is only when Sam’s father tells the Cowboys about a famous football game—and similar dilemma—that that Sam knows what to do. But will his teammates agree?Author Fred Bowen continues his Sports Story series with play-by-play action that’s sure to keep readers on the edge of their seats! An afterword tells the real story of the 1940 Cornell-Dartmouth football game, the only college sporting event ever to be decided after the completion of the game.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Peachtree",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "The Saint (Seducer)",
        "Authors": "By Hunter, Madeline",
        "Description": "Nationally bestselling author Madeline Hunter has captivated fans with unforgettable romance novels filled with suspense, seduction, mystery, and love. Now meet \"the Saint\" in this sizzling tale of a mysterious aristocrat, a high-spirited American beauty, and an affair that begins with an innocent temptation...and leads to the most exquisitely dangerous of seductions.Vergil Duclairc was a man used to getting his way.  And as the newly appointed guardian of Miss Bianca Kenwood, he was determined to find her and bring her back to live with his family. The last thing he expected was to find his new ward scandalously costumed and employed as a theatrical singer.  Bianca had no interest in giving up her independence, but there was something compelling about this handsome and brooding viscount who seemed to think he owned her and her inheritance.  As she allows herself to be swept back to his country estate, she discovers that Vergil is a man of secrets and sensuality, and that she is not immune to his inscrutable charm….nor is he to hers.  Suddenly, in a moment that would change everything, they are thrust into a world of dangerous intrigue, where enemies abound and only the passion that ignites between them can save them—or prove their glorious undoing.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "The Country Life Book of Europe's Royal Families",
        "Authors": "By Maria Kroll, Jason Lindsey, Earl of Lichfield",
        "Description": "",
        "Category": "",
        "Publisher": "Hamlyn",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1979"
        }
    },
    {
        "Title": "Danger's Promise (Seduction Romance)",
        "Authors": "By Moon, Marliss",
        "Description": "Blaming the recently widowed warrior Christian de la Croix for the death of his wife, a brutal old man attempts to force his innocent stepdaughter to kill his enemy, but he had never planned on the healing power of love. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Jove",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "That Scandalous Evening: The Governess Brides (Governess Brides Series)",
        "Authors": "By Dodd, Christina",
        "Description": "New York Times bestselling author Christina Dodd spins the captivating tale of a nobleman whose path crosses again with the one woman he absolutely cannot resist . . . .A Disastrous Season A simple statue began the scandal.A Lady Concealed An innocent English miss conceived of it, her hands gliding across the clay, delineating each smoothly defined muscle and sinew, creating a sculpture of the man she worshipped. When the likeness was exposed, along with Miss Jane Higgenbothem&#39;s secret tendre for Lord Blackburn, the ton&#39;s gleeful contempt sent the lady back to the country in disgrace.A Gentleman Revealed Now, a decade later, she&#39;s back in London, as a chaperone to her beautiful niece. But to Blackburn, Jane&#39;s unwitting model, the cool, reticent spinster is still a challenge. She once made the arrogant rake a laughingstock; so why is he tempted to revive an affair that almost began so long ago, on that scandalous evening . . . ?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "MEGIDDO (OMEGA CODE, NO 2)",
        "Authors": "By Paul Crouch and Cynthia Cirile",
        "Description": "",
        "Category": "",
        "Publisher": "Charisma",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "iWant: My Journey from Addiction and Overconsumption to a Simpler, Honest Life",
        "Authors": "By Velez-Mitchell, Jane",
        "Description": "'This is the story of my ch . . . ch . . . changes, which took me from insanity to clarity, from egocentricity to altruism, from alcoholism to activism. These changes have marked an evolution in what I want from this life. I am what I want. What I seek to consume, possess, and achieve is a mirror that reflects my lusts and cravings, values and priorities, and moral boundaries or lack thereof. I am happy to say that what I want today is much less toxic and self-centered than what I used to want. It's taken decades of selfexamination to peel back the layers and figure out what really makes me happy. And while I'm still searching for my ultimate bliss, I know for sure it's not what I once thought it was. It's not alcohol, cigarettes, money, food, sugar, or status symbols: I've consumed all of those in massive quantities, and they've just made me miserable. Now, I want what can't be tasted, smoked, worn, seen, or counted. It's the opposite of material. As sappy as it might sound, what I want is spiritual.'—From the IntroductionIn iWant, Jane Velez-Mitchell shares her candid and engaging story of the true adventure of her life, a journey of self-discovery that is still in full throttle. As she searches for the ultimate joy and freedom that come from living a compassionate life, she challenges all of us to learn from her examples to end destructive behaviors and embrace a meaningful existence alongside one another.",
        "Category": " Self-help , Substance Abuse & Addictions , Alcohol",
        "Publisher": "Hci",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Best New American Voices 2010 (The Best American Series ®)",
        "Authors": "By Kulka, John (EDT), Danford, Natalie (EDT), and Shapiro, Dani (EDT)",
        "Description": "Bestselling novelist and memoirist Dani Shapiro brings her expertise to this year’s volume of Best New American Voices. Now in its eleventh year, this series gathers the best fiction from hundreds of nominations submitted by writing programs such as the Iowa Writers’ Workshop and Johns Hopkins, and from summer conferences such as Sewanee and Bread Loaf. Joshua Ferris, Julie Orringer, Adam Johnson, William Gay, Lauren Groff, Rattawut Lapcharoensap, Maile Meloy, Amanda Davis, and Nam Le are just some of the acclaimed authors whose early work has appeared in this series since its launch in 2000. Discover for yourself the dazzling variety of great fiction being produced in the top writers' workships--with a complete list of contact information included--and find the best new American voices here first.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Galley K.I.S.S. Cookbook",
        "Authors": "By Kanter, Corinne C.",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Favorite Recipes Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Loving Evangeline (American Hero / Silhouette Intimate Moments, No. 607)",
        "Authors": "By Howard, Linda",
        "Description": "Loving Evangeline by Linda Howard released on Oct 25, 1994 is available now for purchase.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Moon Shadows (Jove Romance)",
        "Authors": "By Langan, Ruth Ryan, Roberts, Nora (EDT), Gregory, Jill, and Willman, Marianne",
        "Description": "Romance and magic meet by the light of the moon in this collection of Celtic tales from #1 New York Times bestselling author Nora Roberts and New York Times bestselling authors Jill Gregory, Ruth Ryan Langan, and Marianne Willman.From mysterious warriors to evil sorceresses, from full moon cravings to moon witch spells, these enchanting tales of love and legend, magic and mystery are as menacing and alluring as the moon itself...",
        "Category": " Fiction , Romance , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Gabriel's Horses (Racing to Freedom)",
        "Authors": "By Hart, Alison",
        "Description": "",
        "Category": " Juvenile Fiction , Historical , United States , Civil War Period (1850-1877)",
        "Publisher": "Peachtree Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Eyes Of Fire",
        "Authors": "By Pozzessere, Heather Graham",
        "Description": "Eyes Of Fire by Heather Graham Pozzessere released on Aug 25, 1995 is available now for purchase.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Best American Short Stories 2009",
        "Authors": "By Pitlor, Heidi (EDT) and Sebold, Alice (EDT)",
        "Description": "Edited by critically acclaimed, best-selling author Alice Sebold, the stories in this year's collection serve as a provacative literary \"antenna for what is going on in the world\" (Chicago Tribune). The collection boasts great variety from \"famous to first-timers, sifted from major magazines and little reviews, grand and little worlds\" (St. Louis Post-Dispatch), ensuring yet another rewarding, eduring edition of the oldest and best-selling Best American.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Hodges' Harbrace Handbook",
        "Authors": "By Hodges, John C., Miller, Robert Keith, Hodges, John C. (EDT), Webb, Suzanne Strobeck, and Horner, Winifred Bryan",
        "Description": "",
        "Category": " Language Arts & Disciplines , Grammar & Punctuation",
        "Publisher": "HARCOURT BRACE & CO@",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Day by Day: The Notre Dame Prayerbook for Students",
        "Authors": "By McNally, Thomas (EDT)",
        "Description": "",
        "Category": " Religion , Christian Education , Children & Youth",
        "Publisher": "Ave Maria Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1975"
        }
    },
    {
        "Title": "Backblast",
        "Authors": "By McKeone, Lee",
        "Description": "",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Questar",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Best American Nonrequired Reading 2009 (The Best American Series ®)",
        "Authors": "By Eggers, Dave (EDT), Satrapi, Marjane (INT), and Nathan, Jesse (CON)",
        "Description": "This \"great volume\" highlights the \"very best of this year's fiction, nonfiction, alternative comics, screenplys, blogs and more\" (OK!). Compiled by Dave Eggers and students from his San Francisco writing center, it is \"both uproarious and illuminating\" (Publishers Weekly).",
        "Category": " Literary Collections , American , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Best American Science And Nature Writing 2009",
        "Authors": "By Folger, Tim (EDT) and Kolbert, Elizabeth (EDT)",
        "Description": "Elizabeth Kolbert, one of today's leading environmental journalists, edits this year's volume of the finest science and nature writing. Bringing together promising new voices and prize-winning favorites, this collection is \"a delight for any fan of popular science\" (Publishers Weekly).",
        "Category": " Nature , Essays",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Best American Travel Writing 2009",
        "Authors": "By Winchester, Simon (EDT)",
        "Description": "Acclaimed writer Simon Winchester brings his keen literary eye to this year's volume of the finest travel writing from the past year. \"Full of insights, humor, the exotic and distant, and the ordinary and near\" (Library Journal) this collection finds  \"a perfect mix of exotic locale and elegant prose\" (Publishers Weekly).",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Little Blue Truck",
        "Authors": "By Schertle, Alice and McElmurry, Jill (ILT)",
        "Description": "Beep! Beep! Beep! Meet Blue. A muddy country road is no match for this little pick up--that is, until he gets stuck while pushing a dump truck out of the muck. Luckily, Blue has made a pack of farm animal friends along his route. And they're willing to do whatever it takes to get their pal back on the road.Filled with truck sounds and animals noises, here is a rollicking homage to the power of friendship and the rewards of helping others.",
        "Category": " Juvenile Fiction , Transportation , Cars & Trucks",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Hardest Questions Aren't on the Test: Lessons from an Innovative Urban School",
        "Authors": "By Nathan, Linda F.",
        "Description": "The Boston Arts Academy comprises an ethnically and socioeconomically diverse student body, yet 94 percent of its graduates are accepted to college. Compare this with the average urban district rate of 50 percent. How do they do it? This remarkable success, writes Principal Linda Nathan, is in large part due to asking the right questions—questions all schools can consider, such as: • How and why does a school develop a shared vision of what it stands for? • What makes a great teacher, and how can a principal help good teachers improve?• Why must schools talk openly about race and achievement, and what happens when they do? With engaging honesty, Nathan gives readers a ring-side seat as faculty, parents, and the students themselves grapple with these questions, attempt to implement solutions, and evaluate the outcomes. Stories that are inspirational as well as heartbreaking reveal the missteps and failures—as well as the successes.  Nathan doesn’t claim to have all the answers, but seeks to share her insights on schools that matter, teachers who inspire, and students who achieve.",
        "Category": " Education , Educational Policy & Reform , General",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Winners Take All (Fred Bowen Sports Story Series)",
        "Authors": "By Bowen, Fred",
        "Description": "In order to win an important baseball game, twelve-year-old Kyle claims to have made a difficult catch, which he actually dropped.The unearned win gives Kyle and his team an unfair advantage in the championship series, and everyone considers him the hero of the game. But the praise and attention he receives is not enough to silence his conscience. Kyle is afraid of disappointing his family and teammates with the truth, but he is increasingly uneasy in his deception. Then his sports-crazed grandmother tells him about Christy Mathewson, a pitcher whose reputation for honesty had umpires asking him to make calls during games. In the end Kyle learns a valuable lesson about sportsmanship and realizes that being a hero is only worthwhile if you have earned it.Author Fred Bowen continues his Sports Story series with play-by-play action that’s sure to keep readers on the edge of their seats! An afterword provides the real story of Christy Mathewson.",
        "Category": " Juvenile Fiction , Social Themes , Values & Virtues",
        "Publisher": "Peachtree Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "On the Line (Fred Bowen Sports Story Series)",
        "Authors": "By Bowen, Fred",
        "Description": "Marcus is the high scorer and best rebounder on his basketball team, but he’s not so great at free throws.When Marcus misses four free throws at the end of an important game and his team loses, he begins to lose his confidence on the court. But with the help of the school custodian, Mr. Dunn, he learns about the “granny shot,” an unorthodox way of shooting foul shots, and about Rick Barry, the former NBA star who used it. Marcus tries the shot, but he resists using it because it looks silly. But when he finds himself on the foul line again in a crucial game, will he be able to overcome his pride?Author Fred Bowen continues his Sport Story Series with full court, play-by-play action that’s sure to keep readers on the edge of their seats! A sports history epilogue provides an inside look at NBA player Rick Barry and the infamous granny shot.",
        "Category": " Juvenile Fiction , Sports & Recreation , Basketball",
        "Publisher": "Peachtree",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Very Sleepy Pig",
        "Authors": "By Malam, John",
        "Description": "",
        "Category": "",
        "Publisher": "Templar",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Bizarre Tales from World War II",
        "Authors": "By Breuer, William B.",
        "Description": "Ernest Hemingway stalks U-Boats. A Belgian woman halts the Panzers. Adolf Hitler plays Santa Claus. If you think these are tall tales, guess again. More than 140 of the most bizarre, curious, and downright strange incidents from World War II are documented here based on personal interviews, archives and declassified documents.",
        "Category": " History , Military , World War II",
        "Publisher": "Book Sales, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Absolute Beginner's Guide to VBA",
        "Authors": "By McFedries, Paul",
        "Description": "Visual Basic for Applications (VBA) is a set of tools based on the Visual Basic language. The great thing about using it to enhance Office applications is that it's easier to learn than Visual Basic and it comes with your Office license. After reading this book, the reader will be proficient in the VBA language and will have extensive knowledge of the Office 2003 Object Model. This book will cover all features of the VBA editor and show how to program some of the more useful new features in the Office 2003 applications.    This book assumes no prior programming experience, so even programming novices can get up to speed quickly on the basics of the VBA language. It is very practical and offers the reader tested programs and projects that he or she can implement right away. This book reinforces the reader's learning by presenting useful, end-of-chapter pedagogical resources, including question-and-answer sessions and quizzes, as well as practical exercises that cement and extend the reader's knowledge. It explorers not only the object models of Word and Excel, but also other members of the Office 2003 suite, including PowerPoint, Access, and Outlook.",
        "Category": " Computers , Programming Languages , Visual BASIC",
        "Publisher": "Que Publishing",
        "Price Starting With ($)": "5.48",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "See Jane Score",
        "Authors": "By Gibson, Rachel",
        "Description": "During the day, feisty female sports reporter Jane Alcott makes her living covering the Seattle Chinooks hockey team, including notorious goalie Luc Martineau, while at night, she secretly writes about the scandalous adventures of \"Honey Pie,\" a provocative magazine series. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Smoke Ring",
        "Authors": "By Niven, Larry",
        "Description": "The Citizens Tree people rescue a family of loggers and learn for the first time of a society known as the Admiralty, which may have maintained intact the original computer library of the ship Discipline",
        "Category": "",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "The Silver Gryphon (Mage Wars)",
        "Authors": "By Lackey, Mercedes and Dixon, Larry",
        "Description": "A dozen years of peace have passed in the city of White Gryphon - providing well deserved and much needed security for the people who had lost their homes in the magical Cataclysm which killed the Mage Urtho, creator of the gryphons. But the inhabitants of White Gryphon have not forgotten their long struggles, and have trained an elite guard force, the Silver Gryphons, to protect their city, and if necessary, to join with the army of the Black Kings for mutual defense.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "DAW",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    }
]