[
    {
        "Title": "Power Programming...Turbo C++",
        "Authors": "By Rao, Valluru and Rao, Hayagriva",
        "Description": "",
        "Category": " Computers , General",
        "Publisher": "Mis Pr",
        "Price Starting With ($)": "9.97",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Special Delivery: Featuring Jim Henson's Sesame Street Muppets",
        "Authors": "By Valjean McLenighan",
        "Description": "Despite a series of obstacles, Prairie Dawn delivers a package to the Pigeon Fanciers' Convention in Pinfeather Falls.",
        "Category": "",
        "Publisher": "Western Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Spring Cleaning: Featuring Jim Henson's Sesame Street Muppets",
        "Authors": "By Pat Tornborg",
        "Description": "Bert and Ernie spend an exhausting day doing spring cleaning.",
        "Category": "",
        "Publisher": "Western Pub. Co., in conjunction with Children's Television Workshop",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "New York Days",
        "Authors": "By Morris, Willie",
        "Description": "In New York Days, the long-awaited sequel to the prize-winning North Toward Home, Willie Morris recalls his triumphant, exciting, and ultimately devastating years as the youngest ever editor-in-chief of Harper's, America's oldest magazine, when he was at the center of the nation's stunning cosmos of writing, publishing, politics, and the arts.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Prostate Cancer: Making Survival Decisions",
        "Authors": "By Meyer, Sylvan and Nash, Seymour C., M.D.",
        "Description": "Written by a surviving prostate cancer patient and his urologist, Prostate Cancer: Making Survival Decisions provides not just a physician's overview of the disease, but the compassion, understanding, and frankness of a man who's lived through the experience. From the first symptoms to early diagnosis to life after treatment, journalist Sylvan Meyer details every facet of the disease from the patient's point of view. Along with a clear, complete guide to the latest treatments, techniques, and findings, Meyer outlines the tough decisions the patient will face; describes what it's like to go through all the tests, the treatment, and the recovery; and provides an understanding of how the patient himself can affect the outcome.A superb synthesis of medical knowledge and compassionate advice, Prostate Cancer: Making Survival Decisions will help you understand: The difference between prostate cancer and other diseases of the prostate; the different stages and grades of prostate cancer and how they should affect your decision when choosing a treatment; the risk of recurrence, side effects, and the mortality rates associated with each available treatment; and which doctors you can depend upon and which statistics you can believe.",
        "Category": " Medical , Oncology , General",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "PlayStation Pocket Power Guide Volume 3: Unauthorized (Vvol 3)",
        "Authors": "By Roberts, Nick",
        "Description": "Alundra • Colony Wars • Command & Conquer: Red Alert • Crash Bandicoot 2 • Critical Depth • Croc • Duke Nukem • Formula 1 '97 • Fighting Force • Formula Kart Special Edition • G•Police • Grand Theft Auto • Jersey Devil • Jet Moto 2 • Lost World: Jurassic Park • MDK • Monster Rancher • Mortal Kombat Mythologies: Sub-Zero • Nagano Winter Olympics '98 • NHL '98 • Nightmare Creatures • Nuclear Strike • Oddworld: Abe's Oddysee • One • Pandemonium 2 • Resident Evil 2 • Spawn • Tomb Raider II • WCW NitroAbout the AuthorPrima Creative Services is a team of gaming experts that has produced over 60 strategy guides for Prima Publishing, and collectively has two decades of experience in the gaming magazine field.",
        "Category": " Games & Activities , Video & Electronic",
        "Publisher": "Prima Games",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Power With People",
        "Authors": "By Van Fleet, James K.",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "June",
            "Year": "1969"
        }
    },
    {
        "Title": "PRIZE STORIES 2000 (The O. Henry Prize Collection)",
        "Authors": "By Dark, Larry (EDT)",
        "Description": "An Anchor OriginalThe 80th anniversary edition of \"the nation's most prestigious awards for the short story.\"--The Atlantic MonthlyEstablished early in the last century as a memorial to O. Henry, throughout its history this annual collection has consistently offered a remarkable sampling of contemporary short stories. Each year stories are chosen from large and small literary magazines and a panel of distinguished writers is enlisted to award the top prizes. The result is a superb collection of twenty inventive, full-bodied stories representing the very best in American and Canadian fiction.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Principles of database systems (Computer software engineering series)",
        "Authors": "By Ullman, Jeffrey D.",
        "Description": "",
        "Category": "",
        "Publisher": "Computer Science Press",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Sleeper Spy",
        "Authors": "By Safire, William",
        "Description": "A master sleeper spy, assimilated into American life for twenty years, has been made operative and given control of the vast financial assets of the old KGB - and has disappeared with the fortune. His reputation is deadly, and his manipulation of enormous wealth begins to alter the world's political and financial structure. Although the old KGB has been dismantled, new KGB bosses and old KGB hard-liners bent on reinstating the old guard's lethal techniques are determined to find the sleeper. And so is the world's greatest reporter, Irving Fein.Fein is a character only William Safire could create: driven, mean, funny, always the \"skunk at the garden party.\" Relentlessly resourceful, Fein is always suspicious, always thinking; and his access to the top in politics, the CIA, the media, is the best. But Irving isn't charming, nor is he good on television; and he needs a big story. Viveca Farr is Fein's journalistic opposite - a TV anchorwoman who is popular on the air but lacks stature as a reporter. Working together, they decide to \"walk back the cat\" and break the story of the notorious sleeper spy - even as the sleeper is devising brilliant ways to elude them.",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "A Plague of Angels (A Bantam spectra book)",
        "Authors": "By Tepper, Sheri S.",
        "Description": "West of the land called Artemisia, past mountains, valleys, arroyos, and mesas, atop a sinuous, canyon-climbing road, the Place of Power spreads clawlike at the edge of the chasm. Here are walls to hold out the dragons, ogres, and goblins of the ruined lands. And from here the Witch, Quince Ellel, peers out into a world of faded pageantry, archetypal villages, and gang-filled cities decimated by violence and plague.The scattered remnants of humanity recount legends of the time when most of mankind went to seek a better world. They know that they were left behind, only to face the encroachment of the netherfolk and the terrible, enigmatic creatures called walkers. Yet not even the Witch knows the stunning truth behind the myth and prophecy that fuel her terrible ambition - and she is determined to capture those who will unlock these deepest secrets.In another part of the countryside, a young girl named Orphan is maturing into a beautiful woman in the enchanted village that is her home. And somewhere nearby, a young man named Abasio Cermit is seeking adventure after running away from his family's small farm. Now, as the terrible walkers scour the countryside, Abasio and Orphan begin separate journeys toward each other and the shared destiny that will change their world forever.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Spectra",
        "Price Starting With ($)": "12.5",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Poison: An 87th Precinct Novel",
        "Authors": "By McBain, Ed",
        "Description": "Detective Hal Willis, investigating the deaths of two of Marilyn Hollis's former boyfriends, finds himself falling in love with the woman and uncovers a trail of deception and danger",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Arbor House Pub Co",
        "Price Starting With ($)": "39.56",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "Stryker",
        "Authors": "By Scarborough, Chuck",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan Company",
        "Price Starting With ($)": "13.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The art of editing",
        "Authors": "By Baskette, Floyd K.",
        "Description": "",
        "Category": "",
        "Publisher": "Collier Macmillan",
        "Price Starting With ($)": "5.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The London Yankees: Portraits of American writers and artists in England, 1894-1914",
        "Authors": "By Weintraub, Stanley",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt Brace Jovanovich",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Tales Too Ticklish to Tell: Bloom County",
        "Authors": "By Breathed, Berke",
        "Description": "The people and beasts residing in Bloom County are busy as ever--Opus dances in an all-female nightclub, a Congressional investigation into space invaders is underway, and workers strike for a larger comic book size, in a collection of zany cartoons",
        "Category": " Humor , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "The Knowledge of Water",
        "Authors": "By Smith, Sarah",
        "Description": "Three years ago the enigmatic Alexander von Reisden proposed to the young and very lovely Perdita Halley on a train between Boston and New York. Though she initially accepted, Perdita later declined, fearing that marriage would compromise her dream of becoming a concert pianist. Now Perdita has come to study at the famous Conservatoire in Paris, the endlessly romantic city where Reisden heads an institute that specializes in diagnosis of the insane. Little suspecting the depths of each other's desires, and defying social convention, Perdita and Alexander plunge into an erotic, all consuming affair that seems destined for tragedy. For Perdita cannot marry and attend the Conservatoire, and Alexander remains haunted by guilt and a dark secret from the past. Then an American acquaintance of the two arrives, turning mere gossip into grand scandal.As incessant rain dims the city of light, an intricate network of plots and counterplots swirls around the couple. And a deliciously elegant game of art and life turns deadly serious as a madman stalks first Alexander and then Perdita, threatening to destroy them both in retribution for a murder they know nothing about - or do they?",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "World of Wine",
        "Authors": "By Camarra, Caroline",
        "Description": "",
        "Category": "",
        "Publisher": "Mallard Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "The World of the Bible (Bible Handbook, Vol. 1)",
        "Authors": "By Woude, A. S. Van Der (EDT)",
        "Description": "Describes the geography of the Holy Land, discusses archaeological finds in the region, looks at the history of the Holy Land and its religious institutions",
        "Category": " Religion , General",
        "Publisher": "Eerdmans Pub Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Tole-Painted Outdoor Projects: Decorative Designs for Gardens, Patios, Decks & More",
        "Authors": "By Bingham, Areta",
        "Description": "With all this creativity and practical help, you'll soon have your outdoor space filled with painted tables, vases, stepping stones, and other stunning items. And, special projects like a pretty violet and ivy table will beautify any patio, as will a lovely layered-flowers chair. Color worksheets and detailed patterns help decorate an urn fountain with big blossoms, adorn a planter with hibiscus, and take a shine to a bright hydrangeas silver birdhouse. 19 terrific ideas in all! A Main Selection of BOMC's Crafters Book Club & F&W's Book Clubs.",
        "Category": " Crafts & Hobbies , Painting",
        "Publisher": "Sterling/Chapelle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Reminiscences of a Soldier's Wife: An Autobiography (Shawnee Classics)",
        "Authors": "By Logan, John A., Jr.",
        "Description": "\"To tell my own story is to tell that of my famous husband, General John A. Logan,\" explains Mary S. Logan in the preface to her autobiography.  Married to John A. Logan for thirty-one years, Mary Logan shared in her distinguished husband’s career as a prosecutor in southern Illinois, as a Civil War general, and as a senator from Illinois. She observed firsthand the extraordinary events before, during, and after the Civil War, and she knew personally those world leaders who held the power to shape history. After the death of her husband, she maintained her influence in Washington, D.C. \"Under the brightest and darkest skies,\" she explains, \"I have passed than a half-century at the national capital.\"  Born in 1838, Logan writes of her early days growing up in southern Illinois through 1913, when this book was first published. A skillful observer, she recounts events that are personal, regional, and national in scope. In charming detail, she shares her courtship and subsequent marriage to a young prosecutor from Jackson County and the births of their children. She writes proudly of the Lincoln-Douglas debates in 1858 and her husband’s election to the Thirty-seventh Congress that same year. Logan tells of the coming of the Civil War and of her husband—formerly a Democrat and an enemy of Lincoln—casting his fate with the Union and raising a regiment in southern Illinois. She poignantly describes her brother’s defection to the Confederate Army, her life in war-torn Cairo, Illinois, and her horror at her husband’s severe war wounds. She recounts the battles, the political campaigns, and Lincoln’s reelection and subsequent assassination from her point of view—and, as the wife of a politician and general, hers is a decidedly privileged perspective.  In a position to observe and to participate in events ranging from momentous to minute throughout the latter half of the nineteenth and early twentieth centuries, she reports the essential episodes of history with the flair of journalism, a career she in fact embraced after the death of her husband. She writes movingly of a wounded captain on the road to recovery who suddenly died when the minié shifted next to his lung, amusingly of the excuses soldiers invented to wrangle a pass to town, and elegantly of her trips to Europe and of the pomp and circumstance of the parties attended by the great men and women of the time. Drawing on events grand and small, she re-creates history as only a skillful writer who was in the right place at the right time could.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Southern Illinois University Press",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Green Frog",
        "Authors": "By Hogeweg",
        "Description": "",
        "Category": "",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "8.36",
        "Publish Date": {
            "Month": "December",
            "Year": "1979"
        }
    },
    {
        "Title": "The Chain Gang: One Newspaper Versus the Gannett Empire",
        "Authors": "By McCord, Richard",
        "Description": "\"They're closing in on me, Dick, and I'm afraid they're going to get me,\" said Frank Wood, publisher of the Green Bay News-Chronicle, in a phone call to his friend and colleague, Richard McCord. Drained of cash and spirit, Wood could not hold out much longer against a devouring giant, the Gannett Company. As editor and publisher of the nationally distinguished weekly Santa Fe Reporter, McCord had successfully fended off Gannett's \"Operation Demolition\" when it moved into town. Now Wood was seeking the help of a survivor.Startling case histories of the dubious tactics practiced by Gannett, unsparing insights into the newspaper industry, and harsh conclusions all come together in the dramatic story of these two men's efforts to save the small Green Bay daily from being obliterated at the hands of the nation's largest newspaper chain. Their success is a metaphor for one of the oldest triumphs of the world: that of David over Goliath.",
        "Category": " Language Arts & Disciplines , Journalism",
        "Publisher": "Univ of Missouri Pr",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Wee Sing Bible Songs",
        "Authors": "By Beall, Pamela Conn",
        "Description": "",
        "Category": " Juvenile Nonfiction , Music , General",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "The Cat Who Saw Stars",
        "Authors": "By Braun, Lilian Jackson",
        "Description": "Qwilleran, Koko, and Yum Yum are hoping for a peaceful month of July spent sitting on the porch of their cabin by a lake in Mooseville. It's not so far from home - but far enough away from the bustle and bustle of Pickax that Qwill figures he might actually find some peace and quiet.When rumors begin to circulate that UFOs are responsible for the disappearance of a stray backpacker, whose body is later discovered on the lakeshore, Qwill finds it difficult to maintain \"vacation\" mode.Then, of course, there's the knitting craze, which is attracting some very unlikely members of the community, and some highly innovative plans for this year's Fourth of July parade, and a dog-cart race. Yet all of this is just par for the course in slightly out-of-whack Moose County....Things become downright eerie when Koko begins to pass hours on the porch in the dark, watching the sky for stars - or something. And as the inexplicable goings-on get stranger and stranger, Qwill starts to wonder who or what is in fact responsible, if not extraterrestrial visitors.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "There Was a Little Girl",
        "Authors": "By McBain, Ed",
        "Description": "After Matthew Hope slips into a coma--the result of a drive-by shooting--his friends, private eye Warren Chambers and police detective Morris Bloom--must follow in his investigative footsteps to discover why he was shot. All signs point to the local circus--an underworld of offbeat sex, drugs, blackmail, murder, and in the center of it all, there was a little girl.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Person, The Revised",
        "Authors": "By Lidz, Theodore",
        "Description": "Traces the development of human personality from infancy to old age, paying attention to occupational choice, marital adjustment, and parenthood",
        "Category": " Psychology , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1976"
        }
    },
    {
        "Title": "Teach Yourself C in 21 Days",
        "Authors": "By Jones, Bradley L. and Aitken, Peter G.",
        "Description": "Offering quick summaries of all C statements in shaded syntax boxes, Question and Answer sections, and Do and Don't sections, a guide to C success features lessons that require two to three hours or less to complete. Original.",
        "Category": " Computers , General",
        "Publisher": "Sams",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Fermi Solution: Essays on Science",
        "Authors": "By Von Baeyer, Hans Christian",
        "Description": "From acclaimed science writer Hans Christian von Baeyer, the National Magazine Award - winning author of Taming the Atom, comes a magnificently written book that is a spectacular journey through the workings of the universe and into the minds of the creators of the twentieth-century-world picture, from the legendary geniuses, such as Albert Einstein, Werner Heisenberg, and Richard Feynman, to the current generation of scientists who follow in their footsteps.The Fermi Solution is a collection of dramatic tales bristling with subplots, vivid characters, and suspenseful twists and turns. Its subjects range across the spectrum of physical science, from the monumental - the Superconducting Super Collider and the Big Bang - to the enigmatic, such as crystals with impossible structures and the quest for the absolute zero of temperature. The drama of scientific research, the thoughts and feelings of its practitioners, the thrill of discovery, and the indomitable human urge to conquer the unknown form the rich background for the search for meaning that unites scientists and nonscientists alike.With wit and incisive intelligence the author pursues his central question: what do the breakthroughs and revolutionary insights at the cutting edge of science mean for ordinary people? In the course of this pursuit he explores the lessons that Nobel laureate Enrico Fermi's style of research teach us about the art of living, shows how CAT scans illustrate Richard Feynman's definition of the scientific method, and points out the visible clues for Einstein's theory of relativity that can be found in amusement parks. His fresh and illuminating images are drawn from the world of literature as often as from children's playgrounds and from daily life.",
        "Category": " Science , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "The 20-Minute Gardener: The Garden of Your Dreams Without Giving up Your Life, Your Job, or Your Sanity",
        "Authors": "By Asher, Marty and Christopher, Thomas",
        "Description": "A funny, user-friendly guide for gardeners on a time budget offers simple, organic techniques and inexpensive twenty-minute projects, from choosing the simplest plants to getting rid of pests with peanut butter. 35,000 first printing. Tour.",
        "Category": " Gardening , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Revolution of Little Girls",
        "Authors": "By Boyd, Blanche McCrary",
        "Description": "No matter how hard she tries, Ellen Burns will never be Scarlett O'Hara. As a little girl in South Carolina, she prefers playing Tarzan to playing Jane. As a teenage beauty queen she spikes her Cokes with spirits of ammonia and baffles her elders with her Freedom Riding sympathies. As a young woman in the 1960s and '70s, she hypnotizes her way to Harvard, finds herself as a lesbian, then very nearly loses herself to booze and shamans. And though the wry, rebellious, and vision-haunted heroine of this exhilarating novel may sometimes seem to be living a magnolia-scented Portrait of the Artist as a Young Woman, Blanche McCrary Boyd's The Revolution Of Little Girls is a completely original arid captivating work.",
        "Category": " Fiction , LGBT , Gay",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "The concise atlas of wine",
        "Authors": "By BORN, Wina",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner",
        "Price Starting With ($)": "12.46",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "The World Book Year Book, 1990 , A Review of the Events of 1989",
        "Authors": "By World Book Inc",
        "Description": "",
        "Category": "",
        "Publisher": "World Book Inc",
        "Price Starting With ($)": "7.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Book of Love Symbols: Prospero's Library",
        "Authors": "By Bently, Peter",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The computer security handbook",
        "Authors": "By Baker, Richard H.",
        "Description": "Recommends a variety of methods for making computerized business and personal records safe from access by unauthorized people",
        "Category": "",
        "Publisher": "TAB Professional and Reference Books",
        "Price Starting With ($)": "6.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Business of Circumference: A Kaleidoscope",
        "Authors": "By Gallagher, Joseph",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Christian Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "The ABC's of Wordperfect 5.1 for DOS",
        "Authors": "By Neibauer, Alan R.",
        "Description": "",
        "Category": " Computers , Desktop Applications , Word Processing",
        "Publisher": "Sybex Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Just-Right Family (Cabbage Patch Kids)",
        "Authors": "By Callen, Larry and Gailen, Judy (ILT)",
        "Description": "Laura Sue is overjoyed when she is finally adopted by the same family as her best friend, Beth Marie",
        "Category": "",
        "Publisher": "Parker Brothers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "Todd Walker: Photographs (Untitled Number 38)",
        "Authors": "By Walker, Todd",
        "Description": "",
        "Category": " Photography , General",
        "Publisher": "Friends of Photography Bookstore",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "The Hundredth Monkey",
        "Authors": "By Keyes Jr., Ken",
        "Description": "",
        "Category": "",
        "Publisher": "Vision Books",
        "Price Starting With ($)": "13.47",
        "Publish Date": {
            "Month": "October",
            "Year": "1982"
        }
    },
    {
        "Title": "The Wedding of Mistress Fox",
        "Authors": "By Grimm, Wilhelm, Grimm, Jacob, Bailey, Philip H., and Bishop, Gavin (ILT)",
        "Description": "As she rejects suitor after suitor, the recently widowed Mistress Fox almost despairs of finding a new husband with the same wonderful qualities as the late Mr. Fox.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "NorthSouth",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "The American Flag",
        "Authors": "By Sollod, Celeste (EDT) and Smith, Whitney",
        "Description": "This deluxe gift set features a large 3-by-5 foot American flag, perfect for showing off your patriotism. The perfect gift for summer visiting!  15 x 10 x 7/8.",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "Friedman/Fairfax Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "The Complete Jesus",
        "Authors": "By Mayotte, Ricky Alan",
        "Description": "A unique, single-volume compilation of the complete quotations attributed to Jesus is culled from twenty-four ancient documents, including the Gnostic Gospels, demonstrating the wide variety of Jesus's teachings circulating in ancient times. $20,000 ad/promo. IP.",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Steerforth Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Bigger Bang",
        "Authors": "By Lidsey, James E.",
        "Description": "In the last few years, scientists have begun to answer some of the most fundamental questions about the origin and early evolution of the universe. This book presents a fresh, engaging, and highly readable introduction to these ideas. Using novel, down-to-earth analogies, author James Lidsey deftly steers us along a journey back in time to the very origin of the universe. We are introduced to the fascinating ideas scientists are currently developing to explain what happened in the first billion, billion, billion, billionth of a second - the 'inflationary' epoch. Along the way we stop off to review the latest ideas on superstrings, parallel universes, and the ultimate fate of our universe. Lucid analogies, clear and concise prose, and straight-forward language make this book a delight to read. It makes accessible to the general reader some of the most profound and complex ideas about the origin of our universe currently challenging the world's best scientists.",
        "Category": " Science , Cosmology",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The New Vegetarian Cookbook",
        "Authors": "By Null, Gary",
        "Description": "More than one hundred original recipes, as well as planning, purchasing, and preparation advice, cover every aspect of a vegetarian diet, including favorite standbys and new, health-food dishes",
        "Category": " Cooking , Vegetarian",
        "Publisher": "Collier Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1980"
        }
    },
    {
        "Title": "The Guardian",
        "Authors": "By Eidson, Bill",
        "Description": "In The Guardian, Bill Eidson has crafted a thriller that shows the chilling consequences of random violence hitting home in a quiet suburb. Set in the Boston area, this book takes off like a rocket in the first chapter.Eleven-year-old Janine Stearns and her parents stop into a convenience store to buy ice cream. Moments later a masked gunman walks in, robs the store, shoots the clerk, and, seeing her father's BMW, kidnaps Janine. What begins as a coincidence coalesces into a whole world of dark interconnections and horrifying possibilities. Nothing is as it appears. It is left to Ross Sterns, Janine's uncle and guardian, to rescue Janine and end the nightmare of senseless violence.",
        "Category": " Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "The Passover Table: New and Traditional Recipes for Your Seders and the Entire Passover Week",
        "Authors": "By Penina (PHT) and Friedland, Susan R.",
        "Description": "Passover has always tested the ingenuity of even the most creative Jewish cooks. With The Passover Table, what was once a challenge becomes a delight. Here are more than forty delicious recipes, both traditional and modern, for celebrating the holiday, organizing seders, and preparing meals throughout the Passover week.  Susan R. Friedland offers marvelous and reliable versions of all the classic fare, including Matzo Balls and Chicken Soup, Gefilte Fish, and Borscht, as well as contemporary dishes to update your Passover table, such as Spinach Pie, Turkish Sweet and Sour Artichokes, and Tangine of Chicken.  With its thorough explanations, lavish full-color photography, and delicious recipes, The Passover Table is the only book you need to celebrate the beloved and joyous commemoration of the Exodus.",
        "Category": " Cooking , Reference",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Abortion: Toward an Evangelical Consensus (A Critical Concern Book)",
        "Authors": "By Fowler, P. B. S.",
        "Description": "Describes the arguments on each side of the abortion question, examines the teachings of the Scriptures, and argues that compassion has been a barrier to consensus",
        "Category": " Religion , General",
        "Publisher": "Multnomah Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The HP Way: How Bill Hewlett and I Built Our Company",
        "Authors": "By Packard, David, Kirby, David, and Lewis, Karen R.",
        "Description": "In the fall of 1930, David Packard left his hometown of Pueblo, Colorado, to enroll at Stanford University. There, he befriended another freshman, Bill Hewlett.After graduation from college, Hewlett and Packard decided to throw their lots in together. They tossed a coin to decide whose name should go first on the notice of incorporation, then cast about in search of products to sell.Today, the one-car garage in Palo Alto that housed their first workshop is a California historic landmark: the birthplace of Silicon Valley. And Hewlett-Packard has produced thousands of innovative products for millions of customers throughout the world. Their little company employs 98,400 people and boasts constantly increasing sales that reached $25 billion in 1994.While there are many successful companies, there is only one Hewlett-Packard. Because from the very beginning, Bill and Dave had a way of doing things that was contrary to the prevailing management strategies. In defining the objectives for their company, Packard and Hewlett wanted more than profits, revenue growth, and a constant stream of new, happy customers.",
        "Category": " Business & Economics , Corporate & Business History",
        "Publisher": "Collins",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Mastering dBASE III Plus: A Structured Approach",
        "Authors": "By Townsend, Carl",
        "Description": "",
        "Category": " Computers , General",
        "Publisher": "Sybex Inc",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1986"
        }
    },
    {
        "Title": "Sykesville (Maryland): past and present (History)",
        "Authors": "By Barrow, Healan",
        "Description": "",
        "Category": "",
        "Publisher": "A Greenberg Publication",
        "Price Starting With ($)": "11.08",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "The Top One Hundred Pasta Sauces",
        "Authors": "By Seed, Diane",
        "Description": "Five chapters  of recipes for vegetable, fish and shellfish, cheese, meat, and special occasion sauces. Graced with color paintings. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Cooking , Specific Ingredients , Pasta",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "My Present Age",
        "Authors": "By Vanderhaeghe, Guy",
        "Description": "Overweight and on the downward slope of thirty, abandoned by his wife and unemployed, rude and funny, Ed, the New Man gone awry, embarks on a quest to locate his ex-wife Victoria",
        "Category": " Fiction , General",
        "Publisher": "Ticknor & Fields",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Portrait of the San Francisco/Oakland Bay Area (Portrait of America Series)",
        "Authors": "By Foster, Lee and Braun, Ernest",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Graphic Arts Center Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1981"
        }
    },
    {
        "Title": "Old Alexandria: Where America's Past Is Present",
        "Authors": "By Voges, Nettie A.",
        "Description": "",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Epm Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1975"
        }
    },
    {
        "Title": "The Future of Political Islam",
        "Authors": "By Fuller, Graham E.",
        "Description": "September 11; vitriolic rhetoric against the United States by prominent Muslims; the war against terrorism shifts from Afghanistan to the Philippines and Indonesia. It is easy to believe Islam and Muslims are enemies of the West; it is also wrong.This sweeping survey of trends in the Muslim world contends that the issue is not whether Islam plays a central role in politics, but what Muslims want. To focus on radicalism and extremism blinds us from another trend: liberal political Islam.Proponents of liberal political Islam emphasize human rights and democracy, tolerance and cooperation. They face an uphill struggle as authoritarian regimes oppress opposition and use Islam to justify their undemocratic rule. As people are denied avenues to participate and criticize, as secular ideologies have failed, religion has come to play a central role in politics. The outcome of the struggle between extremists and liberals will determine the future of political Islam.September 11; vitriolic rhetoric against the United States by prominent Muslims; the war against terrorism shifts from Afghanistan to the Philippines and Indonesia. It is easy to believe Islam and Muslims are enemies of the West; it is also wrong.This sweeping survey of trends in the Muslim world contends that the issue is not whether Islam plays a central role in politics, but what Muslims want. To focus on radicalism and extremism blinds us from another trend: liberal political Islam.Proponents of liberal political Islam emphasize human rights and democracy, tolerance and cooperation. They face an uphill struggle as authoritarian regimes oppress opposition and use Islam to justify their undemocratic rule. As people are denied avenues to participate and criticize, as secular ideologies have failed, religion has come to play a central role in politics. The outcome of the struggle between extremists and liberals will determine the future of political Islam.",
        "Category": " Religion , Islam , General",
        "Publisher": "Palgrave Macmillan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Warrior Wisdom",
        "Authors": "By Moore, Daniel (EDT)",
        "Description": "Gathers quotations about masculine values, adolescence, being a son, husband, and father, work, love, war, old age, wisdom, and death",
        "Category": "",
        "Publisher": "Running Pr Book Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Faxable Greeting Cards",
        "Authors": "By Caldwell, John",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "Workman Pub Co",
        "Price Starting With ($)": "8.03",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Mixed Signals",
        "Authors": "By Higgs, Liz Curtis",
        "Description": "Love Is on the Air  Belle O’Brien, the woman behind the warmest voice in Virginia radio, has one problem: Her oldies show on WPER-FM is a solid-gold hit, but her love life, at thirty-two years and counting, is an off-the-charts disaster. The pickings are slim in small-town Abingdon. Will it be smooth-talking Patrick Reese, the man who launched her radio career a decade earlier? Moody but handsome David Cahill, the chief engineer with a mysterious past and a new life in Christ? Or Matthew the Methodist, her pastor across the street? Surrounded by an on-air cast of colorful characters, Belle’s journey toward joy is filled with humor, heartache, and endless surprises. Norah Silver-Smyth, her friend and encourager, will join Belle in discovering that it’s never too late to listen to your heart.  “One of the most delightful surprises I’ve had all year—  a first novel that moved me to both laughter and tears!”  Susan Wiggs, USA Today bestselling author  Love Is on the Air Belle O’Brien, the woman behind the warmest voice in Virginia radio, has a problem: Her oldies show is a solid-gold hit, but her love life is an off-the-charts disaster.  Her prospects for a husband are small-town slim. Will it be smooth-talking Patrick Reese, who launched her radio career? Moody but handsome David Cahill, WPER’s enigmatic broadcast engineer? Matthew the Methodist, her oh-so-available pastor? Or the mysterious radio listener who signs his letters, “All Ears in Abingdon”?  As Belle embarks on a journey toward joy, Norah Silver-Smyth, proprietor of The Silver Spoon, cooks up her own delicious recipe for happily-ever-after in this winsome tale filled with humor, tenderness, endless surprises…and two happy endings!  “Liz Curtis Higgs…has succeeded magnificently with her first fictional effort.”  K-LOVE News & Reviews  “Christian fiction isn’t known for humorous books, so this title is a special joy.”  Library Journal  “Great laughs, good solid story, surprises and twists, and great characters.”  Francine Rivers, bestselling author of Redeeming Love  “Absolutely wonderful. An outstanding and heart-warming debut!”  Angela Elwell Hunt, author of The Note  “Mixed Signals was my sweet reward at the end of my demanding days…a most satisfying treat!” Jane Johnson Struck, Senior Editor, Today’s Christian WomanStory Behind the BookBefore she became a platform speaker, Liz Curtis Higgs spent ten years as a successful radio personality, moving town to town, up and down the dial. In Mixed Signals, Liz draws on that memorable decade to create WPER, an oldies station in Abingdon , Virginia . The Barter Theater was included with thanks to her experience with amateur drama productions, and the ten hot-air balloon ascents she weathered while a broadcaster were also put to use. Her heroine, Belle, marries a radio station engineer…just as Liz did nearly twenty years ago. But there the parallels end in this winsome tale with two happy endings.",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Prayer, Faith, and Healing: Cure Your Body, Heal Your Mind and Restore Your Soul",
        "Authors": "By Caine, K. Winston and Kaufman, Brian Paul",
        "Description": "Prayer, Faith, and HealingWhen you're physically sick, when you're emotionally ill, your first thought usually is to turn to a doctor, take a pill, let modern medicine make it all go away. But as a growing body of scientific evidence shows, the best cure may lie in prayer, faith, and your relationship with God.Yes, prayer and faith can heal. They're good for your health, for your outlook, and for your overall physical and mental well-being. More than 200 studies prove it.But how do you tap into this amazing well of spiritual energy?The answers lie in this book.Drawing on the wisdom of more than 160 of America's top religious leaders, counselors, doctors, and scientists, Prayer, Faith, and Healing explains how you can use the dynamic forces of faith and prayer to change yourself forever. It teaches you nearly 30 ways to expand your prayer life. It shows you how to be happier and have more loving relationships. Most of all, it explains exactly how you can use the power of belief to solve more than 50 of the toughest emotional and physical problems you'll ever encounter.Whether you're experienceing loneliness, grief, fatigue, or fear; whether you're facing surgery or coping with a serious illness; whether you're beset with financial problems, divorce, weight problems, or more, this book will show you how to deal with it.There are more than 500 tips in all, and each one is precise, positive, and practical.No other book has ever brought together so much wisdom from so many spiritual experts. And no other book has ever offered such useful, quick-to-apply spiritual tips for the challenges you'll face.Prayer, Faith, and Healing will reaffirm your faith if you already believe. It will start you on a path to belief if you have doubts. And it will show you how to integrate faith and science, prayer and counseling, spirituality and health to handle whatever challenge you face.Tap the power of prayer and faith . . . . . . to heal whatever ails youPrayer and faith can be potent cures for a whole host of emotional and physical problems. Hundreds of scientific studies prove it! But how do you access this hidden strength? Prayer, Faith, and Healing will show you.Advice from more than 160 of America's top religious leaders, counselors, doctors, and scientistsMore than 500 tips for handling anger, addiction, depression, divorce, grief, stress, infidelity, financial problems, and over 40 other conditionsPlus, nearly 30 ways to build a more meaningful prayer life",
        "Category": " Religion , Prayerbooks , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Hugs to Brighten Your Day : Stories, Sayings, and Scriptures to Encourage and In",
        "Authors": "By Weiss, Leann, Moore, Ashley, and Robertson, Korie",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Howard Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Dramatic Faux Finishes",
        "Authors": "By Hennigs, Louise, Niven, Marina, Heath, Warren (PHT), and Von Schaewen, Deidi (PHT)",
        "Description": "The authors of the award-winning Painting Techniques & Faux Finishes continue their overview of decorative painting, covering a wide variety of materials, textures, colors, and effects, as well as surface preparation and step-by-step instruction in a wide variety of techniques. Original.",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Creative Pub Intl",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Between Two Worlds: Realism, Idealism, and American Foreign Policy After the Cold War",
        "Authors": "By Callahan, David",
        "Description": "With Between Two Worlds, David Callahan, author of Dangerous Capabilities: Paul Nitze and the Cold War, has written a provocative analysis of one of the most critical issues facing our nation: what course America's foreign policy should take in the post-Cold War era.The fall of the Soviet Union and an upsurge in global violence have left American foreign policy adrift in recent years. Exhaustively researched and elegantly written, Between Two Worlds unravels a muddled debate to argue that the United States now faces a basic choice between the foreign-policy strategies of realism and idealism. Realists, still dominant in Washington even with the Cold War's end, are preoccupied with safeguarding global order by keeping U.S. forces deployed in Europe and Asia and by preparing to fight new enemies in the Third World. They insist that America must continue the production of weapons begun during the 1980s and maintain defense budgets at near-Cold War levels.Idealists, Callahan among them, bring a more hopeful view to reinventing foreign policy. Callahan mounts a sweeping critique of realism to show how policymakers may be exaggerating the threats confronting the United States. Updating the idealist tradition pioneered by Woodrow Wilson, Between Two Worlds argues that U.S. actions abroad can and should be guided by the values that Americans treasure at home. Callahan's bold strategy for overhauling America's foreign policy would use some funds now spent on defense for new efforts to help fledgling democracies, strengthen international institutions, and promote sustainable development in the Third World.A controversial look at current U.S. foreign policy and a blueprint for more effective American leadership into the twenty-first century, Between Two Worlds is a valuable contribution to one of the most urgent tasks facing us.",
        "Category": " Political Science , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "A Groom with a View (Jane Jeffry Mysteries, No. 11)",
        "Authors": "By Churchill, Jill",
        "Description": "Caterers Jane and Shelly are pleased as punch to host a lavish wedding in the old monastery, but when a sudden thunderstorm knocks out the electricity, murder breaks the guests' nuptial spell, and Jane steps in to investigate. 20,000 first printing.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Duty called me here: The soldier comrades of the National Museum of the Civil War Soldier",
        "Authors": "By Jr., Arthur W. Bergeron",
        "Description": "",
        "Category": "",
        "Publisher": "The Museum",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Friendly Animals",
        "Authors": "By Karl Patterson Schmidt",
        "Description": "",
        "Category": "",
        "Publisher": "M. A. Donohue and Company",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1947"
        }
    },
    {
        "Title": "Leading People: Transforming Business from the Inside Out",
        "Authors": "By Brown, Paul B. and Rosen, Robert H.",
        "Description": "In Leading People: Robert Rosen, who has spent the last fifteen years working with America's leaders and our largest corporations, presents a blueprint for the kind of leadership that results in healthy, profitable organizations.Leading People presents eight principles of leadership - vision, trust, participation, learning, diversity, creativity, integrity, and community. Rosen shares his insights as well as the lessons of thirty-six of the nation's outstanding leaders, among them: Alan Mulally, head of the Boeing 777 project; Barry Alvarez, head football coach at the University of Wisconsin; and Shirley DeLibero of the New Jersey Public Transit Authority. The visionary leaders are changing the landscape of business, and are demonstrating that healthy values, practices, and relationships produce superior results.Leading people is hard work. It is full of tensions and trade-offs, celebrations and disappointments. As Rosen demonstrates through rich stories and insightful analysis, the most successful leaders have a profound understanding of themselves, of the motivations of people around them, and of the external challenges their enterprises face.What America needs to thrive in the next century is not a new management practice or productivity program: what we need is new leadership. Leading People is a call for and a lesson in this new leadership.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.73",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Mountain Songs: Selections from the Psalms in the New King James Version",
        "Authors": "By Briscoe, Stuart and Briscoe, Jill",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Nelson & Sons",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "December",
            "Year": "1982"
        }
    },
    {
        "Title": "The Individual, Sex, and Society",
        "Authors": "By Baltimore, Johns Hopkins Press",
        "Description": "",
        "Category": "",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "5.55",
        "Publish Date": {
            "Month": "May",
            "Year": "1969"
        }
    },
    {
        "Title": "Modern Prevention: The New Medicine",
        "Authors": "By Rosenfeld, Isadore",
        "Description": "Drawing on the latest scientific findings, the \"CBS Morning News\" medical correspondent explains practical, proven measures that can help prevent the common cold, osteoporosis, ulcers, strokes, heart disease, and other illnesses",
        "Category": " Medical , General",
        "Publisher": "Linden Pub",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "The Years with Laura Diaz",
        "Authors": "By Fuentes, Carlos and MacAdam, Alfred (TRN)",
        "Description": "A radiant family saga set in a century of Mexican history, by one of the world's greatest writers.Carlos Fuentes's hope-filled new novel sees the twentieth century through the eyes of Laura D'az, a woman who becomes as much a part of our history as of the Mexican history she observes and helps to create. Born in 1898, this extraordinary woman grows into a wife and mother, becomes the lover of great men, and, before her death in 1972, is celebrated as a politically committed artist. A complicated and alluring heroine, she lives a happy life despite the tragedies and losses she experiences, for she has borne witness to great changes in her country's life, and she has loved and understood with unflinching honesty.In his most important novel in decades, Carlos Fuentes has created a world filled with brilliantly colored scenes and heartbreaking dramas. The result is a novel of subtle, penetrating insight and immense power.",
        "Category": " Fiction , Historical",
        "Publisher": "Harvest Book",
        "Price Starting With ($)": "6.1",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Healing Wounded Emotions: Overcoming Life's Hurts (Inspirational Reading for Every Catholic)",
        "Authors": "By Padovani, Martin H.",
        "Description": "",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Twenty-Third Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "The Vegetarian Times Cookbook",
        "Authors": "By MacMillan Publishing Editors",
        "Description": "Offers recipes for meatless appetizers, soups, salads, main dishes, and side dishes, and gives advice on kitchen equipment, cooking methods, and food preservation",
        "Category": " Cooking , Vegetarian",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "South Light: A Journey to the Last Continent",
        "Authors": "By Parfit, Michael",
        "Description": "The author describes his experiences during a year-long visit to Antarctica and shares his observations on the land and the scientific and military personnel stationed there",
        "Category": " Science , Earth Sciences , Geography",
        "Publisher": "Collier Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "Little Chick's big day (An Early I can read book)",
        "Authors": "By Kwitz, Mary Deball",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Meet the Press: 50-Years of History in the Making",
        "Authors": "By Ball, Rick and Nbc News",
        "Description": "Chronicles the program's radio and television history, including featured journalists, newsmakers, and events",
        "Category": " Performing Arts , Television , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The American Diabetes Association and the American Dietetic Association Family Cookbook (American Di",
        "Authors": "By American Diabetes Association and American Dietetic Association",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "6.32",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Stand Out!: 330 Ways for Gaining the Edge With Bosses, Co-Workers, Subordinates and Customers",
        "Authors": "By Dubrin, Andrew J.",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Peter Norton's DOS guide (A Brady Book)",
        "Authors": "By Norton, Peter",
        "Description": "The author of \"Inside The IBM PC\" and \"Peter Norton's Assembly Language\" covers the latest version of DOS and discusses such current topics as hard disk management and practical batch files, in this revised edition of \"MS DOS and PC DOS User's Guide\"",
        "Category": "",
        "Publisher": "Distributed by Prentice Hall Trade",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Fire Bringer",
        "Authors": "By Clement-Davies, David",
        "Description": "In ancient Scotland, a tyrannical new lord of the herd plans complete dominion over the animal world, but deer lore promises a hero, who has a unique bond with all creatures, including man, and who will ignite an epic battle and free the herd forever. Reprint.",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Firebird",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Half Empty, Half Full: The Psychological Roots of Optimism",
        "Authors": "By Vaughan, Susan C.",
        "Description": "In this fascinating book, Columbia University research scientist and psychoanalyst Susan Vaughan argues that our fundamental view of life as half empty or half full is determined by our capacity for emotional self-modulation. Based on her years of experience as a therapist and researcher, Dr. Vaughan shows how a sense of control over feelings like anger, anxiety, sadness, and even elation promotes optimism and well being. In contrast, feeling out of control makes us pessimistic and glum. Dr. Vaughan asserts that the roots of self-control are laid down through early interactions with caretakers, everyday experiences that literally shape the neural circuitry of the brain. The pictures of self and other formed in the first three years establish the basis for mood modulation in later life. How to limit the impact of early life and reshape our neural circuitry for effective mood modulation is the promise, and the gift, of this book. A convivial and accessible writer, Vaughan engages the reader in a conversation about what really determines whether we see the proverbial glass-as well as ourselves and the world around us-as half empty or half full.",
        "Category": " Psychology , Emotions",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Eden's Gate",
        "Authors": "By Lane, Christopher A.",
        "Description": "After years of dedicated research and field work, Dr. Richard Grimm, a noted archaeologist, discovers the fossilized skeleton of the First Man and, in the process, stumbles upon the gate to the Garden of Eden",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "The Chemistry of Conscious States: How the Brain Changes Its Mind",
        "Authors": "By Hobson, J. Allan",
        "Description": "Do human beings have a soul, a self that is distinct from the mass of nerve cells and electrical impulses that we call the brain? Or is all of consciousness - thoughts, emotions, memories, fantasies, dreams - a set of electrochemical events? Where do we go when we go to sleep, and what is the purpose of dreaming? Are dreams really the disguised fulfillments of secret wishes, as Freud thought, or are they random images summoned by neural activity in the brain, which we do our best to shape into meaningful scenarios as we dream, and edit as stories when we awaken? How does the hallucinatory delirium of our nocturnal experience differ from madness - if at all?Eminent Harvard neuroscientist J. Allan Hobson has written a groundbreaking book about consciousness that overturns our most basic assumptions about identity and human nature and forces us to think again about who we are and what we're made of. In The Chemistry of Conscious States, Hobson argues lucidly and persuasively that the brain and the mind are one - that the thoughts, feelings, dreams, and memories that constitute our consciousness are in fact an amalgam of electrical impulses and chemical interactions. Using anecdote and narrative to illustrate his research on the waking and dreaming brain, Hobson introduces the revolutionary concept of conscious states: the notion that consciousness is not a fixed entity but a dynamic neuropsychological continuum, regulated by the two chemical systems that preside over our waking and dreaming lives.In other words, what we call the self - the \"I\" we refer to so securely - is much more precarious than most of us imagine, for identity, according to Hobson, is not a constant condition at all but a construction whose form reflects the balance, at any given moment, between waking and dreaming. Hobson leads us on a fascinating journey through Harvard's sleep labs and psych wards and, finally, to the pathways of the brain itself. Without questioning the complexity of the human experience, The Chemistry of Conscious States capsizes the rudiments of psychoanalytic theory and offers a stunning new vision to succeed it.From the cutting edge of brain research, here is a gripping theory of human consciousness written with clarity, wit, and magnificent insight, a provocative look at some of the most fascinating science being conducted today.",
        "Category": " Medical , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "STAR TREK LOG ONE",
        "Authors": "By Foster, Alan Dean",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "May",
            "Year": "1974"
        }
    },
    {
        "Title": "The Troll's Grindstone (Wizard's War, 1)",
        "Authors": "By Boyer, Elizabeth H.",
        "Description": "Fleeing his enemies, Leifr, a young Viking, escapes into the Alfar realm and takes on the identity of the long-lost Fridmarr, only to discover that Fridmarr had betrayed both his own people and their arch-enemy, the evil wizard Sorkvir",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "King Herod's Dream: Caesarea on the Sea",
        "Authors": "By Bull, Robert J., Holum, Kenneth G., Hohlfelder, Robert L., and Raban, Avner",
        "Description": "Makes use of recent archaelogical findings, both on land and in the sea, to describe what life was like in the ancient port city",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "The Norton Reader: An Anthology of Expository Prose",
        "Authors": "By Arthur M Eastman",
        "Description": "",
        "Category": "",
        "Publisher": "Norton",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "State of the World 1996: A Worldwatch Institute Report on Progress Toward a Sustainable Society",
        "Authors": "By Brown, Lester R.",
        "Description": "An annual report considers how our world can reach levels of sustainability and high standards with sections on practical agriculture, solar energy technology, water conservation, biodiversity, and human rights. Simultaneous.",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "My Daddy Was a Pistol and I'm a Son of a Gun",
        "Authors": "By Grizzard, Lewis",
        "Description": "The Southern humorist traces his past and analyzes his bittersweet, complex relationship with his father, a World War II hero who became a roaming alcoholic during the author's childhood",
        "Category": " Humor , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "Heinemann Profiles: George Lucas (Heinemann Profiles)",
        "Authors": "By Riehecky, Janet",
        "Description": "",
        "Category": "",
        "Publisher": "Heinemann Educational Books - Library Division",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Space Swimmers",
        "Authors": "By Dickson, Gordon R.",
        "Description": "",
        "Category": "",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Live! Don't Diet!: The Low-Fat Cookbook That Can Change Your Life!",
        "Authors": "By Park, Vicki",
        "Description": "A delectable cookbook that explains how to prepare one's favorite foods in a healthy, low-fat way presents more than two hundred recipes for appetizers, breakfast foods, soups, salads, main dishes, grains, pasta, and desserts. Reprint.",
        "Category": " Cooking , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Sure-Thing Options Trading: A Money-Making Guide to the New Listed Stock and Commodity Options Markets",
        "Authors": "By Angell, George",
        "Description": "",
        "Category": " Business & Economics , Personal Finance , Money Management",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "Adoption Nation: How The Adoption Revolution Is Transforming America",
        "Authors": "By Pertman, Adam",
        "Description": "Adoption, once a clandestine process shrouded in shame, is rapidly evolving into a radical new form that is both sweeping the nation and changing it. It is accelerating our transformation into a more multicultural and multiethnic country, even as it helps redefine our understanding of \"family.\" But negative stereotypes still remain, and new problems-mostly stemming from the corrosive influence of money-are becoming pervasive.Adoption Nation provides valuable insight into the pleasures and perils of adoption, while laying out the ways in which policymakers should revise our laws to improve the process, stop treating members of the \"adoption triad\" as second-class citizens, and remove the obstacles that keep the children who most need permanent homes from getting them. Filled with up-to-the-minute information and a wealth of dramatic real-life stories, Adoption Nation is essential reading for adoptive families, for anyone contemplating adopting a child, and for everyone touched by this extraordinary cultural transformation.",
        "Category": " Family & Relationships , Adoption & Fostering",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Resume Writing",
        "Authors": "By Bostwick, Burdette Edwards",
        "Description": "",
        "Category": "",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The Janus Report on Sexual Behavior",
        "Authors": "By Janus, Samuel S., Ph.D. and Janus, Cynthia L.",
        "Description": "Our society, in the opinion of many experts, has gone through more social and sexual change in the past twenty years than in the prior two centuries. Yet, amazingly, until The Janus Report, there has been no scientific study of sexuality since Masters & Johnson's influential report of the 1960s, and no large-scale survey since the Kinsey reports forty years ago.Based on a nationwide survey of adult Americans of every political and religious persuasion, from ages eighteen to eighty and beyond, and from every income bracket and every region of the United States, The Janus Report surpasses all previous studies of American sexuality in both its scope and breadth. Frank, penetrating, and at times surprising in its findings, the Report cuts through platitudes and media hype to delve deeply into the American sexual psyche.Presenting its copious statistical findings in more than 270 tables, along with the observations of a panel of consulting experts, and numerous candid accounts by participants recounting their personal experiences, The Janus Report details for the first time the enormous changes in sexual attitudes and practices that have occurred in the 1980s and 1990s.The Janus Report also sheds new light on a number of today's most important social and political issues including love, marriage, divorce, parenthood, and abortion - offering revelations that are bound to make a lasting impression on the general public and influence the thinking of national policymakers and social scientists for years to come.Some of the Eye-Opening Facts About Contemporary Sex in America Revealed in The Janus Report:...The Death of Sex in America or a Second Sexual Revolution?...Instead of uncovering a new sexual Dark Ages brought on by fear of AIDS and other sexually transmitted diseases, the Drs. Janus found that mainstream Americans have resumed their ongoing love affair with bounteous sex and have begun to successfully cope, creating what the authors term a \"Second Sexual Revolution.\"...Life Begins at 50...People in their 50s, 60s, and 70s - both men and women - are experiencing a greatly heightened level of sexual activity, with people 65 years and older reporting a level only slightly lower than that of people in their 30s-to-40s....Sex and Politics...Ultraliberals are more interested in variety in sex than either independents or Ultraconservatives. Ultraconservatives are three times more accepting of sadomasochistic sex than either Ultraliberals or Independents....Regional Difference...The South has the earliest ages of sexual initiation and the most reported premarital sex. The Midwest consistently reports the least amount of sexual activity....The New Woman...Data identify a distinct new class, career women, whose attitudes on most sexual issues are much more similar to those of men than of women who are full-time homemakers....Sex and Education...Women with the highest education report having the greatest number of sex partners - twice as many as women in any other group. The acceptability of oral sex increases with education....Sex and Money...Eight percent of mainstream middle-income women reported having had sex for money. Middle-income men have the highest incidence of extramarital affairs.",
        "Category": " Social Science , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "An Illustrated Life of Jesus",
        "Authors": "By Abrams, Richard I. and Hutchinson, Warner A.",
        "Description": "Drawn from several centuries of art from medieval to contemporary times, the majority of the 60 glorious full-color images and 34 black-and-white-etchings, woodcuts, and engravings reproduced here--all from the collection of the prestigious National Gallery of Art in Washington, D.C.--were created by Flemish, Renaissance, and Baroque masters.  Richly reproduced, the works of art shown here include magnificently gold-leafed illuminated manuscripts, paintings on wood and canvas, glazed terra-cotta relief sculptures, intricate work in marble, metal-cut prints, bronze reliefs, and tapestries.  Carefully selected to follow the narratives from the four Gospels, the accompanying discussions of the artist's interpretations of biblical events further an understanding and appreciation of  these exquisite and moving works. Fully indexed to text, masterworks, and quoted scripture, this is a visually stunning reference and will be a treasured volume in the collections of all lovers of fine art.",
        "Category": " Religion , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "The Falconmaster",
        "Authors": "By Lafevers, R. L.",
        "Description": "This fantasy combines wizardry and magic with an absorbing animal-rescue story and should appeal to all fantasy lovers, but especially boys. Wat, a crippled boy, is an outcast in his village and retreats often to the forest, away from the cruel taunts of the villagers. There he witnesses the lord's handlers heartlessly kill a nesting pair of falcons so they can take the baby birds for their master. Wat, outraged, steals the nestlings and escapes into the heart of the forest, where he meets a mysterious old man. He is a mage-a wizard-who teaches him many things, among them how to care for the birds so that they may eventually fly free, and how to find some helpful magic-which is closer to him than he ever believed.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Dutton Juvenile",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Will Rogers: An American Legend",
        "Authors": "By Keating, Frank",
        "Description": "\"A man only learns by two things,\" Will Rogers said. \"One is reading, and the other is association with smarter people.\" Will Rogers loved people, and adventure, from the time he was a young boy. As a man, he traveled to the four corners of the globe--and never met a man he didn't like. Filled with Will Rogers's own timeless quotes, this picture book tells the story of a great maverick who lived the American dream.Governor Frank Keating of Oklahoma and award-winning illustrator Mike Wimmer bring to life a role model--and one of Oklahoma's favorite sons--who was quick on his trusty steed but even quicker with his wits.",
        "Category": " Juvenile Nonfiction , History , United States , 20th Century",
        "Publisher": "Silver Whistle",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Fiddlers Moll: Life With Yehudi",
        "Authors": "By Menuhin, Diana",
        "Description": "The wife of the virtuoso violinist recalls the colorful, hectic, and frequently trying life of continent-hopping concert musician, in which a sojourn with Nehru and a concert played amidst an invasion of locusts both have a place",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "6.49",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    }
]