[
    {
        "Title": "Consumer Reports 1,001 Helpful Hints",
        "Authors": "By Florman, Monte (EDT)",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "Consumer Reports Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Longshot",
        "Authors": "By Francis, Dick",
        "Description": "Hired to write the biography of a racehorse trainer, author John Kendall encounters more than he bargained for as he stumbles into a web of danger and death in rural England",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Nor Live So Long",
        "Authors": "By Woods, Sara",
        "Description": "Antony Maitland, the British barrister and his wife, Jenny, find their Yorkshire vacation turned into a nightmare when they discover the murdered bodies of three women and suspect a friend of Jenny's aunt",
        "Category": " Fiction , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "July",
            "Year": "1986"
        }
    },
    {
        "Title": "A Midwinter's Tale (O'Malley Novels)",
        "Authors": "By Greeley, Andrew M.",
        "Description": "Stationed in Bamberg, Germany, in the chaotic aftermath of WWII, pint-sized Charles \"Chucky\" Cronin O'Malley can't seem to keep himself out of harm's way. Whether it be with black marketeers, border patrols, or even his commanding officer, Chucky always seems to land in impossible scrapes, relying on a quick wit and blind luck (or is it Heavenly intervention?) to save his hide. And until the day he meets beautiful seventeen-year-old Trudi, a girl on the run from smugglers and the U.S. Army, he manages to keep himself in one piece. Trudi needs Chucky's help. If he isn't careful though, she may also make off with his heart.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Fashionably Late",
        "Authors": "By Goldsmith, Olivia",
        "Description": "All of designer Karen Kahn's dreams seem to be coming true. She's been honored with the fashion industry's most coveted award, her marriage is thriving, and some very impressive money is being dangled in front of her in a proposed buyout. The only thing missing is that which she craves most -- a baby. Then shereceives the heartbreaking news that she will never be able to bear a child. it seems that although she has a designer label, she definitely doesn't have designer genes.Karen becomes determined to find her own biological mother -- a woman she has never known. But as if the doctor's verdict has pulled a loose thread, Karen's carefully stitched Iife begins to unravel, and she suddenly finds herself on the brink of losing her company, her husband, and the only family she has ever known. Now Karen must decide which of her dreams she still wants...because keeping them alive is going to be the hardest thing she's ever had to do.",
        "Category": " Fiction , General",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Love Signs and You: The Ultimate Astrological Guide to Love, Sex, and Relationships",
        "Authors": "By Gordon, Rochelle (EDT) and Alexander, Skye (EDT)",
        "Description": "An analysis of the astrology of romance features elaborate illustrations and coverage of such areas as the celestial and historical influences on sex appeal, how to find an ideal astrological match, the planetary profiles for more than ninety famous couples, and the astrological influences that were at play for each of the sun signs during the past century.",
        "Category": " Body, Mind & Spirit , Astrology , Horoscopes",
        "Publisher": "Atria",
        "Price Starting With ($)": "9.63",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "On the Street Where You Live: A Novel",
        "Authors": "By Clark, Mary Higgins",
        "Description": "In the gripping new novel from America's Queen of Suspense, a young woman is haunted by two murders that are closely linked -- despite the one hundred and ten years that separate them.  Following the acrimonious breakup of her marriage and the searing experience of being pursued by an obsessed stalker, criminal defense attorney Emily Graham accepts an offer to leave Albany and work in a major law firm in Manhattan.  Feeling a need for roots, she buys her ancestral home, a restored Victorian house in the historic New Jersey seaside resort town of Spring Lake. Her family had sold the house in 1892, after one of Emily's forebears, Madeline Shapley, then still a young girl, disappeared.  Now, more than a century later, as the house is being renovated and the backyard excavated for a pool, the skeleton of a young woman is found. She is identified as Martha Lawrence, who had disappeared from Spring Lake over four year ago. Within her skeletal hand is the finger bone of another woman with a ring still on it -- a Shapley family heirloom.  In seeking to find the link between her family's past and the recent murder, Emily becomes a threat to a devious and seductive killer, who has chosen her as the next victim.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Pleasure of My Company: A Novel",
        "Authors": "By Martin, Steve",
        "Description": "From the bestselling author of Shopgirl comes the tender story of a troubled man who finds love, and life, in the most unexpected place. Daniel resides in his Santa Monica apartment, living much of his life as a bystander: He watches from his window as the world goes by, and his only relationships seem to be with people who barely know he exists. He passes the time idly filling out contest applications, counting ceiling tiles, and estimating the wattage of light bulbs. It is through Daniel's growing attachment to Clarissa, and to Teddy, that he finally gains the courage to begin to engage the world outside, and in doing so, he discovers love, and life, in the most surprising places. Filled with his trademark humor, tenderness, and out and out hilarious wordplay, The Pleasure of My Company is a tour de force sure to delight all of Steve Martin's fans.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Fire of His Genius: Robert Fulton and the American Dream",
        "Authors": "By Sale, Kirkpatrick",
        "Description": "None of the well-dressed crowd that gathered on the Hudson River side of Lower Manhattan on the hot afternoon of August 17, 1808, could have known the importance of the object they had come to see and, mostly, deride: Robert Fulton's new steamboat, the North River, the boat that is frequently -- and wrongly -- remembered as the Clermont. But, as Kirkpatrick Sale shows in this remarkable biography of Fulton, the North River's successful four-day round-trip to Albany proved a technology that would transform nineteenth-century America, open up the interior to huge waves of settlers, create and sustain industrial and plantation economies in the nation's heartland, and destroy the remaining Indian civilizations and most of the wild lands on which they depended. The North River's four-day trip introduced the machines and culture that marked the birth of the Industrial Revolution in America.  The Fire of His Genius tells the story of the extraordinarily driven and ambitious inventor who brought all this about, probing into the undoubted genius of his mind but, too, laying bare the darker side of the man -- and the darker side of the American dream that inspired him. It depicts one of America's earliest heroes both at the pinnacle of creativity and success, fame, and fortune and in the depths of solitude, recklessness, and contentiousness that preceded his early death (Fulton spent much of his life defending patents for everything from rope-making machinery to submarines to proto-torpedoes that he attempted to sell, in succession, to the French, the British, and the American navies). All this is set against a brilliant portrait of a dynamic historical period filled with characters from Bonaparte to Jefferson, Cornelius Vanderbilt to Meriwether Lewis, Robert Livingston to Benjamin West, and events from the Lewis and Clark expedition to the War of 1812, the Louisiana Purchase to the bombing of Fort McHenry, the treasontrial of Aaron Burr to the \"Great Removal\" of American Indians. Here are the \"taming\" of America's rivers and the building of its great canals, the introduction to every body of water of Fulton's \"large, noisy, showy, fast, brash, exciting, powerful, and audacious\" machine that was the very embodiment of America. A biography that bears comparison to the best work of David McCullough, Dava Sobel, and Garry Wills, The Fire of His Genius is a remarkable achievement: an extraordinarily clear window into an extraordinary time told with deftness, zest, and unflagging verve.",
        "Category": " Biography & Autobiography , Science & Technology",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Flight of Eagles",
        "Authors": "By Higgins, Jack",
        "Description": "It is the early days of World War II, and two brothers find themselves on opposite sides. Max and Harry Kelso were born in the United States of a German mother and an American father. They were separated as boys when their mother took Max with her to Germany. Now he has grown up to become a feared pilot with the Luftwaffe and Harry is a Yank ace in the RAF. Each has kept track of the other's progress, but neither could possibly predict the extraordinary circumstances under which they are about to meet again. Forces much greater than they have set in motion an intrigue so devious, so filled with peril, that it will require them to question everything they know, everything they hold most dear - their lives, their families, their loyalties. Upon the results of their actions will hang, unalterably, the course of the war itself...",
        "Category": " Fiction , War & Military",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "The World Book of House Plants",
        "Authors": "By McDonald, Elvin",
        "Description": "",
        "Category": "",
        "Publisher": "Funk & Wagnalls",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "A Gift of Peace",
        "Authors": "By Vaughan, Frances E. (EDT) and Walsh, Roger N. (EDT)",
        "Description": "Argues that peace must begin with each individual, explains how to change our perceptions of the world and ourselves, and suggests ways to overcome the obstacles to peace",
        "Category": " Poetry , General",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Mozart Effect: Tapping the Power of Music to Heal the Body, Strengthen the Mind, and Unlock the Creative Spirit",
        "Authors": "By Campbell, Don",
        "Description": "You know that music can affect your mood it can make you feel happy, enchanted, inspired, wistful, excited, empowered, comforted, heroic. But music has an even more astonishing power, one you may have suspected from your own experience, but which you will now learn well documented. Quite simply, music is good for you-physically, emotionally, and spiritually. Particular sounds, tones and rhythms, especially the music of Mozart, Gregorian chant, and some jazz, New Age, Latin, pop, and even rock music, can strengthen the mind, unlock the creative spirit, and, miraculously, even heal the body. This remarkable phenomenon is called The Mozart Effect.Stimulating, authoritative, and often lyrical, THE MOZART EFFECT offers dramatic accounts of how doctors, shamans, musicians, and health care professionals use music to deal with everything from anxiety to cancer, high blood pressure, chronic pain, dyslexia, even mental illness. Students who sing or play an instrument score up to 51 points higher on SAT than the national average. During strenuous exercise, the upbeat music of Diana Ross can lessen fatigue and release endorphins, the body's natural painkillers. The director of a Baltimore hospital's coronary care unit says that half an hour of classical music produces the same effect as ten milligrams of Valium. And now, whatever your listening taste, Don Campbell explains how to make the Mozart Effect work for you.",
        "Category": " Medical , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Wall Street Journal Guide to Understanding Personal Finance",
        "Authors": "By Siegel & Morris",
        "Description": "Covers banking services, credit, home finance, financial planning, investments, and taxes",
        "Category": "",
        "Publisher": "Fireside",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "After the Apple: Women in the Bible: Women In the Bible - Timeless Stories of Love, Lust, and Longing",
        "Authors": "By Rosenblatt, Naomi",
        "Description": "Blending elements of history, pyschology, and storytelling, the author of Wrestling with Angels retells the stories of female characters from the Hebrew Bible--Leah, Rachel, Sarah, Rebeccah, Delilah, and Jezebel--and thei surprisingly modern dilemmas and problems they are forced to confront. 35,000 first printing.",
        "Category": " Religion , Biblical Commentary , General",
        "Publisher": "Miramax",
        "Price Starting With ($)": "6.4",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The Landing of the Pilgrims (Landmark Books)",
        "Authors": "By Daugherty, James",
        "Description": "In England in the early 1600s, everyone was forced to join the Church of England. Young William Bradford and his friends believed they had every right to belong to whichever church they wanted. In the name of religious freedom, they fled to Holland, then sailed to America to start a new life. But the winter was harsh, and before a year passed, half the settlers had died. Yet, through hard work and strong faith, a tough group of Pilgrims did survive. Their belief in freedom of religion became an American ideal that still lives on today.James Daugherty draws on the Pilgrims' own journals to give a fresh and moving account of their life and traditions, their quest for religious freedom, and the founding of one of our nation's most beloved holidays—Thanksgiving.",
        "Category": " Juvenile Nonfiction , History , United States , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1981"
        }
    },
    {
        "Title": "Summoned to Jerusalem: The Life of Henrietta Szold",
        "Authors": "By Dash, Joan",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "A Child's American Heritage",
        "Authors": "By Blocksom, Claudia",
        "Description": "",
        "Category": "",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Grow and Learn Library: Sunny Bunny Comes Home",
        "Authors": "By Lynx Books",
        "Description": "Individual stories feature Raggedy Ann and her toy friends experiencing social and emotional growth, in such areas as self-esteem, sharing, solving problems, and making the best of things.",
        "Category": "",
        "Publisher": "Lynx Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Language on a Leash",
        "Authors": "By Boston, Bruce O.",
        "Description": "",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Eei Business Communications",
        "Price Starting With ($)": "5.55",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Beware the microbots (Perry Rhodan)",
        "Authors": "By Mahr, Kurt",
        "Description": "",
        "Category": "",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Pyramid",
        "Authors": "By MacAulay, David",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "8.85",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Men in Black II: The Movie Novel",
        "Authors": "By Teitelbaum, Michael",
        "Description": "The men in the crisp black suits and the really cool shades are back to keep the aliens from overrunning planet Earth. It's been five years since Agents Jay and Kay saved the world from a very big bug. Now a new alien menace is threatening to destroy the Earth -- unless it's given the Light of Zartha. There's one problem: Only one person on Earth knows where the Light has been hidden -- that person is Agent Kay.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Good Night, Maman (Harper Trophy Books)",
        "Authors": "By Mazer, Norma Fox",
        "Description": "Dearest Maman,I keep all my letters to you in my notebook under my pillow. One day, when we're together again, I'll give them to you, and we'll sit and read them....In June 1940, twelve-year-old Karin Levi's world is torn apart as the German army occupies Paris. Karin, her older brother, Marc, and their maman must flee, seeking safety wherever they can find it. But Maman falls ill and is unable to travel, forcing Karin and Marc to leave her behind. When Marc manages to obtain two coveted places aboard a ship bound for America, the distance between them grows even greater. Will Karin ever see her beloved maman again?",
        "Category": " Juvenile Fiction , Historical , Holocaust",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Little Book of Golf Slang",
        "Authors": "By Voorhees, Randy",
        "Description": "",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "MJF Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The formation of the Resurrection narratives",
        "Authors": "By Fuller, Reginald Horace",
        "Description": "",
        "Category": "",
        "Publisher": "Fortress Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Wild, Wild Wolves (Step into Reading)",
        "Authors": "By Schwinger, Larry (ILT) and Milton, Joyce",
        "Description": "Illus. in full color. A fascinating introduction to the world of wolves, one of nature's most enduring and misunderstood creatures. Wolf-pack behavior, body language, and the meaning of howls are all demystified in this natural history.",
        "Category": " Juvenile Nonfiction , Science & Nature , Zoology",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Uh Oh! Gotta Go!: Potty Tales From Toddlers",
        "Authors": "By McGrath, Bob and Dieterichs, Shelley (ILT)",
        "Description": "Twenty-seven humorous vignettes are cleverly captioned illustrations designed to help parents and kids cope with the challenges of toilet training. Toddlers will laugh when they see Mark picking out a potty at the toy store. And back at home, Toby didn't quite make it to the potty this time. He'll have better luck next time. Jordon waits till the last minute too-but hooray! We see him in the bathroom, and we know he made it on time. Alison is proud because she uses a grown-up toilet, and Amanda reads a picture book when she sits on her potty. Neither parents nor children need to take potty training too seriously, because sooner or later, everything works out just fine. That's the message at the heart of Bob McGrath's cheerful book-and boys and girls will enjoy seeing their own potty experiences repeated on these pages.",
        "Category": " Juvenile Fiction , Health & Daily Living , Toilet Training",
        "Publisher": "B.E.S.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "How to Write a Resume (No Nonsense Career Guide)",
        "Authors": "By Boyd-Dinwiddie, Elsa",
        "Description": "",
        "Category": " Business & Economics , Careers , Resumes",
        "Publisher": "Longmeadow Pr",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "When Will Santa Come? (A Lift-the-flap story)",
        "Authors": "By Ziefert, Harriet and Schumacher, Claire",
        "Description": "All the young animals in the forest wonder when Santa Claus will bring their presents",
        "Category": "",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "What's Happening to My Body? Book for Girls: A Growing-Up Guide for Parents and Daughters",
        "Authors": "By Madaras, Lynda, Madaras, Area, Sullivan, Simon (ILT), and Aher, Jackie (ILT)",
        "Description": "Provides information and advice concerning the physical, psychological, and behavioral changes associated with puberty.",
        "Category": " Young Adult Nonfiction , Health & Daily Living , General",
        "Publisher": "Newmarket Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "The Martha Stewart Cookbook: Collected Recipes for Every Day",
        "Authors": "By Stewart, Martha and Finamore, Roy (EDT)",
        "Description": "The year was 1982, and Martha Stewart published her first book, Entertaining. This immediate best-seller, based on Martha's experience as a professional caterer, introduced readers to a new style of entertaining and a new style of cookbook - one that was gloriously photographed and filled with a wealth of information on the art of hospitality. In the years following, Martha wrote eight more books on food and entertaining, continuing to inspire a growing legion of fans with beautiful food, simply but elegantly presented.This book is the culmination of those years of publishing. More than 1,600 recipes and variations - all the recipes from Entertaining, Quick Cook, Pies & Tarts, Hors d'Oeuvres, Quick Cook Menus, Gardening, Weddings, Christmas, and Menus for Entertaining - are gathered together in a single volume. Thoroughly revised and updated, The Martha Stewart Cookbook includes a new introduction by Martha, new step-by-step illustrations, new menus, and sidebars and tips on subjects as varied as freezing pastry, selecting the best fruit, and setting the table.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Cabinetry: The Woodworkers Guide to Building Professional Looking Cabinets and Shelves",
        "Authors": "By Yoder, Robert A. (EDT)",
        "Description": "Instructions for thirty professionally-designed cabinet and shelving projects are accompanied by detailed diagrams, complete materials lists, and tips on special techniques",
        "Category": "",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "Chasing Ghosts: A Soldier's Fight for America from Baghdad to Washington",
        "Authors": "By Rieckhoff, Paul",
        "Description": "The riveting, action-packed true story of the first soldier to challenge the war in Iraq.  As a 1st Lieutenant and Infantry Platoon Leader for the U.S. Army, charged with leading 38 young men in Iraq, Paul Rieckhoff was proud to follow in the footsteps of his father and grandfather, who served during Vietnam and WWII respectively. He and his soldiers spent almost a year in one of the most dangerous and volatile areas of Baghdad. And what they encountered there was chaos: not nearly enough troops, no humanitarian aid, no body armor, no radios, and no real plan for what to do after Baghdad fell.  Rieckhoff was shocked to see that sometimes the greatest challenges his platoon faced did not come from enemy combatants. He saw fi rsthand the disastrous results of disbanding the Iraqi army, sending thousands of armed, angry, and unemployed men out into the streets. And he saw what happened when we tried to conduct a war on the cheap, by bestowing government contracts to the lowest bidder and sending our military into battle inadequately protected and armed. What followed, over the next ten months, set him on a course that would forever change his life.  When he fi nally came home from his tour of duty, Rieckhoff vowed to tell Americans the truth about what was going on in Iraq. He demanded accountability from elected officials and was the first Iraq veteran to do so publicly. He created Operation Truth, the first and largest veterans' group specifically for veterans of the wars in Iraq and Afghanistan. Through this organization, he has become a leading spokesman for troops, veterans, and their families, and a critical voice in the ongoing debate surrounding this conflict.  What is really happening in Iraq? Should we be there? Should we stay? Rieckhoff is in a unique position to answer these crucial questions. Not only was he on the ground in the heat of battle but he is also on the front lines politically at home. He provides a grunt's-eye view of the harrowing, bloody battles on the streets of Baghdad and a patriot's vision of where America has gone wrong and how it can reset its path.",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "NAL Hardcover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Lauren Groveman's Kitchen",
        "Authors": "By Groveman, Lauren",
        "Description": "Shares advice on cooking, including tips on saving time, and provides recipes for appetizers, soups, pasta, main dishes, side dishes, breads, and desserts",
        "Category": " Cooking , Reference",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "40 Things to Do When You Turn 40: 40 Experts on the Subject of Turning 40",
        "Authors": "By Sellers, Ronnie (EDT)",
        "Description": "",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Sellers Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "A Peasant of El Salvador",
        "Authors": "By Peter Gould, Stephen Stearns",
        "Description": "",
        "Category": "",
        "Publisher": "Whetstone Books",
        "Price Starting With ($)": "12.11",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "When Pleasing Others Is Hurting You: Finding God's Patterns for Healthy Relationships",
        "Authors": "By Hawkins, David",
        "Description": "A fresh new cover introduces the proven principles in this popular title--more than 75,000 copies sold--to a new group of readers.Christians are called to be servants. But people who forfeit their God-given calling and identity in order to please others move from servanthood to codependency. How can they get back on track? Clinical psychologist David Hawkins offers a Christian perspective on healthy relationships and the pitfalls of being a people pleaser. He answers such important questions as…Where does Christian service end and codependency begin?What emotional needs lead to codependency, and how can those needs be met in healthier ways?How can parents help their children avoid codependent behavior?Readers will resonate with the real-life illustrations of people who no longer know what they think, want, or feel. Suggestions for redirecting unhealthy relationships empower readers to rediscover their own value and personal contribution.",
        "Category": " Psychology , Applied Psychology",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Noodles and Pasta (Ryland, Peters and Small International Cookbooks , Vol 2, No 4)",
        "Authors": "By Wheeler, Simon (PHT) and Davies, Joy",
        "Description": "Provides recipes for noodle and pasta dishes from America, Europe, the Middle East, Southeast Asia, China, Japan, Korea, Australia, and New Zealand",
        "Category": " Cooking , Regional & Ethnic , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Spy Hook",
        "Authors": "By Deighton, Len",
        "Description": "Samson uncovers a far-ranging financial scam within the British Secret Service and travels through Europe and America to halt the operation, but charges of treason and threats to his life may stop him",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "If Mama Ain't Happy, Ain't Nobody Happy: Making the Choice to Rejoice",
        "Authors": "By O'Connor, Lindsey",
        "Description": "",
        "Category": " Religion , Christian Life , Devotional",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Graphic Artists Guild Handbook (Graphic Artists Guild Handbook of Pricing and Ethical Guidelines)",
        "Authors": "By Graphic Artists Guild (U. S.) (COR) and Burd, Rachel (EDT)",
        "Description": "Covers artwork pricing, standard contract terms, commissions, recent legislative developments, computer graphics, desktop publishing, licensing, and royalties",
        "Category": " Design , Graphic Arts , General",
        "Publisher": "Graphic Artists Guild",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Build a Better Life by Stealing Office Supplies: Dogbert's Big Book of Business",
        "Authors": "By Adams, Scott",
        "Description": "",
        "Category": " Humor , Topic , Business & Professional",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Best Ever Paper Airplanes",
        "Authors": "By Schmidt, Norman",
        "Description": "“Sleek, slick, and beautiful....Includes similarities to real-life airplanes....The book features crisp white diagrams, clear black type, step-by-step instructions, yellow boxes of special construction information, and magnified views of tricky sections.”—School Library Journal. “A well-thought-out and handsome volume that should provide successful projects for careful readers.... [Schmidt’s] ideas for coloring and decorating the projects make the ‘paper birds’ extra special.” —Booklist.",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Other Fires: Short Fiction by Latin American Women",
        "Authors": "By Manguel, Alberto (EDT) and Potter, Clarkson N.",
        "Description": "This provocative collection of short fiction features the work of twenty women writers, including Silvina Ocampo, Rachel de Queriroz, Clarice Lispector, Elena Poniatowska, Marta Lynch, Beatriz Guido, and Maria Luisa Bombal",
        "Category": "",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Summer",
        "Authors": "By Gordon, Alice and Virga, Vincent (EDT)",
        "Description": "Celebrating the joys of summer in words and pictures, this tribute features writings by Alice Adams, Louise Erdrich, and John Updike, among others, as well as photographs by Robert Adams, David Hockney, and Edward Hopper",
        "Category": " Art , General",
        "Publisher": "Addison Wesley",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Mr. Yowder and the Lion Roar Capsules",
        "Authors": "By Rounds, Glen",
        "Description": "Finding that the old lion he is given in trade is totally useless except for his roar, Mr. Yowder attempts to capitalize on that one asset",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Holiday House",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "March",
            "Year": "1976"
        }
    },
    {
        "Title": "Calgary, cowboys & Kananaskis Country",
        "Authors": "By Young, Cameron",
        "Description": "",
        "Category": "",
        "Publisher": "SummerWild Productions",
        "Price Starting With ($)": "23.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Man in the Shadows: Inside the Middle East Crisis with a Man Who Led the Mossad",
        "Authors": "By Halevy, Efraim",
        "Description": "Israel’s Mossad is thought by many to be one of the most powerful intelligence agencies in the world. In Man in the Shadows, Efraim Halevy—a Mossad officer since 1961 and its chief between 1998 and 2002—provides an unprecedented portrait of the Middle East crisis. Having served as the secret envoy of prime ministers Rabin, Shamir, Netanyahu, Barak, and Sharon, Halevy was privy to many of the top-level negotiations that determined the progress of the region’s struggle for peace during the years when the threat of Islamic terror became increasingly powerful. Informed by his extraordinary access, he writes candidly about the workings of the Mossad, the prime ministers he served under, and the other major players on the international stage: Yasir Arafat, Saddam Hussein, Hafiz al-Assad, Mu’amar Gadhafi, Bill Clinton, George H. W. Bush, and George W. Bush. From the vantage point of a chief in charge of a large organization, he frankly describes the difficulty of running an intelligence agency in a time when heads of state are immersed, as never before, in using intelligence to protect their nations while, at the same time, acting to protect themselves politically. Most important, he writes fiercely and without hesitation about how the world might achieve peace in the face of the growing threat from Islamic terrorist organizations. In this gripping inside look, Halevy opens his private dossier on events past and present: the assassination attempt by the Mossad on the life of Khaled Mashal, now the leader of Khammas; the negotiations surrounding the Israeli-Jordan Peace Accord and its importance for the stability of the region; figures in the CIA, like Jim Angleton and George Tenet, with whom he worked (Halevy even shares his feelings about Tenet’s abrupt resignation). He tells the truth about what the Mossad really knew before 9/11. He writes candidly about assessing the threat of the proliferation of weapons of mass destruction in the region and beyond, and what this spells for the future of international stability and survival. He touches on the increasing visibility of the CIA in the Middle East and openly shares his misgivings about both the report of the 9/11 Commission and the Middle East road map to peace that was pressed on all sides of the conflict by the U.S. government. He looks at the terrorist attacks in Madrid and London and their far-reaching effects, and states the unthinkable: We have yet to see the worst of what the radical Islamic terrorists are capable of. Sure to be one of the year’s most talked-about books, this fierce and intelligent account of will be a must-read for those looking to hear from a man who wielded his influence, in the shadows, to save the Middle East and the world from a never-ending cycle of violence and destruction.",
        "Category": " Political Science , Intelligence & Espionage",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "The Blood Countess",
        "Authors": "By Codrescu, Andrei",
        "Description": "Countess Elizabeth Bathory of Hungary (1560-1613) was beautiful, well educated in the best traditions of the Renaissance, and wealthy beyond measure.Upon assuming her seat of power at the age of sixteen, the Countess set out upon a course of revelry and debauchery, aided by her spiritual adviser, Darvulia, and by her faithful bevy of overwrought maids. Eventually, time and an excess of increasingly bizarre pleasures led the Countess to fear the loss of her beauty. She was advised by her witches to take baths in the blood of virgins to regenerate her body. A long procession of young girls were \"chosen\" to spend the night with Elizabeth. Six hundred and fifty young women are said to have died in the Countess's castles.Countess Elizabeth Bathory's direct descendant, Drake Bathory-Kereshtur, is a Hungarian emigre living in New York near the end of the twentieth century. He considers himself a failure at life. His relationships with women have been disasters. He is haunted by the Hungary of his youth, which he had to flee during the Hungarian revolution of 1956. After the collapse of Communism, he returned to Hungary to find his youth, but found instead something a lot more horrifying: the pervasive presence of his ancestor, Countess Bathory. When he returns to the United States, he confesses to a hideous crime before a New York magistrate. This exquisite novel is told through Drake's eyes, as he searches for his roots and comes to terms with this gruesome part of his family history.",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "The Caveman's Valentine",
        "Authors": "By Green, George Dawes",
        "Description": "Romulus Ledbetter wasn't always homeless. He once was a devoted husband, father, and musician with a bright future. He now forages for food in the trash cans of the city's better neighborhoods and wages a strenuous one-man war against Cornelius Gould Stuyvesant, an evil -- and imaginary -- power broker who is responsible for society's ills, as well as the sinister Y- and Z-rays that are corrupting humankind. Then one wintry night, Rom finds a corpse at the mouth of his cave that rouses his well-defined sense of ethics and launches him on an obsessive quest for answers. Forced to reconnect with society, Rom leaves his world and journeys through a spiraling web of clues and hunches, straight into a sinister den of money, temptation, and murder--otherwise known as the \"civilized\" world.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Time Warner Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "In Enemy Hands",
        "Authors": "By Warren, Murphy",
        "Description": "",
        "Category": "",
        "Publisher": "Pinnacle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Come Before Winter and Share My Hope",
        "Authors": "By Swindoll, Charles R.",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Freud: A Life for Our Time",
        "Authors": "By Gay, Peter",
        "Description": "A thorough biographical portrait of a pivotal thinker and practitioner probes many aspects of Freud's life, including his family, his city, his professional challenges, and his innovative and controversial theories",
        "Category": " Biography & Autobiography , Social Scientists & Psychologists",
        "Publisher": "Anchor Books Doubleday",
        "Price Starting With ($)": "6.37",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "The Return to Camelot: Chivalry and the English Gentleman",
        "Authors": "By Girouard, Mr. Mark",
        "Description": "",
        "Category": "",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1981"
        }
    },
    {
        "Title": "Bob Greene's Total Body Makeover: An Accelerated Program of Exercise and Nutrition for Maximum Results in Minimum Time",
        "Authors": "By Greene, Bob",
        "Description": "From Bob Greene, bestselling author of Get With the Program!, comes a comprehensive, innovative twelve-week plan for transforming your body inside and out. With Bob Greene's Total Body Makeover, you'll achieve maximum results in a minimum amount of time!Knowing that great health and fitness begin with the right state of mind, Greene addresses the important emotional issues behind poor exercise and eating patterns and provides the motivational tools needed to achieve your fitness goals, as well as develop practical and beneficial habits for lasting results. You'll be inspired and moved by reading the compelling true-life success stories of real people who have taken the challenge and who have changed their bodies -- and lives -- in ways they never dreamed possible! Whether you're struggling to lose that last ten pounds or searching for a radical weight-loss solution, the twelve-week makeover challenge is the answer to your fitness goals.After committing to the program, you'll find illustrated step-by-step workout guides for all fitness levels, combining progressive cardiovascular and intensive strength training exercises designed to revitalize your metabolism and get noticeable results fast. Each of the accelerated workouts has been created to energize and invigorate your body and mind while you have fun and trim down in the process! In addition, Greene takes a fresh approach to the question of diets by providing key nutritional guidelines that work in conjunction with any healthy eating plan, and he explains many of the popular diets on the market today to help you choose the one that's right for you.  Finally, there is helpful advice on making the transition back to your everyday life: how to avoid regaining the weight you've lost, and how to maintain healthy exercise and eating habits for life. While many books leave you wondering what to do next, Bob Greene's Total Body Makeover offers enthusiastic and informative hands-on advice and tips beyond eating and exercise, and teaches you how to make your own happiness and well-being the foundation of an active and healthy life.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Swimming for Total Fitness: A Progressive Aerobic Program",
        "Authors": "By Bruning, Nancy P. and Katz, Jane",
        "Description": "Swimming is one of the best, most enjoyable, and most effective forms of exercise available, and this is the classic guide for beginners and expert swimmers alike, completely revised and updated for the '90s.B & W line drawings throughout.",
        "Category": " Health & Fitness , Reference",
        "Publisher": "Main Street Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "The Call of Stories: Teaching and the Moral Imagination",
        "Authors": "By Coles, Robert",
        "Description": "A teacher and a child psychiatrist discusses the power of stories to affect others, recounting his exposure to many famous people and their stories and what this has told him about life",
        "Category": " Education , Experimental Methods",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Kings Highway",
        "Authors": "By Carlson, Nancy Naomi",
        "Description": "",
        "Category": " Poetry , General",
        "Publisher": "Washington Writers Pub House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Lions Don't Need to Roar: Using the Leadership Power of Personal Presence to Stand Out, Fit in and Move Ahead",
        "Authors": "By Benton, D. A.",
        "Description": "A guidebook full of leadership techniques from a business guru teaches how to use \"professional presence\" in the corporate world to make memorable first impressions, capitalize on lucky breaks, and function at the top. 20,000 first printing. Tour.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Business Plus",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "The Right Kind of War",
        "Authors": "By McCormick, John",
        "Description": "John McCormick has crafted this haunting, unforgettable novel from his own World War II service with the U.S. Marine Corps' elite Raiders - the men in the vanguard of the island-hopping campaign to wrest control of the Pacific from the Japanese. A veteran of some of the war's bloodiest fighting, he tells the story of a gallant band of young Marines coming of age in a crucible of fire, lead, and steel.For Privates Moe, Cole, Cannon, and the other riflemen of the 3d Squad, 3d Platoon, Dog Company, the war was not all killing or being killed. While camped on islands far from the focus of battle, these free spirits hatched many a plan to foil the officers struggling to rein them in. Their hilarious misadventures provide a dramatic contrast to the sobering accounts of close-quarters combat.",
        "Category": "",
        "Publisher": "Naval Institute Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Body: Being Light in Darkness",
        "Authors": "By Colson, Charles and Vaughn, Ellen Santilli",
        "Description": "In this 1993 ECPA Book of the Year, Colson sounds a clarion call for the church to rise above traditional divisions and market-driven programs to be what God has called her to be-His people. In doing so, the Body of Christ can reclaim God's holy vision for His church. Truly a modern-day classic.",
        "Category": " Religion , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Occupied Territory",
        "Authors": "By Thomas, Cal",
        "Description": "",
        "Category": "",
        "Publisher": "Wolgemuth & Hyatt Pub",
        "Price Starting With ($)": "10.84",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Voodoo, Ltd.",
        "Authors": "By Thomas, Ross",
        "Description": "Detective Arthur Wu of Wudu, Ltd. takes on a case involving two kinky British hypnotists and a Hollywood personality who is accused of gunning down her very wealthy ex-fiance+a7. By the author of The Cold War Swap. 35,000 first printing. $35,000 ad/promo.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mysterious Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The Last Goodbye",
        "Authors": "By Frase, H. Michael",
        "Description": "Josh Mitchell leads an enviable life in the eyes of most people who know him. But he lives with disturbing secrets, too. And not even his best friend and former partner knows that Josh Mitchell travels with a hidden past.It's on a routine business flight from New York to San Francisco that Josh meets the intriguing woman who with strange reluctance reveals her name as Pamela Morrow. She is mysterious, elusive, alluring, and Josh could easily believe he has been waiting for Pamela Morrow all his life.Their romance is brief, a matter merely of hours, as Pamela Morrow's body is discovered the following morning, within sight of Josh's hotel room, on the beach at Carmel. While Josh becomes the prime suspect, he also remains, surprisingly, a free man.Haunted by their chance encounter and falling in love with his memory of her, Josh desperately attempts to unravel the mystery of Pamela Morrow's death, and life. What Josh does not know is that his own fate is controlled by two implacable forces: someone is determined to make him pay for the murder he's trying to solve, and Pamela Morrow was killed by a hit-and-run driver in Jackson, Mississippi, eight years before.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Carroll & Graf Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Before the Fall : An Inside View of the Pre-Watergate White House",
        "Authors": "By Safire, William",
        "Description": "The Pulitzer Prize-winning author presents a portrait of the Nixon White House prior to the Watergate affair",
        "Category": " Political Science , Government , General",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "6.45",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "The Treasure Principle: Discovering the Secret of Joyful Giving (LifeChange Books)",
        "Authors": "By Alcorn, Randy C.",
        "Description": "Flip-Flop Your Concept of Giving!  Bestselling author Randy Alcorn introduced readers to a revolution in material freedom and radical generosity with the release of the original The Treasure Principle in 2001. Now the revision to the compact, perennial bestseller includes a provocative new concluding chapter depicting God asking a believer questions about his stewardship over material resources. Readers are moved from the realms of thoughtful Bible exposition into the highly personal arena of everyday life. Because when Jesus told His followers to “lay up for yourselves treasures in heaven,” He intended that they discover an astounding secret: how joyful giving brings God maximum glory and His children maximum pleasure. Discover a joy more precious than gold! Priceless treasure is within your reach. And with it, liberating joy.  In Randy Alcorn ’s The Treasure Principle, you’ll unearth a radical teaching of Jesus—a secret wrapped up in giving. Once you discover this secret, life will never look the same. And you won’t want it to!  Pull Out Section:  Do it. Ask God what’s on your mind….  Open my eyes, Father. What am I holding on to that’s robbing me of present joy and future reward?  Discover the all-new prayer guide inside!    “Supercharged with stunning, divine truth! Lightning struck over and over as I read it.”  John Piper , Senior Pastor, Bethlehem Baptist Church , Minneapolis  “The Treasure Principle will change your life! This book is destined to become a classic.”  Howard Dayton , Co-CEO, Crown Financial Ministries  “The Scripture passages and illustrations really ring true. Just what I needed!”  Hugh Maclellan , President, The Maclellan Foundation  “I enthusiastically endorse The Treasure Principle. I hope millions will read it.”  Ronald W. Blue , Founder and CEO, Ronald Blue & Company Story Behind the BookAfter years of writing and teaching on the theme “God owns everything,” in 1990 Randy Alcorn was sued by an abortion clinic (for peaceful, nonviolent intervention for the unborn). Suddenly he had to resign as a pastor and was restricted to making minimum wage. Legally unable to own anything, Randy gave all his book royalties to missions work and need-meeting ministries. He and his family have experienced the reality of The Treasure Principle—that God really does own everything, takes care of us, and graciously puts assets into our hands that we might have the joy and privilege of investing in what will last for eternity.",
        "Category": " Religion , Ethics",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Night Light: A Devotional for Couples",
        "Authors": "By Dobson, James C. and Dobson, Shirley",
        "Description": "The challenge of sustaining an intimate, faith-based marriage in today's \"hurry-up\" society has never been greater. Now Night Light, the inspired, first-ever couples' devotional from Focus on the Family ministry founder Dr. James Dobson and his wife, Shirley, brings spouses together each evening, helping them stay connected with each other and their Lord. Stories that strike an emotional chord, Scripture readings, provocative questions, prayers, and personal commentary from the Dobsons encourage men and women in their homes and spiritual lives. More than just another devotional, Night Light is a practical, uplifting guide for every couple who longs to experience the joyous, intimate, \"three-person\" marriage covenant God intended.Whether you’re just married or are celebrating your golden anniversary, you need regular, quiet moments with your mate - times to renew love and intimacy between each other and with the Lord. Night Light, by Dr. James Dobson and his wife, Shirley, will help you do just that. This daily devotional offers the personal, practical, and biblical insights that have sustained the Dobsons’ marriage for forty years and encouraged couples and families around the world. Let Night Light enrich your marriage, too -tonight and every night.",
        "Category": " Religion , Devotional",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Great Grilling Recipes! The Next Grilleration",
        "Authors": "By George Foreman, Connie Merydith",
        "Description": "",
        "Category": "",
        "Publisher": "Pascoe Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Best-Selling Bazaar Patchwork (For the Love of Quilting)",
        "Authors": "By Abrelat, Barbara H. (EDT)",
        "Description": "Includes patterns, designs, step-by-step instructions, and tips for making patchwork creations that can be sold at fund-raising bazaars",
        "Category": " Crafts & Hobbies , Patchwork",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "The Making of Jazz",
        "Authors": "By Collier, James Lincoln",
        "Description": "Explores the lives and contributions of more than one hundred major jazz musicians as well as describing the major styles and stages marking the development of jazz from ragtime and blues to electronic jazz",
        "Category": " Music , General",
        "Publisher": "Dell Publishing",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "August",
            "Year": "1979"
        }
    },
    {
        "Title": "Ike\u0092s Spies: Eisenhower and the Espionage Establishment",
        "Authors": "By Ambrose, Stephen E. and Immerman, Richard H.",
        "Description": "Dwight D. Eisenhower's public image was that of a wide-grinning Daddy Warbucks who preferred the golf course over the cabinet room. He was perceived as a military bureaucrat who never held a combat command. A Republican sandwiched between two Democratic administrations, he lacked the political vigor of his predecessor Harry S. Truman and the star quality of his successor JFK. Yet behind the placid image he was a sly fox who ran the most efficient espionage establishment in the world. His goal was to keep the Free World free. To do so, he fostered the growth of the CIA, overthrew governments, flew spy flights, and hatched assassination plots. At the top of the intelligence pyramid, Ike shouldered some of the greatest coups in espionage history, as well as some of its most ignominious failures. Among Ike's successes: The \"Man Who Never Was\" strategem, the ULTRA-guided ambush of the German counterattack at Mortain, which opened the Allies' way to the Rhine, the 1954 overthrow of Jacobo Arbenz Guzman's government of Guatemala, Operation AJAX, which toppled Iran's Mossadegh, and the U-2 flights over Russia. But Ike can be credited likewise for miscalculations: the failure to predict the German attack during the Battle of the Bulge, the Francis Gary Powers fiasco, and the tragic and irresponsible encouragement of freedom fighters in Hungary, Indonesia, and Cuba. In writing this revealing probe into the 1950s spy world, Stephen E. Ambrose, the author of the most acclaimed full-scale biography of Eisenhower, interviewed the president and many of his agents and had access to much previously unpublished archival material. \"The story he tells,\" said the New York Review of Books in 1981 when the book was first published, \"is one of some very low deeds done in the name of high moral principles.\" Stephen E. Ambrose was Director Emeritus of the Eisenhower Center, Boyd Professor of History at the University of New Orleans, and president of the National D- Day Museum. He was the author of many books, most recently The Mississippi and the Making of a Nation: From the Louisana Purchase to Today. His compilation of 1,400 oral histories from American veterans and authorship of over 20 books established him as one of the foremost historians of the Second World War in Europe. He died October 13, 2002, in Bay St. Louis, Mississippi.",
        "Category": " History , United States , 20th Century",
        "Publisher": "University Press of Mississippi",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Romeo",
        "Authors": "By Title, Elise",
        "Description": "His is the courtship every woman dreams of. His is the seduction no woman survives.His victims were San Francisco's most invulnerable women - professional, beautiful, smart. They eagerly embraced Romeo's darkest fantasies.They just didn't expect to die.Dr. Melanie Rosen, leading psychiatric expert on the compulsions of serial killers, was his fifth victim - a victim of her own uncontrollable desires. Now Romeo has Melanie's diary and the identity of his ideal conquest. Her sister, Sarah.The others never really had their hearts in it. Sarah will be different. Sarah's heart will be perfect.Sarah Rosen is a victim truly worthy of Romeo's exquisite seduction. She's a fighter. That turns him on. Determined to stop him, Sarah has deliberately entered Romeo's trap, thinking the police can protect her. But no one can protect her from herself.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Paterno: By the Book",
        "Authors": "By Paterno, Joe and Asbell, Bernard",
        "Description": "The iconoclastic head football coach at Penn State offers his observations and opinions on winning and losing, education, discipline, race relations, fame and its pressures, faith, the media, motivation, and leadership",
        "Category": " Sports & Recreation , Football",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Chronicle of youth: The War diary, 1913-1917",
        "Authors": "By Brittain, Vera",
        "Description": "",
        "Category": "",
        "Publisher": "Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Writing In the Disciplines to Accompany The Rinehart Handbook for Writers",
        "Authors": "By Bonnie Carter, Craig Skates",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt Brace Jovanovich College Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The American Rose Annual 39, 1954",
        "Authors": "By Nisbet, Fred J., Editor",
        "Description": "",
        "Category": "",
        "Publisher": "American Rose Society",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1954"
        }
    },
    {
        "Title": "North of South: An African Journey",
        "Authors": "By Naipaul, Shiva",
        "Description": "An account of a journey through Kenya, Tanzania, and Zambia captures the romance and desolation of East Africa and reveals the region's people, tensions, dreams, prejudices, and problems",
        "Category": " Travel , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "Why Am I Afraid to Tell You Who I Am? Insights into Personal Growth",
        "Authors": "By Powell, John",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Tabor Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Maine: An Explorer's Guide",
        "Authors": "By Tree, Christina, Steadman, Mimi",
        "Description": "Contains up-to-date information on travel in the state of Maine, from rustic hideaways to elegant places to dine and lodge, and including kids' events and regional activities",
        "Category": "",
        "Publisher": "Countryman Press",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Best of Smithsonian",
        "Authors": "By Smithsonian Institution",
        "Description": "Selected articles from the first ten years of the magazine look at wildlife, the environment, energy, technology, history, and the arts",
        "Category": "",
        "Publisher": "Harmony",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1981"
        }
    },
    {
        "Title": "How to Read a Poem",
        "Authors": "By Raffel, Burton",
        "Description": "An introductory text that is both an anthology of over 200 poems and a comprehensive exploration of the form. Over 100 poets featured; those most widely represented include Blake, Byron, cummings, Dickinson, Donne, Alan Dugan, Frost, Louise Gluck, George Herbert, Keats, Pope, Pound, Shakespeare, Wordsworth, and Yeats.",
        "Category": " Literary Criticism , Poetry",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Growing Up Jewish: or, Why is This Book Different from All Other Books?",
        "Authors": "By Moline, Jack and Simha, Marcia (ILT)",
        "Description": "Pokes fun at contemporary Judaism the lifestyles of American Jews, and the Yiddish language",
        "Category": " Humor , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Healing of Memories: Prayer and Confession Steps to Inner Healing",
        "Authors": "By Linn, Matthew",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Paulist Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Fishers of men: The way of the Apostles",
        "Authors": "By Bull, Robert J., Converse, Gordon N., and Crisler, B. Cobbey",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "And Only to Deceive (Lady Emily Mysteries, 1)",
        "Authors": "By Alexander, Tasha",
        "Description": "From New York Times bestselling author Tasha Alexander, a stunning novel of historical suspense set in Victorian England, meticulously researched and with a twisty plot that involves stolen antiquities, betrayal, and murderFor Emily, accepting the proposal of Philip, the Viscount Ashton, was an easy way to escape her overbearing mother, who was set on a grand society match. So when Emily's dashing husband died on safari soon after their wedding, she felt little grief. After all, she barely knew him. Now, nearly two years later, she discovers that Philip was a far different man from the one she had married so cavalierly. His journals reveal him to have been a gentleman scholar and antiquities collector who, to her surprise, was deeply in love with his wife. Emily becomes fascinated with this new image of her dead husband and immerses herself in all things ancient and begins to study Greek.Emily's intellectual pursuits and her desire to learn more about Philip take her to the quiet corridors of the British Museum, one of her husband's favorite places. There, amid priceless ancient statues, she uncovers a dark, dangerous secret involving stolen artifacts from the Greco-Roman galleries. To complicate matters, she's juggling two prominent and wealthy suitors, one of whose intentions may go beyond the marrying kind. As she sets out to solve the crime, her search leads to more surprises about Philip and causes her to question the role in Victorian society to which she, as a woman, is relegated.",
        "Category": " Fiction , Mystery & Detective , Traditional",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Henry IV, Part 1 (Shakespeare Made Easy)",
        "Authors": "By Shakespeare, William and Durband, Alan",
        "Description": "Here are the books that help teach Shakespeare plays without the teacher constantly needing to explain and define Elizabethan terms, slang, and other ways of expression that are different from our own. Each play is presented with Shakespeare's original lines on each left-hand page, and a modern, easy-to-understand \"translation\" on the facing right-hand page. All dramas are complete, with every original Shakespearian line, and a full-length modern rendition of the text. These invaluable teaching-study guides also include: 1. Helpful background information that puts each play in its historical perspective. 2. Discussion questions that teachers can use to spark student class participation, and which students can use as springboards for their own themes and term papers. 3. Fact quizzes, sample examinations, and other features that improve student comprehension of what each play is about.",
        "Category": " Literary Criticism , Shakespeare",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "The Prostate: Everything You Need to Know (Your Personal Health)",
        "Authors": "By Taguchi, Yosh and Wallwe, Adrian, Ph.D. (INT)",
        "Description": "Now that prostate health is openly discussed, more and more men and their families are looking for help in understanding this small but potentially problematic male organ. In this accessible, informative guide, eminent urologist Dr. Yosh Taguchi tackles the most common prostate problems -- benign prostate hyperplasia (BPH), prostatitis and cancer. Readers will learn about:    the anatomy and function of the prostate  the importance of regular check-ups  surgical options, including the two-stage prostatectomy  medication options, including drug names and suggested dosages  disorders that mimic prostate disease  thermal therapy  preventative measures  pain control  surgery issues and preparation  managing the disease  incontinence, impotence and erectile dysfunction  new developments in treatment.              Complete with diagrams, charts and case studies, Prostate offers clear and comprehensive information on what is known, what is still not clear and what remains conjectural about this most sensitive of male health concerns. Written by an expert who obviously cares for his patients and who believes that self-education in matters of health is one of the cornerstones of preventative medicine, Prostate is an important and timely book.",
        "Category": " Medical , Oncology",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Pleasers: Women Who Can't Say No-And the Men Who Control Them",
        "Authors": "By Leman, Kevin",
        "Description": "",
        "Category": " Self-help , Personal Growth , Self-Esteem",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "'Tis the Season to Be Murdered",
        "Authors": "By Wolzien, Valerie",
        "Description": "Exhausted after shopping for teenagers, struggling with cappuccino machines, and eating way too many cookies, Susan Henshaw is glad she hired \"The Holly and Ms. Ivy\" to cater her annual New Year's bash. But when the blond and buffed Z Holly, chef extraordinaire and notorious ladies' man, is found strangled in a van full of helium balloons, Susan starts hunting for a killer -- and a way to save her party!testtest",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "The Name of the Rose: including the Author's Postscript",
        "Authors": "By Weaver, William (TRN) and Eco, Umberto",
        "Description": "“A brilliantly conceived adventure into another time” (San Francisco Chronicle) by critically acclaimed author Umberto Eco.The year is 1327. Franciscans in a wealthy Italian abbey are suspected of heresy, and Brother William of Baskerville arrives to investigate. When his delicate mission is suddenly overshadowed by seven bizarre deaths, Brother William turns to the logic of Aristotle, the theology of Aquinas, and the empirical insights of Roger Bacon to find the killer. He collects evidence, deciphers secret symbols and coded manuscripts, and digs into the eerie labyrinth of the abbey (“where the most interesting things happen at night”) armed with a wry sense of humor and a ferocious curiosity.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Ovid (Marcus Corvinus Mysteries)",
        "Authors": "By Wishart, David",
        "Description": "This book is a complex and intriguing mystery set in Roman times. Banished by the Emperor Augustus, the great poet Ovid was to die in exile. Years after Ovid’s death, Marcus Corvinus, grandson of the poet’s patron, tries to arrange for the return of his ashes to Rome for burial. When official permission is refused, Corvinus makes the dangerous mistake of asking why the Emperor has forbid it.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Hodder & Stoughton",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Midlife Orphan: Facing Life's Changes Now That Your Parents Are Gone",
        "Authors": "By Brooks, Jane",
        "Description": "The word \"orphan\" may make us think of a child--but even self-sufficient adults can feel the pain of \"orphanhood\" when their parents are suddenly gone. Complicating the natural mourning process is the fact that this loss often occurs in our thirties, forties, or fifties--as we are raising our own children, watching them leave the nest, and facing other adjustments in our lives, from our jobs to our marriages to our health. This thoughtful exploration of a neglected subject explains the emotional impact of losing our parents in the midst of midlife--and why many underestimate it. Discussing such topics as changes in self-image, unresolved issues, guilt, sorrow, and anger, the emotional impact of inheritance, and the shifting of roles as a result of \"midlife orphanhood,\"Jane Brooks shows us how to find new sources of strength, in both ourselves and others, after our parents are gone.",
        "Category": " Psychology , Emotions",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Younger Than Springtime (Family Saga)",
        "Authors": "By Greeley, Andrew M.",
        "Description": "The bestselling author of A Midwinter's Tale returns with a heartfelt sequelFather Andrew M. Greeley returns to the saga of the O'Malley family with his signature blend of humor, classic American values and heart-rending storytelling.Charles \"Chucky\" Cronin has come home to Chicago in one piece after a chaotic tour in post WWII Germany.  And though his family thinks he's \"become a man,\" Chucky knows he still has a lot of growing up to do.  Anxious to attend Notre Dame and get his life back on in order, Chucky is quickly sidetracked by the beautiful, raven-haired, haunting (and haunted) Rosemarie, a girl as fresh-faced and clever as she is doomed.  Conflicts with a mob boss and a tendency to ruffle the feathers of those in charge combine to land Chucky in even more hot water. Luckily, a quick wit and an old fashioned sense of right and wrong (along with a dose of Heavenly help) save him when tensions reach the boiling point.  Can Chucky come of age in a difficult and heady time, holding on to his integrity while discovering the secret to love?",
        "Category": " Fiction , Family Life",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "When Work Doesn't Work Anymore: Women, Work and Identity",
        "Authors": "By McKenna, Elizabeth Perle and Perle, Liz",
        "Description": "A critical look at the effect of careerism on women's lives, based on extensive research and hundreds of interviews, exposes the costs exacted by the workplace and offers a plan for women to reclaim their identity and redefine success. 75,000 first printing. $75,000 ad/promo. Tour.",
        "Category": " Psychology , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Twanged (Regan Reilly Mysteries, No. 4)",
        "Authors": "By Clark, Carol Higgins",
        "Description": "A Week in The Hamptons can be Murder Sleuth Regan Reilly is hired as a bodyguard for singer Brigid O'Neill, a rising country star who has been receiving threatening \"love notes.\" Brigid also possesses a \"magical\" Irish fiddle said to be cursed-whoever takes it out of Ireland will have an accident or face death. Still, Brigid brings it to the Hamptons, where her band will perform at a Fourth of July concert. Chappy Tinka, heir to a thumbtack fortune, and his ditzy wife, Bettina, are their hosts. Regan joins them at \"Chappy's Compound,\" an oceanfront estate where they encounter Bettina's guru Peace Man, Chappy's bumbling sidekick Duke, a feng shui specialist obsessed with rearranging furniture-and a party guest found floating face-down in the pool. Is the curse of the fiddle real? Is there a murderer in the house? As the concert nears, the menace to Brigid grows, and Regan must discover the truth before it's too late...",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Four Seasons of the Chesapeake: Spring and Summer",
        "Authors": "By Hamer, Red",
        "Description": "",
        "Category": "",
        "Publisher": "Four Seasons Book Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1980"
        }
    },
    {
        "Title": "The Quickening of America: Rebuilding Our Nation, Remaking Our Lives",
        "Authors": "By Lappe, Frances Moore and Du Bois, Paul Martin",
        "Description": "I highly recommAnd Quickening as an extremely useful and practical guide. It reaffirms that personal and social change are intertwined; that each of us counts; that our lives do make a difference; and that, through involvement and by developing our skills, we can make an even greater difference. --ReverAnd Jesse L. Jackson, president and founder, National Rainbow CoalitionAn antidote to cynicism . . . an essential 'how-to' manual for anyone interested in translating values into positive results.--Ben Cohen, Ben & Jerry'sExploding the popular myths about public life, power, and self-interest that stop individuals from discovering the rewards of public involvement, this thoughtful resource offers practical advice from ordinary Americans on how to get more involved. Details guidelines anyone can use to master the skills required to be effective in public life.",
        "Category": " Psychology , Social Psychology",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Womans Complete Illustrated Guide to Sex: A Comprehensive Guide to Sexuality from a Feminine Point of View",
        "Authors": "By Quilliam, Susan",
        "Description": "Provides women explicit techniques designed to enhance pleasure, suggestions for dealing with various sexual problems, and information on safe sex.",
        "Category": " Psychology , Human Sexuality",
        "Publisher": "Fair Winds Pr",
        "Price Starting With ($)": "5.5",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Hoop Dreams: A True Story of Hardship & Triumph",
        "Authors": "By Joravsky, Ben",
        "Description": "To Arthur Agee and William Gates, basketball means literally everything. Their only escape from the grim streets of Chicago's West Side is onto the neighborhood courts, where they and their friends dream of playing in the NBA. For most it's just a forlorn hope, but Arthur and William are different: barely out of grade school, they already display the raw potential that just might make their dreams come true.Hoop Dreams began as a documentary film that tracked these two young men for almost five years as they struggled to turn their playground skills into the kind of basketball mastery that could earn them college scholarships - and maybe even a place in the pros. Critics from coast to coast hailed the film as one of the finest documentaries ever made, both a superb portrait of two gifted teenagers working their way through the tough, often cruel basketball machine, and a searing look at the harsh realities of inner-city life.In this remarkable book, award-winning journalist Ben Joravsky chronicles Arthur and William's battle to reach the top and tells the story that could not be told on film. His vivid prose evokes the experience of being plucked from the projects and offered a glittering future. He captures not only the moments of basketball glory at suburban St. Joseph High School, which produced superstar Isiah Thomas, but also the loneliness of being poor and black in an affluent, mostly white school and the overwhelming pressure to perform both on the court and in the classroom.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Turner Pub",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    }
]