[
    {
        "Title": "Much Ado about Nothing (Cambridge School Shakespeare)",
        "Authors": "By Shakespeare, William, Gibson, Rex (EDT), Berry, Mary, and Clamp, Michael",
        "Description": "This edition of Much Ado About Nothing, one of Shakespeare's most delightful and theatrically successful comedies, offers, along with a freshly edited text, an exceptionally helpful and critically aware Introduction and commentary. Paying particular attention in his Introduction to analysis of the play's minor characters, Sheldon P. Zitner discusses Shakespeare's social transformation of his source material, rethinking the attitudes to gender relations that underlie the comedy and determine its ruefully optimistic view of marriage. Interpretations are advanced less because they are arguable than because they are actable. Allowing for the play's openness to re-interpretation by successive generations of readers and performers, the editor provides a socially analytic stage history. Full notes and commentary continue previous editors' work of clarifying textual and performance problems of interest to both readers and actors.",
        "Category": " Literary Criticism , Reference",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Here's Johnny!: Thirty Years of America's Favorite Late-Night Entertainment",
        "Authors": "By Cox, Stephen",
        "Description": "A look at the soon-to-be-retired host of television's The Tonight Show celebrates Carson's tenure on the program with more than two hundred photographs and interviews with staff members and guests. Original. 25,000 first printing.",
        "Category": " Performing Arts , Comedy",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Rules for Aging: Resist Normal Impulses, Live Longer, Attain Perfection",
        "Authors": "By Rosenblatt, Roger",
        "Description": "Acclaimed and beloved prize-winning essayist Roger Rosenblatt has commented on most of the trends and events of our time. His columns in Time magazine and his commentaries on PBS's NewsHour with Jim Lehrer have made him a household word and a trusted friend of millions. Now, at the dawn of a new millennium, Rosenblatt offers the American people a survival manual-fifty-four gems of funny, brilliant, wise, indispensable advice. It doesn't matter: Whatever you think matters-doesn't. Follow this rule, and it will add decades to your life. It does not matter if you are late, or early; if you are having a bad hair day, or a no hair day; if your boss looks at you cockeyed, or if you are cockeyed; if you don't get that promotion, or if you do. It doesn't matter. Nobody is thinking about you: Yes, I know, you are certain that your friends are becoming your enemies; that your grocer, garbageman, clergyman, sister-in-law, and your dog are all of the opinion that you have put on weight. You are also sure that everyone spends two-thirds of every day commenting on your moral disintegration, denigrating your work, plotting your murder. I promise you: Nobody is thinking about you. They are thinking about themselves-just like you. A book to savor, a book to keep, and a book for all ages.",
        "Category": " Humor , Form , Essays",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Struggle for Russia",
        "Authors": "By Fitzpatrick, Catherine A. (TRN) and Yeltsin, Boris",
        "Description": "Crowds march in the streets. Shots ring out. Some imagine a bright and glorious future, while others predict utter ruin. Politicians scream across chambers at each other. Citizens struggle under the weight of economic shock therapy. Statues of Lenin are torn down and fast-food chains rise up. People begin to taste the sweetness of democracy and freedom. The military acts in shadows, its allegiances uncertain. The mafia spreads its influence. Ethnic divisions widen and the shouts of neofascists become louder. The nation begins to confront its past and to move toward a more just society. The old dictators act feverishly to hang on to their power and privilege. Democrats - still discovering just what democracy means - feel their way forward. Everything is held together only by a hope for a better future and everything is pulled apart by the darkness of history and the stubbornness of a system that will not fade quietly. This is Russia today.In The Struggle for Russia Boris Yeltsin, Russia's first democratically elected leader and the man at the vanguard of this second Russian revolution, gives a vibrant and detailed account of Russia's turmoil as it moves toward democracy and the free market. He does so in classic Yeltsin style: honestly, candidly, and passionately. The result is a tremendously revealing and exciting account of the past five years. He describes his stormy relationship with Mikhail Gorbachev; details the fateful August coup; reveals previously classified KGB documents concerning an array of topics from Lee Harvey Oswald to the KGB's arming of the IRA; describes the painful transition to a market economy; and gives us a detailed account of the October uprising that was - as Yeltsin now reveals - much more precarious than imagined. But The Struggle for Russia is much more than a history of the recent changes in what was once the Soviet Union. It is also a deeply personal account of Boris Yeltsin's life. We are with him as he sifts through KGB files, looking for evidence surrounding his father's persecution under Stalin; we are at his dinner table as he, his children, and his grandchildren laugh and live their very human lives; we are on planes and in cars, crisscrossing Russia and the globe; and we are with him alone, in a quiet office after everyone has left, in the hot steam of a Russian bathhouse, and in the silence of a sleepless night. As incisive personally as he is politically, Yeltsin reveals in his journal entries not only a nation struggling to change but a man struggling to lead the way. It is a remarkable glimpse inside the mind and heart of a leader as he guides his country forward.The Struggle for Russia is full of Yeltsin's trademark honesty, whether he is speaking about mistakes he's made or people he's encountered. He gives us a detailed and revealing view of the players in Russia's battle for democracy, and he also paints vibrant and perceptive portraits of other world leaders. We join Yeltsin for a beer with Vaclav Havel, for a walk on the beach with Bill Clinton, for a morning swim in a mountain stream with Helmut Kohl, and for tea with Margaret Thatcher. And perhaps most movingly, we join him under fire, as he risks his career and his life to fight for a better future.The Struggle for Russia is a work that manages to speak of both one man's and one nation's dreams and doubts, and in it we encounter Russia's past, its present, and a striking view of the challenges ahead. Never before has a major head of state made public his journal while he or she was still in power. This is a rare and monumental event, and the result is a book that not only is a riveting read, but is itself truly part of history.",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Writing Articles from the Heart: How to Write & Sell Your Life Experiences",
        "Authors": "By Holmes, Marjorie",
        "Description": "Advises would-be writers how to develop their own resources, be creative, and when and how to get a remuneration for their effort",
        "Category": " Reference , Writing Skills",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Women and Doctors: A Physician's Explosive Account of Women's Medical Treatment- And Mistreatment-In America Today and What You Can Do About It",
        "Authors": "By Smith, John M.",
        "Description": "Dr. Smith offers informed and reasonably spelled out opinions and illustrative anecdotes and case histories.  Shame on the publisher for failing to provide an index and for saddling the book with a grandiose subtitle:  A Physician's Explosive Account of Women's Medical Treatment, and Mistreatment, in America Today and What You Can Do About It.  Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Social Science , General",
        "Publisher": "Atlantic Monthly Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Where the Bodies Are Buried (Jeri Howard Mysteries)",
        "Authors": "By Dawson, Janet",
        "Description": "Welcome to Corporate America. Where the CEOs make millions and the peons get squeezed. Where power corrupts and a seven-figure bonus may be worth killing for. Where even San Francisco P.I. Jeri Howard finds herself dangerously outmaneuvered - and in treacherous company.When Jeri Howard's new client, Rob Lawter, takes a header through his living room window soon after he's hired her, Jeri is in a quandary. Lawter, a paralegal at Bates, Inc., a food-processing firm, had received a threatening anonymous note, sent because he was about to blow the whistle on some serious corporate cover-up.So she goes undercover in Bates's legal department, determined to expose Lawter's killer. What Jeri finds is that murder tops this corporation's agenda, as employees pay the ultimate price to keep a deadly health scare out of the media.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Used to Kill",
        "Authors": "By O'Donnell, Lillian",
        "Description": "Although she has experienced her share of problems, private investigator Gwenn Ramadge has never seen a situation as troublesome as that of her client Emma Trent. Police believe the twice widowed Trent is responsible for the deaths of both husbands. Unable to prove anything when her first husband died, the police are determined to nail her now for the death of number two, despite scant physical evidence. Because they have a motive that links Trent so completely to this crime, even normally optimistic Gwenn has doubts about her ability to prove Emma Trent's innocence.But the case takes an unexpected turn when Gwenn discovers the presence of a mysterious woman whose life is somehow entwined with Trent's. Aware that this shadowy figure may be the key to her client's defense, Gwenn must use every trick in the book to track her down. Convinced that Trent's arrest would be a miscarriage of justice, Gwenn vows to unmask the real killer and set Trent free - no matter what the cost.With Used to Kill, it's easy to see why Publishers Weekly calls Gwenn Ramadge \"another winner, an attractive and intelligent private eye.\"",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Wildfire",
        "Authors": "By Goddard, Kenneth W.",
        "Description": "Henry Lightstone, Fish and Wildlife Department undercover expert, and his crack team of wildlife agents are back in business on the cutting edge of environmental protection.Running a covert investigation, Lightstone stumbles across the activities of a vicious professional assassin and discovers a link to an old nemesis: the ICER Committee, a ruthless junta of international industrialists and financiers bent on destroying the environmental movement through violence and terror.",
        "Category": " Fiction , General",
        "Publisher": "Forge",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Yankee Doodle Dead (Death on Demand Mysteries, No. 10)",
        "Authors": "By Hart, Carolyn G.",
        "Description": "The most delectable sleuthing couple since Nick met Nora, Annie and Max Darling manage to find quite a bit of murder in their allegedly safe and serene South Carolina island resort. After all, murder is Annie's business--well sort of. She's the proprietor of the popular Death on Demand mystery bookstore and cafe, and her establishment seems to attract trouble like Annie's pesky felines, Dorothy L. and Agatha, attract furballs. And just when Annie and Max settle down for some quality, and much needed, time together, some corpse always rears its ugly head. Now as they anticipate a festive summer, the irresistible duo watch their Fourth of July holiday explode not only with fun and fireworks, but with murder as well.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "1000 Beautiful House Plants and How to Grow Them",
        "Authors": "By Kramer, Jack",
        "Description": "A guide to indoor plants and flowers provides advice on selecting, potting, watering, feeding, and propagating them",
        "Category": "",
        "Publisher": "H.N. Abrams",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Searchers",
        "Authors": "By Browning, Scott",
        "Description": "",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Cougar Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Presidential Profiles: Religion in the Life of American Presidents",
        "Authors": "By Bonnell, John Sutherland",
        "Description": "",
        "Category": "",
        "Publisher": "Westminster Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Sanctuary: A Peter Decker/Rina Lazarus Mystery (Peter Decker & Rina Lazarus Novels)",
        "Authors": "By Kellerman, Faye",
        "Description": "L.A. homicide detective Peter Decker and his wife, Rina Lazarus, become involved in a series of murders, the international diamond trade, a bizarre religious cult, and two teen-aged brothers who may or may not have killed their parents. 125,000 first printing. $105,000 ad/promo. Tour.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Shadowtown",
        "Authors": "By Lutz, John",
        "Description": "New York City cop E.L. Oxman hunts for the killer of an ex-cop on the set of the popular soap opera \"Shadowtown\" only to be hampered by the increasingly blurred distinction between television and reality",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mysterious Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Strange gifts: Eight stories of science fiction",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Nelson",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Rogue Wave",
        "Authors": "By Dunlap, Susan",
        "Description": "Medical examiner-turned-detective Kiernan O'Shaughnessy journeys to Big Sur to investigate a hit-and-run accident that left a man brain-damaged, but the prime suspect, a female fishing boat captain, suddenly disappears",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "23.11",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "The Dowbeaters: How to Buy Stocks That Go Up",
        "Authors": "By Cobleigh, Ira U",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The Harvard Mystique: The Power Syndrome That Affects Our Lives from Sesame Street to the White House",
        "Authors": "By Lopez, Enrique Hank",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Oedipus Rex (Dover Thrift Editions)",
        "Authors": "By Sophocles",
        "Description": "Considered by many the greatest of the classic Greek tragedies, Oedipus Rex is Sophocles' finest play and a work of extraordinary power and resonance. Aristotle considered it a masterpiece of dramatic construction and refers to it frequently in the Poetics.In presenting the story of King Oedipus and the tragedy that ensues when he discovers he has inadvertently killed his father and married his mother, the play exhibits near-perfect harmony of character and action. Moreover, the masterly use of dramatic irony greatly intensifies the impact of the agonizing events and emotions experienced by Oedipus and the other characters in the play. Now these and many other facets of this towering tragedy may be studied and appreciated in Dover's attractive inexpensive edition of one of the great landmarks of Western drama.",
        "Category": " Drama , Ancient & Classical",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Your Prostate What Every Man over 40 Needs to Know Now",
        "Authors": "By Cunningham, Chet",
        "Description": "",
        "Category": "",
        "Publisher": "United Research Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "We, the British",
        "Authors": "By Richard, Ivor",
        "Description": "An examination of contemporary British society analyzes the country's political life, industry, class system, arts, morality, police force, and army",
        "Category": " History , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Major League Dad",
        "Authors": "By Lewis, Gregg, Burke, Tim, and Burke, Christine",
        "Description": "Shares the story of All-Star pitcher, Tim Burke, his decision to leave baseball, and his devotion to the four children he and his wife Christine adopted, who might otherwise have never found homes",
        "Category": " Family & Relationships , Parenting , Fatherhood",
        "Publisher": "Focus on the Family Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Miami, It's Murder",
        "Authors": "By Buchanan, Edna",
        "Description": "Miami seethes with restless energy, a city where skies are always blue and life and death are seldom simple. In Miami, It's Murder, Pulitzer Prize-winning writer Edna Buchanan takes us there again. Her first Britt Montero novel, Contents Under Pressure, was acclaimed as one of the year's best mysteries by the Los Angeles Times and the San Francisco Chronicle, and won legions of fans for her unforgettable heroine.Now, in Miami, It's Murder, Britt is back - and the tough, charismatic Cuban-American reporter is investigating a series of bizarre deaths involving terminal sex, electrocution, and freshly poured concrete.With a dying detective as her friend and source, Britt probes the unsolved sex murder of a small girl, which may implicate the rich and powerful front-runner in the governor's race. She also follows the trail of a terrifying serial rapist who ambushes career women in the restrooms of the gleaming downtown towers that spike the Miami skyline.The quest takes her from the sterile and antiseptic police crime lab and its forensic experts into the dark heart of Santeria, a blood-fueled religion linked to spells, symbols, sacrifice, and the occult. Enraged at Britt's stories, the rapist escalates his violence and focuses his obsession on her.Stalked by the shadowy rapist, on the trail of a serial killer, Britt comes ever closer to learning the shocking truth as tensions mount and the stories intersect with edge-of-the-seat suspense and an astonishing conclusion.Britt is earthy, edgy, valiant, and self-deprecating, and her best friend Lottie, a flame-haired, cowboy-booted Texan news photographer, is every reporter's dream shooter. News junkies, they are hooked on adrenaline in the two cities they love. Both are named Miami. One is the Miami that erupts in explosive violence, the other is the Miami of whispering palms, purple twilights, and pink-painted dawns.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Health and Human Values: A Guide to Making your own Decisions",
        "Authors": "By Harron, Frank",
        "Description": "Although modern developments in medical science have produced some dramatic benefits, they have also raised difficult and sometimes controversial moral and legal questions. How much information should a physician give to a patient? If preserving life means increasing suffering, should every means be exercised to prolong life? Should we screen the population and reduce the reproductive freedom of individuals with genetic diseases? In an era of staggering increases in health care costs, should the new medical benefits go to those who can afford them or should the government devise systems that distribute risks and benefits more equally?Frank Harron, John Burnside, and Tom Beauchamp examine these and many other questions confronted today by health care professionals, patients and their families, policy makers, and all informed, responsible citizens. They explore such provocative problems as euthanasia, abortion, in vitro fertilization, health care and distributive justice, truth-telling and informed consent, determination of death, and genetic engineering. Their approach reaches behind the headlines and beyond the controversy to enable the reader to make his or her own informed decisions. Each chapter contains actual case studies followed by questions that highlight the dilemmas embedded in the case. The main portion of the chapter provides background examination of key medical, philosophical, legal, and public policy factors. Excerpts from leading writers in medicine, law, theology, and philosophy and an annotated bibliography of other printed and audio/visual resources are provided for every topic. The capabilities that medical science has provided have come upon us before we are ready with a working consensus. Each person must find his or her own bearings in this era of rapid transition in values and then contribute to society’s struggle to make fair and enlightened laws and policies. This book assists the reader to cope and to participate in the crucial, even vital, decisions we all face.",
        "Category": " Medical , Ethics",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Introduction to Transformational Syntex",
        "Authors": "By Fowler, Rogger",
        "Description": "",
        "Category": "",
        "Publisher": "Routledge",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1971"
        }
    },
    {
        "Title": "Jana (A Tale of Decadence)",
        "Authors": "By Veronese, David",
        "Description": "Eddie Verlaine is an American expatriate, hustler, epicure and small-time crook. His search for flea markets, drugs and bric-a-brac takes him to Amsterdam where he meets Jana, part femme fatale, part lucky charm. Jana introduces Eddie to the menacing Werner and Margo, his raunchy sidekick. If Eddie will take a large supply of drugs to London, he will have acquired three friends for life. Eddie is just about wise enough to know that all is not what it seems. Like a character out of Henry James, he is the American 'innocent' lost in byzantine, decadent Europe.Speedy, smart and cynical, Jana introduces a new thriller voice totally suitable for our noir fin-de-siecle.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Serpent's Tail",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "How to Make Nuclear Weapons Obsolete",
        "Authors": "By Jastrow, Robert",
        "Description": "In this definitive explanation of the \"Star Wars\" defense plan, a noted scientist describes how the latest advances in science and technology can eliminate the threat of nuclear destruction",
        "Category": " Political Science , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "Sandra Nichols Found Dead: A Novel",
        "Authors": "By Higgins, George V.",
        "Description": "Appointed by former classmate Judge Henry Lawler to prosecute the boyfriend of a murdered woman, Jerry Kennedy has difficulty proving the guilt of the defendant, a more than likely suspect, when the victim's body is discovered long after her death",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Outercourse: The Be-Dazzling Voyage Containing Recollections from My Logbook of a Radical Feminist Philosopher (Be-Ing on Account of My Time/Space)",
        "Authors": "By Daly, Mary",
        "Description": "",
        "Category": " Social Science , Sociology , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Oracle: The Complete Reference, Electronic Edition",
        "Authors": "By Loney, Kevin and Koch, George",
        "Description": "",
        "Category": " Computers , Database Management , General",
        "Publisher": "Oracle Pr",
        "Price Starting With ($)": "8.41",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Red Tape : Adventure Capitalism in the New Russia",
        "Authors": "By Thomas, Bill and Sutherland, Charles",
        "Description": "Not long ago the word for doing business in the former Soviet Union was synonymous with criminality. Not anymore. In the New Russia it's perfectly legal - and can be extremely lucrative. But that doesn't mean it's easy, especially for Americans, whom most Russians view as an amalgam of Santa Claus and the Devil.The product of firsthand experience and observation, Red Tape cuts through the mystery and the muddle of what's going on in a part of the world that went from 1984 to Alice in Wonderland almost overnight. With razor wit and hardearned wisdom, the authors spotlight the pitfalls as well as the hidden economic potential awaiting entrepreneurs in the former Land of Lenin. They provide insight and offer answers as important as they are elusive to anyone trying to deal with or simply understand the legacy of seventy-four years of Communism.Here, then, is an eye-opening account of a world where banks steal from their depositors with an elan that would make our own S&Ls blush; where trade laws can change on a daily basis and nobody, including the government, is entirely sure who's in charge; where lawyers have nothing to do with laws, which in any case seldom operate; where accounting is an art of illusion; where former Communist bosses have rushed to become robber barons; where currency is worth less than monopoly money, and the rules of the game are constantly changing; where the black market is the heart of free enterprise, and the military peddles defense industry secrets to anyone who'll buy; where doing lunch is the first lesson in doing business; and above all, where truth is the rarest and least valued of commodities.Red Tape offers cautionary tales of Western entrepreneurs who could swap war stories with Napoleon in Moscow, as well as such stunning success stories as those of Pepsico and McDonald's. Covering all the bases, there are profiles of leading Russian wheeler-dealers; a cram course in Russian psychology; a marvelous chapter on the emerging Russian woman; and delightfully, definitively more.There is everything, in short, to make Red Tape stand alone as the essential guide to making dollars and sense out of Russia today.",
        "Category": " Business & Economics , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Skylife: Space Habitats in Story and Science",
        "Authors": "By Benford, Gregory (EDT) and Zebrowski, George (EDT)",
        "Description": "Respected science fiction author-editors Gregory Benford and George Zebrowski present an anthology, with unique color illustrations, that is filled with the excitement, poetry, and adventure awaiting us in the limitless final frontier that is the sky. For years, science fiction has portrayed humankind growing away from the cradle of Earth through spacecraft, space stations, and space homes. Skylife features stories by such masters of science fiction as Arthur C. Clarke, Isaac Asimov, Ray Bradbury, Larry Niven, Joan Vinge, and James Blish-in addition to several essays by scientists-all of which come together in one spectacular volume to provide a picture of our possible future beyond Earth.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "24.33",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "A Sense of Place: Listening to Americans",
        "Authors": "By Lamb, David",
        "Description": "David Lamb is a remarkable reporter and story teller. His passion is the people of America - their histories, their lives, the dramas that absorb them. In his hands, these people become figures in a coherent, compelling frieze of America in the late twentieth century. In David Lamb's America, people greet each new day with a kind of gritty realism, steadfastly optimistic in the face of disappointments, large and small. This is an original and colorful look at ordinary Americans whose lives are vastly different from those of their urban counterparts. They are rendered extraordinary by David Lamb's stunning reportorial gifts.A Sense of Place is about cowboy poets, hobos, farmers, and ranchers struggling on the land they adore. It's about small towns that have lost many of their children to the cities but doggedly hang on. With David Lamb as our guide, we journey to isolated reaches of Idaho, North Dakota, and Montana, where the nearest neighbor can be fifty miles away and the inhabitants speak unabashedly about their love of a threatened way of life. In the eyes of the men and women he meets as he travels the length and breadth of that neglected portion of the country he calls \"the empty quarter,\" we remain a young nation, though we are no longer youthful. Our exuberance, he finds, has been tempered by caution. In countless conversations from Maine to Alaska, Americans speak of a bittersweet longing for the past, as though no one knows quite what to make of the social and economic upheavals that have swept across the land. Yet no one David Lamb encounters talks of wanting to turn back the clock. They talk about community and holding on to all that is good and their search for what one New England mill worker calls \"the comfort zone\" of life.In his introduction, David Lamb states his intentions clearly. \"My intent,\" he says, \"is not to dwell on political issues or to recite a litany of national problems. Rather, I look on A Sense of Place as a deliberately selective and personalized portrait of America and some of her people. This is a book about what happens to the pioneer spirit when the last frontier has been settled.\" A Sense of Place is about the American outback, once exploited for its natural resources and now caught between survival in its original form and selling out to freeways, fast food, and shattered values. It is an unforgettable portrait of a ubiquitous and too often invisible America seldom celebrated - haunting, poignant, and proud.",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "New profits from the monetary crisis",
        "Authors": "By Browne, Harry",
        "Description": "",
        "Category": "",
        "Publisher": "Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "100 Questions Every Working American Must Ask",
        "Authors": "By Brown, Carolann",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Dearborn Trade Pub",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "American houses",
        "Authors": "By Langdon, Philip",
        "Description": "",
        "Category": "",
        "Publisher": "Distributed by Workman Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Step-By-Step Table Decorating",
        "Authors": "By Sutherland, Neil, McDonnell, Jane, and Tanner, Steve",
        "Description": "Easy-to-follow instructions guide readers through more than seventy inspirational ideas for table decorating, covering a wide variety of occasions and featuring templates and diagrams for the projects covered.",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "New Technologies for Security and Arms Control: Threats and Promise (AAAS publication)",
        "Authors": "By Arnett, Eric H. (EDT)",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Amer Assn for the Advancement of",
        "Price Starting With ($)": "7.43",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Solaris Advanced System Administrator's Guide",
        "Authors": "By Winsor, Janice and Windor, Janice",
        "Description": "",
        "Category": " Computers , General",
        "Publisher": "Ziff Davis Pr",
        "Price Starting With ($)": "13.98",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Where Evil Sleeps",
        "Authors": "By Wesley, Valerie Wilson",
        "Description": "Tamara Hayle is after some much-needed R&R down in sunny Kingston, Jamaica, when she is befriended by a chatty fellow tourist from Jersey. Against her better judgment, Tamara joins her new friend, Lilah Love and Lilah's two male traveling companions for a night on the town; the result is murder. Tamara suspects Lilah, although that lead eventually turns very cold. More murder, mayhem, and a tryst with a man from her past all put Tamara in the path of a killer, until she finally finds the spot where evil sleeps.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Vespers: A Novel of the 87th Precinct",
        "Authors": "By McBain, Ed",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Whirlwind",
        "Authors": "By Clavell, James",
        "Description": "During the tumultuous days just after the Shah's departure from Iran, Andrew Gavallan, managing director of a British-run helicopter company secretly controlled by the Noble House of Hong Kong, faces financial ruin until he devises a desperate plan",
        "Category": " Fiction , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "American Government and Politics Today",
        "Authors": "By Schmidt, Steffen W., Bardes, Barbara A., and Shelley, Mack C.",
        "Description": "",
        "Category": "",
        "Publisher": "West Group",
        "Price Starting With ($)": "7.46",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "A Sports Bestiary",
        "Authors": "By Plimpton, George",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "A Thirst For Rain",
        "Authors": "By Carrington, Roslyn",
        "Description": "Set in the northern foothills of Trinidad during a dry season more intense than any in memory, A Thirst for Rain captures the island that isn't seen by tourists - one where men and women struggle side by side in the cramped, dusty communal yard of a small hillside neighborhood ... and where lives inevitably become entangled.There is Myra, a proud, sensuous, hardworking woman who finds blessed release in her own restless desires; Odile, Myra's defiant teenage daughter who risks her one chance to escape the family's poverty; Sebastian, Myra's senile father who has begun to follow his fantasies into a world of trouble; Slim, Myra's worthless street vendor boyfriend who spends as much time seducing young women as he does selling cheap trinkets; Jacob, the once-famous West Indian stickfighter who thought the hero in him was long dead, until he meets Myra. And Rory, the boy next door whose desperate need for Odile's love may destroy everything before the rains come.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Personal Finance in Your 20s and 30s",
        "Authors": "By Fisher, Sarah Young and Shelly, Susan",
        "Description": "You're no idiot, of course.  You're financially independent:  You pay rent, utilities, and loans all out of your own paycheck. You realize that your parents had to cut the cord sooner or later, and you're proud of how well you've adjusted.  But when it comes to saving money for the long haul, you feel like an astronaut whose oxygen cord has been cut.  Don't drift into a financial black hole yet!  The Complete Idiot's Guide to Personal Finance in Your 20s and 30s gives you an edge so you can get through financial hardships now, invest for the future, and even afford a luxury item  once in a while.  In this Complete Idiot's Guide, you get:",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Pregnancy & Childbirth",
        "Authors": "By Gliksman, Michele Isaacs and Digeronimo, Theresa Foy",
        "Description": "You're no idiot, of course.  You know that being pregnant isn't going to be easy, and having a baby is going to be even harder. But when it comes to facing the discomfort, pain, and body changes that lie ahead for you in the next nine months, you feel like crying like a baby.  Don't give yourself a pacifier just yet!  The Complete Idiot's Guide to Pregnancy and Childbirth tells you everything you need to know to be an active participant in the development and birth of your baby. In this Complete Idiot's Guide, you get:",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Fatherhood (Complete Idiot's Guides (Lifestyle Paperback))",
        "Authors": "By Osborn, Kevin",
        "Description": "You’re no idiot, of course.  You know that life isn’t like an old sitcom—when TV dads like Mike Brady or Ward Cleaver always had just the right answer for Greg, Marcia, or the Beaver. But when it comes to earning the title “World’s Greatest Dad,” you feel like you’re always going to be more like the father from Married with Children than the one from Father Knows Best.    Don’t retire your cardigan just yet! The Complete Idiot’s Guide® to Fatherhood answers all the questions any expecting, new, or veteran father could have on topics ranging from communication and ground rules to privileges and punishment. In this Complete Idiot’s Guide®, you get:      Commonsense advice from a veteran dad on how to strike a loving but firm balance.    Practical tips on helping your spouse during pregnancy.    Useful instruction on care and handling of a newborn and a toddler.    Smart strategies for keeping your kids safe—and yourself sane!—in the turbulent adolescent years.    A survival guide for circumstances such as divorce, stepparenting, and single parenting.",
        "Category": " Family & Relationships , Parenting , Fatherhood",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The Reindustrialization of America",
        "Authors": "By Business Week",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw Hill Book Co.",
        "Price Starting With ($)": "16.45",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The Titanic: End of A Dream",
        "Authors": "By Wade, Wyn Craig",
        "Description": "Recreates the events surrounding the 1912 sinking of the Titanic and the U.S. Senate investigation of the disaster, an investigation of the ship's American owners and the sinking itself",
        "Category": " History , General",
        "Publisher": "Penguin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "How to Buy Mutual Funds the Smart Way (Dearborn Money Maker Kit)",
        "Authors": "By Littauer, Stephen L.",
        "Description": "Discusses the advantages of investing in mutual funds, describes ways to save money and defer taxes, and lists no-load mutual funds",
        "Category": "",
        "Publisher": "Dearborn Trade Pub",
        "Price Starting With ($)": "6.32",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Light Desserts",
        "Authors": "By Ojakangas, Beatrice A.",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Jerry Falwell and the Jews",
        "Authors": "By Simon, Merill",
        "Description": "",
        "Category": " Social Science , Jewish Studies",
        "Publisher": "Jonathan David Pub.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Joe and Betsy the Dinosaur (I Can Read Level 1)",
        "Authors": "By Hoban, Lillian",
        "Description": "Joe and his pet dinosaur, Betsy, are ready for a fun-filled day in the snow. But as soon as they go out . . . Kerplunk!Crash!Bang! Betsy slides down the hill and crashes right through the ice, her big feet samsh the steps of the lions' den, and her sneeze blows the chimney off the bears' house. Poor Betsy! She's too big for her own good -- or is she?Lillian Hoban tells a warm and funny story that's just right for beginning readers.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Out to Work: The History of Wage-Earning Women in the United States",
        "Authors": "By Kessler-Harris, Alice",
        "Description": "A history of American women and their work since colonial times focuses on society's changing expectations of women",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1983"
        }
    },
    {
        "Title": "Resort to Murder (Henrie O Mysteries)",
        "Authors": "By Hart, Carolyn G.",
        "Description": "Carolyn Hart's ex-reporter sleuth, Henrietta \"Henrie 0\" O'Dwyer Collins, joins a wedding party in glorious Bermuda -- only to discover that death is an uninvited guest.Resort To MurderRetired Pulitzer Prize-winning journalist Henrietta Collins no longer races around the globe in pursuit of news. But her talent for troubleshooting and her zest for life are much needed at a family gathering in sunny Bermuda, where murder prowls the halls of a luxury hotel. Henrie 0 has come to the island with her grandchildren for the remarriage of their father, Lloyd Drake. Henrie O's former son-in-law plans to marry Connor Bailey, a beautiful widow with a dark past and a knack for attracting men. Only a year earlier, the resort manager's husband fell from a tower to his death after quarreling with Connor. And now it seems that his restless spirit is haunting the hotel -- and perhaps seeking revenge.Henrie 0 has no patience for bogus supernatural appearances, no matter how artfully done. But when she sets out to unmask the \"ghost's\" creator, she soon realizes there's much more at stake.A second death -- a fatal fall from a cliff -- makes it clear to Henrie 0 that great evil is afoot in this elegant enclave kissed by warm turquoise water, glistening pink sands, and balmy ocean breezes. With everyone connected with the once-joyous planned union of Lloyd and Connor now both a suspect and a potential target of a fiendishly relentless killer, Henrie 0 is gravely concerned for the well-being of her loved ones. It is more than motivation enough for the accomplished amateur sleuth to take investigative matters into her own able hands despite the risks. Decades of experience have taught her that there are some lethal secrets that haunt both the innocent and the guilty alike, vengeful spirits who will not rest until some terrible blood debt has been repaid in full.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Reality Therapy: A New Approach to Psychiatry (Perennial Library)",
        "Authors": "By Glasser, William",
        "Description": "Glasser's classic bestseller, with more than 500,000 copies sold, examines his alternative to Freudian psychoanalytic procedures, explains the procedure, contrasts it to conventional treatment, and describes different individual cases in which it was successful.",
        "Category": " Psychology , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1975"
        }
    },
    {
        "Title": "The Racing Edge",
        "Authors": "By Turner, Ted",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "6.43",
        "Publish Date": {
            "Month": "April",
            "Year": "1979"
        }
    },
    {
        "Title": "People Have More Fun Than Anybody: A Centennial Celebration of Drawings and Writings by James Thurber",
        "Authors": "By Rosen, Michael J. (EDT) and Thurber, James",
        "Description": "In this centennial volume of previously uncollected work, James Thurber continues to flourish. Here is the pleasure of recognizing this comic genius at work again, with his suspicious, civilized, unsettling wit. Included are eighteen prose pieces and over seventy-five drawings by the only cartoonist who could claim to draw \"abstract things like despair, disillusion, despondency, sorrow, lapse of memory, exile . . . sometimes in a shape that might be called Man or Woman.\" Here are drawings with such contemporary smarts that they still sting, including dozens of reports from the front line in that cold war between the sexes.This is Thurber at his most entertaining, praising things canine in two marvelous tributes, musing over the promises of mail sweepstakes, confessing his aversion to anything mechanical, puzzling over the animal kingdom's curious uprisings, reconsidering the value of Byrd's claiming of the icy lands of Antarctica (\"Are we landowners or ice dealers? Are we men or penguins?\"), and observing the fate of sex. For good measure, Michael Rosen offers the recipe for Thurber's favorite birthday cake, the Never-Fail Devil's Food.",
        "Category": " Humor , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "An Italian Affair",
        "Authors": "By Fraser, Laura",
        "Description": "1. Why does Fraser choose to use a second-person narrative voice to recount her personal experiences? Does this effectively draw the reader into her personal experiences? How does it affect the reader’s ability to relate to or sympathize with her? 2. How does the epigraph from Boccaccio’s Decameron relate to An Italian Affair ? 3. Fraser peppers her story with comparisons between American and Italian men. For instance, she writes, “Italian men, unlike American men, like to flirt even when there’s no chance of any tangible outcome” [p. 64]. In Fraser’s experiences, how do American, Italian, and Parisian men differ in their treatment of and relations with women? Are her criticisms of American men legitimate? 4. As the year during which her ex-husband, Jon, left her comes to a close, Fraser celebrates her progress from depression to the “up-and-about phase” of recovery [p. 58]. What is this recovery process like for Fraser? Does her conversation with Jon in the epilogue [pp. 224–6] bring satisfying closure to her marriage? 5. Referring to the professor, Fraser comments that it is good for her to be in a relationship with someone whose “defects you see but don’t criticize” [p. 217]. Does she learn to apply this lesson in her other relationships, or is that impossible? How would Fraser compare the professor’s defects to Jon’s? Would this be a fair comparison? How might Fraser’s appreciation for the professor be affected if he lived in San Francisco? 6. If Fraser were asked at the beginning of her affair with the professor why her marriage ended, how might she respond? Would she have a different answer if she were asked at the conclusion of her affair? What does each relationship teach Fraser about herself? 7. Is Fraser successful in keeping her growing feelings for the professor in check? Does she prevent herself from falling in love with him? Does Fraser have reason to believe that he is also holding feelings back? How do these checks and balances between the heart and the mind affect a relationship? 8. How is Fraser’s appreciation of San Francisco enhanced by the professor’s visit? If San Francisco can be interpreted as a metaphor for Fraser herself, is the professor’s visit a turning point in Fraser’s voyage of emotional self-recovery? 9. According to the professor, “The problem with Americans . . . is they think a little affair will destroy a marriage. How can they be so claustrophobic? It puts far too much pressure on the marriage. That’s what will ruin a marriage” [p. 36]. How does Fraser’s experience in An Italian Affair cause her to reexamine her views on divorce and marriage and the rules and boundaries that govern each institution? Are the reader’s opinions affected? Are you inclined to judge Fraser favorably or unfavorably? What about Jon or the professor? 10. Compare Fraser’s feelings as a female traveling alone to Ischia [p. 22] with her arrival alone in Morocco [p. 208]. Does her confidence as a lone female traveler evolve over the course of her memoir? 11. Fraser describes her everyday life in San Francisco between the descriptions of her travels, but the reader learns of the particulars of her romantic history as Fraser updates the professor each time they are reunited. Does viewing Fraser’s dating experiences through the eyes of the professor affect the reader’s interpretation of them? Does it affect the reader’s opinion of Fraser? 12. Fraser captures the atmosphere of her travels through language and imagery that appeal to the senses of sight, smell, and taste. Which place did Fraser appear to enjoy the most and why? What spot was most enticing to you and why? 13. What are Fraser’s standards for “la bella vita” [pp. 9, 207, and 220]? 14. How do Fraser’s friendships with women sustain her in ways that her friendships with men do not? 15. Why is the book called An Italian Affair ? How does the fact that the professor and Fraser don’t speak each other’s native languages change their relationship? How does speaking Italian together affect their intimacy?",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "A Danger of Democracy: The Presidential Nominating Process",
        "Authors": "By Sanford, Terry.",
        "Description": "",
        "Category": " Political Science , American Government , National",
        "Publisher": "Westview Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1981"
        }
    },
    {
        "Title": "Advertising photography",
        "Authors": "By Salomon, Allyn",
        "Description": "",
        "Category": "",
        "Publisher": "Amphoto Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Alone in America: The Search for Companionship",
        "Authors": "By Bernikow, Louise",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "Adam Lyal's Witchery Tales; the Darker Side of Old Edinburgh",
        "Authors": "By Lyal, Adam",
        "Description": "",
        "Category": "",
        "Publisher": "Moubray House Press",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Tunkashila: From the Birth of Turtle Island to the Blood of Wounded Knee",
        "Authors": "By Hausman, Gerald",
        "Description": "Tunkashila, which means \"grandfather\" in Lakota, is the epic tale of Native America as told through Indian eyes. The Southwest storyteller, Gerald Hausman, using mythological works like Ovid's Metamorphoses, and Biblical epics like Genesis as his inspiration, has constructed a sweeping narrative that tells the saga of Native American heritage - from creation, to the formation of Turtle Island, or earth, to the battle at Wounded Knee, where the tale ends.Retelling over eighty Indian stories that have been handed down to us from antiquity, Hausman has assembled a great pageant of mythological characters into a circle of highly anecdotal myths: the myths of creation; the myths of love, loss, and leaving; the myths of power; the myths of war; and the myths of two worlds, one white and one red.Tunkashila's creation begins with our original parents, Sun Father and Mother Earth; their rebellious twins - known as the Monster Slayers; the holy people of earth, air, water, and fire; and a spectacular carnival of animal and insect people, who act in a cosmology of co-creation. From these central figures, their children and sacred relations, come the stories themselves, all based on oral tale: we read of the Abalone Girl who fell in love with a whale; of the story of Mountain Singing, where a mortal pursues a goddess and discovers the consequences; of Tall Man, who followed Red Shell down to the underworld only to see her shade disappear; of Blue Elk, the mute boy, who was given the gift of voice through the antlers of an elk; and of an all-male clan of the River Crows that was destroyed by a white man's plague. Mythologizing actual events, Hausman finally chronicles the decline of Turtle Island, guiding the reader on a haunting journey through the ruined, wraith-like terrain of late nineteenth-century Native America.Tunkashila is a noble work that can be read from start to finish, but also can be dipped into, for each story is complete in its own right. The singular beauty of myths is that they teach us that nothing is lost that cannot be retrieved. It is time to learn and love by listening to the old voices, the grandfather voices of stones and streams, of all things that speak to us that remind us that it is not too late to live in peace.",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "The Peacekeepers",
        "Authors": "By Bova, Ben",
        "Description": "When four ancient cities are destroyed in a nuclear exchange, a force known as the Peacekeepers comes into being, charged with preventing any nation from attacking another with nuclear weapons. However, their power is soon challenged by a renegade terrorist with six nuclear bombs.At the publisher's request, this title is being sold without Digital Rights Management software (DRM) applied.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "The Man Who Knew Hammett",
        "Authors": "By McConnor, Vincent",
        "Description": "Elderly private eye Zeke Gahagar, who learned the business from Dashiell Hammett, investigates the death of a leading lady more than thirty years before",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "The Paper Men",
        "Authors": "By Golding, William",
        "Description": "English novelist Wilfred Barclay, who has known fame, success, and fortune, is in crisis. He faces a drinking problem slipping over the borderline into alcoholism, a dead marriage, and the incurable itch of middle age lust. But the final, unbearable irritation is American Professor of English Literature Rick L. Tucker, who is implacable in his determinition to become The Barclay Man: authorized biographer, editor of the posthumous papers and the recognized authority.",
        "Category": " Fiction , General",
        "Publisher": "Farrar Straus & Giroux",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "States of Mind",
        "Authors": "By Miller, Jonathan",
        "Description": "Conversations with fifteen experts on the form and function of the mind provide the basis for an informative survey of current knowledge about, and theories concerning, the human mind",
        "Category": " Psychology , General",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "April",
            "Year": "1983"
        }
    },
    {
        "Title": "Smart Business: How Knowledge Communities Can Revolutionize Your Company",
        "Authors": "By Botkin, James W.",
        "Description": "Knowledge is most productive when it is shared by all. This simple but profound insight, long accepted in the academic, scientific, and medical communities, is about to radically transform business. Our economy has become inundated with information, yet often businesses are unable to use and exploit it. How can managers organize their workplaces to effectively exchange, expand, and exploit knowledge?  Dr. Jim Botkin, one of the world's leading knowledge consultants, sees a tidal wave of information swamping the old ways of doing business. The knowledge economy, he argues, is not just for Silicon Valley startups; it touches every company, in every industry. We ignore Dr. Botkin's experience at our peril; the new breakneck speed of change demands that we all capture and capitalize on knowledge, or die. As he puts it, \"You better not be in the same business five or ten years from now that you are in today.\"  Smart Business is the first knowledge-age book to give practical advice on how to organize and make use of knowledge -- how to turn knowledge into wisdom. Botkin argues that we must build \"knowledge communities\" -- groups of people with a shared passion to create, use, and share new knowledge for tangible business purposes. When we do, we will experience a transformation that powers our business and inspires new models of networked management.  Botkin draws on the experiences of dozens of companies -- and includes testimonials in an appendix from managers at such organizations as Xerox, Marriott, Saturn, and Los Alamos labs. He shows how AT&T formed six knowledge communities in order to radically transform their selling strategy. How the postal service of Sweden transformed itself from the oldest state monopoly to one of the largest successful private companies in Scandinavia. How Motorola is using knowledge to transform its legendary Motorola University from classroom curriculum to catalyst for change.  With examples like these, and practical advice on how every organization can benefit from knowledge communities, Smart Business is the knowledge book for the new millennium.",
        "Category": " Business & Economics , Management",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Reunion (Star Trek: The Next Generation)",
        "Authors": "By Friedman, Michael Jan",
        "Description": "",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Star Trek",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Protecting Yourself Online: The Definitive Resource on Safety, Freedom, and Privacy in Cyberspace",
        "Authors": "By Gelman, Robert B., McCandlish, Stanton, and Electronic Frontier Foundation (COR)",
        "Description": "An authoritative handbook designed to help readers protect their rights and personal safety in the new electronic world answers questions about first amendment rights, making online purchases, privacy issues, ensuring children's safety online, and more. Original. $50,000 ad/promo. Tour. (All Users)",
        "Category": " Computers , Security , General",
        "Publisher": "Harper Edge",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Sams Teach Yourself Html 4.0 in 10 Minutes",
        "Authors": "By Evans, Tim",
        "Description": "",
        "Category": " Computers , Programming Languages , HTML",
        "Publisher": "Sams",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Neuroleptic Nonresponsive Patient: Characterization and Treatment (Progress in Psychiatry)",
        "Authors": "By Angrist, Burt (EDT) and Schulz, S. Charles (EDT)",
        "Description": "Updated articles originally presented at the 1988 American Psychiatric Association meeting, chosen to represent a continuum of the most conservative to boldest options available to clinicians and to give insight into mechanisms that underlie response and nonresponse to treatment with drugs. No index. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Medical , General",
        "Publisher": "Amer Psychiatric Pub Inc",
        "Price Starting With ($)": "6.64",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Premeditated Man",
        "Authors": "By Restak, Richard M.",
        "Description": "",
        "Category": "",
        "Publisher": "Viking",
        "Price Starting With ($)": "24.94",
        "Publish Date": {
            "Month": "October",
            "Year": "1975"
        }
    },
    {
        "Title": "Pennsylvania Avenue: America's Main Street",
        "Authors": "By Highsmith, Carol M.",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Aia Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "A world called solitude",
        "Authors": "By Goldin, Stephen",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "You Could Look It Up",
        "Authors": "By Safire, William",
        "Description": "A collection of witty reflections on the English language and its usage from the Pulitzer-winning New York Times\" columnist traces the roots of \"huggermugger,\" \"Granada,\" and a bevy of other words and offers commentary on contemporary usage, grammar, and more",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "43.95",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "Atlas of Wild Places",
        "Authors": "By Few, Roger",
        "Description": "",
        "Category": "",
        "Publisher": "Smithsonian Inst+press",
        "Price Starting With ($)": "7.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Alice James: The Life of the Brilliant But Neglected Younger Sister of William and Henry James",
        "Authors": "By Strouse, Jean",
        "Description": "Probes the life of the sister of novelist Henry James and psychologist and philosopher William James, which was in some ways typical of Victorian American women",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Asthma",
        "Authors": "By Weinstein, Allan M.",
        "Description": "A practical self-help program explains the nature of the widespread ailment, and shows how sufferers can avoid expense and difficulty by controlling the illness at home",
        "Category": "",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Adams: An American Dynasty",
        "Authors": "By Russell, Francis",
        "Description": "THE EXTRAORDINARY SAGA OF A FAMILY THAT FOR OVER TWO HUNDRED YEARS HAS BEEN AT THE CENTER OF POLITICAL AND INTELLECTUAL POWER IN AMERICA.  To imagine the United States without John and Abigail Adams and their descendants would be impossible. The indefatigable Adams family has managed to be close to the heartbeat of America's political and intellectual life across more than two centuries.  Adams: An American Dynasty tells the epic story of the Adamses of Massachusetts. From the great political and philosophical contributions of the founding father, John Adams, to the present generation of inheritors of the family legacy who continue to serve the country, the reader follows the dramatic careers of John's stoutly independent son, the diplomat and sixth President, John Quincy Adams; the pre-Civil War \"Voice of Honor,\" Charles Francis Adams; the famous authors, Henry and Brook Adams; and those who have carried on the dynasty's tradition in giving leadershp in many fields of American endeavor,from scholarship and intellectual pursuits to statesmanship and business.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "I Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Manual For Integrated Circuit Users",
        "Authors": "By Lenk, John D.",
        "Description": "",
        "Category": "",
        "Publisher": "Reston Pub. Co",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Professional Secretary's Handbook",
        "Authors": "By American Heritage Publishing Company (EDT) and Harris, Robert W.",
        "Description": "Provides information on career advancement, word processing, electronic typewriting, dictation, electronic mail, business English, time management, travel, accounting, and business law",
        "Category": " Reference , Dictionaries",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1984"
        }
    },
    {
        "Title": "The Screenwriting Life",
        "Authors": "By Whiteside, Rich",
        "Description": "Describes how to write for television and motion pictures, the advantages of a film school education, and the challenges of breaking into the industry in Hollywood",
        "Category": " Performing Arts , Film & Video , Screenwriting",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The Longman literary companion to science",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Longman",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Using Your Camcorder",
        "Authors": "By Matson, Mandy",
        "Description": "Passes on some skills and techniques to the average person on the best use of the camcorder; creativity comes naturally",
        "Category": " Photography , General",
        "Publisher": "Amphoto",
        "Price Starting With ($)": "6.23",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Working It Through",
        "Authors": "By Kubler-Ross, Elisabeth",
        "Description": "The renowned thanatologist discusses her workshops on death and dying, examining the role of lectures, counseling, and group participation in the workshops and relating the personal experiences of workshop participants",
        "Category": "",
        "Publisher": "Scribner Paper Fiction",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "Race: How Blacks and Whites Think and Feel About the American Obsession",
        "Authors": "By Terkel, Studs",
        "Description": "In recent years, race has emerged as the leading issue in American politics. The clock has been turned back on the progress of the 1960s, and once again hostility, resentment, and racial conflict threaten to divide the nation. How do ordinary Americans see these changes? How do attitudes towards race affect their daily lives, their relations to their fellow Americans, their images of themselves? Despite hundreds of articles, op-ed pieces, and TV round-tables about race relations, only Studs Terkel has been able to get his compatriots to talk with full honesty and candor about the way they feel.In previous books such as Working and Hard Times, Americans have told Terkel the truth--even when they've lied to themselves. On this, the most delicate and difficult of all issues, he brings out the full complexity of the thoughts and emotions of both blacks and whites, uncovering a fascinating narrative of changing opinions. Preachers and street punks, college students and Klansmen, interracial couples, the nephew of the founder of apartheid, and Emmett Till's mother are among the voices in Race. In all, nearly a hundred Americans talk openly about attitudes that few are willing to admit in public: feelings about affirmative action and changing neighborhoods, about dashed hopes and secret prejudices. Here too are the hopeful, courageous, and at times remarkable people who refuse to give in to anger and hatred, who see a better future in spite of all current difficulties.All of Terkel's previous books have been about America's past. Indeed, they have created a mosaic of our history from Hoover to Reagan. In this book, he tackles the present and shows us today's America in all of its ambiguity.As he has done so often in the past, Terkel has listened to the secrets we try to keep from ourselves and discovered the true voice of America: complicated, puzzled, uncertain. Here is a picture of the country at a crucial time in its history, in a book of exceptional relevance for this election year.",
        "Category": " Social Science , Discrimination & Race Relations",
        "Publisher": "New Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Renewal for All God's People",
        "Authors": "By Fox, Robert J.",
        "Description": "",
        "Category": "",
        "Publisher": "Our Sunday Visitor Inc.,U.S.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1975"
        }
    },
    {
        "Title": "On & Off the Fairway",
        "Authors": "By Nicklaus, Jack",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1978"
        }
    },
    {
        "Title": "Post-Communist Eastern Europe",
        "Authors": "By Michta, Andrew A. and Prizel, Ilya (EDT)",
        "Description": "American scholars of international and area studies explore such issues as relations between Germany and the Russian Federation, the strategic balance in the north of Eastern Europe, the disintegration of the south, and the area's future relations with the rest of the world. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " History , Europe , Eastern",
        "Publisher": "Palgrave Macmillan",
        "Price Starting With ($)": "8.78",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Redemption",
        "Authors": "By Fast, Howard",
        "Description": "No one could be more surprised than Ike Goldman, a seventy-eight-year-old retired contract law professor at Columbia, when he discovers that the much younger woman whom he keeps from suicide on the George Washington Bridge opens a new world of love for him. Nor could he be more shocked than when she is arrested for the murder of her ex-husband. Has Ike's love for this woman whom he has known for only six weeks blinded him to the part of her that could have led to murder? Was the abuse that Elizabeth suffered at her ex-husband's hands enough to drive even this gentle, deeply religious woman to a desperate act? Is her show of faith only a mask for revenge? In the swirling thrust and parry of her trial, Ike is forced to examine his hopes, his beliefs, and his love for the woman whose life hangs in the balance. Howard Fast's newest novel combines the suspense of great courtroom drama with the ineffable connection between a man and a woman.",
        "Category": " Fiction , Literary",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Napa",
        "Authors": "By Conaway, James",
        "Description": "A tour of California's premier wine country introduces readers to the family who inherited and then lost historic Inglenook, winemaker Francis Ford Coppola, the Mondavis, and other inhabitants of Napa Valley",
        "Category": " History , United States , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Reclaim Your Health: Nutritional Strategies for Conquering Chronic Ailments",
        "Authors": "By Frahm, David J. and Frahm, Anne E.",
        "Description": "",
        "Category": " Health & Fitness , Nutrition",
        "Publisher": "NavPress",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Stuart Little",
        "Authors": "By White, E. B. and Williams, Garth (ILT)",
        "Description": "The classic story by E. B. White, author of the Newbery Honor Book Charlotte's Web and Trumpet of the Swan, about one small mouse on a very big adventure! Stuart Little is no ordinary mouse. Born to a family of humans, he lives in New York City with his parents, his older brother George, and Snowbell the cat. Though he's shy and thoughtful, he's also a true lover of adventure.Stuart's greatest adventure comes when his best friend, a beautiful little bird named Margalo, disappears from her nest. Determined to track her down, Stuart ventures away from home for the very first time in his life. He finds adventure aplenty. But will he find his friend?",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "September",
            "Year": "2020"
        }
    },
    {
        "Title": "No Place Left Called Home",
        "Authors": "By Cogswell, James A.",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Friendship Pr",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1983"
        }
    },
    {
        "Title": "American History at a Glance: Fifth Edition",
        "Authors": "By Smelser, Marshall and Gundersen, Joan R.",
        "Description": "From the discovery of the New World to the policies of the Clinton Administration, this clear and concise guide summarizes the main events, personalities, issues and trends throughout the history of the United States.",
        "Category": " History , United States , General",
        "Publisher": "Collins Reference",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Concepts of Genetics",
        "Authors": "By Klug, William S. and Cummings, Michael R.",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan Coll Div",
        "Price Starting With ($)": "8.56",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    }
]