[
    {
        "Title": "Secrets and Surprises",
        "Authors": "By Wayman",
        "Description": "",
        "Category": "",
        "Publisher": "Good Apple",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "Going...Going...Gone!: Successful Auctions for Non-Profit Institutions.",
        "Authors": "By Connelly, Anne",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Target Funding Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Take Time to Relax! (Picture Puffins)",
        "Authors": "By Carlson, Nancy L.",
        "Description": "Tina the beaver and her family constantly rush off in different directions, until a storm keeps them snowbound at home.",
        "Category": "",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Babel Tower (Random House Large Print)",
        "Authors": "By Byatt, A. S.",
        "Description": "America discovered A. S. Byatt when Possession, her Booker Prize-winning Victorian novel, was published here in 1990 and became one of the bestselling books of that year. Readers have been waiting ever since for her next full-length novel. Babel Tower is every bit as brilliant and ambitious as its predecessor, but with a more contemporary setting: the 1960s, a decade of turbulence and passionate ideals that Byatt uses to both frame and propel the lives of her characters.At the heart of the novel are two law cases that shape the story: a painful divorce and custody suit, and the prosecution of an \"obscene\" book. Frederica, the independent young heroine, is involved in both, and her personal and legal crises mirror those of the age. This is the decade of The Beatles, the Death of God, and the birth of computer languages. The resulting confusion, charted with a brilliant imaginative sympathy, is as comic as it is threatening and bizarre.",
        "Category": " Fiction , Literary",
        "Publisher": "Random House Large Print",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "An Anteater Named Arthur",
        "Authors": "By Waber, Bernard",
        "Description": "In a story told through his mother's eyes, Arthur is seen as a sometimes annoying, but always lovable, anteater.",
        "Category": " Juvenile Fiction , Animals , General",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1977"
        }
    },
    {
        "Title": "Mary Manatee: A Tale of Sea Cows",
        "Authors": "By Tate, Suzanne and Melvin, James (ILT)",
        "Description": "Discusses the characteristics and behavior of manatees in a fictional story designed to promote environmental awareness",
        "Category": " Juvenile Fiction , Animals , Marine Life",
        "Publisher": "Nags Head Art, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "A Quiet Night In",
        "Authors": "By Murphy, Jill",
        "Description": "Mrs. Large's plans to celebrate her husband's birthday with a quiet evening between the two of them depend on the cooperation of the Large children--four unruly elephants who are determined not to miss out on birthday cake. Simultaneous.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , General",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Better Homes and Gardens Patchwork Projects",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "",
        "Category": "",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Melly's Menorah",
        "Authors": "By Rosenberg, Amye",
        "Description": "When the Gopher family discovers that their menorah was lost when they moved to their new home, they are glad that Melly, the youngest, has made one out of cookie dough",
        "Category": " Juvenile Fiction , Interactive Adventures",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Mommy's Briefcase",
        "Authors": "By Low, Alice and Aliki (ILT)",
        "Description": "A charming story, filled with whimsical illustrations, follows a Mommy throughout her busy work day, showing that even though Mommy is busy, she always has time for her little child. Reprint.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "The Zoo Book (Golden Look-Look Books)",
        "Authors": "By Pfloog, Jan and Pfloog, Jan (ILT)",
        "Description": "Depicts the variety of animals that live in a zoo",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Wee Sing Children's Songs and Fingerplays",
        "Authors": "By Beall, Pamela Conn",
        "Description": "",
        "Category": " Juvenile Nonfiction , Music , General",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Dr. Jekyll and Mr. Hyde",
        "Authors": "By Stevenson, Robert Louis, McMullan, Kate (ADP), and Munching, Paul Van (ILT)",
        "Description": "Bubbling potions can be bad for your health!  Just ask Dr. Jekyll.  By day, he's a kind doctor.  But by night, he's the merciless kill Mr. Hyde.  And all because of a magic formula.  Will anybody find out the horrible secret of Dr. Jekyll and Mr. Hyde?",
        "Category": " Juvenile Fiction , Horror",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "Skating On Thin Ice (First Start Easy Reader)",
        "Authors": "By Kolding, Richard Max (ILT) and Everett, Louise",
        "Description": "In this easy-to-read story, Rosie the elephant and her friend Joe enjoy ice skating until Joe falls into the ice.",
        "Category": "",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Bugs Bunny and His Sunburned Ears (Super Shape)",
        "Authors": "By Ingoglia, Gina",
        "Description": "Bugs finds a solution to covering his sunburned ears so he can go on his vacation.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "Let's Get a Pup! Said Kate",
        "Authors": "By Graham, Bob and Graham, Bob (ILT)",
        "Description": "\"This is first-rate child’s fare. . . . Sure to make both listeners and readers feel warm and happy when they put it down.\" — Booklist (starred review)There are lots of dogs of all shapes and sizes at the animal shelter. But Kate and her mom and dad know they want Dave the moment they see him. He’s small and cute and a perfect fit for the end of Kate’s bed. But then they see Rosy, who is old and gray and broad as a table. How can they take home just one dog when there are so many wonderful animals who need a home? Bob Graham creates an original, endearing family in a touching story that will appeal to animal lovers everywhere.",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "No Country for Old Men (Vintage International)",
        "Authors": "By McCarthy, Cormac",
        "Description": "Stumbling upon a bloody massacre, a cache of heroin, and more than $2 million in cash during a hunting trip near the Rio Grande, Llewelyn Moss removes the money, a decision that draws him and his young wife into the middle of a violent confrontation in which their only hope of survival is local sheriff Ed Tom Bell. Reissue. (A Paramount Vantage film, written & directed by Joel Coen & Ethan Coen, releasing Fall 2007 starring Tommy Lee Jones, Javier Bardem, Josh Brolin, Woody Harrelson, Kelly MacDoonald, & Garret Dillahunt) (Suspense)",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Common Sense (Penguin Books for Political Science)",
        "Authors": "By Paine, Thomas and Kramnick, Isaac",
        "Description": "Published anonymously in 1776, the year of the American Declaration of Independence, Paine's Common Sense became an immediate best-seller, with fifty-six editions printed in that year alone. It was this pamphlet, more than any other factor, which helped to spark off the movement that established the independence of the United States. From his experience of revolutionary politics, Paine drew those principles of fundamental human rights which, he felt, must stand no matter what excesses are committed to obtain them, and which he later formulated in his Rights of Man.For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "Category": " Philosophy , Political",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1982"
        }
    },
    {
        "Title": "Mummies (Totally Amazing Series)",
        "Authors": "By Hussain, Iqbal, Peters, Andrew (ILT), and Two-Can (COR)",
        "Description": "Provides information about mummies from throughout the world, including the Iceman and the bog mummies, and describes how the Egyptian mummies were made and their role in ancient Egyptian society",
        "Category": " Juvenile Nonfiction , Social Science , Archaeology",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "The Savage Truth On Money",
        "Authors": "By Savage, Terry",
        "Description": "Does the thought of saving for retirement, investing online, coping with debt, or paying for college leave you fearful and frazzled? Are you confused and intimidated by \"expert financial advice\" you can't understand? You need The Savage Truth On Money-from the cash in your pocket to the world of online investing.The candid and up-front advice in The Savage Truth On Money is aimed at your mind, your heart and your balance sheet. Whether you're just starting out or well on your way, Terry Savage will empower you to make informed money decisions and evaluate the advice that the growing money industry sends your way. Her expertise comes from her vast experience as a stock trader, stock broker, investment advisor, television market analyst, and bestselling personal finance author.Step by step and dollar by dollar, The Savage Truth On Money empowers you to manage your money by freeing yourself from debt, creating a budget you can live with, and investing wisely-even on a modest paycheck-to build equity and wealth. Savage helps you harness the power of the Web by using money management software to develop and track your financial plan.There's a Savage side to investing today. Find out what it is and how it could impact your 401(k) choices and IRA decisions. Discover how to harness the twin emotions that destroy financial plans: fear and greed. Learn how to invest for retirement; insure for long-term care; create a college education fund; use life insurance and annuities; and make a smart estate plan so that your hard-earned wealth isn't confiscated by taxes. Terry Savage will show you how.The Savage Truth On Money will give you the facts, resources, and confidence you need to take charge of your finances today-and give you a secure future for tomorrow.Terry Savage is a nationally recognized financial authority and winner of the National Press Club Award for Outstanding Consumer Journalism. The author of two bestselling books, Terry Savage's New Money Strategies for the '90s and Terry Savage Talks Money, she writes a weekly syndicated column on personal finance for the Chicago-Sun Times, is the personal finance columnist for Barron's Online, and is a featured expert on Microsoft's Money Central web site. Savage is a regular commentator on PBS' Nightly Business Report, and has been featured on CNN and Oprah. She appeared daily on Chicago's CBS television station for over twelve years. Savage started her career as a stockbroker and became a founding member and the first woman trader on the Chicago Board Options Exchange. She serves on the Board of Directors at McDonald's Corporation.",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Willie Mays (Baseball Legends Series)",
        "Authors": "By Grabowski, John",
        "Description": "A biography of the professional baseball player who played in every All-Star Game from 1954 to 1973",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Chelsea House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Iceman",
        "Authors": "By Lessem, Don",
        "Description": "Illus. with full-color photos and diagrams. Science writer Don Lessem recounts the discovery, excavation, and study of the mummified body of a 5,000-year-old man, discovered by a couple hiking near the border between Austria and Italy. By studying the Iceman's clothes, equipment, and even some of his food, scientists were able to piece together an unprecedented picture of prehistoric life. Full-color photographs show the well-preserved mummy, and specially commissioned artwork reconstructs his appearance.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Incredible Flying Machines",
        "Authors": "By Maynard, Christopher",
        "Description": "Information about various types of aircraft is accompanied by photographs of airplanes, equipment, and gear",
        "Category": " Juvenile Nonfiction , Technology , General",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Confession and Communion Coloring Book",
        "Authors": "By Bianca, Paul T.",
        "Description": "",
        "Category": " Religion , Christian Education , Children & Youth",
        "Publisher": "Catholic Book Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Molly Moves to Sesame Street : Featuring Jim Henson's Sesame Street Muppets",
        "Authors": "By Judy Freudberg",
        "Description": "",
        "Category": "",
        "Publisher": "Western Pub. Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Germs! Germs! Germs! (Hello Reader! Level 3 Science)",
        "Authors": "By Katz, Bobbi and Bjorkman, Steve (ILT)",
        "Description": "A rhyming story introduces young readers to germs and where they live, from food left out of the refrigerator to the inside of the body, and offers gentle rhyming instructions on how to keep germs away. Original.",
        "Category": " Juvenile Nonfiction , Health & Daily Living , Diseases, Illnesses & Injuries",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Cowboys (All Aboard Books (Paperback))",
        "Authors": "By Penner, Lucille Recht and Carter, Ben (ILT)",
        "Description": "Learn all about the day-to-day life of a cowboy in the Old West, from round-ups and trail   drives to meals around the campfire and nights under the stars.",
        "Category": " Juvenile Fiction , Westerns",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Beauty and the Beast (Pictureback, The Best Book Club Ever)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Horse (DK Eyewitness Books)",
        "Authors": "By Clutton-Brock, Juliet",
        "Description": "Introduces members of the horse family, discussing their evolution, behavior, importance, history, breeding, and training.",
        "Category": " Juvenile Nonfiction , Reference , General",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The Writer's Presence: A Pool of Readings",
        "Authors": "By Atwan, Robert (EDT), Atwan, Robert, McQuade, Donald (EDT), and McQuade, Donald",
        "Description": "",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Bedford/St. Martin's",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Sources of World Civilization: A Diversity of Traditions, Volume 1 (3rd Edition)",
        "Authors": "By Johnson, Oliver A. (EDT) and Halverson, James L. (EDT)",
        "Description": "This two volume reader spans the world and its history from the third millennium B.C. to the late 20th century. The illuminating anthology examines significant documents that will acquaint students with major world civilizations and help them understand the historical forces and ideas that have shaped the world in which they live.",
        "Category": " History , Civilization",
        "Publisher": "Pearson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Arthur's Lost Puppy (Step-Into-Reading, Step 3)",
        "Authors": "By Brown, Marc Tolon",
        "Description": "Arthur and D.W. take Baby Kate and Pal to the neighborhood street fair. But suddenly Baby Kate starts crying. Arthur sends D.W. to buy Kate an ice cream cone, and she carefully ties Pal's leash to a bench outside the store. But when she comes out, Pal has squirmed out of his collar! Includes two pages of word stickers.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Symposium and Phaedrus (Dover Thrift Editions)",
        "Authors": "By Plato and Jowett, Benjamin",
        "Description": "Among the most influential thinkers in Western history, Plato presented his thought in a series of dramatic dialogues in which different speakers present various aspects of a philosophical problem. This volume contains two of the most interesting and important of these dialogues. The philosophic goal of the Symposium is to find the ultimate manifestation of the love that controls the world, leading to mystic union with eternal and supercosmic beauty. Phaedrus discusses the psychology of love, resulting in the concept of the familiar Platonic \"forms\" as objects of transcendental emotion. In this inexpensive edition of the renowned Jowett translation, they will be welcomed by anyone interested in Greek thought or the philosophy of Plato.",
        "Category": " Philosophy , History & Surveys , Ancient & Classical",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Someday Heaven",
        "Authors": "By Libby, Larry and Jonke, Tim (ILT)",
        "Description": "Someday Heaven provides biblically based answers on a topic that’s not always easy to explain to a young child. The warm, illuminating art of Wayne McLoughlin helps to convey each touching story of the future God promises to his children. Help your child discover the answers to the wonders of God’s mysterious and glorious home with Someday Heaven.",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Mr. Sammler's Planet.",
        "Authors": "By Bellow, Saul",
        "Description": "",
        "Category": " Fiction , Psychological",
        "Publisher": "Viking Pr",
        "Price Starting With ($)": "10.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Wild Horses I Have Known",
        "Authors": "By Ryden, Hope",
        "Description": "Naturalist Hope Ryden's stunning photographs accompany clear, conversational essays telling of her observations and experiences as she tracked the mustangs of the West. Wild horses evolved and roamed in North America until becoming extinct ten thousand years ago. Not until the early sixteenth century, when the conquistadors brought tough mounts to carry them as they explore what is now Mexico and the Southwest, did the horse reappear on American soil. Hope Ryden describes how the Plains Indians adopted the horse, which transformed their culture. But many of their horses escaped into the wild and reverted to primitive behaviors-such as forming tight-knit social groups with complicated social hierarchies-that enabled them to thrive and survive. Horse lovers and history buffs, as well as all who relish a good true-life adventure, will be fascinated and moved by this compelling portrait of a national treasure. Bibliography.",
        "Category": " Juvenile Nonfiction , Animals , Horses",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The Big Book of Questions & Answers",
        "Authors": "By Farndon, John, Kramer, Ann, and Rowland-Entwistle, Theodore",
        "Description": "",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Dorling Kindersley Family Library",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The Poetry of Robert Frost",
        "Authors": "By Lathem, Edward Connery (EDT)",
        "Description": "",
        "Category": " Poetry , American , General",
        "Publisher": "Holt Rinehart & Winston",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1969"
        }
    },
    {
        "Title": "Creative Albums: Yes It's A Scrapbook Series",
        "Authors": "By Downey, Donna",
        "Description": "What do a cigar box, a stack of old CDs, and a bunch of shopping bags have in common? To author Donna Downey, they are all scrapbooks-yes, scrapbooks. In Creative Albums, her first book in the Yes, It's a Scrapbook! series, Donna shares 25 \"out of the box\" ways to capture your most meaningful memories.And best of all, you can finish most albums in an afternoon or over a weekend. Each project includes: Clear, how-to instructions Step-by-step photos Color photos of album covers and inside pages Complete list of supplies and tools needed Give your new albums to friends and family, or show them off on the coffee table. Either way, you're sure to hear, \"Wow! Is this a scrapbook?\"",
        "Category": " Crafts & Hobbies , Scrapbooking",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Getting It Printed 3rd Edition",
        "Authors": "By Beach, Mark and Kenly, Eric",
        "Description": "Subtitled How to Work With Printers and Graphic Imaging Services to Assure Quality, Stay on Schedule and Control Costs. For anyone whose work includes getting something printed, explains the parts the customer plays in the process, including writing specifications for ink and paper, reviewing proofs, and conducting press checks. Also demonstrates examples of bad printing and explains the error. Includes a glossary but no indication of pronunciation. No bibliography. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Design , Graphic Arts , General",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.78",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Out of the Blue Grade 2: Harcourt School Publishers Signatures (Signatures 97 Y046)",
        "Authors": "By Hb (COR)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "Steck-Vaughn Company",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Reading Essentials: The Specifics You Need to Teach Reading Well",
        "Authors": "By Routman, Regie",
        "Description": "With all the controversy and confusion over \"best practice\" issues in teaching reading, someone with the necessary experience, the ability to take the long view, and most of all a level head is essential to set things straight. This is where Regie Routman steps in: giving clarity, support, specific demonstrations, and confidence to teachers so they can teach reading in a manner that is consistent with research and learning theory and respectful of students' needs, interests, and abilities. In Reading Essentials, she realistically describes how to achieve these goals-and get high test scores too.   Based on her continuing work teaching in schools, Routman proves that good teaching doesn't have to mean lots of hours spent planning. What's necessary is good thinking-thinking about what matters to kids, what kids need to know, how we can move them forward, and how to ensure that they comprehend and enjoy what they read-including struggling students. Readers will discover research-based strategies, immediately doable ideas, and detailed lessons-all based on an instructional framework that includes:  demonstrations shared demonstrations guided practice independent practice.  Thoughout the text, Routman emphasizes the use of professional common sense and demonstrates how to maximize your time, making the most of every teachable moment. Practical, philosophical, and political, Reading Essentials gets to the heart of what excellent reading instruction is all about-and puts the fun back into your teaching.",
        "Category": " Education , Teaching Methods & Materials , Reading & Phonics",
        "Publisher": "Heinemann",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Cruel Justice",
        "Authors": "By Bernhardt, William",
        "Description": "Ten years before, Leeman Hayes, a black teenager, was accused of brutally beating a young woman with a golf club at a posh country club in Tulsa. Kinks in the legal system have kept Leeman locked up without a verdict for a decade. Now the case is finally going back to court, and Ben Kincaid has stumbled into the job of defense attorney. But what possible chance does he stand against Tulsa's crack prosecutor, Jack Bullock? Nothing short of a miracle is going to save Leeman Hayes from the death sentence.",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "An Absence of Light",
        "Authors": "By Lindsey, David L.",
        "Description": "David Lindsey is one of the modern masters of crime fiction. His 1983 novel, A Cold Mind, is often cited as one of the half dozen best suspense novels ever written; Mercy, published in 1990, completely redefined the psychological thriller and became a huge national bestseller; his most recent novel, Body of Truth, was critically acclaimed as one of those rare thrillers that is as morally complex and intelligent as it is suspenseful. Now, with An Absence of Light, he has again expanded the boundaries of crime fiction, leading us from the top-secret world of police department Intelligence Divisions into the frighteningly sophisticated and violent dark heart of international drug and arms dealers.All major urban police departments have Intelligence Divisions - investigative squads that are highly sensitive because they collect secrets about men and women who have not yet committed any crime. An Absence of Light opens with the discovery of the body of Arthur Tisler, an investigator in Houston's Intelligence Division, who is found in his parked car with a bullet in his head. Everyone from the homicide cops to the chief of police hopes it's suicide; if it is, the case can be quickly and quietly closed. If, on the other hand, Tisler's death is in any way related to his secret investigations, it could bring down the entire police department.Marcus Graver, who heads Houston's Intelligence Division, realizes he cannot adequately pursue Tisler's death \"inside,\" so he gets help from Arnette, a freelancer who has spent most of her career in the Far East for the CIA. When Arnette's surveillance team leads her to Panos Kalatis - a former legendary deep-cover agent for the Mossad who is now one of the richest and most vicious criminals in the world - she realizes Graver is way out of his league. In fact, Arnette knows, if the enemy is Kalatis, the entire Houston Police Department is out of its league.In An Absence of Light David Lindsey takes us into the terrifying new world of global high-tech crime, a brutal shadow world where men of limitless power and wealth operate almost as nations, trading billions of dollars' worth of drugs and weapons in an arena without borders, without laws, and devoid of any kind of morality.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "The Encyclopedia of Ancient Egypt by Strudwick, Helen (2006) Paperback",
        "Authors": "By Helen (ed) Strudwick",
        "Description": "",
        "Category": "",
        "Publisher": "Amber",
        "Price Starting With ($)": "8.46",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Richard Scarry's Best Times Ever: A Book About Seasons and Holidays (A Golden Look-Look Book)",
        "Authors": "By Richard Scarry",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "Ancient Egypt: An illustrated reference to the myths, religions, pyramids and temples of the land of the pharaohs",
        "Authors": "By Oakes, Lorna",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House,",
        "Price Starting With ($)": "9.5",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Classic Christmas Cookies",
        "Authors": "By Better Homes & Gardens",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Corporation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Beauty and the Beast (Read With Me)",
        "Authors": "By Carr, Jan and Bratun, Katy (ILT)",
        "Description": "Beauty agrees to take her father's place as the beast's prisoner, and gradually comes to love him, breaking the spell that made him into a monster",
        "Category": "",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Batty Riddles: Level 3 (Easy-to-Read, Puffin)",
        "Authors": "By Rubel, Nicole (ILT), Hall, Katy, and Eisenberg, Lisa",
        "Description": "A collection of riddles about bats, including \"Why did the little bat walk around in his pajamas? He didn't have a bat robe!\"",
        "Category": " Juvenile Nonfiction , Humor , General",
        "Publisher": "Puffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Houghton Mifflin Reading Leveled Readers: Level 3.3.1 Abv Lv A Town in Trouble",
        "Authors": "By Read (COR)",
        "Description": "",
        "Category": " Juvenile Fiction , Readers , Intermediate",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "I Can Read About Dogs and Puppies",
        "Authors": "By Kinnealy, Janice (ILT), Kinnealy, Janice, and Anderson, J. I.",
        "Description": "Describes different breeds of dogs and how they work and help humans, and explains briefly how to train, breed, and raise dogs.",
        "Category": " Juvenile Nonfiction , Animals , Dogs",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Learning to Love Yourself: Finding Your Self-Worth",
        "Authors": "By Cruse, Sharon Wegscheider",
        "Description": "We do not have to follow a family tradition of compulsion or addiction. In Learning to Love Yourself, we can choose our own self-worth. It is necessary for us to get rid of our toxic self-defeating messages, and choose positive changes. Learning to Love Yourself is a journey to self-worth -- Sharon Wegscheider-Cruse shows you new perspectives and guides you to higher self-worth so that finally you can love yourself. Sharon Wegscheider-Cruse was president of ONSITE Training and Consulting, Inc., of Rapid City, South Dakota for many years. While there, she developed two residential programs, one is co-dependency treatment the other is a family reconstruction workshop.",
        "Category": " Self-help , Personal Growth , Self-Esteem",
        "Publisher": "HCI",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Mary's Land",
        "Authors": "By Robson, Lucia St. Clair",
        "Description": "Two very different women--Margaret Brent, in search of independence and religious freedom, and Anicah, a teenage pickpocket indentured to a tavern keeper--leave England to brave the perils of the New World as they journey to Lord Baltimore's Maryland colony.",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "The Story of Babar: The Little Elephant",
        "Authors": "By Brunhoff, Jean de",
        "Description": "The classic story of literature’s most beloved elephant. After his mother  is killed by a hunter, Babar avoids capture by escaping to the city, where he is  befriended by the kindly Old Lady. Later, with cousins Celeste and Arthur, he returns to the great forest to be crowned King of the Elephants. With the original illustrations from Jean  de Brunhoff's 1931 classic, this first Babar story has enchanted generations.",
        "Category": " Juvenile Fiction , Animals , Elephants",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Party Time! (Teachable Moments Cookbooks for Kids)",
        "Authors": "By Ward, Brenda and Jarrell, Jane Cabaniss",
        "Description": "",
        "Category": " Cooking , Entertaining",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Renaissance of Italian Cooking",
        "Authors": "By De' Medici Stucchi, Lorenza and Sims, John Ferro (PHT)",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "South of the Border",
        "Authors": "By Brightfield, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Play Ball, Amelia Bedelia (I Can Read Level 2)",
        "Authors": "By Parish, Peggy and Tripp, Wallace (ILT)",
        "Description": "Learn to read with the classic Amelia Bedelia! Ever since Amelia Bedelia made her debut in 1963, young readers have been laughing out loud at the antics of this literal-minded but charming housekeeper. Guess who's at bat? The lovable, hilarious Amelia Bedelia is back, filling in for a sick player on the Grizzlies baseball team. Watch out! Because nobody plays ball like Amelia Bedelia. This Level 2 I Can Read is perfect for kids who read on their own but still need a little help.\"No child can resist Amelia [Bedelia] and her literal trips through the minefield of the English language—and no adult can fail to notice that she's usually right when she's wrong.\"—The New York Times Book Review",
        "Category": " Juvenile Fiction , Sports & Recreation , General",
        "Publisher": "Greenwillow Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Shipwreck Saturday (A Little Bill Book for Beginning Readers)",
        "Authors": "By Cosby, Bill and Honeywood, Varnette P. (ILT)",
        "Description": "This easy-to-read story about acceptance by comedian and storyteller Bill Cosby is now a Scholastic Reader!Little Bill has worked very hard on his sailboat, but the older boys make fun of it. When it breaks, he is afraid that everyone will laugh at him. How will he be able to face his friends?",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Red Cross First Aid Module: CPR Race for Life",
        "Authors": "By Editor",
        "Description": "",
        "Category": "",
        "Publisher": "American Red Cross",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Tales of Mystery and Imagination",
        "Authors": "By Poe, Edgar Allan",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Wordsworth Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Yes, No, Little Hippo - A Book About Being Safe (Magic Castle Readers)",
        "Authors": "By Moncure, Jane Belk and Gohman, Vera Kennedy (ILT)",
        "Description": "After experiencing several falls and bumps, Little Hippo discovers how to play safely and have fun without the danger of accidents",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "The Childs World Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "What Can We Play Today? (Magic Castle Readers Social Science)",
        "Authors": "By Moncure, Jane Belk and Hohag, Linda (ILT)",
        "Description": "Two children playing dress-up pretend to be firemen, police officers, and other helpers.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "The Childs World Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "The Bears Upstairs (Magic Castle Readers)",
        "Authors": "By Moncure, Jane Belk",
        "Description": "Katie plays with her toy bears using chairs and later serves them pears.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "The Child's World",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Smile, Says Little Crocodile (Magic Castle Readers Health and Safety)",
        "Authors": "By Moncure, Jane Belk, Hohag, Linda (ILT), and Jacobson, Lori (ILT)",
        "Description": "A smiling crocodile explains how he keeps his smile nice by maintaining good health, exercising, visiting the dentist, eating carefully, and practicing good dental hygiene.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "The Childs World Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Away Went the Farmer's Hat (Magic Castle Readers Language Arts)",
        "Authors": "By Moncure, Jane Belk and Super, Terri (ILT)",
        "Description": "The farmer's hat blows away and is used by many animals on and around the farm until it once again comes to rest back on the farmer's head.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "The Childs World Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Volleyball for coaches and teachers",
        "Authors": "By Schaafsma, Frances",
        "Description": "",
        "Category": "",
        "Publisher": "W. C. Brown Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The Red Badge of Courage (Puffin Classics)",
        "Authors": "By Crane, Stephen",
        "Description": "During his service in the Civil War, a young Union soldier matures to manhood and finds peace of mind as he comes to grips with his conflicting emotions about war",
        "Category": " Young Adult Fiction , Historical , United States , Civil War Period (1850-1877)",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Instant Art History: From Cave Art to Pop Art",
        "Authors": "By Robinson, Walter",
        "Description": "From the prehistoric cave paintings to Andy Warhol's soup cans, this lively chronicle surveys the rich history of artistic expression. INSTANT ART HISTORY examines such geniuses as Michelangelo, da Vinci, Rembrandt, Renoir, van Gogh, and the Impressionists as well as Dali, Matisse, Picasso, Kandinsky, and Lichtenstein.With INSTANT ART HISTORY you'll learn:* How Mona Lisa's smile changed forever the grim face of portrait sitters.* The differences between Analytic and Synthetic Cubism.* How the avant-garde movements of Constructivism, Dadaism, and Surrealism of the 1920s redefined how society viewed art.* How the action paintings of the Abstract Expressionists allow the viewer to \"feel\" a painting, not just see it.",
        "Category": " Art , History , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Arthur's Birthday (An Arthur Adventure)",
        "Authors": "By Brown, Marc",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Walking in Your Own Shoes: Discover God's Direction for Your Life",
        "Authors": "By McGraw, Phillip C., Ph.D. (FRW), Schuller, Robert A., and Kruidenier, William",
        "Description": "God had a specific reason when he formed us to be individuals, unique creations that each fulfill a special purpose. Everything we are, have been, and will be is all part of a grand plan of God's love. Everything helps to shape us into the people God wants us to be and where we find our inner satisfaction, joy, and meaning.",
        "Category": " Religion , Christian Life , Personal Growth",
        "Publisher": "FaithWords",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Decorative Napkin Folding for Beginners",
        "Authors": "By Oppenheimer, Lillian and Epstein, Natalie",
        "Description": "Napkins are easy to fold into ingenious shapes and add a touch of festivity to any dinner. Whether you use paper or cloth, a napkin folded into a delightful shape is a welcome way to start a meal.Twenty-two different napkin folds are clearly shown, beginning with very simple folds and gradually leading to more involved ones. None of the folds is difficult and any square napkin, paper or cloth, can be used. Shapes include: Heart, Clown's Hat, Japanese Kimono, Cardinal's Hat, Nest, Love Knot, Ascot, Lady's Slipper or Boot, Candle, Silverware Holder, Peacock, Rabbit, and more.For each napkin there are step-by-step drawings and instructions showing exactly where and how to make each fold. A photograph of the finished napkin accompanies each project. The clear, simple instructions enable anyone, even absolute beginners, to decorate a table using creative napkin folding.",
        "Category": " Cooking , Tablesetting",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1980"
        }
    },
    {
        "Title": "The Guide to National Parks of the Southwest",
        "Authors": "By Huey, George H. H. and Leach, Nicky J.",
        "Description": "",
        "Category": " Travel , Parks & Campgrounds",
        "Publisher": "Western Natl Parks Assoc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Barry: The Bravest Saint Bernard (Step Into Reading)",
        "Authors": "By Lynn Hall",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Successful Managers Handbook",
        "Authors": "By Davis, Brian L.",
        "Description": "",
        "Category": "",
        "Publisher": "Personnel Decisions Intl",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Ha! Ha! Ha!: Over 400 Very Funny Jokes",
        "Authors": "By Brown, Mik (ILT), Hurt-Newton, Tania (ILT), and Archbold, Tim",
        "Description": "Kids will want to tell each and every one of these silly jokes to everyone they meet. Featuring elephant jokes, knock-knock jokes, and just plain hilarious jokes that will have children laughing for hours.",
        "Category": " Juvenile Nonfiction , Humor , General",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Little toot board book",
        "Authors": "By Gramatky, Hardie, Long, Laurie Struck (ILT), and Gramatky-Smith, Linda",
        "Description": "The beloved classic children's book now available as a sturdy board book!Little Toot is a tugboat who does not want to tug. Instead, he wants to make figure eights in the harbor and bother all the other tugboats. But when he ends up all alone on the open water as a storm is rolling in, it’s up to him to save a stuck ocean liner. This classic story is sure to delight a whole new generation of readers!",
        "Category": " Juvenile Fiction , Transportation , General",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Modern Sociological Theory",
        "Authors": "By Ritzer, George",
        "Description": "",
        "Category": " Social Science , Sociology , General",
        "Publisher": "McGraw-Hill College",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Community Water Safety",
        "Authors": "By American National Red Cross",
        "Description": "",
        "Category": " Reference , General",
        "Publisher": "STAYWELL",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Anna Banana: 101 Jump-Rope Rhymes",
        "Authors": "By Cole, Joanna",
        "Description": "",
        "Category": "",
        "Publisher": "Morrow Junior Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Giant Coloring & Activity Book, Cover may Vary",
        "Authors": "By Various",
        "Description": "",
        "Category": " Juvenile Fiction , Activity Books , General",
        "Publisher": "Bendon Pub Intl",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Reptar to the Rescue! (Rugrats)",
        "Authors": "By St. Pierre, Stephanie and Ulrich, George (ILT)",
        "Description": "There's a really weird toy in the playpen. Chuckie thinks it looks scary. Tommy thinks it looks like fun. But now it's gone berserk it has Angelica's doll in its clutches! Can anyone save the day?",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Sharks! (Know-It-Alls",
        "Authors": "By Trimble, Irene and Maydak, Michael S. (ILT)",
        "Description": "Introduces various kinds of sharks, and discusses their habitat, groups, food, communications, defenses, and life cycles",
        "Category": " Juvenile Nonfiction , Animals , Marine Life",
        "Publisher": "McClanahan Book Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Duckling (Discover baby animals)",
        "Authors": "By Toast, Sarah",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Hypochondriac's Handbook",
        "Authors": "By Marston, Wendy",
        "Description": "Feeling good? Are you sure? This hilarious guide -- a sequel to the best-selling Paranoid's Pocket Guide -- is guaranteed to make you wonder. With hundreds of symptoms to watch for and in-depth information on the latest germ mutations, this compendium offers compelling proof that there is always something to worry about, even if you seem to be in perfect shape. A must-have for today's health-conscious individual, it also reveals worrisome facts about doctors and insurance companies. It's packed with black-and-white photos documenting everyday items that can menace your health -- often seemingly \"harmless\" items such as a pencil or a water fountain. Fortunately, this book will make you laugh, which releases endorphins and promotes health -- for the moment. For soundness of body and mind, read the Hypochondriac's Handbook. Better safe than sorry!",
        "Category": " Humor , Form , Parodies",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Young Readers Christian Library: Joseph (Young Reader's Christian Library Series)",
        "Authors": "By Williams, Rex",
        "Description": "",
        "Category": " Juvenile Nonfiction , Religion , Bible Stories , General",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "My Very Own Bible (A Harvest Children's Bible)",
        "Authors": "By Fletcher, Betty and Police, Lou (ILT)",
        "Description": "A simple retelling of forty stories from the Old and New Testaments",
        "Category": "",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "5.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Ethical Arguments for Analysis",
        "Authors": "By Baum, Robert (COM)",
        "Description": "",
        "Category": " Philosophy , Ethics & Moral Philosophy",
        "Publisher": "Holt Rinehart & Winston",
        "Price Starting With ($)": "9.25",
        "Publish Date": {
            "Month": "June",
            "Year": "1976"
        }
    },
    {
        "Title": "Darwin's Ghost: The Origin of Species Updated",
        "Authors": "By Jones, Steve",
        "Description": "Charles Darwin's The Origin of Species is probably the best-known, least-read book. One of the most important achievements of the past millennium, it did for biology what Galileo did for astronomy: made it into a single science rather than a collection of unrelated facts. Important though Origin remains, its examples and intricate Victorian prose are now a century and a half old. They are ripe for renewal and reaffirmation. Writing as \"Darwin's ghost,\" eminent geneticist Steve Jones updates this seminal work—and restates evolution's case for the 21st century.Jones is a writer of engaging wit and dazzling erudition and has been called \"the British Carl Sagan.\" Using modern examples—the AIDS virus, the puzzles of sexual selection, the physiology and psychology of pets, and the unparalleled genetic success of our own species—he shows the power and immediacy of Darwin's great argument and makes us appreciate how it makes life make sense. Eye-opening and entertaining, filled with astonishing facts, amusing anecdotes, and the very latest research, Darwin's Ghost is contemporary science writing at its very best.",
        "Category": " Science , Life Sciences , Evolution",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Road Trip USA: Cross-Country Adventures on America's Two-Lane Highways (1st ed)",
        "Authors": "By Jensen, Jamie",
        "Description": "Describes the cities and towns, attractions, and historic sites found along the highways of the United States",
        "Category": " Travel , Special Interest , Adventure",
        "Publisher": "moon travel handbooks",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "All I Need Is You",
        "Authors": "By Lindsey, Johanna",
        "Description": "The head strong child of Chandos Straton and Courtney Harte, Casey Straton inherited her mother's eyes and her father's stubborn temperament. Despite her unladylike prowess at roping, riding and shooting, the responsibility of running her late grandfather's ranch was given to Casey's older brother. She's a beautiful young woman of marrying age, Chandos tells his daughter, and she should be looking to settle down--which only infuriates Casey, sending the high-spirited hellion storming away from her Texas home, determined to prove to her family that she can do much more than \"woman's work.\"Damian Rutledge III has left his home far behind as well. A successful New York businessman, he used important connections to gain a U.S. Deputy's badge.And now he has come west to kill the man who murdered his father. But despite his powerful physique and unwavering courage, the handsome Eastern \"dude\" is like a fish out of water in the untamed and unpredictable country. And his inability to handle a shooting iron would have cost him his life at the hands of two desperate outlaws if it weren't for the timely intervention of a half-pint bounty hunter called \"Kid\"--a youngster whose cool head and lightning-fast draw Damian quickly decides will be valuable assets in his hunt for his father's killer.But there is more to Kid than first meets the eye. For beneath a large hat and dusty poncho, and behind two blazing six-guns, is a stunningly sensuous young lady: Casey Straton. And despite Casey's resolve to maintain her disguise at all costs, the nearness of this proud, fearless and undeniably masculine gentleman has awakened the fires of her womanly passions and touched her vulnerable, aching heart--which could lead to serious complications on a rocky trail that winds dangerous duty to irrepressible love. The head strong child of Chandos Straton and Courtney Harte, Casey Straton inherited her mother's eyes and her father's stubborn temperament. Despite her unladylike prowess at roping, riding and shooting, the responsibility of running her late grandfather's ranch was given to Casey's older brother. She's a beautiful young woman of marrying age, Chandos tells his daughter, and she should be looking to settle down--which only infuriates Casey, sending the high-spirited hellion storming away from her Texas home, determined to prove to her family that she can do much more than \"woman's work.\"Damian Rutledge III has left his home far behind as well. A successful New York businessman, he used important connections to gain a U.S. Deputy's badge.And now he has come west to kill the man who murdered his father. But despite his powerful physique and unwavering courage, the handsome Eastern \"dude\" is like a fish out of water in the untamed and unpredictable country. And his inability to handle a shooting iron would have cost him his life at the hands of two desperate outlaws if it weren't for the timely intervention of a half-pint bounty hunter called \"Kid\"--a youngster whose cool head and lightning-fast draw Damian quickly decides will be valuable assets in his hunt for his father's killer.But there is more to Kid than first meets the eye. For beneath a large hat and dusty poncho, and behind two blazing six-guns, is a stunningly sensuous young lady: Casey Straton. And despite Casey's resolve to maintain her disguise at all costs, the nearness of this proud, fearless and undeniably masculine gentleman has awakened the fires of her womanly passions and touched her vulnerable, aching heart--which could lead to serious complications on a rocky trail that winds dangerous duty to irrepressible love.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Happy Halloween, Biscuit!",
        "Authors": "By Capucilli, Alyssa Satin and Schories, Pat (ILT)",
        "Description": "Trick or Treat, Biscuit! Lift the flaps to reveal spook-tacular surprises on Biscuit's first Halloween adventure!Biscuit and the little girl are going trick-or-treating on his first Halloween. What kinds of silly surprises are in store for them?Pull back the flaps to find out!",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2019"
        }
    },
    {
        "Title": "Sammy the Seal (I Can Read Level 1)",
        "Authors": "By Hoff, Syd",
        "Description": "Sammy, the adventurous seal, leaves the zoo for the day and ventures into the big, busy city. Along the way he finds a school full of kids and new things to do—and he even learns to read!\"So funny and so original that it promises to be one of the most successful books in this best-selling series.\" (Publishers Weekly)Sammy the Seal is another hilarious, original story by Syd Hoff, the celebrated author of Danny and the Dinosaur. This classic Level One I Can Read is perfect for shared reading with a child.",
        "Category": " Juvenile Fiction , Animals , Zoos",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Navigator (The Numa Files)",
        "Authors": "By Cussler, Clive and Kemprecos, Paul",
        "Description": "Years ago, an ancient Phoenician statue known as the Navigator was stolen from the Baghdad Museum, and there are men who would do anything to get their hands on it. Their first victim is a crooked antiquities dealer, murdered in cold blood. Their second very nearly is a UN investigator who, were it not for the timely assistance of Austin and Zavala, would now be at the bottom of a watery grave.  What's so special about this statue? Austin wonders. The search for answers will take the NUMA team on an astonishing odyssey through time and space, one that encompasses no less than the lost treasures of King Solomon, a mysterious packet of documents personally encoded by Thomas Jefferson, and a top secret scientific project that could change the world forever.  And that's before the surprises really begin . . .  Rich with all the hair-raising action and endless invention that have become Cussler's hallmarks, The Navigator is Clive's best yet.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "The Basement Book: Upstairs Downstairs : Reclaiming the Wasted Space in Your Basement",
        "Authors": "By Carpenter, Thomas, Taylor, Jeff, Cooke, Roberta (ILT), and Sneed, Brad (ILT)",
        "Description": "The best and least expensive way to add between 50 and 100 percent to the living space in many homes is by expanding downward into an unfinished basement.  Like an unfinished addition, the basement is already covered and enclosed, ready for the simple steps outlines in this book.",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Chapters Pub Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Schaum's Outline of French Vocabulary (Schaum's outline series) (English and French Edition)",
        "Authors": "By Coffman Crocker, Mary E",
        "Description": "",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1984"
        }
    },
    {
        "Title": "Strange Talents: People Who Can See the Future, Heal the Sick and Communicate With the Dead (The Unexplained)",
        "Authors": "By Brookesmith, Peter (EDT)",
        "Description": "Discusses psychic healers, mediums, clairvoyants, reincarnation, alchemists, thought photographs, dowsing, and precognition.",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Great Meals in Minutes",
        "Authors": "By Time-Life Books",
        "Description": "This one-volume selection of recipes from the first seven books in Time-Life Books series, \"Great Meals in Minutes\" features seventy-seven complete, original menus--and nearly three hundred recipes--designed to be prepared in an hour or less",
        "Category": " Cooking , General",
        "Publisher": "Silver Burdett Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "Body Battles",
        "Authors": "By Gelman, Rita Golden and Freem, Elroy (ILT)",
        "Description": "Explains how viruses and bacteria can make people sick, shows how the body keeps them out, and suggests ways to help your body avoid illness",
        "Category": " Juvenile Nonfiction , Body, Mind & Spirit",
        "Publisher": "Scholastic Paperbacks",
        "Price Starting With ($)": "142.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    }
]