[
    {
        "Title": "Greek legends and stories",
        "Authors": "By Seton-Williams, M. V.",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Slipcover Chic: Designing and Sewing Elegant Slipcovers at Home",
        "Authors": "By Garey, Carol Cooper, Revland, Catherine, and Ball, Michelle (ILT)",
        "Description": "A guide to refurbishing old furniture demonstrates how to create handsome slipcovers that give faded or worn-out furniture a new face. By the author of House Beautiful Weekend Homes. 25,000 first printing. $15,000 ad/promo Lit Guild & BH&G Alt.",
        "Category": "",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Unexpectedly Eighty: And Other Adaptations (Judith Viorst's Decades)",
        "Authors": "By Viorst, Judith and Gibson, Laura (ILT)",
        "Description": "Judith Viorst returns with more poems in her “Decades” poetry series detailing the highs and lows of being an octogenarian. Continuing the comedic insight from I’m Too Young to be Seventy, these verses of memories and advice from eighty years of love, marriage, and grandchildren are sure to bring laughs.What does it mean to be eighty? In her wise and playful poems, Judith Viorst discusses love, friendship, grand parenthood, and all the particular marvels—and otherwise—of this extraordinary decade. She describes the wonder of seeing the world with new eyes—not because of revelation but because of a successful cataract operation. She promises not to gently fade away, and not to drive after daylight’s faded away either. She explains how she’s gotten to be a “three-desserts” grandmother (“Just don’t tell your mom!”), shares how memory failure can keep you married, and enumerates her hopes for the afterlife (which she doesn’t believe in, but if it does exist, her sister-in-law better not be there with her).  As Viorst gleefully attests, eighty is not too old to dream, to flirt, to drink, and to dance. It’s also not too late to give up being cheap or to take up with a younger man of seventy-eight. Zesty, hopeful, and full of the pleasures of living, Viorst’s poems speak to her legions of readers, who recognize themselves in her knowing observations, in her touching reflections, and in her joyful affirmations. Funny, moving, inspirational, and true—the newest in Judith Viorst’s beloved “decades” series extols the virtues, victories, frustrations, and joys of life.",
        "Category": " Humor , Topic , Men, Women & Relationships",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "The Ellicotts: Striving for a Holy Community",
        "Authors": "By Mylander, Alison Ellicott",
        "Description": "",
        "Category": "",
        "Publisher": "Historic Ellicott City, Inc.",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "101 Ways to Tell Your Child \"I Love You\"",
        "Authors": "By Lansky, Vicki, White, Kaye Pomaranc, and White, Kaye Pomaranc (ILT)",
        "Description": "A special \"Welcome Home\" banner after the first day of school Red paper hearts hung in the bedroom doorway Surprise messages in unexpected places Fancy-named kisses, such as \"a double chocolate chip\" or \"a whipped cream mocha.\"    Vicki Lansky's bestselling books include Feed Me, I'm Yours, The Taming of the C.A.N.D.Y. Monster, and the Practical Parenting Series, which together have sold more than three million copies.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Cupid's Arrow (Arabesque)",
        "Authors": "By Thomas, Jacquelin, Giusto, Layle, and Johnson, Doris",
        "Description": "Three hot, sensual stories of love at first sight are collected here, with contributions from some of the best writers in the business. Original.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Harlequin Kimani Arabesque",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Avoid Boring People: Lessons from a Life in Science",
        "Authors": "By Watson, James D.",
        "Description": "From a living legend—James D. Watson, who shared the Nobel Prize for having revealed the structure of DNA—a personal account of the making of a scientist. In Avoid Boring People, the man who discovered “the secret of life” shares the less revolutionary secrets he has found to getting along and getting ahead in a competitive world.Recounting the years of his own formation—from his father’s birding lessons to the political cat’s cradle of professorship at Harvard—Watson illuminates the progress of an exemplary scientific life, both his own pursuit of knowledge and how he learns to nurture fledgling scientists. Each phase of his experience yields a wealth of age-specific practical advice. For instance, when young, never be the brightest person in the room or bring more than one date on a ski trip; later in life, always accept with grace when your request for funding is denied, and--for goodness’ sake--don’t dye your hair. There are precepts that few others would find occasion to heed (expect to gain weight after you win your Nobel Prize, as everyone will invite you to dinner) and many more with broader application (do not succumb to the seductions of golf if you intend to stay young professionally). And whatever the season or the occasion: avoid boring people.A true believer in the intellectual promise of youth, Watson offers specific pointers to beginning scientists about choosing the projects that will shape their careers, the supreme importance of collegiality, and dealing with competitors within the same institution, even one who is a former mentor. Finally he addresses himself to the role and needs of science at large universities in the context of discussing the unceremonious departure of Harvard's president Larry Summers and the search for his successor.Scorning political correctness, this irreverent romp through Watson’s life and learning is an indispensable guide to anyone plotting a career in science (or most anything else), a primer addressed both to the next generation and those who are entrusted with their minds.",
        "Category": " Biography & Autobiography , Science & Technology",
        "Publisher": "knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "The Foremost Good Fortune",
        "Authors": "By Conley, Susan",
        "Description": "Susan Conley, her husband, and their two young sons say good-bye to their friends, family, and house in Maine for a two-year stint in a high-rise apartment in Beijing, prepared to embrace the inevitable onslaught of new experiences that such a move entails. But Susan can’t predict just how much their lives will change.While her husband is consumed with his job, Susan works on finishing her novel and confronting the challenges of day-to-day life in an utterly foreign country: determining the proper way to buy apples at a Chinese megamarket; bribing her little boys to ride the school bus; fielding invitations to mysterious “sweater parties” and tracking down the faux-purse empire of the infamous Bag Lady; and getting stuck in an elevator, unable to call for help in Mandarin. Despite the distractions, there are many occasions for joy.  From road trips to the Great Wall and bartering for a “starter Buddha” at the raucous flea market to lighting fireworks in the streets for the Chinese New Year and feasting on the world’s best dumplings in back-alley restaurants, they gradually turn their unfamiliar environs into a true home.Then Susan learns she has cancer.  After undergoing treatment in Boston, she returns to Beijing, again as a foreigner—but this time, it’s her own body in which she feels a stranger.  Set against the eternally fascinating backdrop of modern China and full of insight into the trickiest questions of motherhood—How do you talk to children about death?  When is it okay to lie?—this wry and poignant memoir is a celebration of family and a candid exploration of mortality and belonging.",
        "Category": " Biography & Autobiography , Medical (incl. Patients)",
        "Publisher": "knopf",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "The Modern Rhyming Dictionar",
        "Authors": "By Lees, Gene.",
        "Description": "(Book). Gene Lees' bestseller for songwriters has been revised! In addition to providing fascinating, creative and clear techniques for writing lyrics, this edition now includes: a new foreword by renowned songwriters Alan and Marilyn Bergman; a new chapter called \"Tattered Standards,\" which outlines the lack of literacy in certain modern songs and shows you how to avoid it; a new chapter called \"The Words You Choose,\" which examines why words from some language families are subconsciously more appealing than those from others; and much more! Invaluable to the beginner, this book will also prove beneficial to professionals, poets, linguists and teachers.",
        "Category": " Music , Instruction & Study , Songwriting",
        "Publisher": "Cherry Lane Music",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Minding Frankie",
        "Authors": "By Binchy, Maeve",
        "Description": "Maeve Binchy is back with a tale of joy, heartbreak and hope, about a motherless girl collectively raised by a close-knit Dublin community.When Noel learns that his terminally ill former flame is pregnant with his child, he agrees to take guardianship of the baby girl once she’s born. But as a single father battling demons of his own, Noel can’t do it alone. Fortunately, he has a competent, caring network of friends, family and neighbors: Lisa, his unlucky-in-love classmate, who moves in with him to help him care for little Frankie around the clock; his American cousin, Emily, always there with a pep talk; the newly retired Dr. Hat, with more time on his hands than he knows what to do with; Dr. Declan and Fiona and their baby son, Frankie’s first friend; and many eager babysitters, including old friends Signora and Aidan and Frankie’s doting grandparents, Josie and Charles. But not everyone is pleased with the unconventional arrangement, especially a nosy social worker, Moira, who is convinced that Frankie would be better off in a foster home. Now it’s up to Noel to persuade her that everyone in town has something special to offer when it comes to minding Frankie.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "Madame Tussaud: A Novel of the French Revolution",
        "Authors": "By Moran, Michelle",
        "Description": "The world knows Madame Tussaud as a wax artist extraordinaire . . . but who was this woman who became one of the most famous sculptresses of all time? In these pages, her tumultuous and amazing story comes to life as only Michelle Moran can tell it. The year is 1788, and a revolution is about to begin. Smart and ambitious, Marie Tussaud has learned the secrets of wax sculpting by working alongside her uncle in their celebrated wax museum, the Salon de Cire. From her popular model of the American ambassador, Thomas Jefferson, to her tableau of the royal family at dinner, Marie’s museum provides Parisians with the very latest news on fashion, gossip, and even politics. Her customers hail from every walk of life, yet her greatest dream is to attract the attention of Marie Antoinette and Louis XVI; their stamp of approval on her work could catapult her and her museum to the fame and riches she desires. After months of anticipation, Marie learns that the royal family is willing to come and see their likenesses. When they finally arrive, the king’s sister is so impressed that she requests Marie’s presence at Versailles as a royal tutor in wax sculpting. It is a request Marie knows she cannot refuse—even if it means time awayfrom her beloved Salon and her increasingly dear friend, Henri Charles. As Marie gets to know her pupil, Princesse Élisabeth, she also becomes acquainted with the king and queen, who introduce her to the glamorous life at court. From lavish parties with more delicacies than she’s ever seen to rooms filled with candles lit only once before being discarded, Marie steps into a world entirely different from her home on the Boulevard du Temple, where people are selling their teeth in order to put food on the table. Meanwhile, many resent the vast separation between rich and poor. In salons and cafés across Paris, people like Camille Desmoulins, Jean-Paul Marat, and Maximilien Robespierre are lashing out against the monarchy. Soon, there’s whispered talk of revolution. . . . Will Marie be able to hold on to both the love of her life and her friendship with the royal family as France approaches civil war? And more important, will she be able to fulfill the demands of powerful revolutionaries who ask that she make the death masks of beheaded aristocrats, some of whom she knows? Spanning five years, from the budding revolution to the Reign of Terror, Madame Tussaud brings us into the world of an incredible heroine whose talent for wax modeling saved her life and preserved the faces of a vanished kingdom.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "Agent X",
        "Authors": "By Boyd, Noah",
        "Description": "“Vail is in the mold of Lee Child’s Jack Reacher and Robert Crais’s Joe Pike….This guy has movie written all over him.”—Chicago Sun-Times “Fans of Sam Spade and Jack Reacher will feel right at home with this new tough guy.”—Boston Globe “We have a new American hero in Steve Vail.”—Patricia Cornwell Steve Vail, former discarded covert operative and the FBI’s new go-to guy for the toughest jobs, returns in Agent X—the pulse-pounding follow-up to the explosive New York Times bestselling debut thriller by Noah Boyd, The Bricklayer. A former FBI agent himself, author Boyd pulls out all the stops in Agent X—as “the Bricklayer” hunts down an elusive Russian spy in a taut and authentic thriller that rivals the very best of Brad Thor, Vince Flynn, Stephen Hunter, and Robert Ludlum.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "Behind the Palace Doors: Five Centuries of Sex, Adventure, Vice, Treachery, and Folly from Royal Britain",
        "Authors": "By Farquhar, Michael",
        "Description": "Spanning 500 years of British history, a revealing look at the secret lives of some great (and not-so-great) Britons, courtesy of one of the world’s most engaging royal historians   Beleaguered by scandal, betrayed by faithless spouses, bedeviled by ambitious children, the kings and queens of Great Britain have been many things, but they have never been dull. Some sacrificed everything for love, while others met a cruel fate at the edge of an axman’s blade. From the truth behind the supposed madness of King George to Queen Victoria’s surprisingly daring taste in sculpture, Behind the Palace Doors ventures beyond the rumors to tell the unvarnished history of Britain’s monarchs, highlighting the unique mix of tragedy, comedy, romance, heroism, and incompetence that has made the British throne a seat of such unparalleled fascination.   Featuring: • stories covering every monarch, from randy Henry VIII to reserved Elizabeth II • historical myths debunked and surprising “Did you know . . . ?” anecdotes • four family trees spanning every royal house, from the Tudors to the Windsors",
        "Category": " History , Europe , Great Britain , General",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "The Druid Made Me Do It",
        "Authors": "By Stenzel, Natale",
        "Description": "",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Love Spell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "The Tudors: The Complete Story of England's Most Notorious Dynasty",
        "Authors": "By Meyer, G. J.",
        "Description": "NEW YORK TIMES BESTSELLER • For the first time in decades comes a fresh look at the fabled Tudor dynasty, comprising some of the most enigmatic figures ever to rule a country.“A thoroughly readable and often compelling narrative . . . Five centuries have not diminished the appetite for all things Tudor.”—Associated PressIn 1485, young Henry Tudor, whose claim to the throne was so weak as to be almost laughable, crossed the English Channel from France at the head of a ragtag little army and took the crown from the family that had ruled England for almost four hundred years. Half a century later his son, Henry VIII, desperate to rid himself of his first wife in order to marry a second, launched a reign of terror aimed at taking powers no previous monarch had even dreamed of possessing. In the process he plunged his kingdom into generations of division and disorder, creating a legacy of blood and betrayal that would blight the lives of his children and the destiny of his country.The boy king Edward VI, a fervent believer in reforming the English church, died before bringing to fruition his dream of a second English Reformation. Mary I, the disgraced daughter of Catherine of Aragon, tried and failed to reestablish the Catholic Church and produce an heir. And finally came Elizabeth I, who devoted her life to creating an image of herself as Gloriana the Virgin Queen but, behind that mask, sacrificed all chance of personal happiness in order to survive.  The Tudors weaves together all the sinners and saints, the tragedies and triumphs, the high dreams and dark crimes, that reveal the Tudor era to be, in its enthralling, notorious truth, as momentous and as fascinating as the fictions audiences have come to love.Praise for The Tudors“A rich and vibrant tapestry.”—The Star-Ledger“A thoroughly readable and often compelling narrative . . . Five centuries have not diminished the appetite for all things Tudor.”—Associated Press“Energetic and comprehensive . . . [a] sweeping history of the gloriously infamous Tudor era . . . Unlike the somewhat ponderous British biographies of the Henrys, Elizabeths, and Boleyns that seem to pop up perennially, The Tudors displays flashy, fresh irreverence [and cuts] to the quick of the action.”—Kirkus Reviews “[A] cheeky, nuanced, and authoritative perspective . . . brims with enriching background discussions.”—Publishers Weekly “[A] lively new history.”—Bloomberg",
        "Category": " History , Europe , Great Britain , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "Parrot and Olivier in America",
        "Authors": "By Carey, Peter",
        "Description": "Man Booker Prize FinalistNational Book Award FinalistTwo-time Booker Prize-winner Peter Carey’s latest feat of imagination is an irrepressible, audacious, and trenchantly funny novel set mostly in nineteenth-century America. Olivier—an improvisation on the life of Alexis de Tocqueville—is an aristocrat born just after the French Revolution. Parrot is the motherless son of an itinerant English engraver. Their lives are joined when Olivier sets sail for the New World to save his neck from one more revolution and Parrot is sent with him as spy, protector, foe, and foil. With the story of their unlikely friendship, Peter Carey explores the adventure of American democracy with the dazzling inventiveness and richness of characterization, story, and language that we have come to expect from this superlative writer.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Fodor's Pacific Northwest: with Oregon, Washington, and Vancouver (Full-color Travel Guide)",
        "Authors": "By Fodor's Travel Publications, Inc. (COR)",
        "Description": "Customize your trip with simple planning tools • Top experiences & attractions • Practical advice for getting around • Easy-to-read color regional mapsExplore the Portland, Seattle, British Columbia and beyond• Discerning Fodor’s Choice picks for hotels, restaurants, sights, and more • “Word of Mouth” tips from fellow Fodor’s travelers • Illustrated features on whale-watching, wineries, and Pike's Market Place • Best open-air adventures, local breweries, and regional cuisineOpinions from destination experts • Fodor’s writers reveal their favorite local haunts • Revised annually to provide the latest information",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "The Scent of Rain and Lightning: A Novel",
        "Authors": "By Pickard, Nancy",
        "Description": "One beautiful summer afternoon, Jody Linder receives shocking news: The man convicted of murdering her father is being released from prison and returning to the small town of Rose, Kansas. It has been twenty-three years since that stormy night when her father was shot and killed and her mother disappeared, presumed dead. Neither the protective embrace of Jody’s three uncles nor the safe haven of her grandparents’ ranch could erase the pain caused by Billy Crosby on that catastrophic night.Now Billy Crosby is free, thanks to the efforts of his son, Collin, a lawyer who has spent most of his life trying to prove his father’s innocence. Despite their long history of carefully avoiding each other in such an insular community, Jody and Collin find that they share an exclusive sense of loss. As Jody revisits old wounds, startling truths emerge about her family’s tragic past. But even through struggle and hardship, she still dares to hope for a better future—and maybe even love.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "Eye of the Red Tsar: A Novel of Suspense (Inspector Pekkala)",
        "Authors": "By Eastland, Sam",
        "Description": "Shortly after midnight on July 17, 1918, the imprisoned family of Tsar Nicholas Romanov was awakened and led down to the basement of the Ipatiev house. There they were summarily executed. Their bodies were hidden away, the location a secret of the Soviet state. A decade later, Pekkala, once the most trusted secret agent of the Romanovs, is now Prisoner 4745-P, banished to a forest on the outskirts of humanity. But the state needs Pekkala one last time. His mission: catch the assassins who slaughtered the Romanovs, locate the royal child rumored to be alive, and give Stalin the international coup he craves. Find the bodies, Pekkala is told, and you will find your freedom.  In a land of uneasy alliances and lethal treachery, pursuing clues that have eluded everyone, Pekkala is thrust into the past where he once reigned. There he will meet the man who betrayed him and the woman he loved and lost in the fires of rebellion—and uncover a secret so shocking that it will shake to its core the land he loves.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Secrets of Eden: A Novel",
        "Authors": "By Bohjalian, Christopher A.",
        "Description": "NOW A LIFETIME TV MOVIE STARRING JOHN STAMOSFrom the bestselling author of The Double Bind, Midwives, and Skeletons at the Feast comes a novel of shattered faith, intimate secrets, and the delicate nature of sacrifice.\"There,\" says Alice Hayward to Reverend Stephen Drew, just after her baptism, and just before going home to the husband who will kill her that evening and then shoot himself. Drew, tortured by the cryptic finality of that short utterance, feels his faith in God slipping away and is saved from despair only by a meeting with Heather Laurent, the author of wildly successful, inspirational books about . . . angels. Heather survived a childhood that culminated in her own parents' murder-suicide, so she identifies deeply with Alice’s daughter, Katie, offering herself as a mentor to the girl and a shoulder for Stephen – who flees the pulpit to be with Heather and see if there is anything to be salvaged from the spiritual wreckage around him.But then the State's Attorney begins to suspect that Alice's husband may not have killed himself. . .and finds out that Alice had secrets only her minister knew.Secrets of Eden is both a haunting literary thriller and a deeply evocative testament to the inner complexities that mark all of our lives.  Once again Chris Bohjalian has given us a riveting page-turner in which nothing is precisely what it seems.  As one character remarks, “Believe no one.  Trust no one.  Assume all of our stories are suspect.”",
        "Category": " Fiction , Psychological",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "La's Orchestra Saves the World: A Novel",
        "Authors": "By McCall Smith, Alexander",
        "Description": "A heart-warming stand alone novel about the life-affirming powers of music and company during a time of war, from the best-selling and beloved author of The No.1 Ladies' Detective Agency. When Lavender, La to her friends, moves to the Suffolk countryside, it’s not just to escape the London Blitz but also to flee the wreckage of a disastrous marriage. But as she starts to become a part of the community, she detects a sense of isolation.  Her deep love of music and her desire to bring people together inspire her to start an orchestra.  Little did she know that through this orchestra she would not only give hope and courage to the people of the community, but also that she would meet a man, Feliks, a shy upright Pole, who would change her life forever.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "Heresy (Giordano Bruno Novels)",
        "Authors": "By Parris, S. J.",
        "Description": "When fugitive Italian monk Giordano Bruno—philosopher, magician, and heretical scientist—arrives in London, he’s only one step ahead of the Inquisition. An undercover mission for Queen Elizabeth I and her spymaster provides added protection. Officially, Bruno is to take part in a debate on the Copernican theory of the universe at Oxford University; unofficially, he is to find out whatever he can about a Catholic plot to overthrow the queen. But when his mission is dramatically thrown off course by a series of grisly deaths and the charms of a mysterious but beautiful young woman, he realizes that somewhere within Oxford’s private chambers lurks a brutal killer. . .",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "Once A Spy: A Novel (Drummond and Clark Series)",
        "Authors": "By Thomson, Keith",
        "Description": "With wit, adventure, and style to spare, this gripping and utterly original thriller is \"a spy story that sticks\" (The Dallas Morning News). When Charlie Clark takes a break from his latest losing streak at the track to bring home his Alzheimer’s-addled father, Drummond, they’re attacked by two mysterious shooters. At first, Charlie thinks his Russian “creditors” are employing aggressive collection tactics.  But once Drummond effortlessly hot-wires a car, Charlie discovers that his unassuming father was actually a deep cover CIA agent . . . and there is extremely sensitive information rattling around in his troubled mind.  Now the CIA wants to “contain” him, so the two embark on a wild chase through the labyrinthine world of national security that will force them to confront unspeakable danger, dark conspiracies, and what it means to be a father and son.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "The Invisible Bridge (Vintage Contemporaries)",
        "Authors": "By Orringer, Julie",
        "Description": "Paris, 1937. Andras Lévi, a Hungarian-Jewish architecture student, arrives from Budapest with a scholarship, a single suitcase, and a mysterious letter he promised to deliver. But when he falls into a complicated relationship with the letter's recipient, he becomes privy to a secret that will alter the course of his—and his family’s—history. From the small Hungarian town of Konyár to the grand opera houses of Budapest and Paris, from the despair of Carpathian winter to an unimaginable life in labor camps, The Invisible Bridge tells the story of a family shattered and remade in history’s darkest hour.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Lord of Misrule (National Book Award)",
        "Authors": "By Gordon, Jaimy",
        "Description": "At the rock-bottom end of the sport of kings sits the ruthless and often violent world of cheap horse racing, where trainers and jockeys, grooms and hotwalkers, loan sharks and touts all struggle to take an edge, or prove their luck, or just survive. Equal parts Nathanael West, Damon Runyon and Eudora Welty, Lord of Misrule follows five characters, scarred and lonely dreamers in the American grain, through a year and four races at Indian Mount Downs, downriver from Wheeling, West Virginia-- from dust jacket.",
        "Category": " Fiction , General",
        "Publisher": "McPherson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2010"
        }
    },
    {
        "Title": "The Paris Wife: A Novel",
        "Authors": "By McLain, Paula",
        "Description": "NEW YORK TIMES BESTSELLER • “A beautiful portrait of being in Paris in the glittering 1920s—as a wife and as one’s own woman.”—Entertainment Weekly   A deeply evocative story of ambition and betrayal, The Paris Wife captures the love affair between two unforgettable people: Ernest Hemingway and his wife Hadley.NAMED ONE OF THE BEST BOOKS OF THE YEAR BY People • Chicago Tribune • NPR • The Philadelphia Inquirer • Kirkus Reviews • The Toronto Sun • BookPage Chicago, 1920: Hadley Richardson is a quiet twenty-eight-year-old who has all but given up on love and happiness—until she meets Ernest Hemingway. Following a whirlwind courtship and wedding, the pair set sail for Paris, where they become the golden couple in a lively and volatile group—the fabled “Lost Generation”—that includes Gertrude Stein, Ezra Pound, and F. Scott Fitzgerald.   Though deeply in love, the Hemingways are ill prepared for the hard-drinking, fast-living, and free-loving life of Jazz Age Paris. As Ernest struggles to find the voice that will earn him a place in history and pours himself into the novel that will become The Sun Also Rises, Hadley strives to hold on to her sense of self as her roles as wife, friend, and muse become more challenging. Eventually they find themselves facing the ultimate crisis of their marriage—a deception that will lead to the unraveling of everything they’ve fought so hard for.   A heartbreaking portrayal of love and torn loyalty, The Paris Wife is all the more poignant because we know that, in the end, Hemingway wrote that he would rather have died than fallen in love with anyone but Hadley.Praise for The Paris Wife“McLain smartly explores Hadley's ambivalence about her role as supportive wife to a budding genius.... Women and book groups are going to eat up this novel.” —USA Today“Written much in the style of Nancy Horan's Loving Frank ... Paula McLain's fictional account of Hemingway's first marriage beautifully captures the sense of despair and faint hope that pervaded the era and their marriage.” —Associated Press“Lyrical and exhilarating . . . McLain offers a raw and fresh look at the prolific Hemingway. In this mesmerizing and helluva-good-time novel, McLain inhabits Richardson’s voice and guides us from Chicago—Richardson and Hemingway’s initial stomping ground—to the place where their life together really begins: Paris.” —Elle",
        "Category": " Fiction , Biographical",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "The Savvy Crafters Guide To Success: Turn Your Crafts Into A Career",
        "Authors": "By McCall, Sandra",
        "Description": "Take your crafts out of your workshop - and into the spotlight.Do you dream of making money with your art but feel unsure of how to begin? With The Savvy Crafter's Guide to Success, turning your hobby into a career is easier than you think.Leave the boring business books to the white-collar set! In these pages filled with plenty of artwork for inspiration, renowned rubber-stamp and polymer-clay artist Sandra McCall teaches you everything you need to know about successfully marketing and selling your work. She shares personal insights from some of the industry's top crafters, including Traci Bautista, Claudine Hellmuth, Michael Jacobs, Catherine Moore and Stephanie Olin.With sound advice, valuable do's and don'ts, and plenty of encouragement, you'll learn to:Become a regular contributor to craft publicationsStart teaching workshops at stores, retreats and craft showsAssert yourself as an \"expert\" in your fieldTurn your dreams into reality. Turn your crafts into a career!",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "After the Bugles: A Story of the Buckalew Family",
        "Authors": "By Kelton, Elmer",
        "Description": "In the aftermath of a bitter and bloody war for independence, Texans have finally claimed their freedom from Mexico--but they don't have much else to brag about. Joshua Buckalew has left behind the deserted battlefields that claimed his brother Thomas. The war has cost him much but it has also given him a strong bond to the land and to the Mexican families who stood with him against the tyrannies of Santa Anna. Josh is travelling with Ramon Hernandez his best friend and the man who had fought with him, side by side. Where they are going, he isn't quite sure. His home is ashes--burned by either the retreating Texans or the advancing Mexican army—and the land is full of bandits and opportunists who would happily shoot Ramon simply because he is Mexican.Exiles in the land they had fought to liberate, Josh and Ramon struggle to rebuild their lives After the Bugles.",
        "Category": " Fiction , Westerns",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "A Simple Guide to the Way Back Home",
        "Authors": "By Sutton, Jerry",
        "Description": "A guide to restoration is based on Luke 15 and offers counsel to Christians who consider themselves out of fellowship with God and who are seeking to rededicate themselves. Original.",
        "Category": " Religion , Fundamentalism",
        "Publisher": "B & H Pub Group",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Lonely Planet Eastern Caribbean",
        "Authors": "By Bedford, Neal, Schechter, Daniel, Anglin, Kevin, Ingmanson, Myra, and McKinnon, Rowan",
        "Description": "Describes the sights, activities, hotels, and restaurants on the islands of the eastern Caribbean.",
        "Category": " Travel , Europe , Eastern",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "6.95",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Say It Right in French (English and French Edition)",
        "Authors": "By Peters, Clyde and Nisset, Luc (ILT)",
        "Description": "Say farewell to language faux pas forever!Based on the revolutionary Easily Pronounced Language Systems approach, Say It Right in French makes mastering correct French pronunciation simple. With Say It Right you'll learn how to use hundreds of French words and phrases in everyday conversation.This amazing guide gives you easy-to-read vowel symbols that, when combined with consonants, make pronunciation easy.With Say It Right in French you will:Learn more than 500 essential French words and phrasesEasily create sentences using \"Phrasemakers\"Get a quick reference to more than 500 word pronunciations in the Say It Right travel dictionary",
        "Category": " Foreign Language Study , French",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "A Worthy Company: Brief Lives of the Framers of the United States Constitution",
        "Authors": "By Bradford, M. E.",
        "Description": "",
        "Category": "",
        "Publisher": "Plymouth Rock Foundation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1982"
        }
    },
    {
        "Title": "A Childs Garden: Enchanting Outdoor Spaces for Children and Parents",
        "Authors": "By Dannenmaier, Molly and Herndon, Constance",
        "Description": "A unique reference offers ideas on how to create thriving gardens that give children the space and creative play areas they need, as well as the beauty and functionality adults desire, and includes ten ready-made plans readers can use. 15,000 first printing.",
        "Category": " Gardening , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The Core Balance Diet: 4 Weeks to Boost Your Metabolism and Lose Weight for Good",
        "Authors": "By Pick, Marcelle and Morgan, Genevieve (CON)",
        "Description": "Is your weight gain making you miserable? Have you noticed that you’re packing on pounds in unpleasant new places? Or is the scale—and the way you feel about yourself— just stuck, no matter how much you diet and exercise? If you’ve struggled without success to lose weight and keep it off, there’s always a reason, and—surprise!—it probably has little to do with how hard you’re trying or how many calories you’re counting. Now a pioneering practitioner of women’s health care shows why willpower doesn’t work in the long run and, finally, gives you a solution that does.Marcelle Pick, co-founder of Women to Women—one of the first clinics in the country devoted to providing health care for women by women—draws upon decades of experience, her patients’ and her own, to solve the mystery of the stubborn weight gain. Explaining the science of the body with uncommon clarity, she describes the complex web of connections—between organs and systems, hormones and other biochemicals—that keep your physiology in balance and your metabolism functioning well. Because when it isn’t, your body reacts by packing on protection in the form of pounds that won’t budge, an excess that can be so harmful and intractable that Pick has named it “toxic weight.” Bringing your body back into Core Balance is the only way to heal your metabolism, soothe your body, and lose the weight for good.The Core Balance Diet is a breakthrough plan designed to restore your body’s equilibrium and return you to a healthy, sustainable weight. With her engaging style, Pick explains six common biochemical imbalances—digestive, hormonal, adrenal, neurotransmitter, inflammation, and detoxification—and helps you determine which is affecting you most. In the first two weeks, she teaches the simple lifestyle changes and smart nutrition choices that will show you how to tune into your body and identify your fundamental obstacles to weight loss. Then Pick guides you through a customized two-week program geared to restoring your Core Balance and shedding those toxic pounds once and for all. Far from depriving yourself on this program, you’ll eat—often and well—enjoying delicious recipes made from whole foods that give your body the support it needs to heal. At the same time, you’ll start to explore underlying issues and emotional patterns that may be getting in your way, as Pick connects self-care with self-knowledge to show you the way to lasting wellness.By picking up this book, you’re about to toss out the old way of thinking about yourself and your weight. The Core Balance Diet heralds a whole new chapter in weight loss, proving how easy it is to work with your body and the right foods—not against them—to rid yourself of weight and unhealthy habits for good. Within a month, you’ll be on your way to a lean, fit, and balanced body that is ready to support you—and look great—for  the rest of your life.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Hay House",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Antiques & Collectibles Price Guide 2001 (Antique Trader Antiques and Collectibles Price Guide, 2001)",
        "Authors": "By Husfloen, Kyle (EDT)",
        "Description": "Lists 20,000 items, providing descriptions, values, and identification tips for a broad spectrum of popular collectibles.",
        "Category": " Antiques & Collectibles , General",
        "Publisher": "Krause Pubns Inc",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The New Food Lover's Companion: Comprehensive Definitions of over 3000 Food, Wine, and Culinary Terms (Barron's Cooking Guide)",
        "Authors": "By Herbst, Sharon Tyler",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "How to Be an Explorer of the World: Portable Life Museum",
        "Authors": "By Smith, Keri",
        "Description": "From the internationally bestselling creator of Wreck This Journal, an interactive guide for exploring and documenting the art and science of everyday life.Artists and scientists analyze the world around them in surprisingly similar ways, by observing, collecting, documenting, analyzing, and comparing. In this captivating guided journal, readers are encouraged to explore their world as both artists and scientists. The mission Smith proposes? To document and observe the world around you as if you’ve never seen it before. Take notes. Collect things you find on your travels. Document findings. Notice patterns. Copy. Trace. Focus on one thing at a time. Record what you are drawn to. Through this series of beautifully hand-illustrated interactive prompts, readers will enjoy exploring and discovering the world in ways they never even imagined.",
        "Category": " Self-help , Creativity",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Time for Reflection (Petites)",
        "Authors": "By Kaufman, Lois L. (COM)",
        "Description": "",
        "Category": "",
        "Publisher": "Peter Pauper Pr",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "You Can Write a Column",
        "Authors": "By McCabe-Cardoza, Monica",
        "Description": "",
        "Category": " Language Arts & Disciplines , Journalism",
        "Publisher": "Writers Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Mac Slade Private Dick - The Tinseltown Murders",
        "Authors": "By Blumenthal, John",
        "Description": "A parody of detective stories features Mac Slade as he tries to avoid mobsters and find a missing Hollywood private eye",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "July",
            "Year": "1985"
        }
    },
    {
        "Title": "The Story of Opera",
        "Authors": "By Somerset-Ward, Richard",
        "Description": "A comprehensive salute to the great Italian, German, French, English, and Russian operas and artists covers its four-hundred-year history with a special survey of the directors, performers, and composers of the twentieth century. 10,000 first printing. BOMC.",
        "Category": " Performing Arts , Reference",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "7.23",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Bless This Food: Ancient and Contemporary Graces from Around the World",
        "Authors": "By Butash, Adrian",
        "Description": "Connecting cultures to each other, nature, and the infinite, breaking bread together is the most universal cultural experience. Commonly regarded as the first act of worship, saying grace acknowledges the bounty as a gift from the divine. Blending scholarly insight with the poet’s love of language, this new edition of Bless this Food presents additional prayers as well as expanded background information about each one. The graces have been carefully selected from all the world’s major religions (Hinduism, Christianity, Islam, Buddhism, Judaism, Shintoism, Confucisnism, Sufism, Tamilism, Unitarianism), ancient traditions (Greek, Egyptian, Native American, Indian, African), and great poets, thinkers, and activists (Shakespeare, Milton, Gandhi, Mother Teresa). The book even includes two prayers in American Sign Language and features the short prayer ?Bless this Food” in 19 languages. Each prayer is introduced with cultural context and intriguing details about its history and evolution.",
        "Category": " Religion , Inspirational",
        "Publisher": "New World Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Vegetarian: Tasty Recipes for Every Day",
        "Authors": "By Aitken, Helen",
        "Description": "",
        "Category": "",
        "Publisher": "Metro Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Episode at Toledo",
        "Authors": "By Ann Bridge",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley Publishing Corporation",
        "Price Starting With ($)": "9.78",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "North American Game Animals",
        "Authors": "By Dalrymple, Byron W.",
        "Description": "Detailed, illustrated portraits of the appearance, environment and habits of over thirty game mammals, accompanied by a thumbnail data sketch and range map for each animal",
        "Category": " Science , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "An Irish Country Christmas: A Novel (Irish Country Books, 3)",
        "Authors": "By Taylor, Patrick",
        "Description": "Barry Laverty, M.B., is looking forward to his first Christmas in the cozy village of Ballybucklebo, at least until he learns that his sweetheart, Patricia, might not be coming home for the holidays. That unhappy prospect dampens his spirits somewhat, but Barry has little time to dwell on his romantic disappointments. Christmas may be drawing nigh, but there is little peace to be found on earth, especially for a young doctor plying his trade in the emerald hills and glens of rural Ireland.Along with his senior partner, Doctor Fingal Flahertie O'Reilly, Barry has his hands full dealing with seasonal coughs and colds, as well as the occasional medical emergency. To add to the doctors' worries, competition arrives in the form of a patient-poaching new physician whose quackery threatens the health and well-being of the good people of Ballybucklebo. Can one territory support three hungry doctors? Barry has his doubts.But the wintry days and nights are not without a few tidings of comfort and joy. Between their hectic medical practice, Rugby Club parties, and the kiddies' Christmas Pageant, the two doctors still find time to play Santa Claus to a struggling single mother with a sick child and not enough money in the bank. Snow is rare in Ulster, and so are miracles, but that doesn't mean they never happen. . . .",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2010"
        }
    },
    {
        "Title": "Can I Be a Christian Without Being Weird? (Early Teen Devotional)",
        "Authors": "By Johnson, Kevin",
        "Description": "A collection of devotional readings and suggested Bible passages addressing prayer, self-esteem, knowing God, and what it means to be a disciple",
        "Category": " Young Adult Nonfiction , Religion , Christianity",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "ChurchNext: Quantum Changes in How We Do Ministry",
        "Authors": "By Gibbs, Eddie",
        "Description": "A 2001 Christianity Today Book of the Year!What will the church be next?CHANGE IS NOW. Competition from nontraditional and Eastern religions join with the pressures of both modernism and postmodernism to squeeze Christianity.While new church models have sprung up to meet these challenges, they each have strengths and limitations. Eddie Gibbs, a well-known church strategist and practitioner, candidly analyzes these models while proposing nine areas in which the church will need to transform to be biblically true to its message and its mission to the world.With vigor and insight Gibbs shows how we can movefrom living in the past to engaging the presentfrom being market driven to being mission orientedfrom following celebrities to encountering saintsfrom holding dead orthodoxy to nurturing living faithfrom attracting a crowd to seeking the lostHere is a book that brings together deep understanding of the quantum shifts taking place in our culture along with concrete suggestions for implementing a proactive mission strategy.",
        "Category": " Religion , Christian Ministry , Pastoral Resources",
        "Publisher": "IVP Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Santa's Magic Bag (Creative Child Press Series)",
        "Authors": "By Karnovsky, Susan",
        "Description": "",
        "Category": "",
        "Publisher": "Playmore Press, Inc",
        "Price Starting With ($)": "9.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Freedom We Crave; Addiction: the Human Condition",
        "Authors": "By Lenters, William",
        "Description": "",
        "Category": "",
        "Publisher": "Wm. B. Eerdmans Pub. Co.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Amazing Insider Secrets: 1703 Money Saving Tips",
        "Authors": "By Bredenberg, Jeff",
        "Description": "Save hundreds of dollars by just following the secret tips found in this handy reference guide filled with tips and ?confidential advice? that come straight from the mouths of knowledgeable insiders. Most of us have been victims of misinformation or withheld information. Amazing Insider Secrets will give you the facts that will make you the smartest, sharpest consumer on the block. The secrets range from how to slash your food costs to crucial appliance-care instructions that belong in every owner?s manual. You?ll be amazed at how enlightening and simple these remedies and professional solutions are: *  Dealing with stress? No need to buy an expensive drug?try basil tea. Fresh basil is easy to find in any supermarket. *  Fake the cream in sauces: Use nonfat condensed milk instead of heavy cream; you get the creaminess without the fat and calories?and save money. *  Seeing spots: Spray an ink spot with hairspray then launder, or sprinkle baby powder on an oil stain, let the powder absorb the oil then brush it off. *  Don?t buy plants retail. Divide perennials with friends and neighbors, or watch for a local garden club to hold a plant sale. Learn easy, low-cost solutions to problems around the house, common lawn care mistakes, must-have kitchen items to have on hand, and many more handy tips that will keep your life running smoothly, prevent huge repair bills, and save you time and hassle.",
        "Category": " Reference , Consumer Guides",
        "Publisher": "Reader's Digest",
        "Price Starting With ($)": "6.78",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Vladimir Zhirinovsky: The Man Who Would Be Gog",
        "Authors": "By Scot Overbey",
        "Description": "",
        "Category": "",
        "Publisher": "Hearthstone Publishing, Limite",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "1000 Vegetarian Recipes From Around the World",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "7.68",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Romancing Your Marriage",
        "Authors": "By Wright, H. Norman",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "A Pocket Guide to Butterflies & Moths",
        "Authors": "By Balmer, Elizabeth",
        "Description": "",
        "Category": " Nature , Animals , Butterflies & Moths",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Frosty: The Snow Man",
        "Authors": "By Annie North Bedford",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "15.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1951"
        }
    },
    {
        "Title": "The Deen Bros. Cookbook",
        "Authors": "By Deen, Jamie, Deen, Bobby, Clark, Melissa, and Deen, Paula H. (FRW)",
        "Description": "You've seen the Deen brothers, Jamie and Bobbie, on their Food Network show Road Tasted. You've heard about them from their beloved mom, cookbook author and Food Network Host Paula Dean. Now, take a vicarious road trip with these good-old-boy charmers and learn how to make their tastiest regional recipes yourself. More than a cookbook, this is a slice of life: • More than 100 fabulous regional recipes personally gathered by Jamie and Bobby during their travels around the country, as featured on the Food Network's Road Tasted.• Fascinating anecdotes about the characters they meet and the businesses they visit in search of the country's best food.• Jamie and Bobby's own hints, tips and shortcuts for ensuring delicious results.• Personal stories from Jamie and Bobby about growing up in the South, running a business with their mom, and adjusting to life in the spotlight.• Color photos of the recipes throughout.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Harvest",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Creative Dreaming",
        "Authors": "By Garfield, Pagricia, Ph. D.",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Notes Left Behind",
        "Authors": "By Desserich, Brooke and Desserich, Keith",
        "Description": "“Elena has left behind a story of resilience, hope and most of all, love. We can’t help but take her into our hearts, and carry the best of her into our own lives.”—Jeffrey Zaslow, coauthor of The Last Lecture Notes Left Behind by Brooke and Keith Desserich began as a journal they kept after their five-year-old daughter Elena was diagnosed with brain cancer and given just 165 days to live. As poignant and inspiring as Randy Pausch’s The Last Lecture, it is the story of the courage of a truly remarkable little girl who accomplished so much in so little time—and of her parents’ love and dedication to their child and their family. New York Times bestselling author James Patterson was profoundly moved by Elena’s beautiful life and Notes Left Behind, calling it, “a stunning story that teaches us how precious children, family, and life are, and that the sacrifices we make are worth it. I won’t forget the Desserich family, and neither will you.”",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Detective Tricks You Can Do",
        "Authors": "By Conaway, Judith",
        "Description": "Follows two young detectives through an investigation and introduces such tricks and techniques as mirror writing, codes, invisible ink, fingerprinting, and other tools of the trade",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "War in the Desert: The Eighth Army at El Alamein",
        "Authors": "By Lucas, James",
        "Description": "",
        "Category": "",
        "Publisher": "Beaufort Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Growing Spiritually",
        "Authors": "By Jones, E.",
        "Description": "",
        "Category": "",
        "Publisher": "Abingdon-Cokesbury Press",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1953"
        }
    },
    {
        "Title": "The English Country House: A Grand Tour",
        "Authors": "By Jackson-Stops, Gervase and Pipkin, James",
        "Description": "",
        "Category": " Architecture , General",
        "Publisher": "New York Graphic Society",
        "Price Starting With ($)": "6.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "In praise of America: American decorative arts, 1650-1830 ; fifty years of discovery since the 1929 Girl Scouts loan exhibition",
        "Authors": "By Cooper, Wendy",
        "Description": "",
        "Category": "",
        "Publisher": "Knopf : distributed by Random House",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Introducing Descartes 3ed",
        "Authors": "By Appignanesi, Richard (EDT), Garratt, Chris, and Robinson, Dave",
        "Description": "",
        "Category": " Philosophy , History & Surveys , Modern",
        "Publisher": "Totem Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Stop in the Name of Pants! (Confessions of Georgia Nicolson, Book 9)",
        "Authors": "By Rennison, Louise",
        "Description": "Time to gird the loins and pucker up.Blimey O'Reilly's trousers! When Georgia embraced being the girlfriend of a Rock Legend/Luurve God, she thought that was the end of her lovenosity woes. As usual, Georgia is the last to know what she is talking about. Now there's the small matter of a snogging accident involving her matey-type mate Dave the Laugh and some toasted newts in her undercrackers. Can Georgia lock up her red bottom and throw away the key?",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "The Prentice Hall Guide for College Writers, Sixth Edition",
        "Authors": "By Reid, Stephen",
        "Description": "Focused on both traditional writing purpose and process as well as on the technological resources that influence and enhance contemporary writing, this compact, all-in-one guide offers comprehensive coverage of the purposes of writing?with a focus on the importance of a writer's research, critical-reading skills, the ability to organize ideas, and a strategy to assess and develop rhetorical contexts. Each self-contained chapter takes readers through a sequenced series of specific purpose-based writing tasks?complete with professional and student samples, rhetorical techniques, journal exercises, reading and writing activities, revision suggestions, etc. Includes nearly a hundred short quotations by composition teachers, researchers, essayists, novelists, and poets on the nature of writing. A complete reference handbook provides a review of basic sentence elements, sentence structure and grammar, diction and style, punctuation and mechanics.  Writing Myths and Rituals. Purposes and Processes for Writing. Observing. Remembering. Reading. Investigating. Explaining. Evaluating. Problem Solving. Arguing. Responding to Literature. Writing a Research Paper. Writing Under Pressure. Handbook.  For anyone needing guidance in the writing process.",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Puppy Love: Ark of Love/Walk, Don't Run/Dog Park/The Neighbor's Fence (Inspirational Romance Collection)",
        "Authors": "By Lauralee Bliss, Pamela Griffin, Dina Leonhardt Koehly, Gail Sattler",
        "Description": "",
        "Category": "",
        "Publisher": "Barbour Publishing, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "DK Essential Managers: Coaching Successfully",
        "Authors": "By Heller, Robert, Johnson, Roy, and Eaton, John",
        "Description": "Learn all you need to know about helping others to achieve their full potential. From defining performance targets to supporting staff as they progress, Coaching Successfully shows you how to motivate others to develop themselves, promoting initiative and self-responsibility. Find out how to adapt your coaching style to suit both teams and individuals, how to use delegation as a coaching tool, and how to overcome negative attitudes. Power tips help you to handle real-life situations and increase your effectiveness as a role model and confidant. The Essential Managers have sold more than 1.9 million copies worldwide! Experienced and novice managers alike can benefit from these compact guides that slip easily into a briefcase or a portfolio. The topics are relevant to every work environment, from large corporations to small businesses. Concise treatments of dozens of business techniques, skills, methods, and problems are presented with hundreds of photos, charts, and diagrams. It is the most exciting and accessible approach to business and self-improvement available.",
        "Category": " Business & Economics , Business Communication , General",
        "Publisher": "DK",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Hatching Magic",
        "Authors": "By Downer, Ann and Rayyan, Omar (ILT)",
        "Description": "You never know when magic will hatch....  Poor Theodora Oglethorpe! Her biologist father has gone off to explore the jungles of Laos without her, her best friends are away on vacation, and a long, hot, lonely Boston summer is all she has to look forward to.   Poor Gideon! Wycca, his pet wyvern, has disappeared through a magic hole in time in search of a place to lay her egg. Kobold, Gideon's wizard rival, wants nothing more than to get his hands on Wycca. In a desperate attempt to rescue Wycca from Kobold's evil clutches, Gideon follows her through the magic hole?and finds himself transported from thirteenth-century England to the terrifyingly modern world of Boston, Massachusetts, in the twenty-first century.  Soon Theodora's involved with a chocoholic baby wyvern, a mysterious wyvern playing card, a couple of desperate wizards -- and the summer vacation of her life!",
        "Category": " Juvenile Fiction , Action & Adventure , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "My Favorite Earthling (Otherworldly Men, Book 2)",
        "Authors": "By Grant, Susan",
        "Description": "Keira, warrior-queen of the galaxy, is as famous for her beauty as she is for avoiding marriage. But when an upstart little planet called Earth threatens her world with its fleet of spaceships, the fate of her people lies in her hands. She must bind herself to a barbarian from the rogue world&#151;or face the destruction of her own!She's what he never knew he always wanted&#151;Confirmed bachelor Jared Jasper knows that the trick Earth pulls on the alien invaders isn't a permanent solution. What they need is a peace treaty. It just never occurs to him that he will wind up on the bargaining table. Playing the pushover groom to a mouthy alien babe who knows how to use a plasma sword is not exactly his idea of fun. But with six billion people depending on him, he doesn't have much choice&#151;sleep with the enemy...or bring on interstellar war.  Strange bedfellows? You bet.But this alliance may turn into a romance the likes of which this galaxy's never seen!",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Best Women's Erotica 2006",
        "Authors": "By Blue, Violet (EDT)",
        "Description": "Best-selling sex book author Violet Blue takes the helm of this renowned series with a sexy, wide-ranging collection.Twist your bed sheets and dampen your palms. Under the stylish editorship of sex guru Violet Blue, Best Women’s Erotica 2006 delivers risky, romantic thrills. These joyful, daring, authentic stories revel in erotic adventure, from the sparks between strangers to the knowing caresses of longtime lovers. In Kellie Gillespie’s ?Another Assignation with Charles Bonnet,” a blind woman experiences ?love at first smell” on a London street corner ? cinnamon, sweat, leather, and tobacco ? and determines to find again the man who carries this scent. Sydney Beier’s ?Reading to Horst” is a paean to possibility: an American woman living in Germany has a languorous encounter with a tourist who asks her to read aloud to him at a café from the copy of Anaïs Nin’s Little Birds in her hands. And Elizabeth Coldwell’s ?Heat” describes the fierce affair between a barmaid and her brutish temporary boss, a man she doesn’t even like but who sets her heart pounding.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Cleis Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "The World of Islam: Faith, People, Culture (Great Civilizations S)",
        "Authors": "By Lewis, Bernard (EDT)",
        "Description": "",
        "Category": " Religion , Islam , General",
        "Publisher": "Thames & Hudson",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Warm & Fuzzy",
        "Authors": "By No Author",
        "Description": "",
        "Category": "",
        "Publisher": "Reading's Fun LTD",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Full Belly Bowl",
        "Authors": "By Aylesworth, Jim and Halperin, Wendy Anderson (ILT)",
        "Description": "Dear Friend, the tiny note reads,  In appreciation of your kindness and generosity, I leave you this Full Belly Bowl. You need never know hunger again. Use it wisely or it will be a burden. To empty, pour it out. When not in use, store it upside down and out of reach of children.   \"What on earth is a Full Belly Bowl?\" the very old man wonders -- but he soon finds out. No matter how much he eats from it, the bowl magically refills itself. For the first time in a long time, the old man isn't hungry. Then he discovers that the bowl can refill itself with other things -- even his one copper coin -- and now it looks like he'll never want for anything again!  His excitement makes him careless, however, and as he hurries off to spend some of his new wealth, he leaves the bowl right side up. And who can say what might get into the Full Belly Bowl in his absence?  Fully realized in Wendy Halperin's beautiful and intricate illustrations, Jim Aylesworth's whimsical folktale will delight readers while striking a note of caution.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Analog 1",
        "Authors": "By Sterling E. Lanier, Gordon R. Dickson, Lloyd Biggle Jr.",
        "Description": "",
        "Category": "",
        "Publisher": "Book Club / Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "The Greek Isles (Timeless Places)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Nobles Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Secret Admirer (Sweet Valley High #39)",
        "Authors": "By Pascal, Francine and William, Kate",
        "Description": "After persuading shy Penny Ayala to place an ad in the \"Personals\" column of the school paper, Elizabeth is upset when Penny receives an answer from an admirer--who turns out to be a group of boys playing a prank",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Spring Comes to Washington",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Laurel Hill",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "This Beautiful Mess: Practicing the Presence of the Kingdom of God",
        "Authors": "By McKinley, Rick",
        "Description": "Already Not Yet When Jesus announced, “the kingdom of God is at hand,” what did He mean? Uncover the reality of the kingdom of God and what it might look like if followers of Christ practiced its in-breaking presence. What happens when we view life through the lens of the kingdom? How does the beauty of Jesus’ reign break into the mess of our broken lives and world? What if we lived as though a world other than this one was here today? This Beautiful Mess launches a paradigm-shifting journey inviting us to experience the kingdom of God in the ordinary miracle of our everyday lives. \"The kingdom of heaven is like treasure hidden in a field.  When a man found it, he…sold all he had and bought that field.”  —Matthew 13:44 Jesus’ sayings about the kingdom of God just might be the most overlooked of his teachings. Yet the Good News of the kingdom—a treasure beyond price—was what he came to preach.  It’s time to ask:  -What is the kingdom Jesus talked about?  -Could it be already here, hidden from sight? If so, where is it?  -How can I be a part of it?  A new generation is tuning in to the teachings of Jesus and to their revolutionary implications. Could it be that living under Christ’s reign is not merely a future vision but a present reality?  Rick McKinley’s exploration is fresh, accessible, and timely. With careful attention to historical texts, he unveils new understandings of authentic personal and social transformation. The time is now. Your opportunity is here. In the mess of everyday life, you can live in the beautiful presence of the kingdom.  Story Behind the Book”When we started Imago Dei Community, it was with a passion to be people who live in love with Jesus and live out the values of His kingdom in our city. But we had no idea how to do that. God let us stumble into grace and discover the wide-open plains of His kingdom. This has ruined us in the best way possible. Because once you taste untamed life in the kingdom, you will never go back to the sterile hallways of religion. The beautiful, transforming grace of Christ shows up in the messiness of life and the kingdom breaks in as a beautiful mess.”—Rick McKinley",
        "Category": " House & Home , General",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Huxford's Old Book Value Guide, 4th Edition",
        "Authors": "By Huxford, Bob, Huxford, Sharon",
        "Description": "Lists the current value of twenty-five thousand old books, and provides addresses for bookbuyers, arranged by subject speciality",
        "Category": "",
        "Publisher": "Collector Books",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Dessert Cooking Class Cookbook",
        "Authors": "By Consumer Guide",
        "Description": "Recipes for fruit desserts, cakes, crepes, cheesecakes, pies, pastries, cookies, and other confections feature step-by-step instructions and practical tips on preparation and baking",
        "Category": " Cooking , Courses & Dishes , Desserts",
        "Publisher": "Crescent",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "Randalls - Wyoming Winter",
        "Authors": "By Christenberry, Judy",
        "Description": "Two delightful stories of the beloved Randall clan, a family forged by unbreakable bonds, unfaltering loyalty, and eternal brotherhood, follows the eldest Randall sibling as he attempts to find brides for all of his brothers before winter comes--an endeavor filled with matchmaking merriment and mayhem. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Over Washington",
        "Authors": "By Morgan, Murray Cromwell and Sund, Harald",
        "Description": "Aerial photographs show Washington's rivers, mountains, farmlands, dams, cities, marinas, beaches, parks, highways, industries, and historic sites",
        "Category": " History , General",
        "Publisher": "Weldon Owen",
        "Price Starting With ($)": "7.85",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Feng Shui Chic: Stylish Designs for Harmonious Living",
        "Authors": "By Stasney, Sharon",
        "Description": "Thousands of years old—and today’s hottest interior design trend. “Gives suggestions for balance and harmony.”—Publisher’s Weekly. “Learn how to use color, texture and shape to boost your energy, calm your spirit and simply create a stunning home that will feel as good as it looks.” —Timber Homes Illustrated.",
        "Category": " House & Home , Decorating",
        "Publisher": "Sterling/Chapelle",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Feng Shui Living",
        "Authors": "By Stasney, Sharon",
        "Description": "Transform your home into an environment that makes you feel more alive. Using the principles of feng shui--the ancient Asian practice of arranging furnishings and accessories to optimize the flow of energy--you can create a living space in which you feel safe and comfortable and that also helps you embrace life more fully. Gorgeous full-color photos of stylish rooms illustrate how easy it is to incorporate feng shui into your décor. Begin by establishing safety in your home through retreat and secret spaces, connecting to nature's grounding, and other techniques. Now you are ready to encourage expansion in your life. Design spaces where you can be alone, as well as shared spaces that promote harmonious relationships. See how to balance your home's yin and yang and tap into the power of the five essential elements. Work with lighting, color, textiles, furniture and object placement, wall space, accessories, and more.",
        "Category": " House & Home , Decorating",
        "Publisher": "Sterling/Chapelle",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Mai : The Multilateral Agreement on Investment and the Threat to American Freedom",
        "Authors": "By Wallach, Lori, Barlow, Maude, and Clarke, Tony",
        "Description": "",
        "Category": " Business & Economics , Investments & Securities",
        "Publisher": "Stoddart Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "The Berenstain Bears' Bedtime Battle",
        "Authors": "By Berenstain, Stan and Berenstain, Jan",
        "Description": "Who wants to go to bed when you can play with dinosaurs, have a tea party or get a piggyback ride on Papa Bear? Brother Bear and Sister Bear are doing everything they can to postpone their bedtime – even if that means putting Mama and Papa Bear to bed first!  Ages 3–7",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "The Far Side of Evil",
        "Authors": "By Engdahl, Sylvia Louise",
        "Description": "Newbery Honor-winning author Sylvia Louise Engdahl continues Elena's saga in this stunning companion to Enchantress from the Stars.Elana, newly graduated from the Federation Anthropological Service Academy, is sent immediately into danger on the planet Toris—a world poised on the brink of nuclear war. She is ordered to merely observe, and must not reveal her alien origin or interfere with the planet's natural course of evolution. But how can she stand by and watch? Her fellow agent, Randil, is not  properly trained to work in the field, and his compassion for the Torisians may lead him to intervene. Yet his very actions may bring about the holocaust that he is so desperately trying to prevent. Elana must make a crucial decision: side with a renegade agent, or stop him at any cost . . .\"[A] surprising, haunting, poetic book.\"—Commonweal Magazine",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Firebird",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Berenstain Bears and the Trouble with Commercials",
        "Authors": "By Berenstain, Stan, Berenstain, Mike, and Berenstain, Jan (ILT)",
        "Description": "Brother and Sister Bear are not greedy children, but all the toys and candy on TV look so great! Mama Bear has to find a way to teach her cubs that they can't believe everything they see . . . before that pile of unused toys gets any bigger.",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "life's greatest treasure: writings about discovering and cherishing children",
        "Authors": "By Bishop, Bette",
        "Description": "",
        "Category": "",
        "Publisher": "Hallmark Editions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Tower of London",
        "Authors": "By Great Britain: Department of the Environment",
        "Description": "",
        "Category": "",
        "Publisher": "Stationery Office Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "A Tale of Two Cities (Tor Classics)",
        "Authors": "By Dickens, Charles",
        "Description": "Tor Classics are affordably-priced editions designed to attract the young reader. Original dynamic cover art enthusiastically represents the excitement of each story. Appropriate \"reader friendly\" type sizes have been chosen for each title—offering clear, accurate, and readable text. All editions are complete and unabridged, and feature Introductions and Afterwords.This edition of A Tale of Two Cities includes a Foreword, Biographical Note, and Afterword by R.L. Fisher.They fled to London, seeking safety, and found each other--Dr. Manette, falsely imprisoned for decades; his daughter, Lucie, whose stunning beauty was matched by her loyalty and grace; and Charles Darnay, who abandoned a royal title he hated to risk being called a traitor in France, a spy in England. Together, their love touched the hearts of even stodgy banker Mr. Lorry and cynical, jaded lawyer Sydney Carton...But in Paris, the fires of revolution exploded in uncontrollable fury. The noble goals of freedom fighters became the crazed bloodbath called the Reign of Terror. And when three exiles returned home on an errand of mercy, they were trapped in a nightmare of mock trials and made rage. Once in Paris, nothing could save Darnay, Lucie, or Manette...Except a miracle.",
        "Category": "",
        "Publisher": "Tor Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "The Unofficial Guide to New York City (Unofficial Guides)",
        "Authors": "By Zibart, Eve, Lane, Lea, and Menasha Ridge Press",
        "Description": "From the publishers of The Unofficial Guide to Walt Disney World\"A Tourist's Best Friend!\"—Chicago Sun-Times\"Indispensable\"—The New York TimesFive Great Features and Benefits offered ONLY by The Unofficial Guide:Honest, streetwise advice that allows you to feel safe, comfortable, and at home in the Big AppleHotels at every price level, ranked and rated for value and quality of rooms—plus proven strategies for getting the best ratesThe best restaurants for every taste and budgetHow to get tickets to the hottest Broadway shows—and not pay full price for themThe straight truth on all the attractions, from Central Park to the Statue of Liberty",
        "Category": " Travel , United States , Northeast , Middle Atlantic (NJ, NY, PA)",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.84",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Adding on (HOME REPAIR AND IMPROVEMENT (UPDATED SERIES))",
        "Authors": "By Time-Life Books",
        "Description": "Provides step-by-step instructions for all phases of construction, including framing, roofing, wiring, plumbing, and heating",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Home Workshop (HOME REPAIR AND IMPROVEMENT (UPDATED SERIES))",
        "Authors": "By Time-Life Books (EDT)",
        "Description": "Tells how to choose a workshop location, provide electricity and lighting, buy tools, build workbenches, and arrange storage",
        "Category": " House & Home , Repair",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Tricks and Stunts with Playing Cards, Plus Games of Solitaire",
        "Authors": "By Leeming, Joseph",
        "Description": "",
        "Category": "",
        "Publisher": "Gramercy Publishing",
        "Price Starting With ($)": "16.17",
        "Publish Date": {
            "Month": "January",
            "Year": "1949"
        }
    },
    {
        "Title": "Coming Back",
        "Authors": "By Bell, Steve and Bell, Valerie",
        "Description": "",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Victor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Pearl Beyond Price",
        "Authors": "By Delacroix, Claire",
        "Description": "Pearl Beyond Price by Claire Delacroix released on Feb 22, 1995 is available now for purchase.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The Book of Kells",
        "Authors": "By Brown, Peter",
        "Description": "Illustrations with explanatory notes provide a practical reference to details in the decoration of the manuscript",
        "Category": "",
        "Publisher": "knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1980"
        }
    }
]