[
    {
        "Title": "The Seduction (Berkley Sensation)",
        "Authors": "By Ross, Julia",
        "Description": "After losing everything in a card game, gambler Viscount Gracechurch is given a single chance to regain his fortune--to accept his opponents' wager to seduce the enigmatic Juliet Seaton--but he soon discovers that his task could prove to be more difficult than he had expected. Reprint.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Your First Novel: An Author Agent Team Share the Keys to Achieving Your Dream",
        "Authors": "By Whitcomb, Laura, Rittenberg, Ann, and Lehane, Dennis (FRW)",
        "Description": "In Your First Novel, novelist Laura Whitcomb and seasoned literary agent Ann Rittenberg team up to provide you with the skills you need to write your dream novel and the savvy business know-how to get it published. In this all-in-one resource, you'll discover essential novel-writing techniques, such as:How to best structure your research so that you can save time laterHow to card your story before you start writingWhat to consider when developing your cast of charactersHow to adapt classic story structures to fit your own ideas&#133;and insider information on what it takes to get published, including:What agents do at those three-hour power lunches&#151;and how it affects youWhat makes an agent instantly reject a manuscriptHow to correctly translate submission guidelinesWhat happens if you get multiple offers&#151;or no offers at allPlus, learn about the publishing process from the firsthand accounts of such noted authors as Dennis Lehane, Kathryn Harrison, Jim Fusilli, Kathleen George, and others!",
        "Category": " Language Arts & Disciplines , Publishers & Publishing Industry",
        "Publisher": "Writers Digest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Nelly, That's Not Nice! (AlphaPets)",
        "Authors": "By Bogart, shirley",
        "Description": "",
        "Category": "",
        "Publisher": "Grolier",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Warman's Political Collectibles: Identification and Price Guide (Warmans)",
        "Authors": "By Nappen, Enoch L. and Mitchel, Doug (PHT)",
        "Description": "This guide to political collectibles features color photos of more than 1,100 items, with information and historically accurate captions on the nation's most memorable and most forgettable presidential campaigns, from the 1860s to the present. The guide gives current collector values for a variety of memorabilia, including pins and buttons, posters and signs, medal, photos, bumper stickers, magazines, clothing, and novelty items. Nappen, a political science professor at Monmouth University, is a member of the American Political Items Collectors association. Annotation ©2008 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Antiques & Collectibles , Political",
        "Publisher": "Krause Publications",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "The Presence of a Hidden God: Evidence for the God of the Bible",
        "Authors": "By Kennedy, D. James and Newcombe, Jerry (CON)",
        "Description": "God has not left Himself without a witness, nor is there anywhere on earth where His fingerprints are absent.“Truly, you are a God who hides yourself, O God of Israel, the Savior.” --Isaiah 45:15Where is God? Why does He seem absent? Is He hiding?Some people think so… but the problem lies with them, not with God. To the unrighteous, God is absent–or worse, if He is there at all, He is cruel. But to the righteous, God is clearly present.The great Christian thinker Blaise Pascal wrote, “What can be seen on earth indicates neither the total absence of God nor his manifest presence, but rather the presence of a hidden God.” In other words, to those who are spiritually blind, God may seem hidden. But to those whose eyes He has opened, God is not hidden at all. He has clearly revealed Himself in Jesus Christ.In The Presence of a Hidden God–completed just before his untimely passing–beloved pastor and teacher Dr. D. James Kennedy and co-author Jerry Newcombe provide the biblical assurance and helpful insight you’re seeking to build your faith in the living God. Dr. Kennedy knew–as you will soon discover–that if we seek God with all our hearts, we will find Him indeed.",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Fiction Writer's Workshop",
        "Authors": "By Novakovich, Josip",
        "Description": "Master the Elements of the Writing WorkshopThe great paradox of the writing life is that to be a good writer, you must be both interested in the world around you and comfortable working in solitude for hours on end. Fiction Writer's Workshop is designed to help you foster a strong sense of independence&#150of being and thinking on your own, of becoming self-evaluative without being self-critical&#150in order to accomplish what others seek in classroom groups.In this comprehensive guide, award-winning writer and teacher Josip Novakovich explores every aspect of the art of fiction and provides all the tools and techniques you'll need to develop day-to-day discipline as well as a personal writing style, such as:More than 100 writing exercises, including dozens that are new to this edition, that challenge you to experiment with diverse writing stylesSpecific statements of purpose for each exercise, to help guide you and instruct you at every step of the creative processSelf-critique questions to help you assess your work and identify strengths and weaknesses before moving on to the next lessonThe full text of eight acclaimed short stories, with analysis and exercises, to provide models for your own writing and help reinforce the lessons you've learnedThe practical, insightful methods offered in this workshop will clarify your voice, broaden your perspective, and strengthen your fiction.\"",
        "Category": " Language Arts & Disciplines , Writing , General",
        "Publisher": "Story Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Blessed Are We: Experiencing Joy As the Beatitudes of Jesus Turn Our Priorities Upside Down",
        "Authors": "By Lawson, E. LeRoy",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Standard Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Bible Prophecy: In 12 Lessons (What You Need to Know About)",
        "Authors": "By Anders, Max E.",
        "Description": "Prophets. Rapture. Tribulation. Judgment. End times. Learn what the Bible has to say about prophecy, how Christians differ in their views of the end times, and what the universals are on which all Christians agree.",
        "Category": " Religion , Biblical Studies , Prophecy",
        "Publisher": "Thomas Nelson Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "2009 Guide To Literary Agents",
        "Authors": "By Sambuchino, Chuck (EDT)",
        "Description": "Now, more than ever, in a market glutted with aspiring writers and a shrinking number of publishing houses, writers need someone familiar with the publishing scene to shepherd their manuscript to the right person. Completely updated annually, Guide to Literary Agents provides names and specialties for more than 800 individual agents around the United States and the world. The 2009 edition includes more than 85 pages of original articles on everything you need to know including how to submit to agents, how to avoid scams and what an agent can do for their clients.",
        "Category": " Language Arts & Disciplines , Publishers & Publishing Industry",
        "Publisher": "Writers Digest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Creating Affluence: The A-to-Z Steps to a Richer Life",
        "Authors": "By Chopra, Deepak",
        "Description": "In this remarkable book lies the secret to creating affluence. Here you will discover that you are the dancer and the dance, the creator and the creation, and unlimited wealth is yours merely for the asking. With clear and simple wisdom, Deepak Chopra explores the full meaning of wealth consciousness and presents a step-by-step plan for creating affluence and fulfillment on all levels of our lives.According to the author, affluence is our natural state, and the entire physical universe with all its abundance is the offspring of an unbounded, limitless field of all possibilities. Through a series of simple steps and everyday actions, Creating Affluence gently fosters the wealth consciousness needed to tap into this field and create anything you desire.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "New World Library and Amber-Allen Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Greatest Secrets of the Coupon Mom",
        "Authors": "By Nelson, Stephanie",
        "Description": "This book doubles as a user's manual for the author's interactive website on sharing her grocery shopping secrets plus heart-stirring stories from the receiving end of America's food pantries.",
        "Category": " Business & Economics , Personal Finance , Budgeting",
        "Publisher": "DPL Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Finding Your Voice: How to Put Personality in Your Writing",
        "Authors": "By Edgerton, Leslie",
        "Description": "Find your voice&#150and make your writing sing!&break;&break;You know a great literary \"voice\" when you hear it: David Sedaris' humorous cynicism. Elmore Leonard's weary, smart-mouthed dialogue. Nick Hornby's simple yet imaginative descriptions. It's the kind of writing you should aspire to, right? &break;&break;Well...not quite. Each of these authors found success in part by developing their own unique voice: a writing style that helped define - and throw the spotlight on - their work.&break;&break;Now Les Edgerton shows you how to develop a voice of your own, one that rises above the literary din because of its individuality, not in spite of it!&break;&break;Inside, he provides guidelines, advice and dozens of exercises for recognizing and developing a natural style that will make your characters, stories and dialogue better and more memorable. You'll learn:&break;&break;How to make any piece you write unmistakably yours and yours alone&break;What agents and editors really think about using your own voice&break;How to write better by ignoring the rules&break;The keys to getting your voice and personality on the page&break;How to get back the unique voice you may have lost by trying to write like someone else&break;&break;Whether you write fiction, non-fiction or poetry, Finding Your Voice is a must for your personal library. Let's face it - editors, agents and readers all want to read something fresh and new. By finding your voice, you'll be giving them exactly what they want!",
        "Category": " Language Arts & Disciplines , Writing , General",
        "Publisher": "Writers Digest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Falling Off Cloud Nine and Other High Places (Devotionals for Teens, No. 2)",
        "Authors": "By Peterson, Lorraine, Dugan, Leroy (ILT), and Ahlquist, Neil (ILT)",
        "Description": "Addresses teen-age concerns and presents spiritual truths in a way which intends to be relevant to conduct of life.",
        "Category": " Religion , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1981"
        }
    },
    {
        "Title": "Pushkin and the Queen of Spades",
        "Authors": "By Randall, Alice",
        "Description": "Windsor Armstrong is a polished, Harvard-educated African American professor of Russian literature. Her son, Pushkin X, is an exceedingly famous pro football player, an achievement that impresses his mother not at all. Even more distressing, however, her beloved son has just become engaged to a gorgeous white Russian émigré who also happens to be a lap dancer.For Windsor this predicament is no laughing matter. Determined to get to the bottom of it, she embarks on a journey into her own rich past: to her Motown childhood, where the Temptations danced across the stage and love came disguised as a sharply dressed gangster; to Harvard, where she endured the humiliation of being an unwed black teen mother; to St. Petersburg, where the verses of the great Russian poet Alexander Pushkin, great-grandson of an African slave, moved through her head as she made love to her own white Russian. The urge to protect her son has been Windsor’s only goal, but as she draws ever closer to the secret that has cast a shadow over her life, the identity of her son's father, she discovers that the half-lies she has fed her boy don’t add up to the beauty of the truth.Balancing sharp-witted humor with profundity, sexiness with psychological depth, this is an exhilarating ride straight through the racially divided heart of contemporary America , which also probes the universal question of what it means to be a good mother. Pushkin and the Queen of Spades is a provocative, enormously entertaining novel that will change the landscape of literary fiction.",
        "Category": " Fiction , Literary",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Help! Somebody Get Me Out of Fourth Grade #7 (Hank Zipzer)",
        "Authors": "By Winkler, Henry and Oliver, Lin",
        "Description": "It’s time for the end of year parent-teacher conference, and Hank’s in a panic. He’s afraid that his teacher is going to tell his parents that he has to repeat the fourth grade. So Hank creates an elaborate scheme to have his parents win an out-of-town trip so they’re gone during the conference days. Of course, the plan backfires. Will Hank have to stay in fourth grade forever?",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Moscow Rules (Gabriel Allon)",
        "Authors": "By Silva, Daniel",
        "Description": "The death of a journalist leads Gabriel Allon to Russia, where he finds that in terms of spycraft, even he has something to learn. He's playing by Moscow rules now.It is not the grim, gray Moscow of Soviet times but a new Moscow, awash in oil wealth and choked with bulletproof Bentleys. A Moscow where power resides once more behind the walls of the Kremlin and where critics of the ruling class are ruthlessly silenced. A Moscow where a new generation of Stalinists is plotting to reclaim an empire lost and to challenge the global dominance of its old enemy, the United States.One such man is Ivan Kharkov, a former KGB colonel who built a global investment empire on the rubble of the Soviet Union. Hidden within that empire, however, is a more lucrative and deadly business. Kharkov is an arms dealer - and he is about to deliver Russia's most sophisticated weapons to al-Qaeda. Unless Allon can learn the time and place of the delivery, the world will see the deadliest terror attacks since 9/11 - and the clock is ticking fast.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Sunrise on the Mediterranean",
        "Authors": "By Frank, Suzanne",
        "Description": "When Dallas artist and time traveler Chloe Kingsley awakens in ancient Canaan dressed in her 1990s party clothes, she is mistaken for a goddess and embarks on a journey to save the ancient world from twentieth-century manipulation. 25,000 first printing.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Rosencrantz and Guildenstern Are Dead",
        "Authors": "By Stoppard, Tom",
        "Description": "",
        "Category": "",
        "Publisher": "Grove Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1971"
        }
    },
    {
        "Title": "The Door in the Dragon's Throat (Volume 1)",
        "Authors": "By Peretti, Frank E.",
        "Description": "An American archeologist and his two children seek God's protection and guidance as they journey to the Near East, in search of a buried biblical treasure which local residents believe is cursed",
        "Category": " Young Adult Fiction , Action & Adventure , General",
        "Publisher": "Crossway",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "The Congressional Globe: Containing the Debates and Proceedings of the First Session of the Thirty-Fifth Congress",
        "Authors": "By John C. Reeves",
        "Description": "",
        "Category": "",
        "Publisher": "Washington: John C. Reeves",
        "Price Starting With ($)": "221.87",
        "Publish Date": {
            "Month": "January",
            "Year": "1858"
        }
    },
    {
        "Title": "The Pocket Muse",
        "Authors": "By Wood, Monica",
        "Description": "A Whole Lot of Inspiration (in a Little Bit of Space!)The Pocket Muse is your key to finding inspiration when and where you want it. With hundreds of thought-provoking prompts, exercises and illustrations, you'll immediately:Get started writingOvercome writer's blockDevelop a writing habitThink more creativelyMaster style, revision and other elements of the craftThe rich variety of exercises will help you to create stories, focus on a single aspect of your writing, and encourage you to think about how and why you write in new and surprising ways.A truly unique book, The Pocket Muse is fun and effective. It will teach you, cheer you and inspire you to write as never before.",
        "Category": " Language Arts & Disciplines , Writing , General",
        "Publisher": "Monica Wood",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "The Glorious Cause (The American Revolutionary War)",
        "Authors": "By Shaara, Jeff",
        "Description": "In Rise to Rebellion, bestselling author Jeff Shaara captured the origins of the American Revolution as brilliantly as he depicted the Civil War in Gods and Generals and The Last Full Measure. Now he continues the amazing saga of how thirteen colonies became a nation, taking the conflict from kingdom and courtroom to the bold and bloody battlefields of war.It was never a war in which the outcome was obvious. Despite their spirit and stamina, the colonists were outmanned and outfought by the brazen British army. General George Washington found his troops trounced in the battles of Brooklyn and Manhattan and retreated toward Pennsylvania. With the future of the colonies at its lowest ebb, Washington made his most fateful decision: to cross the Delaware River and attack the enemy. The stunning victory at Trenton began a saga of victory and defeat that concluded with the British surrender at Yorktown, a moment that changed the history of the world.The despair and triumph of America’s first great army is conveyed in scenes as powerful as any Shaara has written, a story told from the points of view of some of the most memorable characters in American history. There is George Washington, the charismatic leader who held his army together to achieve an unlikely victory; Charles Cornwallis, the no-nonsense British general, more than a match for his colonial counterpart; Nathaniel Greene, who rose from obscurity to become the finest battlefield commander in Washington’s army; The Marquis de Lafayette, the young Frenchman who brought a soldier’s passion to America; and Benjamin Franklin, a brilliant man of science and philosophy who became the finest statesman of his day. From Nathan Hale to Benedict Arnold, William Howe to “Light Horse” Harry Lee, from Trenton and Valley Forge, Brandywine and Yorktown, the American Revolution’s most immortal characters and poignant moments are brought to life in remarkable Shaara style. Yet, The Glorious Cause is more than just a story of the legendary six-year struggle. It is a tribute to an amazing people who turned ideas into action and fought to declare themselves free. Above all, it is a riveting novel that both expands and surpasses its beloved author’s best work.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Before You Do: Making Great Decisions That You Won't Regret",
        "Authors": "By Jakes, T. D.",
        "Description": "In Before You Do, bestselling author T.D. Jakes turns his attention and teachings to the topic of relationships and the issues that need to be resolved by incorporating the spiritual and psychological tools that will help you reevaluate and reposition yourself.Relationship decisions come down to five crucial components, according to Bishop Jakes:Research: gathering information and collecting dataRoadwork: removing obstacles and clearing the pathRewards: listing choices and imaging their consequencesRevelation: narrowing your options and making your selectionRearview: looking back and adjusting as necessary to stay on courseBefore You Do gets you on the right track to making decisions that youÕll be proud of for the rest of your life. He gives you insight on how to reflect, discern, and decide the next step to take to have a strong and enduring love, marriage, and family.The Bishop takes a spiritual and practical approach to inherently emotional issues such as the outside influences on our relationships, e.g., in-laws, friends, and former spouses; coping with anger; parenting; financial concerns; negotiating high-profile lives; and so many more of the issues people face every day. His special brand of counseling and teaching appeals to the faith-based community and beyond, reaching millions who receive his wisdom in all media, especially books.",
        "Category": " Religion , Christian Living , Personal Growth",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Prayers For Children",
        "Authors": "By Wilkin, Eloise",
        "Description": "",
        "Category": "",
        "Publisher": "A Golden Book",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Unfortunate English: The Gloomy Truth Behind the Words You Use",
        "Authors": "By Brohaugh, William",
        "Description": "Readers may think twice about using such seemingly innocuous words as \"pretty,\" \"gymnasium,\" and \"goodbye\" after perusing this volume. In it, Brohaugh reveals the original meanings of a number of commonly used words--meanings that might offend the more delicate sensibilities of modern hearers, were they made aware of them. Brohaugh is the editor or author of several books on writing. Annotation ©2007 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Language Arts & Disciplines , Linguistics , Etymology",
        "Publisher": "Writers Digest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Strong Women Stay Young",
        "Authors": "By Wray, Wendy (ILT), Nelson, Miriam E., and Wernick, Sarah",
        "Description": "Miriam E. Nelson's research created news worldwide when the results were published in the Journal of the American Medical Association. After a year of strength training twice a week, women's bodies were 15 to 20 years more youthful. Without drugs, they regained bone, reversing osteoporosis. They became stronger--in most cases even stronger than when they were young. Their balance and flexibility improved. They were leaner and trimmer, while eating as much as ever. What's more, the women were so energized, they became 27 percent more active. No other program--whether diet, medication or aerobic exercise--has ever achieved comparable results.Strong Women Stay Young shows women how to get the same remarkable benefits at home or office, working out just twice a week. Individualized instructions get couch potatoes started--and help exercise buffs break through plateaus. Significant improvements are seen after just four weeks. This major new book features:Eight simple exercises done standing or seated--no sweat, no special clothesFully illustrated step-by-step instructions that any woman can customize to her needsImportant new information for women on muscle, bone, balance and fitnessInspiring stories of women age 35 to 89 who transformed their lives with this programProgress logs for the critical first twelve weeksBonus: Complete strength training program to do at the gym",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Casserole Cook Book",
        "Authors": "By Sunset",
        "Description": "Offers numerous recipes, menus, and serving suggestions for meat, vegetable, cheese, and egg casseroles",
        "Category": " Cooking , Courses & Dishes , Casseroles",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1980"
        }
    },
    {
        "Title": "Give 'Em What They Want: The Right Way to Pitch Your Novel to Editors and Agents",
        "Authors": "By Cook, Marshall J. and Camenson, Blythe",
        "Description": "Learn how to craft a killer pitch - and get your novel published today.One of a writer's most difficult tasks is crafting a submission package. In order to get published you need to compose queries, synopses, and outlines that will prove irresistible to agents and editors. Give 'Em What They Want uses step-by-step instructions to break down the process, making it easier than you thought possible to put together a query packet, sample chapters, outlines, synopses - everything you need to interest an agent or editor in your novel. Inside you'll find:Dozens of samples complete with comments and suggestions for improvementSuccessful submission techniques from published authorsAdvice from well-respected agents and editors about avoiding common submission pitfallsInformation on working with agents and editors once your pitch is completeAnd much more!Give 'Em What They Want includes everything you need to know about approaching anyone in the publishing industry with your novel. Pitching your novel has never been easier!",
        "Category": " Reference , Writing Skills",
        "Publisher": "Writers Digest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Myths and Symbols in Indian Art and Civilization",
        "Authors": "By Zimmer, Heinrich Robert and Campbell, Joseph (EDT)",
        "Description": "A landmark work that demystifies the rich tradition of Indian art, Myths and Symbols in Indian Art and Civilization analyzes key motifs found in legend, myth, and folklore taken directly from the Sanskrit. It provides a comprehensive introduction to visual thinking and picture reading in Indian art and thought. Ultimately, the book shows that profound Hindu and Buddhist intuitions on the riddles of life and death are universally recognizable.",
        "Category": " Social Science , Folklore & Mythology",
        "Publisher": "Princeton University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1972"
        }
    },
    {
        "Title": "Now They Call Me Infidel: Why I Renounced Jihad for America, Israel, and the War on Terror",
        "Authors": "By Darwish, Nonie",
        "Description": "A Cairo-raised daughter of a high-ranking Egyptian military officer describes how she was raised to hate Americans and Jewish people and submit to dictatorship, her decision to relocate to America as a result of her increasing concern about the violence in her culture, and her efforts to promote peace and tolerance at the risk of her own safety.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Sentinel HC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Mexican American Folklore: Legends, Songs, Festivals, Proverbs, Crafts and More (American Folklore Series)",
        "Authors": "By West, John",
        "Description": "Mexican-American traditions are richly nourished by the folkways of three cultures: Indian, Spanish, and Mexican. This comprehensive look at the Mexican-American world includes a range of traditional proverbs, riddles, stories and folksongs.",
        "Category": " Social Science , Ethnic Studies , Hispanic American Studies",
        "Publisher": "August House Publishers, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Encountering Jesus (Vital Signs Series)",
        "Authors": "By Holmes, Zan W.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.24",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "KIA: A Dr. Kel McKelvey Novel",
        "Authors": "By Holland, Thomas",
        "Description": "The Pentagon brass make the designations: AWOL. MIA. KIA. Every soldier with a designation, and no man left behind. And Dr. Kel McKelvey is the man to bring those soldiers home -- from battlefields around the world.When a soldier's remains are found in the Catholic cemetery of Thanh Lay Hamlet outside of the rechristened Ho Chi Minh City, a reluctant Vietnamese government agrees to the repatriation of the body believed to be Master Sergeant Jimmy Lee Tenkiller. Tenkiller was a Native American soldier who went missing in the chaos of Saigon during the summer of 1970. For fourteen years, his designation was AWOL, until the Status Review Board voted 2-1 to change it to KIA.Before the case can be closed, Dr. Kel McKelvey and his team at the Central Identification Lab must positively identify the body believed to be Jimmy Tenkiller. The skull's noble features suggest the sergeant's proud Choctaw-Cherokee heritage, but Kel's instincts give him pause. Using a combination of cutting-edge forensic technique and old fashioned anthropology, he sets out to unravel the chilling mystery of the body's identity. What he finds leads him deep into the Vietnamese wartime black market and into the haunted mind of Jimmy Tenkiller.Assisting Kel on the case is his colleague and friend, Chief Warrant Officer Thomas Edward Lafayette \"Shuck\" Deveroux of the Army's Criminal Investigative Division. Shuck has been assigned to solve a series of brutal murders on military bases in Kentucky and Tennessee, and he reluctantly adds Kel's identification to his caseload. But when the two investigators team up, they soon realize that all of their dead men may be telling the same tale.Dr. Kel McKelvey has devoted his life to bringing closure to the families of brave men and women who died fighting for their country. In KIA, he faces his greatest challenge yet -- to solve a chain of crimes committed bydesperate men in times of war and peace. The result is a mesmerizing thriller -- an intricate forensics case involving a fallen United States serviceman, from an author who is an expert in the field.",
        "Category": " Fiction , War & Military",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Chicken Soup for the Girlfriend's Soul: Celebrating the Friends Who Cheer Us Up, Cheer Us On and Make Our Lives Complete (Chicken Soup for the Soul)",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), Donnelly, Mark (COM), Donnelly, Chrissy (COM), and Adrian, Stefanie (COM)",
        "Description": "An inspiring and humorous celebration of the special bond of friendship.She championed you through your years wearing braces and you calmed her nerves before her walk down the aisle. She advised you on what to wear to land your perfect job and you taught her how to get her newborn to sleep during a midnight phone call. Together you've dug through your backyard looking for pirate's treasure and dug through bargain bins during shopping outings; you’ve shared your secrets, doubts and dreams; and you look forward to conquering hot flashes together. You may have met her in kindergarten or at work, in a playgroup or on the Internet—but if she’s cheered you up, cheered you on or lifted your spirit, Chicken Soup for the Girlfriend’s Soul is the perfect tribute to that special friend. Whether she's your lunch companion, your sounding board, your confidant, or all of the above, she anchors you during life's storms and helps you revel in life's joys.With tales of finding friends in unexpected places, of strength during life's toughest challenges, and of forging lifelong bonds and memories, this book will tug at your heart and hers as you celebrate the unique spirit of female friendship.",
        "Category": " Self-help , Personal Growth , Happiness",
        "Publisher": "HCI",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Autumn Journey",
        "Authors": "By Cummings, Pricilla",
        "Description": "In trying to win his father's respect, young Will goes on a hunting trip with his grandfather and shoots down a Canadian goose, only to become terribly upset with himself for doing such a thing, despite his desire to prove himself to his father.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Dutton Juvenile",
        "Price Starting With ($)": "11.62",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Therapeutic Touch: A Practical Guide",
        "Authors": "By MacRae, Janet",
        "Description": "A comprehensive instruction guide to the gentle, powerful, non-invasive healing technique being used increasingly both inside and outside the medical profession. Available to anyone searching to help others in pain.",
        "Category": " Health & Fitness , Alternative Therapies",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Citizens of the Empire: The Struggle to Claim Our Humanity",
        "Authors": "By Jensen, Robert",
        "Description": "As we approach the elections of 2004, U.S. progressives are faced with the challenge of how to confront our unresponsive and apparently untouchable power structures. With millions of antiwar demonstrators glibly dismissed as a “focus group,” and with the collapse of political and intellectual dialogue into slogans and soundbites used to stifle protest—“Support the Troops,” “We Are the Greatest Nation on Earth,” etc.—many people feel cynical and hopeless.Citizens of the Empire probes into the sense of disempowerment that has resulted from the Left’s inability to halt the violent and repressive course of post-9/11 U.S. policy. In this passionate and personal exploration of what it means to be a citizen of the world’s most powerful, affluent and militarized nation in an era of imperial expansion, Jensen offers a potent antidote to despair over the future of democracy.In a plainspoken analysis of the dominant political rhetoric—which is intentionally crafted to depress political discourse and activism—Jensen reveals the contradictions and falsehoods of prevailing myths, using common-sense analogies that provide the reader with a clear-thinking rebuttal and a way to move forward with progressive political work and discussions.With an ethical framework that integrates political, intellectual and emotional responses to the disheartening events of the past two years, Jensen examines the ways in which society has been led to this point and offers renewed hope for constructive engagement.Robert Jensen is a professor of media law, ethics and politics at the University of Texas, Austin. He is the author of Writing Dissent: Taking Radical Ideas from the Margins to the Mainstream, among other books. He also writes for popular media, and his opinion and analytical pieces on foreign policy, politics and race have appeared in papers and magazines throughout the United States.",
        "Category": " Political Science , History & Theory",
        "Publisher": "City Lights Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Creative Self-Hypnosis: New, Wide-Awake, Nontrance Techniques to Empower Your Life, Work, and Relationships",
        "Authors": "By Straus, Roger A.",
        "Description": "Explains how self-hypnosis can be used for self-management, and gives advice on improving one's performance and enjoying life more fully",
        "Category": " Self-help , Self-Hypnosis",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Decks 1-2-3",
        "Authors": "By Home Depot",
        "Description": "A comprehensive guide to decks explains how to design, build, accessorize, repair, and maintain a deck, providing expert advice on how to customize plans, understand building codes, create a deck that is perfect for one's individual tastes and needs, and select building materials, and includes seventy-five specific deck projects and more than six hundred photographs. 200,000 first printing.",
        "Category": " House & Home , Design & Construction",
        "Publisher": "Home Depot",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Dying to Kill (Angel Delaney Mystery Series #2)",
        "Authors": "By Rushford, Patricia H.",
        "Description": "Angel Delaney, on leave from the police force, investigates a multiple murder case in which all the evidence points to her close friend, and when both the friend and her almost-boyfriend Callen disappear, Angel must find a way to solve this mystery before it's too late. Original.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Revell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "What If? Writing Exercises for Fiction Writers",
        "Authors": "By Bernays, Anne and Painter, Pamela",
        "Description": "What If? is the first handbook for writers based on the idea that specific exercises are one of the most useful and provocative methods for mastering the art of writing fiction. With more than twenty-five years of experience teaching creative writing between them, Anne Bernays and Pamela Painter offer more than seventy-five exercises for both beginners and more experienced writers. These exercises are designed to develop and refine two basic skills: writing like a writer and, just as important, thinking like a writer. They deal with such topics as discovering where to start and end a story; learning when to use dialogue and when to use indirect discourse; transforming real events into fiction; and finding language that both sings and communicates precisely. What If? will be an essential addition to every writer's library, a welcome and much-used companion, a book that gracefully borrows a whisper from the muse.",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Angels, Miracles, and Messages",
        "Authors": "By Guidepost",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Hurricane",
        "Authors": "By Harper, Karen",
        "Description": "With lashing rain and brutal winds bearing down on them, residents of southwest Florida prepare for evacuation. But Julie Minton cannot leave. Her fourteen-year-old daughter, Randi, left home earlier that morning to go out on a Jet Ski with Thad Brockman, a boy Julie barely knows. Now Randi and Thad are missing — and the hurricane that hours ago was just another routine warning has turned toward shore.With local law enforcement absorbed in emergency response measures, Julie has only the help of Zack Brockman, Thad's father. Together they begin a race against time to find their children — but first they must battle not only Mother Nature, but an enemy willing to use the danger and devastation of the storm for their own evil ends.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Express Male (Hqn Romance)",
        "Authors": "By Bevarly, Elizabeth",
        "Description": "Why is everyone calling her \"Lila\"?Music teacher and part-time lingerie saleswoman Marnie Lundy's biggest thrill is playing piano at the local mall...until the night everyone seems to think she's somebody else!Suddenly she's being addressed in code, menaced by a man who claims to know her intimately and rescued by a handsome spymaster who thinks she's a threat to national security!But OPUS agent Noah Tennant has the feeling she's more Mata Hari than Mother Teresa. Could a woman this sexy truly be innocent, or is Marnie his opponent in a deadly game of spy vs. spy?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HQN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "The Suicide Club",
        "Authors": "By Wilson, Gayle",
        "Description": "Lindsey Sloan teaches the best and brightest studentsat Randolph-Lowen High School—exceptional teenswith promising futures far from their small Alabamahometown. So when brash detective Jace Nolan arrivesfrom up north and accuses her kids of setting a seriesof fires in local black churches, Lindsey is furious. No matter how Jace tries to convince her, Lindseycan't believe her pupils could do something so horrible,let alone be addicted to the rush of getting away withit. But when her attraction to Jace places her in mortaldanger and people begin dying, Lindsey can no longerbe sure just what her students are capable of.If Jace is right, it's up to the two of them to outsmartthese  criminal  minds—before  they  carry  out  theultimate thrill-kill.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Blood Red",
        "Authors": "By Graham, Heather",
        "Description": "When a fortune-teller shows bridesmaid Lauren Crow anomen of her gruesome death, she and her friends laugh itoff as cheesy theatrics—until women begin disappearingin the night.Even as the streets become more dangerous, Lauren findsherself lusting after a man who is himself dangerous—and quite possibly crazy. Mark Davidson prowls the cityby night armed with crosses and holy water, in searchof vampires, whose existence, he insists, is real. He is asirresistibly drawn to Lauren as she is to him, and not onlybecause she's the image of his murdered fiancée. ButMark's frightening obsession with finding his lover's killermerely hides a bitter vendetta that cuts deeper than griefover a lost love. As Lauren wrestles with desire and disbelief, sinistershadows lengthen over New Orleans, threatening herfriends and foretelling a battle that may spell the end ofthe city's uneasy truce between the living and the undead.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Frost of Heaven",
        "Authors": "By Podrug, Junius",
        "Description": "American journalist Peter MacKinzie sets out to unravel the mystery behind the disappearance of his father, a RAF pilot on a secret mission over the Himalayas, and joins forces with a beautiful and mysterious Tibetan woman as he dodges kidnappers, a murder charge, and others who want to keep the past hidden. Reprint.",
        "Category": " Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Legend In Green Velvet",
        "Authors": "By Elizabeth Peters",
        "Description": "A young American archaeology student in Edinburgh, fleeing from mysterious pursuers, links her fortunes with those of a young Scottish laird who is being threatened by the same unidentified figures",
        "Category": "",
        "Publisher": "New York, NY: TOR",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Murder Plays House",
        "Authors": "By Waldman, Ayelet",
        "Description": "Juliet Applebaum is a public defender turned stay-at-home mom—and a “highly likable sleuth” (Judith Kelman). Now in Murder Plays House, with a new arrival on the way, the Applebaum household is bursting at the seams. And Juliet is balancing clue-chasing and diaper-changing with a new task: house-hunting.   Juliet loves her kids. She loves their dirty little faces and skinned knees. She loves the ridiculous and amazing things they say. But when three-and-a-half year old Isaac evicts her husband and her from their own bed one night, love is the last thing on her mind. Juliet now recognizes the need for a few changes…starting with a bigger house. And when the new baby arrives, they’ll welcome the extra space.   But if there’s ever a bad time to search for a new house in L.A., it’s now. In a buyer-unfriendly real estate market, one practically has to kill to find an affordable home. No wonder Juliet is prepared to overlook a corpse on the grounds of her would-be dream house. To salve her conscience—and get her foot literally in the front door—she vows to find the killer of the homeowner’s sister. The investigation leads her from the madness of house-hunting into a world of washed-up actors and canceled TV shows, a world more depraved than she could ever have imagined.   “Smoothly paced and smartly told.”—The New York Times Book Review    “Think Chinatown, but with strollers and morning sickness.”—Long Island Press",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "The Little Book of Prayers",
        "Authors": "By Schiller, David (EDT)",
        "Description": "The perfect gift for seekers, the curious, and the spiritually hungry, The Little Book of Prayers now has a stunning new cover and a more prayer book–like format.Gathered from holy books and prayer books, from songs and spirituals, spoken traditions and poets, it is an unexpectedly approachable collection of common and uncommon prayers from around the world. The entries, one per page or spread, are chosen for their depth of feeling, beauty of expression, spiritual intensity, and sense of the universal. The book is organized into broad categories of praise, entreaty, contemplation, mourning, and grace; and two indexes—one by authorship, and the other by topic—make it immediately accessible.There are familiar prayers, like the Lord’s Prayer and 23rd Psalm, which, placed in new context, shine with a renewed beauty and wisdom. You’ll find prayers unfamiliar to many in the West, such as the “Opener” from the Koran or the four vows of the Boddhisattva, chanted every evening in Zen monasteries around the world. And the surprising—from the “Prayer of the Unknown Confederate Soldier” to the blues of Lightnin’ Hopkins to the poetry of Rumi.God help us to live slowly: To move simply: To look softly: To allow emptiness:To let the heart create for us.Amen.—Michael LeunigYou, whose day it is, make it beautiful. Get out your rainbow colors, so it will be beautiful.—Nootka Song",
        "Category": " Religion , Comparative Religion",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "The Heidelbergh Catechism Simplified; Or, Introduction to the Exercises on the Heidelbergh Catechism",
        "Authors": "By Samuel R. Fisher",
        "Description": "",
        "Category": "",
        "Publisher": "Philadelphia: Reformed Church Publication Board",
        "Price Starting With ($)": "49.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1850"
        }
    },
    {
        "Title": "Murder on the Cliff (Charlotte Graham Mystery Series)",
        "Authors": "By Matteson, Stefanie",
        "Description": "Attending a seaside party honoring Madame Butterfly--a character she once played--Charlotte Graham, former actress and sleuth, becomes involved in a real-life tragedy when the real Madame Butterfly's great-granddaughter \"falls\" off a cliff",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Diamond Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Photographer's Market Guide to Building Your Photography Business",
        "Authors": "By Orenstein, Vik",
        "Description": "Displaying the same wit and charm that made her Creative Techniques for Photographing Children a commercial success, Vik Orenstein shoots straight with photographers on what it takes to build a successful photo business. She combines big-picture thinking with a soft touch to deliver sound, practical advice on such core topics as developing a marketing plan, building a clientele, networking and maintaining creative fulfillment.   The guide is a major asset for:  - Amateurs seeking a friendly overview of the business - Established photographers delving into a new niche - Freelancers interested in selling stock - Photographers starting their own studio  At 320 pages, the book's simultaneous deep and broad treatment makes it an excellent companion to the business-focused introduction found in Photographer's Market. Vik also covers such important specialties as wedding, commercial and nature photography in individual chapters and frequently complements her own advice with that of industry experts.",
        "Category": " Photography , Business Aspects",
        "Publisher": "Penguin Publishing Group",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The Duchess' Lover",
        "Authors": "By Beard, Julie",
        "Description": "After twenty years of marriage to her cruel, domineering husband, Olivia, the widowed duchess of Brandhurst is finally free to pursue her own life and finds new love in the arms of gardener Will Barnes, but scandal and vicious accusations could destroy them both. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Jove",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Midnight in Ruby Bayou (St. Kilda Consulting)",
        "Authors": "By Lowell, Elizabeth",
        "Description": "“Romantic suspense is her true forte.”—Minneapolis Star-Tribune New York Times bestselling author Elizabeth Lowell creates suspense and emotional intensity with her classic Midnight in Ruby Bayou, a riveting romantic thriller in her popular four-book series featuring the remarkable Donovan family. A recipient of the Romance Writers of America Lifetime Achievement Award, Lowell delivers a treasure of a story that seamlessly blends passion and peril as a beautiful artist and a dashing adventurer join forces on a hunt for a legendary fortune in gems. Midnight in Ruby Bayou is a treat for Linda Howard, Nora Roberts, and Jayne Ann Krentz fans.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "You Can Write Children's Books",
        "Authors": "By Dils, Tracey E.",
        "Description": "You Can Write Children's BooksIf you've always enjoyed telling children stories, this book will guide you through the first steps–from writing them down to submitting them with confidence. From inspiration to publication, Tracey Dils shows you how to write the very best children's books and offers important tips for getting published.\"You Can Write Children's Books is a top-quality introduction to the nuts and bolts of writing for young people. Portions of the book are so lucid and helpful that I found myself wishing I'd written them myself! Well done, Tracey Dils!\"- Eric D. Suben, former editor-in-chief, Golden Books",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Writers Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Scrooge Wore Spurs",
        "Authors": "By Dailey, Janet",
        "Description": "Determined to make his ranch profitable, bitter rancher Eben MacCallister, desperately in need of money, is shocked to discover that the fortune he inherited from his late sister is actually four mischievous children who, along with his ex-girlfriend Maggie, teach him about love and family. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Zebra",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "A Most Unsuitable Groom (The Beckets of Romney Marsh, 4)",
        "Authors": "By Michaels, Kasey",
        "Description": "Hot-blooded Spencer Becket went off to war in America,full of passion and young ideals, only to return older,wiser and with part of his memory missing.Fiery Mariah Rutledge arrived at Becket Hall one stormynight, heavy with child and more than willing to refreshSpencer's lost memory.Forced to the altar, Spencer and Mariah have little timeto explore their attraction before they uncover a plot torestore the recently vanquished Napoleon to power in amost unusual&#151;and deadly&#151;way. Bound by the secrets thatkeep the Beckets safe from harm, Spencer and Mariah mustbattle the world and their own devils in order to prevent atragedy&#133;but what will be the price of their victory?",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "HQN",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Custard's Last Stand (Pennsylvania Dutch Mystery)",
        "Authors": "By Myers, Tamar",
        "Description": "When Colonel George Custard, the hotel tycoon who had selected her hometown of Hernia, Pennsylvania, as the site for his new five-star hotel, despite much local opposition, turns up dead, innkeeper and amateur sleuth Magdalena Yoder searches for a killer. Reprint.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Signet",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "What Would Your Character Do?",
        "Authors": "By Maisel, Eric and Maisel, Ann",
        "Description": "Get Inside Your Character's HeadJust how well do you know your characters?Test yourself&#150and your characters&#150with 30 interactive pop quizzes designed to help you discover exactly what makes your characters tick.Noted author Eric Maisel draws on his technical knowledge of the craft and his background in psychology to show you how to combine character traits, character psychology, and character development to create realistic, memorable, and mutable characters.The 30 real-life scenarios include questions and answers that provide you with a window into your characters' souls. For example:What would motivate your character to tell a lie&#150a big lie that may have unintended consequences?Is your character the type who would blow the whistle on a corporate cover-up or would she quietly toe the line?How would your character cope with the loss of a parent with whom he was exceptionally close?How likely would your character be to flirt with an attractive stranger in a hotel bar?Is your character the type who would drop everything&#150and everyone&#150for a spontaneous road trip?Plus, find out how to develop each scenario further using corresponding prompts and specific psychological insight into areas such as the role friendship plays in a person's mental and physical health, conflict resolution in intimate relationships, and the connection between time-impatience and free-floating hostility.With What Would Your Character Do?, you don't have to guess at your character's responses to the important decisions and unexpected challenges he's sure to encounter in your story. Use and reuse these scenarios on each of your characters until you've got a nuanced, distinct cast that readers will never be able to forget!",
        "Category": " Language Arts & Disciplines , Writing , Authorship",
        "Publisher": "Writers Digest Books",
        "Price Starting With ($)": "11.48",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Write-Brain Workbook: 366 Exercises to Liberate Your Writing",
        "Authors": "By Neubauer, Bonnie",
        "Description": "Never face a blank page again!With unique daily prompts and stimulating pages, you'll be able to easily incorporate writing into your life, and you'll never have to face another wordless day. The Write-Brain Workbook is the first of its kind&#150an easy, fun, and playful way to exercise your creative writing muscles each day.Eliminate the dreaded emptiness of the blank pageWrite without the pressure of preconceived expectationsLearn about your own unique writing processBuild the momentum of a quick daily writing practiceUnlock writer's blockApply the breakthroughs from daily practice to your \"real\" writingExpand how you see yourself as a writerExperiment with different ways to approach writingAffirm your commitment to being a writerThe Write-Brain Workbook is bursting with 366 innovative exercises that let you experiment and play with words and styles. Whether you love the pure joy of writing, are just getting started, or are trying to get past a particular writing block... this is the book you've been waiting for!",
        "Category": " Language Arts & Disciplines , Writing , General",
        "Publisher": "Writers Digest Books",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "The Proud Italians: Our Great Civilizers",
        "Authors": "By Pescosolido, Carl A.",
        "Description": "",
        "Category": " Social Science , Ethnic Studies , General",
        "Publisher": "Latium Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Robert's Rules Of Writing: 101 Unconventional Lessons Every Writer Needs to Know",
        "Authors": "By Masello, Robert",
        "Description": "The 101 Rules You Need to Know*but no one has ever told youYou already have a million writing books. You know the principles, the lectures, the \"expert\" techniques. And you've discovered that sometimes tried-and-true just equals tired.In Robert's Rules of Writing, successful author Robert Masello stomps out status quo writing advice and delivers 101 uninhibited techniques to improve your writing that include:Burn your journal (See rule 1)Strip down to your briefs (See rule 38)Spend time gossiping (See rule 61)Buy the smoking jacket (See rule 56)Skip the Starbucks (See rule 7)De-claim! De-claim! (See rule 63)Whether you're a fiction writer, freelancer, memoirist, or screenwriter, Robert's Rules of Writing gives you the unorthodox advice to transform your writing life and get published!",
        "Category": " Language Arts & Disciplines , Writing , General",
        "Publisher": "Writers Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Irresistible (Banning Sisters Trilogy)",
        "Authors": "By Robards, Karen",
        "Description": "Claire Banning fulfilled every debutante's dream when she married a rich nobleman. Soon, however, the celebrated beauty realizes she wed a dissolute wastrel. Bitterly hurt and desperately lonely, Claire vows nonetheless to take her expected place in society. Then on a journey home to her husband's estate on the coast of Sussex, she is abducted, and her life -- and her heart -- are changed forever.  Hugh Battancourt -- a dark and dangerous nobleman who long ago turned his back on the ton and now leads a life secretly dedicated to his country's service -- is determined not to be swayed by his prisoner's beauty as they share a cabin on a ship bound for France. Lives depend on his retrieving from her a letter full of secrets she intends to turn over to the enemy. But even as Claire and Hugh engage in a battle of wits and wills, captor and captive find themselves drawn irresistibly to each other. Is it possible, Claire wonders, that she could discover the true meaning of love that has eluded her with this handsome stranger? One who will lay his life on the line in order to protect her from someone who is intent on placing Claire in the path of danger?  With this sensual and entrancing tale, bestselling author Karen Robards continues her wonderful trilogy of three sisters taking their rightful place as the belles of Regency England's ton.",
        "Category": " Fiction , Romance , Historical , Regency",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "John of God: The Brazilian Healer Who's Touched the Lives of Millions",
        "Authors": "By Leffler, Karen, Cumming, Heather, and Goswami, Amit (FRW)",
        "Description": "\"I am the happiest man in the world because God entrusted me with this mission.\"   In John of God: The Brazilian Healer Who's Touched the Lives of Millions, a seemingly average rancher from Abadiânia, Brazil, offers a powerful message of love, compassion, and hope for humanity. João Teixeira de Faria, the healer and medium known as John of God, allows \"spirit doctors\" to take over his body three times a week to miraculously treat the thousands of people from all over the world who come in need of remedy. John of God has fulfilled his mission as a medium for more than forty-eight years, making numerous pilgrimages around the world. Drawn by the hope of instantaneous healing, over eight million believers have proceeded in front of him throughout his life, as tens of thousands journey to Brazil each year to see John of God and his home, the Casa de Dom Inácio de Loyola, which is designed to accommodate hundreds of visitors each day. Despite all the media attention paid to this inter-nationally praised healer, little has been revealed about his personal life. Translator Heather Cumming and photographer Karen Leffler have traveled with John of God and chronicled his life and work. What began as an endeavor to document the testimonials of his remarkable healings has now become the first complete, authorized portrait of his world. Stirring words and vivid photographs -- many of which capture the haunting spiritual energy that surrounds John of God and the Casa -- take us on an affecting and deeply personal journey with the humble medium who offers hope for people with none. The result is an intimate portrait of an ordinary individual in extraordinary circumstances and a reading experience that will bring readers of every persuasion closer to their faith. To learn more about John of God and his mission, go to www.beyondword.com and www.friendsofthecasa.org.",
        "Category": " Body, Mind & Spirit , Spiritualism",
        "Publisher": "Atria Books/Beyond Words",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Dance of Death (Agent Pendergast series, 6)",
        "Authors": "By Preston, Douglas J. and Child, Lincoln",
        "Description": "Stalked throughout his life by his diabolical brother Diogenes, FBI special agent Pendergast finds himself framed for the murders of numerous people close to him, a situation that forces him to flee while he works alongside a friend from the NYPD to prove his innocence. By the author of Brimstone. Reprint.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Shooting & Selling Your Photos: The Complete Guide to Making Money with Your Photography",
        "Authors": "By Zuckerman, Jim",
        "Description": "Turn your love of photography into a money-making business!Get all the information you need to successfully shoot, sell, and market your photos. Inside, world-renowned photographer Jim Zuckerman provides an exciting combination of authoritative, straightforward instruction and beautiful show-and-tell photography.Zuckerman's methods are comprehensive and easy to put into action. First, you'll learn how to create the highest quality photos:Evaluate your photography, then take 5 easy steps to improve itPick powerful, interesting, and vivid subjectsUse dramatic lighting and high-quality backgroundsJuxtapose colorful subjects for maximum impactChoose the best format for your work&#150film vs. digitalThen you'll master the secrets of business success:Find subjects and themes that sellCreate inexpensive, yet striking, print and online portfoliosEstablish yourself on the internet through websites and online promotionsExecute dynamic advertising, direct mail and publicity campaignsGet noticed with creative, professional submissionsPut together a portfolio that showcases you strengths&#150fine art, wildlife, advertising, magazine, or stock photographyBut that's not all! Zuckerman also shows you how to sell your work at art shows, join a stock photography agency, prepare winning submissions&#150even self-publish your work and develop a product line.Turn your dream into reality and start making money today&#150Jim Zuckerman shows you how to make it happen!",
        "Category": " Photography , Techniques , General",
        "Publisher": "Writers Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Everything Diabetes Book",
        "Authors": "By Ford-Martin, Paula and Blumer, Ian",
        "Description": "",
        "Category": " Health & Fitness , Diseases , Diabetes",
        "Publisher": "F+W Media, Inc",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Veterinary Notes For Horse Owners: An Illustrated Manual Of Horse Medicine And Surgery",
        "Authors": "By Hayes, Horace and Rossdale, Peter",
        "Description": "Captain M. Horace Hayes's Veterinary Notes for Horse Owners has been the standard work on equine health care for more than a century. The seventeenth edition of this \"bible\" is fully revised by one of England's leading veterinarians, Peter D. Rossdale, Ph.D., F.R.C.V.S., with the help of leading veterinary specialists.  A totally comprehensive manual of horse medicine and surgery, it explains the symptoms and treatments of every disease or injury that the horse owner is likely to encounter. Written in a straightforward manner that will appeal to both novices and experts, the book contains detailed sections on the organ systems, the musculoskeletal system, the reproductive system, infectious diseases, medical and surgical advances, management and husbandry, exercise physiology, the purchase of horses, legal and medical certification, and up-to-date information on the veterinary service itself. Also included are invaluable Sections on nutrition, determination of age, proprietary medicines, prohibited substances, and notifiable diseases. This latest revised edition has entirely new illustrations and photographs.  Clear, concise, and authoritative, Veterinary Notes for Horse Owners saves horses' lives.",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "The Secular Mind",
        "Authors": "By Coles, Robert",
        "Description": "Does the business of daily living distance us from life's mysteries? Do most Americans value spiritual thinking more as a hobby than as an all-encompassing approach to life? Will the concept of the soul be defunct after the next few generations? Child psychiatrist and best-selling author Robert Coles offers a profound meditation on how secular culture has settled into the hearts and minds of Americans. This book is a sweeping essay on the shift from religious control over Western society to the scientific dominance of the mind. Interwoven into the story is Coles's personal quest for understanding how the sense of the sacred has stood firm in the lives of individuals--both the famous and everyday people whom he has known--even as they have struggled with doubt. As a student, Coles questioned Paul Tillich on the meaning of the \"secular mind,\" and his fascination with the perceived opposition between secular and sacred intensified over the years. This book recounts conversations Coles has had with such figures as Anna Freud, Karen Horney, William Carlos Williams, Walker Percy, and Dorothy Day. Their words dramatize the frustration and the joy of living in both the secular and sacred realms. Coles masterfully draws on a variety of literary sources that trace the relationship of the sacred and the secular: the stories of Abraham and Moses, the writings of St. Paul, Augustine, Kierkegaard, Darwin, and Freud, and the fiction of George Eliot, Hardy, Meredith, Flannery O'Connor, and Huxley. Ever since biblical times, Coles shows us, the relationship between these two realms has thrived on conflict and accommodation. Coles also notes that psychoanalysis was first viewed as a rival to religion in terms of getting a handle on inner truths. He provocatively demonstrates how psychoanalysis has either been incorporated into the thinking of many religious denominations or become a type of religion in itself. How will people in the next millennium deal with advances in chemistry and neurology? Will these sciences surpass psychoanalysis in controlling how we think and feel? This book is for anyone who has wondered about the fate of the soul and our ability to seek out the sacred in our constantly changing world.",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Princeton University Press",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Into the Fire (Troubleshooters, Book 13)",
        "Authors": "By Brockmann, Suzanne",
        "Description": "Suspense doesn’t burn any brighter and desire doesn’t run any deeper than when Suzanne Brockmann takes the helm, opens the throttle, and takes readers along for a breathless ride as she breaks the thrill barrier–again and again. With Into the Fire, Brockmann lights the fuse on her most explosive story yet.Vinh Murphy–ex-Marine and onetime operative for the elite security firm Troubleshooters Incorporated–has been MIA ever since his wife, Angelina, was caught in a crossfire and killed during what should have been a routine bodyguard assignment. Overcome with grief, Murphy blames the neo-Nazi group known as the Freedom Network for her death. Now, years later, Freedom Network leader Tim Ebersole has been murdered–and the FBI suspects Murphy may have pulled the trigger. To prevent further bloodshed, Murphy’s friends at Troubleshooters scramble to find him and convince him to surrender peacefully.Murphy himself can’t be sure what he did or didn’t do during the years he spent mourning and lost in an alcohol-induced fog. He does know he occasionally sought solace from Hannah Whitfield, a former police officer and the very friend who’d introduced him to his beloved late wife.But Hannah, still grappling with the deafness that resulted from an injury sustained while on duty, was fighting her own battles. For years Hannah had feelings for Murphy, and one painful night their suffering brought them together in a way neither expected–and both regretted.Murphy is ready to rejoin the living. As always, he finds himself knocking on Hannah’s door, and as always, his longtime friend welcomes him back into her home. Yet even as Murphy slowly rebuilds his splintered life, he continues to fight his growing feelings for Hannah. Then he learns of Ebersole’s murder and comes to believe that the Freedom Network has targeted him–and Hannah–to avenge their leader’s death to violence. Now Murphy must face the terrifying prospect of losing another woman he loves. As the Troubleshooters desperately search for him, Murphy races toward a deadly confrontation with the Freedom Network and ultimate choice: surrender his life in hopes that Hannah will be spared, or risk everything to salvage whatever future they may have together.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "The Burnt House: A Peter Decker/Rina Lazarus Novel (Decker/Lazarus Novels, 16)",
        "Authors": "By Kellerman, Faye",
        "Description": "At 8:15 in the morning, a small commuter plane carrying forty-seven passengers crashes into an apartment building in Granada Hills, California. Shock waves ripple through Los Angeles, as L.A.P.D. Lieutenant Peter Decker works overtime to calm rampant fears of a 9/11-type terror attack. But a grisly mystery lives inside the plane's charred and twisted wreckage: the unidentified bodies of four extra travelers. And there is no sign of an airline employee who was supposedly on the catastrophic flight.Decker and his wife, Rina, have personal reasons for being profoundly shaken by the tragedy, since the \"accident\" occurred frighteningly close to their daughter Hannah's school. Luckily, their child and her schoolmates escaped unscathed. But the fate of the unaccounted-for flight attendant—twenty-eight-year-old Roseanne Dresden—remains a question mark more than a month after the horrific event, when the young woman's irate stepfather calls, insisting that she was never onboard the doomed plane. Instead, he claims, she was most likely murdered by her abusive, unfaithful husband. But why, then, was Roseanne's name included on the passenger list?Under intense pressure from the department to come up with answers, Decker launches an investigation that carries him down a path of tragic history, dangerous secrets, and deadly lies—and leads him to the corpse of a three-decades-missing murder victim. And as the jagged pieces slowly fall into place, a frightening picture begins to form: a mind-searing portrait of unimaginable evil that will challenge Decker's and Rina's own beliefs about guilt and innocence and justice. Combining relentless suspense with intense, multilayered human drama, The Burnt House is Faye Kellerman at her mesmerizing best.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "His Dark Materials Omnibus (The Golden Compass / The Subtle Knife / The Amber Spyglass)",
        "Authors": "By Pullman, Philip",
        "Description": "***** THE BOOK OF DUST, the long-awaited new novel from Philip Pullman set in the world of His Dark Materials, has been hailed by the New York Times as \"A stunning achievement\"*****The Golden Compass, The Subtle Knife, and The Amber Spyglass are available together in one volume  perfect for any fan or newcomer to this modern fantasy classic series  that has graced the New York Times, Wall Street Journal, San Francisco Chronicle, Book Sense, and Publishers Weekly bestseller lists.These  thrilling adventures tell the story of Lyra and Will—two ordinary  children on a perilous journey through shimmering haunted otherworlds.  They will meet witches and armored bears, fallen angels and soul-eating  specters. And in the end, the fate of both the living—and the dead—will  rely on them.Phillip Pullman’s spellbinding His Dark Materials  trilogy has captivated readers for over twenty years and won acclaim at  every turn. It will have you questioning everything you know about your  world and wondering what really lies just out of reach.Honors and Praise for His Dark Materials:An Entertainment Weekly All-Time Greatest NovelA Newsweek Top 100 Book of All Time\"Arguably the best juvenile fantasy novel of the past twenty years.\" —The Washington Post    \"Very grand indeed.\" —The New York Times “Pullman is quite possibly a genius.” —Newsweek",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Parenting from the Inside Out: How a Deeper Self-Understanding Can Help You Raise Children Who Thrive",
        "Authors": "By Siegel, Daniel J. and Hartzell, Mary",
        "Description": "How many parents have found themselves thinking: I can't believe I just said to my child the very thing my parents used to say to me! Am I just destined to repeat the mistakes of my parents? In Parenting from the Inside Out, child psychiatrist Daniel J. Siegel, M.D., and early childhood expert Mary Hartzell, M.Ed., explore the extent to which our childhood experiences actually do shape the way we parent. Drawing upon stunning new findings in neurobiology and attachment research, they explain how interpersonal relationships directly impact the development of the brain, and offer parents a step-by-step approach to forming a deeper understanding of their own life stories, which will help them raise compassionate and resilient children. Born out of a series of parents' workshops that combined Siegel's cutting-edge research on how communication impacts brain development with Hartzell's thirty years of experience as a child-development specialist and parent educator, Parenting from the Inside Out guides parents through creating the necessary foundations for loving and secure relationships with their children.",
        "Category": " Family & Relationships , Reference",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Success Built to Last: Creating a Life That Matters",
        "Authors": "By Porras, Jerry I., Thompson, Mark, and Emery, Stewart",
        "Description": "Chosen by BusinessWeek as one of the top 5 books of 2006 in careers.  Read the full story at businessweek.com.        Imagine discovering what successful people have in common, distilling it into a set of simple practices, and using them to transform your life and work. Authored by three legends in leadership and self-help – including Built to Last co-author Jerry Porras – it challenges conventional wisdom at every step. Success Built to Last draws on face-to-face, unscripted conversations with hundreds of remarkable human beings from around the world. Meet billionaires, CEOs, presidents of nations, Nobel laureates and celebrities – the rich, the famous and the unknown. Meet unsung heroes who've achieved lasting impact without obvious power or charisma. Famous or not, most started out ordinary. Discover how successful people \"harvest\" their strengths and their weaknesses, their victories and their surprising failures. Discover how you can find meaning in your life and work just as they did and summon the courage to follow your passions. Above all, see how they've sustained success for decades and you can too.         Foreword by Senator John McCain  Acknowledgements     Introduction—From Built to Last to Success Built to Last   Chapter 1: From Great to Lasting—Redefining Success        Part I: Meaning—How Successful People Stay Successful   Chapter 2: Love it or Lose—Passions and the Quest for Meaning  Chapter 3: Portfolio of Passions—It’s Not About Balance  Chapter 4: Why Successful People Stay Successful—Integrity to Meaning        Part II: ThoughtStyles—Extreme Makeovers Start in Your Head   Chapter 5: The Silent Scream—Why It’s So Damn Hard to Do What Matters  Chapter 6: The Cause Has Charisma—You Don’t Have to Be Charismatic to Be Successful  Chapter 7: The Tripping Point—Always Make New Mistakes  Chapter 8: Wounds to Wisdom—Trusting Your Weaknesses and Using Your Core Incompetencies        Part III: ActionStyles—Turning Passion into Action   Chapter 9: Earning Your Luck—Preparing for Serendipity by Using Big Hairy Audacious Goals   Chapter 10: Naked Conversations—Harvesting Contention  Chapter 11: Creating Alignment—The Environment Always Wins  The Pleasure of Finding Things Out—A Look at the Research Behind Success Built to Last      Endnotes  Biographical Index  Index",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Wharton School Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Bangalore Tiger: How Indian Tech Upstart Wipro is Rewriting the Rules of Global Competition",
        "Authors": "By Hamm, Steve",
        "Description": "Of all the tech tigers in India, Wipro is one of a handfulthat stands out from the pack. In the past five years,it has become one of the most accomplished techservices providers in the world, delivering businessvalue through a combination of process excellence,quality frameworks, and service delivery innovation.Totally dedicated to customer satisfaction, Wipro isknown to go above and beyond to make customershappy. It’s a move that’s paid off handsomely, witha 24 percent operating profit in its tech servicesdivision—more than twice the industry average.Bangalore Tiger is the story of Wipro’s transformationand its impact on the tech services industry andthe rules of global competition. BusinessWeek seniorwriter Steve Hamm takes you inside the halls of thistransnational phenomenon to reveal the true secretsof Wipro’s superior business: its people, principles,and core competencies.From Wipro’s triumphs to its missteps, Hammmines a treasure of business lessons, explaining howand, more important, why it is necessary to:Expand quickly without stumblingFollow the new rules for outsourcersInnovate every day—or elseBe obsessive about customersMotivate employees the Wipro wayPlan three years ahead to preparefor rapid growthHamm also gives you a rare glimpse into the mind ofWipro’s charismatic chairman and thought leader, AzimPremji. Guiding Wipro’s growth every step of the way,Premji was one of the first business leaders in India todecree that his company would not pay bribes. You’llsee how his adoption of world-class business processeshelped Wipro thrive—and how Wipro is helping to fulfillhis dream of a better educated, more prosperous India.Removing the shroud of secrecy around Indianmanagement principles, Hamm provides a real-worldblueprint for operating a successful transnationalorganization, as viewed through the eye of theBangalore Tiger.",
        "Category": " Business & Economics , International , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "6.23",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Hate on Trial: The Case Against America's Most Dangerous Neo-Nazi",
        "Authors": "By Dees, Morris and Fiffer, Steve",
        "Description": "A crusading civil-rights attorney describes how he took on the overlord of the White Aryan Resistance in a courtroom showdown that turned outrage into justice after an Ethiopian college student was bashed to death by neo-Nazis in Portland, Oregon. 25,000 first printing. $25,000 ad/promo.",
        "Category": " Social Science , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Midnight Peaches",
        "Authors": "By Litman, Viqui",
        "Description": "When Melissa Warringale returns to The Ladies Farm--her late mother's bed-and-breakfast in Sydonia, Texas--to recover from her broken marriage, she finds her life changing for the better when she makes new friends, saves the town's annual Peach Fest, and finds the courage to love again. 20,000 first printing.",
        "Category": " Fiction , Women",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.18",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Heat Wave",
        "Authors": "By Landis, Jill Marie",
        "Description": "Throughout her dazzling career, bestselling author Jill Marie Landis has consistently written stories filled with unforgettable sensuality, creating characters whose vibrant emotions instantly sweep you into their lives. Now inHeat Wave, Landis turns up the heat and delivers her most riveting novel yet.Private investigator Kat Vargas once cared about someone so much it hurt. Once she lived a dream life with her first love and fiancé—until betrayal followed by shattering tragedy ended it all. Kat has sworn never to get too close to anyone again. But now the peace and quiet of Twilight Cove is driving the straight-talking, no-nonsense P.I. crazy. Then a prospective new client shows up at the door. Moved by his stubbornness and sincerity, Kat takes his case, breaking a promise to relax, recoup, and rethink her solitary life. Ty Chandler is desperate to locate the child he fathered nineteen years ago—a child he never knew existed until now. Although he’s no stranger to heartache, he is irresistibly drawn to the exotic, vibrantly alluring P.I. Their search not only leads them to Ty’s troubled, strong-willed daughter, but into each others’ arms. Though Kat courageously works to help Ty reunite his family, she’s terrified of confronting a painful secret of her own—one that will cost her the love of the only man capable of tearing down the walls she’s built around her heart.From the tranquil beaches of the central California coast to the fast and furious streets of L.A.,Heat Wave is a passionate and heartfelt story of families divided and brought back together, the magic of hope for new beginnings, and the overwhelming power love has to heal even the most battered hearts.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Ritalin-Free Kids: Safe and Effective Homeopathic Medicine for ADD and Other Behavioral and Learning Problems",
        "Authors": "By Reichenberg-Ullman, Judyth and Ullman, Robert",
        "Description": "Now, at last, Ritalin-Free Kids offers a natural alternative to Ritalin and other harmful drugs such as Cylert and Dexedrine.The authors describe their experiences with more than 400 ADD patients whom they have treated. You will learn how lives have been dramatically changed and improved through the use of homeopathy. Before parents agree to give children stimulants, they should read this book.Ritalin-Free Kids answers these commonly asked questions about treatment:Does ADD really exist?How can I find a qualified homeopath in my area?How expensive is homeopathic treatment? Can homeopathy work for other learning and behavioral difficulties?",
        "Category": " Health & Fitness , Health Care Issues",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Gravesend Light: A Novel",
        "Authors": "By Payne, David",
        "Description": "Joe Madden, an intense young anthropologist, has retreated to his family's summer home on Little Roanoke on North Carolina's Outer Banks, an isolated village whose accents and social traditions date back to the time of Sir Walter Raleigh. He is conducting an ethnographic study on the lives of the fisher folk, so he signs on to the boat Father's Price, sharing the tough, timeless labors of the sea and entering a complicated, edgy friendship with ex-con Ray Bristow. He also begins a passionate love affair with Day Shaughnessy, a Yale-trained and fiercely feminist OB/GYN in residence on Little Roanoke, and increasingly at odds with prevailing local views on motherhood and abortion. Joe finds that his growing respect for the villagers' heritage of pride and sacrifice conflicts with Day's strongly voiced convictions - and then two pregnancies render the issues agonizingly concrete. Matters come to a climax during a murderous winter storm at sea, during which the fate of the Father's Price and its crew, Joe Madden included, hangs in precarious balance.",
        "Category": " Fiction , Literary",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Flesh and Bone: A Body Farm Novel",
        "Authors": "By Bass, Jefferson",
        "Description": "Dr. Bill Brockton, the founder of the world-famous Body Farm, is hard at work on a troubling new case. A young man's battered body has been found in nearby Chattanooga, and it's up to the talented Dr. Brockton to assemble the pieces of the forensic puzzle. Brockton is brought into the case by the rising star of the state's mechanical examiners, Jess Carter.Just as they're on the verge of breaking the case open, events take a terrifying turn. Brockton has re-created the Chattanooga death scene at the Body Farm, but a killer tampers with it in a shocking way: placing another corpse at the setting, confusing authorities and putting Brockton's career and life in jeopardy. Soon Brockton himself is accused of the horrific new crime, and the once-beloved professor becomes an outcast. As the net around him tightens, Brockton must use all of his forensic skills to prove his own innocence . . . before he ends up behind bars with some of the very killers he's helped to convict.Flesh and Bone is another roller-coaster ride into the world of forensic anthropology, its twists and turns marked by drama and pathos, humor and grief, families and friends and enemies. With captivatingly real characters, plus fascinating scientific insights drawn from the case files of a living forensic legend, this astonishing novel confirms Jefferson Bass as one of our most talented authors of suspense.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Who Does She Think She Is?: A Novel",
        "Authors": "By Little, Benilde",
        "Description": "From the beloved, bestselling author of Good Hair and The Itch comes a richly evocative multigenerational story of three powerful women.  Aisha Branch is getting married, and if she has her way, the wedding will be the event of the millennium. At twenty-six she is still the \"baby girl,\" the indulged only child of Camille and the only grandchild of Geneva. As the wedding draws closer, the Branch family is turned upside-down -- a $7,000 designer wedding dress? A fiance who's a \"white boy\"? But that turmoil is nothing compared to what happens when Aisha falls hard for another man.   All the excitement stirs up old feelings in the Branch women, and they reflect separately on their own lives and relationships, and the things they wish had turned out differently. Geneva, a seventy-year-old powerhouse who always strove for \"Negro respectability,\" has never approved of Camille's decisions -- single motherhood, a career in social work, dreadlocks. Aisha, the light of Camille and Geneva's lives, is a bright, beautiful, impulsive woman who is used to getting what she wants, even if she has to fight for it. Her real father's absence still looms large in her imagination, but her stepfather, who came into her life early on, has always treated her like a princess. Now Aisha has to choose between marrying her staggeringly wealthy fiance and pursuing an elusive older man. For her part, Camille grapples with watching her adored daughter live the kind of life she didn't dare to dream of, and is just a little bit resentful of Aisha's ignorance of how hard Camille worked to make it possible. As the drama of Aisha's love life unfolds, the three women take turns narrating their own stories in Little's most expansive novel yet.    Stylish and smart, Who Does She Think She Is? tackles difficult questions about close family ties -- relationships characterized by abiding love but often fraught with regret and resentment. With her signature dry wit, quietly resonant insight and sharp yet compassionate eye, Little deftly explores one family's expectations and anxieties against the frenzied backdrop of wedding planning. The result is a wise, funny and beautiful book about three generations of irrepressible women.",
        "Category": " Fiction , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Guilty",
        "Authors": "By Robards, Karen",
        "Description": "In the newest novel from New York Times-bestselling author Karen Robards, a feisty female attorney's past comes back to haunt her.  One cold November night when Kat White was fifteen years old, she and some friends held up a convenience store. In the heat of the moment, one of the others shot and killed an off-duty cop moonlighting as a security guard. Kat and her pals fled the scene in a panic, and no one was caught.  Sixteen years later, Kat-now Kate-has built a new life for herself. Now a single mom with an eight-year-old son, she works as a prosecutor in the Philadelphia DA's office. But her dark past rears its head when she walks into court one day and discovers that she is to prosecute Mario Castellanos, one of her friends from that terrible night.  Kate is in a bind: even though Mario was the one who probably did commit the crime, he's counting on Kate to make sure he's not convicted. If she convinces the judge of his guilt, he'll claim that she was the one who killed the off-duty cop. Before real despair sets in, Mario is found dead-in her apartment, and with her pistol. When homicide detective Tom Braga shows up to investigate the murder, Kate is far from relieved; the two have clashed since she started working for the prosecutor's office. But when another man who knows the secret of Kate's past gets involved in the investigation, she learns that her life-and her son's-are in danger. Frantic, she realizes that she has nowhere to turn. Except, maybe, to Tom . . .",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "An Armory of Swords",
        "Authors": "By Saberhagen, Fred (EDT)",
        "Description": "Fred Saberhagen has brought together a cast of some of the best fantasy writers in the field, to apply their talents to his Lost Swords universe. All have written tales that capture the enchanting spirit of the series, and the result is an irresistible collection that will delight both new and old books of Lost Swords fans alike.Forged by Vulcan with such magic and skill that even the Gods themselves are vulnerable to them, each weapon has its own special power, bestowed upon whoever unsheathes it. No longer are all humans mere playthings in the hands of the Gods.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Presidents (Eyewitness Books)",
        "Authors": "By Barber, James",
        "Description": "Produced in association with the Smithsonian Institution, an addition to a popular nonfiction series features detailed information on America's most influential political office and the men who have filled it.",
        "Category": " Juvenile Nonfiction , History , United States , General",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "The Perfect Tree and Favorite Christmas Carols (Through the Magic Window)",
        "Authors": "By Bivins, Thomas H. and Bivins, Christopher (ILT)",
        "Description": "Badger sets out to find the perfect Christmas tree but is reluctant to destroy the tree's beauty by cutting it down. Includes four traditional Christmas carols.",
        "Category": "",
        "Publisher": "Unicorn Pub House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "CliffsNotes on Dickens' A Tale of Two Cities (Cliffsnotes Literature Guides)",
        "Authors": "By Kalil, Marie",
        "Description": "The original CliffsNotes study guides offer expert commentary on major themes, plots, characters, literary devices, and historical background. The latest generation of titles in this series also feature glossaries and visual elements that complement the classic, familiar format.In CliffsNotes on A Tale of Two Cities, you experience one of Charles Dickens's most important works as he recounts the horrors of the French Revolution in what amounts to a cautionary tale warning of the possibility of revolution in 18th-century England. From its first line (\"It was the best of times, it was the worst of times\") to its last (\"It is a far, far better thing that I do, than I have ever done; it is a far, far better rest that I go to than I have ever known\"), Dickens's novel of revolution, sacrifice, and redemption continues to captivate modern imaginations.Chapter summaries and commentaries lead you through Dickens's \"Tale,\" and critical essays give you insight into the women of A Tale of Two Cities and the French Revolution. Other features that help you study includeCharacter analyses of the main charactersA character map that graphically illustrates the relationships among the charactersA section on the life and background of Charles DickensA review section that tests your knowledgeA Resource Center full of books, articles, films, and Internet sitesClassic literature or modern-day treasure'you'll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Literary Criticism , Reference",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "LET'S PEEK INTO SANTA'S SACK (Peek-A-Board Books)",
        "Authors": "By Leder, Dora",
        "Description": "Santa makes his rounds on Christmas Eve, distributing gifts, and almost gets caught by curious children in the last house on his list. Features die-cut board pages.",
        "Category": "",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Would You Rather Be a Bullfrog? (Bright & Early Books(R))",
        "Authors": "By Seuss, Dr. and McKie, Roy (ILT)",
        "Description": "Would you rather be a clarinet . . . a trombone . . . or a drum? (How would you like  to have someone going boom-boom on your tum?) Beginning readers are asked to ponder  these–and a host of other odd choices–in this charming, provocative book by Dr. Seuss  that encourages children to let their imaginations fly.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Oh, Say Can You Say?",
        "Authors": "By Seuss, Dr.",
        "Description": "Tongue twisters abound in this classic Dr. Seuss Beginner Book!  \"Bed Spreaders spread spreads on beds. Bread Spreaders spread butter on breads.  And that Bed Spreader better watch out how he's spreading . . . or that Bread Spreader's sure going to butter his bedding.\" This riotous collection weaves together a wonderment of words designed to twist the lips. Wordsmiths and beginning readers will love Oh Say Can You Say? and treasure tackling these tangled tongue teasers. Originally created by Dr. Seuss, Beginner Books encourage children to read all by themselves, with simple words and illustrations that give clues to their meaning.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1979"
        }
    },
    {
        "Title": "Coaching Soccer",
        "Authors": "By Schum, Tim (EDT) and National Soccer Coaches Association of America (COR)",
        "Description": "Fundamental skills, offensive and defensive strategy, team offense and defense, conditioning and motivational techniques--every conceivable aspect of the game is discussed in this official coaching handbook from the National Soccer Coaches Association of America. Never before has so much information by so many renowned soccer authorities been collected in one volume.   The National Soccer Coaches Association of America wa formed in 1941 and its mission today is the same one set forth by its founding members in New York: to promote the sport of soccer in the United States, while at the same time providing an educational environment for individuals at all levels of the game to improve their coaching skills. It is their belief that better coaching will improve the play of the sport in this country. The NSCAA membership has grown to more than 11,000 coaches nationwide, male and female, from the youth level to the collegiate ranks.",
        "Category": " Sports & Recreation , Soccer",
        "Publisher": "Masters Pr",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Marc Chagall Art for Children",
        "Authors": "By Raboff, Ernest",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Doubleday Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Dirt Bike Racer",
        "Authors": "By Christopher, Matt",
        "Description": "Is Ron's luck on the track about to run out? When Ron finds a dirt bike at the bottom of a lake, he can't believe his luck. But the bike needs fixing up and that takes money. When he takes a job doing yard work for a former dirt bike racer, he's convinced he's finally going to make his dream of racing come true. Little does he suspect that the job will lead him to the one person who can threaten his dream....",
        "Category": " Juvenile Fiction , Sports & Recreation , Extreme Sports",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Junie B. Jones and the Yucky Blucky Fruitcake (Junie B. Jones, No. 5)",
        "Authors": "By Brunkus, Denise (ILT) and Park, Barbara",
        "Description": "“Hilarious. Barbara Park makes reading fun.” —Dav Pilkey, author of Dog Man Barbara Park’s #1 New York Times bestselling chapter book series, Junie B. Jones, has been keeping kids laughing—and reading—for more than twenty-five years. Over 65 million copies sold!   Meet the World’s Funniest Kindergartner—Junie B. Jones! It’s Carnival Night, and Lucille has already won a box of fluffy cupcakes with sprinkles on them. But when Junie B. wins the Cake Walk, she chooses the bestest cake of all—the one wrapped in sparkly aluminum foil. How was she to know it was a lethal weapon?   USA Today: “Junie B. is the darling of the young-reader set.”   Publishers Weekly: “Park convinces beginning readers that Junie B.—and reading—are lots of fun.”    Kirkus Reviews: “Junie’s swarms of young fans will continue to delight in her unique take on the world. . . . A hilarious, first-rate read-aloud.”    Time: “Junie B. Jones is a feisty six-year-old with an endearing penchant for honesty.”",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Internet for Dummies (4th Edition)",
        "Authors": "By Levine, John R., Young, Margaret Levine, and Baroudi, Carol",
        "Description": "Covers hardware, software, servers, e-mail, search engines, resources for children, parental guidance, privacy, and safety",
        "Category": " Computers , Internet , General",
        "Publisher": "IDG Books Worldwide",
        "Price Starting With ($)": "5.61",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Junie B. Jones Loves Handsome Warren (Junie B. Jones, No. 7)",
        "Authors": "By Brunkus, Denise (ILT) and Park, Barbara",
        "Description": "Barbara Park’s New York Times bestselling chapter book series, Junie B. Jones, is a classroom favorite and has been keeping kids laughing—and reading—for more than twenty years. Over 60 million copies in print and now with a bright new look for a new generation!   Meet the World’s Funniest Kindergartner—Junie B. Jones! There’s a new boy in kindergarten, and guess what? He’s the handsomest guy Junie B. has ever seen. She and Lucille and that Grace all want him for a boyfriend. Only, he thinks Junie B. is a nutball. Just ’cause she couldn’t stop laughing and rolling. So how is she supposed to get that boy to love her?   USA Today: “Junie B. is the darling of the young-reader set.”   Publishers Weekly: “Park convinces beginning readers that Junie B.—and reading—are lots of fun.”    Kirkus Reviews: “Junie’s swarms of young fans will continue to delight in her unique take on the world. . . . A hilarious, first-rate read-aloud.”    Time: “Junie B. Jones is a feisty six-year-old with an endearing penchant for honesty.”",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Basic Statistics for the Health Sciences",
        "Authors": "By Kuzma, Jan W.",
        "Description": "Concepts, principles, and methods at an introductory level. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Mayfield Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "How to Write and Illustrate Children's Books and Get Them Published",
        "Authors": "By Bicknell, Treld Pelkey (EDT) and Trotman, Felicity (EDT)",
        "Description": "Explores the art of storytelling and the basics of writing for children, including classic fiction, contemporary themes, picture books, book production, fads, nonfiction, and careers as a children's writer or illustrator.",
        "Category": " Language Arts & Disciplines , Writing , General",
        "Publisher": "Writers Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Where Is Nicky's Valentine? (Lift-the-flap Books)",
        "Authors": "By Ziefert, Harriet and Brown, Richard Eric (ILT)",
        "Description": "Small children help Nicky search for a host of delightful Valentine surprises as they search behind the secret flaps",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Valentine's Day",
        "Publisher": "Puffin",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    }
]