[
    {
        "Title": "Feathering Your Nest: The Retirement Planner (The IDS Financial Library)",
        "Authors": "By Berger, Lisa",
        "Description": "Built around the one truism of retirement planning-the sooner the better--Feathering Your Nest is for anyone in their mid-thirties on up, proving them with accessible, realistic, and reassuring guidance for creating a nest egg.Written by a financial writer, the book offers simple exercises to map out a plan and set a dollar figure of what is needed. And then it shows how to grow wealth. Dozens of investment options are covered, while subsequent chapters cover the complexities of insurance, mortgages and reverse mortgages, health care, wills and trusts, and taxes.Did you know that if you take your $300,000 pension as a lump sum, the government will help itself to $93,000? Or that most retirees will need 60 to 80 percent of their pre-retirement income for a good 20 years after the last day on the job? Now you do--and Feathering Your Nest tells you what to do about it. 92,000 copies in print.",
        "Category": " Business & Economics , Personal Finance , Retirement Planning",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.54",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Process This!: New Recipes for the New Generation of Food Processors plus Dozens of Time-Saving Tips",
        "Authors": "By Anderson, Jean",
        "Description": "Compared to today's racy new food processors, early models seem positively antiquated. Among the cutting-edge innovations: mini bowl and blade inserts for standard models ... kinder, gentler dough modes that knead yeast doughs to perfection ... reversible blades, one side for grinding, one for chopping ... powerful braking actions that allow you to control the degree of chop ... sleek keypads that make clean-up a breeze.The new generation of food processors, so powerful, so versatile, needs a new deriver's manual, a cookbook to teach you how to use them to their best advantage. Process This! is that book.Award-winning cookbook author Jean Anderson has spent two years putting the new processors through their paces and developing recipes specifically for them. (Don't worry, they work in older machines too; in fact they'll make them perform better than ever.)Anderson has turned some 150 popular recipes upside-down, changing the order of mixing so that you can now prep almost anything by processor. Flaky piecrust? No problem. Patés, rustic or refined? A snap. Melt-in-your-mouth shortbread? You bet. Salsas and guacamole with plenty of texture? Sure thing. Asian stir-fries? Of course. Feathery cakes? Why not? Anderson has even turned the food processor into a bread machine, using it to do everything but shape and bake.Throughout Process This! you'll find dozens of time-saving tips and techniques. Why not mince parsley while you crumb bread? With meatloaves and casserole toppings so often calling for both, it makes sense. Why not processor-grate strips of lemon-zest? It's easy if you add a little sugar or salt. Chop onions and bell peppers in tandem? Whiz together all the dry ingredients for a cake or quick bread, then cut in the butter instead of creaming it separately? This is one-bowl mixing at its best.Process This! is much more than a cookbook, however. Its dictionary of foods teaches you how to slice, dice, chop, shred, and purée everything from apples to zucchini. There's even a handy table of equivalents to tell you exactly how many slices of bread you need for one cup of crumbs or how many onions it takes for one cup of coarsely chopped.The 150 recipes range from simple to sophisticated: Two-Pepper Parmesan Wafers ... Chicken Liver and Red Onion Jam Paté ... Instant Icy Avocado Soup ... Penne with Midsummer Tomato Sauce ... Crispy Parmesan-Crumbled Chicken ... Ossobucco ... Old-Timey Corn Custard ... Two Potato Gratin with Bacon and Leeks ... Cheddar Scones ... Focaccia ... Frozen Lemongrass-Mango Mousse ... Toasted Hazelnut Tart ... Rugelach.Whether you are a new cook, an experienced one, or even a professional, you will find Process This! as indispensable as your food processor.",
        "Category": " Cooking , Regional & Ethnic , General",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "How's the Squid?: A Book of Food Cartoons",
        "Authors": "By Ziegler, Jack",
        "Description": "A collection of 125 food-related cartoons by the New Yorker artist best known for his social satire and wordplay includes previously unpublished pieces and features such subjects as a fish psychiatrist who counsels a patient to quit the food chain and a culinary face-off between René Magritte and Betty Crocker. 35,000 first printing.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Got War?: A Doonesbury Book (Volume 23)",
        "Authors": "By Trudeau, G. B.",
        "Description": "\"Rear Admiral Steve Kunkle, commander of the carrier strike force, grimaced at a Doonesbury comic strip from the Japan Times. It showed a Navy pilot thinking 'Oops!'\" As Doonesbury shifts to a wartime footing, the strip's major players find themselves pre-positioned for the coming cakewalk. Weekend warrior B.D. leaves the Fighting Swooshes of Walden in the care of acting Coach Boopstein, returning to the sands of Kuwait as Camp Blowback's Public Affairs Officer. Among his charges: Roland Hedley, veteran of a grueling combat training program designed to keep media folk from getting capped. Offshore, the irrepressible Morale Officer Lieutenant. Tripler goes live (\"Good MORNING, regime-changers!\") to lift the shipbound spirits of his pre-swarthy charges, while offstage, Viceroy-in-Waiting Duke prepares to answer empire's call. Stateside, Mike takes up a flanking position on the sofa to log some serious CNN time, while the Reverend Sloan girds his loins for peace: \"Look for us on TV-we'll be a million strong.\" Marching to the beat of a different cause, Zonker's old surfing mentor tries to enlist Z in a desperate fight to liberate Left Coastal access. Protests Zonk, \"What can I do? I am but one dude!\" Meanwhile, Jeff Redfern is but one CIA intern, yet he manages to launch a Predator drone and, using basic Nintendo training, knock out an Al-Q ammo dump. Also taking a hit, Trent Lott, busted for giving props to segregation. \"I was trying to say I was down with the hood!\" he backpedals, realizing too late that Mr. James Crow has finally left the house.With Alex declaring eco-jihad on SUVs, and Elmont launching a daily assault on coherence as on-line blogger \"Jenny McTagart, Girl Pirate,\" it's hard to see a peaceful world ahead. But Jimmy Thudpucker can. Waging war on the recording industry, he and other filesharers have a vision of ultimate change de regime: \"The suits die off, and Pepperland will be free again.\"",
        "Category": " Humor , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Nest for Two: Creating a Harmonious Home",
        "Authors": "By Serrell, Allison and Gowdy, Thayer Allyson",
        "Description": "She loves her antiques. He's a modern minimalist. Bringing the best of both worlds together is a labor of love made easier with a little expert guidance. Nest for Two celebrates the shared dwelling with 225 inspiring color photographs showcasing the cozy corners, romantic details, and practical solutions that help couples savor the pleasures of home life together. From the living room to the bedroom, the homes in Nest for Two present hundreds of ingenious ideas for sharing space and uniting two personal styles in ways that are both comfortable for the inhabitants and welcoming to family and friends. From mingling disparate collections of art and ephemera in the living room, to organizing kitchen work areas to make room for two, the advice in Nest for Two spans a variety of sensible topics. The environments are at once down to earth and exceptional, with practical tips ranging from how to share closet space to how to serve the very best breakfasts in bed. A joyful primer for settling into a sublime shared space, Nest for Two is rich with ideas for creating a well-organized, beautiful setting where everyone feels at home.",
        "Category": " House & Home , Decorating",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Yakov and the Seven Thieves",
        "Authors": "By Madonna and Spirin, Gennadii (ILT)",
        "Description": "Yakov, the kindly cobbler, and his wife, Olga, are heartbroken because their son, Mikhail, is very ill. They seek advice from a wise old man, who enlists the help of seven thieves and proves that miracles can occur if we do good deeds.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Callaway Editions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Sincerely, Andy Rooney",
        "Authors": "By Rooney, Andrew A.",
        "Description": "Andy Rooney's weekly commentaries on 60 Minutes and his twice-weekly syndicated newspaper columns-addressing everything from deceptive cereal packaging to the existence of God-have made him America's best-known critic of the quotidian. As you might imagine, he gets a lot of letters in response to his often iconoclastic views. As you might not expect, he writes a lot of letters, too.   Now Rooney has collected the funniest, wisest, and most interesting of his letters, spanning several decades and addressing issues both momentous and trivial. He responds to complaints from viewers; he corresponds with old friends; and he writes to his children about the things he cares about most. Variously caustic, hilarious, and sage, these unfailingly entertaining letters reveal not only Rooney the iconoclast but Rooney the American Everyman. Sincerely, Andy Rooney is Andy Rooney at his best-and a wonderful gift book that will make readers chuckle and think twice.",
        "Category": " Social Science , Media Studies",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "The Best Man's Handbook",
        "Authors": "By Grace, James",
        "Description": "The wedding book market is a crowded one, but it focuses largely on the needs of the bride. This fun, practical, and informative guide details the duties, etiquette, and potential pitfalls of being a best man, from the pre-ceremony events to the after-hours party. It's the most comprehensive book on the subject, with wisdom culled from many sources, full of essential tips for everything from planning the bachelor party to making the toast. The elegant trim size makes it a perfect gift for the best man-to-be, but this is more than simply a gift book-it's a valuable tool for an important day.",
        "Category": " Reference , Weddings",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The Family Treasury of Classic Christmas Carols",
        "Authors": "By Gibb, Sarah (ILT) and Gibb, Sarah (EDT)",
        "Description": "Sure to become a cherished pary of any family's library, our handsome treasury of classic carols features noted artist Sarah Gibb's lyrical yuletide illustrations and includes all the words to 19 favorite songs of the season.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Running Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Catullus: A Poet in the Rome of Julius Caesar",
        "Authors": "By Burd, Aubrey",
        "Description": "Surveying the times in which the extraordinarily popular poet Catullus thrived?ca. 84?54 B.C., the golden days of the Roman Republic?Aubrey Burl reconstructs the life of a man who epitomized an era. Catullus demonstrated a genius for the epigram, as well as the lyric, for heartfelt love songs and moving elegies. Nor did Catullus leave himself out of his pungent, spare, ironic, and superbly crafted verses, reflecting not only his personal temperament but also his perceived values, and often disparages, in a Rome increasingly beset by civil war, moral laxity, and social unrest. This book takes Catullus from his native Verona, where he grew up in wealth and influence, to Rome and to fame. A well-liked, sociable man, he entertained his friends in the lavish fashion of his day while he amused and shocked his public with urbane poetic trifles. He intrigued his public with love poems addressed to Lesbia?in reality, a married woman named Clodia?with whom he had a tempestuous affair. Though brilliant by any standard, these intimate lyrics would not save Catullus from centuries of obscurity, although they would eventually emerge in a lone third generation copy of a book in the fourteenth century, in his hometown of Verona.",
        "Category": " Literary Criticism , Ancient & Classical",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Graveyard Position: A Novel of Suspense",
        "Authors": "By Barnard, Robert",
        "Description": "From master of mystery Robert Barnard comes a brilliantly witty and piercingly observant new suspense novel featuring one of the most dysfunctional families ever to grace crime fiction.  Meet the Cantelos of Leeds, England. To call the Cantelos dysfunctional is actually a wild understatement. But is one of them also a killer?  Clarissa Cantelo, a skilled clairvoyant, apparently thought so. Believing that her sixteen-year-old nephew, Merlyn Docherty, was in peril, she sent him into hiding in Italy, far away from the rest of her family. She told them he was dead. It was safer that way.  Now Clarissa herself has died, and Merlyn, a successful lawyer and civil servant who still lives abroad, has returned to Leeds to claim his inheritance. First, he must prove his identity. Is he really Merlyn or, as some of his long-lost relations say they suspect, is he an imposter?  Merlyn doesn't mind confirming his identity, but he'd at least like to move into the house that Aunt Clarissa left him in her will while he gets to know some of his relatives. And the house may hold some clues to the Cantelos' past.  What is the dreadful family secret that has upset relations between mothers and daughters, husbands and wives, filling even the youngest generation with fear? If Merlyn discovers the truth, buried under decades of deception, his life may once again be in danger.  Merlyn must start at the beginning if he is to find the answers. All roads seem to lead back to his grandfather, the formidable Merlyn Cantelo, renowned in the family as an object of both fear and loathing.  Though the old man who caused such pain to his family died years ago, his malevolence lives on. Somebody wants young Merlyn gone. With help from police detectives Mike Oddie and Charlie Peace, Merlyn must find that person before the Cantelo curse works its evil again.  Wickedly observant and full of his trademark sly twists, The Graveyard Position proves once more that Robert Barnard is in a class of his own.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Seek My Face",
        "Authors": "By Updike, John",
        "Description": "John Updike’s twentieth novel, like his first, The Poorhouse Fair (1959), takes place in one day, a day that contains much conversation and some rain. The seventy-eight-year-old painter Hope Chafetz, who in the course of her eventful life has been Hope Ouderkirk, Hope McCoy, and Hope Holloway, answers questions put to her by a New York interviewer named Kathryn, and recapitulates, through the story of her own career, the triumphant, poignant saga of postwar American art. In the evolving relation between the two women, the interviewer and interviewee move in and out of the roles of daughter and mother, therapist and patient, predator and prey, supplicant and idol. The scene is central Vermont; the time is the early spring of 2001.",
        "Category": " Fiction , Literary",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Miller's: International Antiques: Price Guide 2001 (Miller's Intrnational Antiques Price Guide, 2000)",
        "Authors": "By Miller, Judith (EDT) and Norfolk, Elizabeth (EDT)",
        "Description": "",
        "Category": " Antiques & Collectibles , General",
        "Publisher": "Mitchell Beazley",
        "Price Starting With ($)": "8.48",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Islands of the South and Southeastern United States",
        "Authors": "By Wright, Sarah Bird",
        "Description": "Describes the location, size, access, history, and points of interest on islands off the Southeastern U.S. coast from Maryland to Louisiana",
        "Category": " Travel , United States , South , General",
        "Publisher": "Peachtree Pub Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Rockville Pike: A Suburban Comedy of Manners",
        "Authors": "By Coll, Susan",
        "Description": "Jane Kramer never imagined a life selling discount  furniture and commuting between grocery stores and soccer fields via minivan. But when her father-in-law has a heart attack, she and her husband, Leon, trade in their glamorous New York life for a stint running the family business on Rockville Pike, a tributary of the suburban sprawl line extending outward from Washington, D.C. Kramer's Discount Furniture Depot sits away from several lanes of traffic, near the tombstone of Zelda and F. Scott Fitzgerald. It is here that Jane escapes each day at lunchtime to ponder her confusing turn in life.  At age forty-one, she has a teenage Goth son, her husband is increasingly overweight and quick-tempered, and their business is in a state of crisis, both financially and legally. Jane finds herself wishing for something more. First, add to the mix Delia, a mysterious and strangely predatory patio-furniture saleswoman who seems to have her sights set on Leon, and then an attack on the store expansion plans by historic preservationists. When potentially disturbing findings about Delia's past come to light, Jane finds herself learning that, despite life's reversals, it is possible to reinvent herself by tapping into talents and desires she didn't realize she still had.  Rockville Pike is a smart, witty, and funny read that revels in the joy of discovering what life has in store.",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "The Panic Attack, Anxiety and Phobia Solutions Handbook",
        "Authors": "By MacFarlane, Muriel K.",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "United Research Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Moyers on America: A Journalist and His Times",
        "Authors": "By Moyer, Bill and Pycior, Julie Leininger (EDT)",
        "Description": "Over the years millions of Americans have invited Bill Moyers into their homes. His television programs—covering topics ranging from American history, politics, and religion to the role of media and the world of ideas—have made him one of America’s most recognized and honored journalists. In these pages, Moyers presents, for the first time, a powerful statement of his own personal beliefs—political and moral. Combining illuminating forays into American history with candid comments on today’s politics, Moyers delivers perceptive and trenchant insights into the American experience.From his early years as a Texas journalist to his role as one of the organizers of the Peace Corps, top assistant to President Lyndon Johnson, publisher of Newsday, senior correspondent and analyst for CBS News, and producer of many of public television’s groundbreaking series, Moyers has been actively engaged in some of the most volatile episodes of the past fifty years. Drawing from this practical experience, he demonstrates a unique understanding of how American politics works and an enduring faith in the nation’s promises and possibilities. Whether reflecting on today’s climate of megamedia concentration, rampant corporate scandals, or religious and political upheavals, Moyers on America recovers the hopes of the past to establish their relevance for the present.",
        "Category": " Political Science , General",
        "Publisher": "The New Press",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "On Seas of Glory: Heroic Men, Great Ships, and Epic Battles of the American Navy",
        "Authors": "By Lehman, John F.",
        "Description": "In On Seas of Glory, the U.S. Navy meets a storyteller worthy of its noble history. Former Secretary of the Navy John Lehman gives a sweeping narrative of the service's illustrious past, from the Revolutionary War to the present day, filled with the ships that dominated the seas, equally titanic personalities, and the battles that made history.  Lehman profiles naval greats from John Paul Jones to William \"Bull\" Halsey, as well as the lesser-known sailors who have made the U.S. Navy the mightiest in the world, using diaries, memoirs, and letters to reveal naval combat as though firsthand. He also highlights the warships that have dominated the seas of their day and the battles in which they fought -- illustrated by detailed maps, woodcuts, paintings, and never-before-published photographs.  With this chronicle of selfless sacrifice and awesome courage on the war-swept seas around the world, Lehman reminds us that the legends chronicled in these pages were real men and women, that the navy they fought for still sails, and that today their heroism is needed more than ever.",
        "Category": " History , Military , United States",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Private Altars",
        "Authors": "By Mosby, Katherine",
        "Description": "Arriving in Winsville with a firm grasp of the classics, four steamer trunks of books, a bust of Quintilian, and shoes and gloves for different times of day, Vienna Daniels creates a stir in a town uncomfortable with difference. \"She's not crazy, she's just educated,\" Dr. Barstow pronounces to Vienna's husband, Willard, who is plainly disappointed with the patrician bride he managed to marry. When the marriage fails and Willard abandons her, Vienna and her two children have nothing more than the magic of their own imaginations to parlay an accidental and unenviable situation into one that captivated the town.Private Altars is a compelling story about the nature of consequence - the way in which meaningless acts lead to irreversible situations, and the difficult compromise between the demands of society and the desires of the individual. Trapped in the wrong place and time, Vienna Daniels' attempt to transcend her circumstance unfolds into a haunting and unforgettable story.",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "American Handbook of Psychiatry - Vol. 1",
        "Authors": "By Arieti, Silvano",
        "Description": "",
        "Category": "",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "31.14",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "Creating a Charmed Life: Sensible, Spiritual Secrets Every Busy Woman Should Know",
        "Authors": "By Moran, Victoria",
        "Description": "How Does She Do It? We all know-and envy-women who appear to live \"charmed\" lives. They seem to unhurriedly and effortlessly manage the whirlwind of their busy lives with grace and poise. Good things happen to them, and their lives are filled with serendipity, joy, and prosperity. But it&#39;s not a matter of luck, according to Victoria Moran; a charmed life isn&#39;t something that happens to you-it&#39;s something you  create!  In Creating a Charmed Life, Victoria Moran unveils practical, spiritual secrets for expanding your capacity to love, know, and experience a fuller, richer life. Her insight, humor, and unassailable wisdom shine through each page to illuminate the magic in all our lives.Relish the calmCreate miraclesNurture your dreamsSavor simplicityInvite adventureNourish your spirit",
        "Category": " Religion , Spirituality",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "A Delicate Balance",
        "Authors": "By Edward Albee",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Live Like You Were Dying: A Story About Living",
        "Authors": "By Morris, Michael and McGraw, Tim (FRW)",
        "Description": "Live Like You Were Dying is the unforgettable story inspired by Tim McGraw's #1 Country Music song of the same name.  It weaves a tale of the miracles that happen once you stop being so busy with life that you actually have time to live it.Millions have embraced the song's lyrics.  Now experience the inspirational story that will touch your heart and soul.",
        "Category": " Fiction , Religious",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Christy- Christmastime at Cutter Gap",
        "Authors": "By Farnsworth, Bill (ILT) and Lesourd, Nancy",
        "Description": "The beloved characters and setting of the Christy books by Catherine Marshall are the basis of this illustrated story of Christmas love for children ages 4-8Ruby Mae, one of the students in Cutter Gap, brags that she’s spending Christmas with her father. The truth is that her father left her at the mission shortly after her mother died. Ruby Mae goes to the deserted family cabin where she tries to exist until Christmas is over rather than admit her father does not care enough to be there for her. While searching for firewood, she trips and bangs her head and falls unconscious into the snow. A concerned Christy goes on horseback to check on Ruby Mae and finds her wounded and bleeding. Christy manages to get Ruby Mae onto the horse and takes her to the nearby Spencer cabin. Not knowing his daughter is there, Ruby’s father shows up to greet the Spencers, just as Ruby Mae is coming around. He gives her a special gift to remember both this Christmas and her mother and promises to be a better father to her.This lovely story of renewal of relationships assures young children of how much God cares for all his children, and shows them the true meaning of Christmas.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Zonderkidz",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Getting Ready for the Guy-Girl Thing: Two Ex-Teen Reveal the Shocking Truth About God's Plan for Success With the Opposite Sex!",
        "Authors": "By Johnson, Greg and Shellenberger",
        "Description": "Gives advice on various aspects of dating from a Christian perspective.",
        "Category": " Social Science , General",
        "Publisher": "Regal Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Weekly Reader Children's Book Club presents Wapootin",
        "Authors": "By Annixter, Jane",
        "Description": "Follows the experiences of a young moose growing up in Alaska.",
        "Category": "",
        "Publisher": "Coward, McCann & Geoghegan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "My Racing Heart: The Passionate World of Thoroughbreds and the Track",
        "Authors": "By Mooney, Nan",
        "Description": "When Nan Mooney was seven years old, she sat down in her grandmother May-May's living room to watch her first ever horse race. In that single afternoon, she launched what would become a turbulent romance between a woman and a sport.My Racing Heart is part memoir, part journey into the compelling world of Thoroughbred horse racing. At its heart is Nan's relationship with her grandmother, an adventurer, racing connoisseur, and woman of courage and compassion. May-May fostered in Nan a love of Thoroughbreds and the track, ushering her into a rare corner of the world where risk taking is daily currency.Nan thought her emotional link to the races died with May-May, only to have it roar back to life a decade later at New York's Belmont Park. This renewed relationship culminates in a grown-up appreciation for a universe where expectations are constantly defied, and in the realization of a longtime dream -- a trip to the Kentucky Derby.Far more than just a personal tale, My Racing Heart lets readers in on the wild culture and fabulous creatures that rise up around the racetrack. Nan Mooney probes every aspect of the sport: the horses, jockeys, and trainers, the gambling and corruption, its ages-old history, and its forever offbeat society. She takes readers from the backstretch of a small-town track to the stands at Churchill Downs, from the mind of an intrepid gambler to the soul of a Thoroughbred. She explores how the sport itself, and the men and women who participate in it, flourish upon the principle that there are no sure things.My Racing Heart will speak to every horse lover, to every sports nut, and to everyone who cherishes the thrill of possibility or has ever craved a place to run wild. This unique and exquisite memoir perfectly captures the lure, the glory, and the heartbeat of the track.",
        "Category": " Sports & Recreation , Horse Racing",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Thinking About Women: Sociological Perspectives on Sex and Gender",
        "Authors": "By Andersen, Margaret L.",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "More Five-Minute Mysteries: 34 New Cases oif Murder & Mahem to Solve",
        "Authors": "By Weber, Ken",
        "Description": "Updated covers revitalize the first two titles in our extremely popular Five-Minute Mysteries series by Ken Weber, the master of the succinct whodunit. This attractive new series look is sure to appeal to young adults, introducing them to the lifelong literary pleasures of mystery novels. Each book contains more than 30 baffling cases, each with an ingenious solution guaranteed to challenge and entertain. Best of all, every mystery is short and sweet?easy to read in less time than it takes to microwave popcorn!",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Million Dollar Baby: Stories from the Corner",
        "Authors": "By Toole, F. X.",
        "Description": "This hard-hitting collection of powerful and moving tales based on the experiences of the late, great fight manager and cut man Jerry Boyd, who wrote under the pen name F.X. Toole, is the basis for the Oscar-winning motion picture starring Hilary Swank and Morgan Freeman. Breathing life into vivid, compelling characters who radiate the fierce intensity of the worlds they inhabit, Million Dollar Baby \"is not just fight fiction at its finest, it is excellent fiction, period\" (Dan Rather).",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "EccoPress",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Corduroy Goes to the Doctor (lg format)",
        "Authors": "By Freeman, Don and McCue, Lisa (ILT)",
        "Description": "Join this classic bear on his trip to the doctor. The youngest fans of Corduroy, one of the best-loved children's book characters for the past fifty years, will delight in these simple, sturdy board books-now available in a larger size with an updated, modern look.  In Corduroy Goes to the Doctor, Corduroy gets a check-up.",
        "Category": " Juvenile Fiction , Health & Daily Living , General",
        "Publisher": "Viking Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Second Angel",
        "Authors": "By Kerr, Philip",
        "Description": "A dark, dystopian high-velocity thriller in the cult-classic tradition of Kerr's A Philosophical Investigation. July 2069: centennial of the Apollo 11 moon walk. What would Buzz Aldrin see if he were here? On Earth, plagues have destroyed the major food supplies, climatic changes have brought constant winter to the once-industrialized West, and a new and virulent virus--P2--has infected Earth's population, bringing radical change in economic, political, and social structures. P2 is curable--but only with an infusion of uninfected blood. Indeed, blood has become the currency of choice: It is banked, speculated in, traded, hoarded, but only by those wealthy enough (or healthy enough) to have a clean, uninfected supply. And the moon? It is now home to sex hotels and penal colonies. Home, too, to the \"federal reserve\" of blood banks--the most impregnable high-security installation in the world. It is the brainchild of one man--and he has every reason to destroy it. Acting on the most human of motives--revenge--he will take on the impossible. Unbeknownst to him, he will have help from a very strange source. Call it 2001 updated. Call it a chillingly convincing mix of prophecy and science. Call it Philip Kerr's best book yet. The Second Angel: 1999's prologue to 2069, a terrifying forecast of the future.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Henry Holt and Co.",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Complete Guide to Home Masonry: Step-by-Step Projects & Repairs Using Concrete, Brick, Block & Stone (Black & Decker Home Improvement Library)",
        "Authors": "By Creative Publishing International (EDT)",
        "Description": "The Complete Guide to Home Masonry is the most comprehensive and useful guide to masonry for today's do-it-yourself homeowner. It even includes natural stone -- a material absent from many competitive titles. This book is the only resource on the market that provides clear step-by-step instructions and color photographs for building with the types of masonry materials that are in demand today, including stone veneer, glass block, concrete block, poured concrete, stucco, and brick.Readers will discover that The Complete Guide to Home Masonry offers many of today's most popular masonry projects, including sidewalks, patios, driveways, barbecues, steps and retaining walls, as well as stunning projects you won't find anywhere else, such as circular stone windows, brick pillars, arches and a veneer stone wall.",
        "Category": " House & Home , General",
        "Publisher": "Creative Pub Intl",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Decolonization in Britain and France: The Domestic Consequences of International Relations (Princeton Legacy Library, 2782)",
        "Authors": "By Kahler, Miles",
        "Description": "Professor Kahler focuses on organizations below the state, investigating party competition and sensitivity to political change produced by the characteristics of commercial firms. In addition, he explores transmission of external shocks to the domestic polity by the state itself and the domestic politics of settler societies under external threat.Originally published in 1984.The Princeton Legacy Library uses the latest print-on-demand technology to again make available previously out-of-print books from the distinguished backlist of Princeton University Press. These editions preserve the original texts of these important books while presenting them in durable paperback and hardcover editions. The goal of the Princeton Legacy Library is to vastly increase access to the rich scholarly heritage found in the thousands of books published by Princeton University Press since its founding in 1905.",
        "Category": " History , Europe , Great Britain",
        "Publisher": "Princeton University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1984"
        }
    },
    {
        "Title": "The Last Self Help Book You'll Ever Need: Repress Your Anger, Think Negatively, Be a Good Blamer, & Throttle Your Inner Child",
        "Authors": "By Pearsall, Paul",
        "Description": "?You can’t love someone until you learn to love yourself.” ?Being healthy means being in touch with your feelings.” ?Never lose hope.\" These are self-evident truths, right?Wrong charges best-selling psychologist Paul Pearsall in this provocative new book. Though everyone from talk show hosts to politicians mouths these platitudes, and self-help bibles are a dime a dozen, their advice simply hasn’t helped us live happier or more satisfying lives. Pearsall cites scientific evidence to challenge what he calls the McMorals of self-potentialism: the unsubstantiated prescriptions, programs, guarantees, and gurus that define our pursuit of The Good Life.His message is timely: we’re fed up with truisms masquerading as truth, and hungry for self-help that really helps. Filled with groundbreaking research and inspiring true stories from Dr. Pearsall’s clinical practice, The Last Self-Help Book You’ll Ever Need offers a powerful antidote to the mindless mental languishing that characterizes so much of modern life.The solution is not just to ?get tough and suck it up.” Instead, Pearsall offers powerful if counterintuitive strategies. By abandoning the mandate to ?stay hopeful,” for example, we can begin to savor today rather than focus desperately on tomorrow. By allowing ourselves the natural process of grieving instead of relentlessly treating grief as a disease, we can recover from tragedy.With Pearsall’s lively and informative roadmap to psychological health, we can say ?goodbye” to our inner child and ?hello” to a better life.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Dragon: Hound of Honor",
        "Authors": "By Hamilton, Emma Walton and Edwards, Julie",
        "Description": "In the noble and dangerous times of medieval France, the young knight Aubrey de Montdidier, nephew of the Count of Montargis, has been strangely murdered. His friend the brave Sieur DeNarsac, captain of the count's men-at-arms, and Thierry, a young page, must now solve the tragic mystery. Yet it is a magnificent white wolfhound by the name of Dragon -- Montdidier's faithful companion -- who brings an unexpected, shocking conclusion to the puzzle of his master's untimely death.   New York Times best-selling authors Julie Andrews Edwards and Emma Walton Hamilton weave a tapestry of intrigue, power, loyalty, and friendship in this novel based on the captivating French legend of Montargis.",
        "Category": " Juvenile Fiction , Historical , Medieval",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Walkin' the Line: A Journey from Past to Present Along the Mason-Dixon",
        "Authors": "By Ecenbarger, William",
        "Description": "Ecenbarger walks that Line created between 1763 and 1768 to settle a dispute between the Penns of Pennsylvania and Lord Calvert, whose family owned what is now Maryland. Most of the author's sources are text-based, but he does chat with or interview people on his journeys, providing a kind of up-to-the-moment history of that fine line between North and South, between non-slave and slave-owning states. As the Pulitzer-Prize winning author walks, he describes what he sees, incorporates it into his research, and often quotes a local source. For example: \"In some churches they would have a piece of wood hanging from the ceiling that was a certain shade of brown. If you were that shade or lighter, you could go in. But if you were darker, you couldn't worship there.\" No index, notes, or bibliography. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " History , United States , General",
        "Publisher": "M. Evans & Company",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Even More Five-Minute Mysteries: 40 New Cases Of Murder And Mayhem For You To Solve",
        "Authors": "By Weber, Ken",
        "Description": "",
        "Category": "",
        "Publisher": "Running Press Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Princess Lessons (A Princess Diaries Book)",
        "Authors": "By Cabot, Meg and McLaren, Chesley (ILT)",
        "Description": "All you  need to know to be a princess—OrJust live like oneCompiled byMia ThermopolisakaPrincessAmeliaMignonetteGrimaldiThermopolisRenaldoof Genovia",
        "Category": " Young Adult Fiction , Royalty",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Reproduction And Environment (Norton Library,)",
        "Authors": "By Holmes, R. L.",
        "Description": "",
        "Category": " Science , Life Sciences , Zoology , General",
        "Publisher": "W. W. Norton and Company, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1971"
        }
    },
    {
        "Title": "Confessions of a Slacker Wife",
        "Authors": "By Mead-Ferro, Muffy",
        "Description": "?I often thought to myself, ?If I really want to compete with these guys, I need a wife,’” begins Muffy Mead-Ferro in this ode to the women everywhere who are trying to take care of husbands, children, houses, jobs, bosses, clients, customers?and, oh yes, themselves! In lieu of that much-needed wife of her own, Mead-Ferro finds solace, sanity, and even success by embracing her famous tendency toward slackerdom. Full of personal anecdotes and real-wife wisdom, her latest Confessions offers precious comic relief and an invitation for wives everywhere to join the ranks!A slacker wife has the wisdom to accept the following: that a little dirt on her kitchen floor doesn’t hurt anyone, that wrinkles on her husband’s shirt and on her face are perfectly natural and not worth worrying about, that party guests can be just as happy with a bowl of chips as an elaborate salmon mousse, and that over-scheduled equals under-happy. Above all, a slacker wife lets herself have fun being a wife. She has girls’ weekends, orders take-out, and takes leisurely walks. And as a result, she, her husband, and her family are happier and healthier?even with a dirty kitchen floor and a wrinkled shirt.",
        "Category": " Social Science , Anthropology , Cultural & Social",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Secrets of the Code: The Unauthorized Guide to the Mysteries Behind the Davinci Code",
        "Authors": "By Burstein, Daniel (EDT)",
        "Description": "Secrets of the Code, a five-month New York Times bestseller, is a sweeping tour, guided by renowned experts, through the many provocative ideas raised in The Da Vinci Code. With excerpts from many original works, all-new material, and interviews with prominent scholars exploring the novel’s underlying themes, Secrets of the Code will satisfy your curiosity, engage your imagination, and provide you with insights to better understand the historical and religious issues of the novel.",
        "Category": " Literary Criticism , General",
        "Publisher": "Vanguard Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Cronies: How Texas Business Became American Policy-- and Brought Bush to Power",
        "Authors": "By Bryce, Robert",
        "Description": "No other province holds more political and economic power than the Lone Star State. Two of the last three American presidents—and three of the last eight—have been Texans. Each of them got to the White House by exploiting a network of money and power that no other state can match. In Cronies, renowned investigative reporter Robert Bryce illuminates how Texas turned its vast energy resources into political power, and how a small group of Texas corporations, lawyers and politicians use that power to protect and defend their own economic interests. Through an absorbing narrative that moves from the days of the oil boom, through the rise and reign of LBJ, to today, Bryce profiles the Texans and the Texas corporations who have wielded—and continue to wield—great power in America's domestic and foreign policy, including the Bushes, James A. Baker III, Halliburton, Baker Botts, Ray Hunt, Bell Helicopter, and more. He shows how massive transfers of wealth from the rest of the country to Texas have allowed the state to prosper. Cronies demonstrates how George W. Bush is the living embodiment of Texas' crony networks, and how those networks continue to play critical roles in the 21st century. Distinguished by the same crack investigative skills and colorful storytelling that reviewers loved in Pipe Dreams, Cronies not only explains the astonishing rise of Texas; it offers a timely, provocative new way to look at American politics and our deadly entanglements in Iraq.",
        "Category": " Political Science , Public Policy , City Planning & Urban Development",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "The Resilient Self: How Survivors of Troubled Families Rise Above Adversity",
        "Authors": "By Wolin, Stephen J., M.D. and Wolin, Sybil, Ph.D.",
        "Description": "A guide to self-empowerment designed to help adult children of dysfunctional families free themselves from the past discusses characteristics that allow individuals to cope with trauma and forge a healthy life and explains how to develop such traits. 25,000 first printing.",
        "Category": " Psychology , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "The Swordbearers: Supreme Command in the First World War (Midland Books: No. 1)",
        "Authors": "By Barnett, Correlli",
        "Description": "Interprets the major events of World War I through an analysis of the actions and characters of four supreme commanders, Ludendorff, Petain, Jellicoe, and Moltke",
        "Category": " History , Military , World War I",
        "Publisher": "Indiana University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1975"
        }
    },
    {
        "Title": "The Essential Guide to Gardening Techniques",
        "Authors": "By Berry, Susan",
        "Description": "",
        "Category": " Gardening , Techniques",
        "Publisher": "Thunder Bay Pr",
        "Price Starting With ($)": "8.01",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Behind the Scenes at the Museum: A Novel, Packaging May Vary",
        "Authors": "By Atkinson, Kate",
        "Description": "A deeply moving family story of happiness and heartbreak, Behind the Scenes at the Museum is bestselling author Kate Atkinson's award-winning literary debut.  National BestsellerWinner of the Whitbread Book of the YearRuby Lennox begins narrating her life at the moment of conception, and from there takes us on a whirlwind tour of the twentieth century as seen through the eyes of an English girl determined to learn about her family and its secrets.  Kate Atkinson's first novel is \"a multigenerational tale of a spectacularly dysfunctional Yorkshire family and one of the funniest works of fiction to come out of Britain in years\" (The New York Times Book Review).",
        "Category": " Fiction , Sagas",
        "Publisher": "Picador USA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Grandchildren Are So Much Fun, I Should Have Had Them First",
        "Authors": "By Wyse, Lois and Rogers, Lilla (ILT)",
        "Description": "A humorous look at grandmotherhood extols the joys of grandchildren, presenting funny and inspiring anecdotes. By the author of You Don't Look Like a Grandmother and Kid, You Sing My Songs. 75,000 first printing.",
        "Category": " Family & Relationships , Parenting , Grandparenting",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Crashing the Party: Taking on the Corporate Government in an Age of Surrender",
        "Authors": "By Nader, Ralph",
        "Description": "Ralph Nader is one of America's most passionate and effective social critics. He has been called a muckraker, a consumer crusader, and America's public defender. The cars we drive, the food we eat, the water we drink-their safety has been enhanced largely due to Ralph Nader. His inspiration and example have rallied consumer advocates, citizen activists, public interest lawyers, and government officials into action, and in the 2000 election, nearly three million people voted for him.An inspiring and defiant memoir, Crashing the Party takes us inside Nader's campaign and explains what it took to fight the two-party juggernaut; why Bush and Gore were really afraid to let him in on their debates; why progressive Democrats have been left behind and ignored by their party; how Democrat and Republican interests have been lost to corporate bankrolling; and what needs to happen in the future for people to take back their political system.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Shrek",
        "Authors": "By Evanier, Mark, Bachs, Ramon F. (ILT), and Fernandez, Raul (ILT)",
        "Description": "The world's most loveable ogre is back this time in comics!  Join Shrek, Donkey, and the gang as they embark on several hilarious madcap adventures including a madcap chase to rescue Fiona from Farquaad's henchmen Thelonius on the evening of her honeymoon and an encounter with a gingerbread house gone rancid and its witchy owner! Written by master scribe Mark Evanier (Groo) and illustrated by Ramon Bachs and Raul Fernandez (Star Wars).",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "DARK HORSE",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Military and the Media: Facing the Future",
        "Authors": "By Ethiel, Nancy, Ed.",
        "Description": "",
        "Category": "",
        "Publisher": "Robert R. McCormick Tribune Fiundation",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "101 Puzzles in Thought and Logic (Dover Recreational Math)",
        "Authors": "By Wylie, C. R.",
        "Description": "Do you like puzzles based on logic and reasoning? Try this one:In a certain bank the position of cashier, manager, and teller are held by Brown, Jones, and Smith, though not necessarily in that order. The teller, who was an only child, earns the least. Smith, who married Brown's sister, earns more than the manager. What position does each man fill?If you like to entertain yourself and stretch mental muscles on problems like this or more difficult ones, here are 101 entirely new problems for which you need no special knowledge, no mathematical training—simply the ability to reason clearly.Follow these problems through and you will not only increase your ability to think in abstractions, but you will enjoy solving murder problems and robberies, see which fishermen are liars and how a blind man can identify color purely by logic, and enjoy dozens of interesting situations. Puzzles range from easy to relatively difficult, and will please both beginners and experts.",
        "Category": " Games & Activities , Puzzles",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1957"
        }
    },
    {
        "Title": "Four-Star Movies: The 101 Greatest Films of All Time",
        "Authors": "By Piazza, Jim and Kinn, Gail",
        "Description": "Here's fun for movie lovers even if the 101 films the authors have chosen cause consternation; they don't expect to please everyone, after all, and they do give reasons for their choices.  The selected films are presented in a large format (10.5x13",
        "Category": " Performing Arts , Film , Reference",
        "Publisher": "Black Dog & Leventhal",
        "Price Starting With ($)": "9.42",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Nutcracker: A Young Reader’s Edition of the Holiday Classic",
        "Authors": "By Hoffman, E.T.A.",
        "Description": "",
        "Category": "",
        "Publisher": "Running Press Kids",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "The Galaxy Builder",
        "Authors": "By Laumer, Keith",
        "Description": "Kidnapped and sent to an alternate reality, Lafayette O'Leary must find the source of his own power to alter reality in order to return to his wife in his home world, Artesia",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "The Mysterious Flame of Queen Loana",
        "Authors": "By Eco, Umberto and Brock, Geoffrey",
        "Description": "Yambo, a sixtyish rare-book dealer who lives in Milan, has suffered a loss of memory-he can remember the plot of every book he has ever read, every line of poetry, but he no longer knows his own name, doesn't recognize his wife or his daughters, and remembers nothing about his parents or his childhood. In an effort to retrieve his past, he withdraws to the family home somewhere in the hills between Milan and Turin.There, in the sprawling attic, he searches through boxes of old newspapers, comics, records, photo albums, and adolescent diaries. And so Yambo relives the story of his generation: Mussolini, Catholic education and guilt, Josephine Baker, Flash Gordon, Fred Astaire. His memories run wild, and the life racing before his eyes takes the form of a graphic novel. Yambo struggles through the frames to capture one simple, innocent image: that of his first love.  A fascinating, abundant new novel-wide-ranging, nostalgic, funny, full of heart-from the incomparable Eco.",
        "Category": " Fiction , Literary",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Patriots: The Vietnam War Remembered from All Sides",
        "Authors": "By Appy, Christian G.",
        "Description": "Having written two previous books about the Cold War, Appy here assembles recent perspectives on the Vietnam War from veterans, prisoners of war, peace activists, journalists, policymakers, generals, US and Vietnamese government officials, Vietnamese on both sides, those who were children then, and others. Annotation (c) Book News, Inc., Portland, OR (booknews.com)",
        "Category": " History , Military , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "How She Really Does It: Secrets of Successful Stay-at-Work Moms",
        "Authors": "By Sachs, Wendy",
        "Description": "Yes, some women are opting out of their careers, taking an \"off-ramp,\" and heading home to raise their babies. But millions of us cannot afford to make that choice. And millions more choose to work because we love our careers. So how are women holding on to financially necessary or stimulating and rewarding careers and still being engaged mothers? Wendy Sachs, journalist and mother of two, set out to find what's really happening at the intersection of motherhood and work today. Based on her in-depth interviews with mothers from diverse backgrounds, How She Really Does It explores the creative and courageous ways in which stay-at- work moms are making it happen. Here are the moms next door-as well as lawyers, doctors, entrepreneurs, fashion designers, journalists, and television personalities-who are navigating the everyday work/home conflicts, and, yes, dealing with the guilt. Through it all, they are empowered career women and caring, present mothers. A modern working woman's survival guide, How She Really Does It will give you hope that even if you can't have it all, you can have at least some of it all of the time.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Dick and Jane Fun with Our Family",
        "Authors": "By Grosset & Dunlap",
        "Description": "Dick, Jane, Sally, Mother, and Father are not the only family having fun. This time, meet Mike, twin sisters Pam and Penny, and their parents. Two families mean twice the laughs and twice the fun. Beginning readers will love the way each chapter is an individual story, and parents and educators will appreciate the way this format encourages young readers? progression.",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Troubadour's Song: The Capture and Ransom of Richard the Lionheart",
        "Authors": "By Boyle, David",
        "Description": "On his long journey home from the Third Crusade, Richard the Lionheart--one of history's most powerful and romantic figures--was ship-wrecked near Venice in the Adriatic Sea. Forced to make his way home by land through enemy countries, he traveled in disguise, but was eventually captured by Duke Leopold V of Austria, who in turn conveyed him to Henry VI, the Holy Roman Emperor. Henry demanded a majestic ransom, and Richard's mother, Eleanor of Aquitaine, raised the historic sum--one quarter of the entire wealth of England--and Richard was returned. But a peculiar legend followed him--that a troubadour named Blondel, a friend of Richard's, had journeyed across Europe singing a song he knew Richard would recognize in order to discover his secret place of imprisonment.David Boyle recreates the drama of the Third Crusade and the dynamic power politics and personalities of the late 12th century in Europe, as well as the growing fascination with romance and chivalry embodied in the troubadour culture. An evocation of a pivotal era, The Troubadour's Song is narrative history at its finest.",
        "Category": " History , Europe , General",
        "Publisher": "Walker and Company",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "The Complete Monty Python's Flying Circus : All the Words, Volume 2",
        "Authors": "By Chapman, Graham (EDT) and Monty Python (Comedy Troupe) (COR)",
        "Description": "***WINNER OF THE 1989 PYTHON PRIZE FOR THEIR OWN BOOKS***The complete scripts from the four Monty Python series, first shown on BBC television between 1969 and 1974, have been collected in two companion volumes.Characters' names, often not spoken, are given as in the original scripts, along with the names of the actual performer added on their first appearance in each sketch.This second volume contains twenty-two classic episodes, featuring some of the most entertaining writing to have gone into television anywhere. The minister of silly walks, the dead parrot, banter in a cheese shop - here is every silly, satirical skit, every snide insult, every saucy aside.",
        "Category": " Humor , Form , Parodies",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "15.48",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "There's No Toilet Paper on the Road Less Traveled: The Best Travel Humor and Misadventure (Travelers' Tales Guides)",
        "Authors": "By Lansky, Doug (EDT)",
        "Description": "Discusses the bizarre and humorous misadventures of great writers, including P.J. O'Rourke, Dave Barry, Caryl Rivers, Peter Mayle, and Joseph O'Connor",
        "Category": " Travel , Special Interest , Adventure",
        "Publisher": "Travelers' Tales Guides",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Orchids",
        "Authors": "By Curtis, Bruce (PHT)",
        "Description": "Our stunning 96-page gift book is an exquisite tribute to the most elegant and delicate of potted plants, a perennial favorite among the discriminating. Collected here are 46 resplendent images of cattleya, cymbidium, phalaenopsis, dendrobium, miltonia, and other popular varieties, accompanied by inspirational words from poets, scientists, philosophers, artists, and writers. Orchids delivers a positive message of renewal and strength through memorable words and images, focusing on such attributes as growth, strength, and beauty as embodied by the flowers themselves.",
        "Category": " Photography , Subjects & Themes , Plants & Animals",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "The Cloister Walk",
        "Authors": "By Norris, Kathleen",
        "Description": "A NEW YORK TIMES BESTSELLER AND NEW YORK TIMES NOTABLE BOOK OF THE YEAR“Vivid, compelling... An embrace of moral and spiritual contemplation.” –The New York Times“A remarkable piece of writing. If read with humility and attention, Kathleen Norris's book becomes lectio divina, or holy reading.” –The Boston GlobeFrom the iconic author of Amazing Grace: A Vocabulary of Faith, a spiritual journey that brings joy to the meanings of love, grace and faith. Why would a married woman with a thoroughly Protestant background and often more doubt than faith be drawn to the ancient practice of monasticism, to a community of celibate men whose days are centered on a rigid schedule of prayer, work, and scripture? This is the question that poet Kathleen Norris asks us as, somewhat to her own surprise, she found herself on two extended residencies at St. John's Abbey in Minnesota.Part record of her time among the Benedictines, part meditation on various aspects of monastic life, The Cloister Walk demonstrates, from the rare perspective of someone who is both an insider and outsider, how immersion in the cloistered world-- its liturgy, its ritual, its sense of community-- can impart meaning to everyday events and deepen our secular lives. In this stirring and lyrical work, the monastery, often considered archaic or otherworldly, becomes immediate, accessible, and relevant to us, no matter what our faith may be.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Islands in the Street: Gangs and American Urban Society",
        "Authors": "By Sánchez-jankowski, Martín",
        "Description": "\"Vivid, lively, and yet theoretically informed, a triumph of patient and sustained fieldwork. . . . Jankowski presents the gang and its members not as pathological departures from social norms, but as shrewd and resourceful operators.\"--Michael Lipsky, Massachusetts Institute of Technology\"Islands in the Street fills a wide gap in the literature on gangs. Jankowski's innovative model of gang participation and organization is important and elegant, guaranteeing that this will be the book on gangs for the next ten years, if not longer.\"--Ruth Horowitz, University of Delaware",
        "Category": " History , United States , General",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "In the days of Simon Stern;: A novel,",
        "Authors": "By Cohen, Arthur Allen",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "6.45",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Liberation Management: Necessary Disorganization for the Nanosecond Nineties",
        "Authors": "By Peters, Thomas J.",
        "Description": "In the new economy, hierarchical business structures are being consigned to the shredder and replaced with flexible, fast-responding, ad hoc groups of brainworkers. Tom Peters, author of the bestselling IN SEARCH OF EXCELLENCE is once again ahead of the curve, and now demonstrates that the key to success in business future is total engagement, dynamism, speed, and independence. \"Rewarding. Provides a wealth of thought-provoking information and incisive insights.\"PHILADELPHIA INQUIRER\"A gold mine of information.\"USA TODAYFrom the Trade Paperback edition.",
        "Category": " Business & Economics , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "A SENSIBLE LIFE",
        "Authors": "By Wesley, Mary",
        "Description": "She was a thin, lonely child with huge eyes and an extensive vocabulary of French foul language.  Amongst the elegant middle-class British families holidaying in Dinard in 1926--leading their privileged lives of secure routine pleasures--Flora was a ten-year-old misfit.  Ignored by her self-absorbed parents, unloved, and pitied by the pleasant, stylish people in Brittany that summer, Flora was--peripherally--included in their gracious circles.  And there, meeting kindly civilised people for the first time, she fell in love--with Cosmo--with Hubert--with Feix.  It took forty years for the love affairs to be explored, consummated and finally resolved.",
        "Category": " Fiction , General",
        "Publisher": "Corgi",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Edmund Wilson, Letters on Literature and Politics, 1912-1972",
        "Authors": "By Solzhenitsyn, Aleksandr Isaevich",
        "Description": "",
        "Category": "",
        "Publisher": "Farrar Straus & Giroux",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "My American Century",
        "Authors": "By Terkel, Studs",
        "Description": "Pulitzer Prize-winning oral historian Studs Terkel's \"greatest hits.\" Terkel's oral histories have been enjoyed by millions of Americans, and have earned him a Pulitzer Prize, induction into The American Academy of Arts and Letters, The National Humanities Medal, and The National Book Foundation Medal for Distinguished Contribution to American Letters, among other honors. My American Century collects the best of his interviews and the introductions from each of his eight classic books, along with a major new introduction to Terkel's work by Robert Coles. It is a both stellar collection of portraits and a panoramic chronicle of America from the 1920s onward.",
        "Category": " History , United States , General",
        "Publisher": "The New Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Dogs Never Lie About Love : Reflections on the Emotional World of Dogs",
        "Authors": "By Masson, J. Moussaieff",
        "Description": "Dogs fill our hearts with love and our minds with wonder, but their emotional lives have remained unexplored since Darwin 125 years ago. Now in Dogs Never Lie About Love, controversial psychoanalyst Jeffrey Masson brilliantly navigates the rich inner landscape of \"our best friends.\"As he guides readers through the surprising depth of canine emotional complexity, Jeffrey Masson draws from myth and literature, from scientific studies, and from the stories and observations of dog trainers and dog lovers around the world. But the stars of the book are the author's own three dogs whose delightful and mysterious behavior provides the way to exploring a wide range of subjects--from emotions like gratitude, compassion, loneliness, and disappointment to speculating what dogs dream of and how their powerful sense of smell shapes their perception of reality. As he sweeps aside old prejudices on animal behavior, Masson reaches into a rich universe of dog feeling to its essential core, their \"master emotion\": love.Like the dogs he loves, Masson's writing will capture the reader with its playful, mysterious, and serious sides. Its surprising insights provide a new dimension of understanding for dog owners everywhere.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Dishy Desserts",
        "Authors": "By Helen Woodhall",
        "Description": "Combines classic with modern to create an imaginative, user friendly cook book that will convert everyone to the divine delights of the sweet and satisfying.",
        "Category": " Cooking , Courses & Dishes , Desserts",
        "Publisher": "Kyle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Classical Greeks",
        "Authors": "By Grant, Michael",
        "Description": "The Golden Age of ancient Greek city-state civilization lasted from 490 to 336 B.C., the period between the first wars against Persia and Carthage and the ascension of Alexander the Great. Never has there been such a multiplication of talents and genius within so limited a period. An astonishing period caught at the height of its powers by an eminent historian. \"Michael Grant never fails to be lively and well informed and he has done more, single-handedly, to blow the dust of the classical world than any comparable populariser.\"--Sunday Times. \"Grant is a unique figure among the classical scholars of our time.\"--Spectator.",
        "Category": " History , Ancient , Greece",
        "Publisher": "Phoenix",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Growing a Reader from Birth: Your Child's Path from Language to Literacy",
        "Authors": "By McGuinness, Diane",
        "Description": "An essential guide to understanding children's language from the first days of babbling through a five-year-old's mastery of reading. How children learn language is an endlessly fascinating subject, with new research revising our views every day. In Growing a Reader from Birth, seasoned researcher Diane McGuinness reviews the latest findings on just how much infants, toddlers, and preschoolers know and are capable of expressing from the early months on. Chapters covering each year of a child's language growth link this new knowledge to McGuinness's own innovative program for children's mastery of reading. She charts how a child first makes sense of the world of sound and symbols and then progresses from recognizing and decoding words to developing a vocabulary and using it to become a good listener, an expert reader, and an eloquent speaker. Growing a Reader from Birth not only illuminates the stages of language learning in children but also equips parents with indispensable advice on how to maximize their interactions with their children and be a positive force in nurturing their child's language from day one.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Origin of Humankind : Unearthing Our Family Tree (Science Masters)",
        "Authors": "By Leakey, Richard",
        "Description": "A meticulously clear account of how early ape-men of the African savannah developed into fully human beings.",
        "Category": " Science , General",
        "Publisher": "Orion Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Dr. Sylvia Rimm's Smart Parenting: How to Raise a Happy, Achieving Child",
        "Authors": "By Rimm, Sylvia B.",
        "Description": "Based on more than twenty years' experience working with families in her clinic, on radio conversations with hundreds of parents, and letters received from readers, Dr. Rimm offers compassionate yet no-nonsense advice. She explains the four basic principles of parenting - her cornerstones of achievement. And she gives practical and effective suggestions on dozens of topics, including how to deal with school problems, attention deficit/hyperactivity disorders, challenges of single parenting, selecting child care, and behavior problems.Each chapter includes an extensive Q&A section in which Dr. Rimm answers actual questions she has received from parents, and Parent Pointers are easily identifiable throughout the text to allow readers to find key ideas quickly.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Philadelphia: A Photographic Celebration",
        "Authors": "By Wilson, Jason (EDT), Roberts, H. Armstrong (EDT), and Chin, Yvette M. (EDT)",
        "Description": "",
        "Category": " Travel , Pictorials",
        "Publisher": "Running Press",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Radicals in Robes: Why Extreme Right-Wing Courts Are Wrong for America",
        "Authors": "By Sunstein, Cass R.",
        "Description": "Most people think that the Supreme Court has a rough balance between left and right. This is a myth; in fact the justices once considered right-wing have now taken the mantle of the Court's moderates, and the liberal element has all but disappeared. Most people also think that judicial activism is solely a liberal movement. This is also a myth; since William Rehnquist was confirmed as Chief Justice in 1986, the Supreme Court has engaged in an unprecedented record of judicial activism. These two factors are feeding a movement to restore what many conservatives call \"The Constitution in Exile,\" by which they mean the Constitution as it existed before the Roosevelt administration. Radicals in Robes explains what the restoration of this constitutional vision would mean. It would mean the end of the FCC, the SEC, the EPA, and every other federal agency that enacts regulations that have the force of law. It would mean that the clause of the First Amendment that says that Congress may make no law \"respecting an establishment of religion\" would be turned on its head. Marriage laws and many other familiar areas of modern life are all in the sights of this conservative movement. Radicals in Robes takes judicial philosophy out of the law schools and shows what it means when it intersects partisan politics. It pulls away the veil of rhetoric from a dangerous and radical right-wing movement and issues a strong and passionate warning about what conservatives really intend. One of the most respected legal theorists in the country, Cass R. Sunstein here issues a warning of compelling concern to us all.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Travels of Sir John Mandeville (Penguin Classics)",
        "Authors": "By Mandeville, John",
        "Description": "",
        "Category": " Travel , General",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "Live the Life You Love: In Ten Easy Step-by-Step Lessons",
        "Authors": "By Sher, Barbara",
        "Description": "Barbara Sher has helped thousands of people recapture their dreams, overcome self-doubt and fear, and find meaning in their lives with her sensational bestsellers, I Could Do Anything If I Only Knew What It Was and Wishcraft.  Now, in a work that is a brilliant culmination of her groundbreaking ideas, the New York Times bestselling author goes beyond the principles introduced in her previous books to explore the unique genius inside each of us.  Here, Sher employs a new, phenomenally effective approach to uncovering hidden talents--and nurturing the inborn \"gifts\" that make you different from any other person and provide the key to creating a life you will love.Combining fast-acting strategies and innovative exercises with motivational techniques and warm encouragement, Sher has designed an extraordinary step-by-step program that will help you uncover: What quality will make you \"unstoppable\" (and it's far more effective than \"discipline\" or \"willpower\"). What your favorite childhood pastimes reveal about what it takes to be a happy adult. How to use your natural curiosity, talents, and resources to turn your thinking--and your luck--around. Why one-size careers do not fit all.Foolproof techniques for leaping over the hurdles between you and your dream.If you've been waiting for a job that rewards you with more than a paycheck, or for the perfect moment to take that \"long-lost\" dream off hold, Barbara Sher's exquisitely simple but utterly transforming program makes right now the perfect time to break free from a career that doesn't cut it tailor-make a meaningful, rewarding life to your personal specifications and create a foundation for success that's strong enough to support your heart's desire.  With profound wisdom and insight, Barbara Sher has written a book that will lift your spirits, transform your thinking, and inspire you to dream--freeing you to do what you love and love what you do for the rest of your life!",
        "Category": " Psychology , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Cockeyed: A Memoir",
        "Authors": "By Knighton, Ryan",
        "Description": "On his 18th birthday, Ryan Knighton was diagnosed with Retinitis Pigmentosa (RP), a congenital, progressive disease marked by night-blindness, tunnel vision and, eventually, total blindness.  In this penetrating, nervy memoir, which ricochets between meditation and black comedy, Knighton tells the story of his fifteen-year descent into blindness while incidentally revealing the world of the sighted in all its phenomenal peculiarity.      Knighton learns to drive while unseeing; has his first significant relationship?with a deaf woman; navigates the punk rock scene and men's washrooms; learns to use a cane; and tries to pass for seeing while teaching English to children in Korea.  Stumbling literally and emotionally into darkness, into love, into couch-shopping at Ikea, into adulthood, and into truce if not acceptance of his identity as a blind man, his writerly self uses his disability to provide a window onto the human condition.  His experience of blindness offers unexpected insights into sight and the other senses, culture, identity, language, our fears and fantasies.    Cockeyed is not a conventional confessional.  Knighton is powerful and irreverent in words and thought and impatient with the preciousness we've come to expect from books on disability.  Readers will find it hard to put down this wild ride around their everyday world with a wicked, smart, blind guide at the wheel.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Italian Slow and Savory",
        "Authors": "By Goldstein, Joyce and Nobile, Paolo (PHT)",
        "Description": "Italian Slow and Savory celebrates the pleasure of taking time when it comes to friends, family, and good food. In this inspiring cookbook, acclaimed author Joyce Goldstein presents more than 120 recipes for slow-cooked soups, stews, pasta sauces, braises, roasts, and casseroles, with rich, full flavors that are unmatched by faster cooking methods. There is nothing better than slow in the kitchen when these savory favorites are bubbling on the stove or in the oven. Taking time to cook, while leaving cooks time, these dishes are amazingly easy to preparebraised pork ribs and sausages smothered in tomatoes and red wine, fennel-scented beef sauce served over polenta, hearty white bean soup with mussels, lamb stew flavored with citrus-scented olives. In a world where even fast food seems to be getting faster, here is a mouthwatering homage to putting on the brakes and dining the Italian way.",
        "Category": " Cooking , Regional & Ethnic , Italian",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "6.89",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Princess Sonora and the Long Sleep (Princess Tales)",
        "Authors": "By Levine, Gail Carson and Elliott, Mark (ILT)",
        "Description": "A spiteful fairy. A beautiful princess. An outstretched finger. A spindle. A hundred-year snooze. A charming prince. A kiss. All the familiar ingredients.But wait! Where did that extra prince come from? And those fairy gifts that were never there before? And what does a flock of balding sheep have to do with anything?Gail Carson Levine has waved her magic wand over the old standby of \"Sleeping Beauty\" and presto! It reappears, transformed, sparkling and hilarious. Chuckles and giggles are guaranteed.",
        "Category": " Juvenile Nonfiction , Social Science , Folklore & Mythology",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Only a Little Planet",
        "Authors": "By Brower, David",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "5.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "How To Lose Friends And Alienate People: A Memoir",
        "Authors": "By Young, Toby",
        "Description": "In 1995 high-flying British journalist Toby Young left London for New York to become a contributing editor at Vanity Fair. Other Brits had taken Manhattan--Alistair Cooke, Tina Brown, Anna Wintour--so why couldn't he?But things didn't quite go according to plan. Within the space of two years he was fired from Vanity Fair, banned from the most fashionable bar in the city, and couldn't get a date for love or money. Even the local AA group wanted nothing to do with him.How to Lose Friends and Alienate People is Toby Young's hilarious and best-selling account of the five years he spent looking for love in all the wrong places and steadily working his way down the New York food chain, from glossy magazine editor to crash-test dummy for interactive sex toys. A seditious attack on the culture of celebrity from inside the belly of the beast, How to Lose Friends and Alienate People is also a \"nastily funny read.\" --USA Today",
        "Category": " Biography & Autobiography , Editors, Journalists, Publishers",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Measured Drawings of Early American Furniture",
        "Authors": "By Osburn, Burl Neff",
        "Description": "Construct 29 classic pieces from 150 measured drawings, text, 32 photos.",
        "Category": " Antiques & Collectibles , Furniture",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1974"
        }
    },
    {
        "Title": "Whose Millennium?: Theirs or Ours?",
        "Authors": "By Singer, Daniel",
        "Description": "\"Magisterial in its historical sweep, fiercely democratic in its vision, Whose Millennium? is the thinking person's 'bridge to the 21st century.' There is an alternative to rampant inequality and the corruptions of power, and-ever so modestly and persuasively-Daniel Singer points the way.\"",
        "Category": " Political Science , Political Ideologies , Communism, Post-Communism & Socialism",
        "Publisher": "Monthly Review Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The Age of Paradox",
        "Authors": "By Handy, Charles",
        "Description": "In this striking sequel to his best-selling book The Age of Unreason, Charles Handy shows how the changes he predicted are upon us. New developments in technology, radical changes in the global economy, and the relentless pursuit of productivity have altered forever our organizations, our careers, and our lifestyles. These changes are inevitable and irreversible, and they bring a host of new problems and paradoxes. This book identifies the unintended consequences of change and provides a set of guiding principles to cope with the paradoxes of modern life, leading to a more balanced existence for individuals, greater rewards for organizations, and a more just society for all.",
        "Category": " Business & Economics , Management",
        "Publisher": "Harvard Business School Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "There's an Angel on Your Shoulder: Angel Encounters in Everyday Life",
        "Authors": "By Tyler, Kelsey",
        "Description": "Recounts the experiences of ordinary people, who were visited by angels in times of need",
        "Category": " Religion , Inspirational",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "501 Delicious Diabetic Recipes: For You and Your Family",
        "Authors": "By Chappell, Anne C.",
        "Description": "Diabetics will find this special cookbook especially appealing, discovering more than 500 recipes using sugar substitutes and low-fat ingredients while managing to retain the flavor of great cooking. Original.",
        "Category": " Cooking , Health & Healing , Diabetic & Sugar-Free",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.84",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Introducing American Politics: A Graphic Guide",
        "Authors": "By Appignanesi, Richard, Garratt, Chris, and Brogan, Patrick",
        "Description": "Outlines the processes of government and politics in the United States from the Declaration of Independence to the presidential election of 2000",
        "Category": " History , North America",
        "Publisher": "Icon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Are We Listening to the Angels?: The Next Step in Understanding the Angels in Our Lives",
        "Authors": "By Grant, Robert J.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Are Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "I Spy Fantasy: A Book of Picture Riddles",
        "Authors": "By Marzollo, Jean and Wick, Walter",
        "Description": "Search-and-find riddles paired with amazing photographs will captivate kids of all ages in the bestselling I Spy series.Acclaimed I Spy creators Walter Wick and Jean Marzollo use everyday objects to enhance intellectual discovery. Readers can examine the different objects, solve the picture riddles, and become an I Spy detective!A perfect fit for STEAM curriculum.",
        "Category": " Juvenile Nonfiction , Games & Activities , Puzzles",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Myths Of Gender: Biological Theories About Women And Men",
        "Authors": "By Fausto-Sterling, Anne",
        "Description": "Reprint of the Basic Books edition of 1985 which is cited in  BCL3 . Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "Brush Up Your Shakespeare!",
        "Authors": "By MacRone, Michael and Lulevitch, Tom (ILT)",
        "Description": "A Lively Compendium of Shakespeare's Wisest and Wittiest WordsFrom the doomed Othello, who first assumed a \"foregone conclusion,\" to the impetuous Mercutio, who went off on the first \"wild-goose chase,\" here are several hundred of the most famous lines and newly minted words from Shakespeare's canon.  Each phrase is presented with background notes, explnations, and literary anecdotes that set it in its original context.  With a new filmography of the finest Shakespeare movies, Brush Up Your Shakeapeare! is an accessible and entertaining guide for Bard aficionados and amateurs alike.Did You Know?The gargantuan Sir Falstaff was the first unwelcome guest to eat his hostess \"out of house and home\" Juliet thought that parting from her Young Romeo was \"such sweet sorrow\"  Macbeth believed himself to be \"a sorry sight\" It was Rosalind who desired \"too much of a good thing\"                 Lady Macbeth realized that \"what's done is done\"",
        "Category": " Drama , General",
        "Publisher": "HarperPb",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Switchback: A Henry Holt Mystery",
        "Authors": "By wilcox, collin",
        "Description": "When beautiful Lisa Franklin is found brutally murdered, her body dumped like so much rubbish, Lt. Hastings sighs and wonders aloud at the terrible waste. The victim was young, from a wealthy and respected family, with seemingly everything to live for. Hastings chalks it up with all the other senseless murders he sees in the course of a month, a year, a lifetime, of policing. As he investigates, though, it soon becomes clear that Franklin was far from just another innocent victim - but was she really a vengeful blackmailer? And is the murderer one of her own high-powered lovers from whom Franklin may have been extorting money? Or is it one of her reckless and feckless housemates, high on the drugs they all shared and fueled by jealousy over her many lovers?Lisa Franklin's wild life provides too few clues and too many suspects. Her journals, however, containing fragments of poetry and ruminations, hint at a fragile brilliance behind the brittle facade and draw Hastings to her posthumously.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "The Survival of Helga Braun",
        "Authors": "By Braun, Helga",
        "Description": "",
        "Category": "",
        "Publisher": "Vantage",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Fire",
        "Authors": "By Junger, Sebastian",
        "Description": "For readers and viewers of The Perfect Storm, opening this long-awaited new work by Sebastian Junger will be like stepping off the deck of the Andrea Gail and into the inferno of a fire burning out of control in the steep canyons of Idaho. Here is the same meticulous prose brought to bear on the inner workings of a terrifying elemental force; here is a cast of characters risking everything in an effort to bring that force under control.Few writers have been to so many desperate corners of the globe as has Sebastian Junger; fewer still have provided such starkly memorable evocations of characters and events. From the murderous mechanics of the diamond trade in Sierra Leone to the logic of guerrilla warfare in Afghanistan and the forensics of genocide in Kosovo, this new collection of Junger's nonfiction will take you places you wouldn't dream of going to on your own.",
        "Category": " Nature , Natural Disasters",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "What Time Is It? You Mean Now?: Advice for Life from the Zennest Master of Them All",
        "Authors": "By Berra, Yogi and Kaplan, Dave",
        "Description": "Could Confucius hit a curveball? Could Yoda block the plate? Can the Dalai Lama dig one out of the dirt? No, there is only one Zen master who could relay his wisdom while gloving a relay, ponder perfection while catching a perfect game, and contemplate the circle of life while rounding the bases.  Who is this guru lurking in the grand old game? Well, he's the winner of ten World Series rings, a member of both the Hall of Fame and the All-Century Team, and perhaps the most popular and beloved ballplayer of all time. And without effort or artifice he's waxed poetic on the mysteries of time (\"It gets late awful early out there\"), the meaning of community (\"It's so crowded nobody goes there anymore\"), and even the omnipresence of hope in the direst circumstances (\"It ain't over 'til it's over\").  It's Yogi Berra, of course, and in What Time Is It? You Mean Now?, Yogi expounds on the funny, warm, borderline inadvertent insights that are his trademark. Twenty-six chapters, one for each letter from A to Z, examine the words, the meaning, and the uplifting example of a kid from St. Louis who grew up to become the consummate Yankee and the ultimate Yogi.  Included in this treasury of inspired and inspiring Yogi-isms are such eloquent and thought-provoking pearls of wisdom as:  \"I ain't in a slump. I'm just not hitting,\" encouraging us to stay positive even in the face of adversity.  \"Why be jealous over things you don't have?\" counseling us to take joy in all the good things in our lives -- without envying others.  \"You can observe a lot by watching,\" reminding us to be open to the possibility of surprise and wonder in the world around us.  \"It's like déjà-vu all over again,\" because, after all, you don't have to believe in reincarnation to know that history repeats itself.  Touching on all things great and not so great, Yogi imparts to us his one-of-a-kind wisdom and famously quirky humor, illuminating the subtle truths at work in our lives. Overflowing with improbable insight and enlightening advice, What Time Is It? You Mean Now? is the essential guide to the world according to Yogi.",
        "Category": " Philosophy , Zen",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Get Healthy Now! With Gary Null: A Complete Guide to Prevention, Treatment, and Healthy Living",
        "Authors": "By Null, Gary",
        "Description": "Covers nutrition, weight management, vegetarianism, exercise, mental health, arthritis, foot care, heart disease, cancer prevention and treatment, chronic conditions, women's health, and longevity.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Seven Stories Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    }
]