[
    {
        "Title": "Halley's Comet!",
        "Authors": "By Reddy, Francis",
        "Description": "",
        "Category": "",
        "Publisher": "AstroMedia",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Inspiration Sandwich: Stories to Inspire Our Creative Freedom",
        "Authors": "By Sark",
        "Description": "Sark's first book, A CREATIVE COMPANION, has charmed all who come across it, so we were delighted when she came back to us with this collection of 43 ways to awaken your creative self?including \"invite someone dangerous to tea,\" \"take lots of naps,\" and \"make friends with freedom and uncertainty.\" As the author puts it, \"This book is food for your soul, and a bubble bath for your spirit. It is a guide to keeping your creativity alive, and I wrote it for you. In the SARK tradition, it was written while in pajamas, and in between naps. My first job was at age four as the wake-up fairy in kindergarten. I believe in waking up creative spirits.\" This colorful work also includes the complete text of her popular pieces, \"CATS ARE ANGELS WITH FUR\" and \"DOGS ARE MIRACLES WITH PAWS.\"",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Celestial Arts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Essential History of American Art",
        "Authors": "By Bailey, Suzanne",
        "Description": "",
        "Category": "",
        "Publisher": "PARRAGON",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Orphans Of The Cold War: America And The Tibetan Struggle For Survival",
        "Authors": "By Knaus, Kenneth",
        "Description": "\"For decades, the United States ran covert operations into Tibet in an attempt to help Tibetan exiles take back their country from the Chinese. These operations have never been disclosed—until now.\"",
        "Category": " History , Military , Wars & Conflicts (Other)",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Activity-based management in government",
        "Authors": "By Joseph, Reeve, Robert, and Dodson, William",
        "Description": "",
        "Category": "",
        "Publisher": "Coopers & Lybrand",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Presidential War Power",
        "Authors": "By Fisher, Louis",
        "Description": "",
        "Category": " Political Science , Security (National & International)",
        "Publisher": "Univ Pr of Kansas",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Life as We Have Known It",
        "Authors": "By Davies, Margaret Llewelyn (EDT)",
        "Description": "A first-hand record of working class women’s experiences in early twentieth-century England, Life as We Have Known It is a unique view of lives Virginia Woolf described as “still half hidden in profound obscurity.” The women write about growing up in poverty, going into domestic service, being a hat factory worker, or a miner’s wife concerned about the colliery baths, and how they became politically active through the Women’s Co-operative Guild movement. Virginia Woolf’s essay contains her candid and searching reflections on the Guild’s 1913 Congress, the women who spoke there, and the differences between their lives and hers.",
        "Category": " Political Science , Labor & Industrial Relations",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1975"
        }
    },
    {
        "Title": "On the Campaign Trail: The Long Road of Presidential Politics, 1860-2004",
        "Authors": "By Schoen, Douglas E.",
        "Description": "An elated, victorious Truman brandishes a newspaper with the headline \"Dewey Defeats Truman.\" Theodore Roosevelt galvanizes the crowd with a fiery stump speech. Richard Nixon wipes away sweat during his debate with a poised JFK. Against the backdrop of a towering flag, Reagan captivates crowds with his promise of a stronger, prouder America. Bill Clinton weaves a spell with his saxophone. Throughout American history, few events have commanded the undivided attention of the public the way presidential campaigns have. Now the enduring moments of inspiration, the humiliating gaffes, and the heartbreaking losses of these campaigns are captured in a historic collection of photographs from America's greatest photojournalists.From the divisive election of Abraham Lincoln to the opening salvos of the 2004 campaign, America's presidents -- and pretenders to the office -- come to life in these pages. These men embody not only the drama of their times,  but also the great arc of American history. They are captured here in pivotal and telling campaign moments: on the stage and behind the scenes, on whistle-stop tours, at high-voltage conventions, and in head-to-head debates. Accompanied by political adviser Douglas E. Schoen's trenchant essays, the striking photographs in On the Campaign Trail offer a unique view of the moments that have united and divided us during the race for the presidency. A fascinating journey in words and images, this landmark collection brings home the drama, fanfare, and power of America's great national contest.",
        "Category": " Photography , Photojournalism",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "8.12",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Winning Monologs for Young Actors: 65 Honest-To-Life Characterizations to Delight Young Actors and Audiences of All Ages",
        "Authors": "By Kehret, Peg",
        "Description": "A collection of sixty-five monologues providing young performers with a variety of audition pieces reflecting situations both serious and comic.",
        "Category": " Performing Arts , Acting & Auditioning",
        "Publisher": "Meriwether Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "The Magnificent Mountain Women: Adventures in the Colorado Rockies",
        "Authors": "By Robertson, Janet",
        "Description": "Since the Pikes Peak gold rush in the mid–nineteenth century, women have gone into the mountains of Colorado to hike, climb, ski, homestead, botanize, act as guides, practice medicine, and meet a variety of other challenges, whether for sport or for livelihood. Janet Robertson recounts their exploits in a lively, well-illustrated book that measures up to its title, The Magnificent Mountain Women. Arlene Blum provides a new introduction to this edition.",
        "Category": " Biography & Autobiography , Reference",
        "Publisher": "University of Nebraska Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Special Trust",
        "Authors": "By McFarlane, Robert C.",
        "Description": "In this absorbing personal memoir, former National Security Adviser Robert C. McFarlane takes you inside the central events which have shaped our lives and our country in the late twentieth century. He also provides a riveting account of behind-the-scenes White House maneuvering and how personal agendas and the misuse of power have affected global politics and led to declining trust in elected officials.From the jungles of Vietnam where he served as a Marine officer, to the corridors of power where for nine years he served Presidents Nixon, Ford and Reagan, McFarlane provides a rich mosaic of what it means to wield power in international politics.",
        "Category": " History , United States , General",
        "Publisher": "Cadell & Davies",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Inventing the Middle Ages",
        "Authors": "By Cantor, Norman F.",
        "Description": "INVENTING THE MIDDLE AGESThe Lives, Works, and Ideas of the Great Medievalists of the Twentieth CenturyIn this ground-breaking work, Norman Cantor explains how our current notion of the Middle Ages-with its vivid images of wars, tournaments, plagues, saints and kings, knights and ladies-was born in the twentieth century. The medieval world was not simply excavated through systematic research. It had to be conceptually created: It had to be invented, and this is the story of that invention. Norman Cantor focuses on the lives and works of twenty of the great medievalists of this century, demonstrating how the events of their lives, and their spiritual and emotional outlooks, influenced their interpretations of the Middle Ages. Cantor makes their scholarship an intensely personal and passionate exercise, full of color and controversy, displaying the strong personalities and creative minds that brought new insights about the past. A revolution in academic method, this book is a breakthrough to a new way of teaching the humanities and historiography, to be enjoyed by student and general public alike. It takes an immense body of learning and transmits it so that readers come away fully informed of the essentials of the subject, perceiving the interconnection of medieval civilization with the culture of the twentieth century and having had a good time while doing it! This is a riveting, entertaining, humorous, and learned read, compulsory for anyone concerned about the past and future of Western civilization.",
        "Category": " History , Europe , Medieval",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Instant Fabric Quilted Projects from Your Home Computer (That Patchwork Place)",
        "Authors": "By McRee, Livia",
        "Description": "",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Martingale & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "On the Meaning of Victory: Essays on Strategy",
        "Authors": "By Luttwak, Edward N.",
        "Description": "Examines the problems and possibilities facing the United States in the 1980s and 1990s, from the threat of nuclear war and the military's strategic thinking, to the interplay of politics, personality, and history",
        "Category": " Political Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "The MATHEMATICA ® Book, Version 3",
        "Authors": "By Wolfram, Stephen",
        "Description": "With over a million users around the world, the Mathematica ® software system created by Stephen Wolfram has defined the direction of technical computing for nearly a decade. With its major new document and computer language technology, the new version, Mathematica 3.0 takes the top-power capabilities of Mathematica and make them accessible to a vastly broader audience. This book presents this revolutionary new version of Mathematica. The Mathematica Book is a must-have purchase for anyone who wants to understand the revolutionary opportunities in science, technology, business and education made possible by Mathematica 3.0. This encompasses a broad audience of scientists and mathematicians; engineers; computer professionals; quantitative financial analysts; medical researchers; and students at high-school, college and graduate levels. Written by the creator of the system, The Mathematica Book includes both a tutorial introduction and complete reference information, and contains a comprehensive description of how to take advantage of Mathematica's ability to solve myriad technical computing problems and its powerful graphical and typesetting capabilities. Like previous editions, the book is sure to be found well-thumbed on the desks of many technical professionals and students around the world.",
        "Category": " Computers , Computer Science",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "10.18",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Cindy Crawford's Basic Face",
        "Authors": "By Crawford, Cindy, Kashuk, Sonia, and Boyes, Kathleen",
        "Description": "One of the most recognized figures in the modeling industry presents insider's secrets on how to get the best results with makeup, from selecting the right equipment and colors to applying effective techniques. 300,000 first printing. $300,000 ad/promo. Tour.",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "Broadway",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "A Canary's Tale: the Final Battle, Volume I the Odyssey",
        "Authors": "By Jacob B. Berkson and Jack Garver [Illustrator]",
        "Description": "",
        "Category": "",
        "Publisher": "Self-Published",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Nutcracker (Creative Editions)",
        "Authors": "By Hoffmann, E. T. A. and Innocenti, Roberto (ILT)",
        "Description": "On Christmas Eve, Marie Stahlbaum huddles in the dark with her brother, Fritz, waiting for the Christ Child to come. When their parents open the doors to the parlor, the scene that awaits them is mesmerizing: a Christmas tree aglow with candles and more toys than they could have imagined. Godfather Drosselmeir has made them a fine castle with dancing ladies and leaping men, a clever toy fox, and battalions of soldiers. But Marie falls in love when she finds the one last gift tucked under the tree - the Nutcracker",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Creative Editions",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Economic Emergence W",
        "Authors": "By Bergmann, Barbara R.",
        "Description": "Examines the economic and social role of women in today's society, covering changes in job structure and technology, birth and divorce rates, education, sex roles and the family, and assesses the domestic pressures on men",
        "Category": " Law , Labor & Employment",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Daggerspell",
        "Authors": "By Kerr, Katharine",
        "Description": "In a world beyond physical reality, Nevyn, the wandering and mysterious sorcerer who relinquished a maiden's hand in marriage and so forged a terrible bond between three souls, searches for atonement for the tragic wrongs of his youth",
        "Category": "",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "The Gregg Reference Manual",
        "Authors": "By Sabin, William A.",
        "Description": "",
        "Category": "",
        "Publisher": "Gregg Division",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Panama: The Whole Story",
        "Authors": "By Buckley, Kevin",
        "Description": "Presents a complete overview of the Panama situation, including full reports on the U.S. invasion and Noriega's prosecution",
        "Category": " History , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "The New Guide to Relaxation (New Guide to Remedies/Therapies)",
        "Authors": "By n/a",
        "Description": "",
        "Category": "",
        "Publisher": "PARRAGON",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Contemporary Issues in Bioethics",
        "Authors": "By Beauchamp, Tom L. and Walters, Leroy (EDT)",
        "Description": "A collection of essays and court opinions on ethical issues in biology and medicine, presenting alternative positions on issues such as reproductive technologies, surrogate parenting, informed consent, confidential information, abortion, and the right to die. This fourth edition includes information on types of ethical theory and ethics in relation to law and public policy, revised chapter introductions, and new chapters on AIDS, euthanasia, and genetics, as well as 88 new selections. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Philosophy , General",
        "Publisher": "Wadsworth Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The sociology of cities",
        "Authors": "By Sirjamaki, John",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "22.56",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Running The World: the Inside Story of the National Security Council and the Architects of American Power",
        "Authors": "By Rothkopf, David J.",
        "Description": "An unprecedented look behind the scenes at the \"most powerful committee in the history of the world\" - the men and women closest to the president of the United States who make America's decisions affecting war and peace, who are the architects of everything from covert operations to market bailouts, from secret negotiations to combating terrorism. Running the World draws back the curtain on this shadowy world and in so doing reveals never-before-known details of the very human interactions that have shaped recent history, the rivalries and petty jealousies, the ambition, the moments of vision and greatness, the drama and the humor that suffuse the everyday events and great moments that marked the six decades since the end of World War II.The book is based on 130 exclusive interviews with many of the best-known and the most significant figures to have played a central role in shaping America's national security and foreign policies, including Condoleezza Rice, Colin Powell, Henry Kissinger, Madelaine Albright, Brent Scowcroft, Robert Rubion, Larry Summers, Tony Lake, William Perry, James Woolsey, and scores of others. The importance of the National Security Council, and all the formal, informal, highly visible and secret groups associated with it, has never been clearer than it is today. David Rothkopf depicts with an eye for both personal detail and historical implications the real events from which today's headlines and Tom Clancy novels are drawn - and includes, for the first time, an in-depth look at the inner workings of the Bush administration from many of its most important current and former players.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Mid-Atlantic Lighthouses (Lighthouse Series)",
        "Authors": "By Roberts, Bruce and Jones, Ray",
        "Description": "This book takes readers on a regional tour of 49 lighthouses and 4 lightships from the Hudson River to Chesapeake Bay.",
        "Category": " Travel , United States , General",
        "Publisher": "Globe Pequot",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Touchstone of Life: Molecular Information, Cell Communication, and the Foundations of Life",
        "Authors": "By Loewenstein, Werner R.",
        "Description": "No one can escape a sense of wonder when looking at an organism from within. From the humblest amoeba to man, from the smallest cell organelle to the amazing human brain, life presents us with example after example of highly ordered cellular matter, precisely organized and shaped to perform coordinated functions. But where does this order spring from? How does a living organism manage to do what nonliving things cannot do--bring forth and maintain all that order against the unrelenting, disordering pressures of the universe?In The Touchstone of Life, world-renowned biophysicist Werner Loewenstein seeks answers to these ancient riddles by applying information theory to recent discoveries in molecular biology. Taking us into a fascinating microscopic world, he lays bare an all-pervading communication network inside and between our cells--a web of extraordinary beauty, where molecular information flows in gracefully interlaced circles. Loewenstein then takes us on an exhilarating journey along that web and we meet its leading actors, the macromolecules, and see how they extract order out of the erratic quantum world; and through the powerful lens of information theory, we are let in on their trick, the most dazzling of magician's acts, whereby they steal form out of formlessness.The Touchstone of Life flashes with fresh insights into the mystery of life. Boldly straddling the line between biology and physics, the book offers a breathtaking view of that hidden world where molecular information turns the wheels of life. Loewenstein makes these complex scientific subjects lucid and fascinating, as he sheds light on the most fundamental aspects of our existence.",
        "Category": " Science , Life Sciences , Molecular Biology",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "How to Motivate People: The Team Strategy for Success",
        "Authors": "By Tarkenton, Fran and Tuleja, Tad",
        "Description": "The former football quarterback draws on his current experiences as a succssful business consultant to show how to motivate and inspire others to increased levels of productivity",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "Prevention's Quick and Healthy Low-Fat Cooking: Featuring All-American Food",
        "Authors": "By Rogers, Jean (EDT)",
        "Description": "Gathers healthful recipes for snacks, soups, salads, poultry, seafood, meat, vegetarian dishes, side dishes, and baked goods",
        "Category": " Cooking , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Working Under Different Rules (A National Bureau of Economic Research project report)",
        "Authors": "By Freeman, Richard B. (EDT)",
        "Description": "For much of the 20th century, American workers were the world's leaders in productivity, wages, and positive workplace conditions. American unions championed free enterprise and high labor standards, and American businesses dominated the world market. But, as editor Richard B. Freeman cautions in Working Under Different Rules, despite our relatively high standard of living we have fallen behind our major trading partners and competitors in providing good jobs at good pay—what was once considered \"the American dream.\" Working Under Different Rules assesses the decline in the well-being of American workers—evidenced by spiraling income inequality and stagnant real earnings—and compares our employment and labor conditions with those of Western Europe, Canada, Japan, and Australia. As these original essays demonstrate, the modern U.S. labor market is characterized by a high degree of flexibility, with rapid employee turnover, ongoing creation of new jobs, and decentralized wage setting practices. But closer inspection reveals a troubling flip side to this adaptability in the form of inadequate job training, more frequent layoffs, and increased numbers of workers pushed to the very bottom of the income scale, into the low wage occupations where much of the recent job growth has occurred. While the variety of works councils prevalent throughout the developed world have done much to foster democratic rights and economic protection for employees, the virtually union-free environment emerging in many areas of the private U.S. economy has stripped workers of a strong collective voice. German apprenticeship programs and the Japanese system of \"job rotation\" represent more effective approaches to preparing workers for the changing demands of lifetime employment. In addition, workers in European advanced economies and in Canada have greater social protection than Americans. But while this has some cost in unemployment and higher taxes, carefully designed social safety nets do not seriously jeopardize economic efficiency. Working Under Different Rules is an illuminating analysis of the often complex interaction of market institutions, social policy, and economic results. The authors' up-to-date international assessment of unions, wage setting, apprenticeship programs, welfare support, and works councils suggests alternate ways of training, paying, and empowering workers that, if effectively adapted, could facilitate the growth of a healthier American economy and better prospects for American workers.",
        "Category": " Business & Economics , Labor",
        "Publisher": "Russell Sage Foundation",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Remodeling old houses without destroying their character",
        "Authors": "By Stephen, George",
        "Description": "",
        "Category": "",
        "Publisher": "Alfred A. Knopf Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Leslie Nielson's Stupid Little Golf Book",
        "Authors": "By Nielsen, Leslie and Beard, Henry",
        "Description": "To movie audiences worldwide, Leslie Nielsen is best known as Lieutenant Frank Drebin, the zany hero of the hilarious Naked Gun films. But to duffers around the globe, he has long been famous for a different role, as the World's Greatest Bad Golfer - the Guru of Bad Golf.Now, working with humorist and fellow hacker Henry Beard, Nielsen has drawn on a lifetime of brilliantly uninspired play to produce the unique collection of useless wisdom, spurious reminiscences, and pointless tips that is the Stupid Little Golf Book.Painstakingly fabricated to look like the result of years of study of the game of golf, the Stupid Little Golf Book contains no dopey drills, no mind-game mumbo jumbo, no swing-wrecking instruction. Just simple commonsense advice on how to needle, wheedle, weasel, wangle, chisel, finagle, connive, and fudge your way to victory on the links, interspersed with heartwarming tales of duplicity, chicanery, mendacity, and truly deplorable sportsmanship.Covering everything from fundamentals, such as the grip (\"always hold the club at the thin end where that length of rubber stuff is, and not the end that has that curvy metal or wooden thing with the number on it...\"), to A Foolproof Way to Knock at Least Six Strokes off Your Score (\"skip the last hole\"), this is, finally, a golf book for the rest of us, by the man who put fun back into the game of golf.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The Future of Air Power",
        "Authors": "By Brown, Neville",
        "Description": "",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "Holmes & Meier Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Ants on the Melon: A Collection of Poems",
        "Authors": "By Adair, Virginia",
        "Description": "One of the most striking achievements of these poems is Mrs. Adair's wedding of traditional rhyme and meter with a sensibility entirely modern, American, sometimes disturbing, occasionally hilarious, always candid. The collection's title poem, \"Ants on the Melon,\" makes a wry, microcosmic comment on overpopulation. \"Surfers\" draws permanent lessons from the transience of youth. \"Break In\" transforms a standard burglary into a moment of bitter but wise resignation. Other poems take as their starting point the Gulf War, Zen Buddhism, or the interstate highway system. This collection's broad subject matter, from mourning to sexual joy to the plaint of an old umbrella, is matched by its chronological range, extending from the poet's childhood - \"Key Ring\" and \"The Grandmothers\" - to her old age, which lies at the heart of such poems as \"Slow Scythe\" and \"Take My Hand, Anna K.\"Mrs. Adair's refusal to publish her first book of poetry until now, at the age of eighty-three, emphasizes the double role of Time as the hero and villain of all human lives, and Time and its rewards and wounds and mercies may be these poems' most profound concern. In his intimate and affectionate Afterword, Robert Mezey, an accomplished poet himself and Mrs. Adair's close friend and literary champion, discusses her reluctance about book publication, and gives us a strong sense of her character and experiences - particularly the devastating impact of her husband's suicide in 1968 and the tragedy of the blindness that struck her in the beginning of this decade. And in the poems we are privileged to make the direct acquaintance, at long last, of this brave and gifted writer.",
        "Category": " Poetry , American , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "A Map of the World",
        "Authors": "By Hamilton, Jane",
        "Description": "Pen /Hemingway Award-winning novelist Jane Hamilton follows up her first success, The Book Of Ruth, with this spectacularly haunting drama about a rural American family and a disastrous event that forever changes their lives.",
        "Category": " Fiction , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Land Banking (Johns Hopkins Studies in Urban Affairs Series)",
        "Authors": "By Strong, Ann L.",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "The Johns Hopkins University Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1979"
        }
    },
    {
        "Title": "Be the Best You Can Be",
        "Authors": "By Puckett, Kirby",
        "Description": "An autobiography of the major league player discusses peer pressure, overcoming obstacles, avoiding drugs, and believing in oneself",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Waldman House Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Ordinary People, Extraordinary Wealth: The 8 Secrets of How 5,000 Ordinary Americans Became Successful Investors--and How You Can Too",
        "Authors": "By Edelman, Ric",
        "Description": "How did a secretary, a firefighter, a retired naval officer, a housewife, a construction worker, a schoolteacher, and a pharmacist become wealthy? Bestselling author Ric Edelman has studied the wealth-making habits of these and 5,000 other ordinary Americans.  What he found is revealed for the first time in this book: the eight great secrets to attaining wealth. This extraordinary book is filled with the advice of everyday people -- people like your own friends and neighbors -- who entered the world of personal finance, often with no real plan at the start, but who found ways to accumulate astonishing amounts of money. A rich, irreplaceable lifetime of wealthbuilding experience is now at your fingertips.  Here you will learn to arrange your finances and make your investment decisions so you can reach your goals and achieve financial security.  Including: How to turn your mortgage into a wealth-enhancing tool; Why small investments work better than big ones; How to max out on your employer-sponsored retirement plan; Your investments: when to hold them and when to fold them; Financial news: when to pay attention and when to turn it off; Plus, of course, much, much more.Let your neighbors lend you a hand and let Ric Edelman guide you through their lessons.  So come along for an eye-opening journey with thousands of ordinary folks who found their way to extraordinary wealth.   Five thousand of your neighbors found hard-won financial success using the same eight secrets to attaining wealth.  The lessons they learned through many years of life experience, and lots of trial and error, can now be yours! After studying the habits of thousands of financially successful people, bestselling author Ric Edelman found that they shared eight fundamental methods for attaining wealth.  Now you can adopt these same eight strategies yourself.Let the extraordinary experience of ordinary investors -- along with Ric Edelman's expert analysis -- help you create your own financial success story.",
        "Category": " Business & Economics , Personal Finance , Investing",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Paying with Plastic: The Digital Revolution in Buying and Borrowing",
        "Authors": "By Schmalensee, Richard and Evans, David S.",
        "Description": "In Paying with Plastic, David Evans and Richard Schmalensee provide a nontechnical distillation of their years of research on the economic, technological, and institutional forces that have shaped the payment card industry. They show how competition works in an industry that does not nearly fit any of the standard economic models. They describe how the entrepreneurs in this industry solved the chicken-and-egg problem: merchants will not take cards if few consumers use them, and consumers will not use cards if few merchants take them. They also describe how the payment card companies such as MasterCard and Visa have developed complex systems for coordinating transactions among their thousands of bank members and millions of card-holders and accepting merchants. Evans and Schmalensee also describe recent developments in the industry and consider its likely evolution.",
        "Category": " Business & Economics , Banks & Banking",
        "Publisher": "The MIT Press",
        "Price Starting With ($)": "5.38",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Moods and tenses,",
        "Authors": "By Lord, Alice Emma Sauerwein",
        "Description": "",
        "Category": "",
        "Publisher": "William Byrd Press",
        "Price Starting With ($)": "11.86",
        "Publish Date": {
            "Month": "January",
            "Year": "1929"
        }
    },
    {
        "Title": "Prayers for Boys and Girls",
        "Authors": "By Alison Cummings",
        "Description": "",
        "Category": "",
        "Publisher": "Whitman",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1953"
        }
    },
    {
        "Title": "Metropolitan Home Renovation Style",
        "Authors": "By Krotz, Joanna L.",
        "Description": "Drawing from hundreds of renovations covered in \"Metropolitan Home\" magazine, this illustrated sourcebook combines the advice of experienced designers, a price-specific list of products, before and after floorplans, and other helpful renovation tips",
        "Category": " House & Home , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "7.77",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Time Series Analysis: Regression Techniques (Quantitative Applications in the Social Sciences)",
        "Authors": "By Ostrom, Charles W.",
        "Description": "Examines techniques for the study of change based on regression analysis. Demonstrates how these regression techniques may be employed for hypothesis testing, estimating, and forecasting. Analysis strategies for both lagged and non-lagged models are presented.",
        "Category": " Social Science , Research",
        "Publisher": "SAGE Publications, Inc",
        "Price Starting With ($)": "16.5",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Marital Therapy: An Integrative Approach",
        "Authors": "By Nichols, William C.",
        "Description": "",
        "Category": " Psychology , Psychotherapy , Couples & Family",
        "Publisher": "The Guilford Press",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "The Complete Book of Vitamins and Minerals",
        "Authors": "By Consumer Guide (EDT) and Smith, Susan Male (EDT)",
        "Description": "Explains the role of vitamins and minerals in staying healthy and how readers can fit them into their diet, and offers up-to-date information about the supplements on the market, including antioxidants like Vitamin C. Original.",
        "Category": " Health & Fitness , Vitamins",
        "Publisher": "Consumer Guide",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "The Parenting Cookbook: A Comprehensive Guide to Cooking, Eating, and Entertaining for Today's Families",
        "Authors": "By Gunst, Kathy",
        "Description": "This encyclopedic cookbook is the comprehensive guide for parents who believe that preparing and enjoying good, healthy food should be an important part of family life. Speaking to the needs of families with children of all ages, Kathy Gunst and the editors of the award-winning Parenting magazine offer more than 325 recipes for every meal of the day as well as for special occasions.The heart of the book for busy working families is the Monday-through-Friday chapters of quick breakfasts, quick lunches, and quick dinners (with nearly seventy-five recipes), followed by chapters on leisurely weekend breakfasts, lunches, and dinners. Other chapters cover desserts, snacks, drinks, microwaving, and cooking basics.But there is much more here than a collection of outstanding recipes from a working mother of two young children. Gunst offers special ideas and strategies on how to have the pleasure and avoid the pitfalls of eating out with the kids; what to do about your picky eater; entertaining, or how to throw a dinner party without losing your mind; cooking with kids; the importance of family meals; and new ways to shop for groceries. She also gives dozens of tips, menus, and theme ideas for birthday parties, holidays, and other special occasions.",
        "Category": " Cooking , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Political Parties and Electoral Problems",
        "Authors": "By Brooks, Robert C.",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Brothers",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1923"
        }
    },
    {
        "Title": "Years of Renewal",
        "Authors": "By Kissinger, Henry",
        "Description": "Perhaps the best-known American diplomatist of this century, Henry Kissinger is a major figure in world history, winner of the Nobel Peace Prize, and arguably one of the most brilliant minds ever placed at the service of American foreign policy, as well as one of the shrewdest, best-informed, and most articulate figures ever to occupy a position of power in Washington.  The eagerly awaited third and final volume of his memoirs completes a major work of contemporary history. It is at once an important historical document and a brilliantly told narrative of almost Shakespearean intensity, full of startling insights, unusual (and often unsparing) candor, and a sweeping sense of history. It begins with the resignation of Richard Nixon -- including Kissinger's final assessment of Nixon's tortured personality and the self-inflicted tragedy that ended his presidency and made Kissinger, for a time, the most powerful man in American government, as well as an intimate and definitive portrait of the man whom Kissinger knew perhaps more closely than anyone -- and then takes the reader through the years of Gerald Ford's administration, in which Kissinger continued to play a decisive role, both as Secretary of State and as the symbol of the continuity of American foreign policy. It shows us a moving and admiring picture of President Ford as a man of decency, shrewd judgment, courage, and decisiveness who led the country through a period of renewal.  Kissinger details the agony of the final U.S. extrication from Vietnam -- with the rise of an increasingly hostile Congress determined to micromanage American foreign policy and the evisceration of the American intelligence community and its consequences for American power -- and takes us inside the White House to show our leaders in a time of crisis.  Indeed, crisis is what this book abounds in: the fall of Cambodia and South Vietnam, the Mayaguez incident and the conflict between Greece and Turkey over Cyprus, the origins of the war in Lebanon -- above all the continuing crisis of the Cold War at its perilous height. Here are brilliant scenes, as only an insider could write them, of the shaping of American foreign policy in the Ford era: the famous shuttle diplomacy by which Kissinger brought a wary Yitzhak Rabin and Anwar Sadat together to begin the return of the Sinai to Egypt and usher in the final reconciliation of Egypt and Israel, the Vladivostok meeting with Leonid Brezhnev that advanced the process of nuclear limitation, the uneasy dialogue with China, the tragedy of the Kurds, the search for European security and freedom -- all the major decisions, conferences, and crises that shaped the world we live in, and that still, in many cases, remain major areas of engagement for the United States.  Kissinger recounts in detail his visits to Africa, which led to major initiatives in Southern Africa, including the historic decision of the white settler government of Rhodesia to accept majority rule, and tells the story of U.S. policy in the Americas, including revealing accounts of policies toward Cuba and Chile in the 1970s.  Above all, here are intimate, candid, and sharply intelligent portraits of world leaders, from Mao Zedong teasing Kissinger with a characterist mixture of brutality and acerbic subtlety, to Leonid Brezhnev, confused, unwell, desperately trying to conceal the Soviet Union's growing difficulties with a facade of blustering bravado, as well as a galaxy of European, Middle Eastern, Asian, Latin American, and African leaders.  Here is a work of scholarship, wisdom, and history, written not by desk-bound academic historian, but by the man who shaped much the history about which he writes, and who perhaps more than any other helped to form the post-Cold War world in which we live, and define America's relationship to the world as the last superpower.  No work of history about the Cold War or the inner workings of government and diplomacy is as revealing, thought-provoking, and far-reaching as this. Years of Renewal is the triumphant conclusion of a major achievement and a book that will stand the test of time as a historical document of the first rank.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.75",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Papers on the War",
        "Authors": "By Daniel Ellsberg",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1972"
        }
    },
    {
        "Title": "A Midsummer Night's Dream (Dover Thrift Editions)",
        "Authors": "By Shakespeare, William",
        "Description": "Perhaps the most popular of all of Shakespeare's comedies, A Midsummer Night's Dream humorously celebrates the vagaries of love. The approaching wedding festivities of Theseus, Duke of Athens, and his bride-to-be, Hippolyta, Queen of the Amazons, are delightfully crisscrossed with in-again, off-again romances of two young pairs of Athenian lovers; a fateful rivalry between the King and Queen of the Fairies; and the theatrical aspirations of a bumbling troupe of Athenian laborers. It all ends happily in wedding-night revelry complete with a play-within-a-play presented by the laborers to the ecstatic amusement of all. This edition, complete with explanatory footnotes, is reprinted from a standard British edition.",
        "Category": " Drama , Shakespeare",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Networking For Dummies",
        "Authors": "By Lowe, Doug",
        "Description": "The latest on Web servers, wireless networks, and file sharing!Get going with hot tips on creating and managing large or small networksWhether you want to manage a mega-network, build a small business network, or just connect the PCs down the hall, this guide gives you what you need to know without giving you a headache. From getting started to upgrading to Windows .NET Server, incorporating Macs, and going wireless, it's networking made easy, fast, and fun!The Dummies WayExplanations in plain English\"Get in, get out\" informationIcons and other navigational aidsTear-out cheat sheetTop ten listsA dash of humor and fun",
        "Category": " Computers , Networking , General",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Pet Sitting for Profit: A Complete Manual for Professional Success",
        "Authors": "By Moran, Patti J.",
        "Description": "Author and petsitter extraordinaire Patti Moran updates and expands the tremendously successful 1993 version for the growing field of pet sitting. Designed for people at all levels of experience—from the person just starting out to the person who has established a business and wants to make it more successful—the book also focuses on how to make setting up a business as easy as possible, so people can operate on whatever scale they feel comfortable with. Pet sitting continues to grow at an extraordinary rate, and this book is for everyone who wants a chance to work with animals.",
        "Category": " Pets , Reference",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Assateague",
        "Authors": "By Wroten, William H.",
        "Description": "",
        "Category": " Travel , United States , General",
        "Publisher": "Cornell Maritime Pr/Tidewater Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1972"
        }
    },
    {
        "Title": "The Armchair Angler",
        "Authors": "By Reuther, David (EDT), Brykcznski, Terry, and Eliot, Bill (ILT)",
        "Description": "Fifty fiction and nonfiction tales for dedicated fishermen span three hundred years of writing, and include the works of Izaak Walton, Nick Lyons, Lewis Carroll, Herbert Hoover, Ted Williams, Norman Maclean, and others.",
        "Category": " Sports & Recreation , Fishing",
        "Publisher": "Bbs Pub Corp",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Castles: An Illustrated Guide to 80 Castles of England and Wales",
        "Authors": "By Oman, Charles William Chadwick, Sir",
        "Description": "",
        "Category": "",
        "Publisher": "Beekman House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1978"
        }
    },
    {
        "Title": "A Pocket Full of Pennies",
        "Authors": "By Amato, Rick",
        "Description": "Author and internationally known evangelist Rick Amato uses his own rich experiences to illustrate ten key character qualities that God calls His children to daily. Just as a penny has two sides, so do each of these qualitites have a flip side with an obstacle which must be overcome.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Beyond Ritalin:Facts About Medication and Strategies for Helping Children,: Adolescents, and Adults with Attention Deficit Disorders",
        "Authors": "By Spizman, Robyn Freedman, Garber, Stephen W., Ph.D., and Garber, Marianne Daniels, Ph.D.",
        "Description": "ADHD (attention deficit hyperactivity disorder) - and its treatment with the drug Ritalin - has become the focus of one of the most hotly debated health issues of the 1990s, with the controversy taking center stage in media accounts all over the country. But for the thousands of families of ADHD children, adolescents, and adults, it remains painfully difficult to get clear and authoritative answers to the many questions that this confusing disorder poses. Beyond Ritalin is based on hundreds of sources and over thirty years of research, and is the first book to explain in complete detail exactly how Ritalin affects individuals' social and organizational skills, distractibility, activity level, academic performance, and other areas of behavior.The authors of Beyond Ritalin, who are acknowledged experts on attention deficit disorders, provide a complete road map and guide for coping with ADHD.",
        "Category": " Psychology , Psychopathology , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Lu Ann Hampton Laverty Oberlander",
        "Authors": "By Jones, Preston",
        "Description": "",
        "Category": "",
        "Publisher": "Dramatists Play Service, Inc.",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "A Sigh for a Drumbeat",
        "Authors": "By DONCASTER, Patrick",
        "Description": "",
        "Category": "",
        "Publisher": "E.P.Dutton",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1948"
        }
    },
    {
        "Title": "The big tree champions of Maryland 1990",
        "Authors": "By Robert S. Prenger~Maureen T. Brooks",
        "Description": "",
        "Category": "",
        "Publisher": "Maryland Department of Natural Resources",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Hours of Jeanne D'Evreux, Queen of France",
        "Authors": "By cloisters",
        "Description": "",
        "Category": "",
        "Publisher": "The Metropolitan Museum of Art",
        "Price Starting With ($)": "15.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "From Gettysburg to the Gulf and beyond: Coping with revolutionary technological changes in land warfare (McNair papers)",
        "Authors": "By Dunn, Richard J",
        "Description": "",
        "Category": "",
        "Publisher": "Institute for National Strategic Studies",
        "Price Starting With ($)": "8.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Cultural Anthropology",
        "Authors": "By Haviland, William A.",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt College Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Natural history of the birds of eastern and central North America,",
        "Authors": "By Edward Howe Forbush",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin Company",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1939"
        }
    },
    {
        "Title": "Potatoes Not Prozac, A Natural Seven-Step Dietary Plan to Stabilize the Level of Sugar in Your Blood, Control Your Cravings and Lose Weight, and Recognize How Foods Affect the Way You Feel",
        "Authors": "By Desmaisons, Kathleen",
        "Description": "Can't say no to fattening foods, alcohol or compulsive behaviors?  You're not lazy, self-indulgent or undisciplined; you may be one of the millions of people who are sugar sensitive. Many people who suffer from sugar sensitivity don't even know it; they continue to consume large quantities of sweets, breads, pasta or alcohol. These foods can trigger feelings of exhaustion and low self-esteem, yet their biochemical impact makes sugar-sensitive people crave them even more. This vicious cycle can continue for years, leaving sufferers overweight, fatigued, depressed and sometimes alcoholic.  Now there is a solution: in Potatoes Not Prozac Dr. Kathleen DesMaisons gives you the tools you need to overcome sugar dependency, with self-tests to determine your sugar sensitivity as well as an easy-to-follow, drug-free program with a customized diet high in protein and complex carbohydrates. Join the thousands of people who have successfully healed their addiction to sugar, lost weight and attained maximum health and well-being by using Dr. DesMaisons's innovative plan.",
        "Category": " Health & Fitness , Nutrition",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Essential Guide to Vitamins and Minerals",
        "Authors": "By Somer, Elizabeth and Health Media of America Staff",
        "Description": "Explains the basics about nutrients and shows how information about individual nutrients can be organized into simple guidelines for dietary intake emphasizing the importance of designing a diet that provides optimal, not minimal, amounts of all vitamins and minerals. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Perennial (HarperCollins)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Among Friends",
        "Authors": "By Fisher, M. F. K.",
        "Description": "In this poetic, sensitive memoir, M. F. K. Fisher traces her life from birth through childhood into adulthood through memories of her loving family and their lives as outsiders in the Quaker community of Whittier, California. Recalling the people, passions, sounds, and scents of her childhood, with its kindnesses and quiet cruelties, Fisher also portrays her developing interests in literature, food, and cooking. Elegantly and invitingly written, Among Friends demonstrates the writer’s belief that “every lesson, every lecture listened to, must be interpreted into a personal dialect of human language, and that is what I keep trying to do.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "North Point Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "TAINTED TRUTH: The Manipulation of Fact in America",
        "Authors": "By Crossen, Cynthia",
        "Description": "In this age of information, sponsored studies have become America's most powerful and popular tool of persuasion. However, in Tainted Truth, we find out that much of what we learn from them is false. Although the studies and surveys wear the guise of objective science, their findings almost invariably reflect their sponsors' intentions. Most such research is designed with a certain outcome in mind, and it is all but guaranteed to achieve that outcome. The result is a compilation of information - the information used every day by voters, consumers and leaders.Manufactured truths dominate the American discourse in Congress, courtrooms, offices, newspapers, magazines and television. Studies have become the vehicle for polishing corporate images, influencing juries, shaping debate on public policy, selling commercial products and satisfying the media's - and the public's - voracious appetite for information. In this blistering expose, Cynthia Crossen shows how deeply this research world has been pervaded by artfully crafted deception - and how it affects us all.Crossen reveals how the manufacturers of silicone breast implants did not disclose information regarding the dangers of the implants; how the demise of the cloth-diaper industry was influenced by questionable statistics published by Procter & Gamble - the leading supplier of disposable diapers; how supermarkets across the country emptied their shelves of apples because of the Alar scare, initiated by highly disputed research from a publicity hungry environmental group; and how even the confirmation of Clarence Thomas to the Supreme Court was influenced by fast and biased polls.As information continues to lose its link to truth, we are all losing our ability to make informed decisions. Tainted Truth is an enormously important and provocative book that will change the way we make our decisions - decisions that have endangered our minds and, in some cases, our lives.",
        "Category": " Business & Economics , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "The Commanding Heights: the Battle Between Government & the Marketplace That Is Remaking the Modern World",
        "Authors": "By Yergin, Daniel and Stanislaw, Joseph",
        "Description": "Trillions of dollars in assets and fundamental political power are changing hands as free markets wrest control from government of the \"commanding heights\" - the dominant businesses and industries of the world economy. Daniel Yergin and Joseph Stanislaw demonstrate that words like \"privatization\" and \"deregulation\" are inadequate to describe the enormous upheaval that is unfolding before our eyes. Along with the creation of vast new wealth, the map of the global economy is being redrawn. Indeed, the very structure of society is changing. New markets and new opportunities have brought great new risks as well. How has all this come about? Who are the major figures behind it? How does it affect our lives?The collapse of the Soviet Union, the awesome rise of China, the awakening of India, economic revival in Latin America, the march toward the European Union - all are a part of this political and economic revolution. Fiscal realities and financial markets are relentlessly propelling deregulation; achieving a new balance between government and marketplace will be the major political challenge in the coming years. Looking back, the authors describe how the old balance was overturned, and by whom. Looking forward, they explore these equations: Will the new balance prevail? Or does the free market contain the seeds of its own destruction? Will there be a backlash against any excesses of the free market? And finally, The Commanding Heights illuminates the five tests by which the success or failure of all these changes can be measured, and defines the key issues as we enter the twenty-first century.The Commanding Heights captures this revolution in ideas in accounts of the history and the politics of the postwar years and tales of the astute politicians, brilliant thinkers, and tenacious businessmen who brought these changes about. Margaret Thatcher, Ronald Reagan, Deng Xiaoping, and Bill Clinton share the stage with the \"Minister of Thought\" Keith Joseph, the broomaker's son Domingo Cavallo, and Friedrich von Hayek, the Austrian economist who was determined to win the twenty-year \"battle of ideas.\" It is a complex and wide-ranging story, and the authors tell it brilliantly, with a deep understanding of human character, making critically important ideas lucid and accessible. Written with unique access to many of the key players, The Commanding Heights, like no other book, brings us an understanding of the last half of the twentieth century - and sheds a powerful light on what lies ahead in the twenty-first century.",
        "Category": " Business & Economics , Development , Economic Development",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "ICE AND IRON.",
        "Authors": "By Tucker, Wilson",
        "Description": "",
        "Category": "",
        "Publisher": "Garden City, New York, (1974), Doubleday & Company, Inc.",
        "Price Starting With ($)": "25.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Divided Lives",
        "Authors": "By Walsh, Elsa",
        "Description": "Divided Lives focuses on three extraordinary women - Meredith Vieira, a former correspondent working for CBS television's 60 Minutes and now at ABC; Rachael Worby, a conductor who is also the first lady of her state; and Dr. Alison Estabrook, the chief of breast surgery at the second largest hospital in the country.Knowing that women's lives do not always conform to the neat configurations of theories and social critiques, Elsa Walsh sought out the \"flesh and blood stories\" of real women as they faced landmark choices, decisions, and conflicts in their professional and personal lives. The result is a moving and often startling work that demonstrates how universal our struggles really are despite the variations in our circumstances.What is abundantly clear is that even in the lives of such successful women, the struggle with self-doubt and the conflicts between work and family that afflict the rest of us are still very much in force. And as Walsh poignantly concludes, if women with all the advantages are having trouble, then that says something important about the condition of women's lives overall.In Divided Lives, Elsa Walsh reveals a central theme of contemporary life and offers the comfort of shared understanding to every woman who is striving for balance in her life.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "At a Century's Ending: Reflections, 1982-1995",
        "Authors": "By Kennan, George Frost",
        "Description": "The Pultizer Prize and National Book Award-winning author of Around the Cragged Hill reflects on the political events and policies of latter part of the twentieth century, discussing the Cold War, recent changes in the former Soviet Union, and their implications.",
        "Category": " History , United States , 20th Century",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Kenya: A Novel",
        "Authors": "By Halkin, John",
        "Description": "In 1896, engineer John Andrews, accompanied by his young wife Hester, arrives to build the Uganda Railway through uncharted land and faces an unruly work force, disease, hostile climate, and resisting natives",
        "Category": " Fiction , General",
        "Publisher": "Beaufort Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "July",
            "Year": "1986"
        }
    },
    {
        "Title": "Parenting Today's Adolescent Helping Your Child Avoid The Traps Of The Pre-teen And Early Teen Years",
        "Authors": "By Rainey, Dennis, Rainey, Barbara, and Nygren, Bruce",
        "Description": "Normally confident moms and dads grow weak-kneed when their children enter--gasp!--puberty. Barbara and Dennis Rainey, parents of six teenage or older children, map out the unfamiliar, demanding landscape of both pre-adolescence (ages 10-12), as well as the teen years that follow.\"Preadolescence is when convictions are shaped; adolescence is when convictions are tested,\" they advise parents. InParenting Today's Adolescent the Raineys help children and parents build a satisfying relationship while forging a vision for a productive, God-honoring life-before, during, and after adolescence.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The Autobiography of Santa Claus",
        "Authors": "By Guinn, Jeff",
        "Description": "It all started when Jeff Guinn was assigned to write a piece full of little-known facts about Christmas for his paper,The Fort Worth Star-Telegram. A few months later, he received a call from a gentleman who told him that he showed the story to an important friend who didn’t think much of it. And who might that be? asked Jeff. The next thing he knew, he was whisked off to the North Pole to meet with this “very important friend,” and the rest is, well, as they say, history.An enchanting holiday treasure, The Autobiography of Santa Claus combines solid historical fact with legend to deliver thedefinitive story of Santa Claus. And who better to lead us through seventeen centuries of Christmas magic than good ol’ Saint Nick himself? Families will delight in each chapter of this new Christmas classic—one per each cold December night leading up to Christmas!",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Laws of Money, The Lessons of Life: Keep What You Have and Create What You Deserve",
        "Authors": "By Orman, Suze",
        "Description": "USA Today has called Suze Orman \"a force in the world of personal finance.\" For years, Suze has anticipated what you need to know and want to know about your money. Her books, radio and television shows, columns, and newsletter about personal finance have helped millions of people like you turn their financial lives around. The author of three consecutive runaway New York Times bestsellers, Suze is renowned for her unique brand of financial savvy, tell-it-like-it-is honesty, and dynamic motivational style, which propels her readers and audiences to change the course of their financial destiny. In this groundbreaking book, she continues to transform your relationship with money. Never before has there been a money book and life guide like The Laws of Money, the Lessons of Life. In a natural evolution of Suze's authoritative view of the world of money, and characterized by her straight talk, warmth, and humor, The Laws of Money, the Lessons of Life reveals a revolutionary new paradigm of personal finance. The 5 Laws of Money are vital principles that you need to know whether you are old or young, male or female, with or without money, a novice or a veteran investor. These five laws operate without exception -- at all times, in every culture -- and apply to everyone, as Suze shows in the compassionate stories adapted from real-life situations that she recounts throughout the book. And the universal truths and lessons contained within each law help you learn how to keep what you have and create what you deserve. Anyone can -- and must -- put these laws to use today in order to survive and thrive in these times of constant upheaval and financial turmoil. The Laws of Money, the Lessons of Life provides an eminently sensible, highly effective process for gaining control over your life and your money. Through pointed questions about your attitudes toward money, with insightful financial exercises and personal guidance, Suze deciphers the false hopes and fears that keep you from making smart, confident decisions and choices about your money. Her take-charge optimism and realistic action plans will jolt you out of any financial confusion or paralysis, whether you're beginning your career or at a midpoint, planning for or already in retirement. You will learn to assess your current spending, savings, and investments, and acquire a sure sense of what you can do with the money you have and the money you want to have. A thorough guidebook is included that helps you put the laws into immediate action and see their lessons manifest in your own life. Profound and practical, The Laws of Money, the Lessons of Life will help you get out of debt, create what you want, and protect your money, your family, and your future. With these laws as your guide, you can avoid ever being a financial victim again. USA Today has called Suze Orman \"a force in the world of personal finance.\" For years, Suze has anticipated what you need to know and want to know about your money. Her books, radio and television shows, columns, and newsletter about personal finance have helped millions of people like you turn their financial lives around. The author of three consecutive runaway New York Times bestsellers, Suze is renowned for her unique brand of financial savvy, tell-it-like-it-is honesty, and dynamic motivational style, which propels her readers and audiences to change the course of their financial destiny. In this groundbreaking book, she continues to transform your relationship with money. Never before has there been a money book and life guide like The Laws of Money, the Lessons of Life. In a natural evolution of Suze's authoritative view of the world of money, and characterized by her straight talk, warmth, and humor, The Laws of Money, the Lessons of Life reveals a revolutionary new paradigm of personal finance. The 5 Laws of Money are vital principles that you need to know whether you are old or young, male or female, with or without money, a novice or a veteran investor. These five laws operate without exception -- at all times, in every culture -- and apply to everyone, as Suze shows in the compassionate stories adapted from real-life situations that she recounts throughout the book. And the universal truths and lessons contained within each law help you learn how to keep what you have and create what you deserve. Anyone can -- and must -- put these laws to use today in order to survive and thrive in these times of constant upheaval and financial turmoil. The Laws of Money, the Lessons of Life provides an eminently sensible, highly effective process for gaining control over your life and your money. Through pointed questions about your attitudes toward money, with insightful financial exercises and personal guidance, Suze deciphers the false hopes and fears that keep you from making smart, confident decisions and choices about your money. Her take-charge optimism and realistic action plans will jolt you out of any financial confusion or paralysis, whether you're beginning your career or at a midpoint, planning for or already in retirement. You will learn to assess your current spending, savings, and investments, and acquire a sure sense of what you can do with the money you have and the money you want to have. A thorough guidebook is included that helps you put the laws into immediate action and see their lessons manifest in your own life. Profound and practical, The Laws of Money, the Lessons of Life will help you get out of debt, create what you want, and protect your money, your family, and your future. With these laws as your guide, you can avoid ever being a financial victim again.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Alfred Portale Simple Pleasures: Home Cooking from the Gotham Bar and Grill's Acclaimed Chef",
        "Authors": "By Friedman, Andrew, Portale, Alfred, and Gotham Bar and Grill (COR)",
        "Description": "When you imagine the quintessential New York City restaurant, one name comes to mind: Alfred Portale's Gotham Bar and Grill. The same is true when you think of the top American restaurants:Gotham has been one of our most cherished culinary institutions for two decades.Led by executive chef and co-owner Alfred Portale, Gotham has been honored with four consecutive New York Times three-star reviews and has resided among the Zagat Survey's top five New York City restaurants for more than ten years. Known for Portale's defining modern American cooking, impeccable service, and soaring space, Gotham was recently named \"Most Outstanding Restaurant\" in the nation by the James Beard Foundation.But what does Portale cook when he's not working? In Alfred Portale Simple Pleasures, one of our most accomplished chefs invites you to taste the sublime and surprisingly easy-to-prepare, restaurant-quality dishes he serves to friends and family at home.The 125 recipes include home versions of Gotham classics as well as new recipes straight from Portale's home kitchen. They're all simple enough for any home cook, and spectacular enough to impress anyone who tastes them.At the center of Alfred Portale Simple Pleasures are elemental main courses such as Roast Cod with a New England Chowder Sauce, Filet Mignon with Madeira Sauce, and Sautéed Chicken Breasts with Button Mushrooms and Sage. Pick one, then build a meal by pairing it with recipes from the chapters of  salads, starters, and small plates; soups, sandwiches, and pizzas; pasta and risotto; side dishes; and desserts.Along with the recipes, Portale offers pairing suggestions for building a menu, variations for adapting recipes according to season and personal taste, and flavor-building instructions on how to accent a dish with extravagant extras such as caviar or everyday additions such as flavored oils.  In other words, home cooks will learn how to add a Gotham-inspired twist to their own favorite recipes.The supermarket-friendly dishes include modern classics such as Spicy Shrimp Salad with Mango, Avocado, and  Lime Vinaigrette; Pumpkin and Caramelized Onion Soup with Gruyère and Sage; and Sautéed Spinach with Garlic, Ginger, and Sesame Oil. Alfred helps you transform everything from ordinary weekday lunches to Saturday night dinner parties into anything but ordinary.Of course, no meal is complete without dessert, and Portale delivers sweet and sophisticated send-offs, including Lime Meringue Tarts, a simple Summer Plum Pudding, and an elegant Chocolate-Grand Marnier Cake.Alfred Portale Simple Pleasures -- nothing could be simpler or more pleasurable.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "The Honorable Mr. Marigold: My Life With Everett Dirksen.",
        "Authors": "By Dirksen, Louella",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "19.71",
        "Publish Date": {
            "Month": "May",
            "Year": "1972"
        }
    },
    {
        "Title": "Full Court Press",
        "Authors": "By Lupica, Mike",
        "Description": "When the owner of the worst pro basketball team in the world decides to sign Dee Gerard, the first woman ever to play in the NBA, chaos ensues as Dee tries to play the best game there is while spoiled young millionaires, personal and professional relationships, and the press wreak havoc on her life, in a rollicking and hilarious new novel by the author of Bump and Run. 125,000 first printing.",
        "Category": " Poetry , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "7.13",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "L.L. Bean Outdoor Photography Handbook",
        "Authors": "By Rowinski, Jim and Rowinsky, Kate",
        "Description": "Outlines fundamentals of understanding light, gives tips on equipment, film, exposure, storage, and display, and offers in-depth advice on photographing landscapes, close-ups, people in the outdoors, and wildlife, paying close attention to the challenges and hazards presented by natural conditions. Color photos illustrate proper and incorrect technique.  Thorough enough for aspiring professionals and useful even for casual amateurs. Jim Rowinski was director of fly fishing at L.L.  Bean and taught Bean's photography classes.  Kate Rowinski is a catalog consultant and author of children's books. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Photography , Subjects & Themes , Plants & Animals",
        "Publisher": "The Lyons Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Jenny Craig's Simple Pleasures: Recipes to Nourish Body and Soul",
        "Authors": "By Craig, Jenny and Wyatt, Nancy Fitzpatrick",
        "Description": "With Simple Pleasures Jenny strives to make your life less complicated and more enjoyable. By encouraging you to appreciate life's simple pleasures, she's laying the foundation for you to take charge of your own life and gain self-confidence and inner peace.In this book, nearly 150 healthfully lightened recipes and scores of insightful tips help you plan, shop, prepare, and present Jenny's personal favorites. Whether you're preparing Simple Beef Stroganoff (page 114) or Malibu Brownie Torte (page 86), taking a relaxing bath by candlelight, or expressing your thoughts in a personal journal, Simple Pleasures can be your guide to self-fulfillment.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Global Habit: The Drug Problem in a Borderless World",
        "Authors": "By Stares, Paul B.",
        "Description": "The market for illicit drugs is expanding inexorably around the world. More kinds of drugs are becoming more available in more places than ever before. But the drug trade is not only growing, it is changing in character. It has ceased to be a marginal area of criminal activity and has now become a major global enterprise controlled by formidable interests that threaten much more than the health of drug users. Moreover, the immense wealth that has been amassed from selling drugs has given the principal trafficking organizations enormous power to corrupt and intimidate public officials and government institutions.In this major book, Paul Stares presents a compelling portrait of the global drug market and the consequences of this international plague. He explains that there are good reasons to fear that the global market for drugs will continue to expand in the coming years: profits to the traffickers are huge; the revolutionary advances in communications, transportation, and information technology facilitate smuggling, as do the lowering of border controls and trade tariffs and the trends toward privatization and deregulation. Meanwhile, the expanded volume of global trade, travel, and financial transactions makes it harder for customs and police authorities to detect and stop illicit activities. Added to the growing incentives and opportunities to supply illicit drugs, the level of demand is increasing in many new areas of the world, particularly in formerly communist countries and many areas of the developing world.What can done about this growing problem? One option is legalization, but Stares contends that its implementation would be problematic while its benefits remain unclear. Yet, continuing on the present course will not work either. Stares argues that reducing both the supply and demand for illicit drugs requires a fundamental shift away from the current overwhelming emphasis on negative sanctions to deter and deny their production, trafficking, and consumption. Instead, he calls for more positive control measures that primarily rely on persuasion and cooperation. He advocates the creation of a global drug monitoring and evaluation network, a global drug use prevention program, a global drug treatment training program, and an international drug crisis response program.According to Stares, the effectiveness of reorienting drug control policy to curb the global habit will ultimately depend on the international community's willingness to address much larger concerns to which the drug problem is inextricably linked-- including overpopulation, environmental degradation, poverty, illiteracy, ethnic strife, and disease. Only by recognizing the fundamental relationship between these larger issues and the global drug problem can meaningful progress be made.  Selected by Choice as an Outstanding Book for 1996",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Mansfield Park (Oxford World's Classics)",
        "Authors": "By Austen, Jane, Kinsley, James (EDT), and Kinaley, James",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Computer Wars: The Fall of IBM and the Future of Western Technology",
        "Authors": "By Morris, Charles R. and Ferguson, Charles H.",
        "Description": "An analysis of America's place in the computer industry presents the optimistic theory that small, maverick computer companies have been picking up the slack for such companies as IBM and have been keeping America in the game. 15,000 first printing.",
        "Category": " Computers , Social Aspects , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Ages and Stages: Developmental Descriptions and Activities, Birth Through Eight Years",
        "Authors": "By Miller, Karen",
        "Description": "",
        "Category": "",
        "Publisher": "Telshare Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1985"
        }
    },
    {
        "Title": "Arabia The Gulf & The West",
        "Authors": "By B. J. Kelly",
        "Description": "",
        "Category": "",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1980"
        }
    },
    {
        "Title": "Deficit Dilemma: Budget Policy in the Reagan Era (The Changing Domestic Priorities Series)",
        "Authors": "By Palmer, John Logan and Mills, Gregory B.",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Urban Inst Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "DC almanac: The Washington, DC area's native wisdom",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Diamond City Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Surviving the Breakup",
        "Authors": "By Judith S. Wallerstein, Joan Berlin Kelly",
        "Description": "",
        "Category": "",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "Tommytown",
        "Authors": "By Saunders, Robert L.",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "1st Book Library",
        "Price Starting With ($)": "7.97",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Man and Nature Anthropological Essay In Hu",
        "Authors": "By Watson, Richard A.",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt, Brace & Co.",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Broadway musicals",
        "Authors": "By Gottfried, Martin",
        "Description": "",
        "Category": "",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "11.24",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Wouldn't Take Nothing for My Journey Now",
        "Authors": "By Angelou, Maya",
        "Description": "A collection of wise and inspirational messages from the author of I Know Why the Caged Bird Sings distills her thoughtful insights into such topics as Friendship, Grace, Spirit, Family, and Healing. 250,000 first printing. Tour.",
        "Category": " Literary Criticism , American , African American",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Sparrows Point : Making Steel--The Rise and Ruin of American Industrial Might",
        "Authors": "By Mark Reutter",
        "Description": "",
        "Category": "",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "For God and Country: Faith and Patriotism Under Fire",
        "Authors": "By Yee, James and Molloy, Aimee",
        "Description": "In 2001, Captain James \"Yusuf\" Yee was commissioned as one of the first Muslim chaplains in the United States Army. After the tragic attacks of September 11, 2001, he became a frequent government spokesman, helping to educate soldiers about Islam and build understanding throughout the military. Subsequently, Chaplain Yee was selected to serve as the Muslim Chaplain at Guantanamo Bay, where nearly 700 detainees captured in the war on terror were being held as \"unlawful combatants.\"  In September 2003, after serving at Guantanamo for ten months in a role that gave him unrestricted access to the detainees--and after receiving numerous awards for his service there--Chaplain Yee was secretly arrested on his way to meet his wife and daughter for a routine two-week leave. He was locked away in a navy prison, subject to much of the same treatment that had been imposed on the Guantanamo detainees. Wrongfully accused of spying, and aiding the Taliban and Al Qaeda, Yee spent 76 excruciating days in solitary confinement and was threatened with the death penalty.  After the U.S. government determined it had made a grave mistake in its original allegations, it vindictively charged him with adultery and computer pornography. In the end all criminal charges were dropped and Chaplain Yee's record wiped clean. But his reputation was tarnished, and what has been a promising military career was left in ruins.  Depicting a journey of faith and service, Chaplain Yee's For God and Country is the story of a pioneering officer in the U.S. Army, who became a victim of the post-September 11 paranoia that gripped a starkly fearful nation. And it poses a fundamental question: If our country cannot be loyal to even the most patriotic Americans, can it remain loyal to itself?",
        "Category": " Religion , Islam , General",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Fighting Words: Writers Lambast Other Writers--From Aristotle to Anne Rice",
        "Authors": "By Charlton, James (EDT) and Pericoli, Tullio (ILT)",
        "Description": "Illustrations by Tullio Pericoli. A lively collection of classic zingers from the mouths and pens of authors. \"Who's better at being nasty than writers on other writers?\"--The New York Times Magazine. A BOOK-OF-THE-MONTH CLUB and WRITER'S DIGEST BOOK CLUB selection. Illustrations by Tullio Pericoli",
        "Category": " Literary Criticism , Reference",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Between Myth and Morning Women Awakening",
        "Authors": "By Janeway, Elizabeth",
        "Description": "",
        "Category": "",
        "Publisher": "Morrow, William Company In",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Drywall: Professional Techniques for Walls & Ceilings (Fine Homebuilding DVD Workshop)",
        "Authors": "By Ferguson, Myron R.",
        "Description": "This revised version of Drywall gives readers information on new tools and materials and techniques that Myron has field-tested since the last revision in 2008. For the first time the book also includes a bound-in DVD with tips and techniques for hassle-free drywall installation. Drywall, 4th Edition, offers the very latest information with the familiar easy-to-use format that made the first three editions such great successes.Learn how to:Choose the right drywall for the jobHang, tape, and finish drywall like the prosWork with the new cornerbead productsRepair damaged walls and ceilingsPrep drywall for paint and textured finishes",
        "Category": " Technology & Engineering , Construction , Contracting",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Writing for Children and Teenagers",
        "Authors": "By Wyndham, Lee and Madison, Arnold",
        "Description": "Helps aspiring authors of books for children and teenagers achieve publication, discussing characterization, plot, dialogue, and endings as well as marketing, research, and editing",
        "Category": " Reference , Writing Skills",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    }
]