[
    {
        "Title": "The terrible thing that happened at our house",
        "Authors": "By Blaine, Marge",
        "Description": "",
        "Category": "",
        "Publisher": "Parents Magazine Press",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Decks, Porches, and Patios (Home Repair and Improvement, Updated Series)",
        "Authors": "By Hor",
        "Description": "Demonstrates each step in constructing a patio, deck, or porch, and discusses tools, materials, and techniques",
        "Category": " House & Home , Outdoor & Recreational Areas",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "A Passion for Flowers",
        "Authors": "By Black, Penny and Hurst, Jacqui (ILT)",
        "Description": "Forty original ideas for ways to use fresh, dried, and pressed flowers are divided into seasons and photographed in still-life settings around the author's rural Cornwall cottage. 25,000 first printing.",
        "Category": " Art , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "The Splendor of Dresden: Five Centuries of Art Collecting",
        "Authors": "By National Gallery of Art (U.S.), Fine Arts Museums of San Francisco, and Metropolitan",
        "Description": "",
        "Category": "",
        "Publisher": "Metropolitan Museum of Art",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Decks: Planning, Designing, Building",
        "Authors": "By Cory, Steve",
        "Description": "Decks: Planning, Designing, Building is a new book that replaces Creative Homeowner's strong-selling titleDecks: Plan, Design, Build. Hundreds of step-by-step color photographs illustrate the process of building a deck. The writing is clear and concise, yet friendly. Readers will feel as though they are being lead through the deck-building process by a friend who happens to be a professional builder. They will learn not only how to design the perfect deck, but all about the building process as well. Cory gives the reader advice on generating ideas, selecting materials, and using tools. Color photos illustrate examples of decks that work in various situations. How-to sequences take the reader step-by-step through laying out, building, and finishing. The book provides three different deck projects complete with plans and materials lists. With this complete book, even the novice builder will be equipped to build one of the three plans provided, or design and build his own original deck.",
        "Category": " House & Home , Design & Construction",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Simple Handmade Storage",
        "Authors": "By Philip Haxell, Kate Haxell",
        "Description": "",
        "Category": "",
        "Publisher": "Laurel Glen Publishing",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Chrismas Crafts and Entertaining: Fun Projects & Gifts plus Great Recipes",
        "Authors": "By The Editors of Creative Publishing international",
        "Description": "Christmas Crafts & Entertaining is full of unique projects, tasty recipes, and innovative ideas to help you decorate your home and extend Yuletide hospitality. Beautiful full-color photography will inspire you and lead you step-by-step through many craft projects for your home, decorations for your Christmas tree, gifts for your family and friends, and spirited table decor for your holiday entertaining. Mouthwatering recipes with tempting photography show how easy it is to make memorable meals or special holiday treats.",
        "Category": " Crafts & Hobbies , Holiday & Seasonal",
        "Publisher": "Creative Publishing International",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Stradella (Traveller's companion series)",
        "Authors": "By Sherwood, James",
        "Description": "",
        "Category": "",
        "Publisher": "New English Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Top Tips from Senior Pros",
        "Authors": "By Miller Barber~Desmond Tolhurst",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "On This Day",
        "Authors": "By Bellows, Nathaniel",
        "Description": "Warren is eighteen. His sister, Joan, is twenty. Their father has died of cancer, and their mother has committed suicide -- they're on their own, in a small coastal town in Maine, under desperate emotional circumstances, with the holidays approaching.Their situation worsens as their father's partner ruthlessly strips them of financial interest in the plant nursery they had owned together and a ghoulish uncle and aunt try to exploit them. Things grow even more complicated as Warren becomes increasingly puzzled by his attraction to a beautiful young single mother who used to work for his father.Told from Warren's point of view, On This Day is not only a moving story of two young people's struggle to make a place and a home for themselves, but a consideration of memory -- the necessity to face the secrets of a family's dark past in order to exorcise them.",
        "Category": " Fiction , Literary",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Ultimate Opera Quiz Book",
        "Authors": "By Harris, Ken",
        "Description": "The reader's knowledge of facts and trivia concerning opera composers, plots, and star performers is tested by more than 1,600 questions",
        "Category": " Music , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1982"
        }
    },
    {
        "Title": "The Bartender's Standard Manual: Over 700 Classic Recipes",
        "Authors": "By Powell, Fred",
        "Description": "Over 700 recipes for mastering the science of skillfully mixing drinks.  Will make anyone an expert bartender.  Alphabetically arranged.",
        "Category": " Cooking , Beverages , Bartending",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "The ACADEMY",
        "Authors": "By Ruggero, Ed",
        "Description": "Once in a generation, a novel captures the full scope and drama of the U. S. military experience, with characters and conflicts that come unforgettably to life. Now Ed Ruggero, who \"writes about wars and warriors with the same I-have-been-there, no-nonsense authority as Hemingway\" (Col. David H. Hackworth, USA [Ret.], New York Times bestselling author of About Face), draws from his twenty-year association with West Point, the U.S. Military Academy, too create a classic for our time: a tale of probing authenticity and unrelenting suspense that takes us behind the stone walls and into the inner sanctums of one of the Army's most revered institutions.  A bitter wind is blowing from Washington across West Point, and Major Tom Gates?a muddy-boots soldier ill at ease in a spit-and-polish world?is about to face a battle more brutal than any he has ever known. It began with an all-to-human mistake?Gates had too much to drink and pushed a cadet too far?and it will explode into a political firestorm that could leave careers, lives, and West Point itself, in ruins.  Senator Lamar Bruckner has his eye on the White House, but his target is West Point. He flagrantly condemns the Academy as a waste of taxpayer money, a military ivory tower?and Gates' momentary lapse in judgement is the first charge in a smear campaign that could propel Bruckner to the presidency. Caught in the middle of Bruckner's manhunt is Wayne Holder, a fourth-year cadet, whose golden surfer looks and reputation as a ladies' man are far from the pristine image of the Long Gray Line. But for Holder to join that line, he faces a private conflict between honor and desire?upon which the ultimate fate of the Academy rests. Now, enemy lines are drawn in a war of political motives and personal emotion that touches many lives...  Kathleen Gates, Tom's wife, is as calculating as her husband is bullheaded, and she will use any weapon to protect him. Bruckner's aide, Claude Braintree, has come to West Point to further the senator's career?and will exploit the Academy to do it. Alex Trainor, a cadet from the heartland, is trapped in a personal crisis that shatters his conservative ideals. And Brigadier General David Simon dreams of taking control of the Point to re-create it in his own image.  In The Academy, Ed Ruggero brilliantly captures the honor and the controversy, the glory and the human flaws of West Point and its people. With prose as crisp as a flag snapping in th wind, this thrilling portrayal will resonate long after the last page is turned.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "The Stone Flower Garden: A Novel",
        "Authors": "By Smith, Deborah",
        "Description": "Childhood friends torn apart by an unsolved murder, Darleen Union and Eli Wade are reunited years later as the dark secrets of the past finally come to light, in a lyrical Southern Gothic novel by the author of On Bear Mountain. 75,000 first printing.",
        "Category": " Fiction , General",
        "Publisher": "Little & Brown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "The Jazz Bird: A Novel",
        "Authors": "By Holden, Craig",
        "Description": "An exquisitely written novel of love and betrayal, of money and power, set at the apex of that time of glitz and innocence known as the Jazz Age  CINCINNATI, 1927...  Lawyer George Remus became the country's biggest bootlegger, grossing over$80 million until his arrest. Upon his release from prison, he learns that his beautiful wife, Imogene, has left him and that his bank accounts are empty. On the morning of their divorce, he runs her car off the road in the middle of rush hour in Eden Park and shoots her to death.  Shocked and fascinated by this horrible crime, the country gears up for a sensational trial pitting the man known as \"the king of the bootleggers\" against Chief Prosecutor Charlie Taft, the youngest son of the former president. The trial is a national spectacle, a lens focused on the fabulous rise and fall of the Remus empire and the tragic love story within it, and an attempt to answer some tantalizing questions: What actually happened to the fortune? What are the motives of the federal agent who brought Remus down? What complex emotions and desires, leading ultimately to the ruin of three men, really lie within the heart of the woman known as the Jazz Bird?  Based on a true story, The Jazz Bird is at once a love story, a crime novel, and the tale of the courtroom battle between two powerful men whose respective futures hang in the balance.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.24",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Sullivan's Justice",
        "Authors": "By Rosenberg, Nancy Taylor",
        "Description": "When her brother is accused of murdering his girlfriend, Ventura County Probation officer Carolyn Sullivan sets out to clear his name, only to discover that evidence links him to one of the most dangerous criminals she has ever enountered and to the murders of nine people.  125,000 first printing.",
        "Category": " Fiction , Legal",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "A Call for Freedom: Words of Inspiration from America's Presidents",
        "Authors": "By Curtis, Bryan (EDT)",
        "Description": "\"Liberty, when it takes root, is a plant of rapid growth. \" -George WashingtonFreedom is something to work for - something to celebrate - something toboast about - and something to treasure.A Call for Freedom is acollection of more than 200 quotes from the Presidents of the United Statescelebrating freedoms we enjoy and, hopefully, do not take for granted. This is awonderful gift book for parents and grandparents to give children to impart to them how fortunate we are to be free men and women.\"Those who deny freedom deserve it not for themselves; and under a justGod, cannot long retain it.\" -Abraham Lincoln\"Peace is more than just the absence of war. True peace is justice. Truepeace is freedom. And true peace dictates the recognition of human rights.\"-Ronald Reagan",
        "Category": " History , Reference",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "How to Behave So Your Children Will Too!",
        "Authors": "By Severe, Sal",
        "Description": "A teacher, counselor, and psychologist argues that a child's behavior is frequently the result of parents' behavior and attitudes and explains how positive reinforcement of good behavior can hold the key to raising self-disciplined, responsible, and well-behaved children. 60,000 first printing. BOMC & QPB.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "The Ultimate Low-Fat Mexican Cookbook: All The Flavor Without All The Guilt",
        "Authors": "By Greer, Anne Lindsay",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , Mexican",
        "Publisher": "Gulf Publishing Company",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Day Trips in Delmarva",
        "Authors": "By Fisher, Alan",
        "Description": "",
        "Category": " Travel , Reference",
        "Publisher": "Rambler Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Dream Weaver",
        "Authors": "By Spinka, Penina Keen",
        "Description": "Fans of Jean Auel will love this series that began with Picture Maker, a book called \"an absorbing adventure tale...brought to life through the eyes of [Spinka's] courageous heroine\", Library Journal crowned it \"absolutely fascinating.\"  Publishers Weekly called Picture Maker \"an absorbing adventure tale...brought to life through the eyes of [Spinka's] courageous heroine.\" Library Journal crowned it \"absolutely fascinating.\" Now Penina Keen Spinka once again sweeps readers back nearly a thousand years...to a time when the Vikings crossed the vast oceans in search of a new homeland, and a place--the majestic wilds of North America--bitterly divided by blood and war.  In the four years since Picture Maker and her loved ones were driven north, many changes have come to a people and a land. The long, arduous journey that took Picture Maker from a young Indian separated from her tribe to a bride of Halvard has come to an end. It falls to Halvard and their daughter, Ingrid, an emerging woman, to return to Greenland and reclaim their home. Here, their Norse traditions are rejected by the newly Christian community, where an infestation of beautiful rare butterflies has resulted in plunder and bloodshed. Forced to wander once more, the family takes refuge with the Inuits, who have proven to be allies in the past. But Ingrid, answering the powerful call of her mother's blood, soon embarks on another journey-one that takes her to a far-off land, where her true destiny awaits.  Breathtaking in scope and historical detail, this is a sprawling adventure in the grand tradition of Jean M. Auel and Jane Smiley by a gifted author who writes \"unique and remarkable stories\" (Anna Lee Waldo, author of Circle of Stones and Sacajawea).",
        "Category": " Fiction , Literary",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Complete Idiot's Guide to the Pilates Method",
        "Authors": "By Karter, Karon",
        "Description": "Explains the Pilates attitude, technique, equipment, and the importance of posture and diet, and discusses how to teach others the Pilates method.",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "A Woman's Book of Life: The Biology, Psychology, and Spirituality of the Feminine Life Cycle",
        "Authors": "By Borysenko, Joan",
        "Description": "A biologist and psychologist from Harvard Medical School examines the link between mind, body, and spirit in women, and shows how females can increase their levels of health and well-being, and explore the power present in each stage of life. Reprint.",
        "Category": " Psychology , General",
        "Publisher": "Riverhead Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Family Affair: Buffy Finds a Star",
        "Authors": "By Bond, Gladys Baker",
        "Description": "",
        "Category": "",
        "Publisher": "Whitman",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Fit Not Fat at 40-Plus: The Shape-Up Plan That Balances Your Hormones, Boosts Your Metabolism, and Fights Female Fat in Your Forties--And Beyond",
        "Authors": "By Prevention editors",
        "Description": "A guide to fitness for women over forty describes the causes of midlife weight gain and explains how to avoid them, presenting diet strategies, an exercise plan, a fitness self-assessment test, and nutritional ratings.",
        "Category": " Health & Fitness , Diet & Nutrition , Weight Loss",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "NYPD: A City and Its Police",
        "Authors": "By Lardner, James, Lardner, John, and Reppetto, Thomas",
        "Description": "An insider takes us behind the blue wall of America's biggest, baddest police forceFounded in 1845, the NYPD is the biggest municipal police force in the world, the oldest in the land, and the model on which the others-for better or worse-have patterned themselves. The authors-two seasoned experts of police operations-unearth the hidden truths behind the headline-making stories and explain how cops privately interpret incidents such as the shooting of Amadou Diallo and the Louima torture case. Episodes long forgotten-the campaign against German saboteurs in WWI, or the career of Joe Petrosino, the first Italian American in the ranks, who was gunned down in the streets of Palermo, Sicily-reveal an organization constantly fraught with turmoil, where an outward display of law and order belies the inner conflicts between politicos, bureaucrats, and the men and women on the beat.Beyond the inner life of a remarkable institution are the characters and stories, including baffling mysteries, horrific crimes, inspiring heroics, and dreadful scandals. NYPD illuminates the old maxim of the vet to the rookie on his first night on patrol: \"Forget everything you learned in the academy, kid.\"Timely and sure to be controversial, NYPD will be essential reading for anyone interested in law enforcement in America.",
        "Category": " Political Science , Law Enforcement",
        "Publisher": "Henry Holt and Co.",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Thin for Life: 10 Keys to Success from People Who Have Lost Weight & Kept It Off",
        "Authors": "By FLETCHER, Anne M.",
        "Description": "Thin for Life is the first book to consult the real weight-loss experts.  It brings together the tried-and-true methods used by hundreds of men and woman who have maintained at least a 20-pound weight loss for three years.  The book weaves their inspiring stories with the latest scientific findings on the subject and includes all the necessary tools to put you on the road to permanent weight loss.",
        "Category": " Health & Fitness , Weight Loss",
        "Publisher": "Chapters Pub Ltd",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Food Smart: Savory Strategies to Defy Disease (Women's Edge Health Enhancement Guides)",
        "Authors": "By Berg, Susan G.",
        "Description": "",
        "Category": " Health & Fitness , Women's Health",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Death by Hollywood: A Novel",
        "Authors": "By Bochco, Steven",
        "Description": "\"There used to be a writer by the name of Merle Miller, who wrote that people in Hollywood are always touching you - not because they like you, but because they want to see how soft you are before they eat you alive.\" So begins this novel by Steven Bochco, in which a down-on-his-luck screenwriter named Bobby Newman tries to turn a brutal murder into his next movie payday.One day, while spying on his Hollywood Hills neighbors through his $4,000 Bushnell XR90 electronic telescope, Bobby sees a beautiful socialite making love to a handsome Latin actor named Ramon. When their pillow talk takes a turn for the ugly, Bobby watches in horror as the woman bludgeons her lover to death with his own acting trophy. Deciding to write about it instead of reporting it to the cops, Bobby insinuates himself into Detective Dennis Farentino's murder investigation, forging an unusual friendship with the cop that turns out to be more complex than either of them had bargained for. Before long, Bobby has dragged the detective, his estranged wife, his lover, and his agent into a Hollywood funhouse hall of mirrors, where only the most manipulative player will survive.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Oxford Illustrated History of Britain",
        "Authors": "By Morgan, Kenneth O. (EDT)",
        "Description": "This beautifully illustrated volume tells the story of Britain and its peoples over two thousand years, from the coming of the Roman legions to the present day.  Encompassing political, social, economic, and cultural developments throughout the British Isles, the dramatic narrative is taken up by ten leading historians who offer the fruits of the best modern scholarship to the general reader in authoritative form, illuminating their text with carefully chosen pictures and maps. A vivid, sometimes surprising picture emerges of continuous turmoil and change in every period of Britain's history.  By exploring the many ways in which Britain has shaped and been shaped by contact with Europe and the Wider world, this comprehensive book brings the modern reader face to face with the past and thus the foundations of modern British society.",
        "Category": " History , Europe , Great Britain",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "7.59",
        "Publish Date": {
            "Month": "December",
            "Year": "1986"
        }
    },
    {
        "Title": "Ancients of Days: The Second Book of Confluence",
        "Authors": "By McAuley, Paul J.",
        "Description": "A young man, the last remaining scion of the Builders, is caught in the middle of the civil war threatening Confluence, as he becomes a living symbol of age-old prophecies, a potential weapon, and the focus of ancient powers that will do anything to control all life on Confluence. 10,000 first printing.",
        "Category": " Fiction , Science Fiction , Adventure",
        "Publisher": "Eos",
        "Price Starting With ($)": "10.41",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Sin",
        "Authors": "By Hart, Josephine",
        "Description": "Driven by her obsession with Elizabeth, her cousin who was orphaned as an infant and has been raised by Ruth's parents, Ruth awaits the moment at which she will be able to destroy her nemesis. By the author of Damage. Tour.",
        "Category": " Fiction , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "The Dark Bride: A Novel",
        "Authors": "By Restrepo, Laura and Lytle, Stephen A.",
        "Description": "Already an international bestseller, Laura Restrepo's transcendent new novel is now available in the United States. One of the most provocative writers to emerge from the rich Latin American literary scene, Laura Restrepo is an author whose sensuous mix of realism and imaginative storytelling has made her an international bestseller. Her newest work, The Dark Bride, is a slyly humorous yet poignant love story. It was sparked by a photograph (shown on the jacket) taken by the late Colombian master, Leo Matix, of a sensual woman shrouded in mystery. Restrepo discovered the photo unexpectedly during her investigation into the rapacious workings of an American-controlled Columbian oil company and was immediately compelled to imagine the subject's life through a novel. Using a series of subtly textured interviews, Restrepo's journalist protagonist mines a rich trove of characters -- fortune hunters, guerrilla chiefs, refinery workers, and prostitutes -- who, together with the narrator, attempt to decipher the impulsive and mysterious life of the young Sayonara, the unlikely heroine of The Dark Bride. Drawn like an exotic moth to work beneath on of the colored lights of La Catunga, the local house of prostitution, Sayonara is enigmatic and arrogant beyond her years. Her Indian origins a puzzle, she is transformed by her sage madam, the surprisingly maternal Todos los Santos, into the queen of her squalid Colombian barrio. Each month, Sayonara charms the oil workers of the Tropical Oil Company, who have journeyed down from the mountains searching for some earthly bliss. But it is not just oil workers who are captivated by Sayonara. She is also the flame that draws an unpredictable mix of haunting characters into the tragicomic obsession that is her life -- from Sacramento, the childhood playmate who is determined to rescue Sayonara from her unorthodox life, to the stranger Payanés, who is her one true love and carries secrets of his own. Sayonara is the Dark Bride who subtly reveals a personal and political universe forever marked by her passing. Perceptive, richly detailed, yet effortlessly told, The Dark Bride is luminous and unforgettable.",
        "Category": " Fiction , Literary",
        "Publisher": "Ecco",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Savoring the Day: Recipes And Remedies To Enhance Your Natural Rhythms",
        "Authors": "By Hurley, Judith Benn",
        "Description": "MODERN SCIENCE has confirmed what the ancients knew centuries ago: The subtle daily changes in our bodies dramatically affect how we work, play, sleep, feel, and heal. In Savoring The Day, food and health authority Judith Benn Hurley combines ancient wisdom with cutting-edge science and great culinary taste--bringing it all home to our contemporary kitchens and busy lives. She shares more than 250 delicious recipes and a treasury of natural remedies designed to complement your body's rhythms and help you be at your best through out the day. PART ONE: RECIPES FOR SAVORING THE DAY is divided into the six different times of the day and is filled with recipes (including seasonal variations) and remedies herbal teas, yoga postures, self-massage tips, and aromatherapy ideas-to help you feel energized, de-stress, stay healthy, and sleep soundly. Try Pear and Buckwheat Pancakes or Cherry-Vanilla Granola for wide-awake mornings, Grilled Chicken Sandwiches with Sesame and Chives and lemon balm tea to beat the afternoon blahs; Penne with Roasted Garlic and Artichokes or Soft Tacos with Spicy Summer Vegetables for nutrient-rich dinners; and Strawberry-Rhubarb Crisp or Cool Melon Ice for immune enhancing desserts. PART TWO: REMEDIES FOR SAVORING THE DAY provides remedies to alleviate common ailments-many are linked to the seasons or to the body's cycles-including arthritis, colds, headache, hay fever, jet lag, depression, dry skin, and more. Enjoy a few drops of eucalyptus oil in the bottom of your morning shower to relieve congestion, a two-minute self-massage technique to banish anxiety, or cooling hibiscus and peppermint tea to soothe irritability. Filled with stories of Hurley's exotic travels in search of new tastes and healing ideas, Savoring the Day will let you discover the delights of a more attuned way of life.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "7.1",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "I Am What I Ate...and I'm Frightened!!!",
        "Authors": "By Cosby, Bill and Booth, George (ILT)",
        "Description": "The legendary Bill Cosby, America’s most well-known comic, wants food lovers and over indulgers everywhere to know that they are not alone. Yes, just like the rest of us -- he is frightened -- especially if we've paid any attention lately to the front-page headlines and daily reports on the nightly news:Cholesterol Kills!\"Cookies Clog Arteries!\"Meatball Sandwiches Cause God Knows What\"Repent and Exercise -- or Else!\"In this original collection of humorous musings and digressions about our obsessions, the incomparable Doctor of Comedy is right on target as he reflects back on his own sixty-five years of dining at the banquet of life -- from the hoagies to the stogies to every death-defying delicacy in between. Who better than the man who made an international hero out of a boy named Fat Albert, to aim his great wit, wisdom, and observational talent at our national obsession with food and our never-ending quest for a healthy lifestyle.Bill Cosby is stepping up to the plate -- literally -- in this hilarious new book about his own lifelong cravings and snack attacks ... as well as his hopes that one day, sooner rather than later, pizza will be found to be a cure for heart disease and high cholesterol.",
        "Category": " Self-help , Substance Abuse & Addictions , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Trendmaster's Guide: Get a Jump on What Your Customer Wants Next",
        "Authors": "By Waters, Robyn and VanDeWeghe, Lindsay (ILT)",
        "Description": "According to Robyn Waters, it’s a myth that trends can only be spotted early by überhip Bohemian types who are ever so much cooler than everyone else.   She ought to know. As Target’s former VP of Trend, Design, and Product Development, Waters helped a dowdy regional discount chain become a national fashion destination. Today she consults for many different companies to help them stay ahead of the curve. The Trendmaster’s Guide features her favorite tips and examples for understanding and anticipating trends. Every letter from A to Z offers an insight to help readers navigate the unknown and prepare for whatever their costomers want next. It’s a quick read that packs a lot of insight between \"A is for antennae\" and \"Z is for Zen.\"   Anyone can use the tools in The Trendmaster’s Guide to become more aware of the world around them. Even if you weren’t born with a trendspotting bone in your body, you don’t have to be a follower forever. No one these days can afford to just be catching on when others are already moving on.   Waters stresses that recognizing and reacting to trends is a learned skill, and it can be acquired without spending time in the streets of Milan or the high schools of Orange County. If you’ve ever witnessed a trend unfolding and said to yourself, \"I should have seen this coming,\" there’s hope. You too can become a trendmaster.",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "Portfolio Hardcover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Raising Lazarus",
        "Authors": "By Pensack, Robert Jon and Williams, Dwight Arnan",
        "Description": "At age four Pensack lost his mother to HCM, an enigmatic cardiac condition, and at age fifteen was himself diagnosed with the disease, which has haunted a bloodline for three generations. Raising Lazarus chronicles Pensack's journey to overcome his failing body through the will of his mind and the strength of his soul. In order to save himself, he determines to become a doctor - and his own best patient. But after undergoing multiple surgeries in his twenties - one of which leaves a hole in his heart - Pensack realizes he cannot become a surgeon. The training is far too taxing physically, and he is in a constant struggle with incapacitating fear and debilitating emotional disorders that result from the many horrors he has endured. Probing for the foundation of his mental instabilities, Pensack becomes a psychiatrist and reveals the intertwining of mind and body. He eventually surmises that \"physical injuries are mere flesh wounds; it is the psychological terror bred in my past that is most lethal.\"Finally, Pensack must have a heart transplant in order to survive, and thus begins his agonizing wait for a donor heart, followed by the unimaginable consequences, both physical and psychological, of such an ordeal. Through this barbaric feat of modern medicine - and moreover through the strength and support of his wife and children, who have joined him in the passing years - Pensack comes to see the universality of life: how we are all connected, why it matters, and what is our potential.",
        "Category": " Social Science , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Lake News",
        "Authors": "By Delinsky, Barbara",
        "Description": "With this powerful story, Barbara Delinsky, the bestselling and acclaimed author of Coast Road and Three Wishes, has written her richest and most exciting novel yet.  At its center is Lily Blake, a talented singer who shuns the limelight and cherishes her privacy. Tricked by a devious reporter into unwittingly giving an interview about her friendship with a distinguished churchman -- a newly appointed Cardinal -- she finds herself accused of having had an affair with him.  Shocked and dismayed, Lily becomes a pariah and suffers the brutal, ultimate violation of her privacy as headlines all across the country proclaim her guilt. Hounded by the press, fired from her job, deprived of all public freedom, Lily has no choice but to flee. She returns in secret to her hometown of Lake Henry, in a remote, beautiful part of New Hampshire.  But, idyllic as it may look, Lake Henry, too, has its secrets. Some were the cause of her leaving home in the first place, so returning to her birthplace and her family is not without its own stress and pain.  Driven by the need to exact justice -- and, for herself, some kind of closure -- from the media that changed her life forever, Lily forms an uneasy alliance with John Kipling, a journalist who was born and raised in Lake Henry's poorest neighborhood. His successful career as a big-city reporter has ended disastrously, and John has come back home to edit the local newspaper, Lake News. At first he sees Lily as a victim, as well as a subject for the book he hopes to write. But soon she becomes someone whose appeal -- and cause -- he cannot deny, even at the risk of taking on his former colleagues in her defense.  Set against the physical beauty of New Hampshire and against the complex web of family life and relationships in a small town, Lake News moves triumphantly toward a surprising and deeply satisfying conclusion.  Barbara Delinsky's bestselling Three Wishes was praised by Publishers Weekly for its \"spare, controlled, and poignant prose that evokes the simplicity and joys of small-town life.\" Those same qualities are abundant in Lake News, which offers an intimate look at the complex relationship between an enigmatic man and a vulnerable, besieged woman, both struggling to find a new sense of community in a strange place they once called home.",
        "Category": " Fiction , Literary",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "A Spanish Lover",
        "Authors": "By Trollope, Joanna",
        "Description": "Lizzie and Frances are twins - nearly identical, tall, fair, unmistakably English - but their resemblance goes no deeper. Simply put, Lizzie is the sister who's always gotten everything right - husband, children, her own thriving business, marvelous friends - while Frances has not. People are beginning to worry about what Frances is going to do with her life, now that the twins are approaching forty. But after a lifetime of not measuring up, Frances decides to start playing by different rules. She shocks her family by taking a married lover, a Spanish Catholic who clearly will never leave his wife, and much to everyone's surprise, Lizzie's perfect life begins to crumble from the stress of it all - and from envy.A Spanish Lover combines an intoxicating love story unfolding under the Mediterranean sun with a sobering view of Britain's current economic stranglehold on a family that never dreamed that money would be a problem. It is a richly intriguing study of twins, of motherhood and marriage, or choosing not to marry, of painful domestic downsizing, and of late flowering with a vengeance.",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Disclosure",
        "Authors": "By Crichton, Michael",
        "Description": "A brutal struggle in the cutthroat computer industry; a shattering game of cat and mouse; an accusation of sexual harassment that threatens to derail a brilliant career ... this is the electrifying core of Michael Chrichton's new novel, his first since Rising Sun.At the center: Tom Sanders, an up-and-coming executive with DigiCom in Seattle, a man whose corporate future is certain. Until: after a closed-door meeting with his new boss - a woman who was his lover ten years before, a woman who has been promoted to the position he expected to have - he is accused of sexually harassing her. Now, as he scrambles to defend himself (enlisting the help of a sagacious woman lawyer whose career has been built on the successful prosecution of men charged with sexual misconduct), he finds himself trapped between what he knows to be true and what he knows others will assume to be the truth. And, as he uncovers an electronic trail into the company's secrets, he begins to grasp just how cynical and manipulative an abuse of truth has actually occurred ...Tackling one of the most divisive issues of our time, Disclosure compels us to see beyond our traditional responses. It is Michael Chrichton at his galvanizing best.",
        "Category": " Fiction , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Cavedweller",
        "Authors": "By Allison, Dorothy",
        "Description": "When Delia Byrd packs up her old Datsun and her daughter Cissy and gets on the Santa Monica Freeway heading south and east, she is leaving everything she has known for ten years: the tinsel glitter of the rock 'n' roll business; her passion for singing and songwriting; and a life lived on credit cards and whiskey with a man who made big promises he couldn't keep. Delia Byrd is headed back to Cayro, Georgia, and for the first time in years, she knows what she wants - the two daughters she left behind a lifetime ago.Cayro, Georgia, is a world of truck farms and convenience stores, biscuit franchises and deep rooted Baptism. And, beneath this surface, caves: lost caves, known caves; caves called \"Little Mouth\" and \"Paula's Lost\"; caves where color explodes in the dark and where people have died and been buried; caves waiting to be mapped and explored. Cayro, with its red earth and kudzu, is the only terrain Clint Windsor, the man Delia ran from, and the two girls, Amanda and Dede, have ever known. And when Delia and Cissy reach Cayro, the past unfurls into the present, and Cayro, Georgia, becomes a more complicated place than any of them could have imagined.",
        "Category": " Fiction , Literary",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Practical parenting tips: Over 1,500 helpful hints for the first five years",
        "Authors": "By Lansky, Vicki",
        "Description": "",
        "Category": "",
        "Publisher": "Distributed by Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Cream 3",
        "Authors": "By Christov-Bakargiev, Carolyn (EDT) and Phaidon (EDT)",
        "Description": "Those curious about current trends in contemporary art worldwide will find much to ponder in the latest \"Cream\" volume by Phaidon ( Cream  and  Fresh cream  were published in 1998 and 2000, respectively), in which a group of 10 curators at contemporary museums in Germany, the US, Sweden, Italy, Japan, Switzerland, Mexico, and Poland each select 10 artists whose works they find compelling. The artists are presented in alphabetical order. In addition to color plates of their work, a short preface describes the artist's works, and a list of selected exhibitions and bibliography follows the plates. The volume is packaged in a heavy, magnet-strip-sealed cover, like a car manual. Name index only. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Art , Popular Culture",
        "Publisher": "Phaidon Press",
        "Price Starting With ($)": "16.56",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Created Equal: Why Gay Rights Matter to America",
        "Authors": "By Dawidoff, Robert and Nava, Michael",
        "Description": "Why should Americans who are not gay care about gay rights?In Created Equal, Michael Nava and Robert Dawidoff argue that the movement for gay equality is central to the continuing defense of individual liberty in America. Beginning with an examination of the determined assault on gay issues by the religious right, the authors show how this sectarian movement to legislate private religious morality into law undermines the purpose of American constitutional government: the protection of the individual's right to determine how best to live his or her life.The book starts from the premise that gay and lesbians are, first and foremost, American citizens, and then looks to what rights belong to every individual American citizen, arguing from the Declaration of Independence and the Constitution. Addressing their argument to the great majority of their fellow Americans, Dawidoff and Nava emphasize that what is at stake is not the fate of the gay community, but the future of constitutional principle and the rights of free individuals in American society.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "And Baby Makes Three",
        "Authors": "By Kanter, Carol N.",
        "Description": "Discusses the expectations of new parents and supplies guidance on coping with the emotional problems encountered by first-time parents",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Winston Pr",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Second Nature",
        "Authors": "By Hoffman, Alice",
        "Description": "When Robin Moore, a divorced mother of a teenaged son, brings an off-islander named Stephen to her island home, his presence transforms all who cross paths with him. By the author of Turtle Moon.",
        "Category": " Fiction , Psychological",
        "Publisher": "GP Putnam's.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "The Manhattan Hunt Club",
        "Authors": "By Saul, John",
        "Description": "The acknowledged master of psychological suspense and heart-stopping terror, New York Times bestselling author John Saul now invites you to descend to chilling new depths of darkness--and discover a secret, savage world that exists beneath our very feet. The promising future of New York City college student Jeff Converse has suddenly been shattered by a nightmarish turn of events. Falsely convicted of a brutal crime, Jeff sees his life vanishing before his eyes. But someone has other plans for Jeff, in a far deadlier place than any penitentiary. He finds himself beneath the teeming streets of Manhattan, in a hidden landscape of twisting tunnels and forgotten subterranean chambers. Here, an invisible population of the homeless, the desperate, and the mad has carved out its own shadow society.But they are not alone. The pitch-dark tunnels and abandoned subway stations are haunted by the unmistakable sounds of predators in search of game. Someone has made this forsaken civilization beneath the city a private killing ground . . . and the hunt is on.Trapped in a treacherous underground maze, cut off at every turn by ragged gangs of sinister \"gamekeepers,\" and stalked relentlessly by unseen hunters, Jeff faces overwhelming odds in the race to reach salvation and elude capture. With no weapon but his wits, and an unimaginable threat lurking around every dark corner, Jeff must somehow move heaven and earth to escape from a living hell.The Manhattan Hunt Club is the most thrilling and suspenseful novel yet from the ingenious mind of John Saul.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "The Vendetta Defense",
        "Authors": "By Scottoline, Lisa",
        "Description": "In The Vendetta Defense, New York Times bestselling author Lisa Scottoline delivers a wonderfully rich, vivid story of past sins, love, and justice.Lawyer Judy Carrier takes the case of her career when an elderly pigeon racer named Anthony Lucia is arrested for the murder of his lifelong enemy, Angelo Coluzzi. \"Pigeon Tony,\" as he's known to all his South Philly neighbors, confesses he killed Coluzzi because of a vendetta begun more than fifty years ago, a blood feud that has brought great tragedy to Pigeon Tony's life.Her client's guilt, however, is only the beginning of Judy's problems. The Coluzzi family wants revenge, and they are determined to finish off Pigeon Tony and Judy before the case can go to trial. And if that isn't enough, Judy's got to contend with Tony's magnetic grandson, Frank, a man who makes her think about everything but the law, and her boss, the no-nonsense Bennie Rosato.In a case steeped in blood and memory, it will take a stroke of brilliance to save Pigeon Tony. But if anyone just might see justice done, it's this gutsy young attorney who'll risk everything to win ... including her life.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Le Petit Prince (French Language Edition)",
        "Authors": "By Saint-Exupery, Antoine de",
        "Description": "Delightful French tale relates the adventures of a young prince, from a distant asteroid, whose rocket has been forced down in the African desert",
        "Category": " Fiction , Classics",
        "Publisher": "Harcourt Childrens Books",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Fresh Bread and Other Gifts of Spiritual Nourishment",
        "Authors": "By Rupp, Joyce",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "Ave Maria Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "The Art of Grilling: A Menu Cookbook",
        "Authors": "By McCune, Kelly",
        "Description": "Discusses grilling techniques, equipment, and tools, and includes menus and recipes for grilled meat, fish, poultry, and vegetables",
        "Category": " Cooking , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Luck!: How to Get It and How to Keep It!",
        "Authors": "By Sasse, James",
        "Description": "Discusses the nature of luck, how it can relate to numbers or the stars, how good luck can be attracted and bad luck avoided, and how luck can be rated.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Element Books Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "How to Clean Practically Anything",
        "Authors": "By Kippel, Edward (EDT) and Consumer Reports Books (COR)",
        "Description": "A handy, up-to-date guide describes the most efficient and cost-effective ways to clean practically everything, with special sections on how to cope with daily cleaning regimens, eliminating germs, paint removal, oven cleaners, carpet and floor cleaning, and safe storage of cleaning supplies. Original.",
        "Category": " House & Home , General",
        "Publisher": "Consumer Reports Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Virginia: A Pictorial Souvenir",
        "Authors": "By Highsmith, Carol M., Landphair, Ted, and Lurker, Donna (EDT)",
        "Description": "Virginia, the \"Old Dominion\" state, is at once timeless and strikingly contemporary.  Birthplace of eight of America's presidents, including Washington, Jefferson, Madison, and Monroe, and home to an impressive array of ultra-modern industries, Virginia is a land of endless variety, beauty, and charm.  A state of seeming contradictions—onetime queen of the confederacy yet proud to elect as Governor the grandson of former slaves—Virginia celebrates its vivid and romantic past, while striding towards it future confidently.A land of serenely bucolic landscapes, of fox hunts, debutante cotillions, peaceful plantations, and stately historic tours, Virginia also dazzles with its diversity. Where else can one leave the glistening strand of Virginia Beach for the airy splendor of the Blue Ridge Mountains?  What other state boasts both legendary Jamestown—site of England's first permanent colony in the New World—and rustic Chincoteague Island, second home to wild ponies descended from horses that swam to safety after a Spanish galleon sank?  Indeed, Virginia is the site of many of America's most famous cultural landmarks and homes—Colonial Williamsburg, Appomattox Court House, and Jefferson's classically proportioned Monticello, just to name a few. Virginia, A Pictorial Souvenir is a marvelous photographic portrait that vividly captures this historic state.  It guides the reader to such architectural splendors ad Danville's Millionaire's Row with its magnificent Victorian and Edwardian home, and spectacular sites such as the Natural Bridge in the Shenandoah Valley and the scenic Blue Ridge Parkway.  These images and more make this book a perfect keepsake for anyone acquainted with the timeless charms of \"Old Virginny.\"",
        "Category": " Travel , Pictorials",
        "Publisher": "Crescent",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Death Is Now My Neighbor (Inspector Morse)",
        "Authors": "By Dexter, Colin",
        "Description": "The peaceful quadrangle of Lonsdale College seems remote from the shocks of the outside world - such as the shooting of a young woman in her North Oxford home. But things at Lonsdale are not as tranquil as they appear. The Master of the college is retiring, and two senior dons, Denis Cornford and Julian Storrs, are vying, discreetly but furiously, to succeed him. There are only two people to whom the coveted appointment means more than it does to Cornford and Storrs - their wives.Chief Inspector Morse, investigating the murder on Bloxham Drive, follows a trail that leads first to a tabloid journalist, then to the strip clubs of Soho. It soon winds back, however, to the university. For Morse and his partner, Sergeant Lewis, the question becomes: Is the Mastership of Lonsdale worth killing for?",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.73",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Country Vet's Home Remedies for Cats",
        "Authors": "By Editors of Publications International Ltd., David Kay",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Meeting God: Psalms for the Highs and Lows of Life (Interactions)",
        "Authors": "By Hybels, Bill, Harney, Kevin, and Harney, Sherry",
        "Description": "True stories about the highs and lows of life with God.What is it about the Psalms that creates their ageless appeal? What draws us to them time and again to find courage, hope, and joy? Perhaps it’s the way these ancient songs so faithfully mirror our own experience. With depth and passion, the Psalms reflect the many-faceted relationship between humans and God in the ever-changing proving grounds of life. In Meeting God, you’ll learn about God’s heart toward you—and what He looks for in your heart toward Him. You’ll find a road map for life. Discover a source of courage in the face of fear. Expand your heart with a fresh realization of God’s greatness. And deepen your relationship with a very present, personal Creator.Interactions—a powerful and challenging tool for building deep relationships between you and your group members, and you and God. Interactions is far more than another group Bible study.  It's a cutting-edge series designed to help small group participants develop into fully devoted followers of Christ.",
        "Category": " Religion , Biblical Studies , Old Testament , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "What Your 2nd Grader Needs To Know (Core knowledge)",
        "Authors": "By Hirsch, E. D. (EDT)",
        "Description": "Grade by grade, these groundbreaking and successful books provide a solid foundation in the fundamentals of a good education for first to sixth graders.B & W photographs, linecuts, and maps throughout; two-color printing.",
        "Category": " Education , Elementary",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "The Business Traveling Parent: How to Stay Close to Your Kids When You're Far Away",
        "Authors": "By Verdick, Dan",
        "Description": "Over 100 ideas for before you leave, while you&#39;re gone, and when you come home...Does business travel force you to leave your children for days or even weeks at a time? Now, author Dan Verdick gives you a wealth of easy ideas, tips, tricks, and games to stay involved in your children&#39;s lives despite spending so much time away from home. With just a few moments a day and The Business Traveling Parent, you can make a world of difference in the life of your child.Traveling in airplanes, visiting distant cities and staying in hotels provide a basis for dozens of fun, creative stay-in-touch games and activities that are guaranteed to brighten the days of business traveling parents--and their children.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Gryphon House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Illiberal Education: The Politics of Race & Sex in Campus",
        "Authors": "By D'Souza, Dinesh",
        "Description": "Argues that university affirmative action and related programs have only encouraged divisions and the loss of individual liberty",
        "Category": " Education , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.57",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "The Prime Minister's daughter",
        "Authors": "By Edelman, Maurice",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "18.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Mayo Clinic On Managing Diabetes: Practical Answers to Help You Enjoy a Healthy and Active Life",
        "Authors": "By Collazo-Clavell, Maria, M.D. (EDT)",
        "Description": "A powerful resource, filled with a wealth of information for managing, monitoring, and living with diabetes, covers such topics as understanding diabetes, medications, new technologies, experimental therapies, daily blood sugar monitoring, and more. Original. 15,000 first printing.",
        "Category": " Health & Fitness , Diseases , Diabetes",
        "Publisher": "Mayo Clinic",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Heat and Other Stories (Contemporary Fiction, Plume)",
        "Authors": "By Oates, Joyce Carol",
        "Description": "A new collection of twenty-five short stories from one of America's preeminent literary figures once again reveals the darkness, the violence, and the raw emotion lurking below the surfaces of everyday life. Reprint.",
        "Category": " Fiction , Literary",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Nasty People: How to Stop Being Hurt by Them Without Becoming One of Them (Bestselling Author Jay Carter Helps Reader Break Away from T)",
        "Authors": "By Carter, Jay",
        "Description": "Explains why some people are nasty, describes the techniques they use to make others feel bad, and includes practical tips on how to handle them",
        "Category": "",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "The Escape of Alexei, Son of Tsar Nicholas II: What Happened the Night the Romanov Family Was Executed",
        "Authors": "By Egorov, Georgy B., Lysenko, Igor V., and Petrov, Vadim Vadimovich",
        "Description": "",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Harry N Abrams Inc",
        "Price Starting With ($)": "5.17",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Border Music",
        "Authors": "By Waller, Robert James",
        "Description": "Most people don't run out the back door of a place called the Rainbow Bar in Dillon, Minnesota, with someone they don't even know, get in a pickup truck, drive all day, and end up without any clothes on in a motel room. But that's what Texas Jack Carmine did with Linda Lobo. It was the kind of thing Jack was famous for doing. The people who knew Texas Jack Carmine - such as songwriter Bobby McGregor and Jack's uncle Vaughn Rhomer back in Iowa - called him God's only freeborn soul, rider of the summer roads, traveler of the far places. Where he was headed with dark-haired, long-legged Linda was not just back to his one-horse Texas ranch. It was somewhere he had never been: face to face with his own heart and the wild, strange things that live there. Border Music is the story of Jack and Linda, of long, hot days on a high desert ranch, nights wild with loving beneath West Texas skies, and times when their relationship tears them both apart. It's about Vietnam and the Midwest, and Vaughn Rhomer, an old man who,tries in his own fumbling way to be free. It's about men and women who work hard and care intensely, about romance and the passion that you only find once...and you never stop wanting to find again.",
        "Category": " Fiction , General",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Don't Know Much About The Universe: Everything You Need to Know About the Cosmos but Never Learned",
        "Authors": "By Davis, Kenneth C.",
        "Description": "From the ancients who charted the stars, to Jules Verne and Flash Gordon, to The X-Files, Apollo 13, and Armageddon, subjects engaging the heavens and outer space have intrigued people through the ages. And yet so many of us look up at the night sky and have to admit that we are totally in the dark when it comes to the most basic facts about the heavens.Into the void steps Kenneth C. Davis with the latest addition to his bestselling and critically acclaimed DON'T KNOW MUCH ABOUT® series. Don't Know Much About® the Universe is a lively and readable guide to the discoveries, theories, and real people that have shaped space exploration, from the beginning of civilization to the present. Using the now-familiar and popular question-and-answer format that has appealed to millions of readers, Davis sets his sights on a subject that has inspired the greatest of fascinations, produced many popular misconceptions, and ultimately helped shape the course of history.From a historical overview of man's preoccupation with space to a guided tour of our solar system and beyond, Kenneth Davis seeks, as always, to entertain as he teaches. He looks at issues that go beyond the bounds of simple \"Science 101\" and asks the kinds of questions we may have wanted to ask back in school but didn't have the nerve.For example:Who dug those canals on Mars? Is a \"blue moon\" really blue?What does astronomy have to do with astrology? Will we end with a bang or a whimper?",
        "Category": " Science , Astronomy",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Widow Killer",
        "Authors": "By Kohout, Pavel",
        "Description": "Set in the German-occupied city of Prague during the twilight of World War II, the novel opens jarringly with the gruesome murder of the baroness of Pomerania, the widow of a German Wehrmacht general, by a perverted serial killer. The coroner's report determines that the victim did not resist and was not raped. Mysteriously, her heart was removed and vanished with the killer.The unlikely pair of Jan Morava, a rookie Czech detective, and Erwin Buback, a Gestapo agent who is questioning his loyalty to the Nazis, set out to track down the sadistic killer before he can strike again. But as Morava and Buback follow the killer's bloody trail through Prague, it becomes clear that he is not a political radical or a wartime dissident but a tormented psychopath. In the downward spiral of the Third Reich's final days, both officers must tirelessly search for a sinister murderer while grappling with their own emotional demons.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "What's the Matter with Kansas?: How Conservatives Won the Heart of America",
        "Authors": "By Frank, Thomas",
        "Description": "With a New Afterword by the AuthorThe New York Times bestseller, praised as \"hilariously funny . . . the only way to understand why so many Americans have decided to vote against their own economic and political interests\"            (Molly Ivins)Hailed as \"dazzlingly insightful and wonderfully sardonic\" (Chicago Tribune), \"very funny and very painful\" (San Francisco Chronicle), and \"in a different league from most political books\" (The New York Observer), What's the Matter with Kansas? unravels the great political mystery of our day: Why do so many Americans vote against their economic and social interests? With his acclaimed wit and acuity, Thomas Frank answers the riddle by examining his home state, Kansas-a place once famous for its radicalism that now ranks among the nation's most eager participants in the culture wars. Charting what he calls the \"thirty-year backlash\"-the popular revolt against a supposedly liberal establishment-Frank reveals how conservatism, once a marker of class privilege, became the creed of millions of ordinary Americans.A brilliant analysis-and funny to boot-What's the Matter with Kansas? is a vivid portrait of an upside-down world where blue-collar patriots recite the Pledge while they strangle their life chances; where small farmers cast their votes for a Wall Street order that will eventually push them off their land; and where a group of frat boys, lawyers, and CEOs has managed to convince the country that it speaks on behalf of the People.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Reds: McCarthyism in Twentieth-Century America",
        "Authors": "By Morgan, Ted",
        "Description": "In this landmark work, Pulitzer Prize–winning author Ted Morgan examines the McCarthyite strain in American politics, from its origins in the period that followed the Bolshevik Revolution to the present. Morgan argues that Senator Joseph McCarthy did not emerge in a vacuum—he was, rather, the most prominent in a long line of men who exploited the issue of Communism for political advantage. In 1918, America invaded Russia in an attempt at regime change. Meanwhile, on the home front, the first of many congressional investigations of Communism was conducted. Anarchist bombs exploded from coast to coast, leading to the political repression of the Red Scare. Soviet subversion and espionage in the United States began in 1920, under the cover of a trade mission. Franklin Delano Roosevelt granted the Soviets diplomatic recognition in 1933, which gave them an opportunity to expand their spy networks by using their embassy and consulates as espionage hubs. Simultaneously, the American Communist Party provided a recruitment pool for homegrown spies. Martin Dies, Jr., the first congressman to make his name as a Red hunter, developed solid information on Communist subversion through his Un-American Activities Committee. However, its hearings were marred by partisan attacks on the New Deal, presaging McCarthy.The most pervasive period of Soviet espionage came during World War II, when Russia, as an ally of the United States, received military equipment financed under the policy of lend-lease. It was then that highly placed spies operated inside the U.S. government and in America’s nuclear facilities. Thanks to the Venona transcripts of KGB cable traffic, we now have a detailed account of wartime Soviet espionage, down to the marital problems of Soviet spies and the KGB’s abject efforts to capture deserting Soviet seamen on American soil. During the Truman years, Soviet espionage was in disarray following the defections of Elizabeth Bentley and Igor Gouzenko. The American Communist Party was much diminished by a number of measures, including its expulsion from the labor unions, the prosecution of its leaders under the Smith Act, and the weeding out, under Truman’s loyalty program, of subversives in government. As Morgan persuasively establishes, by the time McCarthy exploited the Red issue in 1950, the battle against Communists had been all but won by the Truman administration. In this bold narrative history, Ted Morgan analyzes the paradoxical culture of fear that seized a nation at the height of its power. Using Joseph McCarthy’s previously unavailable private papers and recently released transcripts of closed hearings of McCarthy’s investigations subcommittee, Morgan provides many new insights into the notorious Red hunter’s methods and motives.Full of drama and intrigue, finely etched portraits, and political revelations, Reds brings to life a critical period in American history that has profound relevance to our own time.",
        "Category": " Political Science , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Why We Fight: Moral Clarity and the War on Terrorism",
        "Authors": "By Bennett, William J.",
        "Description": "The events of September 11, 2001, were an unforgettable tragedy, but they also revealed that the spirit of America is strong and undiminished. Not since the shocking attack on Pearl Harbor has the nation pulled together with such unity and purpose, resolving to endure whatever hardships may be necessary to win the war on terror. We were united in the defense of and belief in our country.  It truly brought out the best in our national character.But a small group of influential public intellectuals, writers, members of the media, and academics were not part of this unified response.   They still preached the same self-doubt about America and her traditions that have steadily undermined our national confidence and resolve in recent decades.  Within days of the attacks this debilitating mindset was in evidence, as influential figures rushed to point the finger at America and decry what they were sure would be our murderous and indiscriminate reaction.  While most Americans remain confident of the justice and appropriateness of our military response in Afghanistan, these vocal critics have caused some to wonder whether we brought the attacks on ourselves because of our foreign policy, our popular culture, or our support for Israel.As we enter the next phase of what will undoubtedly be a protracted and dangerous struggle--a war unlike any other in our history--it is more important than ever to respond to these doubts and objections and to preserve the patriotic ardor seen in the wake of September 11.  In clear, compelling, straightforward language, William Bennett takes up and refutes the many myths and misconceptions about America’s character and role in world affairs that have become fashionable among our nation’s elites.  The morning of September 12 dawned with a stunning moral clarity that has guided the actions of many Americans, both her leaders and her citizens.  Bennett seeks to preserve that clarity in order to ensure that our national resolve does not falter in this difficult and necessary war.From the Hardcover edition.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Finishing The Course Strategies For The Back Nine Of Your Life",
        "Authors": "By Sheard, Jim, Armstrong, Wally, LaHaye, Tim F. (INT), and Nelson, Byron (FRW)",
        "Description": "J.Countryman presents Finishing the Course, a book exploring the parallels between famous finishing holes of golf and a strong and faithful finish on the course of life. Featuring quotes from famous golfers, Scripture, and beautiful full-color photography,Finishing the Course presents nine strategies for those facing the \"back-nine\" of life, including: playing one shot at a time, learning to deal with the bunkers, and letting go of your trophies.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "J Countryman Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Living With Cats",
        "Authors": "By Nemec, Gale B.",
        "Description": "The first companion volume to the PBS series Living with Animals offers tips on every aspect of cat care, including feeding, grooming, training, and cat-proofing a home. Original. TV tie-in. 20,000 first printing.",
        "Category": " Technology & Engineering , General",
        "Publisher": "Quill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "The Calcium Factor: The Scientific Secret of Health and Youth",
        "Authors": "By Barefoot, Robert R.",
        "Description": "Argues that increased calcium in the diet will prevent or alleviate common diseases, and that information on this treatment is being suppressed by mainstream medicine and the pharmaceutical industry.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Bokar Consultants",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Cat-Dependent No More: Learning to Live Cat-Free in a Cat-Filled World",
        "Authors": "By Reid, Jeff",
        "Description": "Cat Dependency. What is it? Who suffers from it? And how can those afflicted free themselves from the tyranny of their tabbies? At last, there's a book that offers new hope to the millions who for years have been trampled underpaw. Without pussyfooting around, this recovery guide teaches how to live care-free and cat-free again.",
        "Category": " Pets , Cats , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Loving Your Child Is Not Enough: Positive Discipline That Works",
        "Authors": "By Samalin, Nancy and Jablow, Martha Moraghan",
        "Description": "Offers parents advice about, discipline, acknowledgement of children's feelings, punishments, anger, self-esteem, responsibility, and sibling rivalry",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Newlywed's Guide to Sex on First Night",
        "Authors": "By Smith, Richard",
        "Description": "The same painstaking research and statistical surveys that made Richard Smith's The Dieter's Guide to Weight Loss During Sex a #1 National Bestseller is applied to the questions of honeymooners the world over. Uncompromisingly honest positions are taken on such questions as: Can we do it all we want? Why are my parents here? Where's the mint on the bed? This essential guide allows couples to monitor their progress throughout the evening and into dawn. Charts tell how long everything will take, and at what point the bellhop should be asked to leave. Special sections address the concerns of the newly remarried and the irritation caused by the newlyweds next door, who at 9:30 are already ahead by three. A catalog of over-the-counter aphrodisiacs (oysters, green M&Ms) will resuscitate flagging will power. What's wrong with unlimited sex? Absolutely nothing, says Richard Smith. Anything's all right as long as no one gets hurt. 457,000 copies in print.",
        "Category": " Humor , Form , Parodies",
        "Publisher": "Workman Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Whole Ten Yards",
        "Authors": "By Gifford, Frank and Waters, Harry",
        "Description": "Legendary sports figure Frank Gifford shares the story of his life, his career on the field and off, and his marriage to talk-show star Kathie Lee. 100,000 first printing. $100,000 ad/promo. Tour.",
        "Category": " Sports & Recreation , Football",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "People Weekly Yearbook: The Year in Review 1998",
        "Authors": "By People Magazine (New York, N. Y.) (EDT)",
        "Description": "Looks at celebrities who have made news during 1998, including John Glenn, Leonardo DiCaprio, and Monica Lewinski",
        "Category": " Social Science , Media Studies",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "The Hot Zone",
        "Authors": "By Preston, Richard",
        "Description": "A real-life medical thriller describes how a strain of a lethal, infectious, previously unknown virus showed up in 1989 at a Virginia laboratory and the efforts of a military biohazard SWAT team to identify and prevent the spread of the virus. 100,000 first printing. Tour.",
        "Category": " Science , Life Sciences , Microbiology",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Once You're Over the Hill: (You Begin to Pick Up Speed)",
        "Authors": "By Schulz, Charles M.",
        "Description": "Birthdays seem to come more quickly the older we get.  As another year passes, we add another candle to the sweet cake of life. Once You're Over the Hill, You Begin to Pick up Speed  presents a charming collection of comic strips that will make the aging process funnier -- and a bit easier, too.",
        "Category": " Humor , General",
        "Publisher": "HarperEntertainment",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "The Beanie Baby Handbook",
        "Authors": "By Fox, Sue and Fox, Les",
        "Description": "",
        "Category": "",
        "Publisher": "West Highland Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The Winning Portfolio: Choosing Your 10 Best Mutual Funds",
        "Authors": "By Farrell, Paul B.",
        "Description": "The Winning Portfolio presents a simple, practical remedy to the usually haphazard process of picking mutual funds. It's unique because it steers investors to the exact funds that match their investment requirements. This is not another laundry list of the best mutual funds. It takes a stand on which funds are best for specific types of investors.",
        "Category": " Business & Economics , Reference",
        "Publisher": "Bloomberg Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Stress Protection Plan: Everyday Ways to Beat Stress and Enjoy Life",
        "Authors": "By Olivier, Suzannah",
        "Description": "De-stress, detox, and defeat the unhealthy effects of constant tension. These proven daily, weekly, and monthly plans for relieving the pressure focus on nutrition and ways to boost the immune system through diet. Smooth out those rough moments with key stress-management techniques. See how to measure levels of anxiety and get relief...without changing your lifestyle radically. Know the difference between \"healthy\" and \"damaging\" stress; fill out charts to determine if you've already reached dangerous levels; and look at the debilitating results of tension throughout the body, from the hormonal to the digestive to the immune systems. Let the healing begin by following basic nutritional guidelines: every component of the diet is outlined--carbohydrates, fats, proteins, waters, antioxidants, vitamins, and more--along with basic suggestions on beating addictions, getting exercise, and creating fun, stress-busting plans for everyday living!",
        "Category": " Health & Fitness , Diet & Nutrition , Nutrition",
        "Publisher": "Collins & Brown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "To the Hermitage",
        "Authors": "By Bradbury, Malcolm",
        "Description": "In October 1993, a novelist is invited to goto Stockholm and Russia to take part in what is enigmatically referred to asthe Diderot Project. In Stockholm he is joined by various other members of theproject—including an academic, a lustful opera singer, and a Swedish diplomat.On the journey to Russia more is revealed about the great Enlightenment writerDenis Diderot—the son of a knife maker in Langres, who went to Paris andcompiled the Encyclopedia, a book that changed the world.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Overlook Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "When Living Hurts: A Lively What to Do Book for Yourself or Someone You Care About Who Feels Discouraged, Sad, Lonely, Hopeless, Angry or Frustrated",
        "Authors": "By Gordon, Sol",
        "Description": "Discusses sex, love, faith, parents, the meaning of life, and suicide, and explains how to change one's attitudes toward life",
        "Category": "",
        "Publisher": "Urj Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "Nuremberg (movie tie-in)",
        "Authors": "By Persico, Joseph E.",
        "Description": "Using firsthand documents, the author recounts the trial of Nazi officials at Nuremberg, analyzing the day-to-day struggles among the prosecutors and judges, the evidence of unprecedented atrocities, and the personalities of the accused. 35,000 first printing. $25,000 ad/promo. Tour.",
        "Category": " History , Military , World War II",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "How to Lose Friends & Alienate People",
        "Authors": "By Young, Toby",
        "Description": "In 1995 high-flying British journalist Toby Young left London for New York to become a contributing editor at Vanity Fair. Other Brits had taken Manhattan-Alistair Cooke then, Anna Wintour now-so why couldn't he? But things didn't quite go according to plan. Within the space of two years he was fired from Vanity Fair, banned from the most fashionable bar in the city, and couldn't get a date for love or money. Even the local AA group wanted nothing to do with him. How to Lose Friends and Alienate People is Toby Young's hilarious account of the five years he spent looking for love in all the wrong places and steadily working his way down the New York food chain, from glossy magazine editor to crash-test dummy for interactive sex toys. But it's more than \"the longest self-deprecating joke since the complete works of Woody Allen\" (Sunday Times); it's also a seditious attack on the culture of celebrity from inside the belly of the beast. And there's even a happy ending, as Toby Young marries-\"for proper, noncynical reasons,\" as he puts it-the woman of his dreams. \"Some people are lucky enough to stumble across the right path straight away; most of us only discover what the right one is by going down the wrong one first.\"BEFORE PUBLICATION: \"I'll rot in hell before I give that little bastard a quote for his book.\"-Julie Burchill AFTER PUBLICATION: \"A relentlessly brilliant book-a What Makes Sammy Run for the twenty-first century…the funniest, cleverest, most touching new book I've read for as long as I can remember.\"-Julie Burchill, The Spectator",
        "Category": " Biography & Autobiography , Editors, Journalists, Publishers",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Who Owns Information?: From Privacy To Public Access",
        "Authors": "By Branscomb, Anne W.",
        "Description": "Drawing on eleven case studies, a communications lawyer addresses the issue of who owns information, explaining the ramifications of the ownership of medical records, telephone numbers, personal names, culture, computer software, and more.",
        "Category": " Law , Constitutional",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The Magic of Well Being",
        "Authors": "By Jackson, Judith",
        "Description": "Discover Judith Jackson's innovative and inspiring techniques for meditation and visualization, mindful exercise, aromatherapy bathing and massage, sensory eating, and positive thinking. All are demonstrated in clear step-by-step photographic sequences and imaginatively planned to increase your mind/body awareness.Eight enjoyable and easy-to-follow rescue routines draw on the basic techniques to form one-day programs that combat negative influences in our lives. Years of experience administering similar treatments in leading spas and salons have proved to Judith Jackson that such an approach \"helps people climb out of the valley and make it to the top of the hill.\"",
        "Category": " Psychology , Mental Health",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Always Time to Die: A Novel",
        "Authors": "By Lowell, Elizabeth",
        "Description": "With her trademark electrifying storytelling and razor-sharp tension, New York Times bestselling author Elizabeth Lowell proves once again why she is one of today's top masters of suspense -- in a riveting tale of dark family secrets ready to explode with the devastating force of a Southwestern earthquake.The powerful Quintrell family of New Mexico has spent decades in the public eye. Now the recent death of the clan's patriarch, a former U.S. senator, has placed his son, Governor Josh Quintrell, squarely in the spotlight as he prepares his run for the highest political office in the land. It is not a good time to be rattling skeletons in the family's closets.Researching personal histories isn't just Carolina \"Carly\" May's profession, it's her passion. When the governor's eccentric Aunt Winifred invites Carly into the Quintrells' private Taos compound to compile a genealogical record of the illustrious residents, she can hardly believe her good luck. But digging into the past is raising troubling questions about the would-be president's private life, his late father and catatonic mother, and the grisly street crime that left his notorious drug-addicted sister dead. And it soon becomes frighteningly apparent that the motivation of the dotty old woman who hired Carly might be something more akin to revenge -- and that someone is determined to remove the inquisitive genealogist from the picture by any means necessary.As a dark world of twisted passions and depraved crimes slowly opens up before Carly, she realizes that there is no one whom she dares to trust -- perhaps least of all Dan Duran, a dangerous and haunted mystery man who's somehow tied to the Quintrells' past. But she will need an ally to survive the terrible secrets a father carried to the grave and an even more devastating evil that lurks among the living -- because following the bloodlines of the wealthy and power-hungry can be a bloody business ... and some dead secrets can kill.",
        "Category": " Fiction , Romance , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Shell Games:  A John Marquez Crime Novel",
        "Authors": "By Russell, Kirk",
        "Description": "The discovery of thousands of empty abalone shells and two murdered divers sends Lieutenant John Marquez's poaching investigation in a newand very riskydirection. Former DEA agent and now head of a special operations unit of the California Department of Fish and Game, Marquez learns he himself has been targeted as the next victim. Stalking him is Kline, a vicious drug smuggler turned abalone poacher who has a vendetta against Marquez. John Marquez is supposed to protect wildlife, not solve murders, but the only way he can break the multi-million-dollar abalone-smuggling ring, as well as save his own life, is to find and stop Kline. A fast-paced crime novel set along the majestic Northern California coastline, Shell Games introduces a tough, complex, and appealing hero and a masterful new series.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Gone: A Novel",
        "Authors": "By Roper, Martin",
        "Description": "In this erotic, emotional debut novel, a young man is torn between two cities, two cultures, and two women.Disillusioned with his marriage to the controlling Ursula, shattered by the death of his sister, and unsettled by the vandals threatening the security of his home, Stephen, a young Dubliner,  moves to New York hoping to make a clean start.He is quickly swept up in an affair with Holfy, a fiercely independent woman fifteen years his senior, but before long finds himself living a divided life, unable to break his ties to Ursula, Dublin, and the past. The obsessive, intensely erotic bond with Holfy soon begins to fray, and Stephen is forced to face himself and to unravel an identity-and a home-that no longer seems to exist.Navigating a rocky journey through the labyrinth of death, desire, and the fickleness of truth, Gone combines raw emotion and sensuality with Joycean lyricism. It confirms the arrival of an exciting new talent.",
        "Category": " Fiction , Literary",
        "Publisher": "Henry Holt and Co.",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Cradle and Crucible : History and Faith in the Middle East",
        "Authors": "By Fromkin, David (EDT) and Schorr, Daniel (INT)",
        "Description": "The world?s crossroads, the Middle East is the most contested and controversial area on Earth. It is also the cradle of the first great civilizations in Mesopotamia and Egypt and can be said to have given birth to human striving?and strife. Through photographs, maps, and the writings of highly respected authors, this book details the historical, political, cultural, and religious forces that have shaped the region and unravels for readers the enigma that is the Middle East. Beginning with the prehistoric civilizations of the fertile crescent and continuing through the conflicts of the 20th and 21st centuries, the first section of the book distills the Middle East?s sweeping, often turbulent history. From the Hittites to Alexander the Great, from the Romans to the Crusaders, from the Ottomans to the Imperialists, the Middle East?s rich tapestry of influences and identities is described with new critical insights. The book?s second section is devoted to the Middle East?s three great faiths, examining in depth the impact of Muslim, Jewish, and Christian beliefs on history and daily life in the Middle East. Filled with photographs and maps that contribute to a visual understanding of the subject, Cradle & Crucible is a timely guide to this complex, enormously important area of the world.",
        "Category": " History , General",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "An Illustrated Guide to Attracting Birds",
        "Authors": "By Sunset Books",
        "Description": "Discusses bird-watching, characteristics and behavior, eighty common North American birds, landscaping to attract birds, bird foods, and birdhouses and feeders",
        "Category": " Science , General",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Ortho's All About Landscape Construction Basics (Ortho's All About Home Improvement)",
        "Authors": "By Ortho (EDT) and Erickson, Larry (EDT)",
        "Description": "Offers an overview of fundamental carpentry and masonry skills for readers to apply to their own outdoor projects, from pathways to arbors.Expert tips in easy-to-understand language.",
        "Category": " House & Home , Outdoor & Recreational Areas",
        "Publisher": "Ortho",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Christmas at Home: Country Pleasures",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Leonardo Da Vinci",
        "Authors": "By Pedretti, Carlo",
        "Description": "Leonardo da Vinci was the true Renaissance man. Not only was he one of the greatest artists ever to live, but he was also a truly gifted architect and creative mind who devised amazing machines centuries ahead of his time.His list of interests and achievements are extraordinary; as well as artist and architect, he was astronomer, researcher, scientist, experimenter, anatomist, and inventor.Leonardo's most acclaimed paintings are the Mona Lisa in the Louvre, Paris and The Last Supper in the refectory at Santa Maria delle Grazie, Milan, Italy. But in many ways his greatest legacy are the hundreds of pen and ink drawings and sketches which are now in museums and collections around the world.These explain, in his remarkable mirror writing, his calculations and hypotheses for the mechanical operation of his various ideas. This book attempts to explain who this great genius was and why he became such a creative man. It looks at where he came from and his education, who his influences were, and how he made his way in the world to become the most remarkable man of his time. His work was founded in strict science and based on a profound analysis of ancient and traditional sources, but it was his curiosity which really drove him. His inquisitive mind led him to investigate every field of knowledge and his life's work is an extraordinary synthesis of art, science, and technology fused in theoretical and practical experience gathered from a long and productive life.",
        "Category": " Biography & Autobiography , Artists, Architects, Photographers",
        "Publisher": "TAJ Books International",
        "Price Starting With ($)": "5.13",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "The American Yoga Association's Beginner's Manual: The Definitive Guide from the Nation's Preeminent Yoga Center",
        "Authors": "By Alice Christensen",
        "Description": "",
        "Category": "",
        "Publisher": "Fireside / Simon & Schuster",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Americas Best Kept Secret",
        "Authors": "By Gagan, James L",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw Hill - NTC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    }
]