[
    {
        "Title": "Maddy Kettle Book 1: The Adventure of the Thimblewitch",
        "Authors": "By Shefer-Vanson, Dorothea",
        "Description": "The original CliffsNotes study guides offer a look into critical elements and ideas within classic works of literature.CliffsNotes on Diary of Anne Frank takes you into the handwritten accounts of life in hiding from Nazis in World War II.Following the feelings of a 13-year-old Jewish girl who recorded her thoughts, impressions, dreams, and cherished hopes during the two years before she and her family were discovered, this study companion covers the backgrounds and fates of the real people within Anne's diary. Other features that help you figure out this important work includeHistorical background centering around World War IICritical commentaries covering each year Anne Frank spent in hidingSuggested essay topics to inspire discussionSelected bibliography for further researchClassic literature or modern-day treasure &apos; you'll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Top Shelf Productions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2014"
        }
    },
    {
        "Title": "The Age Of Terror",
        "Authors": "By Talbott, Strobe (EDT) and Chanda, Nayan (EDT)",
        "Description": "Momentous events have a way of connecting individuals both to history and to one another. So it was on September 11. Even before more than 4000 people died in less than two hours, there were farewell messages from the sky. In their last minutes, doomed passengers used cell phones to reach loved ones. A short time later, office workers trapped high in the burning towers called spouses, children, parents. Never had so many had the means to say good-bye. During the hours afterward, the survivors scrambled to make contact with family and friends. \"Are you all right?\" they asked. As the enormity of it all began to sink in, the question hanging in the air was, Were we all right? Since September 11, many have noted a humbling irony: the more time we'd spent in the old world and the better we thought we understood its organizing principles, the less ready we were for the new one. Suddenly, familiar terms and concepts were inadequate, starting with the word terrorism itself. The dictionary defines it as violence, particularly against civilians, carried out for a political purpose. September 11 certainly qualified. But American's earlier encounters with terrorism neither anticipated nor encopmassed this new manifestation. Commentators instantly evoked Pearl Harbor, that other bolt-from-the-blue raid, sixty years before, as the closest thing to a precedent. But there really was none. This was something new under the sun.",
        "Category": " Political Science , Political Freedom & Security , Terrorism",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "An Unthymely Death and Other Garden Mysteries: A Treasury of Stories, Herbal Lore, Recipes and Crafts (China Bayles Mystery)",
        "Authors": "By Albert, Susan Wittig",
        "Description": "Now readers can join China Bayles in ten puzzling cases—and get a taste of her world. This delightful collection features loads of wonderful herbal tidbits on everything from rosemary to feverfew to catnip; recipes for such to-die-for dishes as a Deadly Chocolate Valentine, Ruby's Applesauce Mint Bread, China's Five-Spice Chicken and Veggie Stir-Fry, and McQuaid's Tex Mex-and a host of creative ideas for garden and home. It's a one-of-a-kind collection featuring a one-of-a-kind sleuth—who's worth spending some \"quality thyme\" with!",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Beware of Virtuous Women (The Beckets of Romney Marsh, 3)",
        "Authors": "By Michaels, Kasey",
        "Description": "When Eleanor Becket, a self-proclaimed spinster with quiet ways and an unfortunate limp, encounters Jack Eastwood, the one man who looks beyond the surface and recognizes the beautiful and adventurous soul within, she risks everything--her family and her life--for love. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Maryland Seafood (Cookbook 2)",
        "Authors": "By Seafood Marketing Authority",
        "Description": "",
        "Category": "",
        "Publisher": "Seafood Marketing Authority",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Diane Seed's Pasta",
        "Authors": "By Seed, Diane",
        "Description": "",
        "Category": "",
        "Publisher": "WHSmith",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "One Day at a Time: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "Danielle Steel celebrates families of every stripe in her compelling novel—a tale of three very different couples who struggle and survive, love, laugh, and learn to take life . . .  Coco Barrington was born into a legendary Hollywood family. Her mother, Florence, is a mega-bestselling author. Her sister, Jane, is one of Hollywood’s top producers and has lived with her partner, Liz, for ten years in a solid, loving relationship. Florence, widowed but still radiant, has just begun a secret romance with a man twenty-four years her junior. But Coco, a law-school dropout and the family black sheep, works as a dog walker, having fled life in the spotlight for an artsy Northern California beach town.When Coco reluctantly agrees to house-sit for Jane, she discovers an unexpected houseguest: Leslie Baxter, a dashing but down-to-earth British actor who’s fleeing a psycho ex-girlfriend. Their worlds couldn’t be more different. The attraction couldn’t be more immediate. And as Coco contemplates a future with one of Hollywood’s hottest stars, as her mother and sister settle into their lives, old wounds are healed and new families are formed—some traditional, some not so traditional, but all bonded by love.With wit and intelligence, Danielle Steel’s novel explores love in all its guises, taking us into the lives of three unusual but wonderfully real couples. Funny, sexy, and wise, One Day at a Time is at once moving, thought-provoking, and utterly impossible to put down.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Boys! Shaping Ordinary Boys Into Extraordinary Men",
        "Authors": "By Beausay, William",
        "Description": "Author William Beausay believes it is possible to turn normal boys into exceptional adults who are anything but average.Boys! encourages parents to raise sons who are truly winners in life.In this expanded and revised edition, Beausay takes a hard look at some of the issues facing parents today, including raising boys solo, attention deficit hyperactive disorder, smart discipline, handling bullies, and much more. With down-to-earth wisdom and practical suggestions, Beausay equips parents to deal with the tough issues that their sons will encounter on their journey to manhood.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Cold River (A Black Falls Novel, 2)",
        "Authors": "By Neggers, Carla",
        "Description": "Hannah Shay has finally shown the town of Black Falls what she's worth. Her Three Sisters Café is a success, and she's soon to become a prosecutor. When the café becomes an epicenter for investigators trying to pierce a violent crime ring that's leaving bloody trails on nearby Cameron Mountain, Hannah suspects a man from her past is involved.Sean Cameron returns to the snowy cold of his Vermont hometown to unmask his father's killer. Sean has the skills and resources to mount his own search, but he must convince the resistant Hannah to cooperate—because the killer is ready to strike again…and closer than anyone ever imagined.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Jim Cramer's Getting Back to Even",
        "Authors": "By Cramer, James J. and Mason, Cliff (CON)",
        "Description": "Jim Cramer, host of CNBC's Mad Money and bestselling author and financial guru, offers specific advice about how to overcome your fear of the markets and put your investments back on track to recover from the financial debacle of 2008-2009.You don't even look at your 401(k) statements any longer. When mail comes from your broker or your mutual fund, you throw it in a drawer unopened. You know how bad things are and you're just waiting for them to improve before you start thinking about your money again.But how long will that take? How many opportunities will you miss while you hide your head in the sand? Shouldn't you be doingsomething?Jim Cramer says that there are positive steps you can take to start the financial healing process. You can start to get back to even, then go from there. Cramer explains how to make the best of the bad situation you're in, and how not to succumb to fear and panic. He tell you what steps to take depending on your age and your financial goals.Getting Back to Even will include advice on refinancing a mortgage, recovering from job loss or downsizing, and making a new financial plan. It will include twenty new rules for investing that fit the current economic climate.Jim Cramer believes that the stock market is still the best long-term investment anyone can make. He'll offer guidance on which stocks to select, or how to find a reliable and successful mutual-fund manager, and how to spot the economic recovery when it happens.Whether you're 25 and investing to build wealth or 65 and hoping to restore your retirement savings, you'll need the advice Jim Cramer offers inGetting Back to Even.",
        "Category": " Business & Economics , Personal Finance , Investing",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Golf (Eyewitness Companions)",
        "Authors": "By Newell, Steve, Edmund, Nick (EDT), and Howard, Jock",
        "Description": "A guide to golf provides information on equipment, etiquette, techniques, the rules, tournaments, and golf courses of the world.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "DK",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Mathew - Chapters 1-13 - The Gospels (Vol.34)",
        "Authors": "By McGee, J. Vernon",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Nelson Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "McKettricks of Texas: Tate",
        "Authors": "By Miller, Linda Lael",
        "Description": "There are barely enough hours for divorced dad Tate McKettrick to run the Silver Spur ranch, do the suit-and-tie thing for his business and run herd on his beloved six-year-old twin daughters. But time stands still at the sight of Libby Remington. When they were high school sweethearts, the wealthy McKettrick couldn't convince Libby he loved her. But now they're both back in Blue River, Texas. And cattle rustlers, a manipulative ex-wife and a killer stallion can't keep him from trying again.Libby has her hands full taking care of her mother—and running the Perk Up Coffee Shop. Caffeine, she needs. Tate McKettrick, with his blazing blue eyes and black hair? No. Oh, heck—yes. But can they really hope for a second chance?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "The New Chinese Empire: Bejing's Political Dilemma And What It Means For The United States",
        "Authors": "By Terrill, Ross",
        "Description": "Some observers expect China to become an economic superpower. Others expect it to fragment into pieces. Is China nationalistic and on the march, or is it a stumbling Communist dinosaur? Is it already a billion-citizen member of the global village? Is it, as the Clinton administration claimed, a \"strategic partner\" of the U.S.?Ross Terrill addresses the question upon which all these others depend: Is the People's Republic of China, whose polity is a hybrid of Chinese tradition and Western Marxism, willing to become a modern nation or does it insist on remaining an empire? Since the collapse of three thousand years of Confucian monarchy in 1911, China has neither established a successful political system nor adjusted to being a nation state. Today it stands as the most contradictory of major powers, hovering between an unsustainable tradition and a yet-to-be-born political form that would support its new society and economy. Hanging in the balance are the prospect for freedom within China (for both Chinese and non-Chinese citizens of the People's Republic), the future of America's relations with China, and the security of China's neighbors.Drawing upon Terrill's long experience studying China as well as upon new research, this enlightening and rigorous book will be a must-read for everyone who has a stake in the future of the global world order.",
        "Category": " Political Science , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Ladies Home Journal: 100 Great Chicken Recipes",
        "Authors": "By Ladies' Home Journal Books",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Poultry",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Daily Devotions for a Life of Purpose",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Humble Creek",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Norah's Ark: Love Me, Love My Dog #2 (Life, Faith & Getting It Right #14) (Steeple Hill Cafe)",
        "Authors": "By Baer, Judy",
        "Description": "Hi, my name is Bentley.I'm a mutt with a dash of pit bull in the soup, and I have issues. I'm not likely to win any beauty pageants, and I'm afraid of cats. But my human, Norah Kent, thinks I'm the greatest despite all my shortcomings.The problem is Norah won't go out with anyone who doesn't like me. Norah says she's perfectly happy being single, and that in God's time she'll marry Mr. Right. But I think God's time may be right now, and Mr. Right may be Officer Nick Haley—the one guy who's afraid of a kitten-fearing basket case of a dog like me! I'll do just about anything to bring Norah and Nick together, even if I have to&#133;gulp&#133;woof!",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Steeple Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Trees a Guide to Familiar American Trees (A GOLDEN NATURE GUIDE)",
        "Authors": "By Herbert S. Zim, Alexander C. Martin",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1952"
        }
    },
    {
        "Title": "A Mother to Embarrass Me",
        "Authors": "By Williams, Carol Lynch",
        "Description": "Now that Laura is 12 years old, she realizes that everything about her mother is totally embarrassing. Like the way she yodels at the top of her lungs while she works (okay, she calls it singing). And plays really old music so loud the neighbors can hear (can’t she listen to normal music?). And walks around in clay-covered pajamas (yes, she is a sculptor, but still . . . ). But things are about to get much, much worse. Laura has noticed that her mother is getting a little bit, well, fat. Then one night over dinner (at a restaurant, since she almost burned down the house trying to cook), her mother announces that she’s going to have a baby. Now all the neighbors, including the gorgeous boy Laura has a crush on, will know her parents have been doing it. Maybe even in the house! There must be some way Laura can change her mother before her own life is completely, utterly ruined!From the Hardcover edition.",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.77",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "On Being Fit to Live with",
        "Authors": "By fosdick, Harry Emerson",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Brothers Publishers",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1946"
        }
    },
    {
        "Title": "The Adventures of Tom Sawyer (Tor Classics)",
        "Authors": "By Twain, Mark",
        "Description": "This edition of Mark Twain's The Adventures of Tom Sawyer includes a Biographical Note, Preface, and Afterword by Keith Neilson. Tor Classics are affordably-priced editions designed to attract the young reader. Original dynamic cover art enthusiastically represents the excitement of each story. Appropriate \"reader friendly\" type sizes have been chosen for each title—offering clear, accurate, and readable text. All editions are complete and unabridged, and feature Introductions and Afterwords.",
        "Category": "",
        "Publisher": "Aerie",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Leadership: The Inner Side of Greatness (Jossey Bass Business & Management Series)",
        "Authors": "By Koestenbaum, Peter",
        "Description": "Offers an insightful look at the characteristics great leaders have in common--realism, vision, ethics, and courage--and identifies the strategies all managers can use to achieve and sustain both personal and organizational greatness. Challenges managers to give meaning to their lives through the quality of their work, revealing how personal growth can translate into organizational profits.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.71",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "What Daddies Do Best",
        "Authors": "By Munsinger, Lynn (ILT) and Numeroff, Laura Joffe",
        "Description": "Daddy can do lots of things, like bake you a birthday cake, play with you in the park, and take you trick-or-treating. But what do they do best? The answer is made perfectly clear in this irresistible mini-celebration of dads and the wonderful everyday things they do.",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Sweet Wind, Wild Wind",
        "Authors": "By Lowell, Elizabeth",
        "Description": "Lara Chandler returns home to the Rocking B Ranch after a four-year absence and encounters her former lover Carson Blackridge, a seductive man who had once used her love to hurt her and who now wants her to become a part of his future. Reissue.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Broken Honor",
        "Authors": "By Potter, Patricia",
        "Description": "In a stunning follow-up to the breakthrough success of The Perfect Family, bestselling author Patricia Potter turns her talents to the intrigue and romance of the military.  Long ago, in the waning years of World War II, a Nazi train was captured by Allies. Its cargo, a fortune in stolen art and gold dust, vanished. Today, two strangers are about to become engulfed in its tantalizing mystery...an unexpected passion...and inescapable peril.  \"A master storyteller.\" (Debbie Macomber)  \"Potter writes romantic adventure like nobody else.\" (Joan Johnson)",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Jove",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Dryden's Bride (Historical)",
        "Authors": "By Maguire, Margo",
        "Description": "Dryden's Bride by Margo Maguire released on Aug 25, 2000 is available now for purchase.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Stress Control: Sourcebook (Self Study Sourcebook Series)",
        "Authors": "By Scanlon, Kelly (EDT), Hankins, Rod (ILT), and Bell, Steve",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "Skillpath Pubns Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Mothers and Daughters at Home: 35 Projects to Make Together",
        "Authors": "By Lyons, Charlotte and Randazzo, Steven (PHT)",
        "Description": "Busy as we are, mothers understand that childhood is a precious moment with limited opportunities to spend heartfelt time with our children. For generations, mothers have created their own family memories -- and keepsakes -- by sitting down with their daughters and making beautiful things for the home. Constructing a dollhouse, stitching a family quilt, painting a kitchen chair, baking sweet rolls, sewing the eyes on a nubby brown teddy bear -- at the end of the day, the hours spent together making these things are the ones we will best remember.  In Mothers and Daughters at Home, the talented writer and designer Charlotte Lyons examines and embraces the intimate personal style a mother shares with her daughter. Featuring 35 wonderful and easy-to-do projects -- from doll making, quilting, decoupage, and embroidery to papier-mâché, jewelry making, and cooking -- this inspiring volume introduces mothers and daughters to the delights of shared creative endeavor. The projects are fun and simple, and produce excellent results. But the most valuable element is the shared experience of making something together.  Inspired mothers and daughters will be delighted with their efforts as well as the moments they spend at work with each other. Organized according to the length of time each project requires -- from an hour to a weekend, or longer -- this lushly illustrated book shows us that anyone can make beautiful and exciting accessories for the home with the simple guidance and inspiration Lyons so wonderfully provides.  Profiles of mothers and daughters show us how deep the family bond can become when creative effort strengthens the mother-daughter relationship. Even the mistakes become cherished souvenirs of personal artistry and remembrance -- made together as dearest friends, mothers and daughters.",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "13.71",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The U.N. Exposed: How the United Nations Sabotages America's Security and Fails the World",
        "Authors": "By Shawn, Eric",
        "Description": "Less than five miles from Ground Zero in Manhattan sits an international hotbed of anti-Americanism.               The United Nations was created after World War II to promote peace and international understanding. But over the years, and today more than ever, the U.N. has failed to achieve its original mission. It has failed to address the most dangerous threats facing the civilized world, refused to condemn terrorist acts, encouraged America's enemies, and supported some of the world's most oppressive governments, all while wasting billions of dollars.               As veteran reporter Eric Shawn of Fox News Channel points out, the U.N.'s iconic skyscraper is where our so-called allies all too often undermine the United States and our vital interests. And for the honor of hosting our adversaries in our own country, Americans pay a whopping 22 percent of the U.N.'s bloated budget.               The U.N. Exposed will give you a rare insider's tour of the United Nations, focusing on many disturbing aspects that have been ignored by the mainstream media. You will learn, for instance:                           how U.N.-supervised funds were diverted into weapons used against American troops                    how terrorists and rogue states seeking nuclear weapons flout toothless U.N. resolutions                    how our allies' selfish economic interests drive U.N.-backed challenges to America's sovereignty                    how kickbacks, bribes, and corruption have pervaded the highest echelons of the U.N.                    how U.N. ambassadors and staff enjoy luxurious and tax-free Manhattan lifestyles and other perks                    how U.N. workers have repeatedly turned children into their sexual prey                      As Shawn declares in his introduction, \"I am disgusted by the fact that the altruistic efforts of so many U.N. staff members are undercut by the greed, corruption, and ineptitude of the bureaucracy they serve.\"",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Sentinel Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "Julia Child's Menu Cookbook",
        "Authors": "By Child, Julia",
        "Description": "Presents complete menus from \"Julia Child & Company\" and \"Julia Child & More Company\" for every occasion, from picnics to dinner parties",
        "Category": "",
        "Publisher": "Wings Books",
        "Price Starting With ($)": "13.28",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Healthy Young Children: A Manual for Programs 2002",
        "Authors": "By National Association for the Education of Young Children (COR), Aronson, Susan S. (EDT), and Spahr, Patricia M. (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Natl Assn for the Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Gift Of More: LESSONS OF FAITH AND LOVE FROM A LIFE CUT SHORT",
        "Authors": "By Yates, Pamela",
        "Description": "",
        "Category": " Self-help , Death, Grief, Bereavement",
        "Publisher": "FaithWalk Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Great Battles of the Civil War: Southern Victories",
        "Authors": "By Johnson, Swafford",
        "Description": "",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Crescent",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The DOUBLET AFFAIR: AN URSULA BLANCHARD MYSTERY AT QUEEN ELIZABETH I'S COURT (Ursula Blanchard Mysteries)",
        "Authors": "By Buckley, Fiona",
        "Description": "A tantalizing re-creation of Elizabethan life and manners told with intelligence and wit,\" raved Library Journal upon the publication of To Shield the Queen, the volume that introduced twenty-six-year-old Ursula Blanchard, Lady of the Presence Chamber to Queen Elizabeth I, and one of the most entrancing mystery heroines to come along in many a season.  Young Ursula knows it can be treacherous easing herself into the petty foibles at court, but now, having once saved the Virgin Queen from political disaster, she faces an even greater challenge. Sortie of Ursula's old acquaintances may be plotting to overthrow Elizabeth in favor of Mary, Queen of Scots, and the re-establishment of the Catholic faith. Ardent, some would say fanatical, believers will stop at nothing -- smuggling, counterfeiting, civil war, perhaps murder -- to further their cause. One of Elizabeth's spies is already dead and the clues to his death point in a troubling direction.  Most disturbing to Ursula is whether her old friends Ann and Leonard Mason could be mixed up in a treasonous plot against the Queen. There have been rumors that all is not as it should be with the Masons.  Secretary of state Sir William Cecil needs his own spy in the Mason home and Ursula is the obvious choice, She knows the family, she can justify her visit by helping to care for the Masons' five children, and she can perhaps use her newly acquired skill at lockpiching to uncover some surprising truths.  Torn between her devotion to Elizabeth, still a young woman like herself, and her longing to be reunited with her exiled Catholic husband, Matthew, in France, Ursula makes a difficult bargain that balances personal happiness against duty to Queen and country. Her journey takes her into dangerous territory eventually into the underground cells of the Tower of London itself Whatever happens, she will never again be quite as trusting or quite as secure.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "First Evidence",
        "Authors": "By Goddard, Kenneth W.",
        "Description": "As an experienced crime scene investigator, Colin Cellars has had to contend with missing evidence before. But never has he encountered such a chaotic crime scene as the one at a remote cabin nestled in the deep woods of the Pacific Northwest - site of a reported shootout. Cellars cannot find a trace of perpetrator or victim. He can't even confirm there has been a murder, much less that the cabin's owner - and the presumed victim - could be his long-estranged former best friend. But something violent and inexplicable has happened, and each time he approaches the scene seeking clearer evidence, eerie occurrences confound the case further.Someone - something? - will stop at nothing to prevent him from discovering the truth. For the truth is not \"out there\" - it is locked away in Cellars's own evidence file. But it will do him no good unless he has the vision to see what it really means...before it's too late.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Calphalon Cooks Weeknights: Uncomplicated Dishes for Busy People",
        "Authors": "By Culinary Staff at Calphalon",
        "Description": "",
        "Category": "",
        "Publisher": "Sunset Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Dime Store Decorating: Using Flea Market Finds with Style",
        "Authors": "By Grover, Jill Williams",
        "Description": "A find at a flea market, something snatched from a yard sale, a store-bought bargain that barely affected the wallet: if you're trying to decorate at a discount--but with style and panache--some help is coming your way! You don't have to be a seasoned crafter to dip into these creative and innovative ideas, because every unique project takes almost no time to do and requires only minimal skills. Choose from among such colorful categories as Think Pink, Stars and Jars, Quite Bright, Leopard Spots and Pots, and Right with White, and begin transforming those everyday items into candle bottles, animal-print table settings, frames, scrapbooks, picnic baskets, bedroom décor, vases, and lots more! You'll never pay full price again.",
        "Category": " House & Home , Decorating",
        "Publisher": "Sterling/Chapelle",
        "Price Starting With ($)": "6.31",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Fresh & Fabulous Painted Furniture",
        "Authors": "By PLAID",
        "Description": "Beautifully paint any piece of wood furniture and lend it a personal, handcrafted touch that will set it apart from other mass-produced versions. Whether it's stenciling, stamping, block-printing, decorative painting, or découpaging, the technique you want to use can be found among the 25 great-looking projects. No matter what your skill level, you can paint a twining ivy wall shelf, a garden window armoire, a flowers-and-sunshine chair, and a coat tree of many colors. A Selection of Doubleday's Australian Book Club and a Selection of BOMC's Country Book Club.  128 pages (all in color), 8 1/2 x 10. NEW IN PAPERBACK",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.62",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Fiasco: The American Military Adventure in Iraq, 2003 to 2005",
        "Authors": "By Ricks, Thomas",
        "Description": "Finalist for the Pulitzer PrizeOne of the Washington Post Book World's 10 Best Books of the YearOne of Time's 10 Best Books of the YearUSA Today's Nonfiction Book of the YearA New York Times Notable BookThe definitive account of the American military's tragic experience in IraqFiasco is a masterful reckoning with the planning and execution of the American military invasion and occupation of Iraq through mid-2006, now with a postscript on recent developments. Ricks draws on the exclusive cooperation of an extraordinary number of American personnel, including more than one hundred senior officers, and access to more than 30,000 pages of official documents, many of them never before made public. Tragically, it is an undeniable account—explosive, shocking, and authoritative—of unsurpassed tactical success combined with unsurpassed strategic failure that indicts some of America's most powerful and honored civilian and military leaders.",
        "Category": " History , Military , Iraq War (2003-2011)",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Fire and Ice: A Novel (Buchanan-Renard)",
        "Authors": "By Garwood, Julie",
        "Description": "Sophie Rose is a crime reporter at a major Chicago newspaper and the daughter of Bobby Rose, a charming gentleman and big-time thief. When asked to write an exposé about her notorious father, Sophie quits and goes to work at a small newspaper, covering local personalities such as William Harrington, the 5K runner whose trademark is red socks. Those socks—with Sophie’s business card tucked inside—are practically all that’s found after Harrington is killed near Prudhoe Bay, Alaska, seemingly in a brutal polar bear attack.   Sophie heads north to investigate, but danger follows in her wake. After one attempt on her life, she’s assigned brash but sexy Jack MacAlister as a bodyguard. But Sophie and Jack will soon be fighting more than their growing passion for each other. Powerful forces will stop at nothing to prevent the exposure of the sinister conspiracy Sophie and Jack are about to uncover.",
        "Category": " Fiction , Mystery & Detective , Historical",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "The Analyst: A Novel",
        "Authors": "By Katzenbach, John",
        "Description": "Happy fifty third birthday, Doctor. Welcome to the first day of your death. Dr. Frederick Starks, a New York psychoanalyst, has just received a mysterious, threatening letter. Now he finds himself in the middle of a horrific game designed by a man who calls himself Rumplestiltskin. The rules: in two weeks, Starks must guess his tormentor’s identity. If Starks succeeds, he goes free. If he fails, Rumplestiltskin will destroy, one by one, fifty-two of Dr. Starks’ loved ones—unless the good doctor agrees to kill himself. In a blistering race against time, Starks’ is at the mercy of a psychopath’s devious game of vengeance. He must find a way to stop the madman—before he himself is driven mad. . . .",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Scrabble Word Building Book",
        "Authors": "By Ahmed, Saleem",
        "Description": "For SCRABBLE® and other word-game players, the winner's handbook is here! Become a master of the game with this essential guide for top-scoring play. You'll discover:   The 94 all-important two-letter words -- in one handy list  A special section of over 800 three-letter words, 550 of which can be formed from two-letter words  All eight-letter words that can be formed from seven-letter words  Every word up to seven letters you can play!   Keep this invaluable SCRABBLE® reference at your fingertips to make maximum use of high scoring letters, settle disputes, and increase your word-building power!",
        "Category": " Games , Crosswords , Dictionaries",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Africa since 1800",
        "Authors": "By Atmore, Anthony and Oliver, Roland",
        "Description": "This general history of modern Africa has been revised and updated to take full account of the fresh perspectives on African history brought about by the end of the Cold War. It is also concerned with the demographic trends that are at the heart of so many African problems today.",
        "Category": " History , Africa , General",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Thames and Hudson Encyclopedia of Impressionism (World of Art)",
        "Authors": "By DENVIR, BERNARD",
        "Description": "Covers painters, critics, patrons, and collectors, and describes the cultural background of the time",
        "Category": "",
        "Publisher": "Thames & Hudson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Spawn Volume 1: Endgame",
        "Authors": "By McFarlane, Todd, Portacio, Whilce (CON), and Holguin, Brian (CON)",
        "Description": "Endgame is a new landmark in the saga of Spawn! Despite his strugglesand triumphs against both Heaven and Hell, Al Simmons has realized that nomatter what he does, he remains a pawn in the Great Game. So the Hellspawndecides to change the game in a single, dramatic stroke! His actions haveimmediate and far-reaching effects: First, for a young man named Jim, whoawakens from a long coma without any memory of his past life, and now isseemingly possessed by a terrifying, dark power! Collects Spawn #185-190.",
        "Category": " Comics & Graphic Novels , Superheroes",
        "Publisher": "Image Comics",
        "Price Starting With ($)": "17.33",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "The Constitution (American Symbols & Their Meanings)",
        "Authors": "By Marcovitz, Hal",
        "Description": "Discusses the history of the United States Constitution, from events leading up to its creation and ratification more than 200 years ago to some amendments that have been added as recently as 1971.",
        "Category": " Juvenile Nonfiction , History , United States , 19th Century",
        "Publisher": "Mason Crest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Love's Desire",
        "Authors": "By Toombs, Jane",
        "Description": "When her steamboat is captured by Rebel soldiers, Rosalind becomes a willing hostage to black-bearded Daniel, while Cosy, Rosalind's long-lost half sister, finds her marriage plans upended when she falls in love with another man. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.24",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "The Liberty Bell (American Symbols & Their Meanings)",
        "Authors": "By Marcovitz, Hal",
        "Description": "Traces the history of the Liberty Bell, including information about the use of bells in colonial America, statistics about this particular bell, legends surrounding it, and its importance as an American symbol.",
        "Category": " Juvenile Nonfiction , History , United States , 19th Century",
        "Publisher": "Mason Crest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Down by the Water",
        "Authors": "By Upcher, Caroline",
        "Description": "Hope Collins-Calder has a stressful job as a realtor in the Hamptons, an ex she can't shake, a current husband she's beginning to regret, and a serious child -care crisis. What she needs is a good, traditional British nanny. What she gets is Annabel Quick. Elegant, sheltered, unmarried, and sad, Annabel is no Mary Poppins. But as she sets about getting Hope's chaotic house in order, she begins to notice her own heart miraculously mending as well, thanks in large part to Sheldon, a gentle handsome local carpenter who is stirring up emotions Annabel was certain she'd buried long ago. And over the course of one remarkable summer by the shore -- when marriages are tested, secrets revealed, and lives renewed --Annabel will find herself becoming more part of the Collins-Calder family than she, or Hope, ever bargained for.",
        "Category": " Fiction , Literary",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Absolute Truths (Starbridge)",
        "Authors": "By Howatch, Susan",
        "Description": "\"A SKILLFUL BLEND OF CHARACTER, PHILOSOPHY AND NARRATIVE. . .Formidable personalities embroil themselves in ruthless power struggles that would make a corporate raider blush.\"--The Washington Post Book WorldIt is 1965, and Charles Ashworth has attained the plum position of bishop of Starbridge, an honor that keeps him in a heady whirl of activity that would exhaust the most seasoned corporate executive. With the invaluable support of his minions and his attractive, unsinkable wife, Ashworth stands against the amorality and decadence of the age--\"Anti-Sex Ashworth.\" He slays his opponents by being a tough, efficient, confident churchman, the torments of his past long since dead and buried.And then the unexpected, the unthinkable, strikes.Suddenly Ashworth finds himself staring into the chasm of all the lies hes been telling himself for years: about his marriage, his children, even his views on the Church. And as he suspects his old nemesis and dean, Neville Aysgarth, of drinking too much, of financial chicanery, of--God forbid--having an affair, Ashworth discovers to his horror that he is tempted to commit the very acts that he has so publicly denounced. . . .\"ENTHRALLING. . .Rich, dense, almost indecently entertaining.\"--San Jose Mercury News\"POWERFUL. . .MIRACULOUS.\"--Booklist (starred review)SELECTED BY THE BOOK-OF-THE-MONTH CLUB",
        "Category": "",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Master Of Pleasure (Zebra Historical Romance)",
        "Authors": "By Trapp, Jessica",
        "Description": "Refusing to allow the marriage between his daughter and a rogue Yorkist warlord, Lady Meiriona's father has Godric Montgomery ambushed and sold into slavery in the East, but seven years later, Godric returns, seeking revenge on the family that had betrayed him and determined to reclaim his lost bride. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Death Takes a Honeymoon (Carnegie Kincaid, Book 4)",
        "Authors": "By Donnelly, Deborah",
        "Description": "You are cordially invited. . . . Don’t miss amateur detective Carnegie Kincaid, expert in all things matrimony and murder, in the Hallmark original movie Wedding Planner Mystery on Hallmark Movies & Mysteries!TO SURVIVE THE WEDDING OF THE SEASON . . . Wedding planner Carnegie Kincaid can feel the  heat when she reunites with an old flame in the wealthy resort community of Sun Valley—but  handsome smoke jumper Jack Packard is about to marry Carnegie’s former best friend,  now a famous TV actress. With a star-studded ceremony to pull off, a noncommittal  boyfriend back in Seattle, and a supercilious Frenchman barking orders, Carnegie  has no time for carnal urges. Especially once murder joins the party. YOU’VE GOT  TO TAKE THE PLUNGE. The victim was a local hero who leapt from planes to fight fire.  But was his impromptu skydive a smoke screen for something sinister? With her florist  going AWOL, her bride going ballistically Hollywood, and her curiosity running wild,  Carnegie may be in over her head: Someone in Sun Valley is a killer—and it’s up to  Carnegie to grill the guests and unmask the villain . . . or watch her glitzy job go up  in flames.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Letter On The Eucharist Pope John Paul II",
        "Authors": "By Rev. Msgr. Vincent M. Walsh,",
        "Description": "",
        "Category": "",
        "Publisher": "Key of David Publications",
        "Price Starting With ($)": "15.77",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Copland: 1900 through 1942",
        "Authors": "By Copland, Aaron and Perlis, Vivian",
        "Description": "In a candid, witty autobiography, the distinguished American composer recalls his Brooklyn childhood, his study with Nadia Boulanger in Paris, his music, and his relationships, and offers a portrait of the era in which he lived and worked",
        "Category": " Music , General",
        "Publisher": "St. Martin's/Marek",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "A New Owner's Guide to Australian Shepherds",
        "Authors": "By Hartnagle, Joseph",
        "Description": "",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Daddy Clock: A Novel",
        "Authors": "By Markey, Judy",
        "Description": "What happens when a woman who wants her freedom meets a man who wants to love, honor, cherish--and change diapers?Meet Charlie Feldman.  An almost-handsome fortysomething sportswriter whose biological daddy clock is ticking loud and clear.  Charlie wants a baby.  Badly.Enter Lacy Gazzar, a sexy, feisty thirtysomething who's about to send her daughter off to college and finally dive into a grown-up life all her own.  Lacy's more than happy to help Charlie in his search for the perfect mommy.  She's willing to aid him through a hilarious and sometimes humiliating round of personal ads, relentless blind dates, and absolutely appalling encounters.  The one thing she isn't willing to do is have Charlie's baby.But then they become friends.  Really good friends.  And one hot, magical, moonlit night--well, let's just say accidents will happen.What comes next is laugh-out-loud, cry-your-eyes-out proof that the course of true love never runs smoothly--and the best-made plans between a man and a woman almost always go wonderfully awry.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "New College French and English Dictionary (2nd ed, R 504 P)",
        "Authors": "By Steiner, Roger",
        "Description": "",
        "Category": " Foreign Language Study , French",
        "Publisher": "Amsco School Pubns Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Shield and Sword: The United States Navy and the Persian Gulf War",
        "Authors": "By Marolda, Edward J. and Schneller, Robert J., Jr.",
        "Description": "A decade after the United States forged a diverse international coalition to drive Saddam Hussein's invading forces out of Kuwait, the vital role seapower played in that mission has received far less recognition than the land and air campaigns. Yet U.S. Navy surface ships and submarines launched hundreds of cruise missille attacks against Iraqi targets throughout the war, and carriers in surrounding waters sent air strikes deep into the enemy's territory. The battleships Missouri and Wisconsin bombarded hostile targets while U.S. sailors fought naval actions beside U.S. Army and Royal Navy helicopter crews. SEAL missions, global sealift actions, mine countermeasures, and operations in support of the economic embargo all contributed to this complex joint war effort that became one of the most successful campaigns in American military history.",
        "Category": " History , Military , Persian Gulf War (1991)",
        "Publisher": "United States Govt Printing Office",
        "Price Starting With ($)": "9.48",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "A Single Thread",
        "Authors": "By Marie Bostwick",
        "Description": "",
        "Category": "",
        "Publisher": "Kensington Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Wolverine: Worst Day Ever",
        "Authors": "By Lyga, Barry (CRT)",
        "Description": "Saddled with the lamest mutant power and destined not to one of the X-Men, thirteen-year-old Eric Mattias, a new student at Xavier's Institute for Gifted Students, writes a tell-all blog about the adventures of his hero Wolverine.",
        "Category": " Comics & Graphic Novels , Superheroes",
        "Publisher": "Marvel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "The White Darkness",
        "Authors": "By McCaughrean, Geraldine",
        "Description": "I have been in love with Titus Oates for quite a while now—which is ridiculous, since he's been dead for ninety years. But look at it this way. In ninety years I'll be dead, too, and the age difference won't matter. Sym is not your average teenage girl. She is obsessed with the Antarctic and the brave, romantic figure of Captain Oates from Scott's doomed expedition to the South Pole. In fact, Oates is the secret confidant to whom she spills all her hopes and fears. But Sym's uncle Victor is even more obsessed—and when he takes her on a dream trip into the bleak Antarctic wilderness, it turns into a nightmarish struggle for survival that will challenge everything she knows and loves. In her first contemporary young adult novel, Carnegie Medalist and three-time Whitbread Award winner Geraldine McCaughrean delivers a spellbinding journey into the frozen heart of darkness.",
        "Category": " Young Adult Fiction , People & Places , Polar Regions",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "To Siberia",
        "Authors": "By Petterson, Per and Born, Anne (TRN)",
        "Description": "I was fourteen and a half when the Germans came. On that 9th April we woke to the roar of aeroplanes swooping so low over the roofs of the town that we could see the black iron crosses painted on the underside of their wings when we leaned out of the windows and looked up.  In this exquisite novel, readers will find the crystalline prose and depth of feeling they adored in Out Stealing Horses, a literary sensation of 2007.  A brother and sister are forced ever more closely together after the suicide of their grandfather. Their parents’ neglect leaves them wandering the streets of their small Danish village. The sister dreams of escaping to Siberia, but it seems increasingly distant as she helplessly watches her brother become more and more involved in resisting the Nazis.",
        "Category": " Fiction , Literary",
        "Publisher": "Graywolf Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Iron Kissed (Mercy Thompson, Book 3)",
        "Authors": "By Briggs, Patricia",
        "Description": "'Expect to be spellbound'* by Patricia Briggs's #1 New York Times bestselling series starring Mercy Thompson. Being a lowly 'walker' in a world of vampires, werewolves, and fae once kept her safe. But Mercy's bark'and bite'are not so harmless any more'   Though Mercy can shift her shape into that of a coyote, her loyalty never wavers. So when her former boss and mentor, Zee, asks for her help, she's there for him. A series of murders has rocked a fae reservation, and Zee needs her unique gifts, namely her coyote sense of smell, to sniff out the killer.    But when Zee is accused of murdering the suspect Mercy outed, he's left to rot behind bars by his own kind. Now it's up to Mercy to clear his name, whether he wants her to or not.    Mercy's loyalty is under pressure from other directions, too. Werewolves are not known for their patience, and if Mercy can't decide between the two she cares for, Sam and Adam may make the choice for her...   *Lynn Viehl,  New York Times bestselling author",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Campbell's - Cooking in Minutes (Favorite All Time Recipes)",
        "Authors": "By Teberg, Pat (Ed. )",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Babar's Museum of Art",
        "Authors": "By Brunhoff, Laurent de",
        "Description": "Babar and Celeste convert Celesteville's old railroad station into an art museum containing famous masterworks featuring elephants, in an all-new story which includes the basic ideas of art appreciation. 100,000 first printing.",
        "Category": " Juvenile Fiction , Art",
        "Publisher": "Abrams Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Great Source Summer Success Reading: Read Aloud Book Every Living Thing",
        "Authors": "By Schindler, S. D. (ILT) and Rylant, Cynthia",
        "Description": "Here are twelve deeply moving short stories from the perceptive pen of Cynthia Rylant. Each captures the moment when someone's life changes -- when an animal causes a human being to see things in a different way, and, perhaps, changes his life.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "MODERN CURRICULUM PRESS",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Pilates Three in One, Three Complete Home Workout Program",
        "Authors": "By Blair, Bridget and Sheahan-Bright, Robin",
        "Description": "",
        "Category": "",
        "Publisher": "Hinkler Books Pty, Limited",
        "Price Starting With ($)": "6.72",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Garden Design Ideas (Best of Fine Gardening)",
        "Authors": "By Editors and Contributors of Fine Gardening",
        "Description": "Compiled by the editors of \"Fine Gardening\" magazine, this book contains a collection of 21 articles which present the various elements of garden design. Illustrated in full colour throughout, the book offers a wealth of inspiring and practical ideas on how to redesign your garden to create a breathtaking landscape. The book includes tips and techniques on the tools and principles of garden design - from how to draw a site map to assessing the soil conditions - and advice is given on how to plant beds and borders, grow perennials with the best results, and to ensure that the garden is continually full of colour. It features a wide variety of styles including Japanese gardens, vegetable gardens, large formal gardens and courtyard gardens. For those with small gardens, there is a section showing that a little imagination and variety can make it appear considerably larger. A section offering advice to beginners is also included.",
        "Category": " Gardening , Garden Design",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1900"
        }
    },
    {
        "Title": "Hell Is Always Today (Nick Miller)",
        "Authors": "By Higgins, Jack",
        "Description": "While a killer stalks the streets of London, Detective Sergeant Nick Miller is more concerned with a light-heavyweight boxer-turned-expert-cat-burglar who has busted out of prison. High above the streets, cop and convict will face down their most daunting challenges the only way they know how.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Beginnings",
        "Authors": "By Dickson, Gordon R.",
        "Description": "",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Baen",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "The Bald Bandit (A to Z Mysteries)",
        "Authors": "By Gurney, John Steven (ILT) and Roy, Ron",
        "Description": "Help Dink, Josh, and Ruth Rose solve mysteries from A to Z!    Kids love collecting the entire alphabet and super editions! With over 8 million copies in print, the A to Z Mysteries® have been hooking chapter book readers on mysteries and reading for years. Now this classic kid favorite is back with a bright new look!   B is for Bandit . . . There’s a bank robber in Green Lawn! A red-haired kid took a video of the crime, but nobody can find him. Without the video, will the robber go free? Dink, Josh, and Ruth Rose must track down that kid—before the bandit does!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Taste of China",
        "Authors": "By Hom, Ken and Leong, Ka Tai",
        "Description": "Combining illustrations with ninety recipes evoking Chinese culture and cusine, a master chef presents a culinary odyssey through China",
        "Category": " Cooking , Regional & Ethnic , Chinese",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Clever Crafting With Flea Market Finds",
        "Authors": "By Leisure Arts, Inc. (EDT)",
        "Description": "",
        "Category": " Crafts & Hobbies , Fashion",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "English composition",
        "Authors": "By Brooks, Stratton D.",
        "Description": "",
        "Category": "",
        "Publisher": "University of Michigan Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1911"
        }
    },
    {
        "Title": "The Ultimate Christmas Book: Over 240 Holiday Craft, Food, and Decorating Ideas",
        "Authors": "By Reader's Digest Association (EDT)",
        "Description": "More than 250 photographs and illustrations highlight a comprehensive guide to the Christmas holidays, featuring more than 120 projects--including ornaments, wreaths, handcrafted gifts, wrapping, cards, and decorations for the home--as well as dozens of recipes for scrumptious holiday snacks, cookies and treats, lavish Christmas dinners, buffets, and more.",
        "Category": " Crafts & Hobbies , Seasonal",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Decorative Furniture with Donna Dewberry",
        "Authors": "By Dewberry, Donna S",
        "Description": "Transform Plain Furniture into Family Treasures!It's easy and fun with Donna Dewberry. In this inspiring guide, she demonstrates her trademark, one-stroke painting techniques in 10 all-new projects designed especially for furniture. Just follow along. You'll transform old and new tables, chests and cabinets into elegant objects that complement the decor of every room.From soft florals and meandering vines to ripe cherries and delicate china, Donna shows you how to achieve her realistic style with clear, step-by-step instructions that detail every stroke.Donna leaves nothing to chance, providing complete instructions for surface preparation, brush loading and stroke technique. In no time, you'll be taking her easy techniques one step further, painting your own designs on anything in need of a decorative touch.",
        "Category": " Design , Furniture",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Dave's Dinners: A Fresh Approach to Home-Cooked Meals",
        "Authors": "By Lieberman, Dave and Whiteside, George (PHT)",
        "Description": "The charismatic rising Food Network star returns with his second cookbook Dave Lieberman's boy-next-door charm and impressive kitchen chops have made him a favorite with Food Network fans. Now, in his second cookbook, he offers recipes that will satisfy even the busiest of families. Here is the perfect easy-to-follow guide for anyone interested in cooking affordable and delicious dinners. With dishes like . . .  Orange and Five-Spice Roasted Chicken with Sweet Potato Smash Twisted Pasta with Browned Butter, Sage, and Walnuts Red-Wine Pot Roast with Honey and Thyme Chocolate Guinness Cupcakes  Dave shows how to make the most of every ingredient while minimizing costs, intensifying the joy of bringing a good meal to family and friends.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "A Romanov Fantasy: Life at the Court of Anna Anderson",
        "Authors": "By Welch, Frances",
        "Description": "Did the seventeen-year-old Grand Duchess Anastasia survive the massacre of the Russian imperial family in 1918? Over the years, the possibility that the youngest of the tsar’s four daughters might have escaped the killings has provided rich spawning ground for claimants. By far the best known of these was Anna Anderson, a mysterious young woman who appeared in Berlin in 1920. Anna attracted a bizarre coterie of supporters—some of whom had known the grand duchess as a child—who risked life and limb, and often all their savings, in a desperate attempt to prove that Anastasia had, after all, survived. But who was Anna Anderson—and just how did she manage to convince so many people that she was the real Anastasia? Frances Welch’s A Romanov Fantasy is a tragic comedy in the best Russian tradition—a compelling, eerie, and frequently hilarious study of discipleship, snobbery, and life after death.",
        "Category": " Biography & Autobiography , Rich & Famous",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "High Heels And Homicide",
        "Authors": "By Michaels, Kasey",
        "Description": "While in England to watch one of her novels being shot as a major motion picture, Maggie Kelly, along with her all-to-real hero Alexandre, becomes immersed in a murder mystery when the manor house they are staying at becomes the playground of a clever killer. Original.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "The Encyclopedia of Herbs, Spices and Flavoring",
        "Authors": "By Innes, Jocasta, Boxer, Arabella, Esson, Lewis, and Parry-Crooke, Charlotte",
        "Description": "A directory to all the major herbs and spices used in cuisines all over the world includes a collection of pre-tested recipes",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Dr. Seuss: Young Author and Artist (Childhood of Famous Americans)",
        "Authors": "By Kudlinski, Kathleen V. and Henderson, Meryl (ILT)",
        "Description": "Provides an in-depth review of the life and accomplishments of this multi-talented man who revolutionized children’s literature, becoming famous for his many wonderful and celebrated children’s tales, such as Cat in the Hat and And to Think That I Saw It on Mulberry Street. Original.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Historical",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Parent in Control: Restore Order in Your Home and Create a Loving Relationship with Your Adolescent",
        "Authors": "By Bodenhamer, Gregory",
        "Description": "Parent in Control is based on a highly successful program that has helped thousands of parents regain control over their out-of-control adolescents - whether they wreak havoc at home, in school, or in the community. Living with willful, aggressive, and seemingly incorrigible adolescent behavior is a nightmare many heartbroken and confused parents were forced to endure - until now. In this straightforward, hard-hitting, yet compassionate book, Gregory Bodenhamer, a nationally renowned expert on childhood behavior problems, shows parents how to combat an arsenal that ranges from blatant verbal challenges to physical violence, without resorting to harsh disciplinary measures, expensive counseling, or hospital-based programs.Bodenhamer, a former juvenile probation officer, draws on over twenty years of experience working with difficult children between the ages of 12 and 17 and their parents to offer techniques that work in as little as a few weeks. He covers a wide range of problems - whether your teen is simply ignoring household rules, or perhaps lying, or stealing - to more harmful problems, such as drug and alcohol abuse or unsafe sexual activities. Using real-life scenarios, complete with actual dialogue, Bodenhamer walks you through potentially explosive situations, points out errors most parents frequently make, and provides tested solutions to averting immediate danger - and preventing it from happening again.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Honesty Works! Real-World Solutions to Common Problems at Work & Home",
        "Authors": "By Steven Gaffney",
        "Description": "",
        "Category": "",
        "Publisher": "JMG Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Drive Time (MIRA novel) (Charlotte McNally)",
        "Authors": "By Ryan, Hank Phillippi",
        "Description": "Investigative reporter Charlotte McNally is an expert at keeping things confidential, but suddenly everyone has a secret—and it turns out it is possible to know too much.Her latest scoop—an exposé of a dangerous car scam, complete with stakeouts, high-speed chases and hidden-camera footage—is ratings gold. But soon that leads her to a brand-new and diabolical scheme. Charlie's personal and professional lives are on a collision course, too. Her fiancé is privy to information about threats at an elite private school that have turned deadly.Charlie has never counted on happy endings. But now, just as she's finally starting to believe in second chances, she realizes revenge, extortion and murder may leave her alone again—or even dead….",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "The Body in the Fjord: A Faith Fairchild Mystery",
        "Authors": "By Page, Katherine Hall",
        "Description": "This time out, smalltown caterer and minister's wife Faith Fairchild's neighbor, Pix Miller, takes center stage, heading off to Norway to investigate the sudden disappearance of a family friend. Determined to discover the truth, Pix is drawn into a suspenseful world of intrigue, stolen antiques, secret histories, and deadly echoes from Norway's past and the Nazi occupation. Surrounded by the country's breathtaking beauty, the ever-resourceful New Englander perseveres -- until at last she finds herself face-to-face with a remorseless killer...with no way out.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Divorcing",
        "Authors": "By Belli, Melvin M., Krantzler, Mel, and Taylor, Christopher S.",
        "Description": "This is the one-step guide for all the problems you must confront. Whether you are just realizing your marriage must come to an end, or are embarking on your new life as a single person, or are at any stage in between,Divorcing reassuringly and clearly answers all the vexing questions-emotional, legal, financial-you are facing.Mel Krantzler, Ph.D., America's foremost divorce psychologist, offers uplifting advice to bring you through the emotional turmoil of divorce and let you use it as an opportunity for personal growth. His techniques for dealing with stress, coping with estrangement from spouse and children, and forming new relationships have brought Dr. Krantzler's many clients to new levels of confidence and self-esteem.Melvin M. Belli, Sr., the renowned trial attorney, gives you the same counsel his famous clients pay thousands of dollars for: How to choose the right lawyer, protect your finances, obtain the best conditions for custody and visitation, and keep your new relationships from adversely affecting child custody and support.Thoroughly up-to-date, Divorcing is one source that will keep you together, even if your marriage is breaking up.",
        "Category": " Social Science , Sociology , Marriage & Family",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Go Fug Yourself: The Fug Awards",
        "Authors": "By Cocks, Heather and Morgan, Jessica",
        "Description": "Hailed as \"the meanest queens in the cafeteria\" by the Village Voice and \"viciously funny\" by The Hollywood Reporter, Heather Cocks and Jessica Morgan entertain 3.5 million unique visitors every month via GoFugYourself.com.  Their smart, scathing dressing-down of fashion disasters has become a media sensation, with Time dubbing their website one of the fifty coolest blogs and Entertainment Weekly tagging it as one of the staff's twenty-five favorite sites on the Internet.Now, with The Fug Awards, Heather and Jessica hand out honors such as the Sag Award for most egregious misuse of breasts and the Tanorexia Award for the person most addicted to bronzer. They prove that having an unlimited budget and a coterie of hangers-on is no barrier against committing glaring, eye-stinging sartorial missteps. No celebrity, no matter how respected or revered, is beyond their reach. Not merely cutting, but also genuinely witty and slyly perceptive, The Fug Awards is celebrity schadenfreude at its hilarious best.",
        "Category": " Design , Fashion & Accessories",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.66",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Country Dolls",
        "Authors": "By Better Homes and Gardens Books",
        "Description": "Provides instructions for creating heirloom dolls, a bride doll, prairie dolls, scrap-bag dolls, and dolls made from wood, cloth, and natural materials such as pinecones, leaves, shells, and corn husks",
        "Category": " Art , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "the Ultimate Cooking Course and Kitchen Encyclopedia",
        "Authors": "By Carole CLEMENTS",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "24.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Powerfood Nutrition Plan",
        "Authors": "By Kleiner, Susan M.",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale Press, Inc.",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Secret of the Spa (Nancy Drew: Girl Detective, No. 9)",
        "Authors": "By Keene, Carolyn",
        "Description": "When I scored tickets to the grand opening of a new spa in town, I knew I had to take Bess. George came along, too, but she's been acting so weird. I knew this wouldn't be her idea of a total blast, but she's just been no fun at all. It's unlike her to be such a grouch!  But then, this new spa isn't turning out to be much fun, either. Deirdre's here, for starters. And someone's tampering with the food, and trying to take the \"luxury\" out of this otherwise luxurious place. Something stinks in this spa, and if I can't sniff it out, my name's not Nancy....",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Essential George Washington: Two Hundred Years of Observations on The Man, The Myth, The Patriot (Images from the Past)",
        "Authors": "By Hannaford, Peter (EDT)",
        "Description": "A former Mount Vernon Ladies' Association advisor enlists 61 voices, most supporting his view that Washington would still make a good president today, from First Lady Abigail Adams to columnist George Will. Includes biographical milestones. Lacks an index. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Images From The Past",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "This Is A Souvenir: The Songs Of Spearmint & Shirley Lee",
        "Authors": "By Parsons, James (ILT) and Chan, Jonathan (ILT)",
        "Description": "In the spirit of Image's bestselling anthologies Comic Book Tattooand Put the Book Back on the Shelf, this all-new anthology re-interpretsthe songs of British indie group Spearmint as short stories by the some of mostunique voices.",
        "Category": " Comics & Graphic Novels , Anthologies",
        "Publisher": "Image Comics",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Cats in the Sun",
        "Authors": "By Silvester, Hans",
        "Description": "Praised by The Atlantic Monthly as \"...the finest pictures ever taken of cats,\" Cats in the Sun is now available in a stunning paperback edition. An international favorite since its original hardcover publication in Spring 1994, this spectacular collection of enthralling, full-color photographs portrays an array of serendipitous and thoroughly charming cats against a backdrop of the beautiful Greek Isles. Combining the romantic beauty of the Mediterranean and the delightful behavior of felines, Cats in the Sun will appeal to cat lovers, travelers, and photographers alike.",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Ultimate Spy (expanded)",
        "Authors": "By Melton, H. Keith, Helms, Richard (FRW), and Wolf, Markus (FRW)",
        "Description": "The insider's guide to the secret world of espionage in a revised, expanded edition. From the Civil War to the present day, learn about famous spies throughout history, how they were recruited, and what really happened in some of their most daring missions in history. With more than 600 full-color photographs and illustrations, detailed accounts of formerly secret operations, descriptions of spy equipment and techniques used to gather information, The Ultimate Spy is the insider's guide to the secret world of espionage.",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "DK",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Merriam-Webster's Alphabet Book",
        "Authors": "By Heller, Ruth",
        "Description": "Uses color illustrations and simple text to introduce young readers to the different sounds each letter of the alphabet makes when spoken.",
        "Category": " Juvenile Nonfiction , Concepts , Alphabet",
        "Publisher": "Merriam Webster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Gardening with Children",
        "Authors": "By Richardson, Beth",
        "Description": "Involving children in gardening activities can be rewarding for both the adults and the children. This splendid, full-color book is devoted to creating an adult-centered garden that includes and celebrates children's efforts in the garden. Beth Richardson offers innovative and creative ways to start a family garden in which children can work and dream and feel accomplished -- and have some fun, too. Her approach is aimed at having children help without allowing them to feel overwhelmed by the responsibility for a whole garden. This book will help parents as they instruct their children on the basic processes that support life. The projects are accessible and fun for today's busy families.-- For anyone who enjoys parenting and gardening.-- A practical guide to family gardening.-- Projects and recipes take children's tastes into consideration without sacrificing the food and design preferences of adults.-- Introduces children to many cultures through food.-- Includes theme gardens for those interested in gardening on a smaller scale.",
        "Category": " Gardening , Reference",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Golfgames: The Side Games We Play and Wager",
        "Authors": "By Ussak, Rich",
        "Description": "",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Organized Crime",
        "Authors": "By Paul Lunde",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Treasury of Fairy Tales",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Transedition Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    }
]