[
    {
        "Title": "Lima Nights",
        "Authors": "By Arana, Marie",
        "Description": "From a National Book Award finalist—for her memoir American Chica—and the author of the acclaimed novel Cellophane comes this spare, powerful story of sexual obsession and its consequences.Carlos Bluhm leads the good life in upper-class Lima: he attends social functions with his elegant wife, goes out drinking with his three best friends, has the occasional, fleeting assignation. . . . Until he meets Maria Fernandez, a dancer at a tango bar in a rough part of town. The beautiful sixteen-year-old intoxicates him. An indigenous dark-skinned Peruvian, she represents everything his safe white world does not, and soon he can’t get her out of his mind. They begin a passionate affair, one that will destroy his marriage and shatter the only reality he’s ever known.Flash forward twenty years: against all odds, Carlos and Maria have remained together. But when Maria finally presses for a formal commitment, feelings long suppressed erupt in a tense endgame that sends both of them hurtling toward a dangerous resolution that will forever alter their lives.Brilliantly realized, erotic, unsentimental, Lima Nights is a unique love story and a stunning work of fiction that will reverberate long after its final page.",
        "Category": " Fiction , Literary",
        "Publisher": "The Dial Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Chew Volume 1: Tasters Choice",
        "Authors": "By Layman, John and Guillory, Rob (ILT)",
        "Description": "Special Introductory Price! Tony Chu is a detective with a secret. Aweird secret. Tony Chu is Cibopathic, which means he gets psychic impressionsfrom whatever he eats. It also means he's a hell of a detective, as long as hedoesn't mind nibbling on the corpse of a murder victim to figure out whodunit,and why. He's been brought on by the Special Crimes Division of the FDA, themost powerful law enforcement agency on the planet, to investigate theirstrangest, sickest, and most bizarre cases.  Collects CHEW #1-5.",
        "Category": " Comics & Graphic Novels , Fantasy",
        "Publisher": "Image Comics",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Numbers in the Dark: And Other Stories",
        "Authors": "By Calvino, Italo and Parks, Tim (TRN)",
        "Description": "For the first time in paperback--a volume of thirty-seven diabolically inventive stories, fables, and \"impossible interviews\" from one of the great fantasists of the 20th century, displaying the full breadth of his vision and wit.  Written between 1943 and 1984 and masterfully translated by Tim Parks, the fictions in Numbers in the Dark display all of Calvino's dazzling gifts: whimsy and horror, exuberance of style, and a cheerful grasp of the absurdities of the human condition.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Knit the Season: A Friday Night Knitting Club Novel (Friday Night Knitting Club Series)",
        "Authors": "By Jacobs, Kate",
        "Description": "The ladies of the #1 New York Times bestselling Friday Night Knitting Club return in a moving, laugh-out-loud celebration of special times with friends and family…Whipping up chocolate-orange scones at pastry school is Dakota Walker’s passion, but she’ll never give up the Friday Night Knitting Club at Walker and Daughter, the coziest yarn shop in Manhattan. The club is also a haven for Peri, Darwin, Lucie, K.C., Anita, and Catherine—Dakota’s dearest friends, big sisters, and sometimes surrogate mothers.With the holidays just around the corner, the women have reason to celebrate: There’s a special wedding planned for New Year’s Day.  And in the meantime, Dakota is finishing a sweater her mother started before she was born. As she takes on her mother’s pattern, she learns that there was much more history in these stitches than she had anticipated, and to build on her mother’s legacy, Dakota must become the woman she truly desires to be.READERS GUIDE INSIDE",
        "Category": " Fiction , Women",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2010"
        }
    },
    {
        "Title": "Miami And The Keys (Eyewitness Top 10 Travel Guides)",
        "Authors": "By Kennedy, Jeffrey",
        "Description": "Drawing on the same standards of accuracy as the acclaimed DK Eyewitness Travel Guides, The DK Top 10 Guides use exciting colorful photography and excellent cartography to provide a reliable and useful pocket-sized travel. Dozens of Top 10 lists provide vital information on each destination, as well as insider tips, from avoiding the crowds to finding out the freebies, TheDK Top 10 Guides take the work out of planning any trip.",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "DK Eyewitness Travel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Survival (Species Imperative #1)",
        "Authors": "By Czerneda, Julie",
        "Description": "Biologist Dr. Mackenzie Connor, while monitoring salmon runs at Field Station Six, is forced into helping an alien archaeologist discover the truth behind the mysterious area of space known as the Chasm after her partner is kidnapped and the Earth is attacked by an alien race called the Ro.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "DAW Hardcover",
        "Price Starting With ($)": "31.31",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Texas Glory",
        "Authors": "By Vaughan, Robert",
        "Description": "In Texas during 1836, men like Crockett, Houston, and Bowie fight their way to the Alamo and, although outnumbered forty-to-one, prepare to do battle with one of the most powerful armies in the world. Original.",
        "Category": " Fiction , Westerns",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Mice Templar Vol. 1: The Prophecy",
        "Authors": "By Glass, Bryan J. L. and Oeming, Michael Avon (ILT)",
        "Description": "The young mouse Karic seeks to rescue his family from slavery and save hispeople from rat oppression by reuniting the legendary Mice Templar. But theTemplar have been sundered by a vicious civil war, distrustful of one another,and despised by the very people they failed to protect. The fate of allcreatures now rests in the paws of one small mouse, if only he can find thecourage and strength to become one of the Templar knights himself.",
        "Category": " Comics & Graphic Novels , Fantasy",
        "Publisher": "Image Comics",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Romance Road Intimate Glimpses of Life and Work in North Africa",
        "Authors": "By Such, Georgiana Barbara",
        "Description": "",
        "Category": "",
        "Publisher": "Fleming H. Revell",
        "Price Starting With ($)": "11.38",
        "Publish Date": {
            "Month": "January",
            "Year": "1930"
        }
    },
    {
        "Title": "12 Vol. Set: American Ancestry Giving the Name and Descent in the Male Line of Americans Whose Ancestors Settled in the United States Previous to the declaration of Independence A.D. 1776",
        "Authors": "By Thomas P. Hughes",
        "Description": "",
        "Category": "",
        "Publisher": "Genealogical Publishing Company",
        "Price Starting With ($)": "204.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "In Critical Condition: The Crisis in America's Health Care",
        "Authors": "By Kennedy, Edward M.",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "169.25",
        "Publish Date": {
            "Month": "June",
            "Year": "1972"
        }
    },
    {
        "Title": "Report of the First Meeting of the Society of the Army of the Cumberland, held at Cincinnati, February, 1868.",
        "Authors": "By Society of the Army of the Cumberland.",
        "Description": "",
        "Category": "",
        "Publisher": "Robert Clarke,",
        "Price Starting With ($)": "20.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1868"
        }
    },
    {
        "Title": "The Glorious Rascal",
        "Authors": "By Justin Huntly McCarthy",
        "Description": "",
        "Category": "",
        "Publisher": "John Lane Company",
        "Price Starting With ($)": "37.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1915"
        }
    },
    {
        "Title": "Nineteenth Century Art, by D. S. Maccoll; with a Chapter on Early Art Objects, by Sir T. D. Gibson-Carmichael, Baronet.  With Illustrations from Pictures and Objects in the Fine Art Loan Collection of the Glasgow International Exhibition, 1901",
        "Authors": "By MacColl, D. S. (Dugald Sutherland) and Gibson-Carmichael, Sir T. D.",
        "Description": "",
        "Category": "",
        "Publisher": "J. MacLehose & Sons",
        "Price Starting With ($)": "16.5",
        "Publish Date": {
            "Month": "January",
            "Year": "1902"
        }
    },
    {
        "Title": "Campaigns of the Army of the Potomac;: A critical history of operations in Virginia, Maryland and Pennsylvania, from the commencement to the close of the war, 1861-1865,",
        "Authors": "By William Swinton",
        "Description": "",
        "Category": "",
        "Publisher": "C. Scribner's Sons",
        "Price Starting With ($)": "24.73",
        "Publish Date": {
            "Month": "January",
            "Year": "1882"
        }
    },
    {
        "Title": "1 is One",
        "Authors": "By Tasha Tudor",
        "Description": "",
        "Category": "",
        "Publisher": "Henry Z. Walck, Inc., New York",
        "Price Starting With ($)": "15.67",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "The Six Directions of Space",
        "Authors": "By Reynolds, Alastair",
        "Description": "",
        "Category": " Fiction , Science Fiction , Space Opera",
        "Publisher": "Subterranean",
        "Price Starting With ($)": "172.0",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "The Cloud-Climbing Railroad",
        "Authors": "By Dorothy Jensen Neal",
        "Description": "",
        "Category": "",
        "Publisher": "Alamogordo Printing",
        "Price Starting With ($)": "18.15",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Military operations in Jefferson County, Virginia and West Virginia 1861-1865",
        "Authors": "By Chew, Roger Preston",
        "Description": "",
        "Category": "",
        "Publisher": "Whitney & White",
        "Price Starting With ($)": "14.84",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "Ferdinand Penker: a murder of crows",
        "Authors": "By Ferdinand Penker",
        "Description": "",
        "Category": "",
        "Publisher": "Ritter",
        "Price Starting With ($)": "23.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Holy Bible Containing the Old and New Testaments, Translated Out of the Original Tongues, and with the Former Translations Diligently Compared and Revised Holman Edition",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "A. J. Holman",
        "Price Starting With ($)": "24.73",
        "Publish Date": {
            "Month": "January",
            "Year": "1900"
        }
    },
    {
        "Title": "French Industry During the War.",
        "Authors": "By Fontaine, Arthur.",
        "Description": "",
        "Category": "",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "15.46",
        "Publish Date": {
            "Month": "January",
            "Year": "1926"
        }
    },
    {
        "Title": "American Banjo Clocks",
        "Authors": "By Steven Philip Petrucelli, Sposato, Kenneth A.",
        "Description": "",
        "Category": "",
        "Publisher": "Adams Brown Co",
        "Price Starting With ($)": "97.28",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Tall, Dark and Dangerous: Prince Joe / Forever Blue",
        "Authors": "By Brockmann, Suzanne",
        "Description": "New York Times and USA TODAY bestselling author Suzanne Brockmann returns with two classic tales of courageous men who face the most daring adventure of all—falling in love.Prince Joe Media consultant Veronica St. John has been hired to teach a rugged Navy SEAL to impersonate a European prince who has been targeted by terrorists. But one conversation and Veronica knows there's no way she can turn streetwise New Yorker Joe Catalanotto into nobility. Joe, on the other hand, is confident he's got what it takes to complete his mission. Two days isn't a lot of time to get the job done…but it's just enough time to fall in love.Forever Blue Lucy Tait has fantasized about Blue McCoy since high school. With the Navy SEAL back in town, nothing's changed…except that Lucy's a police officer and Blue's been charged with murder. As the investigation heats up, so does their relationship. Now they're working to save Blue's future—before they lose their hearts.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Double Deception",
        "Authors": "By Dorothy P. O'Neill",
        "Description": "",
        "Category": "",
        "Publisher": "Worldwide",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Indefensible (A Kate Lange Novel, 2)",
        "Authors": "By Callow, Pamela",
        "Description": "When Elise Vanderzell plummets from her bedroom balcony one gorgeous summer night, her children awaken to a nightmare.Their mother is dead.Their father is charged with her murder.Lawyer Kate Lange knows all about nightmares. She's survived the darkest period of her troubled life and the wounds are still raw. Now she's been handed a case that seems utterly unwinnable: defending her boss, high-profile lawyer Randall Barrett. A prosecutor's dream suspect, Randall is a man who was cuckolded by his ex-wife. A man who could not control his temper. A man who had argued bitterly with the victim the previous day in full view of the children.With limited criminal law experience, Kate finds herself enmeshed in a family fractured by doubt. Randall's teenage son is intent on killing him. His daughter wants only to feel safe again. And the entire legal community would like nothing better than to see Randall receive a public comeuppance. As Kate races to stay a step ahead of the prosecution, a silent predator is waiting for the perfect time to deal the final blow.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "CliffsNotes on Stowe's Uncle Tom's Cabin (Frommer's)",
        "Authors": "By Thornburg, Mary K. Patterson and Thornburg, Thomas",
        "Description": "The original CliffsNotes study guides offer expert commentary on major themes, plots, characters, literary devices, and historical background. The latest generation of titles in this series also feature glossaries and visual elements that complement the classic, familiar format.In CliffsNotes on Uncle Tom's Cabin, you discover Harriet Beecher Stowe's most memorable and socially relevant novel -- a book that, when published in 1852, galvanized public opinion against slavery in a way never seen before. The story follows the lives of two slaves: Eliza, who escapes slavery with her son, and Tom, who must endure humiliation, abuse, and torture inflicted by his owners.This study guide takes you though Eliza and Tom's journeys by providing summaries and commentaries on each chapter of the novel. Critical essays give you insight into the major themes of the novel, as well as the novel's structure and Gothic elements. Other features that help you study includeCharacter analyses of the main charactersA character map that graphically illustrates the relationships among the charactersA section on the life and background of Harriet Beecher StoweA review section that tests your knowledgeA Resource Center full of books, articles, films, and Internet sitesClassic literature or modern modern-day treasure — you'll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Literary Criticism , American , General",
        "Publisher": "CliffsNotes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Pni: The New Mind/Body Healing Program",
        "Authors": "By Dacher, Elliott S.",
        "Description": "Examines the new science of psychoneuroimmunology, which combines ancient healing traditions with modern medical technology, and demonstrates how mind/body healing helps to prevent disease, reduce the risk of illness, and aid in recovery",
        "Category": " Body, Mind & Spirit , Healing , General",
        "Publisher": "Marlowe & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "1001 Things You Didn't Know You Wanted To Know",
        "Authors": "By Anna Mantzaris",
        "Description": "",
        "Category": "",
        "Publisher": "Gusto Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Birdie's Book (The Fairy Godmother Academy #1)",
        "Authors": "By Bozarth, Jan and Burden, Andrea (ILT)",
        "Description": "Where do fairy godmothers come from?  When Birdie goes to visit her grandmother  for the first time, she learns that her grandmother is a fairy godmother—which means  Birdie's a fairy godmother too! Trained by fairies in a magical land called Aventurine,  human fairy godmothers have been hidden protectors of the world for centuries. Birdie' s family talisman, a singing stone, has been broken, and now only Birdie can use  the stone to travel to Aventurine to repair it. When she gets there she meets Kerka,  a warrior-like girl who has been sent to help her find the other half of the stone.  Will Birdie and Kerka have the knowledge and strength to banish the shadow that has  come over both the garden in Aventurine and Birdie's family? One thing's for sure—no  one who travels to Aventurine will ever be the same again!For girls who are fans of Harry Potter and have outgrown the Disney Fairies series and the American Girl books, the Fairy Godmother Academy is the perfect series—fantasy books filled with magic and adventure but grounded by contemporary girls and issues.The series boasts an amazing Web site that allows girls to enter the world they visit in the books. There they can do activities both on- and offline, vote for things they'd like to see in the books, and connect with other Fairy Godmother Academy fans.Join the Fairy Godmother Academy!Visit the Web site for games, activities, and networking with friends!www.fairygodmotheracademy.com",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "The Concise Cambridge Italian Dictionary (Reference) (Italian Edition)",
        "Authors": "By Reynolds, Barbara",
        "Description": "A two-way dictionary in which specialized terms are fully represented is based on the lingua parlata of today and indicates range and limitations of usage of vocabulary, phrases, and idioms",
        "Category": " Reference , Dictionaries",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1975"
        }
    },
    {
        "Title": "Ronald Reagan: The Power of Conviction and the Success of His Presidency",
        "Authors": "By Wallison, Peter J.",
        "Description": "An icon of the twentieth century, Ronald Reagan has earned a place among the most popular and successful U.S. presidents. In this compelling firsthand account of Reagan’s presidency, Peter J. Wallison, former White House Counsel to President Reagan, asserts that Reagan took office with a fully developed public philosophy and strategy for governing that was unique among modern presidents. “I am not a great man,” Reagan once said, “just committed to great ideas.” Wallison shows how Reagan’s unyielding attachment to certain key ideas—communicated through his speeches—created a cohesive administration and revived the spirit of the nation. Reagan limited his personal efforts to those issues he considered central to his presidency, choosing to delegate to his cabinet and staff those matters he viewed as secondary to his agenda. This leadership style was responsible for Reagan’s accomplishments, but also for his missteps and the criticism he received from his detractors.During his presidency, Reagan experienced both enormous success—in the unprecedented growth of the economy, the first arms reduction agreement with the former Soviet Union, and the revival of confidence in America—and near disaster in the Iran-Contra affair. In Ronald Reagan, Wallison describes what it was like to be on Reagan’s White House staff and how Reagan’s attachment to principle produced both the best and worst days of his presidency.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Spare the Rod: Breaking the Cycle of Child Abuse (Parenting / Social Concerns and Issues)",
        "Authors": "By Quinn, Phil E.",
        "Description": "Clears up misconceptions about childhood, parenting, and discipline, argues that all violence against children is wrong, including spanking, and suggests a more positive approach to the prevention of child abuse",
        "Category": " Religion , General",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "The O. Henry Prize Stories 2006: The Best Stories of the Year",
        "Authors": "By Furman, Laura (EDT)",
        "Description": "A radiant reflection of contemporary fiction at its best, The O. Henry Prize Stories 2006 features stories from locales as diverse as Russia, Zimbabwe, and the rural American South. Series editor Laura Furman considered thousands of stories in hundreds of literary magazines before selecting the winners, which are accompanied here by short essays from each of the three eminent jurors on his or her favorite story, as well as observations from all twenty prize winners on what inspired them. Ranging in tone from arch humor to self-deluding obsessiveness to fairy-tale ingenuousness, these stories are a treasury of potential classics.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Anchor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Zero-G",
        "Authors": "By Gansky, Alton",
        "Description": "Poised to make history, SpaceVentures, Inc., hovers on the brink of launching the first commercial space flight. And Benjamin 'Tuck' Tucker's skill and reputation have thrust the new company into the forefront in this powerful new space race. A veteran astronaut and national hero, Tuck accepts the coveted honor---and the risk---of piloting the Legacy on her maiden space voyage. The danger is far greater than just the perceived risks. The real threat, a plot far deadlier than anyone could have imagined, is exposed as Legacy reaches the suborbital regions of space. Suspended seventy miles above Earth, Tuck must use his skill and his faith---faith in a God he has found it hard to trust since a deadly tragedy in space over a year before---as he fights an unknown enemy who will not hesitate to kill again.",
        "Category": " Fiction , Christian , Suspense",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Annabel the Actress Starring in Just A Little Extra (Ready-For-Chapters)",
        "Authors": "By Conford, Ellen and Williams-Andriani, Renee (ILT)",
        "Description": "Maggie's  mouth dropped open. \"I don't believe it. You got discovered?\" \"Well,\" Annabel said, \"maybe not exactly discovered. But maybe very close to being almost discovered.\"  When aspiring actress Annabel sees the movie company vans roll into her neighborhood, she is determined that this will be her big break. With her friend Maggie by her side, Annabel schmoozes her way onto the set and lands a role as an extra! She stays up all night watching scary movies and screaming at the top of her lungs to practice for her part. However, when the day of shooting arrives, everything goes wrong and Annabel's five seconds of stardom turn into a disaster. But her career's not over yet. Annabel doesn't know it but the director has some tricks up his sleeve...Annabel's mishaps will have readers laughing out loud in this follow-up to Annabel the Actress starring in Gorilla My Dreams.  Maggie's  mouth dropped open. \"I don't believe it. You got discovered?\" \"Well,\" Annabel said, \"maybe not exactly discovered. But maybe very close to being almost discovered.\"  When aspiring actress Annabel sees the movie company vans roll into her neighborhood, she is determined that this will be her big break. With her friend Maggie by her side, Annabel schmoozes her way onto the set and lands a role as an extra! She stays up all night watching scary movies and screaming at the top of her lungs to practice for her part. However, when the day of shooting arrives, everything goes wrong and Annabel's five seconds of stardom turn into a disaster. But her career's not over yet. Annabel doesn't know it but the director has some tricks up his sleeve...Annabel's mishaps will have readers laughing out loud in this follow-up to Annabel the Actress starring in Gorilla My Dreams.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Simon & Schuster Children's Publishing",
        "Price Starting With ($)": "7.67",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Mister X (A Frank Quinn Novel)",
        "Authors": "By Lutz, John",
        "Description": "Fear Leaves A MarkHe mutilates his victims. Slices their throats. And carves an X into their flesh. Five years ago, he claimed the lives of six women. Then the killings abruptly stopped--no one knows why. Ex-homicide detective Frank Quinn remembers. Which is why he's shocked to see one of the dead women in his office. Actually, she's the identical twin of the last victim, and she wants Quinn to find her sister's murderer. But when the cold case heats up, it attracts the media spotlight--and suddenly the killings start again.  .  .\"A Heart-Pounding Roller Coaster Of A Tale.\"--Jeffery Deaver on Night Victims\"Lutz Is Among The Best.\"--San Diego Union\"Lutz Is In Rare Form.\"--The New York Times Book Review on Chill of Night \"Lutz knows how to make you shiver.\"--Harlan Coben",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Pinnacle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Escape from Memory",
        "Authors": "By Haddix, Margaret Peterson",
        "Description": "While playing around with hypnotism at a party, Kira remembers fleeing a war-torn country with her mother, speaking a language she can't identify. A few days later her mother disappears, and a woman who calls herself Kira's aunt Memory takes Kira to Crythe, a country that doesn't officially exist, in order to rescue her -- or so she says.  Kira soon learns that Aunt Memory is not what she seems, and Kira and her mother are both in terrible danger. There are memories locked in Kira's mind that could get her and her mother killed. But those memories are the only things that might save them...",
        "Category": " Young Adult Fiction , Action & Adventure , General",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "The Cat Ate My Gymsuit (Puffin Modern Classics)",
        "Authors": "By Danziger, Paula",
        "Description": "A gorgeous new package for Paula Danziger’s backlist with an introduction from Ann Martin!Marcy's life is a mess. Her parents don't understand her, she feelslike a fat blimp with no friends, and her favorite teacher just got fired. Ms. Finney wasn't like the other teachers, and she was helping Marcy feel good about being herself. Now that she's gone, Marcy doesn't know what to do. She's always thought things would be better if she could just lose weight, but the loss of Ms. Finney sparks something inside her. She decides to join the fight to bring back her teacher, and in doing so, she discovers that her voice might matter more than she ever realized. Paula Danziger’s novels are hilarious, genuine, and full of dynamic female characters that have won the hearts of her readers and turned her books into beloved classics. These playful covers full of charming details capture the spirit of Paula’s stories and will brighten up the book­shelves of her fans and a new generation of readers.",
        "Category": " Young Adult Fiction , Family , General",
        "Publisher": "PUFFIN BOOKS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Girl Overboard (A Justina Chen Novel)",
        "Authors": "By Headley, Justina Chen",
        "Description": "The worst thing about having it all is having to deal with it all-the good, the bad, and the just plain weird. Like seeing more of my dad when he's on the cover of Business Week than I do in person. Like the surgeon whose schedule was too jammed with professional ballplayers to deal with my busted up knee...until he heard who my parents were and miraculously his calendar was wide open. Like the pseudo boyfriend who was more in love with my last name than with me.Everybody thinks Syrah is the golden girl. After all, her father is Ethan Cheng, billionaire, and she has everything any kid could possibly desire, right down to a waterfront mansion, jet plane, and custom-designed snowboards. But most of what glitters in her life is fool's gold. Her half-siblings hate her, her best friend Adrian's girlfriend is ruining their friendship, and her own so-called boyfriend is after her for her father's name. When her broken heart results in a snowboarding accident that exiles her from the mountains--the one place where she feels free and accepted for who she is, not what she has--Syrah must rehab both her busted-up knee, and her broken heart, and learn that she's worth her weight in real gold.",
        "Category": " Young Adult Fiction , People & Places , United States , Asian American",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Witchblade Volume 1: Witch Hunt",
        "Authors": "By Marz, Ron and Choi, Mike (CON)",
        "Description": "Superstar writer Ron Marz (Ion, The Darkness) begins hisground-breaking run on Witchblade and, along with artist Mike Choi, givesnew readers a perfect jumping-on point! Sara Pezzini awakens from a coma and begins anew with a new partner, newprecinct, and a new understanding of the Witchblade. Collecting Witchblade issues #80-85.",
        "Category": " Comics & Graphic Novels , Fantasy",
        "Publisher": "Image Comics",
        "Price Starting With ($)": "6.98",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Killer Of Demons",
        "Authors": "By Yost, Christopher and Wegener, Scott (ILT)",
        "Description": "Hell has invaded Earth and only one man can stop it — junior accountexecutive Dave Sloan, aka the Killer of Demons! With an angel by his side, Davecan see the demons that have infiltrated our world... and they all have to die!But these 'demons' are mostly Dave's co-workers, or people that annoy Dave insome way, leading him to believe that he's gone totally insane. Or has he? Davehas to fight to survive and find out the truth, but is he a whacked-outmass-murderer, or the last hope the world has against the forces of Hell?Collecting the critically acclaimed mini-series from the writer of Marvel'sX-Force and the artist of the Eisner-nominated Atomic Robo.  Collects Killer of Demons #1-3.",
        "Category": " Comics & Graphic Novels , Fantasy",
        "Publisher": "Image Comics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Consumer Guide to Home Energy Savings",
        "Authors": "By Wilson, Alex",
        "Description": "A guide to saving energy at home discusses heating and cooling systems, water heaters, and other major appliances, and offers advice on using them effectively",
        "Category": " Technology & Engineering , Power Resources , General",
        "Publisher": "Amer Council for an Energy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Finance And Accounting For Nonfinancial Managers",
        "Authors": "By Droms, William G.",
        "Description": "Mastering the fundamentals of financial management is a must for all managers with a stake in their company’s and their own professional future. Packed with step-by-step examples and illustrative case studies, and fully updated to reflect the latest changes in tax laws and accounting requirements, Finance and Accounting for Nonfinancial Managers is the resource for every professional or student eager to acquire a comprehensive understanding of managerial finance in action.With Finance and Accounting for Nonfinancial Managers you’ll become an expert on all major aspects of financial management including: long-term investment decisions reading a balance sheet working capital management inventory-control policy breakeven analysis for profit planning mastering the accounting cycle corporate income taxes valuing closely held companies",
        "Category": " Business & Economics , Accounting , Financial",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Cooking Art: Easy Edible Art for Young Children",
        "Authors": "By Kohl, Maryann F., Potter, Jean, and Roseman-Hall, Ronni (ILT)",
        "Description": "Transform the classroom into an artist&#39;s studio with these easy edible art experiences. Organized by theme, such as Shapes & Forms and Color & Design, Cooking Art combines the familiar area of art exploration with the fascinating world of cooking, including all its wondrous tools, tastes and outcomes. Includes recipes for snacks, sandwiches, drinks, desserts, breads, fruit as well as pet treats.  Each recipe allows ample room for cooking artists to explore and create in their own special ways!",
        "Category": " Cooking , General",
        "Publisher": "Gryphon House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "The Sea-Wolf (Modern Library Classics)",
        "Authors": "By London, Jack",
        "Description": "A thrilling epic of a sea voyage and a complex novel of ideas, The Sea-Wolf is a standard-bearer of its genre. It is the vivid story of a gentleman scholar, Humphrey Van Weyden, who is rescued by a seal-hunting schooner after a ferryboat accident in San Francisco Bay. London uses Van Weyden's ordeal at the hands of a schooner's devious crew to explore powerful themes of ambition, courage, and the innate will to survive. The Sea-Wolf also introduces Jack London's most memorable, fully realized character, Wolf Larsen, the schooner's brutal captain, who ruthlessly crushes anyone standing in his way. As Gary Kinder states in his Introduction, \"Wolf Larsen is one of the most carefully carved characters in American literature....London, himself, seems as fascinated as the reader with his own creation.\"",
        "Category": " Fiction , Literary",
        "Publisher": "Modern Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Pat-A-Cake and Other Play Rhymes",
        "Authors": "By Tiegreen, Alan (ILT), Cole, Joanna, and Calmenson, Stephanie",
        "Description": "What's the first game you ever learned? Chances are it wasn't hide-and-seek but pat-a-cake, the traditional play rhyme. This brand-new collection features step-by-step instructions for playing pat-a-cake and twenty-five other favorites. \"A perfect gift for any new parent, or grandparent.\"--Kirkus Reviews.",
        "Category": " Juvenile Fiction , Nursery Rhymes",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Stoker's Dracula (Cliffs Notes)",
        "Authors": "By Umland, Samuel J.",
        "Description": "The original CliffsNotes study guides offer a look into critical elements and ideas within classic works of literature. The latest generation of titles in this series also features glossaries and visual elements that complement the classic, familiar format.CliffsNotes on Dracula digs into the story of a count who survives by sipping the blood from living (and unsuspecting) donors.Following the hauntingly frightful tale of vampires and victims, this study guide provides summaries and commentaries for each chapter within the nineteenth-century novel. Other features that help you figure out this important work include A look into the life of the author, Bram StokerCharacter list and plot synopsisAn essay exploring the influence of German Expressionism on the American horror filmA list of Dracula film productions, with ratings for eachSuggested discussion questionsClassic literature or modern-day treasure—you&#39;ll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "CliffsNotes",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "July",
            "Year": "1983"
        }
    },
    {
        "Title": "Extra Cheese, Please!: Mozzarella's Journey from Cow to Pizza",
        "Authors": "By Peterson, Cris and Upitis, Alvis (PHT)",
        "Description": "Every Friday on their farm, Cris Peterson and her family make pizza. The only unusual thing about this is that the cheese they use on top of the pizza comes from the cows in their own barn. Ms. Peterson and her husband, Gary, own and run a dairy farm in Wisconsin. In this clear and concisely written book, the author outlines the steps of cheese making for younger readers--beginning with the moment a calf is born and its mother first gives milk. Alvis Upitis, an internationally known photographer, has documented the process from start to finish. In an age when America's farms often seem a long way off from the stores that sell their products, this book shows the link between milk and cow, cheese and pizza.",
        "Category": " Juvenile Nonfiction , Science & Nature , General",
        "Publisher": "Boyds Mills Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Schroeder's Antiques Price Guide (Schroeder's Antiques Price Guide, 19th ed)",
        "Authors": "By Huxford, Sharon (EDT), Huxford, Bob (EDT), Huxford, Bob, and Huxford, Sharon",
        "Description": "Lists current prices for pottery, tools, figurines, books, glassware, toys, quilts, miniatures, and movie memorabilia.",
        "Category": " Antiques & Collectibles , General",
        "Publisher": "Collector Books",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Workbook for Pharmacology: Principles and Applications: A Worktext for Allied Health Professionals",
        "Authors": "By Fulcher, Eugenia M., Fulcher, Robert M., and Soto, Cathy Dubeansky",
        "Description": "Reinforce learning and practice key concepts with WORKBOOK FOR PHARMACOLOGY: PRINCIPLES AND APPLICATIONS: A WORKTEXT FOR ALLIED HEALTH PROFESSIONALS, 2nd Edition. This worktext is designed to strengthen your understanding of basic terminology, dosage calculation, medication administration, and more to make learning easier than ever.Critical Thinking Exercises provide you with thought provoking questions on how to deal with a variety of realistic situations.Math Calculation Exercises offer additional practice to help you master often-difficult concepts.Drug Dosage and Calculation exercises give you an opportunity to better understand key concepts and applications.",
        "Category": " Medical , Pharmacology",
        "Publisher": "Saunders",
        "Price Starting With ($)": "5.73",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "The Walking Dead, Vol. 10: What We Become",
        "Authors": "By Kirkman, Robert, Adlard, Charlie (ILT), Rathburn, Cliff (CON), and Wooton, Rus (CON)",
        "Description": "The world we knew is gone. The world of commerce andfrivolous necessity has been replaced by a world of survival and responsibility.An epidemic of apocalyptic proportions has swept the globe, causing the dead torise and feed on the living. In a matter of months society has crumbled: nogovernment, no grocery stores, no mail delivery, no cable TV. In a world ruledby the dead, the survivors are forced to finally start living.Out on their own, danger lurking around every corner, our ragged band ofsurvivors tries to live long enough to reach Washington D.C.  Collects The Walking Dead #55-60.  Reprint Edition",
        "Category": " Comics & Graphic Novels , Horror",
        "Publisher": "Image Comics",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "The League of Extraordinary Gentlemen Volume 3: Century #1 1910",
        "Authors": "By Moore, Alan and O'Neill, Kevin (CON)",
        "Description": "One of Three. The new volume chronicling the exploits of Wilhelmina Murray and her extraordinary colleagues, Century is an epic spanning almost a hundred years. Divided into three 80-page chapters — each a self-contained narrative to avoid frustrating cliffhanger delays between episodes — this monumental tale takes place in three distinct eras, building to an apocalyptic conclusion occurring in our own, current, twenty-first century.Chapter One is set against the backdrop of London, 1910, twelve years after the failed Martian invasion and nine years since England put a man on the moon. In the bowels of the British Museum, Carnacki the ghost-finder is plagued by visions of a shadowy occult order who are attempting to create something called a Moonchild, while on London's dockside the most notorious serial murderer of the previous century has returned to carry on his grisly trade. Working for Mycroft Holmes' British Intelligence alongside a rejuvenated Allan Quartermain, the reformed thief Anthony Raffles and the eternal warrior Orlando, Miss Murray is drawn into a brutal opera acted out upon the waterfront by players that include the furiously angry Pirate Jenny and the charismatic butcher known as Mac the Knife.",
        "Category": " Comics & Graphic Novels , Science Fiction",
        "Publisher": "Top Shelf Productions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Everyone's a Critic (Drama!)",
        "Authors": "By Ruditis, Paul",
        "Description": "School's out, but the drama never stops at the superposh Orion Academy. Hartley Blackstone -- the famous director, producer, choreographer, and genuine Broadway icon -- has chosen Orion to hold auditions for one lucky guy and girl to attend his summer theater program in New York City.   Naturally, every wannabe-It girl and boy at Orion is going mad, prepping to win Blackstone's approval. With any luck, it could be Bryan and his BFF, Sam, stepping onto a Broadway stage.   But Mr. Blackstone, known for his notoriously harsh critiques, is capable of crushing hearts and shattering dreams with a single word. Bryan will need more than his snarky wit and cute smile for this one. He's got to bring it!   Now if he could just figure out exactly what it is....",
        "Category": " Young Adult Fiction , Humorous , General",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "The Possum Always Rings Twice (11) (Chet Gecko)",
        "Authors": "By Hale, Bruce",
        "Description": "Get ready for muckraking time at Emerson Hicky Elementary. The race is on for student council president, but it's quickly getting fishier than the bottom of a pelican's lunch box. Someone is sending candidates ominous threats and posting signs with messages like FIR IS FIRST! and DOWN WITH FEATHERS. Could someone be trying to rig the election? Good thing Chet and Natalie are around to expose the filthy frauds!",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "The Science Book of Color: The Harcourt Brace Science Series",
        "Authors": "By Ardley, Neil",
        "Description": "Fun-packed science projects and experiments introduce readers to basic science principles. Full-color photographs and easy-to-follow text guide children through creative experiments using common materials, while practical examples relate each experiment to the world around us. “The handsome design and illustration of the series make it an inviting choice for library collections.”--Booklist  “Clear, well-spaced photographs, good instructions, and appropriate warning typify this series of experiment books for middle graders.”--The Horn Book",
        "Category": " Juvenile Nonfiction , Science & Nature , Experiments & Projects",
        "Publisher": "Gulliver Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Rose Blanche",
        "Authors": "By Innocenti, Roberto and Gallaz, Christophe",
        "Description": "During World War II, a young German girl's curiosity leads her to discover something far more terrible than the day-to-day hardships and privations that she and her neighbors have experienced.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Creative Education, (1985)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "January Joker (Calendar Mysteries, No. 1)",
        "Authors": "By Gurney, John Steven (ILT) and Roy, Ron",
        "Description": "It’s a mystery every month from popular A to Z Mysteries author Ron Roy! With the younger siblings of the A to Z Mysteries kids!January is for Joker... In the first book of the Calendar Mysteries—an early chapter book mystery series—Green Lawn has a problem! When Bradley Pinto wakes up in the night to strange lights in his backyard, he wonders if there are aliens in town. When he sees three-toed tracks in the snow, he's sure of it. His twin, Brian, and friends Lucy and Nate aren't so certain. But then Lucy's cousin Dink, the twins' brother Josh, and Nate's sister Ruth Rose all disappear. Are there really aliens in Green Lawn? And where could they be taking Dink, Josh, and Ruth Rose? Parents, teachers, and librarians agree that these highly collectible chapter books are perfect for emerging readers and any kid who love mysteries!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Chilton's Import Car Manual 1992-1996 (Chilton's Import Auto Service Manual)",
        "Authors": "By Freeman, Kerry A. (EDT), Rivele, Richard J. (EDT), Morgantini, Dean F. (EDT), Settle, W. Calvin (EDT), D'Andrea, Nicholas L. (EDT), Gaffney, Debra (EDT), Gordon, Jacques (EDT), Grady, Michael L. (EDT), Maher, Kevin M. G. (EDT), Smith, Richard T. (EDT), Taylor, Jim (EDT), and Webb, Ron (EDT)",
        "Description": "Covers all major cars imported into the U.S. and Canada and includes specifications, a troubleshooting guide, and maintenance and repair instructions",
        "Category": " Transportation , Automotive , Repair & Maintenance",
        "Publisher": "W G Nichols Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Sports (Great Lives)",
        "Authors": "By Sullivan, George",
        "Description": "",
        "Category": " Juvenile Fiction , Sports & Recreation , General",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Prayer: Opening Your Heart to God (Interactions)",
        "Authors": "By Hybels, Bill, Harney, Kevin, and Harney, Sherry",
        "Description": "It’s time to make time for God. The Creator of the universe wants to have a dynamic relationship with you. The key is prayer. Authentic, courageous, direct communication with God. Each session in Prayer will give you a new window of insight. You’ll receive courage to lift “dangerous prayers” with a confident heart. You’ll discover how to handle the disappointment of unanswered prayer. And you’ll be moved to a depth of honesty in prayer that will surprise you. If you long for a spiritual life that is deep, fruitful, and profoundly real, these studies will help you draw heart to heart with God.Interactions—a powerful and challenging tool for building deep relationships between you and your group members, and you and God. Interactions is far more than another group Bible study.  It's a cutting-edge series designed to help small group participants develop into fully devoted followers of Christ.",
        "Category": " Religion , Prayer",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Dead@17: Ultimate Edition",
        "Authors": "By Howard, Josh",
        "Description": "When 17-year-old Nara Kilday is murdered at the hands of a demonic cult, thequiet suburb of Darlington Hills is turned upside down. But when Narainexplicably returns form the dead, what seems like a miracle at first may infact spell the end for mankind! This volume collects the entire DEAD@17 saga: DEAD@17,DEAD@17: Blood of Saints, DEAD@17: Revolution, and DEAD@17: The13th Brother.",
        "Category": " Comics & Graphic Novels , Manga , General",
        "Publisher": "Image Comics",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Hoofbeats",
        "Authors": "By McFarland, Cynthia",
        "Description": "Chronicling the development of a thoroughbred horse, this illustrated work describes the horse as he is born, takes his first wobbly steps, eats, plays, and is groomed and prepared for his first race.",
        "Category": "",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Sea Creatures (Look Closer)",
        "Authors": "By Malyan, Sue",
        "Description": "\"From starfish to seahorses, Look Closer provides an in-depth view of an underwater world. It's brimming with detailed information on sea creatures' habitats, diet, and sizes, as well as being filled with fun sea facts. Stunning, close-up pictures and lively, accessible text present the sea creatures in a vibrant form that's ideal for the age-range. Every spread includes an illustrated guide and the series neatly groups wildlife, making the books an ideal reference for schools.\"",
        "Category": " Juvenile Nonfiction , Animals , Marine Life",
        "Publisher": "Dk Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Cool Hand Cuke: A Lesson in Giving (5) (Big Idea Books / VeggieTown Values)",
        "Authors": "By Kenney, Cindy and Moore, Michael (ILT)",
        "Description": "Junior and Laura decide to raise money for the hospital, but things are taking way too long for Junior. But once he is zapped into a book and encounters a farm of triangle dancing, egg juggling farmers, he learns that sometimes life is about more than money.",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "Zonderkidz",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Westward Ho!: An Activity Guide to the Wild West (Hands-On History)",
        "Authors": "By Carlson, Laurie",
        "Description": "Capturing the unique character and history of the West, this activity book provides a number of memorable journeys, including joining Lewis and Clark on an expedition, journeying into the woods with fur traders, or riding a wagon train to the Oregon. Young explorers will experience the excitement of the West with activities such as sewing a sunbonnet, panning for gold, cooking flapjacks, singing cowboy songs, and more. Helpful illustrations that detail and explain the steps of each project are also included.",
        "Category": " Juvenile Nonfiction , History , United States , General",
        "Publisher": "Chicago Review Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Locked Room (New York Trilogy)",
        "Authors": "By Auster, Paul",
        "Description": "When Fanshawe disappears, his wife, Sophie, contacts the narrator in hopes that he, one of Fanshawe's childhood friends, can solve the mystery",
        "Category": " Fiction , General",
        "Publisher": "Penguin Putnam~trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Goodbye, Grace? (The English Roses #2)",
        "Authors": "By Madonna, Gomez, Rebecca, and Fulvimari, Jeffrey (ILT)",
        "Description": "The English Roses promised to be friends for life, but now something could be coming between them. Grace?s mom is acting funny, always cleaning the house, and tidying up. Something is up, and the Roses suspect the worst: Grace?s mom is getting ready for a move. Could Grace be moving away from the rest of the Roses? The rest of the Roses need to come up with ways to keep the group together . . . and fast!",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "PUFFIN BOOKS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "No More Diapers for Ducky! (Ducky and Piggy)",
        "Authors": "By Williams, Sam (ILT) and Ford, Bernette",
        "Description": "No more diapers for me! That’s what toddlers will proudly proclaim after they hear this appealing tale of a lovable duck who takes the big step. When Piggy can’t come out to play because he’s busy sitting on the potty, Ducky realizes it’s time to grow up, too. A sweet and subtle story, with two huggable animals that children will embrace.Bernette Ford is the author of the forthcomingFirst Snow, and co-author of Bright Eyes, Brown Skin. Sam Williams has illustrated numerous picture books for children, includingCold Little Duck, Duck, Duck by Lisa Westberg-Peters and Little Red by Sarah Ferguson, The Duchess of York.",
        "Category": " Juvenile Fiction , Health & Daily Living , Toilet Training",
        "Publisher": "Boxer Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Churchill on Leadership : Executive Success in the Face of Adversity",
        "Authors": "By Hayward, Steven F.",
        "Description": "Success often depends on the strength of a single quality: leadership. Winston Churchill is universally recognized as one of the 20th century's great political leaders and his words ring just as true in the world of commerce. A wise, witty, and inspiring leader, Churchill ran Great Britain like a great corporation.\"Perhaps the finest book on practical leadership ever written.\" — Brian TracyChurchill on Leadership demonstrates that the principles that guided Churchill ably translate to private industry today. Author Steven F. Hayward gives strong evidence that, if you remove Churchill from his political context, he would have the resume to be among the great business leaders of any age. Churchill: • was a financier (as chancellor of the Exechequer) and labor negotiator (as home secretary)• managed a large transportation network (as head of the British Navy) and far-flung property holdings (as colonial secretary)• persevered through bankruptcies and other financial disasters• conceived and introduced innovative new products over the opposition of his colleagues, and reorganized major production operations in the midst of crisis.With wit and insight, Hayward reveals Churchill's secrets for business success from assembling and inspiring a first-rate team to preparing a wise budget, from communicating a vision to structuring effective meetings, from acting decisively to rebounding from a failure. Laced with epochal events from the historical stage, enlivened with stimulating speculation, and leavened with wit,Churchill on Leadership is both an enjoyable read and a thought-provoking lesson on leadership.",
        "Category": " Business & Economics , Management",
        "Publisher": "Crown Forum",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Guide to Growing Healthy Houseplants",
        "Authors": "By Schrock, Denny (EDT)",
        "Description": "The newest and most up-to-date plant-care reference.Guidebook focuses on plant care needs for healthy, vibrant results.Identifies a specific plant group and addresses cultural requirements for a variety of the most widely grown species.A to Z listing of plants by both common and scientific names makes finding a plant easy every time.",
        "Category": " Gardening , House Plants & Indoor",
        "Publisher": "Miracle-Gro",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Barack Obama: Son of Promise, Child of Hope",
        "Authors": "By Grimes, Nikki and Collier, Bryan (ILT)",
        "Description": "Barack Obama is the story of an exceptional man, as told by Nikki Grimes and illustrated by Bryan Collier, winners of the Coretta Scott King Award.Ever since Barack Obama was young, Hope has lived inside him. From the beaches of Hawaii to the streets of Chicago, from the jungles of Indonesia to the plains of Kenya, he has held on to Hope. Even as a boy, Barack knew he wasn't quite like anybody else, but through his journeys he found the ability to listen to Hope and become what he was meant to be: a bridge to bring people together.   This is the moving story of an exceptional man, as told by Nikki Grimes and illustrated by Bryan Collier, both winners of the Coretta Scott King Award. Barack Obama has motivated Americans to believe with him, to believe that every one of us has the power to change ourselves and change our world.",
        "Category": " Juvenile Nonfiction , People & Places , United States , African American",
        "Publisher": "Simon & Schuster Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Lonely Planet London Condensed",
        "Authors": "By Fallon, Steve",
        "Description": "",
        "Category": " Travel , Europe , General",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Great Doughnut Parade",
        "Authors": "By Bond, Rebecca",
        "Description": "Just where is small Billy going? Why does he have a doughnut tied to his belt? Does he know he is being followed by, first, a hen (with a cluck, cluck, cluck), then a cat (all quiet and slinky), and, farther down Main Street, a band . . . and firemen? Then sign painters . . . brick layers . . . even cloud catchers! Author/illustrator Rebecca Bond reveals the truly marvelous things that can happen when a doughnut is tied up with string.",
        "Category": " Juvenile Fiction , Cooking & Food",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Penguins: Past and Present, Here and There",
        "Authors": "By Simpson, George Gaylord",
        "Description": "Documents the penguin's long history, from prehistoric ancestors to present-day varieties, and describes the appearance, behavior, habitat, and distribution of each of the eighteen living species",
        "Category": "",
        "Publisher": "Yale Univ Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1976"
        }
    },
    {
        "Title": "Twentieth Century Pittsburgh (New Dimensions in History)",
        "Authors": "By Lubove, Roy",
        "Description": "",
        "Category": "",
        "Publisher": "John Wiley & Sons Canada, Limited",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Gene McCarthy's Minnesota: Memories of a native son",
        "Authors": "By McCarthy, Eugene J.",
        "Description": "",
        "Category": "",
        "Publisher": "Winston Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The Angel of Bastogne",
        "Authors": "By Morris, Gilbert",
        "Description": "In the tradition of It's a Wonderful Life and John Grisham's Skipping Christmas…Newspaper reporter Ben Raines is a full-fledged cynic trying to bypass what he feels is the least wonderful time of the year-Christmas. But his plan to escape on a dream vacation overseas is foiled when the boss assigns him to write the annual front-page holiday story.With a humbug twist, Ben chooses to investigate a World War II legend involving his own father that will expose the fallacies of religion and everything related to December 25th.Willy Raines fought in the Battle of the Bulge at Bastogne during Christmas 1944 and-to Ben's embarrassment-believes a real angel saved the lives of every man in the 101st Airborne unit.Some angel that was. Life was never easy for Willy after the war, and he was far from heroic in his son's eyes. Ben sets out to find other veterans who witnessed the angel of Bastogne, sure to return empty-handed. Instead, he comes home with a heart that is overflowing.",
        "Category": " Fiction , Christian , Historical",
        "Publisher": "B&H Fiction",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "How to Make a Mudpie Learn to Read, Fun & Fantasy (Fun and Fantasy Learn to Read)",
        "Authors": "By Williams, Rozanne Lanczak",
        "Description": "",
        "Category": " Juvenile Nonfiction , School & Education",
        "Publisher": "Creative Teaching Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Women Confronting Retirement: A Nontraditional Guide",
        "Authors": "By Maglin, Nan Bauer (EDT) and Radosh, Alice (EDT)",
        "Description": "In 35 reflections, women who have challenged traditional career models share their diverse experiences and thoughts on when/if to retire and stages of retirement. Two New York academics, one retired, introduce issues and influences on this new dialogue on redefining female identity beyond the workplace. The book is not indexed. Annotation (c) Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Social Science , Human Services",
        "Publisher": "Rutgers University Press",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Sherlock Holmes Volume 1: A Study in Scarlet",
        "Authors": "By Doyle, Arthur Conan, Sir and Jones, Kelley (ILT)",
        "Description": "- The Sherlock Holmes tales of Sir Arthur Conan Doyle are re-presented in chronological order with all-new full-color illustrations by clelbrated artist Kelley Jones! This volume includes :The 'Gloria Sott',\" \"The Musgrave Ritual,\" A Study in Scarlet, \"The Adventure of the Speckled Band,\" \"The Adventure of the Beryl Coronet,\" \"The Resident Patient,\" and \"The Reigate Squires.\"",
        "Category": " Comics & Graphic Novels , Crime & Mystery",
        "Publisher": "IDW Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Healing for the Nations",
        "Authors": "By Dixon, Gertrude",
        "Description": "",
        "Category": "",
        "Publisher": "Fairmont Books",
        "Price Starting With ($)": "10.65",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "These Demented Lands",
        "Authors": "By Warner, Alan",
        "Description": "After the critical success of his first novel,  Morvern Callar, Alan Warner has written an extraordinary, stirring sequel to Morvern's odyssey, confirming him as one of the most original, uniquely gifted writers to have appeared this decade.An air-crash investigator haunts the hinterlands of an island--around the isolated honeymoon hot spot, the Drome Hotel--gathering the debris from fallen planes that the islanders have fashioned into makeshift sheds and fences; but what kind of jigsaw is he really assembling as he paces the runway?A young woman makes landfall on the island, crossing the interior to arrive at the Drome Hotel: desperate, strange--and strangely familiar.Meanwhile, DJ Cormorant is trying to organize The Big One, a rave on the adjacent airstrip, and from all over These Demented Lands come twisted characters, converging for one final Saturday night at the Drome Hotel.",
        "Category": " Fiction , General",
        "Publisher": "Jonathan Cape",
        "Price Starting With ($)": "10.91",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Mastering Black-and-White Photography: From Camera to Darkroom",
        "Authors": "By Suess, Bernhard J.",
        "Description": "Mastering Black-and-White Photography is an introduction to the techniques of black-and-white photography and a thoughtful exploration of how to use those techniques effectively to develop creative skills. Twenty-five illustrated chapters explain practical and artistic matters in a friendly style, from cameras, lenses, and film to developing, printing, light, and aesthetics. Mastering Black-and-White Photography will help you to understand the nuances surrounding the art and technique of black-and-white photography and to use that understanding to create better photographs.",
        "Category": " Photography , Techniques , General",
        "Publisher": "Allworth Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Dinosaurs Everywhere",
        "Authors": "By Courtney, Richard (ILT) and Harrison, Carol",
        "Description": "Vibrant, realistic illustrations show dinosaurs crashing their horns together, living and traveling in herds, and caring for their young, in a simple introduction that also includes facts on fossils, footprints, and paleontology.",
        "Category": " Juvenile Nonfiction , Animals , Dinosaurs & Prehistoric Creatures",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "The White Tyger (A Princess of Roumania)",
        "Authors": "By Park, Paul",
        "Description": "This is a truly magical tale, full of strangeness, terrors and wonders. Many girls daydream that they are really a princess adopted by commoners. In the case of teenager Miranda Popescu, this is literally true. Because she is at the fulcrum of a deadly political battle between conjurers in an alternate world where \"Roumania\" is a leading European power, Miranda was hidden by her aunt in our world, where she was adopted and raised in a quiet Massachusetts college town. The narrative is split between our world and the people in Roumania working to protect or to capture Miranda: her Aunt Aegypta Schenck versus the mad Baroness Ceaucescu in Bucharest, and the sinister alchemist, the Elector of Ratisbon, who holds her true mother prisoner in Germany. This is the story of how Miranda -- with her two best friends, Peter and Andromeda -- is brought back to her home reality. Each of them is changed in the process and all will have much to learn about their true identities and the strange world they find themselves in.This story is a triumph of contemporary fantasy.",
        "Category": " Fiction , Fantasy , Historical",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "25.03",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Wildest Dreams",
        "Authors": "By Blake, Jennifer",
        "Description": "Her previous novels, Love and Smoke and Joy and Anger have earned bestselling author Jennifer Blake tremendous acclaim for her rich, rhythmic portrayals of the South and her unforgettable characters. Now her gifted pen sweeps us to the colorful streets of present-day New Orleans and to Europe, past and present, where we follow the parallel lives of two women. One modern, one ancestral, these extraordinary heroines embark - one hundred and fifty years apart - upon a European odyssey towards their destiny.When Joletta Caressa's beloved grandmother dies, she takes with her the secret formula to a legendary perfume believed to have been worn by Cleopatra and Empress Josephine - and which is now the most desperately sought perfume on the market. Joletta's only clue to the formula is the journals written by her ancestress, Violet Fossier, who in 1854 made a grand tour of Europe. Joletta realizes she must follow Violet's itinerary across the European continent, using the events that took place and the scenes she visited to decipher the code to the formula.As Joletta follows Violet's journey, the story goes back in time, to nineteenth-century Europe and a scandalous love affair that is intimately bound up in the mystery of the perfume. In the present, Joletta finds herself attracted to - and suspicious of - Rone Adamson, a Southern playboy whose astounding knowledge of perfume makes Joletta wary. Yet his chivalrous charms prove too much for her scruples and Joletta succumbs to her dubious white knight, even as danger swirls around them....Sweeping from modern London to Napoleon's France, from the Swiss Alps to the canals and palazzi of Italy and finally to a secret garden outside Venice where the answers to so many questions lie, here is a spellbinding novel of two passionate women who dare to live their wildest dreams. It is a magnificent tale that only Jennifer Blake could write.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Sex, Puberty, and All That Stuff: A Guide to Growing Up",
        "Authors": "By Bailey, Jacqui and McCafferty, Jan (ILT)",
        "Description": "This friendly book talks to teens in their own language, with emphasis on the subject that is foremost in the minds of just about every adolescent boy and girl: Sex.  Separate chapters titled Boy Stuff and Girl Stuff describe body changes that occur during puberty, with frank and open explanations of male and female genitals, how they feel and how they function. Chapters that follow discuss typical teen problems, as well as those entirely new feelings that come with sexual development. Among them are, having a crush on that attractive boy or girl, coping with controlling parents, menstruation, dating and sexual activity, contraception, pregnancy, sexually transmitted infections, homosexual impulses, and generally surviving those difficult yet exciting teen years. Line drawings on most pages.",
        "Category": " Young Adult Nonfiction , Social Topics , Dating & Sex",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Mastering the Job Interview and Winning the Money Game (Five O'Clock Club)",
        "Authors": "By Wendleton, Kate",
        "Description": "Mastering the Job Interview is for every job hunter who wants to ace the interview.  It will help the job seeker to turn the job interview into a job offer.  It shows the reader how to maximize a salary offer through smart negotiation.  It will show the reader how to highlight their strengths and gain more power in the job interview and is complete with tips to start out on the right foot in a new position.",
        "Category": " Business & Economics , Careers , Job Hunting",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Complete Well-Being (A Guide to Symptoms and Cures)",
        "Authors": "By Caroline Shreeve",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Little Miss Giggles",
        "Authors": "By Hargreaves, Roger",
        "Description": "They're back!  Rediscover the zaniest characters you've ever met in this best-selling series which has sold millions worldwide.  Bright and charming, with easily recognizable characters and a small take-along format,  Mr. Men and Little Miss  books are easy enough for young readers, witty enough for humor-prone adults, and highly collectible for one and all. Also check your local listings to view the Mr. Men & Little Miss TV show.Back to the Mr. Men & Little Miss microsite.",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Britain's Homage to 28,000 American Dead",
        "Authors": "By The Times Publishing Company Limited",
        "Description": "",
        "Category": "",
        "Publisher": "The London Times",
        "Price Starting With ($)": "8.23",
        "Publish Date": {
            "Month": "January",
            "Year": "1952"
        }
    },
    {
        "Title": "Robert's rules of Order Revised 75th Anniversary Edition",
        "Authors": "By Robert, Henry M.",
        "Description": "",
        "Category": "",
        "Publisher": "Scott, Foresman and Company",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1951"
        }
    },
    {
        "Title": "Better Homes and Gardens Eat Healthy Lose Weight 270 Great-tasting & Healthy Recipes (Volume 1)",
        "Authors": "By food and entertaining-nacy hopkins",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Publishing Group",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "An Actor Prepares...To Live in New York City: How to Live Like a Star Before You Become One",
        "Authors": "By Wroe, Craig",
        "Description": "(Limelight). A guide for actors, and everyone else, to getting the best for less and surviving, thriving and living the good life in the Big Apple. Here is the ultimate guidebook for the hordes of aspiring young performers who arrive in the Big City determined to climb the ladder to stardom. But the purpose of Craig Wroe, an actor himself, is not to provide instruction on how to refine acting, singing or dancing talents or how to land a job in the chorus of  The Producers . Plenty of other books do that. His aim is far broader   to help you survive in the crowded, frantic, expensive maelstrom that is New York. From finding a decent, reasonably inexpensive place to live to finding competent, reasonably inexpensive dental care, from getting computer training to organize your day-to-day existence to joining a gym to harden your body, from eating well to dressing better   all on a tight budget   there is virtually no aspect of life in New York that is not covered in this book. And it not only names names; it gives addresses and phone numbers as well. And keep in mind that newly-arrived lawyers, accountants, models, writers you name them need these things too.",
        "Category": " Performing Arts , Reference",
        "Publisher": "Limelight Editions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "What's So Funny About Being Catholic?: An Uproarious Collection of Blasphemous Facts, Unholy Jokes, Irreverent Folklore, and More",
        "Authors": "By O'Malley, Kathleen (ILT) and Warner, Karen (EDT)",
        "Description": "Takes a humorous look at the Catholic Church and its members, priests, and traditions",
        "Category": " Humor , General",
        "Publisher": "Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Enter Dying",
        "Authors": "By Wald, Noreen",
        "Description": "Hired to enhance the script for the new Broadway musical Suzy Q, ghostwriter Jake O'Hara is forced to turn sleuth once again to find a killer  when the star of the show, glamorous Elaine Eden, falls to her not-so-accidental death during a stunt. Original.",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Animal Fact/Animal Fable",
        "Authors": "By Simon, Seymour",
        "Description": "Features a variety of common sayings about animals presented in the form of a guessing game, and explains which are fact and which are fable",
        "Category": " Juvenile Nonfiction , Science & Nature , General",
        "Publisher": "Crown Publishers, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "The Hunchback of Notre-Dame (Wordsworth Classics) (Wordsworth Collection)",
        "Authors": "By Hugo, Victor",
        "Description": "Quasimodo, a gentle and kind hunchback who lives a lonely, isolated life in a cathedral in Paris, rescues the beautiful Esmerelda from being hanged for a crime she did not commit.",
        "Category": " Fiction , Classics",
        "Publisher": "Wordsworth Editions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Fraser's Penguins: A Journey to the Future in Antarctica.",
        "Authors": "By Montaigne, Fen",
        "Description": "A dramatic chronicle of Antarctica's penguins that bears witness to climate changes that foreshadow our own futureThe towering mountains and iceberg-filled seas of the western Antarctic Peninsula have for three decades formed the backdrop of scientist Bill Fraser's study of Adélie penguins. In that time, this breathtaking region has warmed faster than any place on earth, with profound consequences for the Adélies, the classic tuxedoed penguin that is dependent on sea ice to survive. During the Antarctic spring and summer of 2005-2006, author Fen Montaigne spent five months working on Fraser's field team, and he returned with a moving tale that chronicles the beauty of the wildest place on earth, the lives of the beloved Adélies, the saga of the discovery of the Antarctic Peninsula, and the story—told through Fraser's work—of how rising temperatures are swiftly changing this part of the world. Captivated by the tale of these polar penguins and a memorable field season in Antarctica, readers will come to understand that the fundamental changes Fraser has witnessed in the Antarctic will soon affect our lives.",
        "Category": " Science , Life Sciences , Zoology , Ornithology",
        "Publisher": "Henry Holt and Co.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2010"
        }
    }
]