[
    {
        "Title": "Decision in Normandy",
        "Authors": "By Carlo D'Este",
        "Description": "",
        "Category": "",
        "Publisher": "Konecky & Konecky Military Books",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The Life All Around Me By Ellen Foster",
        "Authors": "By Gibbons, Kaye",
        "Description": "This sequel to Gibbons's beloved classic Ellen Foster stands on its own as an unforgettable portrait of a redoubtable adolescent making herself up out of whole cloth. Now fifteen, Ellen is settled into a permanent home with a new mother. Strengthened by adversity and blessed with enough intelligence to design a salvation for herself, she still feels ill at ease in the world. Her sole surviving ritual-a visit to the county fair-takes on totemic importance. While she holds fast to the shreds of her childhood-humoring her best friend, Stuart, who is determined to marry her; and protecting her old neighbor, slow-witted Starletta-she negotiates her way into a larger world by selling her poetry to pay her way to a camp for gifted students. With a singular mix of perspicacity, naïveté, and compassion, Ellen draws us into her life and makes us fall in love with her all over again. Anyone considering making an underage change in life, such as who you're going to live with, should know there's no way toavoid the government getting in on the decision, so try to bekind to the lady they'll send with a stack of tests. Try to stay calm and do your best on them.-from The Life All Around Me By Ellen Foster",
        "Category": " Fiction , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Lost Man's River:",
        "Authors": "By Matthiessen, Peter",
        "Description": "A story of epic scope and ambition, Lost Man's River confronts the primal relationship between a dangerous father and his desperate sons and the ways in which his death has shaped their lives. Lucius Watson is obsessed with learning the truth about his father. Who was E.J. Watson? Was he a devoted family man, an inspired farmer, a man of progress and vision? Or was he a cold-blooded murderer and amoral opportunist? Were his neighbors driven to kill him out of fear? Or was it envy? And if Watson was a killer, should the neighbors fear the obsessed Lucius when he returns to live among them and ask questions?The characters in this tale are men and women molded by the harsh elements of the Florida Everglades - an isolated breed, descendants of renegades and pioneers, who have only their grit, instinct, and tradition to wield against the obliterating forces of twentieth-century progress: Speck Daniels, moonshiner and alligator poacher turned gunrunner; Sally Brown, who struggles to escape the racism and shame of her local family; R.B. Collins, known as Chicken, crippled by drink and rage, who is the custodian of Watson secrets; Watson Dyer, the unacknowledged namesake with designs on the remote Watson homestead hidden in the wild rivers; and Henry Short, a black man and unwilling member of the group of armed island men who awaited E.J. Watson in the silent twilight.Only a storyteller of Peter Matthiessen's dazzling artistry could capture the beauty and strangeness of life on this lawless frontier while probing deeply into its underlying tragedy: the brutal destruction of the land in the name of progress, and the racism that infects the heart of New World history.",
        "Category": " Fiction , Literary",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Bad Beginning (A Series of Unfortunate Events #1)",
        "Authors": "By Snicket, Lemony and Helquist, Brett (ILT)",
        "Description": "After the sudden death of their parents, the three Baudelaire children must depend on each other and their wits when it turns out that the distant relative who is appointed their guardian is determined to use any means necessary to get their fortune. Original.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "330 THE YEARBOOK OF HARVARD AND RADCLIFFE",
        "Authors": "By Harvard",
        "Description": "",
        "Category": "",
        "Publisher": "See notes",
        "Price Starting With ($)": "47.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Return to Midway",
        "Authors": "By Marschall, Ken (ILT), Ballard, Robert D., and Archbold, Rick",
        "Description": "A famed ocean explorer, discoverer of the Titantic,  offers an illustrated chronicle of a search for the ships sunk during the Battle of Midway, including the Yorktown, and features reminiscences from American and Japanese veterans of the conflict. TV tie-in. BOMC & History.",
        "Category": " History , Military , United States",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Permanent Partners: Building Gay and Lesbian Relationships That Last",
        "Authors": "By Berzon, Betty",
        "Description": "A guide for lesbian and gay couples talks about such concerns as the merging of identities, waning sex, the inability to resolve conflicts, competing career demands, illnesses, substance abuse problems, and mid-life crises. Reprint.",
        "Category": " Self-help , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Shoal of Time: A History of the Hawaiian Islands",
        "Authors": "By Daws, Gavan",
        "Description": "Gavan Daws' remarkable achievement is to free Hawaiian history from the dust of antiquity. Based on years of work in the documentary sources, Shoal of Time emerges as the most readable of all Hawaiian histories.",
        "Category": " History , United States , State & Local , General",
        "Publisher": "University of Hawaii Press.",
        "Price Starting With ($)": "7.55",
        "Publish Date": {
            "Month": "June",
            "Year": "1974"
        }
    },
    {
        "Title": "Essential System Administration (Nutshell Handbooks)",
        "Authors": "By Frisch, Aeleen",
        "Description": "Essential System Administration takes an in-depth look at the fundamentals of Unix system administration in a real-world, heterogeneous environment.  Whether you are a beginner or an experienced administrator, you'll quickly be able to apply its principles and advice to your everyday problems.The book approaches Unix system administration from the perspective  of your job -- the routine tasks and troubleshooting that make up your day.  Whether you're dealing with frustrated users, convincing an uncomprehending management that you need new hardware, rebuilding the kernel, or simply adding new users, you'll find help in this book. You'll also learn about back up and restore and how to set up printers, secure your system, and perform many other system administration tasks.  But the book is not for full-time system administrators alone.  Linux users and others who administer their own systems will benefit from its practical, hands-on approach.This second edition has been updated for all major Unix platforms, including SunOS 4.1, Solaris 2.4, AIX 4.1, Linux 1.1, Digital Unix, OSF/1, SCO Unix Version 3, HP/UX Versions 9 and 10,  and IRIX Version 6.  The entire book has been thoroughly reviewed and  tested on all of the platforms covered.  In addition, networking,  electronic mail, security, and kernel configuration topics have been  expanded substantially.Topics covered include:Starting up and shutting down your systemAdding new usersManaging processesSystem securityOrganizing and planning file systemsPlanning and performing backupsSetting up pointersTCP/IP networkingSetting up emailAdding terminals and disk drivesSetting up and using the accounting system",
        "Category": " Computers , Operating Systems , UNIX",
        "Publisher": "O'Reilly & Associates",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Five Sweet Strawberries: Strawberry Shortcake",
        "Authors": "By Bryant, Megan E.",
        "Description": "Glittery plastic strawberries \"disappear\" as kids turn the pages of this berry-picking adventure, with a final spread that is full of beautiful glittery strawberries, showing that there are always more strawberries to share with friends.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "13.98",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "The pattern of responsibility",
        "Authors": "By Dean Acheson",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "7.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1952"
        }
    },
    {
        "Title": "America, Russia and the Cold War 1945-1966",
        "Authors": "By Walter Lafeber",
        "Description": "",
        "Category": "",
        "Publisher": "John Wiley and Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "My Breast: One Woman's Cancer Story",
        "Authors": "By Wadler, Joyce",
        "Description": "On April 13, 1992, New York magazine published Joyce Wadler's cover story, \"My Breast.\" During the next forty-eight hours, more than a quarter of a million women paused to read this first of a two-part article. Some cried, many understood, most smiled, others phoned mothers or old friends, or held their loved ones more tightly than ever; most were frightened. Touched deeply by the author's humor and courage, an entire city responded with common concern for Joyce Wadler's health and with gratitude for her having confronted their worst fears. In this expanded full-length version of My Breast, Joyce Wadler brings unflinching honesty, page-turning suspense, real-life medical accuracy, and an inspiring sense of humor to her remarkable story. As William Styron did for depression, Joyce Wadler finds the human voice of breast cancer.",
        "Category": " Medical , General",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Hitler's Mistakes",
        "Authors": "By Lewin, Ronald",
        "Description": "",
        "Category": "",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Disappointment with God: Three Questions No One Asks Aloud",
        "Authors": "By Yancey, Philip",
        "Description": "",
        "Category": " Religion , Christian Life , Personal Growth",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "A Step-By-Step Guide to Church Marketing Breaking Ground for the Harvest",
        "Authors": "By Barna, George",
        "Description": "For Ingest Only - Data needs to be cleaned up for all products being loaded",
        "Category": " Religion , General",
        "Publisher": "Regal Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Hamlet's Dresser: A Memoir",
        "Authors": "By Smith, Bob",
        "Description": "The true story of a boy whose life was saved by literature, Hamlet's Dresser is a portrait of a person made whole by art. Bob Smith's childhood was a fragile and lonely one, spent largely caring for his handicapped sister, Carolyn. But at age ten, his local librarian gave him a copy of Shakespeare's The Merchant of Venice, and it transformed him. In Bob's first look at Shakespeare's penetrating language -- \"In sooth I know not why I am so sad\" -- he had found a window through which to view the world. Years later, when the American Shakespeare Festival moved into Stratford and Smith was hired as Hamlet's dresser, his life's passion took shape.  Blending tragedy and comedy, Smith gracefully weaves together his childhood memories with his experiences backstage and teaching the plays. The result is a gorgeous, tender, infectious book about the restorative powers of literature and art.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Career Guide for Creative and Unconventional People",
        "Authors": "By Eikleberry, Carol",
        "Description": "",
        "Category": " Business & Economics , Careers , Job Hunting",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Easy Stretching Workbook",
        "Authors": "By Karen Smith",
        "Description": "",
        "Category": "",
        "Publisher": "Duncan Baird Publishers",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Abs on the Ball: A Pilates Approach to Building Superb Abdominals",
        "Authors": "By Craig, Colleen",
        "Description": "Innovative abdominal exercises to help tone the abdomen, improve posture, and build a strong back using the Swiss exercise ball. Offers a 10-minute and 20-minute workout for all levels of fitness. Shows how the mobility of the ball targets underutilized muscles. Shows how traditional sit-ups and \"ab\" machines limit how much abdominal muscles can be trained and also aggravate lower back pain and neck tension. The exercise ball has long been recommended by doctors, physical therapists, and Olympic coaches for people suffering from back pain. Now Colleen Craig, author of the bestselling book Pilates on the Ball, reveals why the exercise ball is unmatched as a tool for building superb abdominal strength. She presents a selection of over 80 innovative exercises, including some of the key powerhouse-builders from the Pilates Method, all of which she has adapted specifically to the ball. Craig shows how traditional sit-ups and \"ab\" machines actually limit the degree to which abdominal muscles can be trained and can even aggravate lower back pain and neck tension. In contrast, the very mobility of the ball targets underutilized muscles, recruiting both deep and superficial abdominal muscle fibers to enhance results. Abs on the Ball includes exercises for all ability levels that show how to properly use the breath and how to activate the correct muscles during a workout--from the core exercises of the Waterfall, Oblique Curls, and Full Abdominal Curls to the more advanced Side Twist Plank, the Teaser, and Backward Crunch. The author also offers a 10- and 20-minute workout designed not only to build the abdominal core, but also to strengthen and train deep muscles in the back and hip in order to soothe lower back pain and increase overall body strength, balance, and coordination.",
        "Category": " Sports & Recreation , Bodybuilding & Weight Training",
        "Publisher": "Healing Arts Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Night Before Christmas, The",
        "Authors": "By Moore, Clement Clarke and Whatley, Bruce (ILT)",
        "Description": "No poem better expresses the magic and excitement of Christmas Eve than Clement C. Moore's \"The Night Before Christmas.\" Now, acclaimed illustrator Bruce Whatley has brought this favorite poem to life with stunning illustrations that perfectly capture all the joy of the Christmas holiday season. The snowy New England landscapes, the eight flying reindeer, and Saint Nicholas himself are all gloriously rendered, and will make this version of the classic poem a Christmas tradition in its own right.",
        "Category": " Juvenile Fiction , Imagination & Play",
        "Publisher": "HarperColl",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Married to a Stranger",
        "Authors": "By Rachlin, Nahid",
        "Description": "A woman's struggle for self-realization in contemporary Iran, a novel with \"the clarity and spare sensuousness of Persian poetry or miniature painting.\"—Ruth Prawer JhabvalaWhen Minou Hakini marries a man of her own choosing—an intellectual and a radical—and moves to Abadan, a thriving oil town near the Iraqi border, she imagines her life will be adventurous and liberating. Before long, however, she becomes aware of her husband's suspicious liaisons and dangerous activities. Her struggle to forge her own identity as a woman in contemporary Iran is charged with passion, anger and finally a need to escape.“The ecstasies and disillusionments of first love are the stuff of great tragedies and cheap romances, but Nahid Rachlin has done something else with this familiar theme, and something more, though her style is elegantly simple . . . ”—The New York Times Book Review\" . . . Rachlin (Foreigner) tells her story with economy and suspensefulness, weaving strands of unstable political life and sexual secrecy—in a small, vivid closeup of life in Iran at that fateful hour, within a society that had become its own prisoner.\"—Kirkus ReviewsNahid Rachlin is an Iranian-American who lives in New York and teaches at Barnard College. She is the author of Foreigner and The Heart's Desire, both novels, and Veils, a collection of short stories.",
        "Category": " Fiction , Literary",
        "Publisher": "City Lights Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Microsoft ADO.NET Step by Step (Step by Step Developer)",
        "Authors": "By Riordan, Rebecca",
        "Description": "ADO.NET—the data-access component of the Microsoft .NET Framework—works with any component on any platform that understands XML. Get a solid handle on ADO.NET and learn how to exploit the database functionality of Microsoft Visual Basic® .NET and Microsoft Visual C#™ .NET with this step-by-step primer. You’ll be working in ADO.NET right away with easy-to-grasp examples drawn from the real-world challenges developers face every day. Learn about the ADO.NET object model and how to use it to develop data-bound Windows® Forms and Web Forms. See how ADO.NET interacts with XML and how to access older versions of ADO from the .NET environment. Throughout, you’ll find insightful tips and expert explanations for rapid acceleration of development productivity, faster applications, and more powerful results. Topics covered include:Getting started with ADO.NETCreating connectionsThe Data command and DataReaderAccessing data with the DataAdapterWorking with DataSetsWorking with DataTablesControlling table views with DataViewsEditing and updating dataData-binding in Windows FormsData-binding in Web FormsUsing the XML Designer to modify data structureReading and writing XML with ADO.NETUsing ADO from the .NET FrameworkCD features:* Examples of real-world solutions developed with ADO.NET, including sample code in Visual Basic .NET and Visual C# .NETA Note Regarding the CD or DVDThe print version of this book ships with a CD or DVD. For those customers purchasing one of the digital formats in which this book is available, we are pleased to offer the CD/DVD content as a free download via O'Reilly Media's Digital Distribution services. To download this content, please visit O'Reilly's web site, search for the title of this book to find its catalog page, and click on the link below the cover image (Examples, Companion Content, or Practice Files). Note that while we provide as much of the media content as we are able via free download, we are sometimes limited by licensing restrictions. Please direct any questions or concerns to booktech@oreilly.com.",
        "Category": " Computers , Databases , General",
        "Publisher": "Microsoft Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Developing Applications with Visual Studio.NET",
        "Authors": "By Grimes, Richard",
        "Description": "Two framework developers introduce a patterns approach to framework development, demonstrating useful techniques and solutions for successful framework development. Suitable for the proficient object-oriented programmer. Includes two valuable appendices: a section on frameworks and components and the IBM San Francisco frameworks development process. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Computers , Programming Languages , C++",
        "Publisher": "Addison-Wesley Professional",
        "Price Starting With ($)": "5.52",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "The Imperial Animal",
        "Authors": "By Tiger, Lionel",
        "Description": "",
        "Category": "",
        "Publisher": "DELTA BOOK CO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The Simon and Schuster Pocket Guide to Champagne and Sparkling Wines",
        "Authors": "By MacQuitty, Jane",
        "Description": "Describes more than a thousand sparkling wines from around the world, tells how champagne is made, stored, and served, and differentiates various styles of sparkling wine",
        "Category": " Cooking , Beverages , Wine & Spirits",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "The Chesapeake Bay Book: A Complete Guide",
        "Authors": "By Blake, Allison, Mills, Eric, and Harper, Jean",
        "Description": "Offers information on the history, accommodations, culture, dining, and shopping for the Chesapeake area",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Berkshire House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "URBAN LAND USE 3RD ED",
        "Authors": "By Kaiser, Edward J. and Chapin, F. S.",
        "Description": "",
        "Category": " Architecture , Urban & Land Use Planning",
        "Publisher": "University of Illinois Press",
        "Price Starting With ($)": "19.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1979"
        }
    },
    {
        "Title": "Tests of Significance (Quantitative Applications in the Social Sciences)",
        "Authors": "By Henkel, Ramon E.",
        "Description": "An elementary introduction to significance testing, this paper provides a conceptual and logical basis for understanding these tests.",
        "Category": " Social Science , Research",
        "Publisher": "SAGE Publications, Inc",
        "Price Starting With ($)": "16.5",
        "Publish Date": {
            "Month": "September",
            "Year": "1976"
        }
    },
    {
        "Title": "The Cat Who Came in from the Cold: A Fable",
        "Authors": "By Masson, J. Moussaieff",
        "Description": "The New York Times bestselling author of The Nine Emotional Lives of Cats and Dogs Never Lie About Love, Jeffrey Moussaieff Masson has given cat lovers a wonderful gift: a magical holiday story about a feline named Billi, who long ago, in ancient India, becomes the first cat to choose domestication.Cats relish independence and Billi is no exception. He wanders through the Indian countryside among other animals, enjoying a sense of freedom, belonging to nobody. The holidays approach, Diwali, the Festival of Lights; the monsoon season, when the skies go pitch dark and the rains come, has arrived. At a time when everyone is eager to be home with family and friends, Billi is alone . . . and lonely.Walking into a village, Billi gazes through windows and sees a cozy fire, a content dog, a happy family with children. Inspired, an untamed soul begins the transformative journey to a new life of warmth and togetherness in a world of interconnectedness. With his inimitable storytelling gifts and his unparalleled ability to penetrate the feline psyche, Jeffrey Masson captures Billi’s inner world–his aloofness, mischievousness, and ultimately his new perspective on the deep connection shared by humans and their feline friends.",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Now You Know: Reactions After Seeing Saving Private Ryan",
        "Authors": "By Sunshine, Linda (EDT), Dreamworks Pictures (COR), Kornbluth, Jesse (EDT), Case, Steve (INT), and America Online, Inc. (COR)",
        "Description": "This inspiring gift \"remembrance\" book features about 100 selections from the more than 30,000 messages posted on America Online in reaction to seeing Steven Spielberg's powerful film-and gives a new understanding of the men who fought in World War II. This unique remembrance book, illustrated with historical photographs, is a testament both to the movie that has profoundly affected so many lives, and to the power of the online medium, which allows people instant access to one another. Here are people of various ages, races, religions, and political beliefs who all feel that this timeless movie has generated a sea change in how we think about war, war movies, and the men who fought for freedom. Also included are blank lined pages for readers to enter their own reactions. Excerpted from a message in the book: My grandfather, who is a 72-year-old naval veteran of WWII, never really talked about his experience during the war.... Last weekend, we saw 'Saving Private Ryan' together, the whole family. His face wore a look of indifference and doubt. But in the end, he cried. I have never seen my grandfather cry; but on that day he did. We left the movie theater and walked in the rain to our cars and the tears still fell. He had only one comment: 'Now you know how it really was for me...' He has yet to say anything more....",
        "Category": " Performing Arts , Film , Reference",
        "Publisher": "Newmarket Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Reality-centered people management: Key to improved productivity",
        "Authors": "By Stanton",
        "Description": "",
        "Category": "",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "6.16",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The Compassionate Universe: The Power of the Individual to Heal the Environment",
        "Authors": "By Easwaran, Eknath",
        "Description": "Explores the major ecological crises we are facing today, and shows how we can undo the damage humankind has done. 190 pages.",
        "Category": " Philosophy , Political",
        "Publisher": "Nilgiri Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Book of Royal Wedding, the Armorial Bearings of Prince Andrew, Showing the Royal Arms Surrounded",
        "Authors": "By Colour Library Books",
        "Description": "",
        "Category": "",
        "Publisher": "Colour Library Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Charles & Diana: The Prince & Princess of Wales",
        "Authors": "By Hall, Trever",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Low-Cholesterol Jewish Cookery: [The Unsaturated-Fat Way]",
        "Authors": "By Roth, June Spiewak",
        "Description": "",
        "Category": "",
        "Publisher": "Arco Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1978"
        }
    },
    {
        "Title": "Endangered Peoples",
        "Authors": "By Wolfe, Art, Davidson, Art, and Isaac, John",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Sierra Club",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Duncan and Mallory the Bar None Ranch",
        "Authors": "By Asprin, Robert and White, Mel",
        "Description": "",
        "Category": "",
        "Publisher": "Walsworth Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "Honor the Brave: America's Wars and Warriors",
        "Authors": "By Victor Brooks",
        "Description": "",
        "Category": "",
        "Publisher": "Military Book Club",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Oliver Cromwell: A Play",
        "Authors": "By Drinkwater, John",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin Company",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1921"
        }
    },
    {
        "Title": "Statistics: A Self-Teaching Guide",
        "Authors": "By Koosis, Donald J.",
        "Description": "The fastest, easiest way to learn statisticsNow all you need to teach yourself statistics is this complete, accessible guide and your ability to work simple equations. You'll learn when, why, and how to effectively perform basic statistical procedures, from setting up tables and computations to analyzing your own data. You'll also discover how to apply statistical concepts to such diverse areas as education, engineering, and the social, biological, and physical sciences. This completely revised edition includes: * New information on applying statistics to standard computer spreadsheets (Lotus, Excel, etc.) * An interactive format that lets you work at your own pace * Frequent self-tests and exercises to reinforce what you've learnedDONALD J. KOOSIS is Executive Director of Instructional Systems Consultants, Inc. He lives in New York City.Also by Donald Koosis, now newly revised and updated: Business Statistics, Third Edition",
        "Category": " Mathematics , Probability & Statistics , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Ideas & Research (Elements of Article Writing)",
        "Authors": "By Krantz, Marshall",
        "Description": "Ideas & Research was written to help you seize a scrap of fact, pull the rest into the light and turn the whole into the kind of article an editor shows everyone in the office - then everyone who buys the magazine.Freelance writer Marshall Krantz guides you through this vital \"pre-writing\" phase. Follow his advice to claim a writing niche and sell editors on your expert status; pluck the gem-quality ideas from the landslide of daily impressions; mold your ideas for maximum interest; slant them to fit your market; bring the right approach to the important job of research - and have fun doing the work; develop a research strategy; make the most of public and specialized library collections, government information, public records and private sources; use your computer and find facts online; use your eyes, ears and other senses, and get your facts by conducting info-eliciting interviews and solid field research; and organize your material and select the best for your article.Krantz's narrative is clear and practical; supporting anecdotes and quotations from other writers are richly personal. You get a vivid mosaic that informs by making points immediate and memorable.",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Blue Guide Istanbul (4th ed)",
        "Authors": "By Freely, John",
        "Description": "Istanbul: The Imperial City tells the story of the city from its foundation until the present with the emphasis throughout on its colourful and tempestuous daily life. A comprehensive gazetteer describes all the monuments mentioned in the text, so that this is a guide to the city as well as an evocation of its illustrious past as Byzantium, Constantinople and Istanbul, which unfolds as one walks the ancient streets in view of the garland of waters that still entwine it.",
        "Category": " Travel , Asia , Far East",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "6.72",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The dead live (Perry Rhodan)",
        "Authors": "By Clark Darlton",
        "Description": "",
        "Category": "",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "NO HEAT NO RENT an Urban Solar Energy Conservation Manual",
        "Authors": "By Mary et al Christianson",
        "Description": "",
        "Category": "",
        "Publisher": "The Energy Task Force",
        "Price Starting With ($)": "19.23",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "A History of US: Book 6: War, Terrible War (1860-1865) (A History of US, 6)",
        "Authors": "By Hakim, Joy",
        "Description": "Describes the American Civil War, focusing on its causes, events, and consequences",
        "Category": " Juvenile Nonfiction , History , United States , 19th Century",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Ultimate Punishment: A Lawyer's Reflections on Dealing with the Death Penalty",
        "Authors": "By Turow, Scott",
        "Description": "America's leading writer about the law takes a close, incisive look at one of society's most vexing legal issuesScott Turow is known to millions as the author of peerless novels about the troubling regions of experience where law and reality intersect. In \"real life,\" as a respected criminal lawyer, he has been involved with the death penalty for more than a decade, including successfully representing two different men convicted in death-penalty prosecutions. In this vivid account of how his views on the death penalty have evolved, Turow describes his own experiences with capital punishment from his days as an impassioned young prosecutor to his recent service on the Illinois commission which investigated the administration of the death penalty and influenced Governor George Ryan's unprecedented commutation of the sentences of 164 death row inmates on his last day in office. Along the way, he provides a brief history of America's ambivalent relationship with the ultimate punishment, analyzes the potent reasons for and against it, including the role of the victims' survivors, and tells the powerful stories behind the statistics, as he moves from the Governor's Mansion to Illinois' state-of-the art 'super-max' prison and the execution chamber.This gripping, clear-sighted, necessary examination of the principles, the personalities, and the politics of a fundamental dilemma of our democracy has all the drama and intellectual substance of Turow's celebrated fiction.America's leading writer about the law takes a close, incisive look at one of society's most vexing legal issuesScott Turow is known to millions as the author of peerless novels about the troubling regions of experience where law and reality intersect. In \"real life,\" as a respected criminal lawyer, he has been involved with the death penalty for more than a decade, including successfully representing two different men convicted in death-penalty prosecutions. In this vivid account of how his views on the death penalty have evolved, Turow describes his own experiences with capital punishment from his days as an impassioned young prosecutor to his recent service on the Illinois commission which investigated the administration of the death penalty and influenced Governor George Ryan's unprecedented commutation of the sentences of 164 death row inmates on his last day in office. Along the way, he provides a brief history of America's ambivalent relationship with the ultimate punishment, analyzes the potent reasons for and against it, including the role of the victims' survivors, and tells the powerful stories behind the statistics, as he moves from the Governor's Mansion to Illinois' state-of-the art 'super-max' prison and the execution chamber.This gripping, clear-sighted, necessary examination of the principles, the personalities, and the politics of a fundamental dilemma of our democracy has all the drama and intellectual substance of Turow's celebrated fiction.",
        "Category": " Social Science , Criminology",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Geek Mafia",
        "Authors": "By Dakan, Rick",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Blue King Studios",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Hannibal",
        "Authors": "By Harris, Thomas",
        "Description": "You remember Hannibal Lecter: gentleman, genius, cannibal.  Seven years have passed since Dr. Lecter escaped from custody.  And for seven years he's been at large, free to savor the scents, the essences, of an unguarded world.  But intruders have entered Dr. Lecter's world, piercing his new identity, sensing the evil that surrounds him.  For the multimillionaire Hannibal left maimed, for a corrupt Italian policeman, and for FBI agent Clarice Starling, who once stood before Lecter and who has never been the same, the final hunt for Hannibal Lecter has begun.  All of them, in their separate ways, want to find Dr. Lecter.  And all three will get their wish.  But only one will live long enough to savor the reward....",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "English Springer Spaniels (\"KW\")",
        "Authors": "By McCarty, Diane",
        "Description": "",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Bon Appetit Weekend Entertaining: A Cookbook, Menu Planner & Entertaining Sourcebook for Occasions Large or Small,  Casual or Elegant",
        "Authors": "By Bon Appetit (EDT)",
        "Description": "A blend of cookbook, entertaining resource, and menu guide offers some 175 delicious recipes and menu suggestions for special occasions, last-minute or unexpected entertaining, and versatile get-togethers.",
        "Category": " Cooking , Entertaining",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Writing on Both Sides of the Brain: Breakthrough Techniques for People Who Write",
        "Authors": "By Klauser, Henriette Anne",
        "Description": "Offers advice on improving one's writing and editing skills, discusses writer's block, techniques for generating new ideas, procrastination, and revision, and suggests useful exercises",
        "Category": " Psychology , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Radical Healing: Integrating the World's Great Therapeutic Traditions to Create a New Transformative Medicine",
        "Authors": "By Ballentine, Rudolph M. and Funk, Linda (ILT)",
        "Description": "A leading practitioner of holistic medicine draws on the principles of ayurveda, conscious nutrition, Chinese medicine, body and energy work, homeopathy and cell salts, and flower essences to present a therapeutic approach to healing the mind, body, and spirit. 50,000 first printing. Tour.",
        "Category": " Medical , Holistic Medicine",
        "Publisher": "Harmony Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Fibromyalgia Help Book: Practical Guide to Living Better with Fibromyalgia",
        "Authors": "By Fransen, Jenny and Russell, I. Jon",
        "Description": "The most comprehensive and understandable treatise on fibromyalgia that I have had the pleasure to review. It deals in a very practical way with questions I hear in my office every day. I plan to use this book for my patients.—Glenn A. McCain, M.D., Southeast Arthritis Care Center, Charlotte, North Carolina",
        "Category": " Medical , Diseases",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "The Corporate Warriors",
        "Authors": "By Ramsey, Douglas K.",
        "Description": "Describes the tactics used by the managers of corporations, such as Coca-Cola, General Motors, and People Express, against their competitors",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "Instant Graphic Techniques With Instant",
        "Authors": "By Tissier, David Le",
        "Description": "",
        "Category": "",
        "Publisher": "Bernard House",
        "Price Starting With ($)": "6.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Becoming Fire: Spiritual Writing From Rising Generations",
        "Authors": "By Kern, Alexander",
        "Description": "",
        "Category": "",
        "Publisher": "Andover Newton",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Kitty Hawk and Beyond: The Wright Brothers and the Early Years of Aviation: A Photographic History",
        "Authors": "By Geibert, Ronald R., Noland, Patrick B., Crouch, Tom (FRW), Dailey, John R. (INT), Nolan, Patrick B., and Dailey, John R.",
        "Description": "This book, published in celebration of the 100th anniversary of powered flight in 2003, tells the story of two twentieth- century heroes who fashioned from the raw materials of ingenuity and ambition a legacy that will live forever in aviation history.",
        "Category": " Transportation , Aviation , General",
        "Publisher": "Roberts Rinehart",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "KISS Guide to Living with a Dog",
        "Authors": "By Fogle, Bruce",
        "Description": "Covers choosing a breed based on personality and lifestyle, grooming, teaching obedience, understanding and responding to behaviorial characteristics, and treating medical problems.",
        "Category": " Pets , Dogs , General",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Mr. Food Cooks Chicken",
        "Authors": "By Ginsburg, Art",
        "Description": "Mr. Food presents hundreds of quick and delicious recipes for preparing chicken and turkey, covering all types of cuisines from traditional American and new Tex-Mex ideas to chicken recipes from India, China, and Italy. 75,000 first printing. Tour.",
        "Category": " Cooking , Specific Ingredients , Poultry",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Mr. Food a Taste of Qvc: Food and Fun Behind the Scenes",
        "Authors": "By Ginsburg, Art",
        "Description": "Mr. Food's frequent QVC visits have given him the opportunity to spend time in their kitchen with almost every host, sharing plenty of laughs and enthusiastic phone calls from viewers across the country, as well as tasty recipes like grilled Honey-Garlic Pork chops, Smothered Chicken, Crispy Coconut Shrimp, Veggie-Packed Chili, Frozen Strawberry Mousse wuth Chocolate Drizzle, and Toffee Almond Popcorn. And now he's sharing all the behind-the-scenes fun too!",
        "Category": " Cooking , Methods , General",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "8.35",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "From Alley Pond to Rockefeller Center",
        "Authors": "By Brown, Henry Collins",
        "Description": "",
        "Category": "",
        "Publisher": "E.P. Dutton",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1936"
        }
    },
    {
        "Title": "Seven Rivers West (Contemporary American Fiction)",
        "Authors": "By Hoagland, Edward",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "A Pictoral History of the American Theatre 1900-1951",
        "Authors": "By Blum, Daniel",
        "Description": "",
        "Category": "",
        "Publisher": "Greenberg",
        "Price Starting With ($)": "7.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1951"
        }
    },
    {
        "Title": "Charles Ryder's School Days and Other Stories",
        "Authors": "By Waugh, Evelyn",
        "Description": "A dozen stories tell of an incurable psychopath, luxury cruises, a kidnapping, a journey into the future, and two brothers at odds with each other",
        "Category": " Fiction , General",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "Mechanics of the Mind (BBC Reith Lectures; 1976)",
        "Authors": "By Blakemore, Colin",
        "Description": "Reviews in non-technical terms current knowledge about the human brain and includes discussions of the philosophical questions of human consciousness and the evolution of thinking about body and mind",
        "Category": " Medical , Neuroscience",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "July",
            "Year": "1977"
        }
    },
    {
        "Title": "Eastern Shore of Maryland: The Guidebook",
        "Authors": "By Moose, Katie and Moose, George (PHT)",
        "Description": "This guide is the most detailed book on the Eastern Shore of Maryland region. It includes everything a visitor, or even a local, would want to know, including important tips on traveling to the Eastern Shore, lodging, restaurants, favorite hideaways, shopping, and local history. The information provided here will be of extra interest to sailors traveling through the area.",
        "Category": " Travel , Reference",
        "Publisher": "Conduit Press",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "The Machine Age in America: 1918-1941",
        "Authors": "By Wilson, Richard Guy, Pilgrim, Dianne H., and Tashjian, Dickran",
        "Description": "",
        "Category": " Design , General",
        "Publisher": "Brooklyn Museum/Harry N. Abrams",
        "Price Starting With ($)": "18.98",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "The Piano: A Novel",
        "Authors": "By Campion, Jane and Pullinger, Kate",
        "Description": "Ada, who has not spoken since she was six-years-old, travels to New Zealand for an arranged marriage, which is immediately strained when her new husband refuses to transport her piano to their home",
        "Category": " Performing Arts , General",
        "Publisher": "Miramax Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Essentials of Health Care Finance",
        "Authors": "By Cleverley, William O., Ph.D.",
        "Description": "",
        "Category": " Medical , Health Care Delivery",
        "Publisher": "Aspen Pub",
        "Price Starting With ($)": "5.9",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "America's First Families: An Inside View of 200 Years of Private Life in the White House (Lisa Drew Books (Paperback))",
        "Authors": "By Anthony, Carl Sferrazza",
        "Description": "Packed with more than 300 photographs from archives and private collections -- many published here for the first time -- entertaining anecdotes, political analysis, the dynamics of family relationships, and behind-the-scenes gossip, America's First Families offers the first up-close look at the families -- from John and Abigail Adams in 1800 to Bill and Hillary Clinton -- who have intrigued and entranced the American public for two centuries.  Carl Sferrazza Anthony opens the door to the world's most famous residence to reveal life as it was actually lived there. He takes readers into the heart of loyalties and estrangements, and the emotional pressures that politics brings to bear upon the forty White House families, from their arrivals to their \"notices to vacate.\" Readers will enjoy an unprecedented tour of the previously unseen private rooms as used and decorated by each family. Revealed too are the personal proclivities of the presidents and how their families both sustained them through public crises and were used for political advantage. They'll get a firsthand look at the preparations for White House weddings and other occasions; meet the parents and children of the presidents -- as well as eccentric relatives; and discover the patterns of working, resting, and relaxing that shaped the nuts and bolts of family life.  A magnificent combination of visual delights and insider information, America's First Families is an irresistible invitation to spend some time at 1600 Pennsylvania Avenue.",
        "Category": " History , United States , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.66",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Georgia Bonesteel's Bright Ideas for Lap Quilting",
        "Authors": "By Bonesteel, Georgia",
        "Description": "Offers forty new designs from both traditional and contemporary styles, including full-size patterns and concise instructions",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "Environmental Science : The Way the World Works",
        "Authors": "By Nebel, Bernard",
        "Description": "The latest edition of an introductory text, for both majors and non-majors, that sheds light on the factors underlying environmental issues. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "8.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Changing Children's Behavior (Prentice-Hall Series in Counseling & Guidance)",
        "Authors": "By Krumboltz, John D.",
        "Description": "Suggests effective methods of reinforcing existing behavior, developing and maintaining new conduct, stopping inappropriate behavior, and modifying emotional behavior",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1972"
        }
    },
    {
        "Title": "Catch a Fish, Throw a Ball, Fly a Kite: 21 Timeless Skills Every Child Should Know (and Any Parent Can Teach!)",
        "Authors": "By O'Neill, Philomena (ILT) and Lee, Jeffrey",
        "Description": "Knowing how to fold a paper airplane can make you a better parent!Well, maybe not better, but you’ll certainly have more fun with your children, who understandably assume that you know how to do just about everything. If they only knew! Catch a Fish, Throw a Ball, Fly a Kite is for parents who want to teach their children what they really want to learn--even the skills you never mastered or haven't practiced in a few decades. This book contains clear, simple, step-by-step instructions for teaching more than twenty little life skills that every child should know, including how to: • Work a yo-yo• Build a fire• Eat with chopsticks• Skip a stone  • Fly a homemade kite• Throw a FrisbeeWhile you teach your children, you get to learn the skills too, or at the very least improve on them. Activities range from practical, like locating the constellations, to completely frivolous fun, like turning a blade of grass into a musical instrument. Some are simple enough for four-year-olds, and others will appeal to the most jaded adolescent. Each skill is illustrated and is rounded out with fascinating trivia (did you know that the world’s largest sand castle measured six stories high?) or funny jokes. Age-appropriate information is given for each skill, but they all have one thing in common: You and your kids can do them together!",
        "Category": " Family & Relationships , Activities",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "McClane's Secrets of Successful Fishing: A Complete, Illustrated Guide to the Techniques, Tackle, and Know-How of Sport Fishing",
        "Authors": "By A. J. McClane",
        "Description": "",
        "Category": "",
        "Publisher": "Holt, Rinehart and Winston",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1980"
        }
    },
    {
        "Title": "Breakfast with Friends: Seasonal Menus to Celebrate the Morning by Elizabeth Alston (Wings Great Cookbooks)",
        "Authors": "By Alston, Elizabeth",
        "Description": "More than thirty seasonal breakfast menus for entertaining include meals for holidays, warm and cold weather, special diets, and group activities",
        "Category": " Cooking , Courses & Dishes , Breakfast",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Old-Fashioned Christmas Crafts",
        "Authors": "By Spier, Carol",
        "Description": "Incorporating classic crafting techniques, a collection of seventy holiday gifts and decorations of the past is recreated with current methods and convenient materials and features beloved themes including Santas, angels, religion, fruits, flowers, and greens. Original. 25,000 first printing.",
        "Category": " Art , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "No Time to Sew : Fast & Fabulous Patterns & Techniques for Sewing a Figure-Flattering Wardrobe",
        "Authors": "By Betzina, Sandra",
        "Description": "Classic clothes, quick techniques, and goof-proof patterns add up to a perfect wardrobe for the busy sewer. No matter what your size, you can create a wardrobe with designer details by following the expert instructions of sewing star Sandra Betzina.",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.03",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "The wind in the willows",
        "Authors": "By Kenneth Grahame",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Afterlands: A Novel",
        "Authors": "By Heighton, Steven",
        "Description": "This gripping novel of Arctic survival, brilliantly written by an author who has been described as “a young Ondaatje,” is based on one of the most remarkable events in polar exploration. In 1871, off the coast of Greenland, nineteen men, women, and children, voyaging on the Arctic explorer USS Polaris, were cast adrift on a large ice floe as their ship began to founder. Afterlands is the story of this small society of castaways—a white and a black American, five Germans, a Dane, a Swede, an Englishman, and two Inuit families—as they try to survive a six-month winter ordeal, struggling with the harsh elements and with one another, the group splintering into factions along ethnic and national lines.      Steven Heighton provocatively fills in the blanks of the documented history of this event by focusing on the suspicions, the hunger-induced delusions, and the unrequited longings among three members of the group: Roland Kruger, an educated, witty, rebellious German seaman; Tukulito, or “Hannah,” the party's Inuit interpreter; and George Tyson, the American ranking officer, who later wrote an account of the experience that solidified his reputation as a hero while casting Kruger as the villain. Throughout the novel, Heighton incorporates actual passages from Tyson’s contentious account, then daringly imagines the aftermath of the ordeal, following Kruger, Tukulito, and Tyson as they attempt to move beyond their searing memories and resume their lives in the larger world.   Combining the high drama of Arctic survival and the psychological intensity of modern theater, this beautifully written novel powerfully addresses themes of belonging, nationalism, and love in times of crisis. Steven Heighton’s first novel, The Shadow Boxer, was chosen as a 2002 Book of the Year by Publishers Weekly and has been published in five countries. He is also the author of several books of poetry and short fiction. His work has received awards in Britain and Canada, has been translated into eight languages, and has been internationally anthologized. He lives in Kingston, Ontario.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "How to Read a French Fry: And Other Stories of Intriguing Kitchen Science",
        "Authors": "By Parsons, Russ",
        "Description": "Why can you stick your hand into a 450-degree oven but not into 212-degree boiling water without burning it? Why does fish taste different from meat? Why do you cook pork differently from beef? Why should you always start cooking dried beans in cold water, not warm? Why should you never cook a Vidalia onion?What's the only kind of marinade that's really an effective tenderizer? Why is strawberry-rhubarb a good combination, scientifically speaking? And why don't potatoes fried in fresh oil ever brown completely, no matter how long they're cooked?\"Cooking is full of questions that science can help you answer, questions that can make you a better cook,\" writes the award-winning Los Angeles Times food editor, Russ Parsons. In this entertaining book packed with fascinating tidbits, Parsons explores the science behind such basic cooking methods as chopping, mixing, frying, roasting, boiling, and baking. You'll learn why soaking beans can't offset their gaseous effects, why green vegetables shouldn't be cooked under a lid for long, which fruits you can buy unripe and which you should buy fully ripened, which thickener to choose for your turkey gravy, which piecrust is foolproof for a beginner.Along the way, Parsons slips in hundreds of cooking tips, provocative trivia, and touches of wit that make his scientific explanations go down smoothly. He also includes more than a hundred recipes that deliciously exemplify the principles he describes, from Tuscan Potato Chips and Crisp-Skinned Salmon on Creamy Leeks and Cabbage to Chocolate Pots de Creme and Ultimate Strawberry Shortcake.",
        "Category": " Cooking , Methods , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Diversity of Life (Biology: The Unity and Diversity of Life, Unit IV: Evolution and Diversity)",
        "Authors": "By Starr, Cecie and Taggart, Ralph",
        "Description": "Now you can tailor the Seventh Edition of Biology: The Unity and Diversity of Life specifically to the topics you cover in your course. Six paperbacks are available: Cell Biology and Genetics, Evolution of Life, Plant Structure and Function, Animal Structure and Function, and Ecology and Behavior..The Diversity of Life volume includes five kingdoms of life, presented in an evolutionary framework. Descriptions, illustrations, and life cycles of representative viruses, bacteria, protistans, fungi, plants, invertebrates, and vertebrates are also included. (In the hardcover version, Chapters 22-27.)",
        "Category": "",
        "Publisher": "Brooks Cole",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Look Who's Laughing!",
        "Authors": "By Spangler, Ann (EDT) and MacDonald, Shari (EDT)",
        "Description": "WARNING! Not for the humor impaired!That’s right—if you don’t like to laugh, stop now, while you can! Because this collection of stories, jokes, quips, and anecdotes doesn’t leave off at mere chuckles. It’s meant to produce gale-force laughter, with gusts up to 100 mph. Some of today’s funniest writers and speakers await you inside. Ken Davis has thoughts to share about air bags. Becky Freeman exposes the sensuous woman. Dave Meurer takes a manly look at menopause. Armed with the world’s ultimate vacuum cleaner, Chonda Pierce wages war on the dust mite. There are also church bulletin bloopers, hilarious one-liners from the mouths of kids, lawyers, and air travelers, and plenty more offerings of assorted sizes by the likes of Patsy Clairmont, John Ortberg, Barbara Johnson, Sheila Walsh, Marilyn Meberg, Luci Swindoll, and others. Need we say more? Go ahead and Look Who’s Laughing! It’s about to be you!",
        "Category": " Religion , Inspirational",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Brontes: Charlotte Bronte and Her Family",
        "Authors": "By Fraser, Rebecca",
        "Description": "\"A fresh and modern view of Charlotte Bronte--as a woman searching for love and as a writer who helped change society's perceptions about her sex. Her moving, eloquent portrait will interest not only Bronte devotees but all contemporary women.\"--Kirkus Reviews",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Company Man",
        "Authors": "By Wade, Brent",
        "Description": "William Covington, a young black man in a high-profile corporate job, sees his comfortable life begin to fall apart around him when something from his past threatens to ruin everything he has worked for in the business world",
        "Category": "",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Humor for a Woman's Heart: Stories, Quips, and Quotes to Lift the Heart",
        "Authors": "By MacDonald, Shari, MacDonald, Shari (COM), Myers, Kristen, and Myers, Kristen (ILT)",
        "Description": "",
        "Category": " Humor , Topic , Adult",
        "Publisher": "Howard Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Horses: Color Nature Library (ILLUSTRATED",
        "Authors": "By Burton, Jane",
        "Description": "One of the world's favorite domestic animals is presented in colorful photographs which illustrate the many varieties of horses and their equally varied uses and histories",
        "Category": "",
        "Publisher": "Crescent Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1978"
        }
    },
    {
        "Title": "What's Good For GM",
        "Authors": "By Ayres, Edward",
        "Description": "",
        "Category": "",
        "Publisher": "Aurora Publishers",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "For Whom The Bell Tolls (Cliffs Notes)",
        "Authors": "By Roberts, James L. (EDT) and Larocque, Dubose",
        "Description": "In addition to being a prodigious author, Hemingway took great personal interest in the Spanish Civil War of the 1930s. This novel blends a love story with a story of that war and provides one powerful result.",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Cliff Notes",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1965"
        }
    },
    {
        "Title": "Women of crisis II: Lives of work and dreams (Radcliffe biography series)",
        "Authors": "By Coles, Robert",
        "Description": "Documentary portraits unveil the innermost concerns and emotions of five American women",
        "Category": "",
        "Publisher": "Delacorte Press/S. Lawrence",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Calligraphic Designs (International Design Library)",
        "Authors": "By Armstrong, Mimi",
        "Description": "",
        "Category": " Art , Techniques , Calligraphy",
        "Publisher": "STEMMER HOUSE PUBLISHERS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Personal Finance for Dummies",
        "Authors": "By Tyson, Eric",
        "Description": "",
        "Category": "",
        "Publisher": "IDG Books Worldwide, Inc.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "The Brief Holt Handbook",
        "Authors": "By Kirszner, Laurie G. and Mandell, Stephen R.",
        "Description": "",
        "Category": " Language Arts & Disciplines , Composition & Creative Writing",
        "Publisher": "Harcourt College Pub",
        "Price Starting With ($)": "5.48",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Panati's Parade of Fads, Follies, and Manias: The Origins of Our Most Cherished Obsessions",
        "Authors": "By Panati, Charles",
        "Description": "A look at the last one hundred years of American pop culture  includes discussions of pop songs, books, and media",
        "Category": " Social Science , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Crouching Father, Hidden Toddler: A Zen Guide for New Dads",
        "Authors": "By Tolpa, Beegee and Tolpa, Beegee (ILT)",
        "Description": "Crouching Father, Hidden Toddler contains the treasured wisdom that will help new dads master the Buddha-like patience required to be on the receiving end of projectile pureed spinach, sleep-deprived moms, and toys with Some Assembly Required. Experienced dad and aspiring guru C.W. Nevius expounds on the ancient concept of wu wei (i.e., going with the flow) as well as some handy tips picked up from kung fu movies. An array of short essays ponder on such koans as What is the sound of one child napping? Also revealed are such proven parenting techniques as apprenticing with a learned senseithat is, the father of a child who doesn't bite. Whimsical illustrations and a winning compact format make this a perfect gift for Father's Day and co-ed baby showers. Warm and encouraging, Crouching Father, Hidden Toddler provides the one necessity for any samurai facing a Mt. Fuji of diapers: laughter.",
        "Category": " Family & Relationships , Parenting , Fatherhood",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Ribbon work",
        "Authors": "By Morrison, Winifrede",
        "Description": "",
        "Category": "",
        "Publisher": "Dryad Press",
        "Price Starting With ($)": "11.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "King Leonardo and the Royal Contest",
        "Authors": "By Eileen Daly",
        "Description": "",
        "Category": "",
        "Publisher": "Whitman Publishing Co.",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "Empress of the Splendid Season",
        "Authors": "By Hijuelos, Oscar",
        "Description": "Oscar Hijuelos vividly brings to life the joys, desires, and disappointment of American life witnessed through the experience of a formerly prosperous Cuban émigré named Lydia Espana—now a cleaning woman in New York. In magnetic prose, he juxtaposes Lydia&#39;s tale with the stories of her clients, contrasting her experiences with the secret lives of those for whom she works. No one writes better of love or the pulse of a city, nor has any writer better captured the complexity inherent in the emigration experience; how assimilation is at once the achievement of dreams, yet also a loss of the past. Empress of the Splendid Season is Hijuelos at his masterful best, a novel filled with incantatory, rhythmic prose and rich in heartfelt vision.",
        "Category": " Fiction , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "That's Not What I Meant!",
        "Authors": "By Tannen, Deborah",
        "Description": "\"We are, all of us, foreigners to each other: editor and writer, man and woman, Californian and New Yorker, friend and friend. Dr. Tannen shows us how different we are, and how to speak the same language.\"Jack RosenthalPultizer Prize winner and editorTHE NEW YORK TIMESDeborah Tannen, who revolutionaized our thinking about relationships between women and men in her bestsller YOU JUST DON'T UNDERSTAND, shows that conversational confusion between the sexes is only part of the picture. In THAT'S NOT WHAT I MEANT!, Dr. Tannen shows that growing up in different parts of the country, having different ethnic and class backgrounds, even age and indvidual personality, all contribute to different conversational styles. Entertaining and informative, this is an essential complement to psychological theories of human behavior. No one who has read Deborah Tannen's fascinating look at women and men will want to miss a word of it!",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    }
]