[
    {
        "Title": "Solving America's Health-Care Crisis: A Guide to: Understanding the Greatest Threat to Your Family's Economic Security",
        "Authors": "By Eckholm, Erik P. (EDT)",
        "Description": "A study of America's growing health-care problem reveals how the astronomical health costs threaten America's economy and other startling information. Original. 50,000 first printing. $20,000 ad/promo. Tour.",
        "Category": "",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Buongiorno Italia!",
        "Authors": "By Cremona, Joseph",
        "Description": "",
        "Category": "",
        "Publisher": "EMC Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1982"
        }
    },
    {
        "Title": "Second Home: Find Your Place in the Fun (Better Homes and Gardens(R))",
        "Authors": "By Better Homes and Gardens Books (EDT)",
        "Description": "The first book of its kind for second home owners and buyers.Book-of-the-Month Club Feature Selection.Second-home options, from lake houses to cabins in the woods.Guides readers on selecting house site suited to their needs.Remodeling and decorating ideas to make home functional.Furnishings and home plan source list.",
        "Category": " House & Home , Decorating",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "7.05",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Strange Stories, Amazing Facts of America's Past by Reader's Digest",
        "Authors": "By Dolezal, Robert",
        "Description": "An offbeat history of the United States journeys beyond the newspaper headlines and world events to document the impact of individuals long overlooked by textbooks on American history and discusses fads, hoaxes, scandals, and other lesser-known events from America's past",
        "Category": " History , United States , General",
        "Publisher": "Reader's Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Clearing the Way: Working with Teenage Writers",
        "Authors": "By Romano, Tom",
        "Description": "Clearing the Way is written for English teachers whose job is to help teenagers become better writers. Tom Romano, a full time high school English teacher when he wrote this book, has worked with hundreds of teenage writers. He knows well the problems and triumphs of teaching writing. In Clearing the Way teachers will find specific ideas and strategies, a workable philosophy for teaching writing, and, best of all, vivid stories and case histories of real teenagers.   Romano discusses the importance of respecting students' words, the use of writing to learn and discover, the teacher-student conference, writing processes in theory and practice, the evaluation and grading of writing, the place of writing in literature classes, and the powerful creative current that can be transmitted among teenage writers. Whatever the topic, Romano illustrates his ideas with many examples of teenagers' own writing.",
        "Category": " Language Arts & Disciplines , Reference",
        "Publisher": "Heinemann",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "Como Se Dice",
        "Authors": "By Jarvis, Ana C.",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin College Div",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Time Cat: The Remarkable Journeys of Jason and Gareth",
        "Authors": "By Alexander, Lloyd",
        "Description": "Gareth's definitely no ordinary cat. For one thing, he                 can talk. For another, he's got the power to travel                 through time. And the instant he tells this to Jason,                 the two of them are in ancient Egypt, on the first of                 nine amazing adventures that Jason will never forget.",
        "Category": " Juvenile Fiction , Animals , Cats",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Blue Moon Soup: A Family Cookbook",
        "Authors": "By Goss Gary (recipes by) and illustrated by Jane Dyer",
        "Description": "",
        "Category": "",
        "Publisher": "Little Brown & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Columbia University College of Physicians and Surgeons Complete Home Medical Guide",
        "Authors": "By Subak-Sharpe, Genell J. (EDT)",
        "Description": "Demonstrates first aid procedures, tells how the human body functions, and provides information on diseases and their treatment and prevention",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "8.41",
        "Publish Date": {
            "Month": "November",
            "Year": "1985"
        }
    },
    {
        "Title": "A Saint for Your Name: Saints for Boys",
        "Authors": "By Nevins, Albert j.",
        "Description": "Identifies hundreds of the most popular saints, explains the origin of each one's name, and lists the feast day associated with him",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Our Sunday Visitor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1980"
        }
    },
    {
        "Title": "Pennsylvania trivia",
        "Authors": "By Couch, Ernie and Couch, Jill",
        "Description": "Gathers trivia questions about Pennsylvania in the areas of geography, entertainment, history, arts, literature, sports, science, nature, and leisure",
        "Category": "",
        "Publisher": "Rutledge Hill Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Man of the Hour: An Anthology",
        "Authors": "By Palmer, Diana",
        "Description": "Night Of Love: To save her struggling dance company, Meg must accept an unthinkable offer from the man she thought betrayed her long ago. But will it cost her more to trust Steven or to deny the irresistible passion reigniting between them?Secret Agent Man: Corporate security chief Lang Patton could handle anything&#133;except commitment. But to protect his ex-fianc? Kirry Campbell, from a vicious stalker, Lang would rediscover a love worth dying for.&#133;",
        "Category": " Fiction , Romance , Western",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "ON BECOMING A NOVELIST",
        "Authors": "By Gardner, John",
        "Description": "The late novelist, critic, and teacher outlines a comprehensive course of education for the aspiring novelist, with an analysis of the undergraduate and graduate writing courses and provides practical advice on developing one's writing ability and earning a living as a novelist",
        "Category": " Business & Economics , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Insight and Responibility",
        "Authors": "By Erikson, Erik H.",
        "Description": "",
        "Category": "",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "The Glory of Christmas: Thoughts on God's Great Grace",
        "Authors": "By Lucado, Max",
        "Description": "Max Lucado, Charles Swindoll, and Charles Colson share the true meaning of Christmas, including salvation, power for living, righteousness, relationship, encouragement, and more.This bestselling Christmas book has been reissued for the next generation.",
        "Category": " Religion , Holidays , Christmas & Advent",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Better Homes and Gardens Cooking For Two",
        "Authors": "By Editors of Better Homes and Gardens",
        "Description": "",
        "Category": "",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "June",
            "Year": "1968"
        }
    },
    {
        "Title": "Better Homes and Gardens Crockery Cooker Cook Book",
        "Authors": "By Various",
        "Description": "",
        "Category": "",
        "Publisher": "MEREDITH",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Remembering the Future: The Challenge of the Churches in Europe",
        "Authors": "By Lodwick, Robert C. (EDT)",
        "Description": "",
        "Category": " Religion , Christianity , History",
        "Publisher": "Friendship Pr",
        "Price Starting With ($)": "5.03",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Macrobiotic Cancer Prevention Cookbook",
        "Authors": "By Kushi, Aveline and Esko, Wendy",
        "Description": "Suggests complete macrobiotic menus, discusses the connection between diet and cancer, and offers advice on preparing healthful foods",
        "Category": " Health & Fitness , Diet & Nutrition , Macrobiotics",
        "Publisher": "Avery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "India: A Modern History",
        "Authors": "By Spear, Percival",
        "Description": "",
        "Category": "",
        "Publisher": "The University of Michigan",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Puzzling Optical Illusions (Dover Children's Activity Books)",
        "Authors": "By Crawford, Thomas",
        "Description": "Here is a delightful collection of mysterious optical illusions — pictures that play tricks on the eye and baffle human perception. Some of these images are the result of shortcomings in our vision; others are still not completely understood. This book contains a rich assortment of these visual mind-bogglers, including \"impossible objects\" — constructions that look fine on paper but cannot possibly exist in reality — as well as pictures that suddenly change into other configurations as you're looking at them. Straight lines, for example, wave and bend before your eyes; gray spots appear and disappear; patterns pulsate and vibrate, and much more.The visual surprises and mysterious effects found in this book will especially delight youngsters, but readers of all ages are sure to have fun with these perplexing optical effects. An ideal companion for long car trips, Puzzling Optical Illusions will also be a source of stimulating entertainment at parties and get-togethers or during quiet times at home and school.",
        "Category": " Games & Activities , Puzzles",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "The Unschooled Mind: How Children Think And How Schools Should Teach",
        "Authors": "By Gardner, Howard",
        "Description": "Merging cognitive science with educational agenda, Gardner shows how ill-suited our minds and natural patterns of learning are to current educational materials, practices, and institutions, and makes an eloquent case for restructuring our schools. This reissue includes a new introduction by the author.",
        "Category": " Psychology , Psychotherapy , Child & Adolescent",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "The Majesty of Natchez (Majesty Architecture)",
        "Authors": "By Smith, Reid",
        "Description": "Natchez, Mississippi, attracts thousands of visitors annually. One look through these pages and it is easy to see why. Beautiful exterior shots, rare interior photographs, and moving descriptions capture the essence of one of the largest and best-preserved collections of antebellum architecture in the country.",
        "Category": " Architecture , Buildings , Public, Commercial & Industrial",
        "Publisher": "Pelican Pub Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "The One Minute Mother",
        "Authors": "By Johnson, Spencer",
        "Description": "",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "Stars on Ice: An Intimate Look at Skating's Greatest Tour",
        "Authors": "By Hamilton, Scott (INT) and Wilner, Barry",
        "Description": "Complete with vivid photographs throughout, this sport book provides an extensive behind-the-scenes look at the world's most successful figure skating tour from its very beginnings to the present day and offers profiles of its stars, including Katarina Witt, Scott Hamilton, and Kristi Yamaguchi.",
        "Category": " Sports & Recreation , Ice & Figure Skating",
        "Publisher": "Andrews McMeel Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Massage (101 Essential Tips)",
        "Authors": "By Lacroix, Nitya",
        "Description": "Illustrates basic massage techniques and specific strokes for the head, face, neck, chest, arms, hands, legs, and feet",
        "Category": " Health & Fitness , Massage & Reflexotherapy",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Eyewitness Travel Guide to Madrid",
        "Authors": "By Hopkins, Adam",
        "Description": "Describes sights and activities in Madrid, recommends hotels and restaurants, and includes tips on shopping and entertainment",
        "Category": " Travel , Europe , Spain & Portugal",
        "Publisher": "DK Travel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Just a Note to Say . . .: The Perfect Words for Every Occasion",
        "Authors": "By Isaacs, Florence",
        "Description": "Writing a thoughtful, sincere, and appropriate note can be difficult. This guide helps readers find the right words to mark any milestone or occasion. Regardless of the situation or the relationship, easy-to-follow guidelines lead you to words that matter.",
        "Category": " Reference , Etiquette",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "A Common Life (Mitford), Book Cover May Vary",
        "Authors": "By Karon, Jan",
        "Description": "Laughter and wedding bells ring as #1 New York Times bestselling author Jan Karon takes her millions of fans behind the scenes of the most cherished event in Mitford history.Mitford’s Lord’s Chapel is the home to the most joyful event in years: the wedding of Father Tim Kavanagh and Cynthia Coppersmith. Here at last is A Common Life, and the long-awaited answers to these deeply probing questions: Will Father Tim fall apart when he takes his vows? Will Cynthia make it to the church on time? Who will arrange the flowers and bake the wedding cake? And will Uncle Billy’s prayers for a great joke be answered in time for the reception?From Dooley Barlowe, to Miss Sadie and Louella, to Emma Newland, the mayor, everybody who’s anybody will be there celebrating in the little town with the big heart.A Common Life is the perfect gift for Mother’s Day, Christmas, anniversaries, and for a bride or groom to give to his or her beloved. In truth, it’s perfect for anyone who believes in laughter, relies on hope, and celebrates love.",
        "Category": " Fiction , Sagas",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Sneak Peak Harleqin's Everlasting Love (Everlasting Love)",
        "Authors": "By Harlequin",
        "Description": "",
        "Category": "",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Army Trivia",
        "Authors": "By Burke, Edward J.",
        "Description": "",
        "Category": "",
        "Publisher": "Quinlan Pr",
        "Price Starting With ($)": "6.58",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "Dr. Jekyll and Mr. Hyde (Bantam Classic)",
        "Authors": "By Stevenson, Robert Louis",
        "Description": "Robert Louis Stevenson originally wrote Dr. Jekyll And Mr Hyde as a \"chilling shocker.\" He then burned the draft and, upon his wife's advice, rewrote it as the darkly complex tale it is today. Stark, skillfully woven, this fascinating novel explores the curious turnings of human character through the strange case of Dr. Jekyll, a kindly scientist who by night takes on his stunted evil self, Mr. Hyde. Anticipating modern psychology, Jekyll And Hyde is a brilliantly original study of man's dual nature—as well as an immortal tale of suspense and terror. Published in 1866, Jekyll And Hyde was an instant success and brought Stevenson his first taste of fame. Though sometimes dismissed as a mere mystery story, the book has evoked much literary admirations. Vladimir Nabokov likened it to Madame Bovary and Dead Souls as \"a fable that lies nearer to poetry than to ordinary prose fiction.\"",
        "Category": "",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1982"
        }
    },
    {
        "Title": "A Rustle of Angels: Stories About Angels in Real-Life and Scripture",
        "Authors": "By Webber, Marilynn Carlson and Webber, William D.",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Messy Spirituality: God's Annoying Love for Imperfect People",
        "Authors": "By Yaconelli, Mike",
        "Description": "'I Guess I’m Not a Very Good Christian . . .'Do you feel like: I don’t pray enough I don’t read my Bible enough I don’t share my faith enough I don’t love God enough I’m not committed enough I’m not spiritual enoughThen this book is for you. Messy Spiritualtiy was written for the silent majority of us who have been convinced that we just don’t do Christianity right. We spend most of our lives worried about what we don’t do instead of what we have done, focused on our imperfections instead of God’s fondness for the imperfect. Why? Because we’ve been bombarded with books, tapes, talks, seminars, and movies convincing us that real Christianity is all about perfection.Michael Yaconelli dares to suggest that imperfection, unfinishedness, and messiness are, in fact, the earmarks of true Christianity; that real Christianity is messy, erratic, lopsided . . . and gloriously liberating.  What if genuine faith begins with admitting we will never have our act completely together? Maybe messy disciples are exactly the kind of imperfect people Jesus came to earth for and whose company he actually enjoyed--and still enjoys. If you want to find Jesus today, look for him in the midst of burned-out believers, moral misfits, religious incompetents . . . men and women whose lives are, well, messy. Messy Spirituality is a strong antidote for the spiritual perfectionism in us all. Here are truths that can cut you loose from the tyranny of ought-to’s and open your eyes to the deep spirituality of being loved, shortcomings and all, by the God who meets you and transforms you in the midst of a messy and unpredictable life.",
        "Category": " Religion , Spirituality",
        "Publisher": "Zondervan/Youth Specialties",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Cooking for 1 or 2 (Nitty Gritty Cookbooks)",
        "Authors": "By Greenberg, Katherine and Kyte, Barbara",
        "Description": "More than 275 recipes and ideas make it easy to cook for the small household. Each recipe gives ingredients for 1 and 2 servings. The authors offer tips on shopping, equipping the kitchen and food storage.",
        "Category": " Cooking , Reference",
        "Publisher": "Nitty Gritty Cookbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Glorious Appearing: The End of Days (Left Behind)",
        "Authors": "By LaHaye, Tim F. and Jenkins, Jerry B.",
        "Description": "Thousands of years of human history stained by strife, death, and sin come to an end when the King of Glory returns to earth. The satisfying conclusion of the seven years of tribulation covered by the Left Behind series portrays the return of Jesus Christ to earth in both glory and judgment at the height of the battle between the forces of evil gathered at Armageddon and the remaining Christian believers at Petra and Jerusalem. Nothing seems to be able to stop the Antichrist, Nicolae Carpathia. But God is in control. Street date: Tuesday, November 16, 2004.",
        "Category": " Fiction , Religious",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "When Someone You Love Is Depressed: How to Help Your Loved One Without Losing Yourself",
        "Authors": "By Rosen, Laura Epstein and Amador, Xavier F.",
        "Description": "Although numerous books have been written for those suffering from depression, until now none of them has addressed the \"secondary\" victims of this debilitating disease: the loved ones of the depressed. If someone you love is depressed, you undoubtedly recognize that the depression has placed some new burdens on you; however you may be affected in more ways than you realize. Research shows that if you are close to a depressed person, you are at a much higher risk of developing problems yourself, including anxiety, phobias, and even a kind of contagious depression. Yet, too often, those of us who care about a depressed person are so focused on their needs that we don't realize that we might need help. There is startling evidence that marriages in which one person is depressed are nine times more likely to end in divorce; that children with a depressed parent are at an increased risk for a range of adjustment difficulties; and that if you are caring for an elderly depressed parent, your physical and mental health are likely to suffer.Depression is also notorious for causing increased misunderstandings and sexual problems in intimate relationships. Laura Rosen and Xavier Amador, psychologists with expertise in treating the secondary victims of depression, explain the mechanisms of depression that can cause communication breakdown, increase hostility, and ultimately destroy relationships. Rather than just explaining these secondary effects of depression, the authors teach you concrete methods that you and your loved one can use to protect yourselves and your relationship from depression's impact.",
        "Category": " Psychology , General",
        "Publisher": "The Free Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Five Comic One-Act Plays (Dover Thrift Editions)",
        "Authors": "By Chekhov, Anton Pavlovich",
        "Description": "One of the foremost dramatists of the 19th century, Russian author Anton Chekhov (1860–1904) created a body of work noted for its realistic dialogue and keen insights into human relationships. This collection of five one-act plays — in the celebrated Constance Garnett translations — shows Chekhov at his witty best.The Anniversary takes a lively look behind the frenetic scenes at a bank: a man overburdened with errands from friends and family gives a nearly maddened but ludicrous account of his chores and obligations in An Unwilling Martyr; and The Wedding depicts scenes from a wedding reception in which the mother of the bride assumes affected airs and deals with quarrelsome guests. In The Bear, a virtuous, spirited widow is pressed to repay a debt and ends up receiving an offer of marriage. The Proposal depicts the trauma of a would-be suitor who winds up in a wrangle over property.Theater lovers, students of drama and literature, and other readers, as well as amateur and professional groups performing these popular works, will welcome this convenient, inexpensive collection of comic gems by one of the masters of modern drama.",
        "Category": " Drama , European , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Party Goes On",
        "Authors": "By Kayden, Xandra and Mahe, Eddie, Jr.",
        "Description": "Describes and analyzes the decline and unexpected rebirth of the two-party political system within the last ten years and considers the impact of the new technologically organized parties",
        "Category": " Political Science , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "11.06",
        "Publish Date": {
            "Month": "December",
            "Year": "1985"
        }
    },
    {
        "Title": "Encyclopedia of wine",
        "Authors": "By schoonmaker, frank",
        "Description": "",
        "Category": "",
        "Publisher": "Hastings house",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Man of Destiny",
        "Authors": "By Gross, Martin L.",
        "Description": "With no prior experience in politics, Charlie Palmer arrives in Washington as a newly elected Congressman from a small town in Ohio, only to find his worst fears realized. On his first day, he rises to national prominence by cutting his own office budget by $400,000. Discovering enormous waste and corruption all around him, he becomes an agent provocateur against special interests and business-as-usual politics - which gains him the enmity of the leaders of both his own party and that of the opposition.To many of the powerbrokers, he is simply a loose cannon with no money, no influence, no power. Some see him as an opportunistic troublemaker. But those who underestimate Charlie Palmer learn that they are making a serious mistake.He gives them reason to fear as he contests the party's nominee for Vice President at the national convention. Realizing that Palmer is a Washington rarity - a man without pretension or guile who will not \"go along\" with the status quo - the powers-that-be close ranks against him.But, as a hero of the disenchanted, Charlie Palmer becomes the most popular politician of the age. A groundswell erupts, supporting him for an independent run for the White House. To the Washington Establishment, this makes him a very dangerous man.Across party lines and behind closed doors, the crooked politicians, the hired consultants, the lavish-spending lobbyists and representatives of foreign corporations join forces to stop Palmer. Using every resource at their disposal - uncovering painful secrets in his past, blackmail, even murder - they try to discredit him in the eyes of the public, hoping to block him from taking the White House in the most exciting and unprecedented election in the nation's history.",
        "Category": " Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Illuminata: A Return to Prayer (RIVERHEAD (TR))",
        "Authors": "By Williamson, Marianne",
        "Description": "Marianne Williamson's bestselling A Return to Love ended with a prayer in which she asked God to help us \"find our way home, from the pain to peace, from fear to love, from hell to Heaven.\" Now, in this stunning new collection of thoughts, prayers, and rites of passage, Marianne Williamson returns to prayer.Prayer is practical, Williamson tells us. \"To look to God is to look to the realm of consciousness that can deliver us from the pain of living.\" Illuminata brings prayer into our daily lives, with prayers on topics from releasing anger to finding forgiveness, from finding great love to achieving intimacy. There are prayers for couples, for parents, and for children; prayers to mend broken relationships and prayers to overcome obsessive and compulsive love. There are prayers to heal the soul, prayers to heal the body, and prayers for work and creativity.Williamson also gives us prayers for the healing of America, including two prayers that have had powerful effects on audiences at her lectures: a prayer of amends on behalf of European Americans to African-Americans and one to Native Americans. How, Williamson asks, can we expect anyone to forgive when we have made no formal apology?Another section includes rites of passage, ceremonies of light for the signal events in our lives: blessing of the newborn, coming of age, marriage, and death. There is also a ceremony of the elder, for moving into midlife, and a ceremony of divorce, in which a gentle transition is provided for both the couple and their children.\"Read my prayers or someone else's,\" Williamson says. \"By all means, create your own.\" Illuminata is a way to bring prayer into practical use, creating a sweeter, more abundant life for yourself and the people you care for. \"No conventional therapy,\" she says, \"can release us from a deep and abiding psychic pain. Through prayer we find what we cannot find elsewhere: a peace that is not of this world.\"",
        "Category": " Religion , Biblical Meditations , General",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "I Dreamed of Africa",
        "Authors": "By Gallmann, Kuki",
        "Description": "",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Penguin USA (P)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Galaxies",
        "Authors": "By Simon, Seymour",
        "Description": "This close-up look at our own Milky Way and other enormous clusters of stars describes the many different types of galaxies, how they were formed, and how they got their different shapes. \"A dazzling photo-essay.\"--School Library Journal.",
        "Category": " Juvenile Nonfiction , Science & Nature , Astronomy",
        "Publisher": "Collins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Beginning Again: More Hors D'Oeuvres for Cooks Who Loved Them in the Beginning",
        "Authors": "By Rockdale Temple Sisterhood",
        "Description": "",
        "Category": "",
        "Publisher": "Rockdale Ridge Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1981"
        }
    },
    {
        "Title": "25 Vegetables Anyone Can Grow",
        "Authors": "By Robbins, Ann Brokaw Roe",
        "Description": "General information on plant diseases, insect pests, garden planning, and canning accompanies advice on the planting, cultivation, and storage of common vegetables",
        "Category": " Gardening , Vegetables",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1974"
        }
    },
    {
        "Title": "The Totally Crab Cookbook (Totally Seafood Series)",
        "Authors": "By Siegel, Helene",
        "Description": "With recipes for classics like crab cakes and cioppino alongside new favorites like Crab Ceviche and Crab Quesadillas with Mango Salsa, this handy pocket-size cookbook has recipes to delight seafood-lovers everywhere.",
        "Category": " Cooking , Specific Ingredients , Seafood",
        "Publisher": "Celestial Arts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "The Ten Commandments (The Little Angel Series)",
        "Authors": "By Cavanagh, Karen",
        "Description": "",
        "Category": "",
        "Publisher": "Regina Pr",
        "Price Starting With ($)": "9.11",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Life Is Uncertain...eat Dessert First!",
        "Authors": "By Gordon, Sol and Brecher, Harold",
        "Description": "Inspiring stories demonstrate how to make the most of life, move beyond the daily trials of life to find joy, and stop putting off happiness until the \"right moment\"",
        "Category": " Psychology , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Miss America",
        "Authors": "By Stern, Howard",
        "Description": "With chapters about his ongoing battle with the FCC and his legendary campaign for the governorship of the State of New York, Howard Stern's Miss America covers some of the biggest news stories of the decade, from the Atlantic City penis sandwich to an exclusive with Jackie O's embalming-fluid delivery boy, and, of course, Philadelphia's own fecal-obsessed Uncle Ed.",
        "Category": " Humor , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Liar's Poker: Rising Through the Wreckage on Wall Street",
        "Authors": "By Lewis, Michael",
        "Description": "The author recounts his experiences on the lucrative Wall Street bond market of the 1980s, where young traders made millions quickly and easily, in a humorous account of greed and epic folly",
        "Category": " Business & Economics , Corporate & Business History",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Lateral Thinking Puzzlers",
        "Authors": "By Miller, Myron (ILT), Sloane, Paul, and MacHale, Des",
        "Description": "Logic is not enough. Edward de Bono coined the phrase \"lateral thinking\" to describe a process of thinking that is different from normal, vertical or forward thinking. Here are nearly a hundred mind-benders, from easy to fiendishly hard, that make you think laterally in order to explain the set of circumstances surrounding a seemingly inexplicable situation.    96 pages, 18 b/w illus., 5 3/8 x 8 1/4.",
        "Category": " Juvenile Nonfiction , Games & Activities , Puzzles",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "A Time to Kill",
        "Authors": "By Grisham, John",
        "Description": "In this searing courtroom drama, best-selling  author John Grisham probes the savage depths of  racial violence... as he delivers a compelling tale  of uncertain justice in a small southern  town...Clanton, Mississippi. The life of a  ten-year-old girl is shattered by two drunken and  remorseless young man. The mostly white town reacts  with shock and horror at the inhuman crime. Until  her black father acquires an assault rifle -- and  takes justice into his own outraged hands.For ten days, as burning crosses and the crack of  sniper fire spread through the streets of  Clanton, the nation sits spellbound as young defense  attorney Jake Brigance struggles to save his  client's life... and then his own...",
        "Category": "",
        "Publisher": "Island Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Bedroom Decorating: Sixty-One Step-by-Step Projects (Arts & Crafts for Home Decorating)",
        "Authors": "By The Home Decorating Institute",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Canada",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "A Home at the End of the World: A Novel",
        "Authors": "By Cunningham, Michael",
        "Description": "From Michael Cunningham, the Pulitzer Prize-winning author of The Hours, comes this widely praised novel of two boyhood friends: Jonathan, lonely, introspective, and unsure of himself; and Bobby, hip, dark, and inarticulate. In New York after college, Bobby moves in with Jonathan and his roommate, Clare, a veteran of the city's erotic wars. Bobby and Clare fall in love, scuttling the plans of Jonathan, who is gay, to father Clare's child. Then, when Clare and Bobby have a baby, the three move to a small house upstate to raise \"their\" child together and, with an odd friend, Alice, create a new kind of family. A Home at the End of the World masterfully depicts the charged, fragile relationships of urban life today. From Michael Cunningham, the Pulitzer Prize-winning author of The Hours, comes this widely praised novel of two boyhood friends: Jonathan, lonely, introspective, and unsure of himself; and Bobby, hip, dark, and inarticulate. In New York after college, Bobby moves in with Jonathan and his roommate, Clare, a veteran of the city's erotic wars. Bobby and Clare fall in love, scuttling the plans of Jonathan, who is gay, to father Clare's child. Then, when Clare and Bobby have a baby, the three move to a small house upstate to raise \"their\" child together and, with an odd friend, Alice, create a new kind of family. A Home at the End of the World masterfully depicts the charged, fragile relationships of urban life today.",
        "Category": " Fiction , Literary",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Evidence That Demands a Verdict, Volume 1: Historical Evidences for the Christian Faith",
        "Authors": "By McDowell, Josh",
        "Description": "Among important books in the defense of Christianity, this one has few equals. Evidence That Demands a Verdict is an easy-to-read, front-line defense for Christians facing the tough questions of critics and skeptics. Using secular evidences and other historical sources, Josh McDowell's faith-building book is a \"must read\" for every Christian.",
        "Category": " Religion , Biblical Criticism & Interpretation , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "The Fat Flush Foods : The World's Best Foods, Seasonings, and Supplements to Flush the Fat From Every Body",
        "Authors": "By Gittleman, Ann Louise",
        "Description": "The Fat Flush Foods: The World's Best Foods, Seasonings, and Supplements to Flush the Fat From Every BodyEverything you need to know about the top fifty Fat Flushing foods The New York Times bestselling The Fat Flush Plan is helping millions lose weight, cleanse their bodies, and lead healthier lives by eating foods that flush away fat while building vitality and strength. Now The Fat Flush Foods highlights the \"super\" foods, herbs, spices, and supplements that help you speed up fat loss and reap maximum health benefits. The Fat Flush Foods features:The Top 50 Super Foods that burn fat, boost your metabolism, and detoxify your body while controlling cholesterol and blood sugar levels The best thermogenic culinary herbs and spices-including ginger, cayenne, mustards, anise, fennel, and cinnamon The latest research on the antiviral, antibacterial, and antifungal properties of these foods Tips that make fat flushing easy, economical, and delicious",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "6.17",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Young Thomas Jefferson - Pbk (Easy Biographies)",
        "Authors": "By Sabin, Francene",
        "Description": "Recounts the life of the versatile inventor and statesman who became third President of the United States, with an emphasis on the days of his youth in Virginia",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Political",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Kids' U.S. Road Atlas",
        "Authors": "By Rand McNally",
        "Description": "",
        "Category": "",
        "Publisher": "Rand McNally",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "No Wrinkles on the Soul: A Book of Readings for Older Adults",
        "Authors": "By Morgan, Richard Lyon",
        "Description": "",
        "Category": " Religion , Reference",
        "Publisher": "Upper Room",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Bert and I",
        "Authors": "By Dodge, Marshall & Bryan, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Bert and I, Incorporated",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1981"
        }
    },
    {
        "Title": "The Key to a Loving Heart",
        "Authors": "By Mains, Karen Burton",
        "Description": "",
        "Category": "",
        "Publisher": "David C. Cook",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "Season of the Witch",
        "Authors": "By Mostert, Natasha",
        "Description": "Asked by a former lover to investigate the disappearance of her stepson, information thief and skilled \"remote viewer\" Gabriel Blackstone begins to investigate a pair of beautiful witch sisters who use their magic to attain vast levels of power, a case during which Gabriel finds himself in mortal danger. By the author of The Midnight Side.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "The Jungle",
        "Authors": "By Caramel",
        "Description": "",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "Bendon Pub Intl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "A Rose for Barbie: A Scented Storybook",
        "Authors": "By Robbins, Trina and Tuveson, Christine (ILT)",
        "Description": "When a neighbor objects to Barbie and her friends planting a garden at Barbie's new house, Barbie decides to plant one for the neighbor, too, in a story that includes a package of flower seeds and a poster",
        "Category": "",
        "Publisher": "Mouse Works",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Caillou the Shopping Trip (North Star)",
        "Authors": "By Nadeau, Nicole and Lapierre, Claude",
        "Description": "While on a shopping trip with his mommy and baby sister Rosie, Caillou insists on doing things by himself but finds he needs a little help.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Editions Chouette Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Thomas and the Magic Railroad : Diesel 10 Means Trouble",
        "Authors": "By Allcroft, Britt and Courtney, Richard (ILT)",
        "Description": "Diesel 10 thinks that steam engines are useless and that diesels are the Really Useful Engines. Find out how Thomas the Tank Engine and his friends prove him wrong in this delightful photographic Pictureback!",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Annie Finds a Home. (A Random House pictureback)",
        "Authors": "By Ehrlich, Amy",
        "Description": "Follows the adventures of Annie as she escapes from the orphanage, finds her dog, Sandy, and is finally adopted by the richest man in the world.",
        "Category": "",
        "Publisher": "Random House Childrens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1982"
        }
    },
    {
        "Title": "Nate the Great and the Fishy Prize",
        "Authors": "By Sharmat, Marjorie Weinman and Simont, Marc (ILT)",
        "Description": "These chapter books introduce beginning readers to the detective mystery genre. Perfect for the Common Core, kids can problem-solve with Nate, using logical thinking to solve mysteries! Nate the Great is about to enter his dog, Sludge, in the smartest pet contest. But when the prize disappears, it looks as if the contest will flop.It's a tough case for Nate and Sludge as they search for clues leading to the missing prize. In more ways than one, it's a very fishy business. Can Nate and Sludge find the prize in time?",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Fibromyalgia & Chronic Myofascial Pain Syndrome : A Survival Manual",
        "Authors": "By Copeland, Mary Ellen and Starlanyl, Devin J.",
        "Description": "Fibromyalgia & Chronic Myofascial Pain Syndrome offers the first comprehensive patient guide for managing these conditions. You'll start by learning what FMS and MPS are, evaluating your own symptoms, and identifying the tender and/or trigger points that are crucial for treating them. The manual covers chronic pain, sleep problems, and other \"internal affairs,\" shows you how you can use your mind to counteract physical symptoms and the numbing effects of \"fibrofog,\" and provides an extensive set of healing tools - including information on the latest medications, a nutritional program, and tips for using bodywork and other less commonly known treatments. Its comprehensive survival strategies include suggestions for coping with family and work situations, getting support, and dealing with the health care system.",
        "Category": " Medical , Diseases",
        "Publisher": "New Harbinger Publications, Inc.",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Amelia Bedelia Goes Camping",
        "Authors": "By Parish, Peggy",
        "Description": "Amelia Bedelia, the maid who always follows directions literally, catches a fish with her hands, pitches a tent into the bushes, and makes chocolate chip cookies with potato chips.",
        "Category": "",
        "Publisher": "Avon Books (Mm)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "The Night Before Christmas (Little Golden Book)",
        "Authors": "By Moore, Clement Clarke and Wilburn, Kathy (ILT)",
        "Description": "",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Sitting Bull: Warrior of the Sioux",
        "Authors": "By Fleischer, Jane",
        "Description": "Traces the life of the brave Sioux Indian who became chief of his nation and led the attack on General Custer",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Associates",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Richard Scarry's Please and Thank You Book (A Random House PICTUREBACK)",
        "Authors": "By Scarry, Richard",
        "Description": "A series of stories featuring Huckle, Lowly, Pig Will, Pig Won't, and other characters who demonstrate the good will generated by nice manners.",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Tonka: Working Hard With The Mighty Loader",
        "Authors": "By Petruccio, Steven James (ILT), Korman, Justine, and Tonka Corporation (COR)",
        "Description": "During the course of a week, Steve and his loader work on a variety of construction jobs, at sites ranging from a zoo to a coal mine",
        "Category": "",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Preschooler's Busy Book: 365 Creative Games & Activities To Occupy 3-6 Year Olds (Busy Books Series)",
        "Authors": "By Kuffner, Trish",
        "Description": "The Preschooler's Busy Book contains 365 activities (one for each day of the year) for three- to six-year-olds using things found around the home. It shows parents, baby-sitters, and daycare providers how to:Save money by making your own paints, play dough, craft clays, glue, paste and other suppliesPrevent boredom during even the longest stretches of rainy or cold weather with ideas for indoor play like newspaper golf, magnet magic, the listening game, red light/green light, and hand puppetsHelp children learn to have fun in the kitchen making fruit kebabs, popsicles, homemade peanut butter, a happy-face sandwich, alphabet cookies, animal pancakes, finger Jell-O, popcorn ball creatures, and the best chocolate chip cookies in the whole worldTeach your child practical skills like setting the table, putting away the silverware, sorting socks, sewing practice, and carpentry (hammering golf tees into Styrofoam, with a toy hammer)Introduce your child to numbers and counting with activities like \"One-Two, Buckle My Shoe,\" telling time, coin and stamp collecting, sorting a mixed-up deck of cards by numbers and learning how to find today's date on a calendarPrepare your child for reading by working on an alphabet puzzle, making alphabet cookies, making an alphabet book, and connecting the dots in alphabetical order to make a pictureGet your child started with music and rhythm by making a pie-plate tambourine, keeping the rhythm to a song on the radio with homemade rhythm blocks or shakers, or make music with musical glasses (filled with different amounts of water)Get your child moving with dances like \"Hokey Pokey,\" \"Skip to My Lou,\" \"Ring Around the Rosie,\" and \"London Bridge\"Encourage your child to enjoy quiet activities like reading wordless picture books, working on puzzles, and watching clouds--and then drawing themIntroduce children to nature with a variety of outdoor adventures from nature walks and picnics to backyard camping, bird feeding, mud painting and making waxed leavesStart children growing things by planting apple seeds, avocado seeds or garlic cloves; or learning how to grow carrots, beets or sweet potatoes by putting cuttings into waterCelebrate holidays and other occasions with special projects and activities for Christmas, Hanukkah, Kwanza, Easter and PassoverKeep children occupied on car trips by playing \"I See A-B-C\" or reciting \"30 Days Hath September\"",
        "Category": " Family & Relationships , Activities",
        "Publisher": "Meadowbrook Acquired",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Lying in Bed",
        "Authors": "By Landis, J. D.",
        "Description": "A man's wife goes out for dinner. He is lying in bed, waiting at home for her to return. The hours go by, the night deepens, and she does not come back. Soon he is nearly insane with longing for her.He has been trapped in his own intellect - a man who, before he met her, stopped speaking entirely for a year. Then she awakened in him a desire so great that he felt reborn and she joined him in a marriage, where every day was filled with discovery, excitement, and arousal. He will do anything to hold on to that feeling.Anything.In one terrifying night of music and madness, the past, the present, the man, and the woman converge in a dangerous psychological and erotic labyrinth. What is real? What is a lie? Who lives? Who dies? The more we learn in J.D. Landis's Lying in Bed, the less we are sure of. And the more we want to know everything.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Algonquin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Europa Conspiracy (Babylon Rising, Book 3)",
        "Authors": "By LaHaye, Tim F. and Phillips, Bob",
        "Description": "Tim LaHaye has called Babylon Rising his most exciting series ever, and The Europa Conspiracy is the most thrilling and suspenseful installment yet. Reaching back to some of the most dramatic and prophetically significant stories of the Bible, and forward to the creation of ultimate evil in the modern world, the awe-inspiring revelations never let up.  It begins when Michael Murphy heads to the ancient city of Babylon in pursuit of one of the most famous and mystifying of Biblical prophecies: The Handwriting on the Wall. But the closer he gets to deciphering the true meaning of Daniel’s ancient message for our troubled times, the closer Murphy comes to a shattering confrontation with the forces of darkness that will cause the earth itself to tremble.In The Europa Conspiracy, Tim LaHaye once again shows how his thrill-a-minute storytelling and deep understanding of the Bible have combined to make him one of today’s most popular and influential fiction authors.",
        "Category": " Fiction , Religious",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Excellent Wife: A Biblical Perspective",
        "Authors": "By Peace, Martha",
        "Description": "",
        "Category": " Religion , Christian Life , Women's Issues",
        "Publisher": "Focus Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Wayside School Is Falling Down",
        "Authors": "By Sachar, Louis",
        "Description": "Bestselling and Newbery Medal-winning author Louis Sachar knows how to make readers laugh. And there are laughs galore in perennial favorite Wayside School Is Falling Down!Yum! Miss Mush is dishing out her famous Mushroom Surprise in the Wayside School cafeteria. Ron says it tastes like hot dogs and grape jelly. Clean your plate and you’ll turn green in time for class picture day. Wear your craziest outfit and you’ll fit right in between Maurecia in her striped bikini and Clavin, who’s wearing his birthday tattoo. Say cheese!More than nine millions readers have laughed at the wacky stories of Wayside School. So what are you waiting for? Come visit Wayside School!",
        "Category": " Juvenile Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "2019"
        }
    },
    {
        "Title": "Heaven and Hell: The Conclusion of the North & South Trilogy",
        "Authors": "By Jakes, John",
        "Description": "The Hazards of Pennsylvania and the Mains of South Carolina struggle through the turbulent decade following the Civil War",
        "Category": " Fiction , General",
        "Publisher": "Harcourt, Brace & Jovanovich",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The Paradise Snare (Star Wars, The Han Solo Trilogy #1)",
        "Authors": "By Crispin, A. C.",
        "Description": "Here is the first book in the blockbuster trilogy that chronicles the never-before-told story of the young Han Solo. Set before the Star Wars movie adventures, these books chronicle the coming-of-age of the galaxy's most famous con man, smuggler, and thief.The first book in this exciting new Han Solo series begins with a recounting of Han's late teen years and shows us how he escaped an unhappy adopted home situation to carve out an adventurous new life for himself as a pilot. Han Solo, the handsome rogue, is every girl's dream man, and every boy's hero.  The Paradise Snare is another stellar Star Wars production, complete with original music and sound effect",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Random House Worlds",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Oliver Twist (Puffin Classics)",
        "Authors": "By Dickens, Charles and Waterfield, Robin",
        "Description": "A poor orphan's adventures in the criminal underworld of mid-nineteenth-century London are the central theme of Dickens' second major novel",
        "Category": " Young Adult Fiction , Classics",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Captain Underpants and the Wrath of the Wicked Wedgie Woman (Captain Underpants #5) (5)",
        "Authors": "By Pilkey, Dav",
        "Description": "When Harold and George turn fourth-grade teacher Ms. Ribble into an evil monster called the Wedgie Woman, she wreaks havoc on the world, giving the wedgie of doom to unsuspecting people who stand in her way--including principal-turned-superhero Captain Underpants.When Harold and George turn fourth-grade teacher Ms. Ribble into the evil Wedgie Woman, she gives the wedgie of doom to unsuspecting people who stand in her way--including principal-turned-superhero Captain Underpants.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Scholastic",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Most Beloved Bible Passages",
        "Authors": "By Ideals Publications Inc",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Ideals Pubns",
        "Price Starting With ($)": "6.14",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "The Voyage of the Dawn Treader (The Chronicles of Narnia, Book 5)",
        "Authors": "By Lewis, C. S. and Baynes, Pauline (ILT)",
        "Description": "A mass-market paperback of The Voyage of the Dawn Treader, book five in the classic fantasy series, The Chronicles of Narnia, featuring cover art by Cliff Nielsen and black-and-white interior illustrations by the original illustrator, Pauline Baynes.A king and some unexpected companions embark on a voyage that will take them beyond all known lands. As they sail farther and farther from charted waters, they discover that their quest is more than they imagined and that the world&#39;s end is only the beginning.The Voyage of the Dawn Treader is the fifth book in C. S. Lewis&#39;s classic fantasy series, a series that has been drawing readers of all ages into a magical land with unforgettable characters for over sixty years. This is a novel that stands on its own, but if you would like to continue to the journey, read The Silver Chair, the sixth book in The Chronicles of Narnia.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "More strange but true baseball stories (Major league library #16)",
        "Authors": "By Liss, Howard",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.59",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Math Smart (Princeton Review Series)",
        "Authors": "By Lerner, Marcia",
        "Description": "A study guide for mathematics, suitable for both the SAT taker and math-deficient individuals of all ages, provides a review of basic math concepts",
        "Category": "",
        "Publisher": "Princeton Review",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Critical Chain",
        "Authors": "By Goldratt, Eliyahu M.",
        "Description": "",
        "Category": " Business & Economics , Management",
        "Publisher": "The North River Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Life As It Was Meant To Be: The Authentic Life from I & II Thessalonians",
        "Authors": "By Ogilvie, Lloyd J.",
        "Description": "",
        "Category": "",
        "Publisher": "Regal Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Take Care Of Yourself: The Complete Guide To Medical Self-care",
        "Authors": "By Vickery, Donald & Fries, James",
        "Description": "Covers disease prevention, exercise, diet, health habits, checkups, aging, doctor selection, medications, and fraud",
        "Category": "",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Mysterious",
        "Authors": "By Roberts, Nora",
        "Description": "",
        "Category": "",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Kids' Party Games & Activities",
        "Authors": "By Warner, Penny and Rogers, Kathy",
        "Description": "Suggests a variety of games and activities for children at different age levels, including traditional games, competitive and noncompetitive activities, and group projects",
        "Category": "",
        "Publisher": "Meadowbrook Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Tiptionary",
        "Authors": "By Hunt, Mary",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "B & H Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Quilts, Coverlets, Rugs (Knopf Collectors' Guides to American Antiques)",
        "Authors": "By Bishop, Robert",
        "Description": "Describes special advice to textile collectors",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1982"
        }
    },
    {
        "Title": "Blue Hearts: A Novel",
        "Authors": "By Lehrer, Jim",
        "Description": "You can never really retire from the Agency. Charles Avenue Henderson, who now runs a pricey bed-and-breakfast in West Virginia and spends his days hiking trails, not following them, is about to be reminded of that salient fact more vividly than he'd like.All he really wants is a little recognition for his covert work on the Kennedy assassination with his cold-war buddy Bruce Conn Clark, a powerful Washington consultant and distinguished elder statesman. But it's not so simple, as he learns one morning when his hotel room in D.C. is bombed just as he's going out to buy the paper. In fact, Charlie's quiet, uncomplicated life turns terrifying faster than he could have imagined; the next day someone severs the brake line in his car. Forced to scrape the rust off spook skills he hasn't used in years, he begins to investigate and finds that all the signs point to Bruce Conn Clark. But why would the former secretary of state want Charlie dead?As the investigation deepens and the stakes grow higher, Bruce and Charlie discover that while decades-old promises and secrets could destroy them, they might also give them back their youth. The ensuing game of spy versus spy may be their toughest yet.Blue Hearts is filled with characters from real life, such as James Jesus Angleton, John McCone, and Alexander Gannady Petrov, and other spies and public figures both real and imagined. It's also replete with Washington gossip and tidbits that only a writer with sources inside Langley could provide. Blue Hearts is as thrilling a ride through the assassination conspiracies, cold-war battles, and covert operations of the last thirty years as any spy-novel aficionado could hope to find.",
        "Category": " Fiction , Literary",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "How To Prepare And Present A Business Plan",
        "Authors": "By Mancuso, Joseph R.",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Perfect Business: How To Make A Million From Home With No Payroll No Debts No: How To Make A Million From Home With No Payroll No Employee Headaches No Debt",
        "Authors": "By Leboeuf, Michael (NRT)",
        "Description": "Offers explanations of and guidance in the key components of a successful home-based business, emphasizing success-oriented thinking and covering such important topics as choosing the right business, marketing oneself, and using information technology. Read by Michael LeBoeuf. Simultaneous.",
        "Category": " Self-help , General",
        "Publisher": "Sound Ideas",
        "Price Starting With ($)": "14.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Prescription Drugs",
        "Authors": "By Consumer Guide",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Hometown Humor, U.S.A.: Over 300 Jokes and Stories from the Porch Swings, Barber Shops, Corner Cafes, and Beauty Parlors of America",
        "Authors": "By Jones, Loyal and Wheeler, Billy Edd",
        "Description": "Gathers humorous anecdotes from rural and small-town America about religion, doctors, lawyers, school, politics, farming, and alcohol",
        "Category": " Humor , Form , Jokes & Riddles",
        "Publisher": "August House Pub Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    }
]