[
    {
        "Title": "Our Southern landsman",
        "Authors": "By Golden, Harry",
        "Description": "",
        "Category": "",
        "Publisher": "Putnam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Product Strategy for High-Technology Companies: How to Achieve Growth, Competitive Advantage, and Increased Profits",
        "Authors": "By McGrath, Michael E.",
        "Description": "Product strategy is the most important determinant of success for high-technology companies. It defines the products on which a company bases its business and shapes the way those products will win or lose against the competition. Yet even in high-technology companies, very few executives understand how to conceive and shape successful product strategy.Product Strategy for High-Technology Companies shows how to formulate product strategies that lead to successful products. This comprehensive guide covers everything high-tech companies should consider in developing their strategies, including timing, technological change, globalization, product differentiation, cost and price, and contingency planning, as well as marketing and financial considerations.Product Strategy for High-Technology Companies offers more than strategic guidance. Through more than 250 examples, you'll discover how product strategy has been used at such companies as Microsoft, IBM, Compaq Computer, Hewlett-Packard, and many others. Through their trials, errors, and successes, and through the book's expert insights, you'll have a complete framework for building your own innovative, competitive product strategy.",
        "Category": " Business & Economics , Development , Business Development",
        "Publisher": "Irwin Professional Pub",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Your Pregnancy After 30 (Your Pregnancy Series)",
        "Authors": "By Curtis, Glade B. and Fischer, David (ILT)",
        "Description": "\"A complete guide for the mature mother-to-be that addresses such special concerns as high-risk pregnancy, genetic counseling, exercise during and after pregnancy, and childcare.\"",
        "Category": " Health & Fitness , Pregnancy & Childbirth",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.56",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Hollies",
        "Authors": "By Hume, H Harold",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "5.61",
        "Publish Date": {
            "Month": "January",
            "Year": "1953"
        }
    },
    {
        "Title": "Canterbury Cathedral",
        "Authors": "By Jonathan Keates",
        "Description": "",
        "Category": "",
        "Publisher": "Philip Wilson/Scala",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Airshow",
        "Authors": "By Handleman, Philip",
        "Description": "Explores the sights at air shows, including early aircraft, racing, aerial acrobatics, and other attractions",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "The Intimate Connection",
        "Authors": "By Nelson, James B.",
        "Description": "",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Westminster John Knox Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Psychiatry and the human condition",
        "Authors": "By Galdston, Iago",
        "Description": "",
        "Category": "",
        "Publisher": "Brunner/Mazel",
        "Price Starting With ($)": "31.14",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "35 years of NATO: A transatlantic symposium on the changing political, economic, and military setting",
        "Authors": "By Godson, Joseph (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Dodd Mead",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "No Physical Evidence",
        "Authors": "By Lee, Gus",
        "Description": "A lawyer divided between cultures and torn by grief. A gripping, page-turning plot. An intense courtroom showdown. Acclaimed author Gus Lee combines these elements into an electrifying novel of legal suspense as several lives hinge on the verdict in one shocking case.Joshua Jin is a deputy district attorney whose life is in crisis and his job in jeopardy. Now he is handed a politically charged Chinatown case involving the rape of a thirteen-year-old girl. The victim refuses to talk. The ex-con charged with the crime was arrested on a hunch. And . . . there is no physical evidence.As an Asian-American prosecutor, Jin is under immense pressure from Chinatown to win a conviction. First, however, he must earn the confidence of his stone-silent client, a distant, troubled teenager who trusts no one. Working against a brilliant, high-priced defense attorney who wants nothing more than to crush the opposition--particularly when her opposition is Josh Jin--he throws his heart and soul into an impossible case that is far more explosive than he had ever imagined.A stunning courtroom drama pulsing with the rhythm of the streets and the politics of the Asian-American experience, No Physical Evidence is fast, furious, and surprising: a passionate novel of crime, punishment, and ultimate redemption.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Stories of Eva Luna",
        "Authors": "By Allende, Isabel",
        "Description": "The main character of Eva Luna  offers two dozen vibrant, enchanting stories to her lover, Rolfe Carle. By the author of House of the Spirits. Reprint. 125,000 first printing. NYT.",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Change Your Looks, Change Your Life: Quick Fixes and Cosmetic Surgery Solutions for Looking Younger, Feeling Healthier, and Living Better",
        "Authors": "By Copeland, Michelle, Ph.D. and Postman, Alexandra S.",
        "Description": "What if our lives, social and professional, could be changed for the better by cosmetic surgery or even a simple lunch-hour procedure?A recognized leader in the plastic surgery field, Dr. Copeland draws on years of clinical experience to guide readers through the myriad of options for cosmetic enhancement. With input from dozens of patients, complex-sounding procedures -- from face-lifts and breast surgery to liposuction and tummy tucks -- are demystified and defined, enabling readers to approach their doctors with confidence and gain the knowledge necessary to make an informed decision.Dr. Copeland also details nonsurgical \"lunchtime fixes\" such as Botox injections, light-laser treatments, and collagen injections, as well as topical peels and creams to banish wrinkles and improve appearance without recovery time.If you are among the increasing number of men and women who want to look younger, feel healthier, and live better than you ever thought possible, Dr. Copeland's skillful advice will inspire you to take control of your own cosmetic wellness.",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Secret of Platform 13",
        "Authors": "By Ibbotson, Eva and Porter, Sue (ILT)",
        "Description": "Cornelius the wizard, Gurkintrude the fey, Hans the ogre, and Odge Gribble the hag only have nine days to search London, locate the kidnapped prince, and return him to the Island before the passageway to their magical kingdom will close, and they will not be able to return for nine years",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Dutton Juvenile",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Ragnarok: Night of Blood, Vol. 3",
        "Authors": "By Lee, Myung-Jin (CRT)",
        "Description": "In the time when Ragnarok, the fall of the gods, has been predicted to occur, Fenris Fenrir is on a desperate quest to locate the reincarnated Balder, to seek his help in changing the world, before the valkyries find him and civilization is doomed.",
        "Category": " Young Adult Fiction , Legends, Myths, Fables , General",
        "Publisher": "TokyoPop",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Two Koreas: Revised And Updated A Contemporary History",
        "Authors": "By Oberdorfer, Don",
        "Description": "Veteran journalist and contemporary historian Oberdorfer (international studies, Johns Hopkins U.) updates his 1997 account of how the two halves of the ancient and homogeneous people, thoughtlessly divided at the end of World War II, have grappled with each other for advantage and supremacy and dealt with the powerful forces all around them. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " History , Asia , Korea",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Top Secret Recipes: Creating Kitchen Clones of America's Favorite Brand-Name Foods",
        "Authors": "By Wilbur, Todd",
        "Description": "#1 bestselling Top Secret Recipes series with more than 4 million books sold! Have you ever wanted to make a McDonald’s® Big Mac®? What about a Hostess® Twinkie®? This irresistible collection of cloned recipes is the product of years of obsessive research by self-confessed junk-food addict Todd Wilbur—and now you can make them, too!Big food manufacturers guard their recipes like the gold in Fort Knox, but Wilbur’s dogged pursuit of taste-alike versions of his—and our—all-time favorites has paid off in this unique cookbook of 50 scrumptious treats. Whether you’re a kid or just a kid at heart, you’ll have a great time using these step-by-step recipes to make the incredible clones of a Burger King® Whopper®, KFC® Original Recipe® Fried Chicken, a Yoo Hoo® Chocolate Drink, and so many other famous guilty pleasure foods.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Tiger Heart, Tiger Mind: How to Empower Your Dream-A Zentrepreneur's Guide (Entrepreneur's Guide (New Market Press))",
        "Authors": "By Rubin, Ron and Gold, Stuart Avery",
        "Description": "The journey continues in the fourth book of the highly acclaimed Zentrepreneur Guide series, embraced by readers and reviewers everywhere. There is no path to actionthe action is the path. The Zentrepreneur, like the tiger, journeys by doing no more or no less, than deciding on going where it wishes to be.From Tiger Heart, Tiger Mind Tiger Heart, Tiger Mind is a book about waking up every morning with a will and a willingness to practice doing and being. On this Zentrepreneur pilgrimage of practice and expansion, readers will be inspired to actively take responsibility for their lives, reach beyond the horizon to new vistas, and experience their richly deserved dream.",
        "Category": " Business & Economics , Motivational",
        "Publisher": "Newmarket Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Little Jewish Cookbook",
        "Authors": "By Bloch, Barbara and Leibowitz, Fiona (ILT)",
        "Description": "Presents 28 recipes including latkes, schmaltz and griebens, felafel, chicken soup, and almond macaroons",
        "Category": " Cooking , Regional & Ethnic , Jewish & Kosher",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "International Financial Management",
        "Authors": "By Rodriguez, Rita M.",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.18",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "Diplomacy for a crowded world: An American foreign policy",
        "Authors": "By Ball, George W.",
        "Description": "",
        "Category": "",
        "Publisher": "Little & Brown",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Shanken's Cigar Handbook: A Connoisseur's Guide to Smoking Pleasure",
        "Authors": "By Shaken, Marvin R.",
        "Description": "",
        "Category": " Reference , General",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Godfrey Daniels! Verbal and Visual Gems from the Short Films of W. C. Fields",
        "Authors": "By Richard J. Anobile, Raymond Rohauer (Introduction)",
        "Description": "",
        "Category": "",
        "Publisher": "Darien House : distributed by Crown Publishers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Madwand  (Changeling Saga # 2)",
        "Authors": "By Zelazny, Roger",
        "Description": "Raised on Earth, Pol Detson returns home to Rondoval, a world of magic, where he must learn to control his powers in order to survive",
        "Category": "",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1981"
        }
    },
    {
        "Title": "Mah Jong Handbook How to Play, Score, and Win the Mo",
        "Authors": "By Whitney, Eleanor Noss",
        "Description": "Explains the fundamentals of this ancient Oriental game as it is played in America and the East",
        "Category": " Games & Activities , Puzzles",
        "Publisher": "Tuttle Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1964"
        }
    },
    {
        "Title": "Science (Handy homework helper)",
        "Authors": "By Mathieu, Devi",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Childhood Antiques",
        "Authors": "By MacKay, James A.",
        "Description": "Pictures and describes objects including nursery furnishings, dolls, games, clothing and accessories, musical instruments, and books, that were part of the child's world from the early Victorian period to the 1930's",
        "Category": " Technology & Engineering , General",
        "Publisher": "Taplinger Pub Co",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "December",
            "Year": "1976"
        }
    },
    {
        "Title": "Chronicle of America",
        "Authors": "By Daniel, Clifton",
        "Description": "Surveys the history of America from Colonial America through the Civil War and industrialization to the First and Second World Wars and superpower negotiations",
        "Category": " History , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.66",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "The Eleven Million Mile High Dancer (Contemporary American fiction)",
        "Authors": "By Hill, Carol",
        "Description": "Intellectual sparks fly in this Space Age chronicle of the life, loves, and intergalactic adventures of sexy astronaut/physicist Amanda Jaworski, who approaches the natural and the supernatural with the same high-spirited, informed humor",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "Tales of Virtue: A Book of Right and Wrong (The Beginners Bible)",
        "Authors": "By Baker, Carolyn Nabors",
        "Description": "Introduces the stories of Joseph, Ruth and Naomi, Adam and Eve, and others, and tells how they illustrate such virtues as forgiveness, loyalty, and responsibility",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The Attorney (Paul Madriani, Book 5)",
        "Authors": "By Martini, Steve",
        "Description": "Having moved to San Diego to be closer to the woman in his life, Madriani takes on the case of Jonah Hale, an elderly man in dire straits. Because of the longtime drug addiction of their only child, Jessica, Jonah and his wife have been raising their eight-year-old grand-daughter, Amanda. After Jonah wins a multi-million-dollar state lottery, Jessica revives her interest in mothering. When Jonah won't deal - maternal rights for a megabucks pay-off - Jessica pulls out all the stops.Enter Zo Strade, a flamboyant feminist activist with a talent for making children and their \"victimized\" mothers disappear. When the next moves turns deadly, Madriani finds himself drawn into a web of deceit and high-stakes action, in and out of the courtroom.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "In Love With Night: The American Romance With Robert Kennedy",
        "Authors": "By Steel, Ronald",
        "Description": "More than three decades have passed since Robert Kennedy was assassinated seeking the Democratic nomination for the presidency. During that time a powerful legend has grown around him. It decrees that he would have quickly ended the Vietnam War, violence in the cities, and racial and social injustice across the land. Millions of Americans continue to believe that legend. For them the yearning for Kennedy is an unhealed wound.  But would he have done what so many wanted from him? Is the Robert Kennedy legend just that -- a legend based more on hope and longing than on reality? This is the question that continues to haunt American politics.  Drawing on his striking interpretation of Kennedy's character, award-winning historian Ronald Steel examines the life against the legend. It is that legend -- one that Kennedy consciously helped create -- that has made him the vessel of the nation's frustrated dreams. Those dreams have created the enduring myth of \"what might have been.\"  Why was a man who began his career as a dark enforcer of his family's ambition ultimately mourned as a secular saint who could have transformed America? How did he build a mythology that made him the heir apparent to his brother's unfulfilled presidency? Were there, in fact, two Bobbys: an early and a late one, a good and a bad one?  With empathy, yet with skepticism, Steel holds up to scrutiny the three central elements of the Kennedy legend: the faith in a golden kingdom of Camelot that could be restored, the belief that he would have achieved the goals that liberals sought, and the hope that he would have united blacks and whites in common endeavor.  What we mourn, Steel concludes, is not so much what Kennedy would have done, or \"what might have been,\" but our own hopes for political deliverance. That is the power, and also the problem, of the Bobby Myth. Yet \"myths can inspire, or they can imprison,\" Steel writes. \"The Bobby Myth,\" he shows in this penetrating study of personality and politics, \"is our creation, not",
        "Category": " History , United States , 20th Century",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Good Rockin' Tonight: A Collection of Short Stories",
        "Authors": "By Hauptman, William",
        "Description": "Nine stories deal with an Elvis impresonator, an aspiring actor, a hang glider, a drifter with big plans, a struggling family, the sixties, and divorce",
        "Category": " Fiction , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Nationalized Industries (Modern Economic Texts)",
        "Authors": "By Graham L. Reid~Kevin Allen",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "On (Ronald) Reagan: The Man and His Presidency",
        "Authors": "By Dugger, Ronnie",
        "Description": "",
        "Category": " History , General",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "Domesticities: At Home with The New York Times Magazine",
        "Authors": "By Viladas, Pilar",
        "Description": "A richly illustrated look at trendsetting homes profiles the work of some of the finest architects and designers of the time, documenting the unique features of an array of houses and apartments that run the gamut from large to small, retro to cutting-edge, traditional to eclectic, highlighting the work of Gio Ponti, Jonathan Adler, Vicente Wolf, and others. 35,000 first printing.",
        "Category": " House & Home , Design & Construction",
        "Publisher": "Bulfinch",
        "Price Starting With ($)": "7.51",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Arthritis Helpbook: A Tested Self-management Program For Coping With Arthritis And Fibromyalgia, Fourth Edition",
        "Authors": "By Lorig, Kate and Fries, James F.",
        "Description": "Outlines exercises, pain management techniques, nutrition, and ways of beating everyday problems such as opening jars",
        "Category": " Health & Fitness , General",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The Possible She",
        "Authors": "By Jacoby, Susan",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Farrar Straus & Giroux",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "March",
            "Year": "1979"
        }
    },
    {
        "Title": "Faust, Part 1",
        "Authors": "By Goethe, Johann Wolfgang Von",
        "Description": "A brief analysis of the development, style, and protagonists of the play is included with Goethe's masterpiece about a troubled man who sells his soul to the devil",
        "Category": " Fiction , General",
        "Publisher": "Penguin Group USA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "The Melting Pot and Other Subversive Stories",
        "Authors": "By Schwartz, Lynne Sharon",
        "Description": "Dramatizing the warfare between people's illusion and truth, fantasies and realities, these stories center on the ways people undermine themselves by obsession and delusion",
        "Category": " Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "18.3",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Great Speeches (Dover Thrift Editions)",
        "Authors": "By Grafton, John (EDT) and Roosevelt, Franklin D.",
        "Description": "In the relatively short span of 25 years — from his first national campaign in 1920 to his death in the first year of his fourth term as President in 1945 — Franklin Delano Roosevelt delivered hundreds of speeches, many of them masterly orations.Perhaps the finest speechmaker in American history, FDR was a consummate expert at reading his audience. He could be dazzlingly informal, imperiously statesmanlike, witheringly sarcastic, stern, and serious, and when the occasion permitted, outright funny. Though his audiences often included more than 30 million listeners in America and millions more around the world, he succeeded in doing what so many speakers strive for and so few accomplish — he left his listeners with the feeling that he was speaking to them alone.This representative collection of 27 of FDR's finest speeches recalls a number of momentous events in his political career and the life of the nation. Included are his dramatic and inspirational First Inaugural Address (March 4, 1933) in which he told the nation that \"the only thing we have to fear is fear itself\"; his first \"Fireside Chat\" (March 12, 1933) over the radio; his dramatic War Message to Congress (December 8, 1941) following the Japanese attack on Pearl Harbor (\"a day that will live in infamy\"); his Fourth Inaugural Address (January 20, 1945); and many more.Assembled here in one convenient volume, these speeches provide students of history, politics, and rhetoric, as well as general readers, with an immensely useful reference, a wealth of fine oration, and a valuable window on the Roosevelt years.",
        "Category": " Literary Criticism , American , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "For the Love of Labrador Retrievers",
        "Authors": "By Hutchinson, Robert",
        "Description": "",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "BrownTrout Publishers",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "China Moon Cookbook",
        "Authors": "By Tropp, Barbara and Schreil, Arminda Asprer",
        "Description": "Winner of an IACP/Julia Child Cookbook Award The \"Julia Child of Chinese cooking\" (San Francisco Chronicle), Barbara Tropp was a gifted teacher and the chef/owner of one of San Francisco's most popular restaurants. She was also the inventor of Chinese bistro, a marriage of home-style Chinese tastes and techniques with Western ingredients and inspiration, an innovative cuisine that stuffs a wonton with crab and corn and flavors it with green chili sauce, that stir-fries chicken with black beans and basil, that tosses white rice into a salad with ginger-balsamic dressing. Casual yet impeccable, and as balanced as yin and yang, these 275 recipes burst with unexpected flavors and combinations: Prawn Sandpot Casserole with Red Curry and Baby Corn; Spicy Tangerine Beef with Glass Noodles; Pizzetta with Chinese Eggplant, Wild Mushrooms, and Coriander Pesto; Chili-Orange Cold Noodles; Sweet Carrot Soup with Toasted Almonds; Wok-Seared New Potatoes; Crystallized Lemon Tart; and Fresh Ginger Ice Cream.",
        "Category": " Cooking , Regional & Ethnic , Chinese",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The Extraordinary Adventures of Alfred Kropp",
        "Authors": "By Yancey, Rick",
        "Description": "Alfred Kropp was just trying to survive high school when his guardian uncle gets him roped into a suspicious get-rich-quick scheme that changes his life forever: stealing Excalibur—the legendary sword of King Arthur. But after Alfred unwittingly delivers the sword into the hands of a man with enormously evil intentions, he sets off on an unlikely quest to try to right his wrong and save the world from imminent destruction. This gripping, fast-paced, hilarious novel is both a thrilling adventure story and an engaging account of one boy's coming of age.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Bloomsbury USA Childrens",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Confessions of a Wall Street Analyst",
        "Authors": "By Reingold, Jennifer and Reingold, Dan",
        "Description": "Here is the true story of a top Wall Street player's transformation from a straight-arrow believer to a jaded cynic, who reveals how Wall Street's insider game is really played.Dan Reingold was a top Wall Street analyst for fourteen years and Salomon Smith Barney analyst Jack Grubman's chief competitor in the red-hot sector of telecom. Reingold was part of the \"Street\" and believed in it.But in this action-packed, highly personal memoir written with accomplished Fast Company senior writer Jennifer Reingold the author describes how his enthusiasm gave way to disgust as he learned how deeply corrupted Wall Street and much of corporate America had become during the roaring stock market bubble of the 1990s.Confessions of a Wall Street Analyst provides a front-row seat at one of the most dramatic -- and ultimately tragic -- periods in financial history. Reingold recounts his introduction to the world of Wall Street leaks and secret deal-making; his experiences with corporate fraud; and Wall Street's alarming penchant for lavish spending and multimillion-dollar pay packages.Reingold spars with arch rival Grubman; fends off intense pressures from Wall Street bankers and corporate CEOs; and is wooed by Morgan Stanley's CEO, John Mack, and CSFB's über-banker Frank Quattrone.Reingold describes instances in which confidential deals are whispered days before their official announcement.  He recalls the moment he learns that Bernie Ebbers's WorldCom was massively cooking its books. And he is shocked to have been an unwitting catalyst for a series of sexually explicit e-mails that would rock Wall Street; bring Jack Grubman to his knees; and contribute to the stepping aside of Grubman's boss, Citigroup CEO Sandy Weill.Some of Reingold's stories are outrageous, others hilarious, and many are simply absurd. But, together, they provide a sobering exposé of Wall Street: a jungle of greed and ego, a place brimming with conflicts and inside information, and a business absurdly out of touch with the Main Street it claims to serve.He shows how government investigators, headlines notwithstanding, never got to the heart of the ethical and legal transgressions of the era. And how they completely overlooked Wall Street's pervasive use of inside information, leaving investors -- even sophisticated professionals -- cheated. The book ends with a series of important policy recommendations to clean up the investing business.In the tradition of Liar's Poker and Den of Thieves, Confessions of a Wall Street Analyst is a no-holds-barred insider's account that will open the eyes of every investor.",
        "Category": " Law , Criminal Law , General",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "The Politician's Guide to Assisted Suicide, Cloning, and Other Current Controversies",
        "Authors": "By Marlin, George J.",
        "Description": "",
        "Category": " Political Science , Reference",
        "Publisher": "Morley Inst",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The Waldheim Affair: Democracy Subverted",
        "Authors": "By Tittmann, Harold H.",
        "Description": "",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Olin Frederick Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "The Clintons of Arkansas: An Introduction by Those Who Know Them Best",
        "Authors": "By Dumas, Ernest (EDT)",
        "Description": "This collection of anecdotal stories by the people who know them best introduces Bill and Hillary to the nation as only friends can. The essays collectively place the Clintons into proper social, historical, and geographical context for anyone who wants to know the former First Family on a more personal level.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "University of Arkansas Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Across China",
        "Authors": "By Jenkins, Peter",
        "Description": "Recounts the author's adventures in the mountains of Tibet and the forbidden city of Lhasa, up Mount Everest with the 1984 China-Everest Expedition, and then across China to the wild plains of Mongolia in the far north",
        "Category": "",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Generation J",
        "Authors": "By Schiffman, Lisa",
        "Description": "\"I'm not alone. I am part of a generation of fragmented Jews. We're in a kind of limbo. We're suspended between young adulthood and middle age, between Judaism and atheism, between a desire to believe in religion and a personal history of skepticism. Call us a bunch of searchers. Call us post-Holocaust Jews. Call us Generation J.\"Generation J is the ambivalent generation: unaffiliated seekers, men and women who have grown up questioning the bounds of organized religion. Lisa Schiffman is one of these seekers, and Generation J chronicles her journey through the contradictory landscape of Jewish identity. Moving from the personal to the universal, from autobiography to anthropology, from laughter to tears, Schiffman shows us the many ways in which one can be religious.Whether dipping into a ritual bath, getting henna-tattooed with the Star of David, unravelling the mysteries of the kabbalah, or confronting what Jewish tradition has to say about gay marriage, Schiffman reveals the conflicts of meaning and connection common to all who try to chart their own spiritual path. And, through it all, with humor and sensitivity, she confronts the reasons for her own quest and begins to untangle some of the thorniest questions about identity, community, and religion in America today. This engaging exploration of what it means to be Jewish is every bit as much a fascinating tour of the varieties of contemporary Jewish practice as it is an unusual personal quest. Smart, funny, and provocative, Schiffman brilliantly explores the problems and possibilities facing any spiritual seeker today.",
        "Category": " Religion , Judaism , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Cats in the Parsonage (All God's Creatures Series, Book 1)",
        "Authors": "By Shaffer, Clair, Jr.",
        "Description": "",
        "Category": " Pets , Cats , General",
        "Publisher": "Evergreen Press (AL)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Gentle People: A Portrait of the Amish",
        "Authors": "By DENLINGER, DONALD M. and Warner, James A.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Bbs Pub Corp",
        "Price Starting With ($)": "5.18",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "All About Trees (Question and Answer Book)",
        "Authors": "By Dickinson, Jane and D'Adamo, Anthony (ILT)",
        "Description": "Questions and answers provide basic information about the physiology, repoductive cycle, and utilization of trees.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "The Vampire's Assistant (Cirque du Freak, Book 2) (Cirque Du Freak, 2)",
        "Authors": "By Shan, Darren",
        "Description": "In the tradition of Ray Bradbury's Something Wicked This Way Comes, and Stephen King's Salem's Lot, the nightmare continues for the new vampire's assistant in the popular Saga of Darren Shan.  Darren Shan was just an ordinary schoolboy until his visit to the Cirque Du Freak. Now, as he struggles with his new life as a Vampire's Assistant, he tries desperately to resist the one temptation that sickens him, the one thing that can keep him alive. But destiny is calling. The Wolf Man is waiting.",
        "Category": " Young Adult Fiction , Horror",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Thinking Fan's Guide to the World Cup",
        "Authors": "By Weiland, Matt (EDT) and Wilsey, Sean (EDT)",
        "Description": "The Thinking Fan's Guide to the World Cup features original pieces by thirty-two leading writers and journalists about the thirty-two nations that have qualified for the world's greatest sporting event. In addition to all the essential information any fan needs—the complete 2006 match schedule, results from past tournaments, facts and figures about the nations, players, teams, and referees—here are essays that shine a whole new light on soccer and the world.Former Foreign Minister of Mexico Jorge G. Castañeda invites George W. Bush to watch a game.Novelist Robert Coover remembers soccer in Spain after the death of General Francisco Franco.Dave Eggers on America, and the gym teachers who kept it free from communism.Time magazine's Tokyo bureau chief Jim Frederick shows how soccer is displacing baseball in Japan.Novelist Aleksandar Hemon proves, once and for all, that sex and soccer do not mix.Novelist John Lanchester describes the indescribable: the beauty of Brazilian soccer.The New Yorker's Cressida Leyshon on Trinidad and Tobago, 750-1 underdogs.Fever Pitch author Nick Hornby on the conflicting call of club and country.Plus an afterword by Franklin Foer on the form of government most likely to win the World Cup.",
        "Category": " Sports & Recreation , Soccer",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Praying Our Goodbyes",
        "Authors": "By Rupp, Joyce",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Ave Maria Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "The Art of Coming Home",
        "Authors": "By Storti, Craig",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Nicholas Brealey",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The 25 Sales Skills: They Don't Teach at Business School",
        "Authors": "By Schiffman, Stephan",
        "Description": "Master the skills you can't learn in a classroom!You can break into today's cutting-edge sales force--and become a leader. All it takes is learning Stephan Schiffman's essential skills. Honed to perfection over decades of experience, his techniques will make you a top sales performer.From the man who's trained more than a half-million salespeople, these are the secrets you won't learn in any classroom. Now they're yours for the taking and will put you on the fast track to career advancement. With Schiffman at your side, you can build a successful sales future for your company and yourself.",
        "Category": " Business & Economics , Sales & Selling , General",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Adams Cover Letter Almanac",
        "Authors": "By Adams Media (COR) and Adams, Robert L. (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Backyard Naturalist",
        "Authors": "By Tufts, Craig",
        "Description": "",
        "Category": "",
        "Publisher": "National Wildlife Federation",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Possibilities for Over One Hundredfold More Spiritual Information: The Humble Approach in Theology and Science",
        "Authors": "By Templeton, John",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Templeton Press",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Simple Changes: Quietly Overcoming Barriers to Personal and Professional Growth",
        "Authors": "By Wicks, Robert J.",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Thomas More Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Well Fed Baby: Healthy, Delicious Baby Food Recipes That You Can Make At Home",
        "Authors": "By Bloom, Thomas A., Ph.D. and Sweet, O. Robin",
        "Description": "Here is you source book for feeding your baby the healthy and natural way as seen on Mothering, the television series on Fox FX, Fox Fit TV, and Fox Health Networks. From the makers of The Well Fed Baby line of organic, soy-based baby food, this book offers parents easy-to-make, all-natural recipes as an alternative to baby food. Not only are these recipes better-tasting and healthier than processed jarred baby food, they can be made at home in just minutes and at a fraction of the cost. Some of the recipes are presented by guest chefs who share with you their favorite ways to feed their little ones.The Well Fed Baby will teach you the basics of making baby food at home, as well as the benefits of using organic foods and soy foods, and how to initiate healthy eating habits from birth. The authors guide you through the different stages of feeding your baby, from milk and strained cereal at six months to chopped foods at twelve months. Your baby will love meals such as Carrot Puree with Mint, Baked Acorn Squash and Brown Rice, and Broccoli and Chicken Dinner. And you will love knowing that you are giving the very best to your well-fed baby.The Well-Fed Baby offers parents an alternative to jarred baby food, most of which is loaded with sweeteners. Making baby food at home is easy-almost all you need are fresh fruits and vegetables and a food processor or blender. Following Robin Sweet's recipes, the results are delicious purees of apples, mangos, bananas, carrots, and other foods that babies love. The Well-Fed Baby will be an essential purchase for expecting parents.The Well-Fed Baby is the tie-in for a new television program by the same name, airing Fall 1999 on Fox FX, Fox Fit TV, and brand-new Fox Health networks. Produced by author Robin Sweet, the new series will cover everything related to keeping your baby healthy: diet, exercise, and so much more. Robin Sweet will demonstrate how to make baby food at home on each episode. The author will also promote the cookbook on the air.The Well-Fed Baby offers parents an alternative to jarred baby food, most of which is loaded with sweeteners. Making baby food at home is easy-almost all you need are fresh fruits and vegetables and a food processor or blender. Following Robin Sweet's recipes, the results are delicious purees of apples, mangos, bananas, carrots, and other foods that babies love. The Well-Fed Baby will be an essential purchase for expecting parents.The Well-Fed Baby is the tie-in for a new television program by the same name, airing Fall 1999 on Fox FX, Fox Fit TV, and brand-new Fox Health networks. Produced by author Robin Sweet, the new series will cover everything related to keeping your baby healthy: diet, exercise, and so much more. Robin Sweet will demonstrate how to make baby food at home on each episode. The author will also promote the cookbook on the air.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Talking Dirty With The Queen Of Clean",
        "Authors": "By Cobb, Linda",
        "Description": "Want to clean a coffeepot in a flash? Unclog a sink with a simple homemade solution ? Do away with microwave odors? Banish those dust bunnies?  Let her royal highness of housekeeping show you how to turn your home into a sparkling palace -- in no time at all!  Step aside, Martha...Here comes the Queen of Clean, and her down-to-earth housekeeping guide for those of us who live in the real world. After all, the Queen has better things to do than be a slave to housework. That's why she has assembled a marvelous collection of miraculous cleaning tips and surprising shortcuts that get the job done quickly and well. Without a lot of fuss, you can solve hundreds of cleaning challenges in every room of your home:   Remove dust, rust, gum, fingerprints, stains, odors, and mildew  Clean leather and upholstery, carpets, windows, walls, floors, kitchen appliances, grills, and more   Deal with damage form flooding and fire   The queen count her pennies too -- with inexpensive, environmentally friendly cleaning concoctions and ingredients you might never expect, including   Tea -- the wood cleaner you can drink!  The amazing rust-removing power of the onion  Lemon juice  Vinegar  Petroleum jelly  Baking soda  ...and the five cleaning products you should never be without!   Let the Queen of Clean put an end to drudgery with her hints and solutions that get fabulous results -- fast!",
        "Category": " House & Home , Cleaning, Caretaking & Organizing",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Stranger in Paradise",
        "Authors": "By Goudge, Eileen",
        "Description": "In the first volume of a new Carson Springs trilogy, a woman falls in love with a much younger man, igniting a storm of disapproval and dismay among the inhabitants of this unique California valley in which families have deep and tangled roots and hide dangerous secrets. 100,000 first printing.",
        "Category": " Fiction , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Moor's Last Sigh: A novel",
        "Authors": "By Rushdie, Salman",
        "Description": "The Moor evokes his family's often grotesque but compulsively moving fortunes and the lost world of possibilities embodied by India in this century. His is a tale of premature deaths and family rifts, of thwarted loves and mad passions, of secrecy and greed, of power and money, and of the even more morally dubious seductions and mysteries of art.",
        "Category": " Fiction , Sagas",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "11.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Fair Warning: A Novel",
        "Authors": "By Butler, Robert Olen",
        "Description": "At age forty, Amy is the company's star employee - capable of selling a Renoir painting of a pudgy nude for twice its value. Hers are the charms and talents of a sophisticated woman: intelligence, ambition, wit, and endless charisma. Her customers, meanwhile, are intoxicated by a love for the objects that define them, and thrilled by the act of making them their own. And sometimes, such as when the dark and mysterious Trevor locks eyes with Amy as she closes an auction with \"fair warning,\" that object is Amy herself. Trevor is Amy's most hopeful romantic prospect in months, but is there something unsettling in his smile?For years Amy has fought a smothering mother, a suburban sister whose marriage Amy struggles to respect, a late father who never forgave her for abandoning the cattle business in Texas, and the ghosts of doomed relationships. Now Amy wonders whether she has finally found true love in the form of Alain Bouchard, the suave and worldly French business mogul who will be her new boss. When he promises to make her a partner and whisk her away to his beloved Paris, it all seems picture perfect, until unsettling signs appear. Is Alain any different from Amy's alienated clients - connoisseurs who lose touch with the very things they pursue?",
        "Category": " Fiction , Literary",
        "Publisher": "Atlantic Monthly Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Black Water",
        "Authors": "By Parker, T. Jefferson",
        "Description": "A beautiful young woman is dead in the bathroom of her home. Her husband - a promising young cop named Archie Wildcraft - is shot in the head, but still alive. It looks like an attempted murder/suicide, but something tells Detective Merci Rayborn that there's more to the story.When the suspect vanishes from his hospital bed, he draws Merci into a manhunt that leaves the entire department questioning her abilities and her judgment. Is Archie's flight the act of a ruined mind, or a faithful heart? Is his account of the night his wife was murdered half-formed memory, or careful manipulation? Merci and Wildcraft head for a collision in a dizzying succession of cryptic clues, dangerous secrets, and painful truths.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "The Everything Mother Of The Bride Book: A Survival Guide for Mom!",
        "Authors": "By Hagen, Shelly",
        "Description": "",
        "Category": " Reference , Weddings",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "There's a Spiritual Solution to Every Problem",
        "Authors": "By Dyer, Wayne W.",
        "Description": "NATIONAL BESTSELLER FROM ACCLAIMED AUTHOR WAYNE DYERIn this inspiring book, bestselling author Wayne Dyer draws from various spiritual traditions to help us unplug from the material world and awaken to the divine with.With his trademark wit, wisdom, and humor, bestselling author Wayne Dyer offers compelling testimony on the power of love, harmony, and service. When confronted with a problem, be it ill health, financial worries, or relationship difficulties, we often depend on intellect to solve it. In this radical book, Dyer shows us that there is an omnipotent spiritual force at our fingertips that contains the solution to our problems. The first part of the book provides the essential foundation for spiritual problem solving, drawing from the wisdom of Patanjali, a Yogi mystic; the second half is organized around the prayer of Saint Francis of Assisi, whose legacy is one of love, harmony, and service. Each chapter contains specific practical applications for applying the teachings of these wise men to everyday problems, including affirmations, writing exercises, and guided meditations.Profound and thought provoking, yet filled with pragmatic advice, There's a Spiritual Solution to Every Problem is a book about self-awareness and tapping the healing energy within all of us. As Dyer writes, \"Thinking is the source of problems. Your heart holds the answer to solving them.",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Harper",
        "Price Starting With ($)": "14.59",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "The War on Christmas: How the Liberal Plot to Ban the Sacred Christian Holiday Is Worse Than You Thought",
        "Authors": "By Gibson, John C.",
        "Description": "The host of The Big Story argues that the secularization of Christmas violates the free expression of Christian traditions and contradicts the intentions of America's founders, in an account that cites state and corporate rulings against the practice of certain traditions and makes recommendations on how to support pro-Christmas initiatives. 50,000 first printing.",
        "Category": " Political Science , General",
        "Publisher": "Sentinel HC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Marcia Adams Christmas In The Heartland: Recipes, Decorations, and Traditions for Joyous Celebrations",
        "Authors": "By Adams, Marcia and Jensen, Jon (PHT)",
        "Description": "Celebrates the yuletide season with a collection of entertaining tips, recipes for holiday treats, crafts, decorating ideas, and information on the cultural significance of holiday customs and traditions. 75,000 first printing. $75,000 ad/promo. First serial, Good Housekeeping.",
        "Category": " Cooking , Reference",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The Seat of the Soul",
        "Authors": "By Zukav, Gary",
        "Description": "With the same extraordinary skill that he used to demystify scientific abstraction and the new physics, Gary Zukay, the award-winning author of The Dancing Wu Li Masters, here takes us on a brilliant and penetrating exploration of the new phase of evolution we have now entered.  With lucidity and elegance, Zukav explains that we are evolving from a species that pursues power based upon the perceptions of the five senses -- external power -- into a species that pursues authentic power -- power that is based upon the perceptions and values of the spirit. He shows how the pursuit of external power has produced our survival-of-the-fittest understanding of evolution, generated conflict between lovers, communities, and superpowers, and brought us to the edge of destruction.  Using his scientist's eye and philosopher's heart, Zukav shows how infusing the activities of life with reverence, compassion, and trust makes them come alive with meaning and purpose. He illustrates how the emerging values of the spirit are changing marriages into spiritual partnerships, psychology into spiritual psychology, and transforming our everyday lives. The Seat of the Soul describes the remarkable journey to the spirit that each of us is on.",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Fireside / Simon & Schuster",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Kiss the Boys Goodbye: How the United States Betrayed Its Own POWs in Vietnam",
        "Authors": "By Jensen-Stevenson, Monika and Stevenson, William",
        "Description": "Contends that the U.S. government suppressed information concerning American POWs in Vietnam",
        "Category": " History , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Family of God: A Handbook for Adult Disciples of Jesus Christ - Student Book",
        "Authors": "By Beyer, Douglas",
        "Description": "",
        "Category": " Religion , Christian Ministry , Discipleship",
        "Publisher": "Judson Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Ike the Soldier",
        "Authors": "By Miller, Merle",
        "Description": "Based on interviews with Dwight D. Eisenhower's closest associates, this biography follows Ike from his Kansas childhood to his station as Supreme Allied Commander during World War II",
        "Category": " Political Science , General",
        "Publisher": "G.P Putnam's Sons",
        "Price Starting With ($)": "7.12",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Gardner's Art through the ages",
        "Authors": "By Gardner, Helen",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt Brace Jovanovich",
        "Price Starting With ($)": "9.56",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The Deep End of the Ocean",
        "Authors": "By Mitchard, Jacquelyn",
        "Description": "The disappearance of her three-year-old son Ben threatens to drive a wedge between Beth Cappadora and her husband, Pat, and transforms her older son into a troubled delinquent, until one day nine years later when Ben comes back into their lives",
        "Category": " Fiction , General",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "DICTIONARY OF SEX - PAPER (Wordsworth Collection)",
        "Authors": "By Anderson, Kenneth N. and Goldenson, Robert M.",
        "Description": "",
        "Category": " Social Science , Reference",
        "Publisher": "Wordsworth Editions Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Rituals of the Season (Deborah Knott Mysteries)",
        "Authors": "By Maron, Margaret",
        "Description": "- \"High Country Fall, Margaret Maron's most recent installment in the Deborah Knott series, was published in Mysterious Press hardcover in 8/04, with a first printing of 40,000 copies.- Margaret Maron swept the top mystery awards with her first Deborah Knott hardcover, \"Bootlegger's Daughter (Mysterious Press, 1992), receiving the Edgar1 Award for Best Mystery Novel, the Agatha Award, the Macavity, and the Anthony. She also won a 1992 Agatha Award for the short story that introduced the character of Deborah Knott, and later, she received the Agatha Award for Best Novel for \"Up Jumps the Devil (Mysterious Press, 1996). Maron was nominated for an Agatha Award for \"Home Fires (Mysterious Press, 1998), and most recently, \"Storm Track (Mysterious Press, 2000) won the Agatha Award for Best Novel. \"Last Lessons of Summer (Mysterious Press, 2003), was also nominated for an Agatha Award.- \"Last Lessons of Summer, Slow Dollar, and Uncommon Clay were all selected as Mystery Guild Main Selections.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Mysterious Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Happy Days with the Naked Chef",
        "Authors": "By Oliver, Jamie and Loftus, David (PHT)",
        "Description": "Jamie Oliver believes in finding the best ingredients and making tasty, easy, social meals. Like his first two bestselling cookbooks, Happy Days with the Naked Chef is filled with fantastic salads, pastas, meat, fish, breads, and desserts for all occasions. In 'Comfort Grub' Jamie gives you his contemporary twists on old favorites, and in 'Quick Fixes' he whips up really delicious, easy dinners--just right for when you get home late from work. The 'Kids' Club' chapter is all about involving your kids in your cooking, like having them squash fresh tomatoes for pasta, pit olives, and knead and shape bread. For Jamie Oliver, food is all about Happy Days--good fun and great eating.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Failure of a Mission - By the British Ambasador to Berlin 1937-1939",
        "Authors": "By Henderson, Sir Nevile",
        "Description": "",
        "Category": "",
        "Publisher": "G.P. Putnam",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1940"
        }
    },
    {
        "Title": "The Don't Sweat Guide For Graduates: Facing New Challenges with Confidence (Don't Sweat Guides)",
        "Authors": "By Carlson, Richard (FRW) and Don't Sweat Press (EDT)",
        "Description": "This Dont Sweat guide offers simple tips for taking those next steps with confidence, and shows graduates of all ages how to focus on the important accomplishments that graduation represents.",
        "Category": " Self-help , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Six Plays by Henrik Ibsen",
        "Authors": "By Ibsen, Henrik",
        "Description": "",
        "Category": "",
        "Publisher": "Modern Library",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "The Decorating Book",
        "Authors": "By Gilliatt, Mary",
        "Description": "Clever solutions to specific interior-design problems and more than two hundred specific room schemes are supplemented by more than eleven hundred finish, flooring, and fabric samples",
        "Category": " House & Home , Decorating",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Cooking Light Cookbook, 1991",
        "Authors": "By Harvey, Ann H. (editor)",
        "Description": "Presents a nutrition and calorie conscious guide to preparing food that includes more than 400 recipes, tips to lighten existing recipes, and consumer updates",
        "Category": "",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "How to Get What You Want In Life With the Money You Already Have",
        "Authors": "By Keeffe, Carol",
        "Description": "A creative paycheck expert shares her philosophy for money management, demonstrating how to eliminate impulse buys, offering saving strategies, and furnishing tips on utilizing every paycheck for the things we really want. Original. 75,000 first printing. Tour.",
        "Category": " Business & Economics , Personal Finance , Money Management",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "White House Years",
        "Authors": "By Kissinger, Henry and Luce, Clare Boothe",
        "Description": "Covering his first four years as National Security Adviser, Kissinger discusses his part in formulating the Nixon Doctrine, discloses his views on the Vietnam War, and offers important insights into his relationship with Nixon",
        "Category": " Political Science , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "11.35",
        "Publish Date": {
            "Month": "October",
            "Year": "1979"
        }
    },
    {
        "Title": "Murderers and Other Friends: Another Part of Life",
        "Authors": "By Mortimer, John Clifford",
        "Description": "As a boy, John Mortimer wanted to be an actor, as a young man a writer, but at his father's suggestion he also pursued a career in law - in which, as a defending barrister, he found himself establishing profound but short-term friendships with those accused of various crimes, including murder. The chief lesson he learned from all this was to refrain from judgment, a quality he maintained in his other life.For alongside his work as a lawyer, Mortimer indulged a passion for writing. As this second career took over his life, it brought enriching yet frequently volatile friendships: with Tony Richardson, John Gielgud, Harold Pinter, David Niven, and Neil Kinnock, among others, from the worlds of theater, film, the law, and politics. John Mortimer brought his two worlds together in the character of Rumpole, for whom his creator is frequently mistaken.Murderers and Other Friends is John Mortimer's summing up of himself through his friends. With wit, wisdom, and tenderness he has written the story of the second part of his life, of the strangely assorted characters that enriched it, and of his family at its heart.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "U.S. Defense Planning: A Critique",
        "Authors": "By Collins, John M.",
        "Description": "",
        "Category": " Political Science , Political Freedom",
        "Publisher": "Westview Pr (Short Disc)",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1982"
        }
    },
    {
        "Title": "Bernard Shaw, Vol. 2: 1898-1918 - The Pursuit of Power",
        "Authors": "By Holroyd, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Angels in Disguise",
        "Authors": "By Dean, Lou",
        "Description": "The author describes the comfort and companionship she enjoyed with her dog while growing up in a troubled family.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Pubs Wholesale",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "October Heroes",
        "Authors": "By Honig, Donald",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "May",
            "Year": "1979"
        }
    },
    {
        "Title": "Generation at the Crossroads: Apathy and Action on the American Campus",
        "Authors": "By Loeb, Paul Rogat",
        "Description": "Challenging  prevailing media stereotypes, Generation at the Crossroads explores the  beliefs and choices of the students who came of age in the 1980s and  1990s. For seven years, at over a hundred campuses in thirty states,  Paul Loeb asked students about the values they held. He examines their  concepts of responsibility, the links they draw between present and  future, and how they view themselves in relation to the larger human  community in which they live.  He brings us a range of voices, from \"I'm  not that kind of person,\" to \"I had to take a stand.\"  Loeb looks at  how the rest of us can serve young people as better role models, and  give them courage and vision to help build a better world.This  insightful book explores the culture of withdrawal that dominated  American campuses through most of the eighties. He locates its roots in  historical ignorance, relentless individualism, mistrust of social  movements, and a general isolation from urgent realities. He examines  why a steadily increasing minority has begun to take on critical public  issues, whether environmental activism, apartheid, hunger and  homelessness, affordable education, or racial and sexual equity. Loeb  looks at individuals who have overcome precisely the barriers he has  described, and how their journeys can become models. The generational  choices he explores will shape our common future.",
        "Category": " History , Americas (North, Central, South, West Indies)",
        "Publisher": "Rutgers University Press",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "The Liberation of One 1st edition by Spasowski, Romuald (1986) Hardcover",
        "Authors": "By Spasowski, Romuald",
        "Description": "The dramatic story of the former ambassador from Poland to the United States, who defected weeks after martial law was imposed in Poland in 1981",
        "Category": "",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Database Nation: The Death of Privacy in the 21st Century",
        "Authors": "By Garfinkel, Simson",
        "Description": "As the 21st century dawns, advances in technology endanger our privacy in ways never before imagined. Direct marketers and retailers track our every purchase; surveillance cameras observe our movements; mobile phones will soon report our location to those who want to track us; government eavesdroppers listen in on private communications; misused medical records turn our bodies and our histories against us; and linked databases assemble detailed consumer profiles used to predict and influence our behavior. Privacy -- the most basic of our civil rights -- is in grave peril.Simson Garfinkel -- journalist, entrepreneur, and international authority on computer security -- has spent his career testing new technologies and warning about their implications. Database Nation is his compelling account of how invasive technologies will affect our lives in the coming years. It's a timely, far-reaching, entertaining, and thought-provoking look at the serious threats to privacy facing us today. The book poses a disturbing question: how can we protect our basic rights to privacy, identity, and autonomy when technology is making invasion and control easier than ever before?Garfinkel's captivating blend of journalism, storytelling, and futurism is a call to arms. It will frighten, entertain, and ultimately convince us that we must take action now to protect our privacy and identity before it's too late.Background:Fifty years ago, in1984, George Orwell imagined a future in which privacy was demolished by a totalitarian state that used spies, video surveillance, historical revisionism, and control over the media to maintain its power. Those who worry about personal privacy and identity--especially in this day of technologies that encroach upon these rights-- still use Orwell's \"Big Brother\" language to discuss privacy issues. But the reality is that the age of a monolithic Big Brother is over. And yet the threats are perhaps even more likely to destroy the rights we've assumed were ours.Today's threats to privacy are more widely distributed than they were in Orwell's state, and they represent both public and private interests. Over the next fifty years, we'll see new kinds of threats to privacy that don't find their roots in totalitarianism but in capitalism, the free market, advances in technology, and the unbridled exchange of electronic information.Today's Threats to PrivacyThe End of Due Process. Governments and businesses went on a computer-buying spree in the second half of the 20th century, replacing billions of paper files with electronic data-processing systems. But the new computers lacked some very important qualities of the manual systems that they replaced: flexibility, compassion, and understanding. Today, humans often are completely absent from digital decision-making. As a result, we've created a world in which the smallest clerical errors can have devastating effects on a person's life. It's a world where comput- ers are assumed to be correct, and people wrong.The Fallibility of Biometrics. Fingerprints, iris scans, and genetic sequences are widely regarded as infallible techniques for identifying human beings. They are so good, in fact, that fifty years from now identification cards and passports will probably not exist. Instead, a global data network will allow anyone on the planet to be instantly identified from the unique markings of their own body. Will it be impossible for people to conceal their identity from the federal government, and if so, is that a good thing? What about concealing your identity from the local drug store? And who controls the databank, anyway? Would they ever need to create \"false\" identities?The Systematic Capture of Everyday Events. We are entering a new world in which every purchase we make, every place we travel, every word we say, and everything we read is routinely recorded and made available for later analysis. But while the technology exists to capture th",
        "Category": " Technology & Engineering , Social Aspects",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "5.48",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Beginning Programming For Dummies?",
        "Authors": "By Wang, Wally",
        "Description": "Your introduction to QBASIC and beyondGet QBASIC basics plus pointers on C, C++, and JavaDiscover just how easy it is to write computer programs This friendly guide takes the mystery out of programming ? and opens the door to a world of possibilities. With loads of examples and a dash of humor, author Wallace Wang walks you through the fundamentals ? and shows you step by step how to write programs in QBASIC for any Windows or DOS computer.Discover how to: Master the basics of QBASIC Tackle everything from data structures to debugging Find compilers and other professional tools online Understand object-oriented programming Compare QBASIC with C, C++, and JavaThe Dummies Way? Explanations in plain English \"Get in, get out\" information Icons and other navigational aids Tear-out cheat sheet Top ten lists A dash of humor and funGet smart! www.dummies.com Register to win cool prizes Browse exclusive articles and excerpts Get a free Dummies Daily? e-mail newsletter Chat with authors and preview other books Talk to us, ask questions, get answers",
        "Category": " Computers , Programming Languages , General",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "South to Java: A Novel",
        "Authors": "By MacK, William P.",
        "Description": "",
        "Category": "",
        "Publisher": "Nautical & Aviation Pub Co of Amer",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Aberration of Starlight",
        "Authors": "By Sorrentino, Gilbert",
        "Description": "In a rural New Jersey boardinghouse, in 1939, ten-year-old Billy Recco, his divorced mother, her bitter, widowed father, and philanderer Tom Thebus are caught up in familial and sexual strife",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "13.17",
        "Publish Date": {
            "Month": "July",
            "Year": "1980"
        }
    },
    {
        "Title": "On Gide's PROMETHEE: Private Myth and Public Mystification (Princeton Essays in Literature)",
        "Authors": "By Weinberg, Kurt",
        "Description": "Through a careful rendering of the text, deciphering its hidden ironies, Mr. Weinberg sees Prométhée as a modern allegory, a parable wrought of allusions, symbols, and images drawn from classical antiquity and calvinist theology, and a multi-leveled sotie à miroirs.Originally published in 1972.The Princeton Legacy Library uses the latest print-on-demand technology to again make available previously out-of-print books from the distinguished backlist of Princeton University Press. These editions preserve the original texts of these important books while presenting them in durable paperback and hardcover editions. The goal of the Princeton Legacy Library is to vastly increase access to the rich scholarly heritage found in the thousands of books published by Princeton University Press since its founding in 1905.",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Princeton University Press",
        "Price Starting With ($)": "5.93",
        "Publish Date": {
            "Month": "July",
            "Year": "1972"
        }
    },
    {
        "Title": "Quick and Easy Recipes: Appetizers (Food Writers' Favorites) (Safe Party Planning Vol. 2)",
        "Authors": "By Reese Brothers",
        "Description": "",
        "Category": "",
        "Publisher": "Dial Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    }
]