[
    {
        "Title": "The Stress Management Handbook: Strategies for Health and Inner Peace",
        "Authors": "By Sinatra, Stephen T., M.D. and Leyden-Rubenstein, Lori A., Ph.D.",
        "Description": "An innovative guide provides an alternative approach to relieving the body of stress by focusing on the mind, body, and spirit, and includes such methods as breath work, yoga, meditation, visualization, imagery, and more. Original. IP.",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Keats Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Fruits in Cooking",
        "Authors": "By Robert Ackart",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan Company",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "God's Little Instruction Book for Students (God's Little Instruction Books)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Rivals (7th Heaven(TM))",
        "Authors": "By Christie, Amanda and Hampton, Brenda",
        "Description": "Lucy and Mary Camden, the two older sisters in the family, find it difficult to be close friends as their pursuits are so very different, yet when they finally find something in common, their mutual interests in boys, the results aren't what they had expected as a certain boy causes additional difficulties between them. Original.",
        "Category": " Juvenile Fiction , Sports & Recreation , Basketball",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Ordnance Survey Guide to Gardens of Britain",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Country Life Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "The Wall Street Journal Guide to the End of Wall Street as We Know It: What You Need to Know About the Greatest Financial Crisis of Our Time-and How to Survive It",
        "Authors": "By Kansas, Dave",
        "Description": "The definitive guide for Main Street readers who want to make sense of what′s happening on Wall Street, and better understand how we got here and what we need to know to in days to come. Written by seasoned financial writer Dave Kansas, this official Wall Street Journal guide will be filled with practical information, revealing what the crisis means for reader′s financial lives, and what steps they should be taking now to inform and protect themselves.",
        "Category": " Business & Economics , Personal Finance , Investing",
        "Publisher": "HarperBusiness",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "The Notorious Jumping Frog of Calaveras County and Other Stories",
        "Authors": "By Twain, Mark",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Things My Girlfriend and I Have Argued About: A Novel",
        "Authors": "By Millington, Mil",
        "Description": "Things My Girlfriend and I Have Argued About concerns a guy named Pel who lives with his German girlfriend, Ursula. Pel leads an uneventful life—quietly bluffing his way through his job and discovering new things to argue about with Ursula. But when his boss mysteriously disappears, Pel steps innocently into his shoes and his life spirals out of control in a chaotic whirl of stolen money, missing colleagues, and Chinese mafiosi.Its fractured thriller plot punctuated by blazingly hilarious set-piece arguments between the hapless Pel and the unflappable Ursula, Things My Girlfriend and I Have Argued About is a brilliant comic novel examining the unique warfare in long-term relationships.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "If Cats Could Talk (The Meaning of Meow)",
        "Authors": "By Fertig, Michael P.",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "I Live in Israel: A Text and Activity Book",
        "Authors": "By Frankel, Max and Hoffman, Judy",
        "Description": "Descibes kibbutzim abd cities of Israel today, Jerusalem in the year 964 B.C.E., and what Jerusalem might be like in the year 2000. Includes related activities.",
        "Category": " Juvenile Nonfiction , People & Places , Middle East",
        "Publisher": "Behrman House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "Reading Right from the Start: What Parents Can Do in the First Five Years",
        "Authors": "By Dodge, Diane Trister, Bickart, Toni S., and Springer, Sally (PHT)",
        "Description": "",
        "Category": " Education , Teaching Methods & Materials , Reading & Phonics",
        "Publisher": "Teaching Strategies",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Quick Country Quilting: Over 80 Projects Featuring Easy Timesaving Techniques",
        "Authors": "By Mumm, Debbie",
        "Description": "Outlines methods for quick cutting, piecing, and applique, and includes directions for such projects as wall quilts, holiday decorations, pillows, baby accessories, and sweatshirts",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Rodale Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "Soldiers Blue & Gray",
        "Authors": "By Robertson, James I",
        "Description": "Uses letters and reminiscences by Union and Confederate soldiers to depict what it was like to fight in the Civil War",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "The Oxford Companion to American Military History",
        "Authors": "By Chambers, John Whiteclay, II (EDT), Anderson, Fred (EDT), Eden, Lynn (EDT), Glatthaar, Joseph T. (EDT), Spector, Ronald H. (EDT), and Piehler, G. Kurt (EDT)",
        "Description": "With more than 1,100 entries written by some 500 distinguished contributors, The Oxford Companion to American Military History is \"the most comprehensive treatment of American military history ever compiled\" (Parameters: U.S. Army War College Quarterly) and an \"easy-to-browse, well-organized work\" (The Washington Post).Here is a gold mine of information on American military history, exploring battles and soldiers, ships and weapons, services and doctrines--as well as the social and cultural impact of the U.S. military at home and around the world.     The Oxford Companion to American Military History boasts over 1,100 entries written by some 500 distinguished contributors. Readers will find Stephen E. Ambrose writing on the D-Day landing, James M. McPherson on the battle of Antietam, John Keegan on the changing experience of combat, Jean Bethke Elshtain on Jane Addams, Mark A. Noll on religion and war, and Robert M. Utley on Sitting Bull. Ranging from brief factual pieces to extensive essays, the entries examine every major war from the Revolution to the Persian Gulf; important battles from Bunker Hill, to the Alamo, Gettysburg, Little Bighorn, Normandy, and Khe Sanh; and military leaders from Washington to Grant, Lee, Eisenhower, MacArthur, Westmoreland, and Schwarzkopf. Moreover, the Companion goes well beyond the usual \"drum and trumpet\" coverage to examine a wide range of subjects you might not expect to find. There are entries on relevant acts of Congress and on diplomatic policies such as the Monroe Doctrine and the Marshall Plan;  on peace and antiwar movements; on war in film, literature, music, and photography; and on war viewed through the disciplinary lenses of anthropology, economics, gender studies, and psychology. The result is the widest ranging account compiled in one volume of war, peace, and the U.S. military.    With over a thousand authoritative and vividly written entries, maps of several major wars, extensive cross-referencing, lists of further readings, and an index, this volume is the first place to turn for information on our nation's military history.",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Guidebook to Virginia's Historical Markers",
        "Authors": "By Peters",
        "Description": "",
        "Category": "",
        "Publisher": "University Press of Virginia",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Captive Bride",
        "Authors": "By Lindsey, Johanna",
        "Description": "The irresistible call of adventure brings lovely Christina Wakefield to the alluring Arabian desert. But fate imprisons her after she encounters Sheik Abu, the strikingly handsome though arrogant adventurer, whom she had known in England as Philip Caxton.Once Christina had rejected Philip's fervent offer of marriage. But now she is to be his slave -- desperate for the freedoms denied her...yet weakened by her heart's blazing desire to willingly explore her virile captor's most sensuous cravings.",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Misty's Twilight",
        "Authors": "By Henry, Marguerite and Grandpre, Karen Haus (ILT)",
        "Description": "Misty's Twilight is part thoroughbred, part Chincoteague pony, and one hundred percent fire and talent. A direct descendant of the most famous pony ever, Misty of Chincoteague, Twilight has greatness in her blood. Now it's her turn to shine, perhaps as a cutting horse, a jumper, or in the graceful art of dressage.  Can Twilight, whose ancestors were wild ponies living on an untamed island, do it? Can she compete against the best horses in the world... and win?",
        "Category": " Juvenile Fiction , Sports & Recreation , Equestrian",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Tale of Two Sumos",
        "Authors": "By Poth, Karen and Bancroft, Tom (ILT)",
        "Description": "VeggieTales presents Tale of Two Sumos, starring Larry the Cucumber as the Italian Scallion.This cucumber-turned-scallion faces the challenge of his life---a match against the meanest and toughest belly-bumping contender of all time---Apollo Gourd.This entertaining lesson in perseverance will push the Italian Scallion on a path of amazing discovery. Can he endure the intense physical training needed to get in the ring? Can he come through with a promise he made to his friend? Can he overcome Apollo Gourd's dreadful belly bump? For the first time in his life, can the Italian Scallion finish what he starts?Find out in this hilarious adventure that will teach kids that God wants us to finish what we start, even when it's hard to do!Sunday morning values, Saturday morning fun. Now that's the Big Idea!Through imaginative and innovative products, Zonderkidz is feeding young souls.",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "ZonderKidz",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Return to Laughter: An Anthropological Novel (The Natural History Library)",
        "Authors": "By Bowen, Elenore Smith",
        "Description": "Elenore Bowen experiences witchcraft and the fear of a smallpox epidemic during a year spent among a primitive bush tribe of West Africa",
        "Category": " Fiction , Cultural Heritage",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1964"
        }
    },
    {
        "Title": "The New Combined Bible Dictionary and Concordance ",
        "Authors": "By Baker Book House, New Combined Bible Dictionary & Concorda, Baker Publishing Group",
        "Description": "More than 10,000 entries define names, places, objects, and concepts of the Bible with thorough references. Charles Pfeiffer introduces the volume with an essay on \"How to Study the Bible.\"",
        "Category": " Religion , Biblical Reference , General",
        "Publisher": "Baker Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1973"
        }
    },
    {
        "Title": "100 Cupboards (100 Cupboards, Bk 1)",
        "Authors": "By Wilson, N. D.",
        "Description": "Readers who love Percy Jackson, the Unwanteds, and Beyonders will discover that 100 cupboards mean 100 opportunities for adventure! The bestselling and highly acclaimed 100 Cupboards series starts here.   What dangers are locked behind the cupboard doors? Henry isn’t brave, but when he hears a thumping and scratching on the other side of his bedroom wall, he can’t ignore it. He scrapes off the plaster and discovers mysterious doors—cupboards of all different shapes and sizes. Through one he sees a glowing room and a man strolling back and forth. Through another he sees only darkness and feels the cold sense that something isn’t right. When his cousin Henrietta boldly travels into the worlds beyond the cupboards, it’s up to Henry to follow her. Now that he’s opened the doors, can he keep the evil inside from coming through?   “A must-read series.” —The Washington Post",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "The Sight (Warriors: Power of Three, Book 1)",
        "Authors": "By Hunter, Erin",
        "Description": "The time has come for three kits of ThunderClan—Hollypaw, Jaypaw, and Lionpaw—to become apprentices. Grandchildren of the great leader Firestar, all three possess unusual power and talent. But dark secrets surround them, and a mysterious prophecy hints at trouble to come. The warrior code is in danger of being washed away by a river of blood, and all the young cats' strength will be needed if the Clans are to survive.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Now I Can Die in Peace: How ESPN's Sports Guy Found Salvation, with a Little Help from Nomar, Pedro, Shawshank and the 2004",
        "Authors": "By Simmons, Bill",
        "Description": "The author of ESPN's \"Sports Guy\" column describes the long years leading up to the Boston Red Sox World Series win in 2004, reexamining the events and personalities of the historic season and reflecting on what it means to the ultimate Boston Red Sox fan.  50,000 first printing.",
        "Category": " Sports & Recreation , Baseball , Essays & Writings",
        "Publisher": "ESPN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Shakespeare's Secret",
        "Authors": "By Broach, Elise",
        "Description": "Named after a character in a Shakespeare play, misfit sixth-grader Hero becomes interested in exploring this unusual connection because of a valuable diamond supposedly hidden in her new house, an intriguing neighbor, and the unexpected attention of the most popular boy in school.Named after a character in a Shakespeare play, misfit sixth-grader Hero becomes interested in exploring this unusual connection because of a valuable diamond supposedly hidden in her new house, an intriguing neighbor, and the unexpected attention of the most popular boy in school.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Square Fish",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Thanksgiving Ideals 1994",
        "Authors": "By Ideals Publications Inc",
        "Description": "",
        "Category": "",
        "Publisher": "Ideals Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Comfort Foods: Rachael Ray 30-Minute Meals",
        "Authors": "By Ray, Rachael",
        "Description": "This collection of greatest hits featuring popular comfort foods includes a buttery Chicken Fricassee, zesty Pepper Steak, and Stovetop Macaroni and Cheese.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "Lake Isle Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Taoist Meditation: Methods for Cultivating a Healthy Mind and Body",
        "Authors": "By Cleary, Thomas F., Cleary, Thomas F. (TRN), and Cleary, Thomas F. (COM)",
        "Description": "The ancient meditation techniques of Taoism encompass a wide range of practices—with an aim toward cultivating a healthy body as well as an enlightened mind. These selections from classic texts of Taoist meditation represent the entire range of techniques—from sitting meditation practices to internal alchemy. Most of the texts appear here in English for the first time.  Selections are taken from the following classics:     •  Anthology on Cultivation of Realization:  A document from 1739 (Ming Dynasty) that emphasizes development of the natural, social, and spiritual elements in human life.    •  Treatise on Sitting Forgetting:  A Tang Dynasty text that sets meditation practice in terms familiar to Confucians and Buddhists.    •  Sayings of Taoist Master Danyang:  Wisdom of the Taoist wizard and representative of the Complete Reality School.    •  Secret Writings on the Mechanism of Nature:  An anthology taken from one hundred sixty-three Taoist sources, including ancient classics and works on meditation and spiritual alchemy, along with admonitions and teachings of the great Taoist luminaries.     •  Zhang Sanfeng's Taiji Alchemy Secrets:  A treatise on the inner mediation practices that are the proper foundation of the martial art Taiji.    •  Secret Records of Understanding the Way:  A rare and remarkable collection of talks by an anonymous Taoist master of the later Qing dynasty (1644&#150;1911). Traditional teachings with a sometimes strikingly modern bent.",
        "Category": " Philosophy , Eastern",
        "Publisher": "Shambhala",
        "Price Starting With ($)": "9.34",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Strapped: Why America's 20- and 30-Somethings Can't Get Ahead",
        "Authors": "By Draut, Tamara",
        "Description": "Drowning in student loans? Can’t afford to get married, buy a home, have children? Up to your ears in credit card debt? At last, a book for the under-35 generation that explains why it’s not their fault, and what can be done about it.Strapped offers a groundbreaking look at the new obstacle course facing young adults. Getting ahead, argues commentator and policy maven Tamara Draut, is getting harder. A college degree is the new high school diploma–and costs a fortune to obtain. Good jobs are scarcer thanks to stagnant wages and disappearing benefits. And, the cost of everything–starter homes, health coverage, child care–keeps going up. Witty and wise,Strapped brims with ideas for fashioning a new kind of America in which every young person can go to college, buy a home, and start a family. The future starts here.",
        "Category": " Business & Economics , Economic Conditions",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "A Taste of the Country",
        "Authors": "By Schnittka, Julie (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Reiman Assoc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "It's A Magical World: A Calvin and Hobbes Collection (Volume 16)",
        "Authors": "By Watterson, Bill",
        "Description": "When cartoonist Bill Watterson announced that his phenomenally popular cartoon strip would be discontinued, Calvin and Hobbes fans throughout the world went into mourning. Fans have learned to survive -- despite the absence of the boy and his tiger in the daily newspaper. It's a Magical World delivers all the satisfaction of visiting its characters once more. Calvin fans will be able to see their favorite mischief maker stir it up with his furry friend, long-suffering parents, classmate Susie Derkins, school teacher Miss Wormwood, and Rosalyn the baby-sitter. It's a Magical World includes full-color Sundays and has it all: Calvin-turned-firefly waking Hobbes with his flashlight glow; courageous Spaceman Spiff rocketing through alien galaxies as he battles Dad-turned-Bug-Being; and Calvin's always inspired snowman art. There's no better way for Watterson fans to savor again the special qualities of their favorite strip.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Alchemyst: The Secrets of the Immortal Nicholas Flamel",
        "Authors": "By Scott, Michael",
        "Description": "Nicholas Flamel appeared in J.K. Rowling’s Harry Potter—but did you know he really lived? And his secrets aren't safe! Discover the truth in book one of the New York Times bestselling series the Secrets of the Immortal Nicholas Flamel.    The truth: Nicholas Flamel's tomb is empty.    The legend: Nicholas Flamel lives.   Nicholas Flamel is the greatest Alchemyst to ever live. The records show that he died in 1418, but what if he's actually been making the elixir of life for centuries?    The secrets to eternal life are hidden within the book he protects—the Book of Abraham the Mage. It's the most powerful book that has ever existed, and in the wrong hands, it will destroy the world. And that's exactly what Dr. John Dee plans to do when he steals it.     There is one hope. If the prophecy is true, Sophie and Josh Newman have the power to save everyone. Now they just have to learn to use it.   “The Secrets of the Immortal Nicholas Flamel has everything you loved about Harry Potter, including magic, mystery, and a constant battle of good versus evil.”—Bustle Read the whole series!The AlchemystThe MagicianThe SorceressThe NecromancerThe Warlock The Enchantress",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Ember",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "The Girl's Guide to Being a Boss (Without Being a Bitch): Valuable Lessons, Smart Suggestions, and True Stories for Succeeding as the Chick-in-Charge",
        "Authors": "By Friedman, Caitlin and Yorio, Kimberly",
        "Description": "Forget what you’ve heard. Nice girls can get the corner office.As women, we haven’t always had the best role models at work.  We’ve either worked for men or we’ve had female bosses who are, well, big bitches. Woman still don’t have much of a road map right now when it comes to taking charge at the office, so the team who brought you the national bestseller The Girl’s Guide to Starting Your Own Business is drawing one for us. Caitlin Friedman and Kimberly Yorio will teach you to be powerful without being possessive, to be opinionated without being brassy, and to have a strong voice without micromanaging. You’ll learn just how to own the role of queen bee in a positive way so that you can be more mentor than manager, one who leads, inspires, and motivates. So, you finally got that promotion. You’re the boss now. The supervisor. The manager. The captain. The taskmaster. Those days of taking orders, running errands, and clock-watching are over. As exciting as all this might seem, once the rush of the promotion is over, you might be scratching your head wondering exactly what to do. Being the boss is never easy, but it's twice as hard for a woman. It seems like there's no middle ground. Either you're the dragon lady who rules with an iron fist or the mousey girl who gets drowned out at every meeting. When a woman wields authority and dares to make tough decisions, how often is the \"B-word\" bandied about by her employees? How can she strike that balance between pushover and dictator?  Fear not. You can do the job. All you need is a little helpful advice to send you on your way.  Whether you supervise two as a shift manager or lord over an entire corporate empire, Caitlin Friedman and Kim Yorio will show you how to step gracefully into your new position of power. They’ll teach you how to motivate your team without alienating them, how to delegate without feeling guilty, how to deal with office politics and how to handle evaluations, promotions, and even firings. And for those of you who are already running the show, they can help you become the mentor your employees deserve. Inside, there are self-assessment questionnaires to help you find out where you land on the bitch or wimp scale; interviews with prominent female bosses, human-resources directors, and therapists; and advice from a whole host of experts. In addition, there are funny and informative checklists and tips to make sure you’re the Good Witch around the office and not the Big Bitch. And, most important, Caitlin and Kim will teach you the secrets to owning your role and loving it. You’ve earned your promotion, so enjoy it!",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Currency",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The Green Lifestyle Handbook: 1001 Ways to Heal the Earth",
        "Authors": "By Rifkin, Jeremy",
        "Description": "Rifkin (Foundation on Economic Trends and the frequent environmental suitor) and contributors enumerate the actions individuals can take to slow the corruption of our world including whom we can sue. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Political Science , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Guide to the SAT & PSAT",
        "Authors": "By SparkNotes (EDT)",
        "Description": "The SparkNotes Guide to the SAT & PSAT will give students everything they need to meet and beat the overhauled SAT. The book will contain a thorough breakdown of all three test sections, complete with strategic test-taking approaches to every question type on the test.",
        "Category": " Study Aids , SAT",
        "Publisher": "SparkNotes",
        "Price Starting With ($)": "5.18",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Old Friends and New Fancies: An Imaginary Sequel to the Novels of Jane Austen",
        "Authors": "By Brinton, Sybil G.",
        "Description": "The first Jane Austen sequel ever written!Originally published in 1914, this charming and original sequel to the novels of Jane Austen intertwines the lives of the most beloved characters from all six Austen novels with new characters of the author's devising. Inventive matchmaking leads numerous pairs of lovers through the inevitable (and entertaining) difficulties they must encounter before they are united in the end.Old Friends and New Fancies is a gratifying read for any Jane Austen enthusiast.\"This is the ultimate Jane Austen sequel....Virtually all the characters left standing at the end of the novels-most particularly the unmarried ones-must all meet up... Broken engagements will follow, a few false trails and threatened unacceptable matches must be endured before the Forces of Good prevail.\" —Charles Wenz, Life Member of the Jane Austen Society",
        "Category": " Fiction , Literary",
        "Publisher": "Sourcebooks Landmark",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Isabel: Taking Wing (Girls of Many Lands - England)",
        "Authors": "By Elliott, Mark (ILT) and Dalton, Annie",
        "Description": "In 1592, twelve-year-old Isabel dreams of adventure and finds it, not only on her journey from her London home to her aunt's manor house in Northamptonshire, but also through the healing arts her aunt teaches her. Simultaneous.",
        "Category": " Juvenile Fiction , Historical , Europe",
        "Publisher": "Amer Girl Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Complete Book of the Horse",
        "Authors": "By Roberts, Peter (EDT)",
        "Description": "Covers many aspects of the horse including care and grooming, horse breeding and training, and the great winners in Olympic and racing history",
        "Category": " Technology & Engineering , General",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "The Man's Manual: Poker Secrets, Beer Lore, Waitress Hypnosis, and Much, Much More",
        "Authors": "By Stebbin, Gregg and Boyles, Denis (INT)",
        "Description": "Every man needs to know how to flirt with a waitress, right? And how to make sure beer is part of every meal, not just breakfast? And how to work out to actually get a workout? Now all this information, and less \"manly\" but no less essential tips, can be found in one place. The only book a man needs to lead a well-rounded life, The Man's Manual provides instruction on \"inspirational sex,\" urban tenting, what to do to with your thumb after you whack it with a hammer, and much, much more. Here are succinct, step-by-step directions for impersonating a smart person, and landing an airplane safely. Learn to tie a bowtie, fight cancer (consume green tea and tomatoes, but not necessarily at the same time), and organize a poker game. Determine how exactly to become a sex object, how to talk lingerie, and how to make love like a pro. There is material on baking brownies, cooking geese, and even hunting down your own venison. The sheer amount of information contained in this friendly, accessible book will enchant even the most discriminating reader.",
        "Category": " Humor , Topic , Men, Women & Relationships",
        "Publisher": "Skyhorse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Monday Morning Faith",
        "Authors": "By Copeland, Lori",
        "Description": "Dear Mom and Pop, Two days ago we all spent the afternoon in palm trees. One of the village dogs broke his leash and treed the whole community. The dog is mean, but I have managed to form a cautious relationship with him by feeding him scraps from our table, and jelly beans ... I hope candy doesn't hurt a dog; it hasn't hurt this dog, I can assure you. I know you're wondering about Sam ... I love him with all my heart, but sometimes love isn't enough. Love always, Johanna Librarian Johanna Holland likes her simple life in Saginaw, Michigan. So why is she standing in the middle of the New Guinea Jungle? Johanna is simply aghast at the lack of hot showers and ... well ... clothing! She is positive the mission field is most certainly not God's plan for her life, but will that mean letting go of the man she loves? Warm and whimsical, Monday Morning Faith will take you on a spiritual journey filled with depth and humor.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Finder's Fee",
        "Authors": "By Gansky, Alton",
        "Description": "'I know your secret if you defy me, then the world will know.' A terrifying phone call sweeps rich and powerful businesswoman Judith Find into a desperate search for a kidnapped boy. If she involves the authorities, the child will die ... and Judith's darkest secret to the world. Judith is teamed with a mysterious stranger with a carefully guarded secret of his own. But is Luke Becker an unwilling ally or an agent of the kidnapper? As Judith and Luke's mutual distrust wars against a growing attraction, the life of a small boy hangs in the balance. A boy unlike any other Judith has ever met. Eight-year-old Abel Palek will help Judith discover a faith and a life she has never imagined. But freeing him could cost her everything. Her career. Her reputation. And very possibly her life.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Obsessed - Tp",
        "Authors": "By Dekker, Ted",
        "Description": "Stephen Friedman is making a good living in good times. He's just an ordinary guy. Or so he thinks.But one day an extraordinary piece of information tells him differently. It's a clue from the grave of a Holocaust survivor. A clue that makes him heir to an incredible fortune . . . a clue that only he and one other man can possibly understand.That man is Roth Braun, a serial killer who has been waiting for Stephen for thirty years. Roth was stopped once before. This time nothing will get in his way.Known worldwide for page-turning, adrenaline-laced thrillers, Dekker raises the stakes in this story of passion, revenge, and an all-consuming obsession for the ultimate treasure.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2010"
        }
    },
    {
        "Title": "Alvin Journeyman (Tales of Alvin Maker, Book 4)",
        "Authors": "By Card, Orson Scott",
        "Description": "Alvin is a Maker, the first to be born in a century.Now a grown man and a journeyman smith, Alvin has returned to his family in the town of Vigor Church. He will share in their isolation, work as a blacksmith, and try to teach anyone who wishes to learn the knack of being a Maker. For Alvin has had a vision of the Crystal City he will build, and he knows that he cannot build it alone.But he has left behind in Hatrack River enemies as well as true friends. His ancient foe, the Unmaker, whose cruel whispers and deadly plots have threatened Alvin's life at every turn, has found new hands to do his work of destruction.The Tales of Alvin Maker seriesSeventh SonRed ProphetPrentice AlvinAlvin JourneymanHeartfireThe Crystal City",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Tor Fantasy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Double Minds",
        "Authors": "By Blackstock, Terri",
        "Description": "The young girl with the Bohemian style was on the floor where she’d fallen, between Parker's computer case and her file cabinet. She wore a long, flowing skirt—lavender, the color of calm—and camel-colored Uggs. She lay on her back, her long, wavy blonde hair matted with blood. For struggling singer/songwriter Parker James, the music business has just turned deadly. Her desk in the reception area of a busy recording studio has become a crime scene, and Parker finds herself drawn into a mystery where nothing is as it seems. Unraveling the truth puts her own life at risk when she uncovers high-level industry corruption and is terrorized by a menacing stalker. As the danger escalates, Parker begins to question her dreams, her future, and even her faith. Double Minds is a double treat—combining a compelling suspense novel with an inside look at the world of the Christian music industry in Nashville. Terri Blackstock grabs readers at page one and keeps them riveted until the final plot twist is untangled.",
        "Category": " Fiction , Christian , Suspense",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "The Columbia Encyclopedia, 5th Edition",
        "Authors": "By Chernow, Barbara Ann (EDT), Vallasi, George A. (EDT), and Columbia University (COR)",
        "Description": "The Fifth Edition continues this tradition of excellence, bringing up-to-date coverage of the whole world in all its physical, historical, geographical, political, scientific, religious, and cultural dimensions between two covers. The Fifth Edition offers more information in one volume than most multivolume encyclopedias: 50,000 articles, 65,000 cross-references, and 6.6 million words in 3,000 pages.",
        "Category": "",
        "Publisher": "Columbia Univ Pr",
        "Price Starting With ($)": "14.84",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Shaped Cookbooks Slow Cooker",
        "Authors": "By",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Peril at King's Creek: A Felicity Mystery (American Girl Mysteries)",
        "Authors": "By Jones, Elizabeth McDavid",
        "Description": "In 1776, eleven-year-old Felicity suspects that an amateur naturalist visiting her family's Virginia plantation may actually be a British spy mapping Patriot plantations in advance of British raids. Includes historical information about the Revolutionary War.In 1776, eleven-year-old Felicity suspects that an amateur naturalist visiting her family's Virginia plantation may actually be a British spy mapping Patriot plantations in advance of British raids.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "American Girl",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Cutting Loose (NYT Bestselling Author)",
        "Authors": "By Andersen, Susan",
        "Description": "From New York Times bestselling author Susan Andersen, a classic tale of a good girl, a bad boy  and the chemistry they can&#39;t resist&#133;Jane thinks nothing can make her lose her cool. But the princess of propriety blows a gasket the night she meets the contractor restoring the Wolcott mansion. Devlin Kavanagh&#39;s rugged sex appeal may buckle her knees, but the man is out of control!  Jane had to deal with theatrics growing up&#151;she won&#39;t tolerate them in someone hired to work on the house she and her two best friends have inherited.Dev could renovate the mansion in his sleep. But ever since the prissy owner spotted him jet-lagged and hit hard by a couple of welcome-home drinks, she&#39;s been on his case. Yet there&#39;s  something about her. Jane hides behind conservative clothes and a frosty manner, but her seductive blue eyes and leopard-print heels hint at a woman just dying to cut loose!",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Essentials of World History (Barron's Essentials ; The Efficient Study Guides)",
        "Authors": "By Smith, Lacey Baldwin and Smith, Jean Reeder",
        "Description": "This comprehensive global outline reviews world events from prehistory and the dawn of civilization to the 1990s. The text surveys the world region by region, and covers non-Western civilizations as well as Europe and America. The authors summarize major developments in politics, society, science, technology, and the arts.",
        "Category": " History , World",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1980"
        }
    },
    {
        "Title": "Algebra the Easy Way (Barron's E-Z)",
        "Authors": "By Downing, Douglas",
        "Description": "A manual on the fundamentals of algebra includes explanations of equations, negative numbers, exponents, roots, functions, graphs, and logarithms",
        "Category": " Mathematics , Algebra , General",
        "Publisher": "Barron's Educational Series",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Small gas engines",
        "Authors": "By Gray, James A.",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The Romanov Prophecy: A Novel",
        "Authors": "By Berry, Steve",
        "Description": "Ekaterinburg, Russia: July 16, 1918. Ten months have passed since Nicholas II’s reign was cut short by revolutionaries. Tonight, the White Army advances on the town where the Tsar and his family are being held captive by the Bolsheviks. Nicholas dares to hope for salvation. Instead, the Romanovs are coldly and methodically executed.Moscow: Present Day. Atlanta lawyer Miles Lord, fluent in Russian and well versed in the country’s history, is thrilled to be in Moscow on the eve of such a momentous event. After the fall of Communism and a succession of weak governments, the Russian people have voted to bring back the monarchy. The new tsar will be chosen from the distant relatives of Nicholas II by a specially appointed commission, and Miles’ job is to perform a background check on the Tsarist candidate favored by a powerful group of Western businessmen. But research quickly becomes the least of Miles’ concerns when he is nearly killed by gunmen on a city plaza.Suddenly Miles is racing across continents, shadowed by nefarious henchmen. At first, his only question is why people are pursuing him. But after a strange conversation with a mysterious Russian, who steers Miles toward the writings of Rasputin, he becomes desperate to know more–most important, what really happened to the family of Russia’s last tsar?His only companion is Akilina Petrov, a Russian circus performer sympathetic to his struggle, and his only guide is a cryptic message from Rasputin that implies that the bloody night of so long ago is not the last chapter in the Romanovs’ story . . . and that someone might even have survived the massacre. The prophecy’s implications are earth-shattering–not only for the future of the tsar and mother Russia, but also for Miles himself.Steve Berry, national bestselling author of the phenomenal thriller The Amber Room, once again delves into rich historical fact to produce an explosive page-turner. In The Romanov Prophecy, the authentic and the speculative meld into a fascinating and exceptionally suspenseful work of fiction.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "America's Best Quilting Projects: Star Quilts (A Rodale quilt book)",
        "Authors": "By Soltys, Karen Costello (EDT)",
        "Description": "",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Pride and Prejudice and Zombies",
        "Authors": "By Austen, Jane and Grahame-Smith, Seth",
        "Description": "The New York Times best seller is now a major motion picture starring Lily James and Sam Riley, with Matt Smith, Charles Dance, and Lena Headey. Complete with romance, heartbreak, swordfights, cannibalism, and thousands of rotting corpses, Pride and Prejudice and Zombies is an audacious retelling of English literature’s most enduring novel. This expanded edition of the beloved Jane Austen novel featuring all-new scenes of bone-crunching zombie mayhem begins when a mysterious plague falls upon the quiet English village of Meryton—and the dead are returning to life! Feisty heroine Elizabeth Bennet is determined to wipe out the zombie menace, but she’s soon distracted by the arrival of the haughty and arrogant Mr. Darcy. What ensues is a delightful comedy of manners with plenty of civilized sparring between the two young lovers—and even more violent sparring on the blood-soaked battlefield. It’s the perfect read for literature lovers, zombie fans, and anyone who loves a reanimated Austen.",
        "Category": " Fiction , Mashups",
        "Publisher": "Quirk Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Lo Salt Lo Chole Ckbk",
        "Authors": "By Waldo, Myra",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1976"
        }
    },
    {
        "Title": "Assessment for Reading Instruction (Solving Problems in the Teaching of Literacy)",
        "Authors": "By McKenna, Michael C. and Stahl, Steven A.",
        "Description": "Combining essential background knowledge with hands-on tools, this practical resource and text provides a detailed roadmap for conducting multidimensional reading assessment. The authors' research expertise and extensive classroom experience are reflected on every page. Presented are effective ways to evaluate K-6 students'  spelling, word recognition, fluency, comprehension, strategic knowledge, and more. Aided by lively case examples, preservice and inservice teachers and reading specialists learn to tailor assessment to the needs of each child and use results strategically to inform instruction. The concluding chapter offers useful information on preparing a reading clinic report. Special features of this accessible 8 1/2\" x 11\" volume include numerous figures, tables, and sample assessment instruments, many with permission to photocopy.",
        "Category": " Language Arts & Disciplines , Literacy",
        "Publisher": "The Guilford Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Life 101: An Illustrated Guide",
        "Authors": "By Pq Blackwell, Ltd. and Day-lewis, Geoffrey",
        "Description": "Life 101 is an edgy, illustrated alternative to Life's Little Instruction Book-aimed at a new generation of human betterment.More Info About Life 101: An Illustrated GuideApproximately 150 million people will set New Year's resolutions this year, and approximately 4.6 million people will graduate from high school or college. For this self-actualized population of 154.6 million-and countless individuals like them-Geoffrey Day-Lewis offers the perfect primer on life and living. Unique and distinctively witty photographs accompany practical tips on wisdom, advice, and etiquette and offer a humorously uncomplicated approach to living life at your best. Consider these basic bits of wisdom:* Embrace technology. * Be gentle with the earth. * Be a good listener. *Sometimes it takes just one good idea. * Take time for yourself.",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Daytrips in Israel: 25 One Day Adventures by Bus or Car (Daytrips Israel)",
        "Authors": "By Steinbicker, Earl",
        "Description": "",
        "Category": "",
        "Publisher": "Hastings House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Spring Pearl: The Last Flower (Girls of Many Lands-CHINA)",
        "Authors": "By Yep, Laurence and Sano, Kazuhiko (ILT)",
        "Description": "As China's Second Opium War against the British and French rages on in Canton, orphaned Chou Spring Pearl is sent to live with the family of wealthy Master Sung, but when Master Sung is arrested for protesting the government's heavy taxes, it is the learned Spring Pearl that may be his only hope for freedom. Simultaneous.",
        "Category": " Juvenile Fiction , Historical , Asia",
        "Publisher": "Pleasant Company Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "All About Attention Deficit Disorder",
        "Authors": "By Phelan, Thomas W.",
        "Description": "",
        "Category": " Health & Fitness , Physical Impairments",
        "Publisher": "Child Management Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Easy Gourmet Style Cooking With 5 Ingredients",
        "Authors": "By Anderson, Deborah",
        "Description": "",
        "Category": "",
        "Publisher": "Cookbook Resources, LLC",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Transforming Government Supply Chain Management (Ibm Center for the Business of Government)",
        "Authors": "By Gansler, Jacques S. (EDT), Luby, Robert E., Jr. (EDT), Brar, Amitabh (CON), Chin, Douglas (CON), and Dzilna, Dzintars (CON)",
        "Description": "While the commercial sector has been rapidly adopting modern, information-based supply chain systems—in order to remain competitive in the worldwide marketplace—the shift to such systems in the public sector has met with significant resistance and has moved far more slowly. Transforming Government Supply Chain Management provides the insights and expertise to overcoming this inertia. In the first half of the book, the editors provide a primer on supply chain management, an overview of innovative practices and tools, and a blueprint for government-wide transformation. The second half consists of 10 case studies of public and private sector \"success stories.\"",
        "Category": " Political Science , Public Policy , General",
        "Publisher": "Rowman & Littlefield Publishers",
        "Price Starting With ($)": "7.05",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "The Phantom of the Opera (Bantam Classics)",
        "Authors": "By Leroux, Gaston and Bair, Lowell (TRN)",
        "Description": "Gaston Leroux is one of the originators of the detective story, and The Phantom of the Opera is his tour de force, as well as being the basis for the hit Broadway musical. A superb suspense story and a dark tale of obsession, The Phantom of the Opera has thrilled and entertained audiences in adaptations throughout the century.This new translation—the first completely modern and Americanized translation—unfurls the full impact of this classic thriller for modern readers. It offers a more complete rendering of the terrifying figure who emerges from the depths of the glorious Paris Opera House to take us into the darkest regions of the human heart. After the breathtaking performance of the lovely Christine Daae and her sudden disappearance, the old legend of the “opera ghost” becomes a horrifying reality as the ghost strikes out with increasing frequency and violence—always with the young singer at the center of his powerful obsession. Leroux has created a masterwork of love and murder—and a tragic figure who awakens our deepest and most forbidden fears.This is the only complete, unabridged modern Americanized translation available. Lowell Bair is the acclaimed translator of such Bantam Classics as Madame Bovary, Les Liaisons Dangereuses, and Candide.",
        "Category": " Fiction , Classics",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Killer Angels",
        "Authors": "By Shaara, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1980"
        }
    },
    {
        "Title": "More News of the Weird",
        "Authors": "By Shepherd, Chuck, Kohut, John J., and Sweet, Roland",
        "Description": "News junkies of the world, rejoice! Here's a follow up to the bestselling News of the Weird that once again shows what you've always known to be true—fact is indeed stranger than fiction. And we can prove it! Gathered here in one hilarious volume are more than 500 of the weirdest, craziest, and most outlandish stories ever to find their way into our nation's newspapers. There are coincidences so bizarre, crimes so unbalanced, and behavior so inappropriate, you won't believe your eyes. But it's all true!• People who won't take no for an answer• Far-from-perfect crimes• Fetishes on parade• It seemed like a good idea at the time• Voices in my head, plus the ultimate . . .• Even we didn't believe these!",
        "Category": " Reference , Curiosities & Wonders",
        "Publisher": "Plume",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Easy-To-Make Patchwork Quilts: Step-By-Step Instructions and Full-Size Templates for 12 Quilts (Dover Needlework)",
        "Authors": "By Weiss, Rita",
        "Description": "",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Dover Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1978"
        }
    },
    {
        "Title": "Richard Scarry's Best First Book Ever",
        "Authors": "By Scarry, Richard and Scarry, Richard (ILT)",
        "Description": "Appealing animal characters introduce preschoolers to a variety of new information and concepts--the alphabet, shapes and sizes, colors, opposites, parts of the body, numbers--and more than 700 words",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "13.98",
        "Publish Date": {
            "Month": "September",
            "Year": "1979"
        }
    },
    {
        "Title": "First Contact",
        "Authors": "By Bova, Ben and Preiss, Byron",
        "Description": "Describes the quest for life beyond the planet Earth, examining the nature of intelligence, the outer limits of our understanding of biology, and man's place in the universe",
        "Category": " Science , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "26.35",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Eyewitness to Science: Scientists and Writers Illuminate Natural Phenomena from Fossils to Fractals",
        "Authors": "By Carey, John (EDT)",
        "Description": "Plotting the development of modern science from Leonardo da Vinci to Chaos Theory, John Carey chooses accounts by scientists themselves that are both elegant and arrestingly written. The classic science-writers are here: Darwin, Huxley, Fabre. So, too, are the luminaries of the late-twentieth-century genre of popular science-writing which, Carey argues, challenges contemporary poetry and fiction in its imaginative power.",
        "Category": " Science , General",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "5.66",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Viking Times (If You Were There)",
        "Authors": "By Mason, Antony",
        "Description": "With the help of full-color illustrations and an accessible text, young readers can learn all about Viking life, from how they survived the frozen Scandinavian winters to how they built their powerful warships and honored heroes killed in battle.",
        "Category": "",
        "Publisher": "Simon & Schuster Children's Publishing",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Essential Koran: The Heart of Islam",
        "Authors": "By Cleary, Thomas (EDT)",
        "Description": "THOMAS CLEARY is the pre-eminent translator of Buddhist and Taoist texts, including 'The Essential Tao', 'The Essential Confucius', 'The Secret of the Golden Flower', and the best-selling 'The Art of War'.\"For Muslims the whole of the Qur'an is",
        "Category": " Religion , Islam , Koran & Sacred Writings",
        "Publisher": "HarperSanFrancisco",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Plan B: Rescuing a Planet under Stress and a Civilization in Trouble",
        "Authors": "By Brown, Lester R.",
        "Description": "Lester Brown notes that if the environmental trends of recent decades continue, the global economy will soon begin to unravel. The food sector, he believes, is the most vulnerable. Record-high temperatures and falling water tables are already taking the edge off grain harvests in some countries, including China, the world's largest grain producer.The wake-up call will come, Brown believes, when 1.3 billion Chinese consumers with an $80 billion trade surplus start competing with Americans for U.S. grain, driving up food prices. Rising food prices could create political instability in low-income countries, disrupting global economic progress.At that point, it will be clear that business as usual—Plan A—is not working. In Plan B, Brown outlines a World War II-type mobilization to stabilize climate by restructuring the global energy economy and to stabilize population by investing heavily in health care, family planning, and the education of girls in developing countries.",
        "Category": " Nature , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Light My World Board Book: Numbers",
        "Authors": "By Kinkade, Thomas, Kinkade, Thomas (ILT), and Lloyd-Jones, Sally",
        "Description": "Children will love exploring the beauty of God's world through the art of Thomas Kinkade. Not only will these board books help young children learn to identify shapes, colors, and animals, they will also foster an early sense of art appreciation. Adults who enjoy the beauty of Thomas Kinkade's art can now share it with their children in these fun, interactive books.Colors will delight children as they look for pink dogwood trees, blue flowers, and a red double-decker bus among the other bright objects on its pages. Shapes invites the young viewer to find the circles, triangles and hearts in depictions of objects like wreaths, boat sails, and windows. And in Animals, children will want to look again and again at Kinkade's chickens, sheep, swans, and many other friendly creatures.",
        "Category": " Juvenile Nonfiction , Concepts , Counting & Numbers",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Big Chief Elizabeth : How England's Adventurers Gambled and Won the New World",
        "Authors": "By Milton, Giles",
        "Description": "Bestselling author of NATHANIEL'S NUTMEG, Giles Milton takes us on another fascinating and extraordinary historical adventure.",
        "Category": " History , Europe , Great Britain , General",
        "Publisher": "Hodder & Stoughton",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Macbeth (The Annotated Shakespeare)",
        "Authors": "By Shakespeare, William, Bloom, Harold, and Raffel, Burton",
        "Description": "Perhaps no other Shakespearean drama so engulfs its readers in the ruinous journey of surrender to evil as does Macbeth. A timeless tragedy about the nature of ambition, conscience, and the human heart, the play holds a profound grip on the Western imagination.",
        "Category": " Drama , Shakespeare",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Moby-Dick (Bantam Classics)",
        "Authors": "By Melville, Herman",
        "Description": "Nominated as one of America’s best-loved novels by PBS’s The Great American ReadFirst published in 1851, Herman Melville’s masterpiece is, in Elizabeth Hardwick’s words, “the greatest novel in American literature.” The saga of Captain Ahab and his monomaniacal pursuit of the white whale remains a peerless adventure story but one full of mythic grandeur, poetic majesty, and symbolic power. Filtered through the consciousness of the novel’s narrator, Ishmael, Moby-Dick draws us into a universe full of fascinating characters and stories, from the noble cannibal Queequeg to the natural history of whales, while reaching existential depths that excite debate and contemplation to this day.",
        "Category": "",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1981"
        }
    },
    {
        "Title": "The American (Penguin Classics)",
        "Authors": "By James, Henry and Spengemann, William (EDT)",
        "Description": "Christopher Newman, a 'self-made' American millionaire in France, falls in love with the beautiful aristocratic Claire de Bellegarde. Her family, however, taken aback by his brash American manner, rejects his proposal of marriage. When Newman discovers a guilty secret in the Bellegardes' past, he confronts a moral dilemma: Should he expose them and thus gain his revenge? James's masterly early work is at once a social comedy, a melodramatic romance and a realistic novel of manners.For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "Category": " Fiction , Classics",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1981"
        }
    },
    {
        "Title": "Science Discovery Works: Unified Level 4",
        "Authors": "By Various",
        "Description": "",
        "Category": " Juvenile Nonfiction , Science & Nature , General",
        "Publisher": "Silver Burdett Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Moon Acadia National Park (Moon Handbooks)",
        "Authors": "By Nangle, Hilary",
        "Description": "Journalist and Maine native Hilary Nangle knows the best ways to enjoy Acadia National Park, from biking through coastal forests and exploring iconic lighthouses to visiting quant towns with great shopping and seafood. Nangle offers unique strategies that help organize trips around central themes, such as ?A Studio Tour: Artists and Artisans” and ?Lobster, Lighthouses and L.L. Bean.” Hike to ancient sea caves on Mount Desert Island, board a catamaran in Bar Harbor to observe whales and puffins, and enjoy fresh lobster at market price on the Schoodic Peninsula?Moon Acadia National Park gives travelers the tools they need to create a more personal and memorable experience.",
        "Category": " Travel , Parks & Campgrounds",
        "Publisher": "Moon Travel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Elephant Song: A Novel",
        "Authors": "By Smith, Wilbur A.",
        "Description": "WHITE GOLDIvory. In Africa, it is the tragic and thrilling object of greed, corruption, and senseless death. In this dangerous world of poachers and blood money, one determined man and one dedicated woman risk their lives to stop the senseless slaughter of a species on the brink of extinction.Following a trail that leads from the Mountains of the Moon and the deep forests of central Africa to the secret opulence of Taiwan and London's corridors of power, naturalist Dr. Daniel Armstrong and anthropologist Kelly Kinnear fight the battle of their lives against terrifying adversaries--the powerful individuals and conglomerates who would wipe out an entire race of human beings to satisfy their insatiable lust for elephant's ivory....\"Compelling...Adventure, realism, and suspense are the stuff of Wilbur Smith's books....This story transcends any formula by making its case, passionately, for the human hunger for justice.\"--The Christian Science Monitor\"Filled with intrigue and adventure on almost every page...Smith pulls his readers to the edge of their seats....For those who love an exciting adventure novel, this is one that will be difficult to put down.\"--Richmond Times-Dispatch",
        "Category": " Fiction , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Faithful: Two Diehard Boston Red Sox Fans Chronicle the Historic 2004 Season",
        "Authors": "By King, Stephen and O'Nan, Stewart",
        "Description": "“Faithful isn't just about the Red Sox. It's also about family, friendship, and what it truly means to be a baseball fan and to be—well, faithful, come hell or high water” (The Boston Globe).  “Of all the books that will examine the Boston Red Sox's stunning come-from-behind 2004 ALCS win over the Yankees and subsequent World Series victory, none will have this book's warmth, personality, or depth” (Publishers Weekly).Early in 2004, two writers and Red Sox fans, Stewart O'Nan and Stephen King, decided to chronicle the upcoming season, one of the most hotly anticipated in baseball history. They would sit together at Fenway. They would exchange emails. They would write about the games. And, as it happened, they would witness the greatest comeback ever in sports, and the first Red Sox championship in eighty-six years. What began as a Sox-filled summer like any other is now a fan's notes for the ages.",
        "Category": " Sports & Recreation , Baseball , Essays & Writings",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Walt Disney's Peter Pan (Disney's Wonderful World of Reading)",
        "Authors": "By The Walt Disney Company",
        "Description": "",
        "Category": "",
        "Publisher": "Grolier Enterprises Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Great American Short Stories (Wtm) (Watermill Classics)",
        "Authors": "By No Author",
        "Description": "",
        "Category": "",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Low Salt, Low Cholesterol Cookbook",
        "Authors": "By Waldo, Myra",
        "Description": "",
        "Category": " Cooking , Health & Healing , Low Salt",
        "Publisher": "Berkley Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1974"
        }
    },
    {
        "Title": "An Unsuitable Job for a Woman",
        "Authors": "By James, P. D.",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Lucas the Littlest Lizard (Sparkle Books)",
        "Authors": "By Worthington, Leonie (ILT) and Helidoniotis, Kathy",
        "Description": "",
        "Category": " Juvenile Fiction , Animals , Reptiles & Amphibians",
        "Publisher": "Book Company Intl",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Speaker for the Dead (Ender, No. 2)",
        "Authors": "By Card, Orson Scott",
        "Description": "",
        "Category": "",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "Earl Mindell's Allergy Bible",
        "Authors": "By Mindell, Earl",
        "Description": "Combines conventional and alternative treatment options designed to combat allergies, including hay fever, sinusitis, and asthma, and offers suggestions for the removal of allergens from the home and office.",
        "Category": " Health & Fitness , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "The Tree That Survived the Winter",
        "Authors": "By Antonucci, Emil, Fahy, Mary, and Antonucci, Emil (ILT)",
        "Description": "A tree survives the cold winter in this parable about the power of faith.",
        "Category": " Religion , Inspirational",
        "Publisher": "Paulist Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Webster's Concise Spanish-English English-Spanish Dictionary",
        "Authors": "By Geddes & Grosset",
        "Description": "",
        "Category": "",
        "Publisher": "Geddes & Grosset",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "In Defense of Israel, Revised Edition",
        "Authors": "By Hagee, John",
        "Description": "Why is the Middle East in such turmoil? Is the modern State of Israel in the plan of God? Can and should Christians do more than pray for Israel? Does God’s Word contain instructions to Christians regarding the treatment of Jewish people?  In the near-thirty years John Hagee has been a lover of Israel, he has grappled with each of these questions. Most Christians today don’t know much about the Jewish faith or the history of the Jewish nation. They don’t understand what is truly at stake in the Middle East conflict and why Christians need to do more than just pray for the peace of Jerusalem. They don’t know the role they’ve been called to play in relationship with Israel, and they aren’t sure how God feels about Israel today, either. As Hagee guides readers through the scriptures that explain why Christians need to stand with Israel and the Jews today with as much fervor as God does, they will encounter a man deeply passionate about loving this historic people of God. They’ll be inspired to take up that same mantle of love and play a part in extending acceptance and favor to the people of Israel, just as God has called them to do.",
        "Category": " Religion , Christian Living , Social Issues",
        "Publisher": "Frontline",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "I Like Me",
        "Authors": "By Coker, Deborah Connor, Holliday, Keaf (ILT), and Essence Communications, Inc. (COR)",
        "Description": "An African American girl named Nia Natasha Sierra Sims describes all the things she likes about herself and explains why she expects to do wonderful things with her life",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Hindsight: A Novel of the Class of 1972",
        "Authors": "By Rogan, Barbara",
        "Description": "The New York Times calls Barbara Rogan \"a passionate writer whose prose is as vivid as lightning bolts.\" Now she delivers a mesmerizing tale of a long-hidden betrayal -- and its deadly repercussions.  In the summer of 1972, on the night of their high school graduation, nine friends make a solemn vow to meet in twenty years' time. For Willa Scott, flanked by her best friend, Angel, and her boyfriend, Caleb, the future is a canvas to be painted in bold strokes and bright colors. But the ensuing decades bring change and separation. Willa becomes a biographer, and she drifts away from Caleb and Angel.  Almost twenty years later, Willa, now mother of a teenage girl herself and recently widowed, looks up during a book signing and sees Patrick Mulhaven, the bad boy of Beacon High. He reminds her of their long-ago vow and persuades her to help track down their old group. It isn't long before Willa discovers that Angel's trail after high school is ice cold. It's as if she dropped off the face of the earth. Convinced that something has happened to her friend, Willa begins a search that takes her back through the looking glass. What she thought were the idyllic friendships of her youth are revealed as a tangled web of deception, betrayal, and life-shattering secrets. As the reunion weekend approaches, Willa is convinced that someone has killed -- and will kill again -- to keep Angel's whereabouts hidden forever. But when the people you know best are the people you know least, who can you trust?  Barbara Rogan has proven herself a master of subtly evolving fear, and Hindsight delivers a spellbinding story about the powerful -- and sometimes murderous -- yearnings of the human heart.",
        "Category": " Fiction , Literary",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "GermLine",
        "Authors": "By Erlick, Nelson",
        "Description": "Dr. Kevin Kincaid is on the verge of a major breakthrough.  He has developed a biological vector that can introduce new genes into the DNA of unborn children-and all their descendants.  He hopes to eradicate a wide variety of genetic defects, but others see more sinister uses for this new technology.Who will control mankind's genetic destiny?  The government?  The medical establishment?  Or an international conspiracy of the rich and powerful?  GermLine is a tense and topical thriller from the front lines of tomorrow's most wrenching scientific discoveries.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Question and Answer Encyclopedia: The USA",
        "Authors": "By Barber, Nicola, Hook, Jason",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "A Case of Need: A Suspense Thriller",
        "Authors": "By Crichton, Michael",
        "Description": "#1 NEW YORK TIMES BESTSELLING AUTHOR MICHAEL CRICHTON’S EDGAR AWARD-WINNING DEBUT NOVELThe author of cutting-edge bestsellers like Jurassic Park and The Andromeda Strain—and creator of television’s ER—Michael Crichton has captivated millions of fans by skillfully blending medical and scientific fact with pulse-pounding fiction. A Case of Need is Crichton’s award-winning first novel, written shortly after completing his medical internship. Set against the ever-building pressure and pace of a large Boston medical center, tensions flare—and explode—when a surgical operation tragically ends in death, raising countless questions. Was it accidental malpractice? A violation of the Hippocratic oath? Or cold-blooded murder?   Supplemented with the author’s fascinating appendices on the ethics of modern medicine, A Case of Need is powerful, compelling, informative, and suspenseful—classic Crichton at his best.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Western Civilization: Sources, Images, and Interpretations, Volume 2: From 1660",
        "Authors": "By Sherman, Dennis (EDT)",
        "Description": "This collection of primary, secondary, and visual sources for the Western Civilization survey course provides a broad introduction to the materials historians use, the interpretations historians make, and 6,000 years of Western civilization your students need.With its vast compendium of primary, visual, and secondary sources; its broad selection of documents, photographs, maps, and charts; and its full array of introductions, commentaries, guides, and questions, this is truly the source for your course. The selections and accompanying notes—drawn from a broad and balanced spectrum of perspectives and approaches—provide valuable insight into how historians work and place all the material in a context that helps students understand the full historical significance.",
        "Category": " History , Civilization",
        "Publisher": "McGraw-Hill Humanities/Social Sciences/Langua",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Made with passion",
        "Authors": "By National Museum of American Art (U.S.)",
        "Description": "",
        "Category": "",
        "Publisher": "Published for the National Museum of American Art by the Smithsonian Institution Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Island in the Sea of Time",
        "Authors": "By Stirling, S. M.",
        "Description": "“Utterly engaging...a page-turner that is certain to win the author legions of new   readers and fans.”—George R. R. Martin, author of A Game of ThronesIt's spring on Nantucket and everything is perfectly normal, until a sudden storm blankets the entire island. When the weather clears, the island's inhabitants find that they are no longer in the late twentieth century...but have been transported instead to the Bronze Age! Now they must learn to survive with suspicious, warlike peoples they can barely understand and deal with impending disaster, in the shape of a would-be conqueror from their own time.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Brave Little Fox (Little Animal Adventures)",
        "Authors": "By Jensen, Patricia, Pepin, Muriel, and Fichaux, Catherine",
        "Description": "Little Fox and Little Badger help each other escape from an eagle, demonstrating Mother Fox's belief that bravery comes easily when you must help someone you care about.",
        "Category": "",
        "Publisher": "Reader's Digest Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Everything Personal Finance Book: Manage, Budget, Save, and Invest Your Money Wisely",
        "Authors": "By Sander, Peter J.",
        "Description": "Introduces readers to matters concerning personal finance by addressing initial wealth needs, investment options, and plans for retirement.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    }
]