[
    {
        "Title": "The Stolen Sapphire: A Samantha Mystery (American Girl Mysteries)",
        "Authors": "By Buckey, Sarah Masters and Tibbles, Jean-Paul (ILT)",
        "Description": "When a world-famous archaeologist has the priceless jewel he is carrying to London aboard a cruise ship stolen, Samantha and Nellie help him narrow down the suspects. Simultaneous. 49,000 first printing.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "American Girl",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Second Spring: A Love Story, The Fifth Chronicle of the O'Malley Family in the Twentieth Century",
        "Authors": "By Greeley, Andrew M.",
        "Description": "It's 1978 and the whole country, exhausted from the twin traumas of Vietnam and Watergate, seems to be suffering from a massive hangover. Chucky O'Malley knows how the country feels; approaching fifty, he finds himself in the grip of a debilitating mid-life crisis. He hasn't lost his faith, exactly, but he does feel disillusioned and depressed. As he travels the world, Chucky searches for a way to renew his weary spirit. Fortunately, he doesn't have to face this challenge alone. With the loving support of his family, and especially his irrepressible and adoring wife, Rosemarie, he just might rediscover his lost hope and optimism in time for a Second Spring. . . .",
        "Category": " Fiction , Christian , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Post-Conflict Reconstruction: The Role of the World Bank/Free Publication (Directions in Development)",
        "Authors": "By World Bank",
        "Description": "",
        "Category": " Business & Economics , Management",
        "Publisher": "World Bank",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "The Oxford Dictionary of Philosophy (Oxford Quick Reference)",
        "Authors": "By Blackburn, Simon",
        "Description": "The Gambler's Fallacy, the Dirty Hands Argument, Pascal's Wager, Buridan's Ass, Wittgenstein's Beetle in the Box--philosophical terms can be both intriguing and baffling. Now, eminent philosopher Simon Blackburn offers the most authoritative and up-to-date dictionary of philosophy available in a single volume, packed with helpful information for the novice and with astute observations for the expert. Ranging from Aristotle to Zen, the two thousand plus entries cover the entire span of philosophy, from the Vedas (written over three thousand years ago) to the most recent technical terminology, with ample coverage of important themes from Chinese, Indian, Islamic, and Jewish philosophy.  Here are all the terms one would expect to find in a comprehensive dictionary of philosophy--idealism and empiricism, ethics and aesthetics, Epicureanism and Stoicism, deism and pantheism, liberalism and conservatism, existentialism and logical positivism, and much more. Blackburn also defines many terms and concepts not normally found in such reference works, including entries for apathy, Elis (the Greek city which passed a law exempting all philosophers from taxation), laughter, and the meaning of life, and he includes relevant terms from disciplines such as mathematics, physics, biology, artificial intelligence, and linguistics. In addition, there are capsule biographies of nearly five hundred individuals, from the pre-Socratics, to such major figures as Aquinas, Descartes, Spinoza, Locke, Hobbes, Hegel, Kant, Schopenhauer, and Nietzsche, to such contemporary figures as Jacques Derrida, Michel Foucault, Richard Rorty, Simone de Beauvoir, and Luce Irigaray. Many more women appear here than in other philosophical dictionaries, ranging from Lady Anne Finch Conway, a 17th-century Quaker philosopher and an influence on Leibniz, to Hypatia, an important 4th-century Neoplatonist and mathematician of Alexandria, who was tortured and murdered by Christian Monks at the behest of the patriarch Cyril. And Blackburn also includes figures such as Einstein, Darwin, and Aesop. Finally, Blackburn interjects much of his own personality and wit into these entries. For instance, writing on Francis Bacon, he observes that Bacon's \"legal philosophy was one of absolute duty to the sovereign, which cannot have hindered his rise to the position of Lord Chancellor.\" And he begins his entry on apathy with \"Although it is the particular enemy of teachers and sports coaches, apathy often gets a good philosophical press, especially in ethical systems that regard desire and worldly interest as low and unworthy.\"   A survey of philosophy through the eyes of one of its leading practitioners, The Oxford Dictionary of Philosophy is both a handy reference and an intriguing book in which to browse. It is an essential volume for anyone interested in philosophy.",
        "Category": " Philosophy , Reference",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Cinders to Satin: A Novel",
        "Authors": "By Michaels, Fern",
        "Description": "From the bestselling historical romance writer Fern Michaels, author of TEXAS RICH and TEXAS HEAT, comes this exciting saga of Callie James, a brave immigrant girl from squalid Dublin, who battles her way through the hard world of late nineteenth century New York on a passion-filled, bittersweet journey to make her dreams of passion and success come true.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Ivy Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "The Kingfisher Illustrated Pocket Thesaurus (Pocket References)",
        "Authors": "By Beal, George",
        "Description": "Another great, easy-to-carry resource, this pocket thesaurus has 5,000 alphabetical entries that offer vocabulary-building synonyms, antonyms, and homonyms. Plenty of sample sentences help insure correct usage. A large, clear typeface and over a 150 illustrations help make this an appealing and accessible book for children.  There is also an invaluable 16-page section containing information on how to get the most out of your thesaurus.",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Confronting Catastrophe: A GIS Handbook",
        "Authors": "By Greene, R. W.",
        "Description": "Showing how geographic information systems (GIS) technology can provide crucial and timely information and analysis to organizations involved in emergency response and homeland security, this hands-on manual is written for communities that face the threat of large-scale disasters, whether they be wild-fires, hurricanes, earthquakes, or terrorist attacks. With full-color maps depicting the landscape of real catastrophic events; community checklists, and lessons learned from the real world of catastrophe response and preparedness, this manual is essential reading for communities that seek to make themselves more prepared should the unthinkable happen. Included are examples of how technology-savvy organizations have used the digital mapping and analysis tools of GIS technology to help in response to disasters.",
        "Category": " Technology & Engineering , Remote Sensing & Geographic Information Systems",
        "Publisher": "Esri Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Hearts and Minds: The Common Journey of Simone de Beauvoir and Jean-Paul Sartre",
        "Authors": "By Madsen, Axel",
        "Description": "",
        "Category": "",
        "Publisher": "Morrow Quill",
        "Price Starting With ($)": "5.33",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The Living Reminder: Service and Prayer in Memory of Jesus Christ",
        "Authors": "By Nouwen, Henri J. M.",
        "Description": "“The Living Reminder was like a visit from a friend I needed to speak with. The surprise for me was how much I needed to hear him say familiar things.”—National Catholic ReporterThe Living Reminder is a gift from Henry J.M. Nouwen—along with C.S. Lewis and Thomas Merton, one of the 20th century’s most beloved and important spiritual writers. Subtitled “Service and Prayer in the Memory of Jesus Christ,” Nouwen’s book presents  simple yet powerfully profound expressions of the joys of religious service, prompting the publication New Review of Books and Religion to note that we read Nouwen “to discover new possibilities in our own faith.”",
        "Category": " Religion , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Courage : A Book for Champions",
        "Authors": "By Edwin Louis Cole",
        "Description": "",
        "Category": "",
        "Publisher": "Tulsa, OK, U.S.A.: Harrison House, Incorporated, 1",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "How to Write: Advice and Reflections",
        "Authors": "By Rhodes, Richard",
        "Description": "How To Write will appeal to those who desire a career in writing, who want to express themselves better through language, or who are interested in the beauty and the magic of language. Comfortably and familiarly, Rhodes addresses the concerns of all writers: finding your voice, researching your subject, the business and process of writing - including getting your manuscript published once you have finished it - and keeping grounded in your work.Rich with personal vignettes about the author's sources of inspiration, How To Write is also a memoir of one of the most original writers of our day. Readers will be drawn to Rhodes's frank and honest remembrances of his difficult childhood and his testimony to how writing acted as a form of therapy. How To Write sparks new excitement about writing and language and provides a deeper look at a master of both.",
        "Category": " Language Arts & Disciplines , Writing , Authorship",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Eyewitness Travel Guide to Greek Islands",
        "Authors": "By Dorling Kindersley, Inc. (COR)",
        "Description": "",
        "Category": " Travel , Europe , Greece",
        "Publisher": "DK Travel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Blue skies, no candy",
        "Authors": "By Gael Greene",
        "Description": "",
        "Category": "",
        "Publisher": "Warner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Fodor's Where to Weekend Around Washington D.C., 1st Edition (Travel Guide)",
        "Authors": "By Fodor's Travel Publications, Inc.",
        "Description": "",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Scandal of the Cross and Its Triumph",
        "Authors": "By Lord, Penny and Lord, Bob",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Journeys of Faith",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Stormbreaker tie-in novel (Alex Rider)",
        "Authors": "By Horowitz, Anthony",
        "Description": "After the death of the uncle who had been his guardian, fourteen-year-old Alex Rider is coerced into continuing his uncle's dangerous work for Britain's intelligence agency, MI6. Reprint.",
        "Category": " Young Adult Fiction , Family , Orphans & Foster Homes",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Letters From Ruth's Attic: 31 Daily Insights for Knowing God's Love",
        "Authors": "By Graham, Ruth Bell and Decision Magazine Editors (COM)",
        "Description": "",
        "Category": " Religion , Christian Life , Devotional",
        "Publisher": "Billy Graham Evangelistic Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Hot, Flat, and Crowded: Why We Need a Green Revolution--And How It Can Renew America",
        "Authors": "By Friedman, Thomas L.",
        "Description": "Thomas L. Friedman's phenomenal number-one bestseller The World Is Flat has helped millions of readers to see the world in a new way. In his brilliant, essential new book, Friedman takes a fresh and provocative look at two of the biggest challenges we face today: America's surprising loss of focus and national purpose since 9/11; and the global environmental crisis, which is affecting everything from food to fuel to forests. In this groundbreaking account of where we stand now, he shows us how the solutions to these two big problems are linked--how we can restore the world and revive America at the same time.Friedman explains how global warming, rapidly growing populations, and the astonishing expansion of the world's middle class through globalization have produced a planet that is \"hot, flat, and crowded.\" Already the earth is being affected in ways that threaten to make it dangerously unstable. In just a few years, it will be too late to fix things--unless the United States steps up now and takes the lead in a worldwide effort to replace our wasteful, inefficient energy practices with a strategy for clean energy, energy efficiency, and conservation that Friedman calls Code Green.This is a great challenge, Friedman explains, but also a great opportunity, and one that America cannot afford to miss. Not only is American leadership the key to the healing of the earth; it is also our best strategy for the renewal of America.In vivid, entertaining chapters, Friedman makes it clear that the green revolution we need is like no revolution the world has seen. It will be the biggest innovation project in American history; it will be hard, not easy; and it will change everything from what you put into your car to what you see on your electric bill. But the payoff for America will be more than just cleaner air. It will inspire Americans to something we haven't seen in a long time--nation-building in America--by summoning the intelligence, creativity, boldness, and concern for the common good that are our nation's greatest natural resources.Hot, Flat, and Crowded is classic Thomas L. Friedman: fearless, incisive, forward-looking, and rich in surprising common sense about the challenge--and the promise--of the future.",
        "Category": " Political Science , Public Policy , Environmental Policy",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Ordnance Survey Guide to Castles in Britain",
        "Authors": "By Peter Furtado",
        "Description": "",
        "Category": "",
        "Publisher": "Hamlyn",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Davy Crockett: A Life on the Frontier (Ready-to-Read Level 3) (Ready-to-Read Stories of Famous Americans)",
        "Authors": "By Krensky, Stephen, Bandelin, Debra, and Dacey, Bob",
        "Description": "People said that when Davy was born he weighed more than two hundred pounds! They also said he saved the world from a comet by grabbing its tail, twirling it around, and sending it back into the sky. These stories are just myths, but Davy did have an amazing life. Here is the real story of Davy Crockett, fearless soldier and leader who always stood up for what he believed in.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Historical",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "The Peace War (Peace War, 1)",
        "Authors": "By Vinge, Vernor",
        "Description": "The Peace War is quintessential hard-science adventure. The Peace Authority conquered the world with a weapon that never should have been a weapon--the \"bobble,\" a spherical force-field impenetrable by any force known to mankind. Encasing governmental installations and military bases in bobbles, the Authority becomes virtually omnipotent. But they've never caught Paul Hoehler, the maverick who invented the technology, and who has been working quietly for decades to develop a way to defeat the Authority. With the help of an underground network of determined, independent scientists and a teenager who may be the apprentice genius he's needed for so long, he will shake the world, in the fast-paced hard-science thriller that garnered Vinge the first of his four Hugo nominations for best novel.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Discovering God's Will in Your Life",
        "Authors": "By Ogilvie, Lloyd J.",
        "Description": "",
        "Category": "",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "My Sister's Keeper: A Novel",
        "Authors": "By Picoult, Jodi",
        "Description": "New York Times bestselling author Jodi Picoult is widely acclaimed for her keen insights into the hearts and minds of real people. Now she tells the emotionally riveting story of a family torn apart by conflicting needs and a passionate love that triumphs over human weakness.Anna is not sick, but she might as well be. By age thirteen, she has undergone countless surgeries, transfusions, and shots so that her older sister, Kate, can somehow fight the leukemia that has plagued her since childhood. The product of preimplantation genetic diagnosis, Anna was conceived as a bone marrow match for Kate -- a life and a role that she has never challenged...until now. Like most teenagers, Anna is beginning to question who she truly is. But unlike most teenagers, she has always been defined in terms of her sister -- and so Anna makes a decision that for most would be unthinkable, a decision that will tear her family apart and have perhaps fatal consequences for the sister she loves. My Sister's Keeper examines what it means to be a good parent, a good sister, a good person.  Is it morally correct to do whatever it takes to save a child's life, even if that means infringing upon the rights of another? Is it worth trying to discover who you really are, if that quest makes you like yourself less? Should you follow your own heart, or let others lead you? Once again, in My Sister's Keeper, Jodi Picoult tackles a controversial real-life subject with grace, wisdom, and sensitivity.",
        "Category": " Fiction , Family Life",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Reader's Companion: A Book Lover's Guide to the Most Important Books in Every Field of Knowledge as Chosen by the Experts",
        "Authors": "By Lewis, Scott and Bratman, Fred",
        "Description": "Lists recommended books in the areas of politics, crime, journalism, literature, philosophy, mythology, urban culture, science, nature, business, and history",
        "Category": "",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Proper Wife (Historical)",
        "Authors": "By Justiss, Julia",
        "Description": "",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Introduction to Reference Work: Reference Services and Reference Processes",
        "Authors": "By Katz, William A.",
        "Description": "",
        "Category": "",
        "Publisher": "Mcgraw-Hill College",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Shady Lady",
        "Authors": "By Thornton, Elizabeth",
        "Description": "Bestselling author Elizabeth Thornton weaves a tale of seduction, love, intrigue—and the most dangerous of romances.   As the Avon Journal’s no-nonsense publisher, Jolie Chesney always sticks to the facts. And the fact is that she finds the celebrated war hero who comes to her office angrily demanding a retraction unsettlingly charismatic. Waldo Bowman’s wild sexual exploits have found their way into the paper’s gossip column, and Jo has no intention of compromising her standards, journalistic or otherwise. But when her star reporter suspiciously vanishes, Jo seeks help from this dangerously sensual man, whose connection to the Special Branch may save her friend’s life, even if it means putting her own life—and heart—on the line.Waldo Bowman senses danger in his instant attraction to Jo. Beautiful and independent, she is unlike any woman he knows—and he’s determined not to lose her, whatever the risk. For soon, these reluctant lovers will embark on a mystery that will either change their lives—or end them.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Southern Fried",
        "Authors": "By Pickens, Cathy",
        "Description": "Attorney Avery Andrews left her BMW behind in Columbia, South Carolina, along with her job at a high-powered law firm. She's come back home to Dacus where the vehicle of choice is a pickup truck with a dog chained in the back. Avery wants time to rethink her career and her life.  What she gets is a bossy great aunt drumming up clients and dragging her to social teas. That's how Avery ends up hired by a local factory to help with a messy environmental problem. But she's at Luna Lake when divers find a car containing a corpse because an old high school classmate is trying to get her attention with a half-baked stunt. Now, the discovery of the dead body sweeps Avery into a red hot case...and into the sizzling secrets of small town life, where some people get away with murder.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Let's Start Something!: Riddles to Get You Going",
        "Authors": "By Dantzler, Mark",
        "Description": "",
        "Category": " Humor , Form , Limericks & Verse",
        "Publisher": "Green Turtle Books",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "And Then He Kissed Her",
        "Authors": "By Guhrke, Laura Lee",
        "Description": "Emma, the arbiter of Victorian etiquette and behavior, risks her sterling reputation when she finds herself attracted to the roguish and seductive Lord Marlowe, who is out to teach her that some rules are meant to be broken. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Come, My Little Angel",
        "Authors": "By Noble, Diane",
        "Description": "In a mining town in the backwoods of the High Sierras, Daisy James prays for a miracle.This 10-year-old girl is concerned because people in her town are hurting. And the one who seems to be hurting the most is her own mother, who lost a baby a year earlier. Daisy is filled with sorrow inside because her mother, who used to sing and laugh and talk about God, no longer does any of those things. Now she spends her days silent and resigned. So the little girl decides what her town needs is a church, to touch their hearts and spirits, to remind them that God is there, and that His angels are watching over them all. Daisy dreams up a play entitled Come, My Little Angel, and recruits her classmates to play the roles and her beloved music teacher to provide the music. Despite the obstacles working against her, Daisy perseveres, even when her own faith is shaken, until she finds herself face to face with a miracle -straight from the hand of a God who longs to restore us to joy and singing. And when, at the end of the book, you see what God does for this little girl - and for the mother she loves so deeply - you come away knowing nothing - not one single thing - is impossible with God.",
        "Category": " Fiction , Historical",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Sleepless at Midnight (Mayhem in Mayfair, Book 1)",
        "Authors": "By D'Alessandro, Jacquie",
        "Description": "The ladies in London are abuzz over Mary Shelley's Frankenstein, especially Miss Sarah Moorehouse. Her imagination is fired up, so when she spies Matthew Devenport, Marquess Langston, mysteriously sneaking home in the wee hours clutching a shovel, she simply must investigate. Impelled by curiosity, the adventurous lass steals into his bedchamber—only to be caught red-handed by the impossibly handsome and totally naked nobleman.The Marquess Langston has more important things to worry about than a group of literature-loving ladies. But Matthew's grand plan to rescue the family from ruin could be lost when he discovers Sarah hiding behind his bedroom curtain. What is this meddlesome woman up to? And why are his desires inflamed by a chit who is too inquisitive for her own good? Well, two can play at this game . . . and when Matthew captures the beguiling Sarah in all her naked glory, the night of mischief has only just begun.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "The Illustrated Directory of Warships From 1860 to the Present Day",
        "Authors": "By Miller, David",
        "Description": "",
        "Category": "",
        "Publisher": "Salamanda Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Silent Hunter",
        "Authors": "By Taylor, Charles D.",
        "Description": "",
        "Category": "",
        "Publisher": "Jove",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Just Enough French: How to Get By and Be Easily Understood (Just Enough Series)",
        "Authors": "By Ellis, D. L. and Clark, F.",
        "Description": "Each book in this series provides just the right phrases to get by and be easily understood in everyday situations in foreign countries.  Travelers will appreciate these essential phrases for crossing borders; changing money; asking directions; meeting people; and finding accommodations, the post office, telephones, shopping areas, and transportation.",
        "Category": " Travel , Europe , France",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Lecturer's Tale: A Novel",
        "Authors": "By Hynes, James",
        "Description": "Nelson Humboldt is a visiting adjunct English lecturer at prestigious Midwest University, until he is unceremoniously fired one autumn morning. Minutes after the axe falls, his right index finger is severed in a freak accident. Doctors manage to reattach the finger, but when the bandages come off, Nelson realizes that he has acquired a strange power—he can force his will onto others with a touch of his finger. And so he obtains an extension on the lease of his university-owned townhouse and picks up two sections of freshman composition, saving his career from utter ruin. But soon these victories seem inconsequential, and Nelson's finger burns for even greater glory. Now the Midas of academia wonders if he can attain what every struggling assistant professor and visiting lecturer covets—tenure. The Lecturer's Tale is a pitch-perfect blend of satire and horror.",
        "Category": " Fiction , Literary",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Moby Dick (Treasury of Illustrated Classics)",
        "Authors": "By Melville, Herman (EDT)",
        "Description": "A classic of the sea, telling of the pursuit of Moby Dick, the white whale, who defied capture.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Modern Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "The World's Greatest Collection of Knock Knock Jokes",
        "Authors": "By Phillips, Bob",
        "Description": "",
        "Category": " Juvenile Nonfiction , Humor , Jokes & Riddles",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The Middle Place",
        "Authors": "By Corrigan, Kelly",
        "Description": "For Kelly Corrigan, family is everything. At thirty-six, she had a marriage that worked, two funny, active kids, and a weekly newspaper column. But even as a thriving adult, Kelly still saw herself as the daughter of garrulous Irish-American charmer George Corrigan. She was living deep within what she calls the Middle Place--\"that sliver of time when parenthood and childhood overlap\"--comfortably wedged between her adult duties and her parents' care. But Kelly is abruptly shoved into coming-of-age when she finds a lump in her breast--and gets the diagnosis no one wants to hear. When George, too, learns that he has late-stage cancer, it is Kelly's turn to take care of the man who had always taken care of her--and to show us a woman who finally takes the leap and grows up.",
        "Category": " Family & Relationships , Parenting , Parent & Adult Child",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Silk Screen Techniques (Dover Craft Books)",
        "Authors": "By Biegeleisen, J. I.",
        "Description": "Barely a century old, silk screen printing or serigraphy has been adopted as a commercial and an artistic process by thousands of enthusiastic professional and amateur crafters throughout the world. In this volume, one of silkscreen's foremost teachers and practitioners explains the entire process from the construction of the frame to the moment of printing your first impression. You are shown how to select or assemble every piece of equipment needed: the frame that holds the silk, the fabric and its attachment to the frame, the base on which the print will rest, stencil knives, guides, the squeegee that forces the paint through the silk, drying racks, and other items.All five of the most general and useful techniques with respect to stencils are described: the paper stencil method, the block-out method, the Tusche stencil method, the film stencil method, and the photographic stencil method. Step-by-step instructions detail each technique. Chapters on multi-color silkscreening and color matching and blending make it possible for anyone to produce fine, well-registered prints. In fact, you can use this book as a complete-to-the-last-detail home course for almost every facet of this important modern art form.A special section covers common difficulties and shows you how to reduce or eliminate them. Ninety-six detailed figures cover every step in the process, and 45 plates illustrate work by such renowned artists as Philip Hicken, Harry Schokler, W. Colescott, Riva Helfond, Anthony Velonis, Amelia Hammer, Ray Euffa, and many others who have exhibited at the National Serigraph Society and the Metropolitan Museum of Art.",
        "Category": " Design , Decorative Arts",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2013"
        }
    },
    {
        "Title": "The Fifth Discipline Fieldbook: Strategies and Tools for Building a Learning Organization",
        "Authors": "By Roberts, Charlotte, Senge, Peter M. (EDT), and Ross, Richard B. (CON)",
        "Description": "A step-by-step guide to establishing learning organizations within existing companies functions as a participative workbook, with exercises for both individuals and teams, suggested approaches and ideas, and success stories. 100,000 first printing. $100,000 ad/promo.",
        "Category": " Business & Economics , Organizational Behavior",
        "Publisher": "Currency",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Word Family Tales (-ice: Chicken Soup With Rice And Mice)",
        "Authors": "By Fleming, Maria",
        "Description": "Word Family Tales are humorous read-aloud stories created to build early phonics skills by teaching children to recognize &#8220families&#8221 of words that share the same spelling pattern. This key reading strategy helps kids decode new words with ease&#8212and become stronger readers, writers, and spellers. Set learners on the path to literacy success with these rib-tickling tales&#8212one for each of the top 25 word families! For use with Grades PreK-2.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Teaching Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Gifts Freely Given: Devotions for Your Quiet Time",
        "Authors": "By Holmes, Marjorie",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "The New Mystery: The International Association of Crime Writers' Essential Crime Writing of the Late 20th Century",
        "Authors": "By Charyn, Jerome (EDT)",
        "Description": "In the last decade of this century, crime writing has become a true international language, bringing forth the world's best literary talents to create a fictional mirror of our fears, our need for justice - or revenge - and our violent world. Since 1987, the members of the International Association of Crime Writers have created a multinational \"brotherhood and sisterhood of crime\" to articulate a vision that the forty-two chilling stories in this definitive collection represent - fiction that pushes the genre of crime writing beyond its old limits to create a genuine literature for the modern age.James Ellroy, Paco Ignacio Taibo II, Andrew Vachss, and Didier Daeninckx, creators of stories that surpass the mere hard edge to depict a bloody, pitiless world of criminals and avengers, show us a violent urban no-man's land where the real danger is the loss of our souls.Sue Grafton uses her PI Kinsey Millhone to balance the scales of justice in the shotgun killing of a cocaine dealer when the authorities can't, or won't; Sara Paretsky brings back Philip Marlowe to solve a classic California case of double murder in a brilliant homage to Raymond Chandler.Clarice Lispector shows us the terrible tricks of a young English teacher protecting herself from rapists on a train ride to Rio; Don DeLillo slices close to the bone when he presents a sympathetic picture of a young Lee Harvey Oswald, and so does Lawrence Block when he uses the victims of AIDS to pose a conundrum about the ethics of dying... and murder. All forty-two stories in this extraordinary gathering of the \"new mystery\" represent crime writing that no longer follows the rules of yesterday's cozies and detective fiction. There is evil here, but no sanitized murders off stage or in locked rooms. There is disturbingly realistic violence, but no aloof, emotionless paragons of deduction. Instead, The New Mystery gives us vigorous, stunning tales, often ironic or deeply cynical and undeniably alive. By bringing us many original or previously uncollected stories by today's best crime writers, this volume is a milestone in mystery fiction - and riveting entertainment for every fan of the genre.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "For a Special Friend",
        "Authors": "By Judith A. Stagnitto (Designed)",
        "Description": "",
        "Category": " Self-help , Self-Hypnosis",
        "Publisher": "Ariel Books / Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Insight Guide United States: On the Road (Insight Guides)",
        "Authors": "By Zenfell, Martha Ellen",
        "Description": "Rife with the series' typically fetching color photographs, this guide provides the foreign or resident traveler with the information needed to make a whirlwind tour of the highlights of the United States of America, focusing on popular cultural sites, history, and outdoor recreation. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Travel , Food, Lodging & Transportation , Road Travel",
        "Publisher": "Insight Guides",
        "Price Starting With ($)": "6.52",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "A Passage to India (Borders Classics)",
        "Authors": "By Forster, E. M.",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Borders",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Three Days for Emeralds",
        "Authors": "By Eberhart, Mignon Good",
        "Description": "Rushing to the side of her distraught friend, Lacy is horrified when Rose falls dead after consuming the drink Lacy poured for her, and when Lacy's missing fiance+a7 is identified as the dead woman's husband, Lacy becomes the number one suspect. Reissue.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Stealing Democracy: The New Politics of Voter Suppression",
        "Authors": "By Overton, Spencer",
        "Description": "Spencer Overton attacks the least-inspected area of our democracy: partisan control of the ballot box.While politicians spew shallow sound bites that describe a \"free\" American people who govern themselves by selecting their representatives, in reality politicians from both parties maintain control by selecting specific voters. Incumbent politicians control thousands of election practices and bureaucratic hurdles that determine who votes and how their votes are counted, including the location of election-district boundaries, the number of booths at urban polling places, and English-only ballots. Spencer Overton uses real-life stories to show how these seemingly insignificant practices channel political power and determine policies on war, schools, clean air, and other issues that shape our lives. He exposes the pressure points in this Orwellian system and provides strategies toward restoring self-government, including removing redistricting power from self-interested partisans and renewing parts of the Voting Rights Act that expire in 2007. Overton's compelling case is vital to the future of our democracy.",
        "Category": " Political Science , Political Process , Elections",
        "Publisher": "W. W. Norton",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Off the Mangrove Coast: Stories",
        "Authors": "By L'Amour, Louis",
        "Description": "From the jungles of Borneo to the hidden canyons  of the American West, from small-town fight clubs to a Parisian café at the end of  World War II, here are tales of betrayal and revenge, courage and cowardice, glory  and greed, as only Louis L'Amour can tell them.  Here is L'Amour at his very best.  A charismatic boxer itches to fight all comers—but his only shot at the championship  is in beating the man who ruined his father....  A beautiful movie star finds a  dead man in her apartment and begs her ex-lover, a tough private eye, to clear her  name....  A reluctant hero guides a diamond-hunting couple up a river ruled by headhunters  and pirates in pursuit of a legendary stone and the mysterious warlord who guards  it....  A young renegade sails the South China Sea with a trio of dangerous men  in search of treasure, but when it's time to divide the prize, can he trust any of  them?  Combining electrifying action scenes, vivid historical detail, and characters  who seem to leap off the page, these spectacular stories honor the legend of Louis  L'Amour.",
        "Category": " Fiction , Westerns",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "The Call of the Wild and White Fang",
        "Authors": "By London, Jack",
        "Description": "The Call Of The Wild is the  story of Buck, a dog stolen from his home and thrust  into the merciless life of the Arctic north to  endure hardship, bitter cold, and the savage  lawlessness of man and beast. White Fang  is the adventure of an animal -- part dog, part  wolf --turned vicious by cruel abuse, then  transformed by the patience and affection of one man.  Jack London's superb ability as a storyteller and  his uncanny understanding of animal and human  natures give these tales a striking vitality and  power, and have earned him a reputation as a  distinguished American writer.",
        "Category": " Fiction , Classics",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "I Can Draw Animals (Usborne Playtime Series)",
        "Authors": "By Gibson, Ray, Barlow, Amanda (ILT), and Allman, Howard (ILT)",
        "Description": "Using large colorful photographs and step-by-step instructions, presents young children with ideas for drawing animals.",
        "Category": " Juvenile Nonfiction , Art , Drawing",
        "Publisher": "Usborne Pub Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "The Power and the Glory (Penguin Classics)",
        "Authors": "By Greene, Graham",
        "Description": "\"Graham Greene's masterpiece\" John Updike)In a poor, remote section of Southern Mexico, the paramilitary group, the Red Shirts have taken control. God has been outlawed, and the priests have been systematically hunted down and killed. Now, the last priest is on the run. Too human for heroism, too humble for martyrdom, the nameless little worldly whiskey priest” is nevertheless impelled toward his squalid Calvary as much by his own compassion for humanity as by the efforts of his pursuers.For more than sixty-five years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,500 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "Category": " Fiction , Classics",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Crohn's Disease and Ulcerative Colitis: Everything You Need to Know (Your Personal Health)",
        "Authors": "By Saibil, Fredric G.",
        "Description": "It has become acceptable to talk about heart disease, ulcers and even cancer, but inflammatory bowel disease (IBD) -- which includes two chronic conditions known as Crohn's disease and ulcerative colitis -- has remained for too long the secret illness that no one wants to discuss.    Now Dr. Fred Saibil, a renowned expert on IBD, provides concise, up-to-date information on these common conditions.    Dr. Saibil begins by describing the normal gastrointestinal system, and then explains what goes wrong in someone with IBD. He also discusses:    Signs and symptoms  Procedures and instruments used to diagnose IBD  Affects of diet  Drugs available and how they work  Pros and cons of various surgical options  Effects on sexual activity and child-bearing    Dr. Saibil even provides travel tips and other useful            self-help strategies for living with IBD, and explains possible complications of the disease, and the special problems of children with IBD.    With its detailed tables, sidebars and diagrams, Crohn's Disease & Ulcerative Colitis gives you the straight facts about a disease that effects many thousands of North Americans.",
        "Category": " Medical , Gastroenterology",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Hanukkah-A Counting Book: A Counting Book in English, Hebrew, and Yiddish",
        "Authors": "By Sper, Emily",
        "Description": "Clever die cuts of colorful candles against rich black backgrounds add up one by one with each turn of the page, giving youngsters an opportunity to count from one to eight in three different languages while learning about this special Jewish holiday.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Hanukkah",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Dark Horse (Elena Estes)",
        "Authors": "By Hoag, Tami",
        "Description": "In her latest thriller, New York Times bestselling author Tami Hoag takes readers on a suspense-filled ride of shocks and twists leading to an explosive finish. It is the story of an ex-cop, a missing girl, and a killer locked in a race where there can be only one winner—and the losers die trying. In a trailer in a Florida swamp, time is running out for eighteen year-old Erin Seabright. A pawn in a kidnapper's terrifying game for a ransom no one can pay, her last hope is a washed-up ex-cop who has already lost it all-not once, but twice.The wealthy world of the Palm Beach horse set seems a long way from a cop's world in the narcotics division. A lifetime ago, undercover sheriff's detective Elena Estes worked the mean streets and BackTop alleys, living by her wits and playing the long odds until she took one risk too many. Now Estes lives on the ragged edge of lost hope and self-hatred, hiding from the past and believing she doesn't deserve to have a future. But the past is about to come back with a vengeance, and the future is about to become a race between life and death.A young woman is missing and her twelve year-old stepsister comes to Estes for help. No one but serious, studious Molly Seabright seems concerned about what's happened to her troubled older sister. But Molly is convinced Erin is in danger. Estes has no P.I. license, no interest in a new career, and no desire to break her self-imposed exile. But the more she learns about the people Erin Seabright was involved with, the more her long-dormant cop instincts come back to life.One trip to the show grounds where Erin worked as a groom, and Estes is quickly pulled to the dark side of a glamorous sport. Behind the glittering, ultra-rich facade is an ultra-ruthless world of drugs, payoffs, and dirty deals. A world of dissolute playboys and crooked horse-dealers, of royalty and rabble, of rivals and enemies. An obscenely wealthy world where anything can be had for a price—including a life.And in that world stalks a killer who will lead Estes down a dark, twisted trail of decadence and deceit, mayhem and murder—from the gilded life of Palm Beach to the darkest corners of the Florida swamps, to a final show-down that could cost her everything. A race against time and evil. A race in which Estes is the dark horse—and no one is betting on her to win.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "The Blood of Flowers: A Novel",
        "Authors": "By Amirrezvani, Anita",
        "Description": "A sensuous and richly-imagined historical novel that centers on a skilled young carpet weaver, her arranged marriage, and her quest for self-determination in 17th-century Persia.In 17th-century Iran, a 14-year-old woman believes she will be married within the year. But when her beloved father dies, she and her mother find themselves alone and without a dowry. With nowhere else to go, they are forced to sell the brilliant turquoise rug the young woman has woven to pay for their journey to Isfahan, where they will work as servants for her uncle, a rich rug designer in the court of the legendary Shah Abbas the Great.Despite her lowly station, the young woman blossoms as a brilliant designer of carpets, a rarity in a craft dominated by men. But while her talent flourishes, her prospects for a happy marriage grow dim. Forced into a secret marriage to a wealthy man, the young woman finds herself faced with a daunting decision: forsake her own dignity, or risk everything she has in an effort to create a new life.",
        "Category": " Fiction , Literary",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "The New Yorkers: A Novel",
        "Authors": "By Schine, Cathleen",
        "Description": "A New York Times Book Review Editors' ChoiceInspired by her account in The New Yorker of adopting a profoundly troubled dog named Buster, acclaimed author Cathleen Schine's The New Yorkers is a brilliantly funny story of love, longing, and overcoming the shyness that leashes us. On a quiet little block near Central Park, five lonely New Yorkers find one another, compelled to meet by their canine companions. Over the course of four seasons, they emerge from their apartments, in snow, rain, or glorious sunshine to make friends and sometimes fall in love. A love letter to a city full of surprises, The New Yorkers is an enchanting comedy of manners (with dogs!) from one of our most treasured writers.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Wuthering Heights (Bantam Classics)",
        "Authors": "By Bronte, Emily",
        "Description": "Nominated as one of America’s best-loved novels by PBS’s The Great American ReadWuthering Heights, first published in 1847, the year before the author's death at the age of thirty, endures today as perhaps the most powerful and intensely original novel in the English language. “Only Emily Brontë,” V.S. Pritchett said about the author and her contemporaries, “exposes her imagination to the dark spirit.” And Virginia Woolf wrote, “It is as if she could tear up all that we know human beings by, and fill these unrecognisable transparencies with such a gust of life that they transcend reality. Hers, then, is the rarest of all powers. She could free life from its dependence on facts, with few touches indicate the spirit of a face so that it needs no body; by speaking of the moor make the wind blow and the thunder roar.”",
        "Category": "",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Dead Wrong (Joanna Brady Mysteries, 12)",
        "Authors": "By Jance, Judith A.",
        "Description": "Juggling a family and a career has never been easy for Cochise County Sheriff Joanna Brady. Now the impending birth of her second child only adds to her burden, especially when two brutal crimes fall under her jurisdiction. A corpse is discovered in the Arizona desert with the fingers severed from both hands—the body of an ex-con who served twenty years for a murder he claimed not to remember. Soon after, one of Joanna's female officers is savagely assaulted and left for dead while on an unauthorized stakeout. Since the victim is one of their own, the department directs the bulk of its resources toward finding her attacker. But the desert slaying haunts Joanna as well, and neither her pregnancy nor family concerns will keep her from doing her duty, no matter how perilous. Because justice must be served. And enforcing the law has become more than what Joanna Brady does—it's what she is.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "The Facts on File Dictionary of Marine Science",
        "Authors": "By Charton, Barbara, Immergut, Edmund H., and Tietjen, John H., Ph.D.",
        "Description": "The Facts On File Dictionary of Marine Science, Revised Edition contains more than 2,500 cross-referenced entries that reflect the great diversity of disciplines within the fascinating subject of marine science. Revised and expanded by more than 500 new terms, this volume is a comprehensive reference tool that reflects the myriad changes in the field.",
        "Category": "",
        "Publisher": "Checkmark Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Bollettieri's Tennis Handbook",
        "Authors": "By Bollettieri, Nick",
        "Description": "",
        "Category": " Sports & Recreation , Tennis",
        "Publisher": "Human Kinetics",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "At the King's Command (The Tudor Rose Trilogy)",
        "Authors": "By Wiggs, Susan",
        "Description": "Frustrated by his own failures at matrimony, King Henry VIII punishes an insolent nobleman by commanding him to marry the vagabond woman caught stealing his horse. Stephen de Lacey is a cold and bitter widower, long accustomed to the sovereign's capricious and malicious whims. He regards his new bride as utterly inconvenient…though undeniably fetching.But Juliana Romanov is no ordinary thief—she is a Russian princess forced into hiding by the traitorous cabal who slaughtered her family. One day she hopes to return to Muscovy to seek vengeance.What begins as a mockery of a marriage ultimately blossoms into deepest love.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Night Probe",
        "Authors": "By Cussler, Clive",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1982"
        }
    },
    {
        "Title": "Handbook of Statistical Analyses Using SAS, Second Edition",
        "Authors": "By Everitt, Brian S. and Der, Geoff",
        "Description": "Powerful software often comes, unfortunately, with an overwhelming amount of documentation. As a leading statistics software package, SAS is no exception. Its manuals comprise well over 10,000 pages and can intimidate, or at least bewilder, all but the most experienced users.A Handbook of Statistical Analyses using SAS, Second Edition comes to the rescue. Fully revised to reflect SAS Version 8.1, it gives a concise, straightforward description of how to conduct a range of statistical analyses. The authors have updated and expanded every chapter in this new edition, and have incorporated a significant amount of new material. The book now contains more graphical material, more and better data sets within each chapter, more exercises, and more statistical background for each method. Completely new topics include the following:Data description and simple inference for categorical variablesGeneralized linear models Longitudinal data: Two new chapters discuss simple approaches, graphs, summary measure, and random effect modelsResearcher or student, new user or veteran, you will welcome this self-contained guide to the latest version of SAS. With its clear examples and numerous exercises, A Handbook of Statistical Analyses using SAS, Second Edition is not only a valuable reference, but also forms the basis for introductory courses on either SAS or applied statistics at any level, from undergraduate to professional.",
        "Category": " Mathematics , Probability & Statistics , General",
        "Publisher": "Chapman and Hall/CRC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "I Kissed Dating Goodbye",
        "Authors": "By Harris, Joshua",
        "Description": "Joshua Harris's first book, written when he was only 21, turned the Christian singles scene upside down...and people are still talking. More than 800,000 copies later, I Kissed Dating Goodbye, with its inspiring call to sincere love, real purity, and purposeful singleness, remains the benchmark for books on Christian dating. Now, for the first time since its release, the national #1 bestseller has been expanded with new content and updated for new readers. Honest and practical, it challenges cultural assumptions about relationships and provides solid, biblical alternatives to society's norm.Tired of the game? Kiss dating goodbye. Going out? Been dumped? Waiting for a call that doesn’t come? Have you tasted pain in dating, drifted through one romance or, possibly, several of them? Ever wondered, Isn’t there a better way? I Kissed Dating Goodbye shows what it means to entrust your love life to God. Joshua Harris shares his story of giving up dating and discovering that God has something even better—a life of sincere love, true purity, and purposeful singleness.",
        "Category": " Religion , Christian Living , Love & Marriage",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "The American Dietetic Association's Complete Food and Nutrition Guide",
        "Authors": "By Duyff, Roberta Larson",
        "Description": "Chosen by Ladies Home Journal as a Top Health Book of 1996, a comprehensive nutrition guide, replete with charts, graphs, and illustrations and based on the latest USDA guidelines, offers advice on dieting, antioxidants, and more. Reprint. Tour. IP.",
        "Category": "",
        "Publisher": "Chronimed Publishing",
        "Price Starting With ($)": "6.81",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "The Berenstain Bears' Mad, Mad, Mad Toy Craze",
        "Authors": "By Berenstain, Stan and Berenstain, Jan",
        "Description": "This classic Berenstain Bears story is a perfect way to teach children about individuality and not having to follow the crowd!Come for a visit in Bear Country with this classic First Time Book® from Stan and Jan Berenstain. Brother and Sister’s friends have started collecting a new toy called Beary Bubbies and the cubs just have to have them! Will Brother and Sister come to realize that it’s all just a fad, or will they be stuck in a toy craze forever? Includes over 50 bonus stickers!",
        "Category": " Juvenile Fiction , Toys, Dolls & Puppets",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Hurry Up, Franklin",
        "Authors": "By Bourgeois, Paulette and Clark, Brenda (ILT)",
        "Description": "Even though he is very slow and has many distractions on the way, Franklin the turtle manages to get to Bear's house just in time for a special event",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Scholastic Paperbacks",
        "Price Starting With ($)": "142.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Lords of Light",
        "Authors": "By Chopra, Deepak",
        "Description": "American doctor Michael Aulden, is one of thirty-six pure souls--mentioned in the ancient writings--who can keep the world from a descent into evil, but he and the woman he loves will have to join forces against a destructive young man known as The Prophet. Original.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Leaving Whiskey Bend",
        "Authors": "By Garlock, Dorothy",
        "Description": "The Wild West has been the setting for some of Dorothy Garlock's most beloved novels. Now this New York Times bestselling author returns to this legendary time and place for a thrilling, heartfelt tale of a young woman tested by life . . .  LEAVING WHISKEY BEND  Schoolteacher Hallie Wolcott and her no-nonsense friend Pearl Parsons know there's got to be a better place to live than the roughneck town of Whiskey Bend, Colorado. When their friend Mary is assaulted by her brutal stepbrother, it's the last straw. Hallie and Pearl pull up stakes, rescue Mary, and put as many miles of Colorado wilderness behind them as they can. But a violent storm soon sends their journey careening in a different direction. Enter Eli Morgan, a quiet rancher deep in family troubles-and pursued by unseen, ruthless enemies. Now with Mary's vengeful stepbrother closing in on them all, Hallie must learn strength, perseverance, and courage . . . if she is to claim the life and love that can be hers.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "When I'm With You",
        "Authors": "By Miller, Linda Lael and Ross, JoAnn",
        "Description": "Welcome to a world where passion is only the beginning.  .  .and desire never ends.  .  .   Take two New York Times bestselling authors, Linda Lael Miller and JoAnn Ross, add four of their most romantic stories, and you have a one wonderful anthology. Linda Lael Miller \"tugs at the heartstrings as few authors can.  .  .\" is the opinion of Publishers Weekly. While Romantic Times hails JoAnn Ross for her \"unique flair for creating refreshing and rewarding reading experiences.\" These four stories entice, inspire, and leave you wanting more, more, more.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Brava",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Tales of Ancient Egypt (Puffin Classics)",
        "Authors": "By Green, Roger Lancelyn and Copley, Heather (ILT)",
        "Description": "Retells twenty stories of magic, adventure, and mythology first told in ancient Egypt",
        "Category": " Juvenile Fiction , Legends, Myths, Fables , General",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "The Bride and the Beast (Once Upon a Time)",
        "Authors": "By Medeiros, Teresa",
        "Description": "Dear Reader,I'd been prowling the crumbling ruins of Castle Weyrcraig for so long that I could no longer remember if I was man or beast. Then one stormy night the superstitious Highlanders of Ballybliss decided to leave a helpless virgin bound to a stake in the castle courtyard to satisfy my insatiable appetites. My demands might strike terror in the hearts of men, but this bold beauty dared to defy me. After she informed me that she didn't believe in dragons, I had no choice but to make her my prisoner—or risk being exposed to those I had sought to deceive with my dangerous masquerade. Soon I found myself stealing into the moonlit tower just to watch her sleep. Little does she know that beneath this beast's gruff exterior beats the passionate heart of a man. Gwendolyn Wilder may not believe in dragons, but I intend to use all my sensual wiles to teach her to believe in something even more magical—true love.Eternally yours,The Dragon of Weyrcraig",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Frommer's Japan & Hong Kong",
        "Authors": "By Beth Reiber",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "6.62",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Hospitality and Travel Marketing",
        "Authors": "By Morrison, Alastair M.",
        "Description": "",
        "Category": " Business & Economics , Industries , Hospitality, Travel & Tourism",
        "Publisher": "Delmar Pub",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Psychiatry: 600 Multiple Choice Questions With Referenced Explanatory Answers (Medical Examination Review, Vol 7)",
        "Authors": "By Allen, James R. and Allen, Barbara Ann, Ph.D.",
        "Description": "",
        "Category": "",
        "Publisher": "Medical Examination Pub",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "The West Highland White Terrier (Terra-Nova)",
        "Authors": "By Arnel, Jill",
        "Description": "These tiny, smart dogs are athletic and adaptable. With proper training and lots of love, they can be a great companion for any dog lover. Written by an expert, this book contains valuable information on a variety of topics that are essential for cultivating health and happiness in a canine companion—including feeding, grooming, and training. In addition to an extensive, veterinarian-approved health chapter, the book comes with a bonus DVD that features socialization, safety, and training advice from a professional dog trainer—plus detailed information from a veterinarian on what happens at the vet and how to perform regular health checks at home.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "T.F.H. Publications, Inc.",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Josephine",
        "Authors": "By Erickson, Carolly",
        "Description": "In 1804, when Josephine Bonaparte knelt before her husband, Napoleon, to receive the imperial diadem, few in the vast crowd of onlookers were aware of the dark secrets hidden behind the imperial façade. To her subjects, she appeared to vet hew most favored woman in France: alluring, wealthy, and with the devoted love of a remarkable husband who was the conqueror of Europe. In actuality, Josephine's life was far darker, for her celebrated allure was fading, her wealth was compromised by massive debt, and her marriage was corroded by infidelity and abuse.Josephine's life story was as turbulent as the age-an era of revolution and social upheaval, of the guillotine, and of frenzied hedonism. With telling psychological depth and compelling literary grace, Carolly Erickson brings the complex, charming, ever-resilient Josephine to life in this memorable portrait, one that carries the reader along every twist and turn of the empress's often thorny path, from the sensual richness of her childhood in the tropics to her final lonely days at Malmaison.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Grandma's Casseroles (Digest Comb-Bound Cookbooks)",
        "Authors": "By Weber, Louis",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "The Accountability Factor: The Buck Starts Here",
        "Authors": "By Alan M. Dobzinski, MCC with Margaret E. Wilson",
        "Description": "",
        "Category": "",
        "Publisher": "Sweet Pea Press, Baltimore, MD",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "The Essential Vegetarian Cookbook: Your Guide to the Best Foods on Earth: What to Eat, Where to Get It, How to Prepare It",
        "Authors": "By Shaw, Diana and Warinner, Kathy (ILT)",
        "Description": "More than six hundred low-fat, vegetarian recipes are accompanied by hundreds of illustrations, menu suggestions to suit a variety of dietary needs, advice on reading nutritional labels, storage and shopping tips, and a guide to kitchen equipment and utensils. Simultaneous. 35,000 first printing.",
        "Category": " Cooking , Vegetarian",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "13 Bullets: A Vampire Tale",
        "Authors": "By Wellington, David",
        "Description": "All the official reports say they are dead-extinct since the late ’80s, when a fed named Arkeley nailed the last vampire in a fight that nearly killed him. But the evidence proves otherwise.When a state trooper named Caxton calls the FBI looking for help in the middle of the night, it is Arkeley who gets the assignment-who else? He’s been expecting such a call to come eventually. Sure, it has been years since any signs of an attack, but Arkeley knows what most people don’t: there is one left. In an abandoned asylum she is rotting, plotting, and biding her time in a way that only the undead can.Caxton is out of her league on this case and more than a little afraid, but the fed made it plain that there is only one way out. But the worst thing is the feeling that the vampires want more than just her blood. They want her for a reason, one she can’t guess; a reason her sphinxlike partner knows but won’t say; a reason she has to find out-or die trying.Now there are only 13 bullets between Caxton and Arkeley and the vampires. There are only13 bullets between us, the living, and them, the damned.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The Average American Male: A Novel",
        "Authors": "By Kultgen, Chad",
        "Description": "“I can’t figure out if this book is a heart-felt dispatch from the front line in the battle of the sexes or a brilliant send-up of the way in which the male point of view has been misrepresented by militant feminists. I suspect it may be both.” --Toby Young, New York Times bestselling author of How to Lose Friends and Alienate PeopleAn offensive, in-your-face, brutally honest and completely hilarious look at male inner life and sexual fantasy. In the course of this hilariously honest book, our narrator suffers through a relationship with his vapid wannabe-actress girlfriend until he finds the perfect girl. But when he moves into the new relationship, he slowly learns that all women are pretty much the same, that man's true desires will never be fulfilled, and the decision between living life alone or biting the marriage bullet must be made.",
        "Category": " Fiction , Erotica , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Spygirl: True Adventures from My Life as a Private Eye",
        "Authors": "By Gray, Amy",
        "Description": "While her friends are making mad cash and getting massages at their dot-com jobs, Amy Gray quits her low-status publishing position to realize her girlhood dream of being a private investigator. Joining a small Manhattan agency, she finds herself plunged into an intriguing world of “con men, lunatics, narcissists, polygamists, sociopaths, felons, petty thieves, and pathological liars”—a description almost as apt for the men in her social life as for her on-the-job subjects. Working with a gang of misfit colleagues (a former zookeeper, a one-time child star, an avant-garde philosopher, and other eccentrics), Amy discovers even more about herself as she detects uncanny parallels between her investigations and her tumultuous love life.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.5",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Fabulous '50s Recipe Collection (Favorite Brand Name Recipes)",
        "Authors": "By Louis Weber",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Lt",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Hot Pursuit: A Novel",
        "Authors": "By Brockmann, Suzanne",
        "Description": "Alyssa Locke is no stranger to dealing with danger. As team leader of the nation’s number one personal security company, Troubleshooters Inc., she’s seen more than her share of action, survived plenty of close calls, and holds her own with the best of them–and against the worst of them. Guarding lives is her game, and no one plays it better. But her toughest challenge will be protecting herself from a serial killer she’s been after for years–known only as “The Dentist”–who is determined to make her his ultimate trophy.The assignment was supposed to be an easy one: teach self-defense techniques to a newly elected assemblywoman and her chief of staff after a political controversy generates a blizzard of hate mail–including death threats–from hotheads and cranks. But as soon as she mobilizes her squad of moonlighting Navy SEALs in New York City, Alyssa begins butting heads with the hard-case cop who thinks that the Troubleshooters are chasing shadows. Until they discover a dead body. And then another. Now Alyssa really has her hands full–bodyguarding two independent, busy women, managing a murder investigation, and trying to find time for her husband, Troubleshooters operative Sam Starrett, and their infant son. Meanwhile, it wouldn’t be a Troubleshooters operation without romantic sparks and heated rivalries–and any time the SEALs of Team Sixteen are involved, there are plenty of both.  But then, while investigating a suspect, Alyssa is ambushed and suddenly finds herself imprisoned by The Dentist. Cut off from everyone she loves and relies on, Alyssa must call upon all of her strength and skill to survive this final confrontation with the sadistic monster, meanwhile trusting that her Troubleshooter teammates, led by her beloved Sam, will reach her before it’s too late.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Monet (Artists by Themselves)",
        "Authors": "By Rachel Barnes",
        "Description": "",
        "Category": "",
        "Publisher": "Bracken Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "The Forever King (Forever King Trilogy)",
        "Authors": "By Murphy, Warren and Cochran, Molly",
        "Description": "In a darkened house not far from the place where Camelot may once have stood, a madman schemes, plotting toward the day when he will wrest the cup that men call the Holy Grail from the boy who is its guardian.Arthur Blessing is no ordinary ten-year-old. The Grail is his by chance, this time, but the power to keep it--a power as ancient as time itself--is his by right.Now he must stay alive--battling foul sorcery and indefatigable assassins--long enough to use that power.\"A fresh and exciting view of the Arthur legend.\"  —Robert Jordan on Molly Cochran's The Forever King",
        "Category": " Fiction , Fantasy , Contemporary",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Hundred-Dollar Baby (Spenser)",
        "Authors": "By Parker, Robert B.",
        "Description": "In a tale that reintroduces the character of runaway prostitute April Kyle, a poised adult April, now the head of an upscale Boston call-girl operation, requests private investigator Spenser's help in preventing a local kingpin from seizing control of her enterprise. Reprint.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Time Bomb (Alex Delaware)",
        "Authors": "By Kellerman, Jonathan",
        "Description": "Edgar Award winner Jonathan Kellerman once more explores the corruption of California's golden coast and produces a novel of complex characterizations and nonstop suspense. By the time psychologist Dr. Alex Delaware reached the school the damage was done: A sniper had opened fire on a crowded playground, but was gunned down before any children were hurt. While the TV news crews feasted on the scene an Alex began his therapy sessions with the traumatized children, he couldn't escape the image of a slight teenager clutching an oversized rifle. What was the identity behind the name and face: a would-be assassin, or just another victim beneath an indifferent California sky?Intrigued by a request from the sniper's father to conduct a \"psychological autopsy\" of his child, Alex begins to uncover a strange pattern of innocence, neglect, and loss. Then suddenly it is more than a pattern -- it is a trail of blood. In the dead sniper's past was a dark and vicious plot. And in Alex Delaware's future is the stuff of grown-up nightmares: the face of real human evil.Also available on BDD Audio Cassette.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Danny and the Dinosaur Go to Camp",
        "Authors": "By Hoff, Syd",
        "Description": "Danny's going to camp––and he's taking the dinosaur! First introduced in 1958 with Danny and the Dinosaur and the recent stars of Happy Birthday, Danny and the Dinosaur, this popular pair is together again in an adventure sure to please beginning readers and happy campers alike.   Children's Choices for 1997 (IRA/CBC)",
        "Category": " Juvenile Fiction , Sports & Recreation , General",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Princes & Princesses (Young Reading, Level 1)",
        "Authors": "By Sims, Lesley, Rawson, Christopher, and Cartwright, Stephen (ILT)",
        "Description": "Awkward Prince Colin tries to prove he is worthy of a sad princess, Princess Prue refuses a prince and must marry a beggar, poor Prince Sam tends pigs to be near Princess Sara, and cruel and dirty Prince Percy kidnaps a princess.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Usborne Pub Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Everything Casino Gambling Book (Everything Series)",
        "Authors": "By Mandos, George",
        "Description": "Offers tips and strategies for beating the house while explaining the rules and etiquette for playing blackjack, craps, roulette, poker, keno, baccarat, Caribbean stud poker, and Wheel of Fortune",
        "Category": " Games & Activities , Gambling , General",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Sun Tzu: The Art of War for Managers; 50 Strategic Rules",
        "Authors": "By Sun-tzu and Michaelson, Gerald A.",
        "Description": "Learn the strategic rules of Sun Tzu and how to incorporate them into your management style.In this translation of The Art of War readers will benefit from the interpretations from other translators and strategist, as well as the 50 strategic rules, including:How to look for strategic turns to meet the competitionHow to attain strategic superiority and crush the competitionHow to plan surprise and stay ahead of the gameAnd more timeless wisdom that will allow you to compete and win in the dynamic business environment!Business managers around the world have tapped into this ancient wisdom; it is time to master The Art of War for Managers for the existence and growth of your business!",
        "Category": " Business & Economics , Reference",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Cooking With the Cat (The Cat in the Hat: Step Into Reading, Step 1)",
        "Authors": "By Worth, Bonnie",
        "Description": "Look! Look! The Cat wants to cook! Told with simple rhymes and rhythms, this jaunty   illustrated tale gives very young readers a taste of the Cat in the Hat’s flamboyant   cooking skills as he slaps on a Chef’s hat and whips up purple cupcakes using some   truly odd ingredients!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Kings in Winter",
        "Authors": "By McMurtry, Larry",
        "Description": "A rich historical tale follows a love triangle that spans a generation, a friendship that endures from dusty wagons to private planes, and a rancher's legacy that sprawls beyond memories and land. Reprint.",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Bounty of Biltmore Cookbook: A Recipe Collection from Biltmore Estate",
        "Authors": "By Pickering, Whitney Wheeler",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "DK Readers: Invaders From Outer Space (Level 3: Reading Alone) (DK Readers Level 3)",
        "Authors": "By Brooks, Philip and Wilkinson, Philip",
        "Description": "Are aliens from other planets visiting Earth? Read these amazing stories of alien encounters—and make up your own mind!     Stunning photographs combine with lively illustrations and engaging, age-appropriate stories in DK Readers, a multilevel reading program guaranteed to capture children's interest while developing their reading skills and general knowledge.With DK Readers, children will learn to read—then read to learn!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Storm Winds",
        "Authors": "By Johansen, Iris",
        "Description": "A twisted psychopath...a trail of violence...and a man and woman who will risk everything to stop him...Jean Marc Andreas wanted what was his by right. He was seeking justice—and he would use any means to get it. Juliette de Clement, a confidante of the royal family, could aid his search for the priceless treasure so many had killed to possess...and died to protect. But in eighteenth-century revolutionary France, a world of power and intrigue, soldiers and assassins, royalty and rebels, death could come in many forms and from any direction, and none more lethal—or more likely—than from the person you trusted most. Still, Jean and Juliette had no choice but to trust each other, because their very lives depended on it. Someone else was determined to have the Wind Dancer statue—and the legacy of power it bestowed. Someone whose twisted genius for evil was already wreaking a path of unspeakable violence that only together they could stop...even as they stood to be its next victims.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    }
]