[
    {
        "Title": "What Would You Do If\u0085?: 101 Five-Minute Devotions for the Family",
        "Authors": "By Johnson, Greg",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Heritage Builders Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "A Moment a Day Practical Devotions for Today's Busy Woman",
        "Authors": "By Mills, Kathi (EDT) and Beckwith, Mary (EDT)",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Regal Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "The Dragon at War",
        "Authors": "By Dickson, Gordon R.",
        "Description": "Magically transported to medieval England and empowered with special gifts, Jim Eckert is challenged to protect England from an invasion of the French army, which has aligned itself with the mighty serpents of the deep.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace Hardcover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "15 Minutes of Peace With God",
        "Authors": "By Barnes, Emilie",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "Harvest House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Wind (Snow Series #2)",
        "Authors": "By Miller, Calvin",
        "Description": "A woman's act of compassion towards a homeless family causes a rift with her brothers, who are not so giving.",
        "Category": " Fiction , Religious",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Coffee Break Devotions",
        "Authors": "By Kimbrough, Marjorie L.",
        "Description": "This book contains short devotionals from each book of the Bible that are appropriate for a brief devotional break at any time of day. Each contains a suggested Scripture, a reflection on that Scripture, and a prayer.",
        "Category": " Self-help , Meditations",
        "Publisher": "DIMENSIONS FOR LIVING",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Beyond the River: The Far Fields Series, Book 1",
        "Authors": "By Morris, Gilbert and Funderburk, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Starburst Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "By Dawn's Early Light (Millennium Bug Series #2)",
        "Authors": "By Hunt, Angela Elwell and Jeffrey, Grant R.",
        "Description": "In this thrilling sequel to Flee the Darkness, the Y2K crisis has passed, but Daniel Prentice is faced with an even greater crisis as the ancient prophecies foretold in the book of Ezekial begin to unfold. The forces of evil have never been stronger nor the world's destruction nearer than in By Dawn's Early Light.",
        "Category": " Fiction , Religious",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "The Wager",
        "Authors": "By Myers, Bill",
        "Description": "Includes Bible study on the Sermon on the Mount.God and Satan have made a wager.Now it's up to Michael Steele to determine a winner.Michael T. Steele has been nominated for an Academy Award, but his most compelling performance has just begun. He has been cast unaware as the lead character in a supernatural drama between good and evil, heaven and hell. Claiming that the Sermon on the Mount is an impossible standard, Satan has chosen Steele to prove his point in a wager with God. God agrees to the choice, insisting that Michael can live out the truths of Matthew 5, 6, and 7 in the ten days before the award ceremonies.The Wager follows Steele as he copes with his career, his crumbling marriage, and his struggles with his faith---not to mention a few diabolical tricks and temptations by Satan and some guidance and encouragement from heaven. All this as Steele probes the depth of the Sermon on the Mount and how one man might follow it.Part fiction, part Bible study, The Wager is a powerful parable examining the Sermon on the Mount and how to live it in today's world.",
        "Category": " Fiction , Religious",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The DEL-Amateur Emigrant",
        "Authors": "By Stevenson, Robert Louis",
        "Description": "",
        "Category": " Travel , General",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Selected Tales (The World's Classics)",
        "Authors": "By Poe, Edgar Allan",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "The Color of the Star (The Price of Liberty #2)",
        "Authors": "By Morris, Gilbert and Funderburk, Robert",
        "Description": "Kept apart by the social classes of Liberty, Georgia, Billy Christmas and Jordan Simms meet again when Billy joins the Marines and Jordan becomes a Navy nurse",
        "Category": " Fiction , General",
        "Publisher": "Word Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Exposing the Myths of Parenthood",
        "Authors": "By Jeremiah, David",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Winning God's Way",
        "Authors": "By Cunningham, Loren",
        "Description": "",
        "Category": "",
        "Publisher": "Frontline Communications",
        "Price Starting With ($)": "8.88",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "The divine staircase;: A guide to Christian maturity based on Isaiah's experience in the temple",
        "Authors": "By Strong, Kendrick",
        "Description": "",
        "Category": "",
        "Publisher": "Upper Room",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Emma (Penguin Classics)",
        "Authors": "By Austen, Jane and Blythe, Ronald (EDT)",
        "Description": "Jane Austen depicts a rich and beautiful heiress whose matchmaking schemes cause many complications",
        "Category": " Fiction , General",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1966"
        }
    },
    {
        "Title": "Classics of Modern Fiction Eight Short",
        "Authors": "By Howe, Irving",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt, Brace & World",
        "Price Starting With ($)": "6.92",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Hoover's FBI",
        "Authors": "By Deloach, Cartha D.",
        "Description": "Written by the number three man in the FBI in the 1960s, a narrative sets the record straight about J. Edgar Hoover on major questions including the Kennedy and King assassinations and his alleged blackmailing of members of Congress. IP.",
        "Category": " Political Science , Law Enforcement",
        "Publisher": "Regnery Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The Downing Street Years",
        "Authors": "By Thatcher, Margaret",
        "Description": "A firsthand account of Thatcher's term as Britain's prime minister discusses her three election victories, the Falklands War, the Miners' Strike, the Brighton Bomb, the Westland Affair, and her relations with other nations and leaders. Reprint. $50,000 ad/promo.",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "Perennial",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Decline & Fall of Nazi Germany & Imperial Japan (R)",
        "Authors": "By Dollinger, Hans",
        "Description": "A pictorial history of the last one hundred days of the second World War covers the events on land, at sea, and in the air, and features documentary materials from the German, Japanese, and Allied sources in an accessible format.",
        "Category": " History , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "I Can (Baby Beginner Board Books)",
        "Authors": "By Oxenbury, Helen and Oxenbury, Helen (ILT)",
        "Description": "Helen Oxenbury's brilliant board books have delighted a generation of babies. Now from the most widely loved of artists comes a reissue of a board book to help very young children explore their worlds. In I CAN, a baby creates his own wonders as he jumps and stretches and dances. Full of character and humor, this charming book forms a winsome introduction to creativity and movement.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The New Joy of Sex (The Joy of Sex Series)",
        "Authors": "By Comfort, Alex",
        "Description": "A new edition of the best-selling classic guide to sex features completely redone illustrations, erotic duotone photographs, and a text that has been restructured to address today's health concerns. Reprint. 200,000 first printing.",
        "Category": " Self-help , Sexual Instruction",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "The Story of the Boston Tea Party: Cornerstones of Freedom",
        "Authors": "By Stein, R. Conrad",
        "Description": "Recounts the events leading up to the colonists' defiant act against the British known as the Boston Tea Party, which ultimately climaxed in the American Revolution.",
        "Category": "",
        "Publisher": "Childrens Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "Mr. Noisy (Mr. Men and Little Miss)",
        "Authors": "By Hargreaves, Roger",
        "Description": "They're back! Rediscover the zaniest characters you've ever met in this best-selling series which has sold millions worldwide. Bright and charming, with easily recognizable characters and a small take-along format,Mr. Men and Little Miss books are easy enough for young readers, witty enough for humor-prone adults, and highly collectible for one and all. Also check your local listings to view theMr. Men & Little Miss TV show.Back to the Mr. Men & Little Miss microsite.",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Bachelorette Party: A Novel",
        "Authors": "By Lutz, Karen Mccullah",
        "Description": "After being left at the altar by her soap star fiancé, L.A. high school teacher Zadie Roberts wants nothing to do with love and romance. Still, with the help of her best buddy, Grey, she may somehow overcome the wedding that wasn't. That is, until Grey gets engaged to Zadie's prim and proper cousin Helen, and Zadie is dragged back into wedding festivity hell. The coup de grâce is Helen's bachelorette party, thrown by her clique of prissy friends and certain to be a day of torture. But when the Pinor Grigio goes down and the sweater sets come off, things get out of control. Helen turns into a girl gone wild and manages to get herself into a sticky situation that just might sink the happy couple for good. And meanwhile, Zadie's own love life takes a most unexpected turn. Karen Lutz throws one bachelorette party you won't soon forget.",
        "Category": " Fiction , Women",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "101 Things I Wish I Knew When I Got Married: Simple Lessons to Make Love Last",
        "Authors": "By Bloom, Linda, Bloom, Charlie, Hendricks, Kathlyn (FRW), and Hendricks, Gay (FRW)",
        "Description": "With the current divorce rate spiking at a dizzying sixty percent, it is clear that young couples are not being taught the skills needed to navigate through the conflicts and difficulties of being in a committed relationship. Charlie and Linda Bloom, psychotherapists with fifty-five years of combined experience in relationship counseling, are acutely aware of this. For the last fifteen years the Blooms have been leading seminars on improving life relationships through their organization, The Empowerment Network. They’ve helped thousands of couples improve their most cherished relationships.Each lesson is presented as a simple, one-line thought followed by an explanation using real life examples, from Charlie and Linda’s personal experiences and the experiences of other couples. The Blooms share a wealth of experience with their readers. They demonstrate the universality of relationship issues and how anyone can find ways out of the pain that can engulf a relationship. By working through these ordeals, couples will enrich their relationships. The book makes it clear that, regardless of past experience, anyone can develop the basic strengths, skills and capacities needed for a great relationship.",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "New World Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Wildflowers (My first pocket guide)",
        "Authors": "By Delano, Marfe Ferguson",
        "Description": "",
        "Category": "",
        "Publisher": "National Geographic Society",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "DK Readers: Beastly Tales (Level 3: Reading Alone) (DK Readers Level 3)",
        "Authors": "By Yorke, Malcolm",
        "Description": "Do   these monsters really exist? Read the amazing true stories in this Level 3 DK   Reader—then decide for yourself!  Stunning photographs combine with lively illustrations and engaging, age-appropriate stories in DK Readers, a multilevel reading program guaranteed to capture children's interest while developing their reading skills and general knowledge. With DK Readers, children will learn to read—then read to learn!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "The Simple Truth: Making Sense of God, Life & Other Stuff",
        "Authors": "By Jafolla, Mary-Alice and Jafolla, Richard",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Unity",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Richard Scarry's Just Right Word Book (Classic Board Books)",
        "Authors": "By Scarry, Richard",
        "Description": "Two hundred illustrations are labeled with words, in this tale of another busy day in Busytown, where the Bunny family, Lowly Worm, and other characters go about their day.",
        "Category": " Juvenile Fiction , Concepts , Words",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Fancy Pants",
        "Authors": "By Phillips, Susan Elizabeth",
        "Description": "THEY'RE CAVIAR AND BEER. KEROSENE ON FIRE. AND THEY'RE FALLING HEAD-OVER-HEELS IN LOVE....  She was the most beautiful British bauble in Europe's jet-set playgrounds. Now she's broke, furious, and limping down a backwoods road in an ugly pink Southern Belle gown....  He was tall, lean, and all-American gorgeous. He liked his brews cold and women loved to keep him warm. Why in hell is he stopping his car for this woebegone, surly Scarlett?  Meet Francesca Day and Dallie Beaudine, two incredible characters whose tangled love affair is at the heart of this ravishing New York Times bestseller from award-winning author Susan Elizabeth Phillips. Come enjoy the adventure of a lifetime -- an irresistible story that's touching, hilarious, and hellcat-passionate. You'll never forget Dallie and the sassy lady who needs a good swift kick in her...",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "If It's Not One Thing, It's Your Mother",
        "Authors": "By Renfroe, Anita",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Navpress Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "DK Readers: The Story of Anne Frank (Level 3: Reading Alone)",
        "Authors": "By Lewis, Brenda Ralph and Ralph, Brenda Lewis",
        "Description": "Thirteen-year-old Anne Frank went into hiding from the Nazis with her family in 1942. Read the remarkable story of her life, death, and legacy. The 48-page Level 3 books, designed for children who can read on their own, contain more complex sentence structure and more detail. Young readers will devour these kid-friendly titles, which cover high-interest topics such as sharks, and the Bermuda Triangle, as well as classics like Aladdin. Information boxes highlight historical references, trivia, pronunciation, and other facts about words and names mentioned. Averaging 2,400 to 2,800 words, these books offer a 50/50 picture-to-text ratio. The Dorling Kindersley Readers combine an enticing visual layout with high-interest, easy-to-read stories to captivate and delight young bookworms who are just getting started. Written by leading children's authors and compiled in consultation with literacy experts, these engaging books build reader confidence along with a lifelong appreciation for nonfiction, classic stories, and biographies. There is a DK Reader to interest every child at every level, from preschool to grade 4.",
        "Category": " Juvenile Nonfiction , Readers , Intermediate",
        "Publisher": "DK Publishing, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Canadian Rockies (English Edition)",
        "Authors": "By Irving Weisdorf & Co",
        "Description": "",
        "Category": "",
        "Publisher": "Irving Weisdorf & Co Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "My Last Movie Star: A Novel of Hollywood",
        "Authors": "By Sherrill, Martha",
        "Description": "Allegra Coleman is young, beautiful, and destined for stardom. Clementine James is a jaded journalist who has been persuaded to write one last celebrity profile, a piece on Allegra for Flame magazine. But when their road-trip interview ends in a car crash, Allegra vanishes into thin air, and America goes into a frenzy of round-the-clock TV coverage, candlelight vigils, and miraculous sightings.Clementine becomes a celebrity by proxy—and while recovering from her injuries, she receives a series of ghostly visits from Natalie Wood, Clara Bow, Myrna Loy, Loretta Young, Gloria Swanson, and other screen sirens of the past. As Tallulah Bankhead tells her, “It’s agony, darling...bitter agony—watching everything slip away. Your looks. Your dough. Your mind. Your ass.” Has the missing Allegra escaped such a fate?To find out, Martha Sherrill takes Clementine on a riotous, often hilarious journey inside the hideaways of Hollywood stars and the hangouts of Manhattan’s power editors. Along the way, Sherrill captures the erotic jolt of celebrity and the way it affects the celebrated. My Last Movie Star is both a parody and parable of Hollywood, at once absurdly funny and weirdly plausible.",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Differentiate or Die: Survival in Our Era of Killer Competition",
        "Authors": "By Trout, Jack and Rivkin, Steve",
        "Description": "\"Any damn fool can put on a deal, but it takes genius, faith, and perseverance to create a brand.\"-David Ogilvy  In today's ultra-competitive world, the average supermarket has 40,000 brand items on its shelves. Car shoppers can wander through the showrooms of over twenty automobile makers. For marketers, differentiating products today is more challenging than at any time in history yet it remains at the heart of successful marketing. More importantly, it remains the key to a company's survival.  In Differentiate or Die, bestselling author Jack Trout doesn't beat around the bush. He takes marketers to task for taking the easy route too often, employing high-tech razzle-dazzle and sleight of hand when they should be working to discover and market their product's uniquely valuable qualities. He examines successful differentiation initiatives from giants like Dell Computer, Southwest Airlines, and Wal-Mart to smaller success stories like Streit's Matzoh and Connecticut's tiny Trinity College to determine why some marketers succeed at differentiating themselves while others struggle and fail.  More than just a collection of marketing success stories, however, Differentiate or Die is an in-depth exploration of today's most successful differentiation strategies. It explains what these strategies are, where and when they should be applied, and how they can help you carve out your own image in a crowded marketplace. Marketing executives in all types of organizations, regardless of size, can learn how to achieve product differentiation through strategies including: * Revisiting the U.S.P. Rosser Reeves's classic unique selling proposition approach, updated for today's marketplace * Positioning Understanding how the mind works in the differentiating process * Owning an Idea Techniques to seize a differentiating idea, dramatize it, and make it your own * Competition How to use differentiating ideas against your competitors in the marketplace  Consumers today are faced with an explosion of choices. In this environment, distinctive product attributes are quickly copied by competitors, perceived by consumers to be minimal, or both. Still, those who fail to differentiate their product or service in the mind of the consumer won't stand a chance.  Differentiate or Die outlines the many ways you can achieve differentiation. It also warns how difficult it is to achieve differentiation by being creative, cheap, customer oriented, or quality driven things that your competitors can do as well.  Praise for Differentiate or Die  \"Another great book by the king of positioning!\"-John Schnatter, CEO, Papa John's International  \"Differentiate or Die differentiates itself on the groaning marketing bookshelf with its lucid prose, its clear vision of the future marketplace . . . and its sensible solutions for surviving the frenzied competition we're sure to find there.\"-Dan Rather, CBS News  \"What I like about Differentiate or Die is the book's emphasis on the power of logic, simplicity, and clarity-getting to the essence of a problem. In Silicon Valley, attributes like that can make the difference between having lunch and being lunch.\"-Scott McNealy, CEO, Sun Microsystems, Inc.  \"Trout and Rivkin marvelously illustrate that differentiation is the cornerstone of successful marketing.\" -Philip Kotler, S.C. Johnson Distinguished Professor of International Marketing, Kellogg Graduate School of Management, Northwestern University  \"We've built our business by being first-and executing best. Jack Trout and Steve Rivkin are doing the same, delivering the timely, powerful insights that will drive tomorrow's marketing strategies. A must read for anyone looking to win in an unforgiving competitive marketplace.\"-Mike Ruettgers, CEO, EMC Corporation  \"Dotcom executives must learn the lessons of Differentiate or Die. If they don't, I pity their investors.\"-Aaron Cohen, CEO, Concrete Media; Co-Founder, Bolt.com",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "The Prophet    ISBN: 9780646266428",
        "Authors": "By Gibran, Kahlil",
        "Description": "One of America's most purchased and beloved books. An excellent gift for people of any age, full of wisdom and simple poetry, addressing twenty seven topics of our daily lives. Elegant paper back edition, enhanced by drawings of the renowned Aubrey Beardsley. An evergreen bestseller.",
        "Category": " Poetry , Subjects & Themes , Inspirational & Religious",
        "Publisher": "Natl Book Network",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "MARY TODAY: The Challenging Woman",
        "Authors": "By Pennington, M. Basil",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Collected Poems of Thomas Hardy ((Wordsworth Poetry Library))",
        "Authors": "By Hardy, Thomas",
        "Description": "",
        "Category": " Poetry , English, Irish, Scottish, Welsh",
        "Publisher": "Wordsworth Editions Ltd",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Disciplines of the Heart: Tuning Your Inner Life to God",
        "Authors": "By Ortlund, Anne",
        "Description": "",
        "Category": "",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "Poems of Inspiration & Comfort",
        "Authors": "By Harvey, Gail",
        "Description": "A collection of poems about loss, death, and eternity features works by Donne, Longfellow, Harriet Beecher Stowe, and others",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "North America's Freshwater Fishing Book",
        "Authors": "By Rosenthal, Mike and Wessel, Fred (ILT)",
        "Description": "Explains how to select rods, tackle, and flies, demonstrates spinning, bait, casting, and fly-fishing, and tells how and where to fish for bass, trout, salmon, perch, and other fish",
        "Category": " Sports & Recreation , Fishing",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "W.H. Auden: Selected Poems",
        "Authors": "By Auden, W. H. and Mendelson, Edward (EDT)",
        "Description": "This edition presents the original versions of many poems, which Auden revised to conform to his evolving political and literary attitudes later in his career. In this volume, Edward Mendelson has restored the early versions of some thirty poems generally considered to be superior to the later versions, allowing the reader to see the entire range of Auden's work. Selected and edited by Edward Mendelson",
        "Category": " Poetry , European , English, Irish, Scottish, Welsh",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Chernevog",
        "Authors": "By Cherryh, C. J.",
        "Description": "In spirit-haunted ancient Russia, Eveshka, a destructive ghost restored to life, seeks her mother, and Kavi Cherevog, freed from a binding stone slab, stretches forth his power and wizardry",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Sepulchre (Languedoc)",
        "Authors": "By Mosse, Kate",
        "Description": "October 1891: Seventeen-year-old Leonie Vernier and her brother, Anatole, abandon the gaslit streets of Paris for the sleepy mountain town of Rennes-les-Bains in southwest France. They've come at the invitation of their widowed aunt, whose estate, the Domaine de la Cade, is famous in the region. But their aunt, and the Domaine, are not what Leonie had imagined. Aunt Isolde is young, willowy, and beautiful, yet with a melancholy air that suits the slightly sinister Domaine. Leonie discovers that the isolated country house and its ancient forests have long been the subject of local superstition; when she stumbles across a ruined Visigoth sepulchre, she unwittingly involves herself with the timeless mystery of this eerie place, which may be spelled out in a strange pack of tarot cards that is rumored to hold the power of life and death. While Leonie delves deeper into the secrets of the Domaine, a different evil stalks her family - one that may explain why Leonie and Anatole were invited to Rennes-lesBains in the first place.October 2007: More than a century later, Meredith Martin, an American graduate student, arrives in Rennes-les-Bains, She checks into a grand old hotel - the Domaine de la Cade - and almost instantly, strange dreams and visions begin to haunt her waking hours. A chance encounter leads her to a pack of tarot cards painted by Leonie Vernier, which may hold the key to this twenty-first-century American's fate ... and explain the ties that bind the two women together.As the Feast of All Saints approaches - when the veil between life and death is thinnest - Meredith is drawn inexorably to a secluded forest glade where the secrets of the past are far from buried.",
        "Category": " Fiction , Literary",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Delicious and Dependable Slow Cooker Recipes",
        "Authors": "By Finlayson, Judith",
        "Description": "Slow cookers have been rediscovered by a whole new generation of busy people. The reason is quite simple: imagine being able to throw some wholesome ingredients into a cooker, close the lid and come home to a hot, satisfying meal at the end of the day. A perfect mealtime solution! However, every memorable meal begins with innovative and creative recipes. In Delicious and Dependable Slow Cooker Recipes, you will discover mouthwatering recipes that allow you to create outstanding meals with a  minimum of effort. This extensive collection of over 175 recipes contains a wide range of dishes from starters to soups, beef to seafood, and even desserts. Whether you're serving a weekday meal to your family or entertaining special guests, there's a recipe here to delight and satisfy everyone.    Here are just some of the delicious and dependable recipes you can enjoy: Spicy Artichoke Dip, Peppercorn            Pâté, Creamy Corn Chowder, Mulligatawny Soup, Classic Beef Stew, Sauerbraten, Saucy Pork Chops with Cranberries, Chicken in Onion Buttermilk Gravy, Mussels in Lemongrass Tomato Broth, Turkey and Sausage Chili, Tomato Mushroom Lasagna, Cider Baked Beans, Hot Breakfast Cereals, Double Chocolate Raspberry Cheesecake, Apricot Almond Pudding.    over 175 recipes for everything from appetizers to desserts  more than 50 full color photographs  helpful pantry notes  vegetarian recipes  extensive tips and techniques for foolproof results  make ahead ideas  recipes for every occasion",
        "Category": " Cooking , Methods , Special Appliances",
        "Publisher": "Robert Rose",
        "Price Starting With ($)": "5.74",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Gourmet Slow Cooker: Volume II, Regional Comfort-Food Classics",
        "Authors": "By Alley, Lynn",
        "Description": "With its emphasis on quality ingredients, nuanced global flavors, and sumptuous presentation, the original GOURMET SLOW COOKER inspired discerning home cooks to dust off-and fall in love with-their slow cookers again. Back by popular demand, Lynn Alley serves a generous second helping of sophisticated yet easy-to-prepare slow-cooker recipes, this time with a focus on regional comfort food. Packed with classic and innovative dishes designed to delight family and guests alike, THE GOURMET SLOW COOKER: VOLUME II will satisfy fans' hunger for new recipes-and encourage even more busy home cooks to join the bandwagon.ReviewsRecommended for \"the cook who wants ease, but with more flavor than the bland crock-pot cuisine your mother made.\"-Portland Oregonian",
        "Category": " Cooking , Methods , Special Appliances",
        "Publisher": "Ten Speed Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Beer Is Better Than Women Because...",
        "Authors": "By Donna E. Hanbery, Ivor Matz, Tam and Cra",
        "Description": "",
        "Category": "",
        "Publisher": "Ivory Tower Publishing Co, Watertown, MA",
        "Price Starting With ($)": "6.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Friends to the End: The True Value of Friendship",
        "Authors": "By Greive, Bradley Trevor",
        "Description": "",
        "Category": "",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Marketing Mistakes",
        "Authors": "By Hartley, Robert F.",
        "Description": "This edition now contains both notable marketing blunders and well-known successes. There are 15 new cases, including those dealing with the challenges of entrepreneurship. Updated Information Boxes and Issue Boxes are featured in every chapter to highlight relevant marketing concepts. Discussion questions and role-playing exercises are also included.",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Praying the Names of God: A Daily Guide",
        "Authors": "By Spangler, Ann",
        "Description": "A twenty-six-week devotional study by the bestselling coauthor of Women of the BibleNames in the ancient world did more than simply distinguish one person from another, they often conveyed the essential nature and character of a person. This is especially true when it comes to the names of God recorded in the Bible. Praying the Names of God explores the primary names and titles of God in the Old Testament to reveal the deeper meanings behind them. El Shadday, Elohim, Adonay, Abba, El Elyon—God Almighty, Mighty Creator, Lord, Father, God Most High—these are just a few of the names and titles of God that yield rich insights into his nature and character. Praying the Names of God shows readers how to study and pray God’s names by focusing each week on one of the primary names or titles of God. • Monday—readers study a portion of Scripture that reveals the name. • Tuesday–Thursday—readers pray specific Scripture passages related to the name. • Friday—readers pray Scripture promises connected to the name. By incorporating the divine names and titles into their prayers—and learning about the biblical context in which the name was revealed—readers will gain a more intimate understanding of who God is and how he can be relied on in every circumstance of their lives.Praying the Names of God is a unique devotional, one that offers a rich program of daily prayer and study designed to lead people into fresh encounters with the living God. The book is also available as an Abridged Audio Pages® CD.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Moongate",
        "Authors": "By Proctor, William and Weldon, David J.",
        "Description": "A historic international space mission explodes with crimes and crises after scientists, engaged in a moon-mining expedition, receive information from outer space about how to reverse the aging process. Corporate espionage, murders, political assassinations, and finally, the threat of a new Cold War follow a revolutionary message on the human genome from mysterious and possibly demonic beings from another dimension. U.S. Representative Scott Andrews begins to doubt the motives of these \"benign\" messengers and suspects that they harbor designs of biblical proportions against the entire earth. This political/sci-fi/spiritual thriller pulls the reader onto a roller-coaster plot, with twists and turns through cutting-edge space and energy technology, genetic manipulation, back-room political machinations, and international intrigue on the highest levels.",
        "Category": " Fiction , Religious",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Payback",
        "Authors": "By Kelly, Thomas",
        "Description": "New York City in the boomtown 1980s: land values skyrocketing, new buildings going up on every block, fortunes being made overnight - and extorted in the morning. On the streets of Hell's Kitchen, the construction rackets are in the hands of the Irish mob. It's always been their turf; now it's their time. And the stakes are higher than ever before - which explains the sudden interest in the Irish on the part of both the Mafia and the feds (led by a female agent trapped by the necessity to prove what she is clearly capable of), and the growing struggle for position and profit within the mob itself, an internecine war that finally ignites in the back rooms and broad daylight of the neighborhood.At the heart of the story are the Adare brothers: Paddy, a failed boxer turned mob henchman who's never left the streets he grew up on and who, at thirty-two, is beginning to pay the price for years of living large; and Billy, a college graduate, back home for the summer to work in the tunnels as a sandhog before he enters law school and gets himself out of the old neighborhood and in on the American dream - brothers divided by everything but their powerful blood-tie. Now, as their paths converge on familiar streets in a cross fire of greed, treachery, and violence, their loyalties - to family, friends, neighborhood, and, most important, each other - will be put to a brutal and profoundly telling test.",
        "Category": " Fiction , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Family Passover",
        "Authors": "By Rosen, Anne",
        "Description": "Photographs and ten-year-old Anne's narration tell the story of one family's preparation for and celebration of the Jewish holiday, Passover, which commemorates the Jews flight from Egypt",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Jewish Pubn Society",
        "Price Starting With ($)": "13.47",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "PRESTON FALLS: A Novel",
        "Authors": "By Gates, David",
        "Description": "\"Beautifully written.... Gates [has a] pitch-perfect ear for contemporary speech...and...[a] keen, journalistic eye.\"--Michiko Kakutani,The New York TimesIn this comic, fiercely compassionate novel, David Gates, whose first novel Jernigan was a finalist for the Pulitzer Prize, sends his protagonist on a visceral journey to the dark side of suburban masculinity, explores the claims youth makes on middle age, and the tenacious --at times perverse--power of love to assert itself.When Doug Willis has a mid-life crisis, he doesn't join a gym or have an affair. Instead he gets himself arrested while camping with his wife and kids, takes a two month leave of absence from his PR job, and retreats to his farmhouse in rural Preston Falls--where he plugs in his guitar and tries to shut out his life.While his wife, Jean, struggles to pay the bills and raise their sullen, skeptical kids, Willis's plans for hiatus crumble into Dewars-and-cocaine fueled disarray. A shattered window, an unguarded gun, and a shady small town attorney force a crisis--and Willis can't go home again. With its biting humor and harsh realism, Preston Falls confirms David Gates as a talent in the tradition of Russell Banks and Richard Ford: a master of dark truths and private longings.",
        "Category": " Fiction , Literary",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Invasion of the Road Weenies: and Other Warped and Creepy Tales (Weenies Stories)",
        "Authors": "By Lubar, David",
        "Description": "Invasion of the Road Weenies, a collection of warped and creepy tales ranging from the silly and offbeat to flat-out horrifying from the  award-winning storyteller and master of the macabre, David Lubar    A town is overrun by road weenies—a.k.a. joggers—who never smile. A girl thinks she's too old for Halloween...until she finds a special pair of gloves. A boy takes a shortcut to an unexpected place. A mummy takes his revenge, one little piece at a time.... Welcome to the weird and wacky world of award-winning storyteller and master of the macabre, David Lubar. These thirty-five tales ranging from the silly and offbeat to flat-out horrifying are just right for reading alone or for telling aloud in the dark. As an added bonus at the end of the book, David answers the question most frequently asked of writers with a behind-the-scenes look at the various ways he got the ideas for the stories in this collection. Don't be a weenie. Read these stories. If you dare!",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "Starscape",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Angels A to Z: A Who's Who of the Heavenly Host",
        "Authors": "By Bunson, Matthew",
        "Description": "Amid the veritable choirs of popular angel books, this is the only one that offers factual information on every facet of angel lore. Here at last is a detailed reference for anyone who wants to finally get the straight dope on all aspects of angel arcana. 40 photos.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Keeping Your Teen in Touch With God: Why Teens Turn Away from the Church and How You Can Prevent It",
        "Authors": "By Laurent, Robert",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "David C. Cook",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Anthology of Poetry by Young Americans 1996",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Anthology of Poetry",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "City of Shadows",
        "Authors": "By Franklin, Ariana",
        "Description": "A cultured city scarred by war. . . . An eastern émigré with scars and secrets of her own. . . . A young woman claiming  to be a Russian grand duchess. . . . A brazen killer, as vicious as he is clever. . . . A detective driven by decency and the desire for justice.. . . A nightmare political movement steadily gaining power. . . . This is 1922 Berlin.One of the troubled city's growing number of refugees, Esther Solomonova survives by working as secretary to the charming, unscrupulous cabaret owner \"Prince\" Nick, and she's being drawn against her will into his scheme to pass a young asylum patient off as Anastasia, the last surviving heir to the murdered czar of all Russia. But their found \"princess,\" Anna Anderson, fears that she's being hunted—and this may turn out to be more than paranoia when innocent people all around her begin to die.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Yeats Is Dead! A Mystery by 15 Irish Writers",
        "Authors": "By Doyle, Roddy (EDT) and O'Connor, Joseph (EDT)",
        "Description": "\"I think he was dead before I shot him.\"With these auspicious words begins a murder mystery so utterly unlike any other that it took fifteen of Ireland's finest writers (working well below their peak) to bring it to its unlikely conclusion. The plot involves a mad search for the only manuscript of an unpublished novel by James Joyce, and features a stellar cast - including a sadistic sergeant with the unlikely name of Andy Andrews and the unforgettable mob boss Mrs. Bloom, a woman \"who had tried everything but drew the line at honesty.\"Yeats Is Dead! is a novel written by fifteen Irish authors as a fund-raiser for Amnesty International, a worldwide grassroots movement that promotes and defends human rights.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Grammar Smart (The Princeton Review)",
        "Authors": "By Goddin, Nell and Palma, Erik (EDT)",
        "Description": "This handbook of perfect grammar solves sticky grammatical dilemmas, such as \"Joe and I or Joe and me,\" \"further or farther,\" and \"that or which.\" Original. 35,000 first printing.",
        "Category": " Language Arts & Disciplines , Grammar & Punctuation",
        "Publisher": "Princeton Review",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Faith and Treason",
        "Authors": "By Fraser, Antonia",
        "Description": "In England, November 5 is Guy Fawkes Day, when fireworks displays commemorate the shocking moment in 1605 when government authorities uncovered a secret plan to blow up the House of Parliament - and King James I along with it. A group of English Catholics, seeking to unseat the king and reintroduce Catholicism as the state religion, daringly placed in position thirty-six barrels of gunpowder in a cellar under the Palace of Westminster. Their aim was to ignite the gunpowder at the opening of the parliamentary session. Though the charismatic Catholic Robert Catesby was the group's leader, it was the devout Guy Fawkes who emerged as its most famous member, as he was the one who was captured and who revealed under torture the names of his fellow plotters. In the aftermath of their arrests, conditions grew worse for English Catholics, as legal penalties against them were stiffened and public sentiment became rabidly intolerant.In a narrative that reads like a gripping detective story. Antonia Fraser has untangled the web of religion, politics, and personalities that surrounded that fateful night of November 5. And in examining the lengths to which individuals will go for their faith, she finds in this long-ago event a reflection of the religion-inspired terrorism that has produced gunpowder plots of our own time.",
        "Category": " History , Europe , Great Britain , General",
        "Publisher": "Nan A. Talese",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Dear God, Guess Waht . . . I'm Ready to Listen Now",
        "Authors": "By Annie Fitzgerald",
        "Description": "",
        "Category": "",
        "Publisher": "Flying Frog Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Lady in Blue",
        "Authors": "By Sierra, Javier",
        "Description": "An elaborately woven novel of intrigue about one of America's most curious and enduring legends -- the enigma of the Lady in BlueIn Los Angeles, Jennifer Narody has been having a series of disturbingdreams involving eerie images of a lady dressed in blue. What she doesn't know is that this same spirit appeared to leaders of the Jumano Native American tribe in New Mexico 362 years earlier, and was linked to a Spanish nun capable of powers of \"bilocation,\" or the ability to be in two places simultaneously. Meanwhile, young journalist Carlos Albert is driven by a blinding snowstorm to the little Spanish town of Ágreda, where he stumbles upon a nearly forgotten seventeenth-century convent founded by this same legendary woman. Intrigued by her rumored powers, he delves into finding out more. These threads, linked by an apparent suicide, eventually lead Carlos to Cardinal Baldi, to an American spy, and ultimately to Los Angeles, where Jennifer Narody unwittingly holds the key to the mystery that the Catholic Church, the U.S. Defense Department, and the journalist are each determined to decipher -- the Lady in Blue.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "The Substance of Style: How the Rise of Aesthetic Value Is Remaking Commerce, Culture, and Consciousness",
        "Authors": "By Postrel, Virginia",
        "Description": "From airport terminals decorated like Starbucks to the popularity of hair dye among teenage boys, one thing is clear: we have entered the Age of Aesthetics. Sensory appeals are everywhere, and they are intensifying, radically changing how Americans live and work. We expect every strip mall and city block to offer designer coffee, a copy shop with do-it-yourself graphics workstations, and a nail salon for manicures on demand. Every startup, product, or public space calls for an aesthetic touch, which gives us more choices, and more responsibility. By now, we all rely on style to express identity. And aesthetics has become too important to be left to the aesthetes.In this penetrating, keenly observed book, Virginia Postrel shows that the \"look and feel\" of people, places, and things are more important than we think. Aesthetic pleasure taps deep human instincts and is essential for creativity and growth. Drawing from fields as diverse as fashion, real estate, politics, design, and economics, Postrel deftly chronicles our culture’s aesthetic imperative and argues persuasively that it is a vital component of a healthy, forward-looking society. Intelligent, incisive, and thought provoking, The Substance of Style is a groundbreaking portrait of the democratization of taste and a brilliant examination of the way we live now.",
        "Category": " Philosophy , Aesthetics",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Coming Internet Depression Why The High-tech Boom Will Go Bust, Why The Crash Will Be Worse Than You Think, And How To Prosper Afterwards",
        "Authors": "By Mandel, Michael J.",
        "Description": "The economist most renowned for predicting the New Economy of the 1990s now returns-just as books like The Long Boom and Dow 36,000 are turning the idea of perpetual prosperity into conventional wisdom-to say that the dominating economic event of the next few years is likely to be a deep recession, perhaps even a depression. Michael J. Mandel begins The Coming Internet Depression by explaining why just such a depression is not only possible but increasingly likely. His explanation is based in a comparison of the present period with the 1920s: both saw tremendous growth in GDP that was largely centered on the \"hypergrowth\" of a single industry-automobiles in the 1920s, information technology today. When this \"hypergrowth\" reverts to a normal growth pattern, as the automobile industry did in 1929, the resulting overcapacity will slow down the entire economy. Mandel addresses three key questions: When will the Internet Depression start? How will we know when it's coming? How bad will it be? Finally, he shows how investors, workers, and businesses can navigate the bad times safely and prosper in the long recovery that will follow.",
        "Category": " Business & Economics , Forecasting",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The 21 Most Powerful Minutes In A Leader's Day: Revitalize Your Spirit And Empower Your Leadership",
        "Authors": "By Maxwell, John C.",
        "Description": "In the spirit of his best-selling The 21 Irrefutable Laws of Leadership and The 21 Indispensable Qualities of a Leader, John Maxwell offers thoughts on proven leadership qualities and crucial issues that affect leadership success.  These basic principles of success can be applied to business and private life, helping anyone reach their full potential.  Twenty-one powerful statements help leaders maximize their assets and overcome their weaknesses, encouraging them to lead with their hearts as well as their minds.  Daily readings include sections which help readers integrate and apply each day's material.",
        "Category": " Religion , Devotional",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Gilgamesh: A Verse Narrative",
        "Authors": "By Mason, Herbert",
        "Description": "Herbert Mason's best-selling Gilgamesh is the most widely read and enduring interpretation of this ancient Babylonian epic. One of the oldest and most universal stories known in literature, the epic of Gilgamesh presents the grand, timeless themes of love and death, loss and reparations within the stirring tale of a hero-king and his doomed friend. A finalist for the National Book Award, Mason's retelling is at once a triumph of scholarship, a masterpiece of style, and a labor of love that grew out of the poet's long affinity with the original.",
        "Category": " Poetry , Ancient & Classical",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "China: Its History and Culture",
        "Authors": "By Morton, W Scott",
        "Description": "A concise, illustrated survey of Chinese religion, philosophy, art, dynastic courts, militarism, and agriculture from ancient times to the present also considers those aspects of Chinese culture transformed by the Revolution of 1949",
        "Category": "",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Blessing: A Study Guide for Small Groups (LifeChange)",
        "Authors": "By Smalley, Gary and Trent, John",
        "Description": "The Blessing’s powerful message has helped thousands find emotional healing and experience restored relationships with God, family, and friends. InThe Blessing Study Guide you will find all the key principles. IncludesSelf-testsApplication-oriented exercisesDiscussion questions for small group or individual study",
        "Category": " Self-help , General",
        "Publisher": "NavPress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Bible Clues for the Clueless: God's Word in Your World",
        "Authors": "By Smith, Carol, Hudson, Christopher D., and Weidemann, Valerie",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Becoming a Woman of Faith",
        "Authors": "By Heald, Cynthia",
        "Description": "What does it mean to be a woman of faith?  Is it having the right Bible verse in your back pocket or a religious quotation ready for any occasion?  Cynthia Heald offers a richer perspective on the true meaning of a woman of faith.  From facing challenging circumstances to being real before God, Becoming a Woman of Faith is a Bible study that helps women learn what it means to walk with faith in the real world and honor Christ with their lives.  This newest book in the best-selling Bible study series for women offers quotations from classic Christian writers and key Scripture passages with questions for reflection and study, and Cynthia Heald's warm and personable style.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Free Publicity: A TV Reporter Shares the Secrets for Getting Covered on the News",
        "Authors": "By Crilley, Jeff",
        "Description": "",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "Brown Books Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "30 Days to a Simpler Life",
        "Authors": "By Cox, Connie and Evatt, Cris",
        "Description": "Connie Cox and Cris Evatt, the authors of Simply Organized have teamed up once again and created a new step-by-step guide to simplifying your life in only thirty days. Organized in a day-by-day format, the book offers simple steps which take in an hour or less to cut down on clutter. Each section is followed by instructions for more in-depth simplifying each area (one's workplace, closets, vacation, or errand routines, a cluttered mind, and more), and a tip checklist is included for readers interested in \"maximum simplification.\" Written in an inspirational style and a clear, down-to-earth format,30 Days To A Simpler Life contains adages, anecdotes, and quotes from philosophers, designers, psychologists, financial planners, and other experts. The authors also include a guide to related books, newsletters, and websites to further assist readers in reaching their goal of simpler living",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The Westing Game (Puffin Modern Classics)",
        "Authors": "By Raskin, Ellen",
        "Description": "A Newbery Medal Winner\"A supersharp mystery...confoundingly clever, and very funny.\" 'Booklist, starred review A bizarre chain of events begins when sixteen unlikely people gather for the reading of Samuel W. Westing's will. And though no one knows why the eccentric, game-loving millionaire has chosen a virtual stranger'and a possible murderer'to inherit his vast fortune, on things for sure: Sam Westing may be dead'but that won't stop him from playing one last game! Winner of the Newbery Medal Winner of the Boston Globe/Horn Book Award An ALA Notable Book   \"Great fun for those who enjoy illusion, word play, or sleight of hand.\" 'The New York Times Book Review\"A fascinating medley of word games, disguises, multiple aliases, and subterfuges'a demanding but rewarding book.\" 'The Horn Book",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The 150 Best Slow Cooker Recipes",
        "Authors": "By Finlayson, Judith",
        "Description": "Slow Cookers are the ideal appliance for today's lifestyle because they make meal preparation so manageable. An indispensable assistant, a slow cooker will help you prepare delicious food that requires a minimum of attention, while ensuring a maximum of success. But the recipes are key. In The 150 Best Slow Cooker Recipes, you'll find superb recipes that will exceed your expectations for not only preparing everyday meals, but also for entertaining -- from casual Friday nights to even the most challenging special occasions,    Everyone wants food that is easy and flavorful, whether it's an old favorite that evokes fond memories such as Classic Boeuf Bourguignon, Shepherd's Pie with Creamy Corn Filling or Pineapple Upside-Down Spice Cake. New taste sensations that reflect today's globalized world can be found in Pumpkin Soup with Shrimp and Lime,            Stuffed Pot Roast in Cumin-Flavored Gravy or Thai-Style Coconut Flan. Old standards or new classics, The 150 Best Slow Cooker Recipes has an abundance of appetizing and dependable recipes.    150 Recipes -- 50+ Color Photographs  Dependable Tips and Techniques  Appetizers to Desserts  Make Ahead Ideas",
        "Category": " Cooking , Methods , Special Appliances",
        "Publisher": "Robert Rose",
        "Price Starting With ($)": "5.74",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Aristotle's Poetics (Dramabook,)",
        "Authors": "By Aristotle",
        "Description": "Introduced by Francis Fergusson, the Poetics, written in the fourth century B.C., is still an essential study of the art of drama, indeed the most fundamental one we have. It has been used by both playwrights and theorists of many periods, and interpreted, in the course of its two thousand years of life, in various ways. The literature which has accumulated around it is, as Mr. Fergusson points out, \"full of disputes so erudite that the nonspecialist can only look on in respectful silence.\" But thePoetics itself is still with us, in all its suggestiveness, for the modern reader to make use of in his turn and for his own purposes.Francis Fergusson's lucid, informative, and entertaining Introduction will prove invaluable to anyone who wishes to understand and appreciate the Poetics. Using Sophocles'Oedipus Rex, as Aristotle did, to illustrate his analysis, Mr. Fergusson pints out that Aristotle did not lay down strict rules, as is often thought: \"ThePoetics,\" he says, \"is much more like a cookbook than it is like a textbook of elementary engineering.\" Read in this way, it is an essential guide not only to Sophoclean tragedy, but to the work of so modern a playwright as Bertolt Brecht, who considered his own \"epic drama\" the first non-Aristotelian form.",
        "Category": " Literary Criticism , Drama",
        "Publisher": "Hill and Wang",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "What I Loved: A Novel",
        "Authors": "By Hustvedt, Siri",
        "Description": "Siri Hustvedt's What I Loved begins in New York in 1975, when art historian Leo Hertzberg discovers an extraordinary painting by an unknown artist in a SoHo gallery. He buys the work; tracks down the artist, Bill Wechsler; and the two men embark on a life-long friendship. Leo's story, which spans twenty-five years, follows the growing involvement between his family and Bill's--an intricate constellation of attachments that includes the two men, their wives, Erica and Violet, and their sons, Matthew and Mark.The families live in the same New York apartment building, rent a house together in the summers and keep up a lively exchange of ideas about life and art, but the bonds between them are tested, first by sudden tragedy, and then by a monstrous duplicity that slowly comes to the surface. A beautifully written novel that combines the intimacy of a family saga with the suspense of a thriller, What I Loved is a deeply moving story about art, love, loss, and betrayal.",
        "Category": " Fiction , Literary",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Winning Edge: Nutrition for Athletic Fitness and Performance",
        "Authors": "By Addleman, Frank G.",
        "Description": "The Winning Edge is the first nutrition book that's both scientifically sound and practical. In clear layman's language it shows you how the right choice of food can dramatically improve your athletic fitness and performance...and help prevent problems like obesity and heart disease.  Whether you're an athlete or a coach, a weekend jogger or a dieter -- or someone who just wants to become more fit -- you'll find here a total nutrition program to help you achieve your highest goal without endangering your health. Based on the latest scientific research and the most up-to-date nutritional information, this book shows you what combination of nutrients -- fats, proteins, carbohydrates, vitamins, and minerals -- best prepares you for physical activity and helps you through the activity when you're in the middle of it.  You'll also learn: * why weight control is a major factor in your health and performance * the best ways to lose excess fat * how to take in fewer calories without eating less food * the hazards of food additives * what foods to avoid -- and why * what water can do for your performance * what to eat before you compete * and much more.  With frequently asked questions at the end of each chapter, The Winning Edge provides all the nutritional information you'll ever need, in language that gets straight to the point.",
        "Category": " Sports & Recreation , Track & Field",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "2194 Days of War",
        "Authors": "By Salmaggi, Cesare",
        "Description": "",
        "Category": "",
        "Publisher": "Mayflower Books",
        "Price Starting With ($)": "10.24",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "The Greatest Player Who Never Lived: A Golf Story",
        "Authors": "By Veron, Michael and Veron, J. Michael",
        "Description": "",
        "Category": " Fiction , Sports",
        "Publisher": "Sleeping Bear Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Kate Vaiden",
        "Authors": "By Price, Reynolds",
        "Description": "Now in her mid-fifties, Kate Vaiden recalls her early life growing up, after the violent death of her parents, an orphan in small towns in North Carolina and Virginia in the 1930s and 1940s",
        "Category": " Fiction , Literary",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "Uncle John's Biggest Ever Bathroom Reader",
        "Authors": "By Bathroom Readers' Institute (COR)",
        "Description": "Sit down and relax with Uncle John's Biggest Ever Bathroom Reader. This hardcover edition of the bathroom reading series will bowl you over. No more frantic searches at the last minute for that perfect magazine. No more agonizing choices between light reading and serious stuff. This biggest ever volume has combined two previous Bathroom Readers in their entirety, Uncle John's Great Big Bathroom Reader and Uncle John's Ultimate Bathroom Reader. It has more entertainment, humor, trivia, science, history, and pop culture than ever before. Among lots of other topics, you can read about:  * Why the White House is White* Strange Medical Conditions* The History of the Bra* The Origin of the Miss America Pageant* Weird Tales of the Ouija Board* The Hair Museum* Why Thanksgiving is in November* Why Popcorn Pops* The Origin of Pop Tarts.  Its all there in Uncle John's Biggest Ever Bathroom Reader!",
        "Category": " Reference , Trivia",
        "Publisher": "Thunder Bay Press",
        "Price Starting With ($)": "6.33",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Shark Attack!: Greg Norman's Guide to Aggressive Golf",
        "Authors": "By Peper, George and Norman, Greg",
        "Description": "",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Neighbor Law: Fences, Trees, Boundaries and Noise (Neighbor Law: Fences, Trees, Boundaries & Noise)",
        "Authors": "By Jordan, Cora",
        "Description": "Neighbor Law clearly explains the laws regarding common disputes between neighbors and shows you what to do about trees that hang over a property line, noisy neighbors, unclear boundary lines, blocked views, high or unsightly \"spite\" fences, tensions between farmers and residential neighbors, dangerously deteriorating fences, and dangers to children (attractive nuisances).",
        "Category": "",
        "Publisher": "Nolo.com",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "World Atlas of Wine Rev Ptg 1981",
        "Authors": "By Johnson, Hugh",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster Books",
        "Price Starting With ($)": "7.88",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "Fit For Excellence: God's design for spiritual, emotional, and physical health",
        "Authors": "By Shepherd, Sheri Rose",
        "Description": "Sheri Rose Shepherd was overweight, depressed, and emotionally distraught from an eating disorder when she discovered God's design for spiritual and physical health. In Fit for Excellence she not only shares the biblical principles for losing weight, but also for gaining a self-image based on Christ's image of you. In a sometimes humorous, and always engaging style, Sheri Rose offers in this book the same life-changing message she's shared with tens of thousands of women across the country in her Fit for Excellence conferences and seminars. Thousands of women have already been set free from:Food addictions * Eating Disorders * Depression * Poor self-image * Emotional pain * Chronic fatigue and exhaustionJoin Sheri Rose in her journey toward freedom from dieting and emotional distress through the Bible. Fit for Excellence is also ideal for small groups and Bible studies as it includes interactive notes and a leader's guide.",
        "Category": " Health & Fitness , Health Care Issues",
        "Publisher": "Siloam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Things Are Looking Up... : A For Better or for Worse Collection",
        "Authors": "By Johnston, Lynn",
        "Description": "More family antics from the annals of \"For Better or For Worse\"--the sensitive comic strip that deals with marriage, parenting, elderly parents, and youngsters. Original.",
        "Category": " Humor , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Love Just Screws Everything Up : A For Better or for Worse Collection (Volume 17)",
        "Authors": "By Johnston, Lynn",
        "Description": "Elly and John Patterson, along with their children Michael, Elizabeth, and April, make up one of the most beloved families in America. The clan from For Better or For Worse is not only recognized, their lives are studied, identified with, and, most of all, treasured for the amusing reflections they provide.  Perhaps it's seeing part of ourselves in this familial five—something that makes them so endearing. Maybe it's the good old-fashioned values they display. No matter what her secret, creator Lynn Johnston excels, once again, with this collection, Love Just Screws Everything Up, that gives us a chance to grow even closer to the Pattersons and their devoted dog, Edgar.  This collection of heartwarming and humorous vignettes traces the Pattersons as they toil and traipse through their daily existence—lives much like our own, amplified by Johnson's insightful take on the extraordinarily funny things that happen to ordinary people. For example, we watch as Elly, seemingly stuck in bumper-to-bumper traffic, uses her cell-phone to call the office—while actually waiting to give her drive-up donut order. Or there's John scolding his girls during a fishing trip for wasting the live bait, only to have a gull grab his next cast in mid-air.  No matter what their situation, no matter what their challenges, the Pattersons always come through with smiles—at least on their readers' faces. This creative collection, Love Just Screws Everything Up, is sure to captivate all fans of cartooning's first family.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Never Wink at a Worried Woman: A For Better or For Worse Collection (Volume 30)",
        "Authors": "By Johnston, Lynn",
        "Description": "'The comics pages have no shortage of family strips, but For Better or For Worse distinguished itself from the start. . . . This success can be attributed to Johnston's uncanny ability to see into the heart of daily life so accurately that readers feel she is speaking directly to them.\"Art imitating life. That's what happens in Lynn Johnston's perennially popular comic strip,For Better or For Worse. By reflecting on her own family and experiences, she created the Pattersons: Elly, John, Michael, Elizabeth, and April, along with grandparents, grandchildren, friends, and coworkers and the everyday situations they deal with.In Never Wink at a Worried Woman, life is progressing for each character. Elly and John tenuously think of retirement while still being preoccupied parents of a preteen. Michael and Deanna grow into their roles as new parents while Michael's career gets a new boost. Elizabeth takes more steps to adulthood, by beginning her student teaching and facing the fact that Anthony is marrying another. April is racing to turn 13, busy with her band and also helping out at Lilliput's, where she makes a painful discovery about a coworker. Add in Grampa Jim's quest to maintain his aging dignity and baby Meredith's burgeoning curiosity, and you get a full dose of life.For Better or For Worse has appealed to readers for more than 25 years. It runs in more than 2,000 newspapers in the U.S., Canada, and 20 other countries and is translated into eight languages besides English.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "There Goes My Baby (A for Better or Worse Collection)",
        "Authors": "By Johnston, Lynn",
        "Description": "Cartoons offer a humorous look at family life, adolescence, grandparents, toddlers, and other subjects",
        "Category": " Humor , General",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2013"
        }
    },
    {
        "Title": "Japanese for Busy People",
        "Authors": "By Association for Japanese-Language Teaching",
        "Description": "",
        "Category": "",
        "Publisher": "Kodansha Amer Inc",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Math in My World: Developing Problem Solvers, Grade 3",
        "Authors": "By Math99",
        "Description": "",
        "Category": "",
        "Publisher": "Schools",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "The Dave Matthews Band: Step into the Light",
        "Authors": "By Delancey, Morgan",
        "Description": "Traces the life and career of the members of the Dave Matthews Band, and describes their experiences on the road",
        "Category": "",
        "Publisher": "E C W Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Better Homes and Gardens Step-by-Step Kids' Cook Book (Better Homes and Gardens Books)",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "Shares simple recipes for sandwiches, biscuits, breads, beverages, vegetables, main dishes, and desserts, and offers suggestions for breakfast, lunches, and picnics",
        "Category": " Cooking , General",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Games for Reading: Playful Ways to Help Your Child Read",
        "Authors": "By Kaye, Peggy",
        "Description": "HERE ARE OVER SEVENTY GAMES TO HELP YOUR CHILD LEARN TO READ--AND LOVE IT.Peggy Kaye's Games for Reading helps children read by doing just what kids like best: playing games.  There is a \"bingo\" game that helps children learn vocabulary. There is a rhyming game that helps them hear letter sounds more accurately. There are mazes and puzzles, games that train the eye to see patterns of letters, games that train the ear so a child can sound out words, games that awaken a child's imagination and creativity, and games that provide the right spark to fire a child's enthusiasm for reading. There are games in which your child has to act silly and games--sure to be any child's favorite--in which you do.Easy to follow and easy to play, these games are ideal for busy, working parents. You can read a game in a few minutes and start to play right away. You can play on car trips, while doing the laundry, or while cooking. These games are so much fun for the whole family that you may forget their serious purpose.  But they will help all beginning readers--those who have reading problems and those who do not--learn to read and want to read.Games for Reading also includes a list of easy-to-read books and books for reading aloud, and a \"Note to Teachers\" on how to play these games in their classrooms.",
        "Category": " Education , Teaching Methods & Materials , Reading & Phonics",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Better Homes and Gardens Low-Fat Cooking",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "Better Homes and Gardens All-Time Favorite Fish and Seafood Recipes",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "Designed to take the mystery out of seafood, with 198 recipes, how-to's covering cleaning and filleting, opening shell fish, cracking crabs, and much more",
        "Category": " Cooking , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1980"
        }
    },
    {
        "Title": "Food & Wine Magazine's 2001 Cookbook: An Entire Year's Recipes",
        "Authors": "By Hill, Judith (EDT)",
        "Description": "More than 800,000 subscribers heartily agree: there's always something delicious going on at Food & Wine. It's the unrivaled leader in the field, and serves up recipes, menus, advice on cooking gourmet travel, sophisticated entertaining tips, wine reviews, ideas on pairing wine and food, and articles on the hottest chefs and innovations in the culinary world. And here, all in one place, is every recipe published in the magazine during the year 2000--more than 500 of them! Each is kitchen-tested on everyday (not industrial) equipment, especially so you can recreate them in your own home. Here's real food that real people who want to eat well can actually prepare (unlike the too-complicated dishes in other cooking magazines, which seem to require a year spent at the Cordon Bleu!). Put these on your plate: Picadilo-Stuffed Mushrooms, Goat Cheese and Pepper Empanadillas, Fresh Herb Soup, Sicilian Eggplant Stuffed with Garlic and Melting Cheese, Spicy Crawfish Salad on Brioche, Snapper in Chile-Lime Sauce, Rack of Lamb with Cabernet Sauce, and Hazelnut Meringue Ice Cream Sandwiches. For the most innovative menus and wine pairings--whether you entertain every night or just for the holidays-Food & Wine is the authority.",
        "Category": " Cooking , General",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    }
]