[
    {
        "Title": "The death freak",
        "Authors": "By Luckless, John",
        "Description": "",
        "Category": "",
        "Publisher": "Summit Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Lady Liberty",
        "Authors": "By Hinze,Vicki",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam 2002/02",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Concise Guide to Becoming an Independent Consultant",
        "Authors": "By Holtz, Herman",
        "Description": "One of the biggest names in the consulting business shows you everything you need to get started--and succeed!Packed with expert advice, helpful tips, and industry secrets to successful self-marketing, this guide--an abridged version of the bestselling How to Succeed as an Independent Consultant--gives you the crucial tools and techniques you need to both survive and thrive in this highly competitive field. From founding your business to writing proposals to negotiating fees, The Concise Guide to Becoming an Independent Consultant has complete, up-to-date details on: * Determining the right fields and services for consulting. * The most common mistakes made by new consultants and the ten laws of survival. * Finances, taxes, and potential legal issues for consultants. * Marketing to the public sector, including federal, state, and local government. * Proposal formats and rationales. * Alternatives to formal contract documents and letters of agreement. * Vital consulting skills necessary for draft writing and presentations. * How to be a cyberspace consultant.",
        "Category": " Business & Economics , Consulting",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Moby Stink (Adventures of Uncle Stinky)",
        "Authors": "By Rumble, Chris",
        "Description": "Call him Stinky. In this third adventure, the hero with a heart of gold and a stink to high heaven enters the 238th Annual Catfish Rodeo and Fish Fry. A catfish of preposterous proportions has confounded the fishermen of Hottenholler for generations. Once again, the whole town has gathered to see if anyone will catch the elusive fish. T.V. personality and all-around big shot, Barry Cooter harbors a particular resentment of Ol' Whiskers-he blames the fish for the terrible incident that resulted in the loss of his hiney. Will Barry be the one to finally hook the great white catfish or will Uncle Stinky's secret weapon prove irresistible fish bait? PLUS! Hootenholler's One of a Kind Self-Guided Tour of Rocks and a terrifying tale about zombie chickens.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Tricycle Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "How to Solve Your Decorating Problems",
        "Authors": "By Bradford, Barbara Taylor",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "6.16",
        "Publish Date": {
            "Month": "September",
            "Year": "1976"
        }
    },
    {
        "Title": "Science Fair Projects For Dummies",
        "Authors": "By Levaren, Maxine",
        "Description": "Uh-oh, now you’ve gone and done it, you volunteered to do a science fair project. Don’t sweat it, presenting at a science fair can be a lot of fun. Just remember, the science fair is for your benefit. It’s your chance to show that you understand the scientific method and how to apply it. Also, it’s an opportunity for you to delve more deeply into a topic you’re interested in. Quite a few scientists, including a few Nobel laureates, claim that they had their first major breakthrough while researching a science fair project. And besides, a good science fair project can open a lot of doors academically and professionally—but you already knew that.Stuck on what to do for your science project? This easy-to-follow guide is chock-full of more than 50 fun ideas and experiments in everything from astronomy to zoology. Your ultimate guide to creating crowd-pleasing displays, it shows you everything you need to know to:Choose the best project idea for youMake sure your project idea is safe, affordable, and doableResearch, take notes, and organize your factsWrite a clear informative research paperDesign and execute your projectsAce the presentation and wow the judgesScience fair guru Maxine Levaren gives walks you step-by-step through every phase of choosing, designing, assembling and presenting a blue ribbon science fair project. She gives you the inside scoop on what the judges are really looking for and coaches you on all the dos and don’ts of science fairs. And she arms you with in-depth coverage of more than 50 winning projects, including:Projects involving experiments in virtually every scientific disciplinesComputer projects that develop programs to solve a particular problem or analyze system performanceEngineering projects that design and build new devices or test existing devices to compare and analyze performanceResearch projects involving data collection and mathematical analysis of resultsYour complete guide to doing memorable science projects and having fun in the process, Science Fair Projects For Dummies is a science fair survival guide for budding scientists at every grade level.",
        "Category": " Science , Research & Methodology",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Mystery of the Laughing Dinosaur (The Bobbsey Twins No. 8)",
        "Authors": "By Hope, Laura Lee",
        "Description": "The two sets of Bobbsey twins, Freddie, Flossie, Bert, and Nan, and their friend Scott investigate the theft of a valuable stamp from an exhibit in a Washington, D.C. museum",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1983"
        }
    },
    {
        "Title": "The Canoeing and Kayaking Instruction Manual (Canoeing how-to)",
        "Authors": "By Gullion, Laurie",
        "Description": "",
        "Category": " Sports & Recreation , Water Sports",
        "Publisher": "Menasha Ridge Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "angela, Private Citizen",
        "Authors": "By NANCY K. ROBINSON",
        "Description": "Six-year-old Angela's faith in order and fairness is frequently shaken as she tries to cope with all the mysteries of life that keep turning up in her busy family.Six-year-old Angela's faith in order and fairness is frequently shaken as she tries to cope with all the mysteries of life that keep turning up in her busy family",
        "Category": "",
        "Publisher": "Scholastic",
        "Price Starting With ($)": "9.67",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "'Twas the Fight before Christmas (McGee and Me! #09 Book)",
        "Authors": "By Myers, Bill",
        "Description": "Meet Nick Martin, a normal kid with an unusual friend—the lively, animated McGee! These companion books to the award-winning videos develop the themes to a greater degree, presenting kids with important values. (Ages 8 to 12)",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "The Fireship",
        "Authors": "By Parkinson, Cyril Northcote",
        "Description": "",
        "Category": "",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "A Severed Head",
        "Authors": "By Murdoch, Iris",
        "Description": "A novel about the frightfulness and ruthlessness of being in love, from the author of the Booker Prize-winning novel The Sea, The SeaMartin Lynch-Gibson believes he can possess both a beautiful wife and a delightful lover. But when his wife, Antonia, suddenly leaves him for her psychoanalyst, Martin is plunged into an intensive emotional reeducation. He attempts to behave beautifully and sensibly. Then he meets a woman whose demonic splendor at first repels him and later arouses a consuming and monstrous passion. As his Medusa informs him, “this is nothing to do with happiness.”A Severed Head was adapted for a successful stage production in 1963 and was later made into a film starring Claire Bloom, Lee Remick, Richard Attenborough, and Ian Holm.",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1976"
        }
    },
    {
        "Title": "Danny Dynamite",
        "Authors": "By Ure, Jean",
        "Description": "",
        "Category": "",
        "Publisher": "Corgi",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "The Pleasures of Cooking",
        "Authors": "By Publications International",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Pubns Intl Ltd",
        "Price Starting With ($)": "9.72",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "The Habsburg Monarchy, C. 1765-1918: From Enlightenment to Eclipse",
        "Authors": "By Okey, Robin",
        "Description": "The multi-national Habsburg empire has never lost its fascination since its fall in 1918. Robin Okey's book shows how the Habsburg peoples experienced the same social, economi, and political processes as most other Europeans, in ways that cast interesting light on these processes from both the European and the Habsburg angle. Opposing views that the national problem was therefore subordinate to underlying socio-economic backwardness, Okey argues for the inextricable entanglement of the two themes, as nationalism emerged from a process of social mobilization which threatened the position of dominant Austro-Germans and Magyars. Robin Okey brings a distinctive approach to an intriguing subject, in a comprehensive study based on wide reading in most of the Monarchy's languages.",
        "Category": " History , Europe , Austria & Hungary",
        "Publisher": "Macmillan; St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Intermediate Algebra, Third Edition (Student Solutions Manual)",
        "Authors": "By Elayn Martin-Gay/ Cindy Trimble",
        "Description": "",
        "Category": "",
        "Publisher": "Pearson",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Before They Rode Horses (Saddle Club Super Edition, Book 5)",
        "Authors": "By Bryant, Bonnie",
        "Description": "With Max's wife Deborah about to have a baby, the members of the Saddle Club take turns to keep her company as she waits to go to the hospital, relating in their own words what life was like for each of them before they became involved with horses. Original.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Skylark",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Queen Victoria: Born to Succeed.",
        "Authors": "By Longford, Elizabeth",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "11.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Wild Heritage, In the Natural Behavior of the Other Animals we Discover Much About Ourselves",
        "Authors": "By Sally Carrighar",
        "Description": "",
        "Category": "",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "The Norton Book of Classical Literature",
        "Authors": "By Knox, Bernard",
        "Description": "",
        "Category": "",
        "Publisher": "W.W. Norton",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Enemy Within: Saving America From The Liberal Assault On Our Churches, Schools, And Military",
        "Authors": "By Savage, Michael",
        "Description": "America's bravest, brashest voice is back?as ferocious and cutting as ever.\"Where has six decades of radical, mad-dog liberalism brought us?\" Savage asks in his electrifying new book. \"I'll tell you where: America is teetering on the cliffs of insanity.\"Written with the fire, the conviction, and the clear vision of a modern-day prophet, Savage returns with a vengeance in this lightning rod of a book, speaking for all Americans who are fed up and ticked off at the corrosive influence of today's \"psycho liberals\"?the Democrats, as he calls them.\"They're speeding down the pathway of good intentions. Their mantra: Celebrate perversity, embrace ultra-tolerance, pay rape-a-nations (so-called reparations), support affirmative racism, and provide government subsidies for every illegal who sneaks across the border. In their haste to push failed socialist ideals, the libs have placed us on a crash course of total destruction.\"Even while the heated controversy of his New York Times bestseller, The Savage Nation, still simmers, Michael Savage raises his weapons of matchless wit and moxie again, this time aiming his sights on the liberal assault on our most cherished institutions and taking a stand for our schools, our faith, our police and armed forces, and, most important, our families.It isn't always pretty. You might even at times become uncomfortable. But as you read on, you'll find these pages always contain the Savage truth. That is how to fight the Enemy Within.Filled with riotous rage and blistering humor, this book inspires as it enflames, encouraging Americans to reclaim our country, our government, our national integrity.",
        "Category": " Religion , Religion, Politics & State",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Shattered Rhythms: A Lil Ritchie Mystery",
        "Authors": "By Knight, Phyllis",
        "Description": "Portland, Maine, private detective Lil Ritchie, a frustrated guitarist, loves the idea of guarding Andre Ledoux, a great jazzman, when his life is threatened, but the fun and the music stop with a sudden murder.",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Strong Women and Men Beat Arthritis",
        "Authors": "By Nelson, Miriam E., Baker, Kristin R., Ph.D., Roubenoff, Ronenn, M.D., and Linder, Laurence",
        "Description": "More than forty million Americans have arthritis, a disease of joint deterioration that costs people everything they take for granted. But with breakthrough research that she conducted with fellow Tufts scientists Kristin Baker and Ronenn Roubenoff, Miriam E. Nelson has developed a plan that people can use to actually reverse the pain and immobility that arthritis causes-right in their own homes.  Those people with arthritis who participated in the groundbreaking Tufts study experienced a 43 percent reduction in pain, a 44 percent improvement in physical function, and a 71 percent improvement in strength. This book offers readers the exact same lifestyle \"tools\" that the Tufts team gave its subjects:  * an exercise program designed specifically to protect the joints and ameliorate stiffness and soreness * an eating plan to reduce inflammation and pain * a guide to the latest medications and complementary therapies * strategies for overcoming arthiritis-related depression.",
        "Category": " Health & Fitness , Diseases , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "110 People Who Are Screwing Up America (and Al Franken Is #37)",
        "Authors": "By Goldberg, Bernard",
        "Description": "The number one New York Times bestselling author of Bias delivers another bombshell—this time aimed at . . .100 People Who Are Screwing Up AmericaNo preaching. No pontificating. Just some uncommon sense about the things that have made this country great—and the culprits who are screwing it up.Bernard Goldberg takes dead aim at the America Bashers (the cultural elites who look down their snobby noses at \"ordinary\" Americans) . . . the Hollywood Blowhards (incredibly ditzy celebrities who think they're smart just because they're famous) . . . the TV Schlockmeisters (including the one whose show has been compared to a churning mass of maggots devouring rotten meat) . . . the Intellectual Thugs (bigwigs at some of our best colleges, whose views run the gamut from left wing to far left wing) . . . and many more.Goldberg names names, counting down the villains in his rogues' gallery from 100 all the way to 1—and, yes, you-know-who is number 37. Some supposedly \"serious\" journalists also made the list, including the journalist-diva who sold out her integrity and hosted one of the dumbest hours in the history of network television news. And there are those famous miscreants who have made America a nastier place than it ought to be—a far more selfish, vulgar, and cynical place.But Goldberg doesn't just round up the usual suspects we have come to know and detest. He also exposes some of the people who operate away from the limelight but still manage to pull a lot of strings and do all sorts of harm to our culture. Most of all, 100 People Who Are Screwing Up America is about a country where as long as anything goes, as one of the good guys in the book puts it, sooner or later everything will go.This is serious stuff for sure. But Goldberg will also make you laugh as he harpoons scoundrels like the congresswoman who thinks there aren't enough hurricanes named after black people, and the environmentalist to the stars who yells at total strangers driving SUVs—even though she tools around the country in a gas-guzzling private jet.With Bias, Bernard Goldberg took us behind the scenes and exposed the way Big Journalism distorts the news. Now he has written a book that goes even further. This time he casts his eye on American culture at large—and the result is a book that is sure to become the voice of all those Americans who feel that no one is speaking for them on perhaps the most vital issue of all: the kind of country in which we want to live.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Broadside Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Notes of a feminist therapist",
        "Authors": "By Williams, Elizabeth Friar",
        "Description": "",
        "Category": "",
        "Publisher": "Praeger",
        "Price Starting With ($)": "26.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Pure Dead Wicked",
        "Authors": "By Gliori, Debi",
        "Description": "Just when the Strega-Borgias think it’s safe to relax in their ancestral castle .  . . it isn’t.  First their roof collapses, forcing them into the Auchenlochtermuchty  Arms–the only local hotel that will accomodate three mythical beasts and one crocodile.  Then Titus accidentally creates 500 tiny naked pink clones. And 500 tiny naked pink  clones are not easy to manage. But not surprisingly, this isn’t the biggest Strega-Borgia  dilemma–there’s also a few evil contractors plotting to destroy their home forever.  Perhaps the miniature kilted warriors arising from the spilled magic potion can help.  . . .From the Hardcover edition.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Psychology of Music",
        "Authors": "By Seashore, Carl E.",
        "Description": "Standard study by founder of Seashore test. Relationship between physical phenomena of sounds and our perception of them. Music as a medium, physical acoustics, auditory apparatus, sound perception, host of other topics. Includes 88 figures. \"The thinking is rigorous and objective.\" — Music Teacher (London).",
        "Category": " Music , History & Criticism",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1967"
        }
    },
    {
        "Title": "The Contractor",
        "Authors": "By David Storey",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Maiden and Mother: Prayers, Hymns, Songs and Devotions to Honour the Blessed Virgin Mary Throughout the Year",
        "Authors": "By Miles, Margaret R. (EDT)",
        "Description": "This unique Marian devotional includes hymns, prayers, songs, ballads, litanies, and other texts drawn from all centuries, bringing together a precious collection of texts from the most ancient to modern.The selection is arranged under main headings for the seasons of the Church's year, with sub-sections covering all the major feasts of Our Lady plus some others observed locally or still popular.The months of May, dedicated to Mary, and October, the month of the Rosary, have devotions arranged on the traditional pattern for different times of day.Brief introductions to each feast and season are provided, with a note on the history, significance, and liturgical celebration of each. The best-known medieval hymns and prayers are given in their original Latin as well as English.The whole builds into a book for private or small-group devotion to the Blessed Virgin that has no rival for comprehensiveness and usefulness. It will appeal both to those who feel deprived of traditional forms of devotion and to those who are conscious of the increasing significance of the figure of the Virgin in today's world.",
        "Category": " Religion , Prayerbooks , Christian",
        "Publisher": "Ignatius Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Really, Really, Really Easy Step-by-Step Digital Photography: For Absolute Beginners of All Ages",
        "Authors": "By Hoole, Gavin and Smith, Cheryl",
        "Description": "Really, Really Really Easy Step-by-Step Digital Photogr aphy explains the process of picture- taking and sharing digital images in terms that anybody can understand. There are many books on digital photography, but there are few bare-bones guides that take you b eyond the baffling tech-speak of camera manuals and photogr ap h y b o o ks and magazines. Really, Really, Really Easy Step-by-Step Digital Photogr ap hy is written by authors well ve rsed in turning tough concepts into easy step - b y - s t ep instructions. Unlike conventional p h o t o gr aphy books, the authors first delve into the nuts and bolts of s t o r a ge, orga n i s ation, manipulation and sharing of digital image s . The second half of the book cove rs basic camera usage and guides the reader towards the choice of camera that is appropriate for their skills, needs and budget. For ease of explanation and maximu m reach in the market, all instructions are aimed at users running PCs under Windows XP; for the step - b y - s t ep photogr aphy sequences, the a u t h o rs make use of a Canon digital camera (other makes will be touched on) as a generic model.",
        "Category": " Photography , Techniques , Digital",
        "Publisher": "New Holland",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Broken Teaglass: A Novel",
        "Authors": "By Arsenault, Emily",
        "Description": "The dusty files of a venerable dictionary publisher . . . a hidden cache of coded clues . . . a story written by a phantom author . . . an unsolved murder in a gritty urban park–all collide memorably in Emily Arsenault’s magnificent debut, at once a teasing literary puzzle, an ingenious suspense novel, and an exploration of definitions: of words, of who we are, and of the stories we choose to define us.In the maze of cubicles at Samuelson Company, editors toil away in silence, studying the English language, poring over new expressions and freshly coined words–all in preparation for the next new edition of the Samuelson Dictionary. Among them is editorial assistant Billy Webb, just out of college, struggling to stay awake and appear competent. But there are a few distractions. His intriguing coworker Mona Minot may or may not be flirting with him. And he’s starting to sense something suspicious going on beneath this company’s academic facade.Mona has just made a startling discovery: a trove of puzzling citations, all taken from the same book, The Broken Teaglass. Billy and Mona soon learn that no such book exists. And the quotations from it are far too long, twisting, and bizarre for any dictionary. They read like a confessional, coyly hinting at a hidden identity, a secret liaison, a crime. As Billy and Mona ransack the office files, a chilling story begins to emerge: a story about a lonely young woman, a long-unsolved mystery, a moment of shattering violence. And as they piece together its fragments, the puzzle begins to take on bigger personal meaning for both of them, compelling them to redefine their notions of themselves and each other.Charged with wit and intelligence, set against a sweetly cautious love story, The Broken Teaglass is a tale that will delight lovers of words, lovers of mysteries, and fans of smart, funny, brilliantly inventive fiction.",
        "Category": " Fiction , Literary",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "365 Favorite Brand Name Slow Cooker Recipes & More",
        "Authors": "By Publications International, Inc.",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Devil in Vienna",
        "Authors": "By Orgel, Doris",
        "Description": "Two young girls in the Vienna of 1938 enjoy a devoted friendship which is threatened when Inge's situation as a Jew becomes uncertain and Lieselotte's father becomes a fervent Nazi",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "The Golden Ocean",
        "Authors": "By O'Brian, Patrick",
        "Description": "In the year 1740, Commodore (later Admiral) George Anson embarked on a voyage that would become one of the most famous exploits in British naval history. Sailing through poorly charted waters, Anson and his men encountered disaster, disease, and astonishing success. They circumnavigated the globe and seized a nearly incalcuable sum of Spanish gold and silver, but only one of the five ships survived.This is the background to the first novel Patrick O'Brian ever wrote about the sea, a precursor to the acclaimed Aubrey/Maturin series that shares the excitement and rich humor of those books. The protagonist is Peter Palafox, son of a poor Irish parson, who signs on as a midshipman, never before having seen a ship. Together with his lifelong friend Sean, Peter sets out to seek his fortune, embarking upon a journey of danger, disappointment, foreign lands, and excitement.Here is a tale certain to please not only admirers of O'Brian's work but also any reader with an adventurous soul.",
        "Category": " Fiction , Historical",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "People Are Idiots and I Can Prove It!: The 10 Ways You Are Sabotaging Yourself and How You Can Overcome Them",
        "Authors": "By Winget, Larry",
        "Description": "A caustic and irreverent guide to personal happiness by a National Speakers Association Hall of Famer argues that most people are unhappy because they are sabotaging themselves out of enjoying the things they already have, in a resource that recommends specific steps for achieving universal goals. 120,000 first printing.",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Gotham",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Natural Cat Care",
        "Authors": "By Fogle, Bruce",
        "Description": "As with humans, the physical and mental well-being of a cat are inextricably linked. By creating a more natural lifestyle for your cat and ensuring it eats a well-balanced diet, you can help it avoid many common medical and behavioral problems.Dr. Fogle shows how alternative therapies such as acupuncture, homeopathy, and chiropractic can complement conventional veterinary care, and offers natural remedies for a range of ailments including cuts and bruises, muscle and joint conditions, and behavioral difficulties. He explains how each therapy works and how to judge the suitability of different treatments for your own cat.",
        "Category": " Pets , Cats , General",
        "Publisher": "Dk Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The WINTER WOMEN MURDERS (Wyn Lewis Mystery)",
        "Authors": "By Kaufelt, David A.",
        "Description": "Tending to author Keny Blue, a featured speaker at the Annual Literary Arts Symposium, reluctant sleuth Wyn Lewis discovers Keny murdered and must seek out a killer among a jilted ghostwriter, the Symposium director, and a fellow speaker. Reprint.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "About Face: A History of America's Curious Relationship with China, from Nixon to Clinton",
        "Authors": "By Mann, Jim",
        "Description": "This is the fascinating inside story of the people, forces, politics and diplomacy that have shaped contemporary relations between the United States and China. James Mann, the Beijing bureau chief for the Los Angeles Times from 1984 to 1987, draws on hundreds of newly uncovered government documents, scores of interviews and his own experiences in writing this superb investigative history. Mann begins with an account of the process by which Richard Nixon and Henry Kissinger first courted and built up ties to China's Communist government in an attempt to find a way out of the war in Vietnam. At first, the aim was to create flexibility for the United States in dealing with both the Soviet Union and China; but gradually, as the 1970s progressed, the opening to China took on a life and momentum of its own. During the Carter and Reagan administrations, American leaders saw China as an ally against the Soviet Union, and a tacit understanding emerged that the United States would not subject China to the standards and principles applied to other countries. We are shown how subsequent administrations failed to construct a new framework for dealing with China--President Bush tried to preserve the old American relationship with Beijing, and President Clinton has been unsuccessful in his efforts to create something new.Mann also reveals little-known episodes in the history of U.S.-China relations: that the price of  Kissinger's first visit to China in 1971 was a secret promise that the United States would never support independence for Taiwan; how the United States and China worked together in guerrilla operations in Afghanistan and Cambodia; how the movement to restrict China's trade benefits originated and how Bill Clinton came to support these efforts during his1992 presidential campaign. The disclosure of new information, coupled with Mann's incisive and compelling analysis, makes About Face a work that is sure to shed light on the current debate on the United States' relations with China.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "The Fat Boy Murders (A Wyn Lewis Mystery)",
        "Authors": "By Kaufelt, David A.",
        "Description": "Real-estate lawyer Wyn Lewis turns sleuth to investigate a series of bizarre deaths in her hometown of Waggs Neck Harbor, as members of an elitist club called the Fat Boys are stalked by a killer. Reprint.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Stepfamilies: Myths and Realities",
        "Authors": "By Visher, Emily B. and Visher, John S.",
        "Description": "",
        "Category": " Family & Relationships , Parenting , Stepparenting",
        "Publisher": "Kensington Publishing Corp.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Faces at the Manger: An Advent-Christmas Sampler of Poems, Prayers, and Meditations",
        "Authors": "By Shepherd, J. Barrie",
        "Description": "",
        "Category": " Religion , Prayer",
        "Publisher": "Upper Room",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "King Lear (Cambridge School Shakespeare)",
        "Authors": "By Shakespeare, William, Morris, Jonathan, Smith, Rob (EDT), and Bain, Elspeth",
        "Description": "This new edition of King Lear takes into account the work of the Shakespeare and Schools Project, the national curriculum for English, developments at GCSE and A-level, and the probable development of English and Drama throughout the 1990s. Cambridge School Shakespeare considers King Lear as theatre and the text as script, enabling students to inhabit the imaginative world of the play in an accessible, meaningful and creative way. It approaches the play in a new way, encouraging students to participate actively in examining it, to work in groups as well as individually, to treat the play as a script to be re-created, and to explore the theatrical/dramatic qualities of the text.  The editorial comments cater for students of all ages and abilities, providing clear, helpful guidelines for school study. The format of the plays is also designed to help both experienced and inexperienced teachers.",
        "Category": " Performing Arts , Reference",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Joey Green's Fix-It Magic: More than 1,971 Quick-and-Easy Household Solutions Using Brand-Name Produ",
        "Authors": "By joey-green",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale Press",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Glycemic Index Cooking Made Easy",
        "Authors": "By Dr Jennie Brand - Miller, Kaye Foster-Powell & Joanna McMillan-Price",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Mastering Fine Decorative Paint Techniques",
        "Authors": "By Ross, Sharon and Kinkead, Elise",
        "Description": "Mastering Fine Decorative Paint Techniques is a step-by-step guide through the process of decorative painting-from choosing color schemes to mastering sponging, marbling, graining, and more. It explains why decorative painting is appropriate for today's homes and how readers can incorporate it into their interior spaces. The first half of the book excites homeowners about the beautiful-and personally satisfying-results they can achieve by learning decorative painting techniques. It also prepares homeowners by educating them on evaluating color's characteristics, choosing the right tools, and preparing surfaces. The second half of the book describes the need for priming and base-coating walls, as well as the formulas for mixing paints and glazes. Then, it delves into decorative painting techniques, covering each method and providing professional advice.",
        "Category": " Crafts & Hobbies , Painting",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "The Complete Home Wellness Handbook",
        "Authors": "By Swartzberg, John Edward and Margen, Sheldon (EDT)",
        "Description": "Provides information on the symptoms, remedies and preventative measures for a variety of diseases, disorders, and medical emergencies.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Rebus, Inc.",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "The Birth of a Century: Early Color Photographs of America",
        "Authors": "By Jackson, William Henry, Hughes, Jim, and DETROIT PHOTOGRAPHIC Co. (PHT)",
        "Description": "The final decades of the nineteenth century and the birth of the twentieth in America are illustrated as never before in this book of unique color images that actually predate the invention of color photography. The secret process which produced them combines the delicacy of watercolors with the look and feel of modern color photographs. The pictures are largely the work of the legendary William Henry Jackson, the pioneer photographer who explored the frontiers of the old American west with huge wet-plate cameras and a portable darktent strapped to the back of his trusty mule.Jackson's name is synonymous with high adventure, and Jim Hughes' richly detailed introduction tells a gripping story. Jackson was born in 1843 in New York, and by the 1860s he was on his first trip west, working as a bullwhacker on a wagon train when the nation's unfinished rail lines would take him no further. Finally, on the edge of the western frontier, he began photographing the wild and often spectacularly beautiful landscape of a wilderness soon to be forced into submission by the advancing railroads.Over the next three decades Jackson became the most celebrated of a small and hardy band of pioneer photographers, creating a striking photographic record of the rapidly changing face of America. When his photographs of Yellowstone were credited with helping to persuade Congress to make the region the first National Park, his place in history was secure. From the Rockies to California, from the Great Lakes to the deep South, from teeming New York City to forested New Hampshire these photographs capture both urban and rural landscapes to provide a unique picture of the social and physical evolution of the United States. The book is arranged as a visual tour of the country, and is written with fascinating insights into America's places and politics at the turn of the century.In 1897 Jackson sold the bulk of his enormous archive of photographs to the Detroit Photographic Company, which he joined as a partner. The firm had recently licensed Photochrom, a secret Swiss process for turning black-and-white photographs into color. Completely distinct from today's four-color reproduction, Photochrom is a continuous-tone color rendition of a black-and-white photograph that uses multiple impressions from lithographic stones. The color produced was astonishingly naturalistic, and it was to this process that Jackson devoted his final years of active photography. Gone now was the mule, as he traveled North America in a specially equipped railroad car in search of images to tell the story of the closing of one epoch and the dawning of another.William Henry Jackson died in 1942 after a lifetime that spanned almost the entire history of photography. In recent years, thousands of never distributed Photochrom prints were discovered in a Montana warehouse. This book offers an ample selection of the finest, all published for the first time.",
        "Category": " History , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "The Crowning Glory of Calla Lily Ponder: A Novel",
        "Authors": "By Wells, Rebecca",
        "Description": "“Rebecca Wells has done it again….A new book full of Southern charm and unique characters…impossible to put down.”—Houston Chronicle“Wells weaves that magic spell again.”—New Orleans Times-Picayune For Ya-Ya fans everywhere, New York Times bestselling author Rebecca Wells returns with The Crowning Glory of Calla Lily Ponder. The creator of the literary sensations Divine Secrets of the Ya-Ya Sisterhood, Little Altars Everywhere, and Ya-Yas in Bloom delivers an unforgettable new stand-alone novel about the pull of first love, the power of home, and everyday magic. No matter if you already adore the Ya-Yas or haven’t yet entered the miraculous world of Rebecca Wells, you are going to love—and never forget—Calla Lily Ponder.",
        "Category": " Fiction , Women",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Statistics for Managers Using Microsoft Excel (2nd Edition)",
        "Authors": "By Levine, David M., Berenson, Mark L., and Stephen, David",
        "Description": "",
        "Category": " Business & Economics , Statistics",
        "Publisher": "Prentice-Hall",
        "Price Starting With ($)": "9.22",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Deadly Little Secret (Touch, Book 1)",
        "Authors": "By Stolarz, Laurie Faria",
        "Description": "Some secrets shouldn't be kept... Up until three months ago, everything in sixteen-year-old Camelia's life had been fairly ordinary: decent grades; an okay relationship with her parents; and a pretty cool part-time job at the art studio downtown.  But when Ben, the mysterious new guy, starts junior year at her high school, Camelia's life becomes anything but ordinary.Rumored to be somehow responsible for his ex-girlfriend's accidental death, Ben is immediately ostracized by everyone on campus. Except for Camelia. She's reluctant to believe the rumors, even when her friends try to convince her otherwise.  She's inexplicably drawn to Benâ€¦and to his touch.  But soon, Camelia is receiving eerie phone calls and strange packages with threatening notes. Ben insists she is in danger, and that he can help--but can he be trusted? She knows he's hiding something... but he's not the only one with a secret. From the best-selling author of Blue is for Nightmares comes a story of paranormal romance that's sure to be a thrilling and chilling teen favorite.",
        "Category": " Young Adult Fiction , Romance , General",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Free Money \"They\" Don't Want You To Know About 1st Version edition by Kevin Trudeau (2009) Hardcover",
        "Authors": "By Kevin Trudeau",
        "Description": "",
        "Category": "",
        "Publisher": "Equity",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Worst Case (Michael Bennett, 3)",
        "Authors": "By Patterson, James and Ledwidge, Michael",
        "Description": "Best case: survivalThe son of one of New York's wealthiest families is snatched off the street and held hostage. His parents can't save him, because this kidnapper isn't demanding money. Instead, he quizzes his prisoner on the price others pay for his life of luxury. In this exam, wrong answers are fatal.Worst case: deathDetective Michael Bennett leads the investigation. With ten kids of his own, he can't begin to understand what could lead someone to target anyone's children. As another student disappears, one powerful family after another uses their leverage and connections to turn the heat up on the mayor, the press--anyone who will listen--to stop this killer. Their reach extends all the way to the FBI, who send their top Abduction Specialist, Agent Emily Parker. Bennett's life--and love life--suddenly get even more complicated.This case: Detective Michael Bennett is on itBefore Bennett has a chance to protest the FBI's intrusion on his case, the mastermind changes his routine. His plan leads up to the most devastating demonstration yet--one that could bring cataclysmic devastation to every inch of New York. From the shocking first page to the last exhilarating scene, Worst Case is a non-stop thriller from \"America's #1 storyteller\" (Forbes).",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Cloud Of Witnesses",
        "Authors": "By Wallis, Jim (EDT) and Hollyday, Joyce (EDT)",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Orbis Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "26 Fairmount Avenue (Newbery Honor Book, 2000)",
        "Authors": "By dePaola, Tomie",
        "Description": "A Newbery Honor BookTomie's family starts building their new house at 26 Fairmount Avenue in 1938, just as a hurricane hits town, starting off a busy, crazy year. Tomie has many adventures all his own, including eating chocolate with his Nana Upstairs, only to find out--the hard way--that they have eaten chocolate laxative. He tries to skip kindergarten when he finds out he won't learn to read until first grade. \"I'll be back next year,\" he says. When Tomie goes to see Snow White, he creates another sensation. Tomie dePaola's childhood memories are hilarious, and his charming illustrations are sure to please.\"A thoroughly entertaining and charming story.\"'School Library Journal\"DePaola successfully evokes the voice of a precocious, inquisitive five-year-old everyone would want to befriend. Charming black-and-white illustrations animate the scenes and add a period flare, including a photo album-like assemblage of the characters' portraits at the book's start.\"'Publishers weekly",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Literary",
        "Publisher": "G.P. Putnam's Sons Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Influencer: The Power to Change Anything",
        "Authors": "By Grenny, Joseph, McMillan, Ron, Switzler, Al, Patterson, Kerry, and Maxfield, David",
        "Description": "An INFLUENCER motivates others to change.An INFLUENCER replaces bad behaviors with powerful new skills. An INFLUENCER makes things happen. This is what it takes to be an INFLUENCER.Whether you're a CEO, a parent, or merely a person who wants to make a difference, you probably wish you had more influence with the people in your life. But most of us stop trying to make change happen because we believe it is too difficult, if not impossible. We develop complicated coping strategies when we should be learning the tools and techniques of the world's most influential people.But this is about to change. From the bestselling authors who taught the world how to have Crucial Conversations comes Influencer, a thought-provoking book that combines the remarkable insights of behavioral scientists and business leaders with the astonishing stories of high-powered influencers from all walks of life. You'll be taught each and every step of the influence process-including robust strategies for making change inevitable in your personal life, your business, and your world. You'll learn how to:Identify a handful of high-leverage behaviors that lead to rapid and profound change.Apply strategies for changing both thoughts and actions.Marshall six sources of influence to make change inevitable.Influencer takes you on a fascinating journey from San Francisco to Thailand where you'll see how seemingly “insignificant” people are making incredibly significant improvements in solving problems others would think impossible. You'll learn how savvy folks make change not only achievable and sustainable, but inevitable. You'll discover why some managers have increased productivity repeatedly and significantly-while others have failed miserably.No matter who you are, or what you do, you'll never learn a more valuable or important set of principles and skills. Once you tap into the power of influence, you can reach out and help others work smarter, grow faster, live, look, and feel better, even save lives. The sky is the limit…for an Influencer.Are you an Influencer ?Find out at www.influencerbook.com”You don't have to be a manager to realize that no one likes being told what to do. Yet lectures are still the main way we try to get people to change their behavior. Fortunately, social learning academics have been studying alternatives for decades. Patterson and his fellow consultants have now collected their findings in this engaging, example-rich book. The key message is hardly new, but it has gotten more sophisticated: Managers need to get out of the way and facilitate, not manage, the process of change for employees. They can do this by offering vicarious experiences, restructured environments, peer pressure, and frequent tests-all geared so that people embrace the change as authentic to them, not imposed by an outsider. Missing are only success stories of organizations that persuaded managers to drop their controlling habits and choose to be mere facilitators.”-John T. Landry, Harvard Business Review",
        "Category": " Business & Economics , Leadership",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "The Acquisitors (The Canadian Establishment, Vol. 2)",
        "Authors": "By Newman, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "McClelland & Stewart",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Through the ages,: A history of the Christian church (The Covenant Life Curriculum)",
        "Authors": "By Thompson, Ernest Trice",
        "Description": "",
        "Category": "",
        "Publisher": "CLC Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "The Spiritual Legacy of the American Indian",
        "Authors": "By Brown, Joseph Epes",
        "Description": "Introduces Indian sacred lore, religious rites, language, art, spiritual values, healing practices, world view, and concept of time",
        "Category": " Religion , Ethnic & Tribal",
        "Publisher": "Crossroad",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "We Are Now Beginning Our Descent: A Novel",
        "Authors": "By Meek, James",
        "Description": "From the author of the best-selling, universally acclaimed  The People’s Act of Love  comes the incisive and timeless story of a globe-trotting journalist’s perils in the pursuit of love, set against the war zones and dinner parties of today’s discordant and bewildering world stage.The world around journalist and would-be novelist Adam Kellas is cracking. As a war correspondent in the Afghan mountains during post-9/11 operations, Kellas reports on prescheduled surgical strikes with a nagging sense of complicity. At dinner parties in chic North London, he uneasily joins the debate of the wars from the comfort of their immaculate dinner tables. Divorced, unstable, spurned by his lover and publishing houses from Paris to New York, Kellas embarks on a strange and difficult journey that will lead him to a tiny rural town near the Chesapeake Bay. There, the elusive American reporter Astrid, with whom Kellas shared one passionate night, waits for him, holding a glimmer of hope for Kellas’ life but also an unsettling secret. We Are Now Beginning Our Descent  spans continents, cultures, and classes, brilliantly weaving together the hypocrisies, foibles, and passions of the way we live now.",
        "Category": " Fiction , Literary",
        "Publisher": "Canongate U.S.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Dracula: The Un-Dead",
        "Authors": "By Stoker, Dacre and Holt, Ian",
        "Description": "Bram Stoker's Dracula is the prototypical horror novel, an inspiration for the world's seemingly limitless fascination with vampires. Though many have tried to replicate Stoker's horror classic - in books, television shows, and movies - only the 1931 Bela Lugosi film bore the Stoker family's support. Until now.Dracula The Un-Dead is a bone-chilling sequel based on Bram Stoker's own handwritten notes for characters and plot threads excised from the original edition. Dracula The Un-Dead begins in 1912, twenty-five years after Dracula \"crumbled into dust.\" Van Helsing's protege, Dr. Jack Seward, is now a disgraced morphine addict obsessed with stamping out evil across Europe. Meanwhile, an unknowing Quincey Harker, the grown son of Jonathan and Mina, leaves law school for the London stage, only to stumble upon the troubled production of \"Dracula,\" directed and produced by Bram Stoker himself.The play plunges Quincey into the world of his parents' terrible secrets, but before he can confront them he experiences evil in a way he had never imagined. One by one, the band of heroes that defeated Dracula a quarter-century ago is being hunted down. Could it be that Dracula somehow survived their attack and is seeking revenge? Or is their another force at work whose relentless purpose is to destroy anything and anyone associated with Dracula?Dracula The Un-Dead is deeply researched, rich in character, thrills and scares, and lovingly crafted as both an extension and celebration of one of the most classic popular novels in literature.",
        "Category": " Fiction , Horror",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.46",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Last Empress: Madame Chiang Kai-shek and the Birth of Modern China",
        "Authors": "By Pakula, Hannah",
        "Description": "With the beautiful, powerful, and sexy Madame Chiang Kai-shek at the center of one of the great dramas of the twentieth century, this is the story of the founding of modern China, starting with a revolution that swept away more than 2,000 years of monarchy, followed by World War II, and ending in the eventual loss to the Communists and exile in Taiwan.   An epic historical tapestry, this wonderfully wrought narrative brings to life what Americans should know about China -- the superpower we are inextricably linked with -- the way its people think and their code of behavior, both vastly different from our own.   The story revolves around this fascinating woman and her family: her father, a peasant who raised himself into Shanghai society and sent his daughters to college in America in a day when Chinese women were kept purposefully uneducated; her mother, an unlikely Methodist from the Mandarin class; her husband, a military leader and dogmatic warlord; her sisters, one married to Sun Yat-sen, the George Washington of China, the other to a seventy-fifth lineal descendant of Confucius; and her older brother, a financial genius.   This was the Soong family, which, along with their partners in marriage, was largely responsible for dragging China into the twentieth century. Brilliantly narrated, this fierce and bloody drama also includes U.S. Army General Joseph Stilwell; Claire Chennault, head of the Flying Tigers; Communist leaders Mao Tse-tung and Chou En-lai; murderous warlords; journalists Henry Luce, Theodore White, and Edgar Snow; and the unfortunate State Department officials who would be purged for predicting (correctly) the Communist victory in the Chinese Civil War.   As the representative of an Eastern ally in the West, Madame Chiang was befriended -- before being rejected -- by the Roosevelts, stayed in the White House for long periods during World War II, and charmed the U.S. Congress into giving China billions of dollars. Although she was dubbed the Dragon Lady in some quarters, she was an icon to her people and is certainly one of the most remarkable women of the twentieth century.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "11.09",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "American Environmental History",
        "Authors": "By Petulla, Joseph M.",
        "Description": "",
        "Category": "",
        "Publisher": "BOYD & FRASER",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "The Woodworker's Bible",
        "Authors": "By Martensson, Alf",
        "Description": "This comprehensive guide to the equipment and techniques of cabinet making features a section on the operation and maintenance of woodworking machines, a dictionary of hand tools, and workshop-design suggestions",
        "Category": " House & Home , Woodworking",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "The Essential Pomeranian",
        "Authors": "By Dunbar, Ian (EDT), Winter-Churchill Photography (PHT), and Jones, Happeth (EDT)",
        "Description": "Pet owners will enjoy this attractively priced, four-color series of books that are filled with useful information in an attractive design.The Essential Guides have all of the information that the new or experienced pet owner needs for a successful relationship with his or her pet. Packed with interesting sidebars, the books discuss bringing your new pet home; the optimal way to feed your pet; and how to properly groom your pet. Also included are comprehensive chapters on health care and how to train your pet like an expert; as well as a special chapter filled with fun facts about your specific pet.The many fun and descriptive photos in The Essential Guides are taken by a professional photographer, and each book contains perforated fact cards with lots of helpful pet care tips for your convenience.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "*Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Bichon Frise (Complete Pet Owner's Manuals)",
        "Authors": "By Earle-Bridges, Michele (ILT) and Beauchamp, Richard G.",
        "Description": "nformation on ancestry, grooming, feeding, training, health care and more.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "B E S Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Tapas Cookbook",
        "Authors": "By Parragon",
        "Description": "",
        "Category": "",
        "Publisher": "Love Food / Parragon",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Deer Hunting: 2nd Edition",
        "Authors": "By Smith, Richard P.",
        "Description": "Discusses deer habits, weapons, clothing and equipment, and stalking and tracking skills in addition to specific techniques for hunting deer with guns, bow and arrows, or camera",
        "Category": " Sports & Recreation , Hunting",
        "Publisher": "Stackpole",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "A Bold Fresh Piece of Humanity",
        "Authors": "By O'Reilly, Bill",
        "Description": "The year was 1957, the month September, and I had just turned eight years old. Dwight Eisenhower was President, but in my life it was the diminutive, intense Sister Mary Lurana who ruled, at least in the third-grade class where I was held captive. For reasons you will soon understand, my parents had remanded me to the penal institution of St. Brigid’s School in Westbury, New York, a cruel and unusual punishment if there ever was one. Already, I had barely survived my first two years at St. Brigid’s because I was, well, a little nitwit. Not satisfied with memorizing the Baltimore Catechism’s fine prose, which featured passages like “God made me to show his goodness and to make me happy with him in heaven,” I was constantly annoying my classmates and, of course, the no-nonsense Sister Lurana. With sixty overactive students in her class, she was understandably short on patience. For survival, she had also become quick on the draw.Then it happened. One day I blurted out some dumb remark, and Sister Lurana was on me like a panther. Her black habit blocked out all distractions as she leaned down, looked me in the eye, and uttered words I have never forgotten: “William, you are a bold, fresh piece of humanity.”And she was dead-on.One day in 1957, in the third-grade classroom of St. Brigid’s parochial school, an exasperated Sister Mary Lurana bent over a restless young William O’Reilly and said, “William, you are a bold, fresh piece of humanity.” Little did she know that she was, early in his career as a troublemaker, defining the essence of Bill O’Reilly and providing him with the title of his brash and entertaining issues-based memoir. And this time it’s personal. In his most intimate book yet, O’Reilly goes back in time to examine the people, places, and experiences that launched him on his journey from working-class kid to immensely influential television personality and bestselling author. Readers will learn how his traditional outlook was formed in the crucible of his family, his neighborhood, his church, and his schools, and how his views on America’s proper role in the world emerged from covering four wars on five continents over three-plus decades as a news correspondent. What will delight his numerous fans and surprise many others is the humor and self-deprecation with which he handles one of his core subjects: himself, and just how O’Reilly became O’Reilly.",
        "Category": " Political Science , Commentary & Opinion",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Fodor's South Florida, 6th Edition (Travel Guide)",
        "Authors": "By O'Halloran, Jacinta (EDT)",
        "Description": "Try conch-blowing in Key West, kayak in the Everglades, dance till the wee hours of the morning in Miami, golf a variety of courses, or lounge on some of the most talked about beaches in the country–Fodor's South Florida offers all these experiences and more! Our local writers have traveled throughout the country to find the best hotels, restaurants, attractions and activities to prepare you for a journey of stunning variety. Before you leave for your trip be sure to pack your Fodor's guide to ensure you don't miss a thing.The San Francisco Chronicle sums it up best –\"Fodor's guides are saturated with information.\"- We frequently update our South Florida guide, and we make every effort to bring you the most accurate and thorough book. Plus we provide timely updates about the area at Fodors.com.- Unlike other travel books, Fodor's guides rely heavily on local experts who know the territory best–so you know you're seeing the real South Florida.- Includes full-color, pullout map of Florida and Miami & Orlando.- We give you the planning tools you need to tailor your trip. We give options for all budgets. You make the choices.",
        "Category": " Travel , Special Interest , General",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Book Crush: For Kids and Teens--Recommended Reading for Every Mood, Moment, and Interest",
        "Authors": "By Pearl, Nancy",
        "Description": "From picture books to chapter books, YA fiction and nonfiction, Nancy Pearl has developed more thematic lists of books to enjoy. The Book Lust audience is committed to reading, and here is a smart and entertaining tool for picking the best books for kids. Divided into three sections—Easy Books, Middle-Grade Readers, and Young Adult—Nancy Pearl makes wonderful reading connections by theme, setting, voice, and ideas. For horse lovers, she reminds us of the mainstays in the category (Black Beauty, Misty of Chincoteague, etc.) but then in a creative twist connects Mr. Revere and I to the list. In a list called Chapter One, she answers the proverbial question: which chapters books are the most compelling for kids who are now ready to move beyond picture books. And who says picture books aren’t deep? Recommended Folk Tales sort out many of life’s dilemmas and issues of good and bad; a selection of picture books on Death and Dying introduces this topic with sensitivity; and You’ve Got a Friend offers up books for early readers that show the complexities and the pleasures of relating to others. Parents, teachers, and librarians are often puzzled by the unending choices for reading material for young people. It starts when the kids are toddler and doesn’t end until high-school graduation. What’s good, what’s trash, what’s going to hold their interest? Nancy Pearl, America’s favorite librarian, points the way in Book Crush.",
        "Category": " Literary Criticism , Books & Reading",
        "Publisher": "Sasquatch Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Papercrafts & Paper Fun",
        "Authors": "By Kate Lively",
        "Description": "",
        "Category": "",
        "Publisher": "Hunter Publishing+inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Indians of California (The American Indians)",
        "Authors": "By Time-Life Books (EDT)",
        "Description": "Traces the roots of California's Native American population, the impact of Christian missions, and the struggle to preserve its culture",
        "Category": " History , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "The Little Marmalade Cat Book (The Little Cat Library)",
        "Authors": "By Taylor, David",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "IN THE SPIRIT OF TRADITION: THE B'NAI B'RITH KLUTZNICK MUSEUM",
        "Authors": "By Altshuler, Linda (edited by)",
        "Description": "",
        "Category": "",
        "Publisher": "B'nai B'rith Klutznick Museum",
        "Price Starting With ($)": "6.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "People of the Ice and Snow (American Indians)",
        "Authors": "By Time-Life Books, Finn",
        "Description": "Looks at the history and culture of the Inuit, Aleut, and Yupik, describes traditions and daily life, and shows a variety of their artifacts",
        "Category": " History , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Tribes of the Southern Woodlands (American Indians)",
        "Authors": "By Time-Life Books (EDT)",
        "Description": "Relates the history of the tribes of the southeastern United States from early contact with Europeans to their forced removal to land west of the Mississippi",
        "Category": " History , General",
        "Publisher": "Time Life",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Black & Decker The Complete Photo Guide to Home Repair",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Creative Publishing",
        "Price Starting With ($)": "9.5",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "The Little Black Cat Book (The Little Cat Library)",
        "Authors": "By Taylor, David",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Conviction (Tom Clancy's Splinter Cell)",
        "Authors": "By Michaels, David",
        "Description": "Several disastrous missions have depleted the ranks of the Splinter Cells. Third Echelon is training new recruits when a stunning piece of evidence is uncovered. Evidence that points to the mole who sold out his government...Sam Fisher, Splinter Cell(r) operative.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Partisans and Guerrillas (Time Life World War II, Vol. 12)",
        "Authors": "By Bailey, Ronald H",
        "Description": "Picture essays accompany a chronicle of the Axis conquest of the Balkans and the struggles of partisan troops and guerrillas to undermine and overthrow Hitler's forces",
        "Category": " History , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "The Annapolis Book of Seamanship: 2nd Edition, Revised",
        "Authors": "By Rousmaniere, John and Smith, Mark (ILT)",
        "Description": "Used throughout America as a textbook in sailing schools and Power Squadrons, The Annapolis Book of Seamanship thoroughly and clearly covers the fundamental and advanced skills of modern sailing. This edition of Annapolis is a major overhaul. Over half the book has been revised; old topics and features have been updated, and many new ones have been introduced. The design has been modernized, and many color illustrations have been added.",
        "Category": " Sports & Recreation , Boating",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Shoebox Greatest Hits and Misses : Celebrating the 20th anniversary of America's Funniest Greeting Card Company",
        "Authors": "By Dan Taylor, Shoebox staff writers",
        "Description": "",
        "Category": "",
        "Publisher": "Hallmark",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Doonesbury: The War Years: Peace Out, Dawg! and Got War?",
        "Authors": "By Trudeau, G. B.",
        "Description": "“I no longer care what Madonna had for breakfast.”–BoopsieThe irreverent wit of Doonesbury takes on 9/11 and the war years, traveling from Ground Zero to the Middle East. Here are two Doonesbury books–Peace Out, Dawg! and Got War?–together in one must-have volume full of G. B. Trudeau's wry, ironic, and keen observations. This collection is perfect for Doonesbury fans, political junkies, and anyone with a taste for biting humor and insightful satire.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The commandos (World War II)",
        "Authors": "By Miller, Russell",
        "Description": "",
        "Category": "",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Royal Blood (Vampire Kisses, Book 6)",
        "Authors": "By Schreiber, Ellen",
        "Description": "Summer break is over, and Raven is hardly eager to be returning to Dullsville High. Not only does school mean daily interaction with preppy pest Trevor Mitchell, but her sleep-filled days and romantic nights with her immortal boyfriend, Alexander, must come to an end. Plus the shock of morning classes isn't the only change in store. An unexpected letter turns up at Alexander's mansion—announcing his parents will be coming to town. And once they arrive, just about everyone has had a sighting of the macabre couple except Raven. What could be delaying Alexander from introducing Raven to them? Could Alexander be hiding something about his parents' homecoming? When Raven is finally invited to the most thrilling dinner party of her life, the next turn of events could transform her entire future with Alexander. The sixth book in Ellen Schreiber's bestselling Vampire Kisses series takes an unusual twist in the continuing romance of Raven and Alexander.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Katherine Tegen Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Guide to Pedigree Breeds",
        "Authors": "By MORRISON, Arthur",
        "Description": "",
        "Category": "",
        "Publisher": "Borders Press",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Nor Shall Your Glory Be Forgot: An Essay in Photographs",
        "Authors": "By Pohanka, Brian C., Kristoffersen, Pohanka, Brian C. (INT), and Kristoffersen (PHT)",
        "Description": "A respected photographer vividly recreates Civil War history by viewing through his lens the thousands of reenactments that take place annually nationwide and culling ninety duotone photographs that bring realism to that difficult time in America's history.",
        "Category": " Photography , Photojournalism",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Assassin's Creed: Renaissance",
        "Authors": "By Bowden, Oliver",
        "Description": "Betrayed by the ruling families of Italy, a young man embarks upon an epic quest for vengeance during the Renaissance in this novel based on the Assassin's Creed™ video game series.  “I will seek vengeance upon those who betrayed my family. I am Ezio Auditore Da Firenze. I am an Assassin…”To eradicate corruption and restore his family’s honor, Ezio will learn the art of the Assassins. Along the way, he will call upon the wisdom of such great minds as Leonardo da Vinci and Niccolo Machiavello—knowing that survival is bound to the skills by which he must live.To his allies, he will become a force for change—fighting for freedom and justice. To his enemies, he will become a threat dedicated to the destruction of the tyrants abusing the people of Italy.So begins an epic story of power, revenge and conspiracy...An Original Novel Based on the Multiplatinum Video Game from Ubisoft",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Adolescents and Add: Gaining the Advantage",
        "Authors": "By Quinn, Patricia O.",
        "Description": "Addresses the particular concerns of adolescents diagnosed with attention deficit disorder and offers coping strategies as well as personal stories from teens with the disorder.",
        "Category": " Family & Relationships , Learning Disabilities",
        "Publisher": "Magination Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Sound of Sleigh Bells: A Romance from the Heart of Amish Country (Apple Ridge)",
        "Authors": "By Woodsmall, Cindy",
        "Description": "Beth Hertzler works alongside her beloved Aunt Lizzy in their dry goods store, and serving as contact of sorts between Amish craftsmen and Englischers who want to sell the Plain people’s wares. But remorse and loneliness still echo in her heart everyday as she still wears the dark garb, indicating mourning of her fiancé. When she discovers a large, intricately carved scene of Amish children playing in the snow, something deep inside Beth’s soul responds and she wants to help the unknown artist find homes for his work–including Lizzy’s dry goods store. But she doesn’t know if her bishop will approve of the gorgeous carving or deem it idolatry. Lizzy sees the changes in her niece when Beth shows her the woodworking, and after Lizzy hunts down Jonah, the artist, she is all the more determined that Beth meets this man with the hands that create healing art. But it’s not that simple–will Lizzy’s elaborate plan to reintroduce her niece to love work? Will Jonah be able to offer Beth the sleigh ride she’s always dreamed of and a second chance at real love–or just more heartbreak?",
        "Category": " Fiction , Christian , Romance , General",
        "Publisher": "WaterBrook",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Sink or Swim (Madison Finn #13)",
        "Authors": "By Dower, Laura",
        "Description": "Madison and her friends have big plans for the summer-but everything is about to change. After agreeing to baby-sit for the neighbor's quiet kids down the block, Madison soon finds out that they're not so quiet after all. Will Madison and her BFFs turn down the heat themselves-or will lifeguard-in-training Hart save the summer?",
        "Category": " Juvenile Fiction , Social Themes , Adolescence & Coming of Age",
        "Publisher": "Volo",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "TIME Magazine Annual 1994 Year in Review",
        "Authors": "By Editors of Time Magazine",
        "Description": "",
        "Category": "",
        "Publisher": "Time Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Time Annual 1998: The Year in Review (TIME ANNUAL: THE YEAR IN REVIEW)",
        "Authors": "By Time Magazine (EDT)",
        "Description": "Surveys the principal events of 1998 in the United States and other countries, as well as developments in business, society, sports, and the arts, as seen in the pages of Time magazine",
        "Category": " Reference , Yearbooks & Annuals",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "The Holy Land (Lost Civilizations)",
        "Authors": "By Time-Life Books",
        "Description": "Looks at the history, geography, and ancient cultures of the Holy Land, describes modern archeological techniques, and looks at the ruins and artifacts of the region's various ancient cultures",
        "Category": " History , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Mound Builders & Cliff Dwellers (Lost Civilizations)",
        "Authors": "By Gluck, Sandra",
        "Description": "Surveys the cultures of various Indian tribes, and describes their dwellings and artifacts",
        "Category": " History , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Weight Watcher's Everyone Loves Chicken; Over 200 Delicious Family-Friendly Meal Ideas",
        "Authors": "By Weight Watchers",
        "Description": "",
        "Category": "",
        "Publisher": "Weight Watchers international, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Magnificent Maya (Lost Civilizations)",
        "Authors": "By Time-Life Books (EDT)",
        "Description": "An ancient civilization, complete with elaborate architecture, detailed sculpture, and a complex and highly developed society, is uncovered in this volume about the Mayan cities",
        "Category": " History , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The Search for El Dorado (Lost Civilizations)",
        "Authors": "By Time-Life Books",
        "Description": "Looks at the history and culture of early South American peoples, including the Chavin, the Moche, the Paracas, and the Nazca, and tells the stories of those who sought their gold",
        "Category": " History , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "The Gooseberry Fool",
        "Authors": "By James McClure",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "If We Kiss (If We Kiss, 1)",
        "Authors": "By Vail, Rachel",
        "Description": "Charlie Collins has never been kissed.She’s never been in love, either. Charlie’s beautiful best friend, Tess, has kissed three boys and has loved each one of them. Then Charlie unexpectedly finds herself falling for Kevin, and she’s in a mess of trouble right away. For one thing, Tess is in love with Kevin. Even worse, his father seems to be dating Charlie’s mom, who suddenly can’t stop smiling. With no one to confide in, Charlie has to figure this one out for herself. But even as she tries to pull away from Kevin, she can’t stop wondering, What would happen if we kiss?",
        "Category": " Young Adult Fiction , Romance , General",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2011"
        }
    }
]