[
    {
        "Title": "Boats Board Book",
        "Authors": "By Barton, Byron",
        "Description": "Byron Barton introduces young readers to all different kinds of boats in this bold and colorful board book. With simple text and vibrant illustrations, readers will learn about transportation by boat.Fishing boats and ferryboats.Sailboats and tugs.Boats on the water.Come aboard.Supports the Common Core State Standards.",
        "Category": " Juvenile Nonfiction , Concepts , General",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "The Largest U.S. Cities Named After a Food: And Other Mind-Boggling Geography Lists from Around the World",
        "Authors": "By Maxwell, brandt",
        "Description": "More than 500 astonishing lists and oddities fill this unusual compendium of geographic trivia. From a list of countries with the lowest number of international tourists per year to information about the largest countries in the world without an FM station, this book of wide-ranging curiosities makes minutia from across the world fascinating. What U.S. towns have the same name as a foreign country? Which large U.S. cities claim the highest percentage of households without telephone service? What state's residents call soft drinks \"pop\" more than any other? This humorous and revealing book holds these answers and many more.",
        "Category": " Reference , Trivia",
        "Publisher": "Santa Monica Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "Tough as Steel: Pittsburgh Steelers: 2006 Super Bowl Champions",
        "Authors": "By Pittsburgh Tribune-Review",
        "Description": "An \"instant\" book that celebrates the achievements and championship seasons of the 2006 NFL Super Bowl champs.  2006 Super Bowl Champions will also be the first book available on the  market that salutes this year's football champions and should be available within 10 days of the Super Bowl.",
        "Category": " Sports & Recreation , Football",
        "Publisher": "Sports Publishing LLC",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Frommer's London Day by Day (Frommer's Day by Day - Pocket)",
        "Authors": "By Logan, Lesley",
        "Description": "Includes in-depth tours of the British Museum, Victoria & Albert Museum, and Hampton Court Palace.  Features an insider's pub crawl through The City's best pubs. Specialized tours include London's top royal sights, the best places to take kids in the city, and the city's museum gems.These attractively priced, four-color guides offer dozns of neighborhood and thematic tours, complete with hundreds of photos and bulleted maps that lead the way from sight to sight. Day by Days are the only guides that help travelers organize their time to get the most out of a trip.Full-color package at an affordable price Star ratings for all hotels, restaurants, and attractions Foldout front covers with maps and quick-reference information Tear-resistant map in a handy, reclosable plastic wallet Handy pocket-sized trim",
        "Category": " Travel , Europe , Great Britain",
        "Publisher": "*Frommers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "The Family Moskat",
        "Authors": "By Singer, Isaac Bashevis",
        "Description": "",
        "Category": "",
        "Publisher": "Noonday Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Sole Sisters: Stories of Women and Running",
        "Authors": "By Lin, Jennifer and Warner, Susan",
        "Description": "More than 11 million women run regularly, a number that's growing every year. They tend to be educated and affluent-the perfect audience for Sole Sisters.Half of all runners are women, and they are changing the face of the sport. It's a social outlet, a healthful way to improve mental well-being, and an opportunity to form bonds with like-minded women.Sole Sisters: Stories of Women and Running is a gripping collection of stories that captures the inspirational heart of the women's running. Authors Jennifer Lin and Susan Warner have interviewed women of all ages from all walks of life and all parts of the country. All of their subjects have one thing in common: Running has transformed them. There are both heartrending stories of grief and survival and lighthearted tales of friendship. Among them are:* Sisters who competed in a 5K race to honor a sister who survived breast cancer.* A 9/11 widow who ran her first marathon to honor the memory of her husband. * A 65-year-old woman who overcame obesity and alcoholism to finish the grueling Ironman triathlon.* An unknown runner from Norway named Grete Waitz who decided to run a marathon-and changed the face of the sport.Sole Sisters: Stories of Women and Running is not just for women who run. It appeals to all women who know what it means to have the support of others who share their trials and triumphs. Sole Sisters: Stories of Women and Running is sometimes touching, sometimes funny, and always inspiring.",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Our Friend the Sun (Now I Know)",
        "Authors": "By Hall, Susan (ILT) and Palazzo-Craig, Janet",
        "Description": "Simple text and illustrations introduce the characteristics of the sun and its relationship to the earth.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1982"
        }
    },
    {
        "Title": "The Gardener's Guide",
        "Authors": "By Squire, David",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Value Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Adam & Eve: A Novel",
        "Authors": "By Naslund, Sena Jeter",
        "Description": "“This thriller is rich in brilliant discourses on religion, fanaticism, the meaning of ancient cave art, the speculative future, and love.”—Library Journal Sena Jeter Naslund, the New York Times bestselling author of Ahab’s Wife, Four Spirits, and Abundance explores both the dark nature of fundamentalism and the brightness of true faith in her dazzling novel, Adam & Eve. A provocative, eloquent, and deeply compelling story of a woman caught between two warring worlds—science and religion—Adam & Eve raises timely questions about identity, innocence, and sin, and represents a new literary high-water  mark for New York Times Notable author and Harper Lee Award-winner Naslund.",
        "Category": " Fiction , Literary",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "The Encouraging Parent: How to Stop Yelling at Your Kids and Start Teaching Them Confidence, Self-Discipline, and Joy",
        "Authors": "By Kennedy, Rodney",
        "Description": "Would you like to end temper tantrums, sibling rivalry, and other unacceptable behavior without resorting to threats, shouting, or spanking?Let Dr. Rod Kennedy show you how to become an Encouraging Parent.Remember that time when you were down on your knees, holding out your arms, and shouting out encouragement as your toddler took those first steps? When your child stumbled and fell, you didn't shout, spank, or reprimand -- you smiled, soothed, encouraged. You motivated your child to succeed. You can recapture that positive and effective attitude and harness it to raise a confident, self-disciplined, and happy child. The first step is to realize that the problem isn't how to \"fix\" your child, it's to understand how your own attitudes and beliefs get in the way of effective parenting, then learn how to fine-tune your emotional and communication skills.Based on his popular workshops, which have trained more than 100,000 parents, Dr. Kennedy's book contains a wealth of practical information on how to teach kids self-discipline. Topics include:         ¸  A self-test to help pinpoint where you need to refine your parenting skills         ¸  Establishing daily routines that are easy to remember-- and that will end the chaos         ¸  Teaching kids to get along and resolve their own conflicts so you don't have to micromanage         ¸  Real-life parenting lessons from the parents who attend Dr. Kennedy's workshopsThis warm, empathetic, and practical guide will help you nurture your child's positive development and create the loving, supportive atmosphere all kids need to thrive.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Bishop (The Patrick Bowers Files, Book 4)",
        "Authors": "By James, Steven",
        "Description": "FBI Special Agent Patrick Bowers's cutting-edge 21st-century geospatial investigative techniques and impeccable logic have helped him track some of the country's most grisly killers. But those skills are pushed to the limit in this new installment of the highly-acclaimed, award-winning The Bowers Files series.This time it's a congressman's daughter who is found dead even as her killers launch a spree of perfect murders in the Northeast. With nothing to link the crimes to each other, Agent Bowers faces his most difficult case yet--even as his personal life begins to crumble around him.Known for his intricately woven, masterfully plotted novels of high-octane action and spine-tingling suspense, Steven James delivers once again. The Bishop is a gripping, adrenaline-laced story for readers who are tired of timid thrillers. Strap on your seatbelt and get ready for a wild ride. The game is on.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Revell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2010"
        }
    },
    {
        "Title": "Year 1200, The, Vol 1: A Centennial Exhibition At The Metropolitan Museu",
        "Authors": "By Hoffmann, Konrad",
        "Description": "",
        "Category": "",
        "Publisher": "Metropolitan Museum of Art",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Newcomer's Handbook for Los Angeles",
        "Authors": "By Wai, Joan and Abarbanel, Stacey Ravel",
        "Description": "",
        "Category": " History , General",
        "Publisher": "First Books Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Kids Take New York",
        "Authors": "By Diamond, Christine and Moriarty, Andrea",
        "Description": "A guide to the city describes family-friendly activities, shopping for children, kid-friendly restaurants, parks, playgrounds, museums, day trips, and lessons as well as helpful organizations and agencies",
        "Category": " Travel , Special Interest , Family",
        "Publisher": "Book Happy Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "I Will Be Especially Very Careful",
        "Authors": "By Child, Lauren",
        "Description": "Lola's best friend Lotta has an extremely special new coat, and Lola really wants to borrow it. Lotta isn't so sure. 'I will be especially very careful', says Lola. But will she be able to keep it all fluffy and white and new?",
        "Category": " Juvenile Fiction , General",
        "Publisher": "PUFFIN BOOKS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Tapas: A Classic Collection of Spanish-Style Recipes",
        "Authors": "By Parragon",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "America's Favorite Brand Name Old-Fashioned Favorites",
        "Authors": "By Weber, Louis",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Sailboat Classes of North America",
        "Authors": "By blanchard, fessenden",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday & Company",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "When Hippo Was Hairy",
        "Authors": "By Greaves, Nick",
        "Description": "",
        "Category": "",
        "Publisher": "Struik Publishers Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Moon Handbooks Pennsylvania: Including Pittsburgh, the Poconos, Philadelphia, Gettysburg, and Dutch Country",
        "Authors": "By Miller, Joanne",
        "Description": "",
        "Category": " Travel , United States , Northeast , Middle Atlantic (NJ, NY, PA)",
        "Publisher": "Avalon Travel Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "How to Feel Great About Yourself and Your Life: A Step-By-Step Guide to Positive Thinking",
        "Authors": "By English, Martin",
        "Description": "Tells how to develop a positive attitude, handle job tension, recover from criticism, create a positive self-image, and avoid negative thinking",
        "Category": " Business & Economics , General",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Peace Therapy",
        "Authors": "By Morrow, Carol A.",
        "Description": "",
        "Category": "",
        "Publisher": "Abbey Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Start Here: Doing Hard Things Right Where You Are",
        "Authors": "By Harris, Alex, Stanford, Elisa (CON), and Harris, Brett",
        "Description": "You want to do hard things.But you don’t know where to start. You are changing the world around you. But you are tired and burned out.  You feel called to do the extraordinary for God.But you feel stuck in the ordinary. Do Hard Things inspired thousands of young people around the world to make the most of the teen years. Now Alex and Brett Harris are back and ready to tackle the questions that Do Hard Things inspired: How do I get started? What do I do when I get discouraged? What’s the best way to inspire others? Filled with stories and insights from Alex, Brett, and other real-life rebelutionaries, Start Here is a powerful and practical guide to doing hard things, right where you are. Are you ready to take the next step and blast past mediocrity for the glory of God? START HERE.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Multnomah",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "Friends and Lovers",
        "Authors": "By MacInnes, Helen",
        "Description": "",
        "Category": "",
        "Publisher": "Little Brown & Company",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "June",
            "Year": "1947"
        }
    },
    {
        "Title": "Lighthouses",
        "Authors": "By Henson, Heather",
        "Description": "This beautiful Miniature Edition™ is an international celebration of lighthouses told through evocative photographs, historical factoids, relevant quotes from literature and other sources, and fascinating trivia about lighthouses throughout America, Europe, Australia, New Zealand, Canada, and Scandinavia.",
        "Category": " Architecture , Buildings , Public, Commercial & Industrial",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Berkeley Guides: Pacific Northwest & Alaska: On the Loose (Berkeley Guides: The Budget Traveller's Handbook)",
        "Authors": "By Black, Lauren M. and Miller, Emily W. (EDT)",
        "Description": "",
        "Category": " Travel , Europe , France",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Lonely Planet Athens",
        "Authors": "By Willett, David and Wildman, Kim",
        "Description": "",
        "Category": " Travel , Europe , Greece",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "HOW TO BE A MOVIE STAR: ELIZABETH TAYLOR IN HOLLYWOOD: Elizabeth Taylor in Hollywood",
        "Authors": "By Mann, William J.",
        "Description": "Elizabeth Taylor has never been short on star power, but in this unprecedented biography, the spotlight is entirely on her—a spirited beauty full of magic, professional daring, and wit. Acclaimed biographer William Mann follows Elizabeth Taylor publicly as she makes her ascent at MGM, falls into (and out of) marriages, wins Oscars, fights studio feuds, and combats America's conservative values with her decidedly modern love affairs. But he also shines a light on Elizabeth's rich private life, revealing a love for her craft and a loyalty to the underdog that fueled her lifelong battle against the studio system. Swathed in mink, disposing of husbands but keeping the diamonds—this is Elizabeth Taylor as she lived and loved, breaking and making the rules in the game of supreme celebrity.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Peterson First Guide to Insects of North America (Peterson First Guides)",
        "Authors": "By Leahy, Christopher W. and White, Richard E.",
        "Description": "A practical field guide that features a special system designed to help indentify diverse species of insects",
        "Category": "",
        "Publisher": "Houghton Mifflin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "Cooking Seafood & Carolina Critters with Chef Dirt & Sugar Britches",
        "Authors": "By Chef Dirt",
        "Description": "",
        "Category": "",
        "Publisher": "Cookbooks By Morris Press",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Instant Guide to Insects",
        "Authors": "By Forey, Pamela and Fitzsimons, Cecilia",
        "Description": "An Instant Guide to Insects is an ideal compact identification guide to the most familiar insects of North America, from bugs to butterflies, from moths to mosquitoes, and all the thousands of other species of insects commonly seen in the home, garden, city and countryside.This user-friendly guide assumes no previous knowledge: an easy-to-follow system of color-coded bands (denoting type of insect) and symbols leads quickly to the correct section of the book.  Detailed, full-color illustrations of insects, with larvae where applicable, plus a distribution map and a concise but informative text make it easy to identify positively the most familiar species of North America.",
        "Category": " Nature , Animals , Insects & Spiders",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Robert Pattinson: Fated for Fame",
        "Authors": "By Williams, Mel",
        "Description": "Introducing Hollywood's Newest Bad Boy    You swooned over him on-screen in Twilight; now learn about the man behind the vampire. His British roots, his musical talents, the audition that changed his life -- there's more to Robert Pattinson than his trademark hair! Flip through to find out what makes him tick, what turns him on, and how he deals with his instant fame.",
        "Category": " Young Adult Nonfiction , Performing Arts , Film",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Florence, Tuscany & Umbria: The Complete Guide with the Best of the Art Treasures and Hill Towns",
        "Authors": "By Carroll, Joan Fisher, Fisher, Robert I. C., Moehlmann, Kristin, and Stern, Ali",
        "Description": "Lists and describes points of interest, hotels and restaurants, museums, shopping, sports, recreation, and entertainment in Florence and the towns of Tuscany and Umbria",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Bobbsey Twins' Mystery at School (Bobbsey Twins, No. 4)",
        "Authors": "By Laura Lee Hope",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "16.17",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "Toxic Deception: How the Chemical Industry Manipulates Science, Bends the Law and Endangers Your Health",
        "Authors": "By Center for Public Integrity (COR), Fagin, Dan, and Lavelle, Marianne",
        "Description": "",
        "Category": " Technology & Engineering , Environmental , Pollution Control",
        "Publisher": "Common Courage Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Judaism: Religion and ethics",
        "Authors": "By Waxman, Meyer",
        "Description": "",
        "Category": "",
        "Publisher": "T. Yoseloff",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "Journey Through the Ocean",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Books Are Fun, Ltd.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Brain Dead",
        "Authors": "By Dreyer, Eileen",
        "Description": "Forensic nurse Timmie Leary is the newest member of the emergency room staff at Memorial Medical Center in Puckett, Missouri. Timmie may look like an outsider in this backwater town, but she's actually come home again after a bad marriage and an exhausting stint at a Los Angeles hospital. Timmie quickly gains her coworkers' respect for her split-second reactions on the job. Yet even Timmie is stunned when the ex-husband of one of her fellow nurses turns up in the ER with the flu and leaves in a body bag.Timmie is far away from the perilous streets of L.A., but something just as deadly is festering nearby beneath the glossy surface of Restcrest, the hospital's highly regarded senior citizen care-and-research facility - where Timmie's father is the latest patient. Restcrest patients are suddenly piling up in the hospital morgue, and old age isn't reason enough to explain these tragedies or the rash of other mysterious deaths Timmie encounters in her new job. Adding to the dangerous mix is the attempted shooting of the hospital's golden-boy administrator, enough bureaucratic red tape to wrap a full-body cast, and the fact that Timmie's the only one in the hospital who is fighting to find out the truth.In her search for answers, Timmie joins forces with Daniel Murphy, a Pulitzer Prize-winning reporter with a bad case of burnout and a gig at a local paper. But as their investigation promises to rocket Murphy back to the big leagues, it also threatens to suck Timmie into a chilling conspiracy of corruption and murder that could destroy her friendships, her family, and any hope she has of rebuilding her life.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "The Sacred Books of the Jews",
        "Authors": "By Gersh, Harry",
        "Description": "",
        "Category": "",
        "Publisher": "Stein and Day",
        "Price Starting With ($)": "5.67",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Home Is on Top of a Dog House",
        "Authors": "By Schulz, Charles M.",
        "Description": "",
        "Category": "",
        "Publisher": "DETERMINED PRODUCTIONS. SAN FRANCISCO 1966",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Cuddle! (Meadowside Picture Books)",
        "Authors": "By Shoshan, Beth and East, Jacqueline (ILT)",
        "Description": "A boy explains why, when compared with other animals, his teddy bear is the best one to cuddle with.",
        "Category": " Juvenile Fiction , Stories in Verse",
        "Publisher": "Parragon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "The Little SAS Book: A Primer",
        "Authors": "By Delwiche, Lora D. and Slaughter, Susan J.",
        "Description": "A classic that just keeps getting better, The Little SAS Book is essential for anyone learning SAS programming. Lora Delwiche and Susan Slaughter offer a user-friendly approach so readers can quickly and easily learn the most commonly used features of the SAS language. Each topic is presented in a self-contained, two-page layout complete with examples and graphics. The fifth edition has been completely updated to reflect the new default output introduced with SAS 9.3. In addition, there is a now a full chapter devoted to ODS Graphics including the SGPLOT and SGPANEL procedures. Other changes include expanded coverage of linguistic sorting and a new section on concatenating macro variables with other text. This title belongs on every SAS programmer?s bookshelf. It?s a resource not just to get you started, but one you?ll return to as you continue to improve your programming skills.SAS Products and Releases: Base SAS: 9.3  Operating Systems: All",
        "Category": " Computers , Programming , General",
        "Publisher": "SAS Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Origami Handbook: The Classic Art of Paperfolding in Step-by-Step Contemporary Projects",
        "Authors": "By Rick Beech",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "1-2-3 Draw Wild Animals",
        "Authors": "By Levin, Freddie",
        "Description": "Whimsical, appealing projects spring like magic from the hand of illustrator Freddie Levin as she shows young artists how to create charming animals from simple shapes, such as eggs, ovals and circles. Each step toward the finished drawing is gradual and fully explained.",
        "Category": " Juvenile Fiction , Art",
        "Publisher": "Peel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Kids Ask Who?",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ktd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Baseball Top 10 (Major League Baseball (Paperback DK))",
        "Authors": "By Buckley, James and Fischer, David",
        "Description": "A compendium of hundreds of top ten lists about major league, minor league, and college baseball covers such topics as most career strikeouts and highest percentage of Hall of Fame votes received. Original.",
        "Category": " Juvenile Nonfiction , Reference , General",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "The Next Fifty Years: A Guide for Women at Midlife and Beyond",
        "Authors": "By Blair, Pamela D., Ph.D.",
        "Description": "New edition being published in April 2014 as Getting Older BetterIS THERE LIFE AFTER HOT FLASHES?Yes! According to Pamela Blair, psychotherapist and author of The Next Fifty Years! That person in the mirror is you and now is the time to understand and accept the external changes while making some internal changes. Make peace with yourself, embrace aspects of yourself that have been unexplored, and dive passionately into what you love!There has never been a better time to be a woman over fifty. Embracing the celebratory essence of The Red Hat Society and Red Hot Mamas--while at the same time moving beyond them--The Next Fifty Years offers solutions and support. Included is a group study guide with outlines for creating a meaningful forum for thoughts, concerns, joys, frustrations, and--fun with your friends and peers.Today's woman is recognized as being far more complex and multidimensional than previous generations, fulfilling many roles in today's society. More than 150 short essays cover topics specific to women and aging, including:self-imagemindemotionsfearsrelationshipsspiritual selfcreative selffinanceshealthAlso included is journaling space for you to write your own thoughts and feelings. Intended both as a personal journal and guide to the best years of your life, The Next Fifty Years  can become a written legacy between generations of women--past, present, and to come.",
        "Category": " Self-help , Aging",
        "Publisher": "Hampton Roads Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Type: Design, Color, Character and Use (Graphic Designers Library)",
        "Authors": "By Beaumont, Michael",
        "Description": "Explains how to design type for a wide range of projects and use color to create a mood",
        "Category": " Technology & Engineering , General",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "My Dog",
        "Authors": "By Slater, Nicola (ILT) and Joy, Angela",
        "Description": "A touch-and-feel book, shaped like a dog house, follows Joe and his Mom as they try to find the perfect dog for Joe, and he knows the perfect pet right when he sees him!",
        "Category": " Juvenile Fiction , Animals , Dogs",
        "Publisher": "Tiger Tales",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The World's Greatest Buildings (Revised and Updated)",
        "Authors": "By et. al., Trevor Howells (ed.) Henry J. Cowan",
        "Description": "",
        "Category": "",
        "Publisher": "Fog City Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Bride and Groom Handbook",
        "Authors": "By Isaacs, Ronald H.",
        "Description": "",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Behrman House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "22 Britannia Road: A Novel",
        "Authors": "By Hodgkinson, Amanda",
        "Description": "A tour de force that echoes modern classics like Suite Francaise and The Postmistress.  \"Housekeeper or housewife?\" the soldier asks Silvana as she and eight- year-old Aurek board the ship that will take them from Poland to England at the end of World War II. There her husband, Janusz, is already waiting for them at the little house at 22 Britannia Road. But the war has changed them all so utterly that they'll barely recognize one another when they are reunited. \"Survivor,\" she answers. Silvana and Aurek spent the war hiding in the forests of Poland. Wild, almost feral Aurek doesn't know how to tie his own shoes or sleep in a bed. Janusz is an Englishman now-determined to forget Poland, forget his own ghosts from the way, and begin a new life as a proper English family. But for Silvana, who cannot escape the painful memory of a shattering wartime act, forgetting is not a possibility. One of the most searing debuts to come along in years, 22 Britannia Road. is the wrenching chronicle of how these damaged people try to become, once again, a true family. An unforgettable novel that cries out for discussion, it is a powerful story of primal maternal love, overcoming hardship, and, ultimately, acceptance-one that will pierce your heart.",
        "Category": " Fiction , Literary",
        "Publisher": "Pamela Dorman Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2011"
        }
    },
    {
        "Title": "Shooting Your Way to a Million",
        "Authors": "By Sharabura, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Chatsworth Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Math (A McGraw-Hill/Warner Bros. Workbook, Grade 1)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill Children's Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The night before cookbook",
        "Authors": "By Rubinstein, Paul",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan",
        "Price Starting With ($)": "32.36",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Letters to a Bullied Girl: Messages of Healing and Hope",
        "Authors": "By Gardner, Olivia, Buder, Emily, and Buder, Sarah",
        "Description": "Olivia Gardner, a northern California teenager, was severely taunted and cyber-bullied by her classmates for more than two years. News of her bullying spread, eventually reaching two teenage girls from a neighboring town, sisters Emily and Sarah Buder. The girls were so moved by Olivia's story that they initiated a letter-writing campaign to help lift her spirits. It was a tender gesture of solidarity that set off an overwhelming chain reaction of support, encouragement, and love.In Letters to a Bullied Girl, Olivia and the Buder sisters share an inspiring selection of messages that arrived from across America—the personal, often painful remembrances of former targets, remorseful bullies, and sympathetic bystanders. Letters to a Bullied Girl examines our national bullying epidemic from a variety of angles and perspectives, and includes practical guidance from bullying expert Barbara Coloroso, author of The Bully, the Bullied, and the Bystander. Though addressed to Olivia, the letters speak to all young people who have been bullied, offer advice and hope to those who suffer, and provide a wake-up call to all who have ever been involved in bullying.",
        "Category": " Social Science , Violence in Society",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Photographer's handbook (Life Library of Photography)",
        "Authors": "By Time-Life Books",
        "Description": "",
        "Category": "",
        "Publisher": "Time-Life Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "The Guide to Getting It On! A New and Mostly Wonderful Book About Sex for Adults of All Ages",
        "Authors": "By Goofy Foot Press (COM)",
        "Description": "",
        "Category": " Self-help , Sexual Instruction",
        "Publisher": "Goofy Foot Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "A Witch's Beauty",
        "Authors": "By Hill, Joey W.",
        "Description": "The follow-up to A Mermaid's Kiss-from a national bestselling author who \"stands out in a genre known for its out-of-the-ordinary love play.\"(The Romance Studio) Mina is the daughter of an unholy union-a mermaid taken by one of the malevolent Dark Ones. While helping to rescue Prime Legion Commander Jonah, she exposed herself as a potentially dangerous weapon, susceptible to the darkness in her own blood. Now, for the general good, Jonah has angels watching over her... Though Mina is resistant to being protected, her attitude begins to change when David, the human-born angel, is awarded the duty. Looking into his eyes, she can sense that he too knows what it means to fight the darkness within. But-as their passion threatens to take over-will it lead them to Heaven or Hell?",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Favorite Brand Name: Made Simple Appetizers",
        "Authors": "By Publications International",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The History of the Psycho-Analytic Movement",
        "Authors": "By Freud, Sigmund",
        "Description": "",
        "Category": "",
        "Publisher": "Collier",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "1001 4-Ingredient Recipes",
        "Authors": "By Gregg R. Gillespie",
        "Description": "",
        "Category": "",
        "Publisher": "Black Dog & Leventhal",
        "Price Starting With ($)": "5.61",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Berlitz Latin American Spanish Phrase Book & Dictionary (Spanish Edition)",
        "Authors": "By Berlitz International, Inc. (EDT)",
        "Description": "",
        "Category": " Foreign Language Study , Spanish",
        "Publisher": "Berlitz",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The boys from Sharon",
        "Authors": "By Cooper, Louise Field",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Brothers Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1950"
        }
    },
    {
        "Title": "Ortho's Home Improvement Encyclopedia",
        "Authors": "By Alhstrand, Alan (EDT), Ortho Books, Beckstrom, Robert J. (EDT), and Reed, John (EDT)",
        "Description": "Provides instructions for interior and exterior home improvement projects",
        "Category": " House & Home , Reference",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "6.81",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "2,500 Anecdotes for All Occasions",
        "Authors": "By Fuller, Edmund (EDT)",
        "Description": "A collection of witticisms, epigrams and fables spoken by the famous and not-so-famous for use by storytellers, speakers, and teachers",
        "Category": "",
        "Publisher": "Wings",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "I Love You, Grandma",
        "Authors": "By Stephenson, Kristina (ILT) and Harker, Jillian",
        "Description": "Little Bear is curious and asks lots of questions. Luckily for him, wise Grandma Bear seems to have all the answers. And as they set off to look for food, Grandma Bear can show Little Bear a trick or two.",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Parragon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2012"
        }
    },
    {
        "Title": "Rosie's Bakery Chocolate-Packed, Jam-Filled, Butter-Rich, No-Holds-Barred Cookie Book",
        "Authors": "By Love, Sara (ILT), Rosenberg, Judy, Levinson, Nan S., and Rosie's Bakery (COR)",
        "Description": "Celebrating rich, buttery, over-the-top treats, award-winning baker and author Judy Rosenberg shares 150 inspired but easy-to-make cookie recipes that never stint on the good stuff. Think chocolate chips and chocolate chunks, mounds of jam and heaps of nuts, the butter crunch of real shortbread and the tender chew of a gooey bar.Cookies and milk will never taste the same again. Among the old favorites and new classics: Noah's Chocolate Chocolatey Chocolate Chips, Hazelnut Crisps, Banana-Nut Chocolate Chunks, Almond Biscotti (low-fat, but don't tell anyone), Coconut Dainties, Pucker-Your-Lips Apricot Linzer Bars, and adorable little custard-filled Boston Cream Pies.",
        "Category": " Cooking , Specific Ingredients , Chocolate",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "An Historical Guide to the Sculptures of the Parthenon",
        "Authors": "By The British Musuem",
        "Description": "",
        "Category": "",
        "Publisher": "Trustees of the British Museum",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Simple French Cookery",
        "Authors": "By Beilenson, Edna",
        "Description": "",
        "Category": "",
        "Publisher": "Peter Pauper Press",
        "Price Starting With ($)": "15.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1958"
        }
    },
    {
        "Title": "Guide and map: With descriptions of selected objects",
        "Authors": "By BRITISH MUSEUM",
        "Description": "",
        "Category": "",
        "Publisher": "British Museum",
        "Price Starting With ($)": "7.23",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Great Country French Style (Better Homes and Gardens Home)",
        "Authors": "By Michele Keith",
        "Description": "Page after page of rich, beautiful full-color photography will inspire homeowners.More than 30 home tours and nearly 300 photos showcase Country French style in every room of the house.Real homes illustrate the range of interpretations of Country French style, from rustic to casual to more formal.The book shows how to get the look with furniture, accessories, color, pattern, and architecture.",
        "Category": " House & Home , Decorating",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Your Dream Kitchen: Stylish Solutions for the Home (House Beautiful)",
        "Authors": "By George, Liz",
        "Description": "\"That's the kitchen I want!\" That's what home decorators will think as they pore through House Beautiful's breathtaking photos of the most fabulous kitchens ever designed. Best of all--with these detailed case studies, your dream kitchen can actually become reality.Not so much a how-to as a why not?, this exquisitely illustrated planner from the experts at House Beautiful will inspire, motivate and move you to action. It incorporates all the best full-color, \"wish book\" photos of dream kitchens with extremely achievable ideas and examples of what almost everyone can obtain. From country to urban sleek, these designs address the biggest challenge in kitchen planning: identifying the look you want. Case studies-complete with before-and-after pictures and floor plans-outline real-world problems and solutions for overcoming them. And high-quality photos, anchored by expert commentary, present an array of cabinets, surfaces, appliances, fixtures and fittings, and lighting-all the products that go into creating a top-notch kitchen. And, because dreams should come true, there's advice on making it happen and working with professionals. If you can't find your ultimate kitchen in this book, it probably doesn't exist.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Hearst",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "People: Child Stars: Then & Now",
        "Authors": "By People Magazine (EDT)",
        "Description": "Looks at the lives of one hundred child stars who came of age in Hollywood during the 1970s, 1980s, and 1990s, revealing what has happened to them since their early--often fleeting--brush with fame and fortune.",
        "Category": " Performing Arts , Acting & Auditioning",
        "Publisher": "People",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Historic Concord,: A Handbook of Its Story and Its Memorials with the Story of the Lexington Fight",
        "Authors": "By French, Allen",
        "Description": "",
        "Category": "",
        "Publisher": "The Riverside Press",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "January",
            "Year": "1942"
        }
    },
    {
        "Title": "Meals in Minutes (Robert Rose's Favorite)",
        "Authors": "By Robert Rose Inc. (COR)",
        "Description": "With Robert Rose's Favorite Meals in Minutes you can choose from more than 50 great-tasting recipes that you can cook in 30 minutes or less. Experience a wealth of different flavors from savory snacks like Greek Chicken Pita Sandwiches to main courses like Indian-Style Grilled Chicken Breasts or Crab and Corn Pancakes with Sweet-and-Sour Sauce to down-home-and-delicious desserts such as Lemon Fool with Fresh Berries.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Robert Rose",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Blue Diablo: A Corine Solomon Novel",
        "Authors": "By Aguirre, Ann",
        "Description": "Read Ann Aguirre's posts on the Penguin Blog“Gritty, steamy and altogether wonderful urban fantasy.”—New York Times Bestselling Author Patricia BriggsView our feature on Ann Aguirre’s Blue Diablo. \"Right now, I’m a redhead.  I’ve been blonde and brunette as the situation requires, though an unscheduled color change usually means relocating in the middle of the night.  So far, I’m doing well here.  Nobody knows what I’m running from.  And I’d like to keep it that way…\" Eighteen months ago, Corine Solomon crossed the border and wound up in Mexico City, fleeing her past, her lover, and her “gift”.  Corine, a handler, can touch something and know its history—and sometimes, its future.  Using her ability, she can find the missing—and that’s why people never stop trying to find her.  People like her ex, Chance… Chance, whose uncanny luck has led him to her doorstep, needs her help.  Someone dear to them both has gone missing in Laredo, Texas, and the only hope of finding her is through Corine’s gift.  But their search may prove dangerous as the trail leads them into a strange dark world of demons and sorcerers, ghosts and witchcraft, zombies—and black magic…",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Better Homes & Gardens - New Complete Guide to Home Repair & Improvement",
        "Authors": "By Allen, Benjamin W. (EDT)",
        "Description": "A neatly organized how-to manual provides all the information you need to perform five hundred projects for inside and outside the home and includes listings of the skills, time, and tools required to complete each repair or improvement. 75,000 first printing. Tour.",
        "Category": " House & Home , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "8.77",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "The Illustrated Practical Book of Family and First Aid",
        "Authors": "By DR. PETER FERMIE, DR. PIPPA KEECH, DR. STEPHEN SHEPHERD",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "6.98",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Jefferson Selleck",
        "Authors": "By Jonas, Carl",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1952"
        }
    },
    {
        "Title": "A New Earth, An Old Deception: Awakening to the Dangers of Eckhart Tolle's #1 Bestseller",
        "Authors": "By Abanes, Richard",
        "Description": "When Christians are confronted by media with a \"new\" theology, they aren't always sure what to do. It may sound spiritual, almost Christian. But something isn't quite right. Richard Abanes helps believers as well as the curious understand that Eckhart Tolle's message in A New Earth is dangerous. He then provides a clear biblical response to this New Age message. Topics include Tolle's misuse of Scripture, false teachings on God, the Bible's teaching on evil, A New Earth's version of salvation compared to God's plan, and much more.",
        "Category": " Religion , Christian Theology , Apologetics",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Santa In Montana (Calder)",
        "Authors": "By Dailey, Janet",
        "Description": "\"Can Santa bring you a husband?\"Montana winters are harsh, but bad weather won't get in the way of the Calders' Christmas reunion. Patriarch Chase Calder is determined to make this holiday the happiest yet--especially for his daughter, Cat. And Chase knows the best gifts aren't always done up in paper and ribbon. . . It's high time for widowed Cat to have a man in her life again, whether she'll admit it or not. Chase has been thinking long and hard, and he's got a plan--one he's far too wise to reveal to his stubborn little darlin'. And as the magical season begins with a glorious snowfall, the Calders share a host of surprises--including a mystery solved, a special visitor, and the greatest gift of all: love, the forever kind. . .Praise for Janet Dailey's Christmas Novels \"Dailey's charming tale sparkles with romance. . .the perfect holiday read.\" --Romantic Times on Eve's Christmas\"A good old-fashioned Christmas gift.\" --Publishers Weekly on Happy Holidays",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Zebra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "High Risk (Nancy Drew: All New Girl Detective #4)",
        "Authors": "By Keene, Carolyn",
        "Description": "It looks like Evaline Waters, a River Heights resident, is knee-deep in trouble. A huge corporation is suing her for her land; they want to tear down her house and put up a warehouse. And documentation of the zoning law that would protect Evaline's right to keep her land is missing. Figures!  I've got to find that document, but it's hard to focus on the land when I'm cruising at ten thousand feet. See, Ned and I are taking flying lessons, him with Colonel Lang, a friend of his family, and me with Frank Beltrano, an instructor at our local airport. It's a good thing I'm good at juggling more than two balls at once. Too bad I'm not the only one.",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "A Bargain for Frances (I Can Read Book)",
        "Authors": "By Hoban, Russell and Hoban, Lillian (ILT)",
        "Description": "One day Thelma tricks Frances into buying her old plastic tea set. Thelma says there are no backsies on the bargain. Can Frances come up with a plan that will change her friend's mind?   Outstanding Children's Books of 1970 (NYT)",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1970"
        }
    },
    {
        "Title": "The Search for Significance Devotional: Daily Meditations, Reflections, & Prayers",
        "Authors": "By McGee, Robert S.",
        "Description": "",
        "Category": "",
        "Publisher": "Rapha Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Grave Apparel: A Crime of Fashion Mystery",
        "Authors": "By Byerrum, Ellen",
        "Description": "When a holiday sweater-hating diva is found beaten and left for dead wearing a hideous acrylic number that screams Christmas, \"Crimes of Fashion\" columnist Lacey Smithsonian must unravel the mystery before she becomes the next fashion victim. Original.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Dune Road: A Novel",
        "Authors": "By Green, Jane",
        "Description": "From the New York Times bestselling author of Falling and The Sunshine Sisters comes a timely novel about the challenges of starting over.In the Gold Coast town of Highfield, Connecticut, recent divorcée Kit Hargrove has joyfully exchanged the requisite diamond studs and Persian rugs of a “Wall Street Widow” for her true dream home: a clapboard Cape with sea green shutters and sprawling impatiens. Her kids are content, her ex cooperative, and each morning she wakes up to her dream job assisting novelist Robert McClore.But when a figure from the past arrives just as the shifting financial market turns Highfield upside down, Kit is forced to realize that her blissfully constructed life and blossoming new romance aren’t as foolproof as she thought...",
        "Category": " Fiction , Women",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "How Do You Walk the Walk You Talk?",
        "Authors": "By Arthur, Kay",
        "Description": "This brand new Bible study series from beloved Bible teacher Kay Arthur and the teaching staff of Precept Ministries tackles important issues in brief, easy-to-grasp lessons you can benefit from personally or as part of a small group. Each book in the series includes six 40-minute studies designed to draw you into God’s Word through basic inductive Bible study. As Kay explains, \"Rather than simply reading or listening to what others say about a subject, you are going to see for yourself what God says about it.\"Join one of the world’s most respected Bible teachers in a study that will revolutionize your thinking--and your life.You are surrounded by a world that’s watching you, waiting to see if what you say is true--if you really believe what you say and “walk the walk you talk.That thought may seem overwhelming, even intimidating. But Kay Arthur is ready to guide you into a deeper understanding of God’s Word. This study of vital passages from Ephesians will help you discover what God says about the lifestyle of a true believer. And it will equip you to live in a manner worthy of your calling--with the ultimate goal of developing a life marked by maturity, Christlikeness, and peace. Get started on an authentic walk with God that matches your talk. Kay Arthur will show you the way.",
        "Category": " Religion , Biblical Studies , Bible Study Guides",
        "Publisher": "WaterBrook Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Our Family Tree - A Keepsake Book",
        "Authors": "By Barbara Briggs Morrow",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Lt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Discover Your Child's DQ Factor: The Discipline Quotient System",
        "Authors": "By Cynaumon, Greg",
        "Description": "Why does one child straighten up with only a stern glance from Mom, while another may require her parents to take away privileges or give her a time out? According to Dr. Greg Cynaumon, it's because each child has a personal Discipline Quotient--a disciplinary \"temperament\" that makes some methods work better than others. Including individual self-tests to help parents identify the D.Q. of each of their children, this book promises not only to stop rebellion before it starts, but to bring families closer together.",
        "Category": " Psychology , Developmental , Child",
        "Publisher": "Integrity Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Remembering the Hiragana: A Complete Course on How to Teach Yourself the Japanese Syllabary in 3 Hours",
        "Authors": "By Heisig, James W.",
        "Description": "",
        "Category": "",
        "Publisher": "Japan Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Pranked (Summer Camp Secrets)",
        "Authors": "By Grant, Katy",
        "Description": "\" Dear __________,   I dreaded coming to camp Pine Haven and my first week here was the worst. While my best friend was sunbathing on the beach in Hawaii, I was stuck with outdoor showers, a rickety cabin, and only one friend -- quiet, boring Melissa. Then the \"Evil Twins\" showed up. It turned out they're totally cool and they wanted to be my friend! They're not really evil -- well, not to me, at least. They AREN'T too nice to Melissa. We started playing a few pranks and it's kind of gotten out of controlÉ.I know I should put a stop to thinks, but I don't want to lose my only friends here. I just hope that I don't do anything I regret.   Love,   Kelly",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Here at the End of the World We Learn to Dance",
        "Authors": "By Jones, Lloyd",
        "Description": "In tango, there are no wrong turns. But every dance begins with a backward step.Taking his cue from the tango, the acclaimed author of Mister Pip has written a thrilling and sensuous novel about how we fall in love.Ranging from rural New Zealand during the final days of World War I to Buenos Aires at mid-century to the present day, this masterful novel intertwines two love stories across three generations. The deep suspicions of an isolated community in the midst of war force Louise and Schmidt—two near-strangers—to hide in a cave overlooking the ocean. Desperate for solace, Schmidt teaches Louise the tango, and the iconic dance becomes their mutual obsession and the trigger for an affair that will span continents.Years later, Schmidt’s granddaughter, keeper of the family secrets, owns a restaurant in Wellington where a shy young student named Lionel washes the dishes. One day she snaps her fingers in his direction and says: “I need to dance.” Brilliantly evoking the seductive power of one of the world’s most famous dances, Lloyd Jones’s novel is a virtuoso performance.",
        "Category": " Fiction , Sagas",
        "Publisher": "Dial Press Trade Paperback",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Return of The Indian",
        "Authors": "By Lynne Reid Banks",
        "Description": "",
        "Category": "",
        "Publisher": "Collins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "MATH SEARCH FOR KNOWLEDGE",
        "Authors": "By Kline, Morris",
        "Description": "",
        "Category": " History , Europe , Great Britain",
        "Publisher": "Oxford University Press, USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Only in New York: 400 Remarkable Answers to Intriguing, Provocative Questions About New York City",
        "Authors": "By New York Times Company and Goldenberg, Stuart (ILT)",
        "Description": "400 Questions and Answers to the Big Apple's oddest mysteries: from the pages of the New York TimesNew York has long held a place as the nation's most admired and reviled city, provoking more debate, affection, and curiosity than any other. Generations of visitors and residents alike have pondered the city's enduring quirks and unusual traditions. In the F.Y.I. column in The New York Times, the paper's reporters and editors turn their talents to answering readers' most perplexing queries about the city, some of which include:* City with a Past: Where was the World Trade Center originally going to be located? Where was the last opium den in New York?* Underground, Underfoot: Is there a secret tunnel linking Police Headquarters to a nearby tavern? What was the busiest day in subway history?* The Name Game: Is there really a Main Street in Manhattan? What was the Street of Brides?* And lots more!Amply illustrated with Stuart Goldenberg's whimsical cartoons, and with an introduction from Constance Rosenblum, editor of the Times's City section, Only in New York is sure to generate laughter, delight, and \"Aha!\" reactions in anyone who has ever been stumped by one of Gotham's countless oddities.",
        "Category": " Travel , United States , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Born on Christmas Morn - Arch Books",
        "Authors": "By Melinda Busch & Melanie Hall",
        "Description": "",
        "Category": "",
        "Publisher": "Concordia Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Favorite Brand Name Recipes: Classic Recipe Collection",
        "Authors": "By Publications International Ltd",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "7.66",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Night Lost: A Novel of the Darkyn",
        "Authors": "By Viehl, Lynn",
        "Description": "Abandoned by his fellow Darkyn, Gabriel Seran is in continual torment as a prisoner of the religious zealots known as the Brethren. His only hope for rescue lies in Nicola Jefferson, a thief seeking a holy relic-and connected to Gabriel in more ways than she can possibly imagine...",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The New Walker's Logbook",
        "Authors": "By Mark Fenton",
        "Description": "",
        "Category": "",
        "Publisher": "Walking Magazine",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    }
]