[
    {
        "Title": "Starting and Operating a Business in Maryland: A Step-By-Step Guide (SMARTSTART YOUR BUSINESS IN)",
        "Authors": "By Jenkins, Michael D.",
        "Description": "",
        "Category": " Business & Economics , Small Business",
        "Publisher": "Oasis Pr",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "The House of Seven Mabels (Jane Jeffry Mysteries, No. 13)",
        "Authors": "By Churchill, Jill",
        "Description": "Harried suburban single mom and delightfully incorrigible busybody Jane Jeffry returns to do some dangerous housecleaning in another charming whodunit from America's Agatha Award-winning answer to Dame Agatha Christie: Jill Churchill.Homemaking is about to take on a whole new meaning for Jane Jeffry now that she's agreed to help restore and redecorate a decrepit old neighborhood mansion. The home's owner, the prosperously divorced Bitsy Burnside, considers herself to be a feminist to the max and wants an almost all-female crew to do the dirty work -- prompting the quick-witted Shelley Nowack to dub the project \"the House of Seven Mabels.\" With her best friend and decorating whiz Shelley on the estrogen-heavy team, Jane thinks this exhausting, plaster-dusty job may not be as unpleasant as it initially appeared to be.Until, of course, things start to get very messy. It begins with a series of mean-spirited \"pranks\" -- strange odors, mysterious electrical shorts, a myriad of petty annoyances designed to impede the progress of the fixer-uppers. And then the pranks turn deadly, leaving one of the workers lying lifeless at the foot of a staircase.Tragic, yes, but an accident? Jane thinks not. And with the able assistance of Shelley, not to mention a little help from her best beau, Chicago detective Mel VanDyne, Jane's hoping she can construct a solid case and nail the assassin. Suspects are certainly in abundant supply. The surviving members of Bitsy's building brigade all had the opportunity. Joe Budley -- the contractor originally hired, then fired when Bitsy had her \"no men allowed\" epiphany -- had a motive. But the more Jane saws away at the truth, the more complicated the criminal blueprint appears. And she may be painting herself into a comer, leaving no exit if a crafty killer decides to make Jane Jeffry the next demolition project.",
        "Category": " Fiction , Literary",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "The Best American Science Writing 2003",
        "Authors": "By Sacks, Oliver W. (EDT) and Cohen, Jesse (EDT)",
        "Description": "In his introduction to The Best American Science Writing 2003, Dr. Oliver Sacks, \"the poet laureate of medicine\" New York Times writes that \"the best science writing . . . cannot be completely 'objective' -- how can it be when science itself is so human an activity? -- but it is never self-indulgently subjective either. It is, at best, a wonderful fusion, as factual as a news report, as imaginative as a novel.\" Following this definition of \"good\" science writing, Dr. Sacks has selected the twenty-five extraordinary pieces in the latest installment of this acclaimed annual.      This year, Peter Canby travels into the heart of remote Africa to track a remarkable population of elephants; with candor and tenderness, Floyd Skloot observes the toll Alzheimer's disease is taking on his ninety-one-year-old mother, and is fascinated by the memories she retains. Gunjan Sinha explores the mating behavior of the common prairie vole and what it reveals about the human pattern of monogamy. Michael Klesius attempts to solve what Darwin called \"an abominable mystery\": How did flowers originate? Lawrence Osborne tours a farm where a genetically modified goat produces the silk of spiders in its milk. Joseph D'Agnese visits a home for retired medical research chimps. And in the collection's final piece, Richard C. Lewontin and Richard Levins reflect on how the work of Stephen Jay Gould demonstrated the value of taking a radical approach to science.     As Dr. Sacks writes of Stephen Jay Gould -- to whose memory this year's anthology is dedicated -- an article of his \"was never predictable, never dry, could not be imitated or mistaken for anybody else's.\" The same can be said of all of the good writing contained in this diverse collection.",
        "Category": " Science , Essays",
        "Publisher": "Ecco",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The Children of Noah",
        "Authors": "By Patai, Raphael, Hornell, James, and Lundquist, John M.",
        "Description": "Here the late Raphael Patai (1910-1996) recreates the fascinating world of Jewish seafaring from Noah's voyage through the Diaspora of late antiquity. In a work of pioneering scholarship, Patai weaves together Biblical stories, Talmudic lore, and Midrash literature to bring alive the world of these ancient mariners. As he did in his highly acclaimed book The Jewish Alchemists, Patai explores a subject that has never before been investigated by scholars. Based on nearly sixty years of research, beginning with study he undertook for his doctoral dissertation, The Children of Noah is literally Patai's first book and his last. It is a work of unsurpassed scholarship, but it is accessible to general readers as well as scholars. An abundance of evidence demonstrates the importance of the sea in the lives of Jews throughout early recorded history. Jews built ships, sailed them, fought wars in them, battled storms in them, and lost their lives to the sea. Patai begins with the story of the deluge that is found in Genesis and profiles Noah, the father of all shipbuilders and seafarers. The sea, according to Patai's interpretation, can be seen as an image of the manifestation of God's power, and he reflects on its role in legends and tales of early times. The practical importance of the sea also led to the development of practical institutions, and Patai shows how Jewish seafaring had its own culture and how it influenced the cultures of Mediterranean life as well. Of course, Jewish sailors were subject to the same rabbinical laws as Jews who never set sail, and Patai describes how they went to extreme lengths to remain in adherence, even getting special emendations of laws to allow them to tie knots and adjust rigging on the Sabbath. The Children of Noah is a capstone to an extraordinary career. Patai was both a careful scholar and a gifted storyteller, and this work is at once a vivid history of a neglected aspect of Jewish culture and a treasure trove of sources for further study. It is a stimulating and delightful book.",
        "Category": " History , Jewish",
        "Publisher": "Princeton University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Blackwater Sound: A Novel",
        "Authors": "By Hall, James W.",
        "Description": "The Braswell family had everything people would kill for: money, looks, power. But their eldest son, the family's shining light, died in a bizarre fishing accident. And when he disappeared-hauled into the depths by the giant marlin he had been fighting-he took with him a secret so corrupt that it could destroy the Braswells. Ten years later, a huge airliner crashes in the steamy shallows off the Florida coast, killing all aboard. Helping pull bodies from the water, Thorn finds himself drawn into a bizarre conspiracy: someone has developed a high tech weapon capable of destroying electrical systems in a powerful flash. The terrorist potential is huge. How are the secretive Braswells and their family-owned company, MicroDyne, involved? And what does it have to do with the family's obsessive hunt for the great marlin that killed their golden boy? With the Braswells, James W. Hall introduces one of the most evil and dysfunctional families in the history of fiction. And, along with Thorn, he brings back favorite characters from his earlier books, including Alexandra Rafferty and her father, Lawton Collins, a retired and increasingly dotty former police investigator whose methods of investigation result in his kidnapping. A story that bristles with all the heat and tension of a tropical Florida summer, Blackwater Sound is destined to rank among the greatest suspense thrillers of the new decade.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Against All Enemies",
        "Authors": "By Coyle, Harold",
        "Description": "The bestselling author of Team Yankee, \"master of military fiction\" Harold Coyle returns. In a novel both exciting and frighteningly realistic, Harold Coyle demonstrates once again that one of the nation's most important struggles is being fought on its own territory.Freedom. It is brought settlers to America's coasts, and it's the ideal that many laid down their lives to preserve. But, as the greatest nation in the world enters the new millennium, America finds itself once again split over the concept of liberty and justice for all.When one man decides to send a message to the government by bombing a federal building, the explosion is felt all across the country. The chain reaction that follows resonates most powerfully with members of a rebel band in Idaho who call themselves \"Patriots\" they want freedom from government control, no matter how much deadly force it takes. Their well-planned acts of terrorism soon show the government that they cannot be ignored and that definite action is needed.Thrown into the battle is Lieutenant Nathan Dixon, fresh from VMI, and a soldier who stands in the very large shadow of his father, the revered General Scott Dixon. Sent to quell a potentially dangerous situation, he'll need every bit of his training, for Nathan finds himself catapulted into the first battle of a new American war of secession.Covering the news is Nathan's stepmother, prominent anchorwoman Jan Fields. As the country watches, Jan discovers that Idaho's charismatic governor, George Oliver \"GO\" Thomas has an agenda of his own, one that may truly have a revolutionary effect on the whole country.Using the hard-edged style that made him famous, Harold Coyle takes us inside an all too plausible America where a nation is divided over the ideals on which this country was founded. In this modern military thriller, Coyle gives us an intimate portrait of the men and women who fight to uphold their, visions of America against all enemies.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Call Me the Breeze",
        "Authors": "By McCabe, Patrick",
        "Description": "In a small town in Northern Ireland, in the troubling psychedelic-gone-wrong atmosphere of the late seventies, Joey Tallon embarks on a journey of selfhood, of redemption, and of rebirth. A man deranged by desire, and longing for belonging, with the words of T. S. Eliot as his guide -- \"We shall not cease from exploration / And the end of all our exploring / Will be to arrive where we started / And know the place for the first time\" -- Tallon searches for his \"place of peace,\" a spiritual landscape located somewhere between Ireland and Iowa, and maybe between heaven and hell.Following the delusional, but also ultimately likable, Tallon on his quest, we unwittingly enter a world constructed by a character who is arguably more lucid during his acid trips than when he's sober. What begins as a baffling mystery in McCabe's hands becomes a raucous and ribald adventure. From Tallon's punk rock beginnings, to his stewardship of his prison's literary society, to his brief tenure as director of the Youth in Action Creative Arts Awareness Scheme, and finally to his bull-like charge into the political arena, Joey's journey toward enlightenment and deliverance takes readers into the innermost heart of a man at odds with himself and the violent, sometimes surreal world around him.Hilarious, poignant, and unpredictable, Call Me the Breeze is a literary odyssey five years in the making. It is Patrick McCabe at his absolute best.",
        "Category": " Fiction , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.34",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Gone For Good",
        "Authors": "By Coben, Harlan",
        "Description": "Harlan Coben earned the raves of critics everywhere for his New York Times bestselling thriller, Tell No One, hailed as “pulse-pounding” (People), “compelling and original” (Los Angeles Times), and “a thriller of runaway tension” (Iris Johansen). Now, in a bold new novel, Coben continues to stake out new ground in suspense, unleashing a haunting tale of secrets and betrayal...and of one man’s search for his missing brother that spirals into a breakneck hunt for a killer, a victim, and the truth.As a boy, Will Klein had a hero: his older brother, Ken. Then, on a warm suburban night in the Kleins’ affluent New Jersey neighborhood, a young woman--a girl Will had once loved--was found raped and murdered in her family’s basement. The prime suspect: Ken Klein. With the evidence against him overwhelming, Ken simply vanished, spending the next decade as the elusive subject of rumors, speculation, and an international manhunt. When his shattered family never heard from Ken again, they were sure he was gone for good.Now eleven years have passed. And Will, who always believed in his brother’s innocence, has found evidence that Ken is alive--even as he is struck by another act of betrayal. His girlfriend suddenly disappears, leaving behind compelling evidence that she was not the person Will thought she was. As two dark dramas unwind around him, Will is pulled into a violent mystery, haunted by signs that Ken is trying to contact him after all these years. Will can feel himself coming closer and closer to his brother . . . and to a terrible secret that someone will kill to keep buried. And as the lies begin to unravel, Will is uncovering startling truths about his lover, his brother, and even himself. He knows he must press his search all the way to the end. Because the most powerful revelations are yet to come....Gone for Good is at once a powerhouse of suspense and a haunting tale of love--the love between brothers, between lovers, between family members. It is one of those rare thrillers that not only make the pulse pound, but stir the heart as well.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Joseph's Bones: Understanding the Struggle Between God and Mankind in the Bible",
        "Authors": "By Segal, Jerome M.",
        "Description": "It's almost impossible to think of the Bible as anything other than the expression of the religious traditions that view it as Holy Scripture. Yet given that vital parts of it were written as much as a thousand years before the emergence of rabbinic Judaism and the birth of Christianity, there is no obvious reason why this should be true. In his groundbreaking new book, Joseph's Bones: Understanding the Struggle Between God and Mankind in the Bible, philosopher Jerome Segal offers a fresh and vigorous reexamination of the oldest part of the Bible.  In Joseph's Bones, Segal asks you to imagine that you know nothing about Judaism or Christianity and one day pick up something called \"The Hexateuch\" (the first six books of the Bible). How would you understand the story it recounts? Who is God? And who are the Israelites? And perhaps most important, what is the relationship between God and humanity?  Segal maintains that if we approach the Bible without preconceptions, we will find something unexpected: a brilliant, sophisticated, and highly cohesive account of the human condition. He argues that the Bible reads like an existential novel about the struggle between God and mankind, and is far more sympathetic to mankind than to God.  Segal frames his analysis by considering the tale of Joseph's bones. In the closing words of Genesis, as Joseph lies dying in Egypt, Joseph has the \"sons of Israel\" swear that when God returns the Israelites to the Promised Land, they will take his bones with them. Some four hundred years later, as the Book of Joshua closes, the Israelites honor this commitment by returning and burying Joseph's bones in Canaan, as their ancestors had pledged.  Noting that throughout the early parts of the Bible God often seethes with anger at the Israelites, calling them \"faithless\" and \"wicked,\" Segal uses the story of Joseph's faith in his people and their fidelity to him to illustrate how the Bible does not always share God's perspective on the Israelites or on mankind in general.  Segal then provides a systematic reinterpretation of the Bible story and comes to see it as the people's book, written as a way to understand the human condition in a universe governed by a powerful and morally complex deity.  He contends that the Bible does not view morality as dependent on God. Rather, it understands moral truths to be objective aspects of reality that limit even God's freedom of action, though God himself resists such a notion. Segal maintains that in the great saga of mankind's struggle with God, Abraham and Moses emerge as heroes, each seeking to protect mankind from God's unpredictable and often unwarranted wrath. The book's final section explores how this rethinking of the Hexateuch transforms the story of Jesus in the New Testament in ways neither Christians nor Jews have considered.  Both a radically new way of understanding the Biblical texts and a lively examination of it, Joseph's Bones is an anomaly of Biblical interpretation: brilliant, rigorously argued, and thoroughly original. It is at once persuasive scholarship and a captivating read.",
        "Category": " Religion , Biblical Studies , History & Culture",
        "Publisher": "Riverhead Hardcover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Thinking Creatively",
        "Authors": "By Landa, Robin",
        "Description": "Describes a variety of techniques for coming up with creative ideas, and suggests more than forty visual thinking exercises",
        "Category": " Design , Graphic Arts , General",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "The Skilled Helper: A Systematic Approach to Effective Helping, Fourth Edition",
        "Authors": "By Egan, Gerard",
        "Description": "",
        "Category": "",
        "Publisher": "Brooks/Cole Pub Co",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Courage to Heal - Third Edition - Revised and Expanded: A Guide for Women Survivors of Child Sexual Abuse",
        "Authors": "By Bass, Ellen and Davis, Laura",
        "Description": "The Courage to Heal is an inspiring, comprehensive guide that offers hope and encouragement to every woman who, was sexually abused as a child -- and those who care about her. Although the effects of child sexual abuse are long-term and severe, healing is possible. The authors weave personal experience with professional knowledge to show the reader how she can come to terms with her past while moving powerfully into the future. They provide clear explanations, practical suggestions, a map of the healing journey, and many moving first-person examples of the recovery process drawn from their interviews with hundreds of survivors.Definitive in scope, The Courage to Heal speaks directly to the survivor in a warm and personal way:TAKING STOCK -- outlines the effects of child sexual abuse and the ways women cope over time.THE HEALING PROCESS -- explores each stage from the decision to heal and remembering through breaking silence, knowing it wasn't your fault, nurturing the inner child, and grief and anger, to resolution and moving on.CHANGING PATTERNS -- offers in-depth guidance for shifting self-defeating patterns in specific areas of one's present life, including self-esteem, feelings, intimacy, sexuality, and dealing with families.SUPPORTERS OF SURVIVORS -- provides insight and strategies for partners of survivors, family members, and counselors.COURAGEOUS WOMEN -- profiles survivors who share the challenges and triumphs of their own healing journeys.HONORING THE TRUTH -- a substantial new Afterword that refutes the \"false memory\" argument and presents a thorough and enlightening response to the backlash.RESOURCE GUIDE -- fully updated for this edition -- informs readers about therapy, healing activities, recommended reading, support groups, self-help programs, and services and organizations.",
        "Category": " Self-help , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Bailey's Cafe",
        "Authors": "By Naylor, Gloria",
        "Description": "Set in a diner where the food isn't very good and the ambience veers between heaven and hell, this bestselling novel from the author of Mama Day and The Women of Brewster Place is a feast for the senses and the spirit. \"A virtuoso orchestration of survival, suffering, courage and humor.\"--New York Times Book Review.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "The Purpose Driven Life for Commuters: What on Earth Am I Here For?",
        "Authors": "By Warren, Rick",
        "Description": "The #1 New York Times bestseller, with over twenty million copies sold, now available in an abridged audio CD. With the new abridged audio for commuters, people driving to work, riding the bus or subway, or flying cross-country will be able to experience the life-changing message of The Purpose Driven Life.It will help you understand why you are alive and God's amazing plan for you---both here and now, and for eternity. Rick Warren will guide you through a personal 40-day spiritual journey that will transform your answer to life's most important question: What on earth am I here for? Knowing God's purpose for creating you will reduce your stress, focus your energy, simplify your decisions, give meaning to your life, and, most important, prepare you for eternity.This recording (available in both CD and cassette formats) offers a blueprint for Christian living in the 21st century---distilled wisdom on what life is all about.'One of the people who mattered most in 2004.'--- Time Magazine'Warren has a knack for giving people a sense of purpose when life can seem materialistic and meaningless.'--- The Los Angeles Times'Rick Warren has the answer to the meaning of life.'--- USA Today'Read and studied by millions of people in and out of churches across the country.'--- The Washington Post",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Personal Values",
        "Authors": "By Senske, Kurt",
        "Description": "",
        "Category": " Religion , Ethics",
        "Publisher": "Fortress Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Downsize This! Random Threats from an Unarmed American",
        "Authors": "By Moore, Michael",
        "Description": "Americans today are working harder, working longer and yet for most of us, in this time of ruthless downsizing and political cronyism, job security, a decent standard of living and a comfortable retirement are becoming harder and harder to find. In this brilliantly funny and right-on-target diatribe, irreverent everyman Michael Moore gives his own bold views on who's behind the fading of the American dream.   Whether issuing Corporate Crook trading cards, organizing a Rodney King Commemorative Riot, sending a donation to Pat Buchanan from the John Wayne Gacy fan club (which was accepted) or trying to commit former right-wing congressman Bob Dornan to a mental hospital, the in-your-face host of TV Nation and director/star of Roger & Me combines an expansive wit with biting social commentary to make you think and laugh at the same time.   In hardcover, Downsize This! stormed the bestseller lists of the New York Times, Wall Street Journal, Washington Post, San Francisco Chronicle and others. Given Michael Moore's enormous -- and growing -- constituency, this trade paperback edition brings his unique perspective on the nation to an even greater audience.",
        "Category": " Political Science , Political Freedom",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Shaiton's Fire (Chapter 16: Waging War on Terror, Book 1)",
        "Authors": "By Thoene, Jake and Thoene, Rachel",
        "Description": "Shaiton's Fire, the first book in the techno-thriller series Chapter 16, propels you into the world of domestic counter-terrorism. The bombing of a subway train is only the beginning of a master plan that Steve Alstead—tactical operations specialist—and the rest of the team have to stop . . . before it's too late.",
        "Category": " Fiction , Historical",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Pink Slip",
        "Authors": "By Ciresi, Rita",
        "Description": "Lisa Diodetto's mother may be ready for her to get married but Lisa isn't. At her sister's wedding she ducks when the bridal bouquet comes floating her way, and the only \"eligible bachelor\" in Lisa's life is her beloved gay cousin, Dodie.Ditching her life as an underpaid, oversexed publishing drone in Manhattan, Lisa takes a lucrative spot at a more conservative company, and begins writing--on company time--a novel that pokes fun at corporate life. Enter Lisa's main character: her new boss, Eben Strauss. A man of manners and caution, Strauss manages to bring out the best bad girl in Lisa. And before they know it, two very different people from two very different worlds are doing the one thing you should never do at the office: falling in love.In her funny, familiar, heartbreaking new novel, the award-winning author of Blue Italian weaves a tale of family, work, sex, and love--and of all the things we try to leave behind but never really can. . . .",
        "Category": " Fiction , Women",
        "Publisher": "Delta",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "No Man's Land: Men's Changing Commitments To Family And Work",
        "Authors": "By Gerson, Kathleen",
        "Description": "What does it mean to be a man in a world where women are almost as likely as men to shoulder the responsibilities of supporting a family? Why do some men still choose to be traditional breadwinners while others flee the responsibilities of parenthood altogether, and still others become infinitely more involved in family life than earlier generations of men? Here&#39;s a look at how men are coping with the gender revolution.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Giant Book of Womans Health Secrets",
        "Authors": "By Bodmer, Kerri",
        "Description": "",
        "Category": "",
        "Publisher": "Soundview Publications",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Just Revenge",
        "Authors": "By Dershowitz, Alan M.",
        "Description": "One of the foremost courtroom lawyers of his generation. Alan M. Dershowitz takes controversial stands based on the principle of equal justice for all. Along the way, he has authored the #1 New York Times bestseller Chutzpah; the bestselling account of the Claus von Bulow case Reversal of Fortune; and the bestselling courtroom drama The Advocate's Devil. Now Dershowitz has written a novel that is at once personal, passionate, and towering: an explosive legal thriller that pits Dershowitz's literary alter ego, attorney Abe Ringel, against the worst crime of the twentieth century -- the Holocaust.What if you witnessed the most abominable deeds that human beings can inflict upon each other? What if you came face-to-face with the very man who had slaughtered your family before your eyes? That is the question confronted by a celebrated professor named Max Menuchen. Max has found the man who had killed his entire family in cold blood more than a half century before. Max, who has never before broken a law, cannot turn down his chance for revenge.In 1943 Marcellus Prandus was a Lithuanian militia captain who carried out the blood-thirsty orders of his Nazi commanders during World War II. Today he is an old man living outside Boston. For Max, who has discovered Prandus's identity by chance, killing him is not enough, because Prandus is already dying of cancer. How can Max make Prandus suffer exactly as Max himself did? Can Max bring himself to assassinate Prandus's children and grandchildren and make the old man watch his family die, as Max himself was forced to do?By the time defense attorney Abe Ringel enters the case, Max has carried out an astounding act of revenge, and America'sgreat Holocaust trial has begun: an explosive legal and moral struggle to find the light of justice within the darkness of human evil. With Max facing almost certain conviction, Ringel desperately tries to prove his actions we",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Savage Inequalities: Children in America's Schools",
        "Authors": "By Kozol, Jonathan",
        "Description": "An account of the inequity in the American educational system explores the deplorable conditions--decaying buildings, overcrowding, understaffing, deteriorating neighborhoods--in which inner-city children are educated. Reprint. NYT. $50,000 ad/promo. Tour.",
        "Category": " Political Science , Public Policy , Social Services & Welfare",
        "Publisher": "HarpPeren",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "The Consumer's Guide to Effective Environmental Choices: Practical Advice from The Union of Concerned Scientists",
        "Authors": "By Brower, Michael and Leon, Warren",
        "Description": "From one of the most prestigious nonprofit organizations devoted to environmental issues comes a clear, practical, and rational overview of the relationship between consumers and the environment.        Paper or plastic? Bus or car? Old house or new? Cloth diapers or disposables? Some choices have a huge impact on the environment; others are of negligible importance. To those of us who care about our quality of life and what is happening to the earth, this is a vastly important issue. In these pages, the Union of Concerned Scientists help inform consumers about everyday decisions that significantly affect the environment. For example, a few major decisions--such as the choice of a house or vehicle--have such a disproportionately large affect on the environment that minor environmental infractions shrink by comparison.                This book identifies the 4 Most Significant Consumer-Related Environmental Problems, the 7 Most Damaging Spending Categories, 11 Priority Actions, and 7 Rules for Responsible Consumption. Learn what you can do to have a truly significant impact on our world from the people who are at the forefront of scientific research.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "A Miracle Every Day: Triumph and Transformation in the Lives of Single Mothers",
        "Authors": "By Golden, Marita",
        "Description": "A Miracle Every Day takes an illuminating and intimate look at flourishing single-mother families. Single motherhood and the children of single mothers have been the subject of overwhelmingly negative statistical analysis. But, asks Marita Golden, where are the studies that analyze the strengths of single mothers, the positive adaptive skills learned by their children, the support systems that help these families work? In A Miracle Every Day Golden, once a single mother herself, and several other single mothers and their family members share their success stories with great honestly and insight. Golden identifies the coping characteristics these families have in common and organizes them into guiding themes, making A Miracle Every Day a book that single mothers and their support networks can turn to for wisdom, comfort, and inspiration.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Knopf Doubleday Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Speaking with the Angel",
        "Authors": "By Hornby, Nick (EDT)",
        "Description": "Nick Hornby…Giles Smith…Helen Fielding…Roddy Doyle…Irvine Welsh…Zadie Smith…Dave Eggers…Robert Harris…Melissa Bank…Patrick Marber…Colin Firth…John O’FarrellCompiled by bestselling author Nick Hornby and featuring brand new stories from the hottest writers on both sides of the Atlantic, Speaking with the Angel is a fresh and funny collection that is sure to be the literary anthology of the year.Here is a book that was inspired by a very special boy and a very special school.  Some money from each copy of Speaking with the Angel sold will benefit autism education charities around the world, including The Treehouse School in London, where Nick’s son Danny is a student, and the New York Child Learning Institute here in the States.  This project is truly a labor of love for Hornby and the other writers involved, many of whom are Nick’s friends.These original first-person narratives come from the most exciting voices in fiction.  Melissa Bank gives readers a glimpse into the mind of a modern New Yorker whose still-new relationship is a constant source of surprise in “The Wonder Spot.”  In Zadie Smith’s “I’m the Only One,” a young man recalls his strained relationship with his diva-esque sister.  Dave Egger’s “After I Was Thrown in the River and Before I Drowned,” is told from the viewpoint of an unfortunate pit bull.  Helen Fielding offers up a new twist on I’ve fallen and I can’t get up in “Luckybitch.”  And in Nick Hornby’s “NippleJesus,” a bruiser finds out that guarding modern art is far more hazardous than controlling the velvet ropes at a nightclub.  Speaking with the Angel also includes stories from Roddy Doyle, Irvine Welsh, Colin Firth, John O’Farrell, Robert Harris, Patrick Marber, and Giles Smith. Twelve completely new stories, written by twelve undeniably imaginative voices.  Speaking with the Angel is at turns clever, outrageous, witty, edgy, tender, and wicked.  This is what they meant by original.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Century of Struggle  - The Women's Rights Movement of the United States",
        "Authors": "By Eleanor Flexner",
        "Description": "",
        "Category": "",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Edith's Strange Desires",
        "Authors": "By no author name",
        "Description": "",
        "Category": "",
        "Publisher": "GROVE PRESS * (NY)",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "It happened in Pennsylvania;",
        "Authors": "By Graeff, Arthur D.",
        "Description": "",
        "Category": "",
        "Publisher": "J. C. Winston Co",
        "Price Starting With ($)": "29.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1947"
        }
    },
    {
        "Title": "DK Essential Managers: Reducing Stress",
        "Authors": "By Hindle, Tim",
        "Description": "",
        "Category": " Business & Economics , Labor",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Lessons For Dylan: On Life, Love, the Movies, and Me",
        "Authors": "By Siegel, Joel",
        "Description": "In an autobiographical memoir directed to his young son Dylan, the film and theater critic uses stories and anecdotes to present the story of his life and the life lessons he has learned.",
        "Category": " Philosophy , Ethics & Moral Philosophy",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Driven to Distraction: Recognizing and Coping with Attention Deficit Disorder from Childhood Through Adulthood",
        "Authors": "By Hallowell, Edward M. and Ratey, John J.",
        "Description": "Through vivid stories of the experiences of their patients (both adults and children), Drs. Hallowell and Ratey show the varied forms ADD takes -- from the hyperactive search for high stimulation to the floating inattention of daydreaming -- and the transforming impact of precise diagnosis and treatment.",
        "Category": " Psychology , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Dirty Linen: A Fred Taylor Art Mystery (Fred Taylor Art Series, 4)",
        "Authors": "By Kilmer, Nicholas",
        "Description": "Nicholas Kilmer writes the most gripping--and well researched--art mysteries of today. With all of the artworld's chicanery and multimillions at stake, the action never flags. This time the cache is an improbable portfolio of erotica purchased clandestinely at a seaside auction, and protecting it leaves collector Clayton Reed mired deep in the seamy underbelly of a Fall River brothel! The pictures may illuminate the dark side of a major artist. Shades of Degas and Toulouse-Lautrec.... Reed and his scholarly man Friday, Fred Taylor, provide the best mystery tandem this side of Nero Wolfe and Archie, matching wits with a well-etched, mixed cast of villains from both country-club and peerage. This is Kilmer at full throttle, a work with characteristic panache.\"\" --Larry A. Silver, Farquhar Professor of History of Art, University of Pennsylvania, who writes an Afterword for Dirty Linen. Originally published in 1999 by Henry Holt, Dirty Linen is the fourth Fred Taylor art mystery following Poisoned Pen Press' releases of Harmony in Flesh and Black, Man with a Squirrel, and O Sacred Head.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Poisoned Pen Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Online weather studies",
        "Authors": "By Moran, Joseph M",
        "Description": "",
        "Category": "",
        "Publisher": "American Meteorological Association",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "When You and Your Mother Can't Be Friends: Resolving the Most Complicated Relationship of Your Life",
        "Authors": "By Secunda, Victoria",
        "Description": "“A book of great value for every daughter and every mother; useful for sons, too.”—Benjamin Spock, M.D. From the Introduction:The goal of this book is to help readers achieve that separation so that they can either find a way to be friends with their mothers, or at least recognize and accept that their mothers did the best they could—even if it wasn't “good enough”—and to stop blaming them. Among the issues to be covered: • To understand how a daughter's attachment to her mother—more so than her relationship with her father—colors all her other relationships, and to analyze why it is more difficult for daughters than sons to separate from their mothers, as well as why daughters are more subject than sons to a mother's manipulation• To recognize the difference between a healthy and a destructive mother-daughter connection, and to define clearly the “bad mommy,” in order to help readers who have trouble acknowledging their childhood losses to begin to comprehend them• To conjugate what I call the “Bad Mommy Taboo”—why our culture is more eager to protect the sanctity of maternity than it is to protect emotionally abused daughters • To describe the evolution of the \"unpleasable\" mother—in all likelihood, she was bereft of maternal love as a child—and to recognize the huge, and often poignant, stake she has in keeping her grown daughter dependent and off-balance• To illustrate the consequent controlling behavior—in some cases, cloaked in fragility or good intentions—of such mothers, which falls into general patterns, including: the Doormat, the Critic, the Smotherer, the Avenger, the Deserter • To understand that the daughter has a similar stake in either being a slave to or hating her mother—the two sides of her depen dency and immaturity • To illustrate the responsive behavior—and survival mechanisms —of daughters, which is determined in part by such variables as birth rank, family history, and temperament, and which also falls into patterns, including: the Angel, the Superachiever, the Cipher, the Troublemaker, the Defector • To show how to redefine the mother-daughter relationship, so that each can learn to see and accept the other as she is today, appreciating each other's good qualities and not being snared by the bad• Finally, to demonstrate that a redefined relationship with one's mother—adult to adult—frees you from the past, whether that re definition ultimately results in real friendship, affectionate truce, or divorce.",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Delta",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Furious Pursuit Workbook: Discovering Why God Will Never Let You Go",
        "Authors": "By King, Tim and Martin, Frank",
        "Description": "A Sacred Journey Toward the Heart of GodGo deep into the things of God by allowing God to go deep into the things of your life!In your relationship with God, there is a romance to be embraced, a courtship to be nurtured, and a marriage to be consummated. And this relationship demands a level of  intentionality. Of learning to walk with God daily, trusting in his goodness and mercy, resting in his faithfulness. Of allowing his furious pursuit to transform the nature of your relationship to him. Inside, you’ll encounter such transforming truths as: ·What it means to be pursued by Love·God’s quest for a willing heart·Navigating the “thorn stories” of pain, loneliness, and rejection ·Embracing the vows of a Sacred Lover·Accepting God’s Divine Proposal·Recovering the Larger Story of God’s unrelenting faithfulness Take advantage of the life-changing tools and resources, including questions for individual and group study, a daily Conversations & Reflections Journal, and daily inspirational messages available at www.furiouspursuit.com. Let God take responsibility for your relationship with him, so you can experience the freedom and acceptance that are already yours. Frank Martin and Tim King invite you on a journey of personal and spiritual transformation, a journey toward fully embracing the Furious Pursuit of God!The companion workbook to Furious Pursuit by Frank Martin and Tim King",
        "Category": " Religion , Christian Living , General",
        "Publisher": "WaterBrook Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Baby Bargains: Secrets to Saving 20% to 50% on Baby Furniture, Equipment, Clothes, Toys, Maternity Wear and Much, Much More!",
        "Authors": "By Fields, Denise",
        "Description": "The latest edition of the popular nursery guide shows readers how to outfit a room for the new arrival within a budget, offering money-saving tips on baby furniture, equipment, clothing, toys, maternity wear, child carriers, online sources, catalogs, and more. Original. 70,000 first printing.",
        "Category": " Reference , Consumer Guides",
        "Publisher": "Windsor Peak Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Stories: Contemporary Southern Short Fiction",
        "Authors": "By Hays, Donald (EDT)",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "University of Arkansas Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "The Best American Essays 2000 (The Best American Series)",
        "Authors": "By Atwan, Robert (EDT) and Lightman, Alan (EDT)",
        "Description": "Best-selling author Alan Lightman selects the year’s finest nonfiction as this acclaimed series celebrates its fifteenth year. He has chosen a diverse, very personal collection that celebrates the essay as an independent genre unlike any other. This year’s pieces embrace stylistic freedom and strong opinions and afford the reader a fascinating view of the writer’s mind as it struggles with truth, memory, and experience. Featured writers include Jamaica Kincaid, Edward Hoagland, Cynthia Ozick, Mary Gordon, Edwidge Danticat, and others.",
        "Category": " Literary Criticism , American , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Design Essentials: Professional Studio Techniques",
        "Authors": "By Cohen, Luanne Seymour",
        "Description": "New edition of a manual that shows how to produce traditional graphic and photographic effects using Adobe software for Macintosh and Windows (Photoshop 5.0, Illustrator 8.0, and ImageReady). Cohen (former creative director at Adobe Systems) organizes the information around two-page color spreads that focus on particular techniques and combine simple instructions with pictures of the steps involved. In sections on drawing, painting, patterns and textures, text and special effects, and web techniques, she discusses aspects of classic design such as perspective grids, neon graphics, Illustrator pattern tiles in Photoshop, rainbow scratchboard type, posterized photographs, and animation along a path.  Distributed by Peachpit. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Computers , Programming , Games",
        "Publisher": "Adobe Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Happy Days #3 The Invaders",
        "Authors": "By Johnston, William",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap, New York",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Holiday Entertaining (Williams Sonoma Kitchen Library)",
        "Authors": "By Williams, Chuck (EDT) and Rosenberg, Allan (PHT)",
        "Description": "Gathers menus and recipes for holidays, including Thanksgiving, Hanukkah, Christmas, New Year's Eve, and New Year's Day",
        "Category": " Cooking , Holiday",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "The Little Book of Freemasonry",
        "Authors": "By Sangeet Duchane",
        "Description": "",
        "Category": "",
        "Publisher": "Fall River Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "In the Royal Manner: Expert Advice on Etiquette and Entertaining from the Former Butler to Diana, Princess of Wales",
        "Authors": "By Burrell, Paul",
        "Description": "Paul Burrell has worked in the service of the royal family for 22 years, working his way up from footman to the Queen, to Princess Diana's personal butler at both Highgrove and Kensington Palace. Now, for the first time ever, he shares the secrets of royal entertaining with the general public. Burrell covers all aspects of throwing the perfect party or dinner party for all occasions: invitations, place settings, menus, recipes, napkin folds, and the art of giving a toast. Featuring the rules of etiquette that set the standard at Buckingham Palace, color photographs of proper place settings and decorations, and favorite recipes of the royals, this is the comprehensive bible of entertaining at home.",
        "Category": " Social Science , Customs & Traditions",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "From Sea To Shining Sea: The Great American Seafood Cookbook",
        "Authors": "By Loomis, Susan",
        "Description": "For health, for variety, for flavor, seafood is the choice for an ever-increasing number of Americans. And this book is the seafood-lover's bible, featuring over 250 innovative and exciting recipes from homey fried clams to Aromatic Portuguese Hake to Salmon with Roasted Tomatoes and Garlic Cream; instructions on checking for freshness; clearly illustrated directions for fundamentals such as cleaning, skinning, and filleting fish; and step-by-step explanations of basic cooking methods that any beginner can follow.While writing the book, the author spent a lot of time with the people who make their livings from American waters, and her book is filled with their voices. With information, recipes, and thoughtful digressions about fish and the people who harvest them, plus a lexicon describing hundreds of species of edible sea creatures, The Great American Seafood Cookbook is a must for every seafood lover. Selection of the Better Homes & Gardens Family Book Service and Quality Paperback Book Club, and main selection of the Book-of-the-Month Homestyle Club. 130,000 copies in print.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Jefferson the Man: In His Own Words",
        "Authors": "By Jefferson, Thomas, Baron, Robert C. (EDT), and Library of Congress (COR)",
        "Description": "",
        "Category": " History , United States , General",
        "Publisher": "Fulcrum Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "New Small Garden, The",
        "Authors": "By Loewer, Peter",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "7.36",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "The Christmas Candy Book",
        "Authors": "By Pappas, Lou Seibert and Frankey, Frankie (PHT)",
        "Description": "Confection perfection is easy to achieve with the step-by-step help of dessert expert Lou Seibert Pappas. Why should Santa settle for another cookie, when he could nibble on Chocolate Mallo Fudge or Orange Liqueur Chocolate Truffles? Decked with Frankie Frankenys winsome photography and more than 40 recipes, The Christmas Candy Book is the stuff holiday dreams are made of. It includes Yuletide classics like buttery English Toffee and nutty Panforte di Siena as well as inventive dainties like Honey-Lavender Drops and adorable Marzipan Piglets. Stylish tips for serving, wrapping, and storing candies will inspire colorful tabletops and delightful gifts. Bursting with holiday cheer, The Christmas Candy Book is a sweet success from cover to cover.",
        "Category": " Cooking , Courses & Dishes , Confectionery",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Is Jesus a Republican or a Democrat?: And 14 Other Polarizing Issues",
        "Authors": "By Campolo, Tony",
        "Description": "",
        "Category": "",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "The Theory of the Leisure Class (Dover Thrift Editions)",
        "Authors": "By Veblen, Thorstein",
        "Description": "\"The most impressive satirist of his day.\" — Time MagazineWith devastating satiric wit, this book examines the hollowness and falsity suggested by the term \"conspicuous consumption\" (coined by Veblen) and exposes the emptiness of many cherished standards of taste, education, dress, and culture. Since its original publication in 1899, the work has become a classic of social and economic thought and policy and exerted an influence widely felt beyond the sphere of economics.For Veblen, the shallowness and superficiality of society resulted from the tendency to believe that true accomplishment lay in arriving at a condition of ostentatious wealth and status. In developing this thesis, he traces the origins and development of ownership and property, offering extraordinary insights into the phenomenon of consumerism, the evolution of class structure, the rise of leisure time and how modern societal goals are grounded in pecuniary aspirations and achievements.Students, sociologists, historians, economists — anyone interested in the motives and behavior of human beings within a large-scale social context — will find this time-honored investigation still relevant and readable over a century after its first appearance. It belongs in the library of every thinking person.",
        "Category": " Social Science , Social Classes & Economic Disparity",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Let Freedom Ring: The Words That Shaped Our America",
        "Authors": "By Inc. Sterling Publishing Co.",
        "Description": "We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the Pursuit of Happiness.With these stirring words from the Declaration of Independence, Americans pronounced themselves free. Here are the eloquent speeches, moving songs, soul-stirring poems, and indelible pictures that throughout history continue to inspire the nation. From the Pilgrims' \"Mayflower Compact\" in 1620 right up to President Bush's address to Congress after September 11, 2001, Let Freedom Ring spans more than 225 years of democracy in action.  Thomas Paine's \"These are the times that try men's souls\" resonates more powerfully today than ever, as does Roosevelt's \"A Date Which Will Live in Infamy.\" Sitting Bull's speech to the Senate Commission, Martin Luther King's forever thrilling \"I Have a Dream,\" Elizabeth Cady Stanton's declaration at Seneca Falls, and Emma Lazarus's \"The New Colossus\" movingly honor the spirit of American liberty. Hear America singing \"The Star-Spangled Banner,\" \"God Bless America,\" \"My Country 'Tis of Thee,\" and \"The Battle Hymn of the Republic,\" and read patriotic poetry such as \"Paul Revere's Ride.\" Glorious photographs of Old Glory, the Statue of Liberty, the White House, the Alamo, Mount Rushmore, public monuments, historical documents, and many more appear throughout in full color, and on the cover, in pride of place, is the Liberty Bell, ready to ring the sounds of freedom for us all.",
        "Category": " History , United States , State & Local , General",
        "Publisher": "Sterling",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Dictionary of Historic Documents",
        "Authors": "By Kohn, George C.",
        "Description": "A comprehensive alphabetical reference describing some 2,200 significant historical documents from Hammurabi's Code (c. 1700 B.C.) to the Strategic Arms Limitation Treaty of 1979. Each entry includes a concise summary describing the principal details of the document, its significance, and its historical context, as well as cross-references. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " History , World",
        "Publisher": "Facts on File",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "All Things To All Men (A Touchstone Book) (Touchstone Books (Paperback))",
        "Authors": "By Hodgson, Godfrey",
        "Description": "Hodgson argues that the institution of the presidency has lost much of its power in the last two decades, analyzes the causes of this impotence, and suggests changes that will enable future presidents to govern effectively",
        "Category": " Political Science , Public Affairs & Administration",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1981"
        }
    },
    {
        "Title": "The Big Book of American Trivia",
        "Authors": "By Lang, J. Stephen",
        "Description": "It's an extravaganza of the trivia kind! Impress your friends (or stump them) with knowledge about all things American—geography, history, entertainment, people, culture, and quirky miscellany. More than 3,000 questions (and answers) provide countless hours of fun as you learn fascinating facts about our marvelous country. The Big Book of American Trivia is perfect for parties, family gatherings, and vacations. This is trivia and Americana at their best!",
        "Category": " Reference , Trivia",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "A Treasury of Great American Scandals: Tantalizing True Tales of Historic Misbehavior by the Founding Fathers and Others Who Let Freedom Swing",
        "Authors": "By Farquhar, Michael",
        "Description": "Following on the heels of his national bestseller A Treasury of Royal Scandals, Michael Farquhar turns his attention to matters a little closer to home with A Treasury of Great American Scandals. From the unhappy family relationships of prominent Americans to the feuds, smear campaigns, duels, and infamous sex scandals that have punctuated our history, we see our founding fathers and other American heroes in the course of their all-too-human events. Ineffectual presidents, lazy generals, traitors; treacherous fathers, nagging mothers, ungrateful children, embarrassing siblings; and stories about insanity, death, and disturbing postmortems are all here, as are disagreeable marriages, vile habits, and, of course, sex: good sex, bad sex, and good-bad sex too. We can take comfort in the fact that we are no worse and no better than our forebears. But we do have better media coverage. Bonus educational material:       A brief history of the United States, including scandals!       The American Hall of Shame!       A complete listing of presidential administrations!",
        "Category": " Humor , Topic , Politics",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Easter 1916 and Other Poems (Dover Thrift Editions)",
        "Authors": "By Yeats, W. B.",
        "Description": "\"A terrible beauty is born,\" observed the greatest modern Irish poet after his country's 1916 Easter Rebellion against the British. This streak of proud nationalism, interwoven with elements of Celtic lore and mysticism, and infused with a hard-earned wisdom, makes Yeats's works resonate to this day. His career spanned five decades, earning him the Nobel Prize in Literature in 1923, and he is widely regarded as the finest English-language poet of the twentieth century.This volume contains a rich selection of poems from Yeat's mature work, including all the poems from The Wild Swans at Coole (1919) and Michael Robartes and the Dancer (1921). These memorable verses, embodying subtlety and objectivity in language of stark beauty and simplicity, offer a cross-section of Yeat's multifaceted poetic production.In addition to the famous title poem, the works collected here include the oft-quoted \"The Second Coming\" as well as \"An Irish Airman Foresees His Death,\" \"The Wild Swans at Coole,\" \"In Memory of Major Robert Gregory,\" \"Under the Round Tower,\" \"Michael Robartes and the Dancer,\" \"The Rose Tree,\" \"A Prayer for My Daughter,\" \"A Meditation in Time of War,\" and many more.",
        "Category": " Poetry , European , English, Irish, Scottish, Welsh",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Living by the Word: Selected Writings, 1973-1987",
        "Authors": "By Walker, Alice",
        "Description": "In meditative and passionate prose, these provocative essays explore feminist, environmental, and political issues and shed new light on racial debates, including the controversy surrounding Walker’s bestseller, The Color Purple.",
        "Category": " Literary Criticism , Women Authors",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "The Ragged Way People Fall Out of Love",
        "Authors": "By Cox, Elizabeth",
        "Description": "",
        "Category": " Fiction , Family Life",
        "Publisher": "Perennial",
        "Price Starting With ($)": "6.01",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "The Penguin Dictionary of Modern Humorous Quotations",
        "Authors": "By Metcalf, Fred",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Grievous Sin: A Peter Decker/Rina Lazarus Mystery (Peter Decker & Rina Lazarus Novels)",
        "Authors": "By Kellerman, Faye",
        "Description": "It was exhilaration followed by agony. Detective Sergeant Peter Decker of the LAPD had just witnessed the birth of his healthy, strapping daughter only to see his wife, Rina, suddenly whisked away into the emergency room with complications from her long, hard labor. For a while, it was touch and go. But just as things start to calm down and Rina seems to be on the road to recovery, a different tragedy strikes. Another family is thrown into an agony that only new parents can know - Baby Girl Rodriguez has been stolen from tbe hospital nursery. The family's ordeal is Peter's as well, because it is the very nursery where his daughter peacefully slept that same night. The head nurse, Marie Bellson, seems to be missing as well. Despite his exhaustion, Peter makes it his professional and personal mission to find Baby Girl Rodriguez and the nurse who allegedly stole her.Bellson and the infant have vanished without a trace. Nobody in the hospital saw them leave, not even Decker's own grown daughter, Cindy, who was tending to her half sister that night. Everyone interviewed agrees that Marie Bellson was fanatically devoted to the welfare of the newborns and would sooner die than harm one. That reputation, and a suspicious bloodstain on the floor of the hospital garage, are all that remain of the night nurse. Until Bellson's car is found at the bottom of a cliff.Chilled by the thought of a baby floating free in a dangerous world, Peter and his partner, Marge Dunn, drive themselves to untangle Bellson's murky past. What they find is a double life with roots in the radical sex and drug culture of the sixties, a tragically broken home, a male geriatric nurse with something to hide, and a mysterious lady bodybuilder who knows too much. Torn between his own family's pressing needs and his obession with finding the missing infant, Decker refuses to let Baby Girl Rodriguez be chalked up as just another statistic. But the harder Decker works, the more he realizes time is running out...Peter Decker of the LAPD and his beautiful, sharp-witted, Orthodox Jewish wife, Rina Lazarus, continue to be one of the most intriguing mystery couples around.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "From the Heart of Covington: A Novel (Ladies of Covington)",
        "Authors": "By Medlicott, Joan A.",
        "Description": "The three spunky ladies who so charmed readers in The Ladies of Convington Send Their Love and The Gardens of Covington welcome us back to the small Southern town of Covington, to their quaint white farmhouse with yellow shutters on Cove Road.Life lessons abound throughout From the Heart of Covington, as housemates Hannah, Grace, and Amelia continue to surround themselves with love and hope, meeting each new challenge with equanimity and heart and placing their trust in one another as their friendship strengthens and grows. In helping a dear friend and neighbor cope with illness, the ladies develop a deeper mutual compassion and a true appreciation for the softness of heart and toughness of spirit that join them as women.Amelia, feeling strong and adventurous, takes a momentous trip to New York City to further her burgeoning photography career. Grace, kindhearted as ever, becomes involved with a little girl at the local elementary school who may be having terrible problems at home. Meanwhile, Hannah's daughter, Laura, is involved in a tragic accident that has serious consequences for all concerned.With the same compassion and heart readers have already come to know and love, Joan Medlicott once again reveals how life's journeys and challenges only strengthen our loving commitments to family, friends, and loved ones. It's another inspiring message of courage, self-acceptance, and hope.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Thomas Dunne Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The General Says No: Britain's Exclusion from Europe",
        "Authors": "By Beloff, Nora",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin",
        "Price Starting With ($)": "9.44",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Holocaust",
        "Authors": "By Anthony McCall",
        "Description": "",
        "Category": "",
        "Publisher": "Trident Press",
        "Price Starting With ($)": "19.71",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Poultry on the Grill",
        "Authors": "By Grunes, Barbara and Magida, Phyllis",
        "Description": "Comments on and provides recipes for poultry which has as a step in preparation: grilling",
        "Category": " Cooking , Specific Ingredients , Poultry",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Country Inn Cookbook",
        "Authors": "By Berkshire Traveller (COR) and Lindstrom, Janice (ILT)",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The Wit and Wisdom of Mark Twain: A Book of Quotations (Dover Thrift Editions: Speeches/Quotes)",
        "Authors": "By Twain, Mark",
        "Description": "Renowned as a novelist, journalist, and humorist, Mark Twain is not only one of the most widely read and admired American writers, he is also among the most quoted. Wit and repartee permeate his work — from the short, light pieces to his great novel Adventures of Huckleberry Finn and even later, in dark meditations on the human condition where his humor takes on a cynical, satirical twist. This remarkably inexpensive volume gathers together hundreds of Twain's most memorable quips and comments on life, love, history, culture, travel, and a diversity of other topics that occupied his thoughts over 50 years of writing and lecturing.An invaluable, ready reference for writers, speakers, and others in search of amusing and insightful quotes, this entertaining and thought-provoking compilation is also an ideal introduction to Twain's inimitable style and thought.",
        "Category": " Literary Criticism , American , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Halloween Treats: Recipes and Crafts for the Whole Family",
        "Authors": "By Maggipinto, Donna and Jung, Richard (PHT)",
        "Description": "These days, Halloween is the most popular holiday next to Christmas. At its heart are family and friends having fun together-which is what this book is all about. In this cornucopia of creative Halloween ideas, simple crafts, tasty treats, and ghoulish good times abound. From delicious \"one cauldron\" dinners such as creamy pumpkin soup to luscious devil's food cake and black cat cookies, here are recipes ideal for entertaining adults and children alike, both in the kitchen and at the table. And then there are the crafts. Kid-friendly projects such as trick-or-treat bags, spooky lanterns, and tissue ghosts, and easy ideas for beautiful centerpieces, place mats, and name cards keep everyone from the tots on up busy and happy. Filled with clever projects and delicious snacks, and illustrated throughout with colorful photographs, Halloween Treats will keep the whole family (and friends of all ages) entertained. Happy Halloween!",
        "Category": " Cooking , Methods , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The Age of McCarthyism: A Brief History with Documents (Bedford Series in History and Culture)",
        "Authors": "By Schrecker, Ellen",
        "Description": "",
        "Category": "",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "More Street French: Slang, Idioms, and Popular Expletives",
        "Authors": "By Burke, David",
        "Description": "",
        "Category": "",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "George Washington -- Soldier, Hero, President (DK Readers, Level 3: Reading Alone)",
        "Authors": "By Fontes, Ron and Korman, Justine",
        "Description": "This biography of one of the most famous and recognizable American presidents mark DK's commitment to bringing US history-based biographies to the DK Readers series. In George Washington, the young reader will learn about our first president's childhood, his life as a farmer, statesman, general, and his days as president. The 48-page Level 3 books, designed for children who can read on their own, contain more complex sentence structure and more detail. Young readers will devour these kid-friendly titles, which cover high-interest topics such as sharks, and the Bermuda Triangle, as well as classics like Aladdin. Information boxes highlight historical references, trivia, pronunciation, and other facts about words and names mentioned. Averaging 2,400 to 2,800 words, these books offer a 50/50 picture-to-text ratio. The Dorling Kindersley Readers combine an enticing visual layout with high-interest, easy-to-read stories to captivate and delight young bookworms who are just getting started. Written by leading children's authors and compiled in consultation with literacy experts, these engaging books build reader confidence along with a lifelong appreciation for nonfiction, classic stories, and biographies. There is a DK Reader to interest every child at every level, from preschool to grade 4.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , Historical",
        "Publisher": "DK Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The American Heritage Encyclopedia of American History",
        "Authors": "By Faragher, John Mack (EDT)",
        "Description": "Introducing the new standard in American history.The most authoritative single-volume encyclopedia of American history in twenty-five years, this groundbreaking reference has been a major undertaking prepared under the guidance of an advisory board of six prominent historians from around the country and of General Editor John Mack Faragher of Yale University. More than 125 contributors, all experts in their fields, present the best in recent scholarship, spanning the pre-Columbian period through the 1990s. The result is substantially different from anything that has come before.* Nearly 3,000 alphabetically arranged entries and essays * Complete and authoritative treatment of traditional subjects* Full coverage of topics at the forefront of American history scholarship today--women, African Americans, Native Americans, family life, urban history, and popular culture* 400 black-and-white illustrations throughout* Appendixes and time charts of American history* Comprehensive cross-references and index for ease of reference, as well as innovative \"topic guides\" to facilitate deeper exploration and study* Sponsored by American Heritage magazine, the nation's premier history publication",
        "Category": " History , United States , General",
        "Publisher": "Henry Holt and Co.",
        "Price Starting With ($)": "8.54",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Chicken: 150 Great Recipes for All Seasons",
        "Authors": "By Corn, Elaine and Baradat, Sergio (ILT)",
        "Description": "About one out of four Americans will have chicken for dinner tonight. In the US and around the world, chicken is a perennial favoritewouldnt it be nice to find more and better ways to prepare it? In Chicken: 150 Recipes for All Seasons, award-winning cookbook author Elaine Corn offers delicious recipes for this lean and versatile bird throughout the year. Highlighting each seasons fresh ingredients, she presents a cornucopia of delightfully fresh and creative recipes for when peas are bursting from the pods in springtime, when tomatoes are ripe and succulent in the summer, and when the root vegetables of winter are flavorful and abundant. January to December, this year-round cookbook will inspire day after day of irresistible chicken dishes.",
        "Category": " Cooking , Specific Ingredients , Meat",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "The Crab Cookbook",
        "Authors": "By Schmidt, Whitey and Schmidt, Whitney",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Seafood",
        "Publisher": "SECANT PUBLISHING LLC",
        "Price Starting With ($)": "6.77",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "The Handy Politics Answer Book",
        "Authors": "By Gina Misiroglu",
        "Description": "",
        "Category": "",
        "Publisher": "Visible Ink",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Will You Sign Here, John Hancock?",
        "Authors": "By Hyman, Trina Schart (ILT) and Fritz, Jean",
        "Description": "Little-known facts are highlighted in this fun book about this historical figure, by Newbery Honor-winning author Jean Fritz. “The book is a most enjoyable view of history . . . The delightful illustrations exactly suit the times and the extraordinary character of John Hancock.”—The Horn Book Everyone knows that John Hancock was one of the first signers of the Declaration of Independence. But not many know that he signed his name so large to show how mad he was about how the colonists had been treated.",
        "Category": " Juvenile Fiction , Historical , United States , Colonial & Revolutionary Periods",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Ivies",
        "Authors": "By Fearnley-Whittingstall, Jane",
        "Description": "Discusses the history and mythology of ivy, presents practical information for planting, maintaining, and treating ivy, and lists three hundred of the most common varieties",
        "Category": " Gardening , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "7.22",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Lincoln an Illustrated Biography",
        "Authors": "By Kuhnhardt, Philip B",
        "Description": "",
        "Category": "",
        "Publisher": "Random House~trade",
        "Price Starting With ($)": "7.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Fdr",
        "Authors": "By Gelatt, Roland and Alsop, Joseph",
        "Description": "",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Why? Because You Are Anointed",
        "Authors": "By Jakes, T. D.",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Pneuma Life Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Entertaining Ideas from Williamsburg",
        "Authors": "By Rountree, Susan Hight and Babb, Elizabeth Hundley (ILT)",
        "Description": "",
        "Category": " Design , General",
        "Publisher": "Colonial Williamsburg Foundation",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "To Make All Laws: The Congress of the United States, 1789-1989",
        "Authors": "By Hutson, James H.",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "United States Govt Printing Office",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Our Call to Arms: The Attack on Pearl Harbor",
        "Authors": "By Robert Sullivan~Hugh Sidey",
        "Description": "Presents a history of the attack on Pearl Harbor, which brought the United States into World War II.",
        "Category": " History , Military , World War II",
        "Publisher": "Life",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "The Rose Book: How to Grow Roses Organically and Use Them in over 50 Beautiful Crafts",
        "Authors": "By Oster, Maggie",
        "Description": "Offers advice on planting and growing roses, shows how to create arrangements, and includes suggestions on ways to use dried roses",
        "Category": " Gardening , Flowers , Roses",
        "Publisher": "Rodale",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Wonders of the world",
        "Authors": "By Burton, Rosemary",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "6.95",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Italian 100: A Ranking of the Most Influential, Cultural, Scientific, and Political Figures,Past and Present",
        "Authors": "By Spignesi, Stephen J. and Vena, Michael",
        "Description": "",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Citadel",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The Wisdom of Leonardo Da Vinci",
        "Authors": "By Leonardo Da Vinci (Wade Baskins, Tr.)",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes and Noble",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Oxford Dictionary of New Words: A Popular Guide to Words in the News",
        "Authors": "By Tulloch, Sara (COM)",
        "Description": "What does \"mirror-shades group\" mean? (Is it a solar power array, a school of science fiction, a slang word for \"corporate raiders\"?) Who first coined the word \"factoid\"? When and where does the \"triple witching hour\" occur? What do the acronyms DINK and NIMBY stand for? On what kid's show was the cry \"Cowabunga\" first heard? Why is the term \"acupressure\" something of a misnomer?       In The Oxford Dictionary of New Words, Sara Tulloch examines over two thousand new words and phrases that have become part of our daily lives in the last decade, in 750 articles that provide pronunciation, definition, etymology, informal history, and sample sentences. Drawing words from politics, the environmental movement, computers and technology, business, sports, entertainment, and many other areas, Tulloch goes beyond the usual informative but narrow dictionary entry to offer readers a rich history of the recent changes not only in our language but in our culture as well. Just skimming the headwords is like fast-forwarding through the eighties: bailout, cocooning, deniability, the disappeared, glasnost, lambada, safe sex, spin doctor, fun run, insider trading, genetic fingerprinting, thirtysomething, designer water, liposuction, Cablevision, gentrification, intifada, and DINK (Double Income, No Kids). And the histories that Tulloch provides are so interesting that even if you know the meaning of a word you will find the article fascinating. For instance, readers discover that the expression \"Cowabunga,\" popularized most recently by the Teenage Mutant Ninja Turtles, dates back to the old \"Howdy Doody Show\" of the '50s; that \"couch potato\" was coined by Californian Tom Iacino (who also commends television-watching as \"transcendental vegetation\") and that the word \"factoid\" was coined by Norman Mailer in his book Marilyn; that the name of the Black South African party \"Inkatha\" comes from a Zulu word for a sacred head-ring believed to ensure solidarity; that the \"cellular\" in \"cellular phone\" refers to the small geographic sections or \"cells\" into which each operating area is divided; that \"mouse\" has been a computer term since 1965 and \"mousse\" has gone from dessert to hair styling product to the frothy oil-and-seawater mixture left behind oil spills; and that Lenin used the term \"glasnost\" to mean \"freedom of information\" half a century before Gorbachev did.       Here then is a resource that is both useful and intriguing, the first place to turn when faced with such new words and phrases as \"acyclovir,\" \"magnetic resonance imaging,\" \"Alar\" or \"computer footprint,\" as well as a browser's delight, a goldmine of language for word lovers everywhere.",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Ancient Ireland: Irish Pride",
        "Authors": "By Massie S.",
        "Description": "",
        "Category": "",
        "Publisher": "MJF Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "It's Raining, It's Pouring (Iza Trapani's Extended Nursery Rhymes)",
        "Authors": "By Eagle, Kin and Gilbert, Rob (ILT)",
        "Description": "The whole family will giggle and gasp as they follow this lively extension of the classic Mother Goose nursery rhyme we all know and love. With the charm of the original poem, this picture book version brings the song alive as readers follow the delightful story beyond the well-known verses of the original and into explorations of all kinds of weather. Colorful and exuberant watercolors make six witty new verses dance with sunny humor. Kids will follow along, read along, and even sing along. This is sure to be a favorite for young and old alike.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Anthologies",
        "Publisher": "Charlesbridge",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "The Best of Lewis Carroll",
        "Authors": "By Carroll, Lewis, Tenniel, John (ILT), and Holiday, Henry (ILT)",
        "Description": "",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Here's to You, America! (Peanuts)",
        "Authors": "By Fontes, Ron, Schulz, Charles M., Korman, Justine, Lobianco, Nick (ILT), and Lobianco, Peter (ILT)",
        "Description": "Based on the Home Video and Television Miniseries!  Travel back in time with Peanuts! It's 1787, and Charlie Brown, Snoopy, and friends are in colonial Pennsylvania for the founding of the United States. Along with George Washingtonand John Hancock, they witness the birth of the Constitution and the creation of the government that makes our country unique. As they see history in the making, the Peanuts gang discovers lots of reasons why they're proud to be Americans.",
        "Category": " Juvenile Fiction , Historical , United States , General",
        "Publisher": "Little Simon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Uppity Women of the New World (Uppity Women Series)",
        "Authors": "By Leon, Vicki",
        "Description": "A collection of real-life stories about female pioneers covers more than two hundred forgotten women adventurers, including Jeanne Baret, the first woman to circumnativigate the globe. By the author of Uppity Women of Ancient Times. Original.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Conari Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Ben Franklin and the Magic Squares (Step-Into-Reading, Step 4)",
        "Authors": "By Murphy, Frank and Walz, Richard (ILT)",
        "Description": "A funny, entertaining introduction to Ben Franklin and his many inventions, including the story of how he created the \"magic square.\" A magic square is a box of nine numbers arranged so that any line of three numbers adds up to the same number, including on the diagonal! Teachers and kids will love finding out about this popular teaching tool that is still used in elementary schools today!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Truth About Irish P",
        "Authors": "By Eagleton, Terry",
        "Description": "If you're looking for a field guide to leprechauns, The Truth About the Irish is not the book for you. But if you can handle a frank and funny look into the minds and hearts of Irish people, you've been touched by that fabled Irish luck. Covering all things Irish from Blarney to Yeats, renowned literary and cultural critic Terry Eagleton separates the myths from the reality with his priceless blend of sidesplitting humor, caustic commentary, and the honest lowdown on the beloved and bewildering country of Ireland.",
        "Category": " History , Europe , Ireland",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Tommy Visits the Doctor",
        "Authors": "By Jean H. & Levine, Milton I. Seligmann~Richard Scar",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Mister Dog: The Dog Who Belonged to Himself (A Little Golden Book)",
        "Authors": "By Williams, Garth (ILT) and Brown, Margaret Wise",
        "Description": "Once upon a time there was a funny dog named Crispin’s Crispian. He was named Crispin’s Crispian because he belonged to himself.So begins the story of a dog who runs bang into a little boy, who also belongs to himself. This quirky, breathtakingly illustrated story is one of Margaret Wise Brown’s best.",
        "Category": " Juvenile Fiction , Animals , Dogs",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "The Little Red Caboose (Little Golden Book)",
        "Authors": "By Marian Potter, Tibor Gergely",
        "Description": "This classic picture book tells the tale of a charming red caboose who wants nothing more than to be as popular as the big steam engine at the front of the train.",
        "Category": " Juvenile Fiction , Transportation , Railroads & Trains",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "A Celebration of Motherhood",
        "Authors": "By Pickel, Haden Harris and Williams, Annette Crivella",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "What Makes Flamingos Pink : A Colorful Collection of Q & A's for the Unquenchably Curious",
        "Authors": "By McLain, Bill",
        "Description": "Do spiders sleep? Why are barns red? Why is there a crescent moon on outhouse doors? Are zebras white with black stripes or black with white stripes?As the Xerox Corporation's official webmaster, Bill McLain often fielded as many as 1,000 questions a day on just about everything under the sun -- and beyond. The wildest, funniest, and even most astute are collected here (along with their answers) in McLain's second volume that's as fascinating and enlightening as his first, Do Fish Drink Water? A \"veritable Internet legend known for having all the answers\" (San Francisco Chronicle), McLain explains what keeps squirrels from toppling off telephone wires; why the skin on your fingers and toes shrivels up in the water; how seedless watermelons are created; and more. Whether it's animal, vegetable, mineral, or something completely different, the answer is bound to be as interesting as the question itself, and certain to satisfy the trivia hound in everyone.",
        "Category": " Reference , Trivia",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "High Trust Selling : Make More Money-In Less Time-With Less Stress",
        "Authors": "By Duncan, Todd",
        "Description": "This book gives a fresh understanding of the \"laws\" that govern the sales profession. The first section includes the laws that deal with the attitudes, aptitudes, and abilities that are required for any salesperson to be successful. The second section deals with the laws concerning the communication, courtship, camaraderie and commitments between a successful salesperson and his or her clients. Each law provides a description of a practical application.If you've ever held a sales position you know that being successful takes more than a smile, a Rolodex and a \"can do\" attitude. This book provides the \"more\" you will need to come out on top and stay there.",
        "Category": " Business & Economics , Sales & Selling , General",
        "Publisher": "Nelson Business",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Rama Revealed: The Ultimate Encounter",
        "Authors": "By Clarke, Arthur C. and Lee, Gentry",
        "Description": "In the long-awaited conclusion to one of the most heralded science fiction series ever, Arthur C. Clarke and Gentry Lee reveal the ultimate Raman plan for humanity. The Hugo and Nebula award-winning Rendezvous with Rama, the bestselling Rama II, and The Garden of Rama were only the prelude to this stunning conclusion to an epic journey.On its mysterious voyage through interstellar space, a massive, alien starship carries its passengers to the end of a generations-long odyssey. For the great experiment conceived by the Ramans has failed. Rama III, with its carefully designed Earth habitat, as well as environments to house other intelligent species, has become a battleground.Instead of creating a utopia, the human contingent has brought forth a tyrant who seeks to conquer the other sectors of the vast Raman ark. Cosmonaut Nicole des Jardins, a lone voice for reason who is now jailed and awaiting execution, is aided in a daring escape by two tiny robots. On New York Island, the dark, brood deserted city in the midst of Rama III's cylindrical sea, Nicole is reunited with her long-lost husband, Richard Wakefield, whom she'd given up for dead.Joined by their children and other rebels from the Earth sector, Nicole and Richard enter New York's labyrinthine underground aboard a ghostly subway hoping to find the ship's secret inner workings. What they find instead is the emerald-domed lair of the technologically advanced species that rules this fabulous subraman world: the octospiders. These arachnidlike creatures are luring Nicole and the rebels into their domain, but the Earth group is divided as to whether the octospiders are allies or enemies - and anxious to discover the fate of two of their group abducted by the enigmatic aliens.Yet even as this drama unfolds, Rama III continues its inexorable course to its final destination: the Node. To some, the Node is a vast engineering station; to others, it is a place of wonder and miracles. From here a powerful force has been monitoring all of the lifeforms on Rama III, summoning the survivors to a final judgment. And it is here that the stunning climax of the Rama journey awaits: the shattering revelation of the true identity of the beings behind this strange, glittering trek across the cosmos.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Spectra",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    }
]