[
    {
        "Title": "Living Simply with Children: A Voluntary Simplicity Guide for Moms, Dads, and Kids Who Want to Reclaim the Bliss of Childhood and the Joy of Parenting",
        "Authors": "By Sherlock, Marie",
        "Description": "Raising children ranks as one of life’s most rewarding adventures. Yet between Mom and Dad working full-time jobs, endless carpooling of overscheduled youngsters, and the never-ending pressures to buy and consume, family life can be incredibly—needlessly—complex. What if you could find a way to spend more time with your children, replace unnecessary activities with meaningful ones, and teach your children an invaluable life lesson in the process? Living Simply with Children offers a realistic blueprint for zeroing in on the pleasures of family life:• How (and why) to live simply and find more time to be with your children• Activities and rituals that bring out the best in every family member• Realistic ways to reclaim your children from corporate America• Helping children of any age deal with peer pressure• Raising kids who care about people and the planet• How to focus on the “good stuff” . . .  with less stuffIncluding sections on limiting television, environmentally friendly practices, celebrating the holidays, and tapping into the growing community of families who embrace simplicity, this inspiring guide will show you how to raise children according to your own values—and not those of the consumer culture—as you enjoy both quality and quantity time with your family.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "What Was Back of Kennedy's Murder?",
        "Authors": "By John R. Rice",
        "Description": "",
        "Category": "",
        "Publisher": "Sword of The Lord",
        "Price Starting With ($)": "25.04",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Women Who Try Too Hard: Breaking the Pleaser Habits",
        "Authors": "By Leman, Kevin",
        "Description": "",
        "Category": " Self-help , General",
        "Publisher": "Revell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Mathematics: Its Power and Utility",
        "Authors": "By Smith, Karl J.",
        "Description": "Written for students with mathematics anxieties, this text focuses on the most practical aspects of the discipline, emphasizing problem solving skills throughout.  Intended for the basic high school or community college-level course, the text covers basic tools and problem solving; sets of numbers; introductory algebra; percents and problem solving; introductory geometry; measurement and problem solving; applications of percent; sets and logic; probability; statistics; and graphs. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Mathematics , General",
        "Publisher": "Brooks Cole",
        "Price Starting With ($)": "6.98",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "The Civil War Source Book (Source Book Series)",
        "Authors": "By Katcher, Philip R. N.",
        "Description": "An accessible, illustrated reference constituting a compendium of narrative, chronological history, description, technical information, anecdotes, and biographies, supplemented with information about basic sources for further study. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " History , General",
        "Publisher": "Facts on File",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "2,000 Questions and Answers About the Civil War",
        "Authors": "By Garrison, Webb B.",
        "Description": "Fascinating trivia and facts abound in this rich collection about America's most brutal and intriguing war.  Questions are presented in categories that make it easy to test your knowledge. Also included are interesting sidebar articles, lists of little-known facts, anecdotes, and over 50 unusual black-and-white photographs.  With a thorough index, 2,000 Questions and Answers About the Civil War provides a valuable resource for students, researchers, and Civil War buffs.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Thong on Fire",
        "Authors": "By Noire",
        "Description": "",
        "Category": "",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Glass",
        "Authors": "By Hopkins, Ellen",
        "Description": "Crank. Glass. Ice. Crystal. Whatever you call it, it's all the same: a monster. And once it's got hold of you, this monster will never let you go.   Kristina thinks she can control it. Now with a baby to care for, she's determined to be the one deciding when and how much, the one calling the shots. But the monster is too strong, and before she knows it, Kristina is back in its grips. She needs the monster to keep going, to face the pressures of day-to-day life. She needs it to feel alive.   Once again the monster takes over Kristina's life and she will do anything for it, including giving up the one person who gives her the unconditional love she craves -- her baby.   The sequel to Crank, this is the continuing story of Kristina and her descent back to hell. Told in verse, it's a harrowing and disturbing look at addiction and the damage that it inflicts.",
        "Category": " Young Adult Fiction , Family , General",
        "Publisher": "Margaret K. McElderry Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Watermark",
        "Authors": "By Kallmaker, Karin",
        "Description": "",
        "Category": " Fiction , Romance , General",
        "Publisher": "Naiad Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Recipes from a Provençal Kitchen (BEAUX LIVRES (A))",
        "Authors": "By Biehn, Michel, Touillon, Bernard (PHT), Grant, Anthony (TRN), and Grant, Christine (TRN)",
        "Description": "\"I have always loved good food, just like my father. When my parents were married in Arles, my Grandmother Athalie took up pen and ink and wrote down a collection of her own mother's best recipes in a little blue notebook. I have that notebook in front of me now.\"Even as a child Michel Biehn was fascinated by Provence and its traditional cuisine. In this splendid volume, he takes us on a culinary journey through the changing seasons in this enchanting region of France, revealing the unique Provençal spirit of celebration and simplicity. Consisting largely of fresh fruits, vegetables, and the bounty of the seas cooked with olive oil and natural herbs and spices, these delicious recipes appeal to today's interest in healthy, flavorful food, tempered nonetheless with a selection of irresistible indulgences.Each easy-to-follow recipe is accompanied by a wine suggestion as well as the story of the particular dish's role in Provençal tradition-- the tangy pumpkin soup which heralds the arrival of autumn, winter's delicious daubes, or stews, the freshly picked baby vegetables of spring, and summer's savory ratatouille and bouillabaisse.Michel Biehn collaborated closely with photographer Bernard Touillon to create the settings and recipes featured in the stunning color photographs, all of which were taken using only natural lighting in order to capture the authentic atmosphere and colors of Provence and the spirit of its cuisine. More than a cookbook, this lavishly illustrated introduction to Provence and its unique lifestyle will make an exceptional and treasured gift for cooking enthusiasts, gourmets, travelers, and anyone who loves the good things in life.",
        "Category": " Cooking , Regional & Ethnic , French",
        "Publisher": "Flammarion",
        "Price Starting With ($)": "5.17",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Rigged: The True Story of an Ivy League Kid Who Changed the World of Oil, from Wall Street to Dubai",
        "Authors": "By Mezrich, Ben",
        "Description": "From the author who brought you the massive New York Times bestseller Bringing Down the House, this is the startling rags-to-riches story of an Italian-American kid from the streets of Brooklyn who claws his way into the wild, frenetic world of the oil exchange.After conquering the hallowed halls of Harvard Business School, he enters the testosterone-laced warrens of the Merc Exchange, the asylumlike oil exchange located in lower Manhattan. A place where billions of dollars trade hands every week, the Merc is like a casino on crack, where former garbagemen become millionaires overnight and where fistfights break out on the trading floor.This ordinary kid has traded Brooklyn for the gold-lined hotel palaces of Dubai. He keeps company on the decks of private yachts in Monte Carlo—teeming with half-naked girls flown in by Saudi sheiks—and makes deals in the dangerous back alleys of Beijing.But the Merc is just a starting place. Taken under the wing of another young gun and partnering with a mysterious young Muslim, the kid embarks on a dangerous adventure to revolutionize the oil trading industry—and, along with it, the world.Rigged is the explicit, exclusive, true story behind the headlines that dominate the world stage.",
        "Category": " Business & Economics , Industries , Energy",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "The Complete Guide to Healing Foods: Nutritional Healing for Mind and Body",
        "Authors": "By Ursell, Amanda",
        "Description": "Ursell (a dietician and author) describes the healing properties of various foods, which are depicted in appealing arrangements and good quality color photographs. The text is divided into four sections: food for body and mind, food profiles sub-divided into vegetables, fruits, grains, and meat, fish and dairy; life stages; and treating ailments. Charts and boxes containing key nutrients and key benefits are included for each food type in this clearly designed reference. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Health & Fitness , Nutrition",
        "Publisher": "Dk Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "The Inn at Little Washington Cookbook: A Consuming Passion",
        "Authors": "By Turner, Tim (PHT) and O'Connell, Patrick",
        "Description": "This cookbook is the distillation of a life's work by a self-taught American chef who learned to cook by reading cookbooks and went on to become one of the world's most renowned chefs. O'Connell began his career with a catering business in an old farmhouse, cooking on a wood stove with an electric frying pan purchased for $1.49 at a garage sale. (The pan was used for boiling, sautéeing and deep frying for parties of up to 300 guests.) This experience sharpened his awareness of how much could be done with very little. The catering business evolved into a country restaurant and Inn which opened in 1978 in a defunct garage and which is now America's only 5 star Inn.  Craig Claiborne raves, \"the most magnificent inn I've ever seen, in this country or Europe, where I had the most fantastic meal of my life.\"This is not a typical \"Chef's Cookbook\" filled with esoteric, egomanical, and impossibly complicated recipes which only a wizard with a staff of eighty would ever attempt to produce. Rather, the recipes assembled here make up a practiced, finely honed repertoire of elegant, simple and straight-forward dishes. Everyday ingredients are elevated to new heights through surprising combinations and seductive presentations. []A Consuming Passion[] propels the home cook into a new world of American Haute Cuisine and provides the formulas for reproducing it at home. Careful and detailed instructions, all written by the author, assure success.Tim Turner's luscious photographs capture the playful but elegant spirit of the food and introduce the reader to some of the charming local characters who provide products for the Inn's kitchen as well as taking the reader on a delightful and romantic culinary journey throughout the Virginia countryside surrounding the small town affectionately known as \"Little\" Washington and reveals an America we thought was lost forever.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "6.74",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "The Illustrated Encyclopedia of the Presidents of America",
        "Authors": "By Jon Roper",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Sisters of Isis: The Summoning (Sisters of Isis #1)",
        "Authors": "By Ewing, Lynne",
        "Description": "Following the incredible success of Daughters of the Moon, Lynne Ewing has created an all new fun and hip teen fantasy series. Based in Egyptian mythology and set in modern-day Washington, D.C., Sisters of Isis  follows the lives of Meri, Sudi, and Dalila, three fifteen-year-old girls who have just discovered they are descendants of very powerful ancestors?Egyptian pharaohs. From these ancestors they’ve inherited magical powers of transformation, the ability to cast spells from the Book of Thoth, and, as they will soon learn, the responsibility of protecting the world from the evil forces of Chaos.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Skills for Success: Developing Effective Study Strategies (with InfoTrac) (Wadsworth College Success Series)",
        "Authors": "By Jenkins, Cynthia",
        "Description": "Did you know it's your study skills, even more than your intelligence, that helps you get great grades? SKILLS FOR SUCCESS: DEVELOPING EFFECTIVE STUDY STRATEGIES shows you the classroom tips and tactics you need to know. In addition, this study skills textbook focuses on the right expectations to have about college, so you can get the most out of your experience. And with its easy-to-understand style, this is the study skills textbook you'll use again and again.",
        "Category": " Business & Economics , Careers , Job Hunting",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Miss Spider: All Pupa'ed Out",
        "Authors": "By Kirk, David",
        "Description": "After Squirt and Shimmer plead with Miss Spider and Holley to keep the caterpillar they've found, they wonder if they've bitten off more than they can chew when Cookie the Caterpillar starts munching her way through Sunny Patch. Original.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "No-Brainer's Guide to Jesus",
        "Authors": "By Bell, James S. and Campbell, Stan",
        "Description": "Who was Jesus? How does He fit into the 21st century? This second guide in the No-Brainer's series is fun to read and filled with transforming truth. It begins with Old Testament prophecies about Jesus and progresses through the Gospels and Paul's letters. It ends with a chapter on Jesus as he is perceived in the 21st century. The style is youthful and energetic, but not childish. Its fun, cartoon-rich format is Tyndale's answer to the popularDummies guides.",
        "Category": " Religion , Biblical Reference , General",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Stuart Hides Out (I Can Read!)",
        "Authors": "By Hill, Susan and Halverson, Lydia (ILT)",
        "Description": "Let's play hide-and-seek!If you were a mouse, would you play hide-and-seek with a cat? Stuart Littler does! But when Stuart hides too well, will cat find him -- before it's too late?",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperColl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Stuart at the Library (I Can Read!)",
        "Authors": "By Hill, Susan, Halverson, Lydia (ILT), Shyamalan, M. Night, and Brooker, Greg",
        "Description": "What could be more peaceful than spending an afternoon at the library? For Stuart Little, the library turns out to be anything but that after he meets Bookworm, the library's owl. Bookworm has plans to make Stuart his next meal -- unless Stuart can think fast! Inspired by the hit movie Stuart Little, this new story will have Stuart's many fans on the edge of their seats!",
        "Category": " Juvenile Fiction , Animals , Mice, Hamsters, Guinea Pigs, etc.",
        "Publisher": "HarperColl",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Leadership Odyssey",
        "Authors": "By Napolitano, Carole S. and Henderson, Lida J.",
        "Description": "The Resource of Choice for Those Who Need to Lead!New times demand new competencies. Keep yours ahead of the curve with this engaging guide for the self-directed development of cutting-edge management skills. The Leadership Odyssey outlines thirty-seven abilities and attributes that define the successful manager of the future, and shows how to master them all. Readers will benefit from a synthesis of the latest thought on the subject, plus a wealth of learning tools, self-assessment materials, and expert advice from professionals with more than twenty years of management development experience. Great for training programs, too.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "The Magic School Bus Takes a Moonwalk (Scholastic Reader, Level 2)",
        "Authors": "By Cole, Joanna and Bracken, Carolyn (ILT)",
        "Description": "Based upon the award-winning TV series, Magic School Bus Scholastic Readers make learning an adventure!Ms. Frizzle's class is taking a special nighttime hayride to learn about the moon. But when a cloudy sky spoils the trip, everyone piles onto the Magic School Bus for a better view. You can bet this adventure will be anything but ordinary!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "The Railway Children (Puffin Classics)",
        "Authors": "By Nesbit, Edith and Brock, C. E. (ILT)",
        "Description": "With their father called away, Roberta, Peter, and Phyllis must move with their mother to the country, where they wait each day at the train station in hopes their father will arrive.",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Puffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "The Memory Keeper's Daughter: A Novel",
        "Authors": "By Edwards, Kim",
        "Description": "A #1 New York Times bestseller by Kim Edwards, The Memory Keeper’s Daughter is a brilliantly crafted novel of parallel lives, familial secrets, and the redemptive power of loveKim Edwards’s stunning novel begins on a winter night in 1964 in Lexington, Kentucky, when a blizzard forces Dr. David Henry to deliver his own twins. His son, born first, is perfectly healthy, but the doctor immediately recognizes that his daughter has Down syndrome. Rationalizing it as a need to protect Norah, his wife, he makes a split second decision that will alter all of their lives forever. He asks his nurse, Caroline, to take the baby away to an institution and never to reveal the secret. Instead, she disappears into another city to raise the child herself. So begins this beautifully told story that unfolds over a quarter of a century—in which these two families, ignorant of each other, are yet bound by the fateful decision made that winter night long ago.A family drama, The Memory Keeper’s Daughter explores every mother's silent fear: What would happen if you lost your child and she grew up without you? It is also an astonishing tale of love and how the mysterious ties that hold a family together help us survive the heartache that occurs when long-buried secrets are finally uncovered.",
        "Category": " Fiction , Psychological",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Mud (A  Pictureback Reader with Cut-out Learning Cards Inside)",
        "Authors": "By Lewison, Wendy Cheyette and Cocca-Leffler, Maryann (ILT)",
        "Description": "Text and pictures present the joyous experience of mud all over the shoe, you, the hair and everywhere",
        "Category": "",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Workbook for Insurance Handbook for the Medical Office",
        "Authors": "By Fordney, Marilyn T.",
        "Description": "WORKBOOK FOR INSURANCE HANDBOOK FOR THE MEDICAL OFFICE, 10th Edition is an essential learning resource that will enhance and improve your study of Fordney's Insurance Handbook for the Medical Office.  The workbook conveniently parallels material in the text, and provides realistic, hands-on exercises that help you apply concepts and develop important critical-thinking skills.  An accompanying CD-ROM lets you practice \"real world\" billing with patient simulations using Altapoint and the Student Software Challenge.Student Software Challenge, on the enclosed CD, contains 10 patients cases you can use for practice in completing the CMS-1500 claim form.Practice management software (AltaPoint), also on the enclosed CD, for use with select claim form completion exercises within the workbook.Evolve online resources provide Internet activities and active weblinks from the text.Key terms, performance objectives, and a study outline for each chapter, are designed to be used as a quick reference for faster, more effective study.The self-study review provides an interactive review in the form of matching, true/false, multiple choice, and fill-in-the-blank questions and answers, so you can test your retention of key material.Critical thinking assignments present short, real-world scenarios that prepare you for work in today's medical office environment.Key Abbreviation list clarifies the multitude of common abbreviations used in health insurance billing.Improved software instructions clearly explain how to install, access, and use all software elements.  All software instructions are now conveniently located in the Appendix - one central location for fast reference and ease of use.",
        "Category": " Medical , Practice Management & Reimbursement",
        "Publisher": "Saunders",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "The Whales' Song",
        "Authors": "By Sheldon, Dyan",
        "Description": "",
        "Category": "",
        "Publisher": "Scholastic",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Dead in the Water",
        "Authors": "By Hoffman, Margaret",
        "Description": "",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Coastal Plains Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "The Call of Earth (Homecoming)",
        "Authors": "By Card, Orson Scott",
        "Description": "The Call of Earth continues the story of Nafai, his family, and the few other people selected by the Oversoul to leave the city of Basilica, and their former lives.When the human refugees from a ruined Earth founded a colony on the planet Harmony, they determined that this world would not be devastated by the endless cycle of vicious warfare that had characterized human life from the beginning.They didn't try to change human nature. Instead they installed a powerful computer, called the Oversoul, and gave it the task of governing human affairs by subtly influencing human minds. That was millions of years ago. Now the Oversoul is growing weak, breaking down. It must be returned to Earth, to the master computer called the Keeper of Earth, to be repaired. The Oversoul must have human help to make that journey.But as the Oversoul grows weaker, a great warrior has arisen, stronger, smarter perhaps, than Nafai and his allies. His name is Moozh, and he is deliberately flouting the will of the Oversoul. He has won control of an army using forbidden technology. Now he is aiming his soldiers straight at Basilica, that strong fortress above the Plains.Who will stop him? Basilica remains in turmoil. Wetchik and his sons, Nafai and Issib, Elemak and Mebbekew, are not strong enough to resist alone. Can Rasa and her allies defeat him through intrigue, or will Moozh take the city and all who are in it?And meanwhile, in their dreams, the most sensitive people of the planet Harmony hear the call of the Keeper of Earth.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Dollars & Nonsense: Correcting the News Media's Top Economic Myths That Have Gained Respectability in Recent Years",
        "Authors": "By Moore, Stephen (EDT) and Noyes, Richard (EDT)",
        "Description": "",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Media Research Center",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Brown Paper School book: Math for Smarty Pants",
        "Authors": "By Burns, Marilyn and Weston, Martha (ILT)",
        "Description": "Built on the theme that the methods of mathematics are simply devices for solving problems, this book covers a variety of mathematical thought, including geometry, probability, computer technology, graphs, functions, and calculator puzzles",
        "Category": " Young Adult Nonfiction , Mathematics , General",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1982"
        }
    },
    {
        "Title": "Hey Diddle Diddle (Nursery Rhyme)",
        "Authors": "By Eagle, Kin and Gilbert, Rob (ILT)",
        "Description": "What could be more amazing than a cow jumping over the moon?  Leap on board and join the cow and Baboon, the dish and the spoon, the cat and the fiddle and boy as they take you on a riddling, rhyming, and clamorous adventure.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Anthologies",
        "Publisher": "Charlesbridge",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "DK Readers L3: Star Wars: I Want To Be A Jedi: What Does It Take to Join the Jedi Order? (DK Readers Level 3)",
        "Authors": "By Windham, Ryder and Beecroft, Simon",
        "Description": "\"DK's Star Wars Readers help kids learn to read while enjoying the stories and characters from the blockbuster movies.  In I Want to Be a Jedi, find out what it takes to join the ranks of the Jedi - learn where the Jedi Academy is located, what the Jedi Code is, and how the Jedi fight with lightsabers.\"",
        "Category": " Juvenile Nonfiction , Performing Arts , Film",
        "Publisher": "DK Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Daily Blessings for My Wife",
        "Authors": "By Douglas, Christopher",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Ideals Thanksgiving/No 7",
        "Authors": "By Hamling, Tim (EDT)",
        "Description": "Photographs, recipes, poems, stories, and essays capture the true essence of Thanksgiving celebrations",
        "Category": "",
        "Publisher": "Ideals Pubns Inc",
        "Price Starting With ($)": "5.52",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Easter Ideals 1993",
        "Authors": "By Ideals Publications Inc",
        "Description": "",
        "Category": "",
        "Publisher": "Ideals Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Trim Idea Book: Walls*Ceilings*Doorways*Windows*Stairs*Built-Ins (Taunton Home Idea Books)",
        "Authors": "By Polson, Mary Ellen",
        "Description": "Since 1950, most American homes have been built with plain clamshell molding, narrow colonial molding, or no molding at all, leaving the interior architecture naked and uncelebrated. Trim Idea Book shows how to change all that and highlights a wide range of styles, from 21st-century designs, including craftsman, natural, and minimalist, to period and period-inspired motifs. The book showcases hundreds of ways homeowners can use trim to spotlight and define the interior architecture of their homes - and even to compensate for its shortcomings. Trim can help define spaces that in themselves feel too large and can add volume and dimension to rooms that are otherwise too small. Trim can frame doors and windows, enhancing their presence on walls that have daunting expanses, or hiding construction flaws. Molding and trim - of wood as well as man-made materials - are readily available at home centers as well as traditional lumberyards. Style options are endless. Ideas for walls, ceilings, doors, windows, stairways, and built-ins such as bookshelves, headboards, and fireplace surrounds are all shown.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Chicken (Cook's Library)",
        "Authors": "By multiple contributors",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Long Way Westward (I Can Read Level 3)",
        "Authors": "By Sandin, Joan",
        "Description": "This lively sequel to The Long Way to a New Land  follows the fortunes of Carl Erik’s family from New York City to the farmlands of Minnesota. \"Historically accurate; will attract competent primary-grade readers and will be equally suitable for less able readers in intermediate grades.\" —SLJ.   1990 The USA Through Children's Books (ALA)Children's Books of 1989 (Library of Congress)1989 Children's Books (NY Public Library)",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Vinegar, Duct Tape, Milk Jugs & More: 1,001 Ingenious Ways to Use Common Household Items to Repair, Restore, Revive, or Replace Just about Everything in Your Life (Yankee Magazine Guidebook)",
        "Authors": "By Proulx, Earl and Yankee Magazine",
        "Description": "With his trademark folksy wisdom, Earl Proulx tells you how to recycle those things we all have lying around the house into ingenious solutions without spending money on fancy cleaning solutions, or pricey gadgets. Some of Earl's particular favorites are kitty litter (as a cleaner for oils pills and as a base for a soothing facial mask) and, of course, vinegar (to clean just about anything, unclog showerheads, as well as trap fruit pests), duct tape (as both tick remover and a protection against blisters), and milk jugs (bird feeders and clothespin holders). His fun and inventive ideas also include:Ant-proof your home with lemon juiceCover up furniture scratches with a dab of iodineUse powdered milk to soothe sunburn and remove makeupMake an earring holder out of window screenRecycle bubble wrap for a toilet tank insulatorOrganized by location inside and outside of the house, Vinegar, Duct Tape, Milk Jugs & More will make you pause each time you start to throw something (old blue jeans, ice cube trays, coat hangers, egg cartons) out in the trash.",
        "Category": " House & Home , Cleaning, Caretaking & Organizing",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Cookies, Brownies & Bars (Gifts from a Jar)",
        "Authors": "By Publications International Ltd",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Smile! (Baby Faces Board Book #2)",
        "Authors": "By Intrater, Roberta Grobel",
        "Description": "Share the warmth of a smile with these adorable babies!The perfect snuggletime book and an ideal first read-aloud book, this addition to the popular Baby Faces series has appealing photos of multicultural babies and toddlers and a brief, rhyming text.Collect the entire series: PEEK-A-BOO!EAT!SLEEPSPLASH!HUGS & KISSES",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Medical Transcription: Techniques and Procedures",
        "Authors": "By Diehl, Marcy Otis",
        "Description": "As the role of medical transcriptionists undergoes significant changes arising from new and evolving technology, refined skills are necessary to thrive in the new environment. This practical text prepares transcriptionists for the demands of their evolving role, including proofreading, editing, and transcribing via computer, while also addressing other equipment used in the profession.Dictations contained on CD-ROM offer realistic practice with diverse voice tones, accents and speaking rates.Authentic medical transcription documents illustrate formats for medical charts, history and physical exams, operative, x-ray, pathology and other reports. Includes shortcuts for computer formatting!Skill drills teach students to use references to verify information and to become familiar with new and unusual industry terms.Exercises and helpful hints encourage students to practice proofreading and editing skills.Grammar skills are demonstrated and practiced through individual chapters to bolster fundamental knowledge of punctuation, abbreviations, symbols, word endings and more.Explanations of the latest HIPAA guidelines regarding patient confidentiality, risk management and medical records provide guidance on adhering to regulations.Details on advances in speech recognition technology and trends in transcription software, including software for the sight-impaired, prepare students for technology encountered in the workplace.Information about the Certified Medical Transcriptionist (CMT) exam and the new Registered Medical Transcriptionist (RMT) exam, including possible future developments, is included.Punctuation and Grammar Rule synopses are located on the inside front and back covers for quick and easy reference.Completely revised student CD-ROM features chapter-specific quizzes, CMT exam preparation materials, and \"real life\" transcription exercises.",
        "Category": " Medical , Dictionaries & Terminology",
        "Publisher": "Saunders",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Maine: An Explorer's Guide, Eleventh Edition",
        "Authors": "By Tree, Christina, Oxnard, K. W., and Grant, Kim (PHT)",
        "Description": "The definitive travel guide to Maine, in print for more than 20 years, just gets better and more comprehensive with each new edition. The \"Maine bible\" is the only guide you'll need to find opinionated, authoritative recommendations for travelers of every taste and budget. From rustic sporting lodges, rafting trips, and hiking trails, to artists' colonies, historic homes, and museums, the authors guide readers beyond the obvious places to the far reaches of both coastal and inland Maine. Features include:  Hundreds of dining recommendations, from lobster rolls to four-star cuisine  Opinionated listings of inns, B&Bs, hotels, and vacation cabins  150 black & white photographs  34 up-to-date regional and downtown maps  Calendar guides to annual events and celebrations  An alphabetical \"What's Where\" guide for trip planning  Handy icons point out places that offer best value, cater to families, welcome pets, and provide handicapped access  Index  An independently researched guide; no paid listings",
        "Category": " Travel , Museums, Tours, Points of Interest",
        "Publisher": "Countryman Pr",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Millennium Membership : How to Attract and Keep Members in the New Marketplace",
        "Authors": "By Levin, Mark",
        "Description": "Explains six steps in understanding and meeting members' needs in associations and other organizations. The six steps, covered in separate chapters are identify the new marketplace, invest in technology, move from mass marketing to mass customization, maintain the human touch, brand the organization, and create a membership experience. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Business & Economics , General",
        "Publisher": "Amer Society of Assn Executives",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "The Official Scrabble Players Handbook",
        "Authors": "By Conklin, Drue K.",
        "Description": "Explains the purposes, services, and activities of Scrabble Crossword Game Players, Inc., and details and illustrates various tactics, strategies, and techniques of informal and competition play",
        "Category": "",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Pediatrics: A Primary Care Approach (Saunders Text and Review Series)",
        "Authors": "By Berkowitz, Carol D., M.D.",
        "Description": "",
        "Category": " Medical , Pediatrics",
        "Publisher": "W B Saunders Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Burning of Washington: The British Invasion of 1814 (Bluejacket Books)",
        "Authors": "By Pitch, Anthony S.",
        "Description": "With all the immediacy of an eyewitness account, Anthony Pitch tells the dramatic story of the British invasion of Washington in the summer of 1814, an episode many call a defining moment in the coming-of-age of the United States. The British torched the Capitol, the White House, and many other public buildings, setting off an inferno that illuminated the countryside for miles and sending President James Madison scurrying out of town while his wife Dolley rescued a life-sized portrait of George Washington from the flames. The author's gripping narrative--hailed by a White House curator, a Senate historian, and the chairman of the National Geographic Society, among others--is filled with vivid details of the attack. Not confining his story to Washington, Pitch also describes the brave, resourceful defense of nearby Fort McHenry and tells how Francis Scott Key, a British hostage on a ship near the Baltimore harbor during the fort's bombardment, wrote a poem that became the national anthem.",
        "Category": " History , United States , General",
        "Publisher": "Naval Institute Press",
        "Price Starting With ($)": "7.6",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Black Water (Pendragon #5)",
        "Authors": "By Machale, D. J.",
        "Description": "Breaking the rules  Just when fifteen-year-old Bobby Pendragon thinks he understands his purpose as a Traveler -- to protect the territories of Halla from the evil Saint Dane -- he is faced with an impossible choice. The inhabitants of Eelong are in danger of being wiped out by a mysterious plague. The only way Bobby can stop it is to bring the antidote from another territory. Since moving items between territories is forbidden by the Traveler rules, if Bobby chooses to save Eelong he could endanger himself, his friends, and the future of every other being in Halla.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Pocket Guide to Garden Plants",
        "Authors": "By Johnson, Hugh",
        "Description": "Offers pictures, descriptions, and information on habitat and propagation for a variety of vegetables, fruits, flowers, shrubs, and trees",
        "Category": " Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1981"
        }
    },
    {
        "Title": "Becoming A Master Student, 12th edition",
        "Authors": "By Ellis, Dave, Toft, Doug (EDT), Mancina, Dean (CON), and McMurray, Eldon L. (CON)",
        "Description": "The Twelfth Edition of the bestselling Becoming a Master Student continues to lead the way in meeting the changing needs of today's first-year students. Through interactive journaling, a motivational writing style, and hands-on activities that students can apply right away, this text helps students succeed in college and in life. The Twelfth Edition's clean, sophisticated interior design appeals to both traditional students and adult learners. Tools like the Discovery Wheel, Discovery and Intention Journal, Power Process articles, Master Student Profiles, and the Kolb Learning Styles Inventory (LSI) deepen students' knowledge of themselves and the world around them.In addition to the traditional print format, the Twelfth Edition offers a new Multimedia version, which brings together all of the tools instructors have come to rely on--such as videos, quizzes, and journal entries--and delivers them in a single, seamless format. Also look for a more concise length; a completely revised Diversity Chapter; a new Money Chapter; additional strategies for choosing a major; Mastering Technology boxes, skillfully connecting each chapter's topic with applicable technology; an updated Communication chapter with new coverage on analyzing your audience and overcoming the fear of public speaking; and expanded coverage of planning for the next semester and for a career in the What's Next chapter.",
        "Category": " Education , Student Life & Student Affairs",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Real Simple: Celebrations",
        "Authors": "By Rains, Valerie (EDT) and Schlechter, Annie (PHT)",
        "Description": "Featuring a host of creative solutions to take the hassle out of entertaining, this colorful handbook guides readers step by step through the process of creating the perfect Thanksgiving dinner, New Year's Eve celebration, child's birthday party, and other special occasions, featuring handy checklists, game plans, advice, and easy-to-follow ideas.",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "TI Inc. Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Polymer Claywork (New Crafts)",
        "Authors": "By Maguire, Mary",
        "Description": "The wonderful molding and modeling qualities of polymer clay celebrated inspirational designs and practical projects.",
        "Category": " Crafts & Hobbies , Dough",
        "Publisher": "Anness",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Holocaust Museum In Washington",
        "Authors": "By Weinberg, Jeshajahu and Elieli, Rina",
        "Description": "This is the inside story of the United States Holocaust Memorial Museum in Washington D.C., told by the very people who developed the museum as a place for learning, communicating, and remembering. This book conveys the dedication to truth and scholarship that is the foundation of the Holocaust Memorial Museum, and details the museum's role in presenting evidence of lives and events that must never be forgotten.When the museum opened in April 1993, Holocaust survivors saw their dream come true--their story could be told to the world. Since it opened, the museum has had to contend with unprecedented attendance records, as 5000 visitors a day continue to wait in line to see the exhibitions and experiences the architecture of this remarkable place.This is a story of a monumental achievement--from the planning and construction of the museum, theater, conference center, and library; to the design and selection of exhibits; to the participation of the first visitors. It tells of the 'visitor as victim' approach to exhibitions, of the effort to educate children, and the commitment to historical truth in the narrative representation of the Holocaust.As a remembrance for visitors to the museum and an introduction for those who have yet to visit, this beautifully illustrated book gives the reader an intimate tour of the exhibitions, and an understanding of the need for this place in our society. There, we remind ourselves of that which has been, in order to assure ourselves a future that accepts the diversity of humankind.",
        "Category": " Travel , Museums, Tours, Points of Interest",
        "Publisher": "Rizzoli",
        "Price Starting With ($)": "6.81",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Fashions of the Old South Paper Dolls in Full Color (Dover Paper Dolls)",
        "Authors": "By Tierney, Tom",
        "Description": "Paper doll collectors will delight in dressing two Southern belles in an elegant wardrobe of finely detailed costumes, precisely rendered from genuine period clothing circa 1861. Twelve authentic fashions include a lace-trimmed green taffeta carriage dress, a dressing gown of delicate vanilla silk, an evening dress of magenta terry velvet, a white satin bridal gown accented with alternating rows of chiffon and satin flounces, and other breathtaking outfits. Additional costumed characters include six children in period attire and three men dressed in Confederate Army uniforms and civilian garb. Charming accessories, such as parasols, lace-trimmed hats, gloves, fans, a kite, and more, accompany the antebellum-era women and children.",
        "Category": " Juvenile Nonfiction , Activity Books",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Garages & Carports: Converting, Expanding, Building",
        "Authors": "By Russell, James E.",
        "Description": "Shows how to build a variety of garages and suggests ways to modify them to create additional living space",
        "Category": " House & Home , General",
        "Publisher": "Creative Homeowner Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1981"
        }
    },
    {
        "Title": "Design Ideas for Decks",
        "Authors": "By Editors of Creative Homeowner",
        "Description": "A successful deck makes the outdoors more enjoyable and functionally expands living space.Design Ideas for Decks provides the design inspiration homeowners need to create the deck of their dreams. Through portfolios of lavish photographs, readers experience the latest trends in deck layouts, decking patterns, built-in seating and storage, railings, and finishes. An easy-to-follow design guide assists readers in creating the deck that best suits the needs of their family and home. This book proves that decks need not be simple, square slabs, but can be distinctive, graceful structures that enhance the appeal - and value - of any home.",
        "Category": " House & Home , Outdoor & Recreational Areas",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Decorated Letter",
        "Authors": "By Alexander, Jonathan James Graham",
        "Description": "",
        "Category": "",
        "Publisher": "George Braziller",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Manuscript Painting at the Court of France: The Fourteenth Century, 1310-1380 (English and French Edition)",
        "Authors": "By Avril, Francois",
        "Description": "",
        "Category": " Antiques & Collectibles , Art",
        "Publisher": "George Braziller",
        "Price Starting With ($)": "5.78",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "In The Tracks Of Tamerlane: Central Asia's Path To The 21st Century",
        "Authors": "By Burghart, Daniel L. (EDT)",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Natl Defense Univ Pr",
        "Price Starting With ($)": "5.98",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Spirit of Happiness: Discovering God's Purpose for Your Life",
        "Authors": "By Karasu, Toksoz B.",
        "Description": "In the course of our lives, we struggle to establish careers and relationships that we hope will infuse us with a sense of purpose. While important titles, wealth, power, and possessions may represent a life that is successful in the eyes of others, pursuit of these achievements prompts us to seek more of the same again and again. However, it is only through a fundamental understanding of faith in God that we can discover His purpose for each of us in life, and can in turn pursue a meaningful existence and achieve lasting happiness.In his authentic and profound book The Spirit of Happiness, Dr. T. Byram Karasu explores the psychological barriers that prevent so many of us from allowing faith to become an integral part of our lives and from becoming truly serene and fulfilled human beings.We all experience many difficulties and conflicts in our daily lives, meeting challenges at work and in relationships, suffering through illness, losses, and failures, feeling anxious, depressed, or simply empty and purposeless. If we view such ordeals through the wisdom of the Holy Bible, which Dr. Karasu presents to us here as the ultimate self-help book, we can learn to understand and identify with God's Holy Purpose. Psycho-spiritual exercises, including meditations and affirmations based on God's word, are placed at the end of each chapter to help focus the reader's spiritual intention and lead the way to a more joyful and rewarding existence.Beautifully written and deeply moving, The Spirit of Happiness begins where most self-help books end.",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "All About Bermuda Onions: How to Cook Onions, Their History & Health Benefits",
        "Authors": "By Valentine, Nancy",
        "Description": "",
        "Category": "",
        "Publisher": "The Island Press Ltd.",
        "Price Starting With ($)": "5.6",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "First Aid for the Soul (Mini Book) (Petites)",
        "Authors": "By Frazier, C. James (EDT) and Tinsley, Sonya (EDT)",
        "Description": "",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Peter Pauper Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Little Critter: Happy Valentine's Day, Little Critter!",
        "Authors": "By Mayer, Mercer",
        "Description": "Join Mercer Mayer’s classic and beloved character, Little Critter®, for his class’s Valentine’s Day celebration!This 8x8 storybook is complete with gatefold flaps for readers to pull back and discover all the fun Valentine’s Day surprisesFrom decorating the classroom with hearts to eating cupcakes and making Valentine’s Day mailboxes, Little Critter is having the best day ever. He’s even making an extra-special card for an extra-special valentine!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Valentine's Day",
        "Publisher": "HarperFestival",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Faith, Hope, And Love: An Inspirational Treasury Of Quotations",
        "Authors": "By Running Press (EDT)",
        "Description": "These three simple virtues guide us in our relationships and give us strength, comfort, and inspiration. The profoundly beautiful sentiments expressed here will stimulate one's own personal reflections.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "From the Heart: One-Minute Devotions",
        "Authors": "By Rice, Helen Steiner",
        "Description": "",
        "Category": " Religion , Christian Life , Devotional",
        "Publisher": "Christian Art Gifts Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Sandy Seal: A Tale of Sea Dogs",
        "Authors": "By Suzanne Tate",
        "Description": "",
        "Category": "",
        "Publisher": "Nags Head Art, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Clap Your Hands (Paperstar Book)",
        "Authors": "By Cauley, Lorinda Bryan",
        "Description": "",
        "Category": "",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Kennedy Without Tears: The Man Beneath the Myth",
        "Authors": "By Wicker, Tom",
        "Description": "",
        "Category": "",
        "Publisher": "Morrow",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Gooseberry Patch Christmas: Book 4",
        "Authors": "By Leisure Arts Publications",
        "Description": "",
        "Category": " Crafts & Hobbies , Holiday & Seasonal",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Magical Science: Magic Tricks for Young Scientists",
        "Authors": "By Ladizinsky, Eric and Burke, Dianne O'Quinn",
        "Description": "Presents scientific experiments that appear to be magic tricks",
        "Category": "",
        "Publisher": "Lowell House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Stokes Butterfly Book : The Complete Guide to Butterfly Gardening, Identification, and Behavior",
        "Authors": "By Stokes, Donald, Stokes, Lillian, and Williams, Ernest",
        "Description": "Copiously illustrated with maps, line drawings, and full-color photographs, this large format paperback book contains the essential information that backyard nature enthusiasts want and need -- to attract butterflies to their yards.",
        "Category": " Nature , Animals , Butterflies & Moths",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Ripley's Believe It or Not",
        "Authors": "By Ripley\u0092s Believe It or Not",
        "Description": "A collection of strange facts and coincidences about animals and human beings in the world of science, art, and entertainment.",
        "Category": " Reference , Curiosities & Wonders",
        "Publisher": "Mint Pub",
        "Price Starting With ($)": "6.62",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Low-Fat Cook Book (Best of Sunset)",
        "Authors": "By Sunset Books (EDT)",
        "Description": "Gathers low-fat recipes for appetizers, soups, salads, meat, poultry, seafood, vegetables, breads, and desserts",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "PAGANS & CHRISTIANS",
        "Authors": "By Fox, Robin Lane",
        "Description": "Explores the character of early Christianity, with details on religious life, secular daily life, and the condition of paganism at the time of its defeat",
        "Category": " Religion , Comparative Religion",
        "Publisher": "Knopf",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Cook's Illustrated 2008 (Cook's Illustrated Annuals)",
        "Authors": "By America's Test Kitchen",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "America's Test Kitchen",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "How to Grow a Women's Mini's Tree",
        "Authors": "By Klope, Joan B. and Hepburn, Daisy",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Gospel Light Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "Save Our Forests",
        "Authors": "By Hirschi, Ron",
        "Description": "",
        "Category": "",
        "Publisher": "New York Delacorte 1993.",
        "Price Starting With ($)": "10.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Curious George in the Big City",
        "Authors": "By Rey, H. A., Rey, Margret, and Weston, Martha (ILT)",
        "Description": "When the man with the yellow hat promises to buy George a holiday surprise during their trip to the city, George decides he wants to give his friend a surprise too. But it isn't long before the little monkey's curiosity gets him into trouble and he gets separated from his friend. Though he has fun seeing the tourist sites and all the sparkling decorations, what he enjoys most is finding his best friend and enjoying the city together. NEW bonus features include a drawing activity, word jumble, and spot-the-difference activity.",
        "Category": " Juvenile Fiction , Animals , Apes, Monkeys, etc.",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Martha Blah Blah (Martha Speaks)",
        "Authors": "By Meddaugh, Susan",
        "Description": "Something's wrong with Martha, the talking dog! She has eaten her daily bowl of alphabet soup, but when she opens her mouth to speak, strange sounds come out instead of words. Fortunately her nose still works, and she follows it to the source of the mystery.",
        "Category": " Juvenile Fiction , Animals , Dogs",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Out of the Ocean",
        "Authors": "By Frasier, Debra",
        "Description": "Open this book and you'll be walking along the ocean shore, looking for all kinds of special things. Some will be small enough to fit in your hand--like shells and sea glass. Others--like the sun and the sky and the waves--will be too big to carry home. But no matter what your journey holds, you'll soon learn that looking for the ocean's treasures can be as important as finding them.Debra Frasier, author-illustrator of the bestselling On the Day You Were Born, invites you along on this beach journey of discovery.",
        "Category": " Juvenile Nonfiction , Science & Nature , Earth Sciences , Water (Oceans, Lakes, etc.)",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "How to Make Holiday Pop-Ups",
        "Authors": "By Hendry, Linda (ILT) and Irvine, Joan",
        "Description": "Provides instructions for making pop-ups for special events, particularly holidays which kids are involved in celebrating and for which they exchange cards",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Beech Tree Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Sporting Guns: Pleasures and Treasures",
        "Authors": "By Akehurst, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Juices & Smoothies: Over 160 Healthy, Refreshing and Irrestible Drinks and Blend",
        "Authors": "By Suzannah Olivier, Joanna Farrow",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "9.88",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "I Wonder If Dragons Are Real: And Other Neat Facts About Reptiles and Amphibians (I Wonder Series)",
        "Authors": "By Donati, Annabelle and Barnes, Suzanne (ILT)",
        "Description": "A look at reptiles provides a definition for reptiles, examines the king cobra, tells why turtles cannot jump, and answers other pertinent questions",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Goldencraft",
        "Price Starting With ($)": "12.49",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Sisters: An Anthology",
        "Authors": "By Freeman, Jan (EDT), Wojcik, Emily (EDT), and Bull, Deborah (EDT)",
        "Description": "This heartwarming and heart-wrenching collection of stories, memoirs, and poems celebrates the beautifully complex world of sisters. A relationship like no other, the unbreakable link between sisters can be at once sweet and loving, fierce and cruel. From childhood to old age, rivalry to devotion, hysterical laughter to tears of grief, the inescapable bonds between sisters create a unique journey. Sisters is for anyone who knows sisters, wishes they had a sister, adores her own sister, or would, on occasion, like to trade her in. Contributors include: Joyce Armor, Margaret Atwood, Joan Baez, Claire Bateman, Simone de Beauvoir, Robin Becker, Jane Bowles, Gwendolyn Brooks, Lan Samantha Chang, Marilyn Chin, Catherine Chung, Lucille Clifton, Clare Coss, Edwidge Danticat, Sadie and Bessie Delany, Rita Dove, Delia Ephron, M.F.K. Fisher, Julia Glass, Barbara L. Greenberg, Jane Hirshfield, Cynthia Hogue, Beverly Jensen, Ruth Prawer Jhabvala, Ana Maria Jomolca, Mary Karr, Marie Luise Kaschnitz, Tsipi Keller, Barbara Kingsolver, Maxine Kumin, Jeanne M. Leiby, Audre Lorde, Grace Paley, Dorothy Parker, Martha Rhodes, Muriel Rukeyser, Myra Shapiro, Ali Smith, Misty Urban, Alice Walker, Wendy Wasserstein and Daisy Zamora.",
        "Category": " Literary Collections , American , General",
        "Publisher": "Paris Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "Celtic and Anglo-Saxon Painting: Book Illumination in the British Isles 600-800",
        "Authors": "By Nordenfalk, Carl Adam Johan",
        "Description": "Forty-eight folios from important examples of illuminated manuscripts produced in the British Isles between 600 and 800 A.D. are accompanied by descriptive, historical, and appreciative commentaries",
        "Category": "",
        "Publisher": "George Braziller",
        "Price Starting With ($)": "9.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Simple Stunning Weddings: Designing and Creating Your Perfect Celebration",
        "Authors": "By Bussen, Karen and Silverman, Ellen",
        "Description": "A Manhattan wedding designer whose work has been featured in top magazines showcases twelve popular wedding settings and counsels readers on how to build on a location, incorporate color and other personal touches, and work within a budget. 20,000 first printing.",
        "Category": " Reference , Weddings",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "The Almanac of American Politics, 2004",
        "Authors": "By Barone, Michael and Cohen, Richard E.",
        "Description": "\"September 11 changed everything.\" How often have we heard or thought that since that awful morning? Yet for 14 months, September 11 seemed to have changed very little in American politics; the nation's electorate still seemed split evenly between the parties, divided along cultural lines. But as the results of the 2002 elections came in, it became clear that something had indeed changed, as Republicans made down-the-line gains from the statehouses to Capitol Hill. The Republican romp is only one of the topics treated in the 2004 edition of \"the bible of American politics.\" In his introduction to this new edition, Michael Barone describes how and why the nation came to elect Republican majorities in both the House of Representatives and Senate in 2002--and what it will mean for politics and governance. Barone's introduction leads off the completely redesigned Almanac of American Politics 2004, which contains all the information journalists, politicians, academics, and citizens have come to expect from the nation's leading political reference work. With insightful and colorful profiles of every governor and every member of Congress as well as updated narrative profiles filled with economic, social, historical and political background information about all 50 states and 435 House districts, The Almanac of American Politics remains the indispensable guide to the American political scene. The 2004 edition also includes a look at how redistricting will alter American politics over the course of the next decade; photographs of all 535 members of Congress and the 50 governors; and voting records on important legislation, including congressional vote ratings by National Journal and a dozen influential interest groups.More Feature of the 2004 Almanac* Updated Census data and richly detailed congressional district maps* 2002 election results for each member of Congress* 2004 election analysis* Presidential results by state and by congressional district",
        "Category": " Reference , Almanacs",
        "Publisher": "National Journal Group",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Rasl Volume 1: The Drift (RASL, 1)",
        "Authors": "By Smith, Jeff",
        "Description": "RASL, a dimension jumping art thief with a tattoo of a woman's name (Maya) on his left arm, is wandering in a desert battered and bloody. He recollects his memories on a job where he steals a Picasso painting (The Old Guitarist) from a tall house during a thunderstorm. After tagging the location of the painting, RASL escapes from the police by using an immersion suit to enter the Drift, a place where he is able to travel to other dimensions.",
        "Category": " Comics & Graphic Novels , Science Fiction",
        "Publisher": "Cartoon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Being Wicked",
        "Authors": "By Danes, Lacy",
        "Description": "In \"Willful Surrender,\" Lilly, stowing away in her brother's carriage, stumbles into a world of pure carnal pleasure with the help of a notorious rake, and in \"Willing Seduction,\" a lonely widow, disguised as a courtesan, engages in a torrid affair with her brother's best friend. Original.",
        "Category": " Fiction , Erotica , General",
        "Publisher": "Aphrodisia",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Art From Many Hands: Multicultural Art Projects",
        "Authors": "By Schuman, Jo Miles",
        "Description": "Dozens of rewarding, easy-to-do craft and art projects from all over the world.",
        "Category": " Art , General",
        "Publisher": "Davis",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Practicing Catholic",
        "Authors": "By Carroll, James",
        "Description": "From a National Book Award-winning and bestselling author, James Carroll's examination and explaination of why he is till a practicing catholic, set against the history of the Catholic Church in America and the sometimes glorious, sometimes discouraging actions of its leaders.Practicing Catholic is a personal history of the American Catholic Church during James Carroll’s lifetime. It traces the transformation of a medieval institution suspicious of American ideas of freedom and democracy into a church that has begun to embrace basic American principles of pluralism and respect for conscience. The book tells the story of heroes (Pope John xxiii, Thomas Merton, Cardinal Richard Cushing, William Sloane Coffin), and great events (Vatican ii, the Kennedys, the end of the Cold War). Considering the new meaning of belief in a secular world, it stands against the fundamentalisms of “neo-athetists” as well as of born again Christians. The book shows how and why the world needs a renewed, rational, vital Catholic Church. All of this is centered in the life-long journey of its author, who embraced the priesthood in his youth, but who finds in the writing life a renewal of religious belief. For James Carroll faith is a practice-- like all practice, it aims at getting better.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Dugout Rivals (Fred Bowen Sports Story Series)",
        "Authors": "By Bowen, Fred",
        "Description": "Jake Daley loves baseball. He loves playing for the Red Sox in the Woodside baseball league. He loves playing short stop. Most of all, he loves to win.Jake is excited when newcomer Adam Hull is selected to play for the Red Sox. Adam can do it all—pitch, hit, and field. But as the Red Sox rack up win after win, and Adam’s talents dominate every game, Jake can’t help but wonder: Do he or the other players even matter? When Jake’s father tells him the story of Babe Ruth and the 1927 Yankees, though, Jake sees how even the best players must rely on their teammates.Author Fred Bowen continues his Sports Story series with play-by-play action that’s sure to keep readers on the edge of their seats! An afterword provides the real story of the 1927 Yankees, the group that many have called “The Greatest Team of All Time.”",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Peachtree",
        "Price Starting With ($)": "12.11",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "The Way to Freedom: Core Teachings of Tibetan Buddhism",
        "Authors": "By Dalai Lama XIV and Lopez, Donald S.",
        "Description": "His Holiness the Dalai Lama's teaching legacy to the world -- a beautiful and accessible presentation of the time-honored path to enlightenment -- is one of the world's great spiritual treasures.The Way to Freedom, the inaugural volume of the landmark Library of Tibet series, is the essential primer on Tibetan Buddhism for both neophytes and advanced students. Based on a fifteenth-century text never before translated for a general audience, it is the revered heart of Tibetan practice, presented here in easy-to-understand steps by the Dalai Lama, Tibet's exiled spiritual and political leader.",
        "Category": " Religion , General",
        "Publisher": "HarperSanFrancisco",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "The Fate of Katherine Carr (Otto Penzler Books)",
        "Authors": "By Cook, Thomas H.",
        "Description": "George Gates used to be a travel writer who specialized in places where people disappeared—Judge Crater, the Lost Colony.Then his eight-year-old son was murdered, the killer never found, and Gates gave up disappearance. Now he writes stories of redemptive triviality about flower festivals and local celebrities for the town paper, and spends his evenings haunted by the image of his son’s last day. Enter Arlo MacBride, a retired missing-persons detective still obsessed with the unsolved case of Katherine Carr. When he gives Gates the story she left behind—a story of a man stalking a woman named Katherine Carr—Gates too is drawn inexorably into a search for the missing author’s brief life and uncertain fate. And as he goes deeper, he begins to suspect that her tale holds the key not only to her fate, but to his own.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "My New Best Friend (Friends for Keeps)",
        "Authors": "By Bowe, Julie",
        "Description": "There's a new girl in town! After Ida May’s last best friend moved away, she swore she’d never have another. But then she met fun, sparkly Stacey Merriweather, and now she and Ida are like two peas in a pod. When the friends discover a magical mermaid night-light that seems to grant wishes, they start a secret club—just the two of them. Ida uses the mermaid to make something bad happen to Jenna, the mean girl in class. Then Stacey uses the mermaid to undo a scheduled math test. The more they put the mermaid's powers to use, the more they need to help it along by manipulating the truth with their \"highly creative stories.\" Ida goes along with all the lies at first.  But before long, Ida suspects that Stacey is using the mermaid to tell some big lies . . . and to cause some big trouble at home. And soon Ida feels caught between telling the truth and hurting friendship with Stacey. How will Ida set the record straight while still keeping her new best friend?",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "CY",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2010"
        }
    },
    {
        "Title": "Idiots, Hypocrites, Demagogues, and More Idiots: Not-So-Great Moments in Modern American Politics",
        "Authors": "By Slansky, Paul",
        "Description": "Outrageous, offensive, and mind-boggling political blunders of the last fifty years, collected here for the first time. There’s nothing more enjoyable than when political bigwigs stick their feet in their mouth. Whether discussing foreign policy, the choice of vice-presidential running mate, the State of the Union, or the state of their marriage, the chances to screw up political careers are seemingly endless. In Idiots, Hypocrites, Crimals, and More Idiots, humorist Paul Slansky gathers together some of the most outrageous, hypocritical, self-serving, demagogic, criminal, offensive, surreal, and just plain idiotic moments in American politics over the last fifty years. With deliciously subversive sections entitled “Inaccurate Prognostications,” “Delicious Wallows In Schadenfreude,” “Bizarre Blurts,” and “Freudian Slips,” this book brings together the worst mistakes America’s politicians, policy-makers, and wonk-heads ever had the audacity to commit—sometimes two or three times.",
        "Category": " Humor , General",
        "Publisher": "Bloomsbury USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "The American Leadership Tradition: Moral Vision from Washington to Clinton",
        "Authors": "By Olasky, Marvin",
        "Description": "A timely look at the relationship between private morals and public politics profiles thirteen American statesmen, including Thomas Jefferson, John Kennedy, Booker T. Washington, and John Rockfeller, and offers a historical perspective on the current scandals in Washington. 17,500 first printing.",
        "Category": " Philosophy , Ethics & Moral Philosophy",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Sleeping Beauties: Newborns in Dreamland",
        "Authors": "By Raver, Tracy (PHT) and Ryden, Kelley (PHT)",
        "Description": "",
        "Category": " Photography , Subjects & Themes , Children",
        "Publisher": "Sellers Publishing",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    }
]