[
    {
        "Title": "Your Wife is Not Your Momma: How You Can Have Heaven in Your Home",
        "Authors": "By Boone, Wellington",
        "Description": "Taking the saying \"your wife is not your momma\" as the title of his book, Bishop Wellington Boone offers sound advice to the married man who wants to improve his relationship with his wife, and to the woman who wants to see a change in her man. It is the ideal guide for those who want to have a little bit of heaven in their home.Boone's message is a simple one: Put God first and serve your wife as Jesus served the Church. By using your relationship with God as the model for your marriage, you put yourself in a position to love and, in return, be loved, thereby creating a fulfilling and rewarding home life. Boone shows what works, why it works, and how to apply it to your own life. No matter whether you are single, divorced, newly wed, or celebrating a silver anniversary, this book offers important counsel on the critical issues that must be resolved before getting married; how to prevent problems with your spouse and children; and how to avoid being an outlaw instead of a beloved in-law. Filled with do's and don'ts, tables and checklists, questions to work through, Bible references, and reflective prayers, Your Wife Is Not Your Momma is an invaluable resource for anyone who wants to enjoy the rewards of a God-centered relationship.",
        "Category": " Religion , Christianity , Literature & the Arts",
        "Publisher": "Galilee Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Dark Place",
        "Authors": "By Elkins, Aaron J.",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "I Say a Prayer for Me: One Woman's Life of Faith and Triumph",
        "Authors": "By Anderson, Stanice",
        "Description": "A former reporter for USA-Today.com shares her devastating odyssey through drug addiction, self-destruction, and abusive relationships to reclaim her life with the help of God's unwavering faith, love, and healing and offers an inspirational collection of the prayers that helped her through her the darkest period of her life. Reprint.",
        "Category": " Religion , Inspirational",
        "Publisher": "Walk Worthy Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Orchid Blues (Holly Barker)",
        "Authors": "By Woods, Stuart",
        "Description": "Stuart Woods brings back small-town police chief Holly Barker—and her extraordinary Doberman, Daisy—for another exhilarating adventure in this New York Times bestseller.When Holly Barker’s wedding festivities are shattered by a brutal robbery, she vows to find the culprits. With nothing to go on but the inexplicable killing of an innocent bystander, Holly discovers evidence that leads her into the midst of a clan whose members are as mysterious as they are zealous. Holly’s father, Ham, a retired army master sergeant, is her ticket into their strange world. What he finds there boggles the mind and sucks them all—Holly, Ham, and Daisy—into a whirlpool of crazed criminality from which even the FBI can’t save them...",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Pastime (Spenser 18)",
        "Authors": "By Parker, Robert B.",
        "Description": "The most personal and revealing Spenser thriller of all, Pastime is Robert B. Parker's electrifying masterpeice of crime fiction--a startling game of memory, desire, and danger that forces Spenser to face his own past. Ten years ago, he saved a teenage boy from a father's rage. Now, on the brink of manhood, the boy seeks answers to his mother's sudden disapearance. Spenser is the only man he can turn to.This time, it's more than a routine search for a missing person--Spenser must search his own soul...",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Our Game",
        "Authors": "By Le Carre, John",
        "Description": "From the #1 New York Times bestselling author of A Legacy of Spies and The Night Manager, now an AMC miniseries With the Cold War fought and won, British spymaster Tim Cranmer accepts early retirement to rural England and a new life with his alluring young mistress, Emma. But when both Emma and Cranmer’s star double agent and lifelong rival, Larry Pettifer, disappear, Cranmer is suddenly on the run, searching for his brilliant protégé, desperately eluding his former colleagues, in a frantic journey across Europe and into the lawless, battered landscapes of Moscow and southern Russia, to save whatever of his life he has left. . . .    Praise for Our Game“As thrilling as le Carré gets . . . The novel has the heartstop duplicity of A Perfect Spy and some of the outraged honor of The Night Manager and The Little Drummer Girl.”—The Boston Globe “Furious in action . . . takes us by the neck on page one and never lets go.”—Chicago Sun-Times “Irresistible . . . a sinuous plot, leisurely introduced, whose coils become increasingly constricting. There is crisp, intelligent dialogue, much of it riding an undercurrent of menace. And there is a hero who does not see himself as heroic but who struggles with inner demons as much as with the forces arrayed against him.”—Time “Gripping.”—The Christian Science Monitor",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Semi-Homemade Slow Cooker Recipes (Sandra Lee Semi-homemade)",
        "Authors": "By Lee, Sandra",
        "Description": "Incredible meals and extra easy dishes that taste like they're made from scratch120 recipes including chili, hearty soups and stews, one-pot meals, five-ingredient dishes, and slow-cooked dessertsTips and hints on how to reinvent slow cooker leftovers and cut fat and calories from comfort food favoritesDeliciously simple recipes and suggestions for entertaining groups while taking it easy on the cook",
        "Category": " Cooking , Methods , Special Appliances",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "The Fundamentals of Negotiating",
        "Authors": "By Nierenberg, Gerard I.",
        "Description": "",
        "Category": "",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Frommer's Nova Scotia, New Brunswick & Prince Edward Island (2nd Ed)",
        "Authors": "By Rogers, Barbara Radcliffe and Curtis, Wayne",
        "Description": "It's a Whole New World with Frommer's. Frommer's is packed with completely up-to-date practical information, exact prices, and candid insider advice. It's the most authoritative, easy-to-use guide you can buy. Everything You Need for the Perfect Trip:Great places to stay: historic hotels, B&Bs by the sea, the best camping sites, and moreFabulous seafood fresh from the Atlantic: Malpeque Bay oysters, all-you-can-eat lobster suppers, Digby scallops, and more?with the best places for picturesque waterfront diningA complete guide to exploring the provinces, from great fishing villages and provincial parks to the Fortress of Louisbourg and Iceberg AlleyThe best of the outdoors: sailing, sea kayaking, fishing, nature walks, day hikes, and rappeling?plus the best places to spot caribou, puffins, and bald eaglesDetailed, accurate two-color city and regional mapsFrommer's. The Name You Can Trust. Find us online at www.frommers.com",
        "Category": " Travel , Canada , Atlantic Provinces (NB, NL, NS, PE)",
        "Publisher": "*Frommers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Handle with Care: A Novel",
        "Authors": "By Picoult, Jodi",
        "Description": "When Willow is born with severe osteogenesis imperfecta, her parents are devastated—she will suffer hundreds of broken bones as she grows, a lifetime of pain. In this provocative story from the #1 New York Times bestselling author, “Picoult writes with unassuming brilliance” (Stephen King).Every expectant parent will tell you that they don’t want a perfect baby, just a healthy one. Charlotte and Sean O’Keefe would have asked for a healthy baby, too, if they’d been given the choice. Instead, their lives are made up of sleepless nights, mounting bills, the pitying stares of “luckier” parents, and maybe worst of all, the what-ifs. What if their child had been born healthy? But it’s all worth it because Willow is, funny as it seems, perfect. She’s smart as a whip, on her way to being as pretty as her mother, kind, brave, and for a five-year-old an unexpectedly deep source of wisdom. Willow is Willow, in sickness and in health. Everything changes, though, after a series of events forces Charlotte and her husband to confront the most serious what-ifs of all. What if Charlotte had known earlier of Willow’s illness? What if things could have been different? What if their beloved Willow had never been born? To do Willow justice, Charlotte must ask herself these questions and one more. What constitutes a valuable life? Emotionally riveting and profoundly moving, Handle with Care is an unforgettable novel about the fragility of life and the lengths we will go to protect it.",
        "Category": " Fiction , Medical",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.61",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Two-Part Harmony",
        "Authors": "By Morley, Patrick M.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Williams-Sonoma Simple Classics Cookbook: The Best of Simple Italian, French & American Cooking",
        "Authors": "By Williams, Chuck",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Weldon Owen",
        "Price Starting With ($)": "6.03",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Disney High School Musical 3 Senior Year: The Junior Novel (Junior Novelization)",
        "Authors": "By Grace, N. B. (ADP)",
        "Description": "This must-have junior novel with an 8-page full-color insert retells the story of the much-anticipated theatrical release of High School Musical 3, which finds high school seniors Troy and Gabriella facing the prospect of being separated from one another as they head off to different colleges. Joined by the rest of the Wildcats, they stage an elaborate spring musical reflecting their experiences, hopes, and fears about the future. High School Musical 3 will be released in theaters in Fall 2008.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Vision in White (The Bride Quartet, Book 1)",
        "Authors": "By Roberts, Nora",
        "Description": "#1 New York Times bestselling author Nora Roberts presents her first trade original—a novel of love, friendship, and family—in this beautiful french flap edition of Book One in the Bride Quartet. Wedding photographer Mackensie \"Mac\" Elliot is most at home behind the camera, but her focus is shattered moments before an important wedding rehearsal when she bumps into the bride-to-be's brother...an encounter that has them both seeing stars. A stable, safe English teacher, Carter Maguire is definitely not Mac's type. But a casual fling might be just what she needs to take her mind off bridezillas. Of course, casual flings can turn into something more when you least expect it. And Mac will have to turn to her three best friends—and business partners—to see her way to her own happy ending.Don't miss the other books in the Bride QuartetBed of RosesSavor the MomentHappy Ever After",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "Healthy Recipes: Delicious, Healthy Recipes From Around The World",
        "Authors": "By Helen Adams",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Bird In A Cage",
        "Authors": "By Martin, Lee",
        "Description": "Investigating the suspicious death of a trapeze artist who fell when her cables snapped, Fort Worth detective Deb Ralson is unable to find anyone who would benefit from the murder, until she uncovers a decades-old tragedy. Reprint.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Worldwide Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Requiem For a Glass Heart: A Novel",
        "Authors": "By Lindsey, David L.",
        "Description": "REVENGE CAN BE ECSTASY.Irina Ismaylova is a sexual assassin, luring men and women to her bed...and their death.  From St. Petersburg to Paris, she kills not for money or for pleasure, but under orders from the Russian mafioso who holds her in thrall.  Desperate to buy back what is left of her shattered life, Irina must carry outone last mission....Cate Cuevas is a special agent in Houston's FBI office.  Devastated by her husband's death--and his betrayal--she has plunged into the most dangerousassignment of her career.  But to succeed, she must form a secret and profoundly intimate alliance with the enemy: Irina Ismaylova.Two women.  One a cop.  The other a killer.  For these two there is no right, no wrong, no rules.  Only the truth...and terror.",
        "Category": " Fiction , Thrillers , Espionage",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "It's Easy to Avoid Probate",
        "Authors": "By Stock, Barbara R.",
        "Description": "",
        "Category": " Law , General",
        "Publisher": "Linch Pub",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "The Case of the Lost Song (Nancy Drew)",
        "Authors": "By Keene, Carolyn",
        "Description": "AT A TRAVELING ANTIQUES SHOW, NANCY'S APPRAISING BURGLARIES, FRAUD, AND A GREEDY THIEF!  While visiting Chicago, Nancy, Bess, and George bring some items to the Old Can Be Gold show to see what they're worth, just for fun. In George's old tape recorder, a dealer finds a rare early tape by a famous rock group. But before George can get it insured, it's stolen -- like many other items brought to the show!  From a luxury condo on Lake Shore Drive to a hot blues club, Nancy discovers a mix of suspects. There's a seedy dealer, an ambitious publicist with access to the show's database, a talented singer in need of money, and drop-dead gorgeous twin brothers, one a top appraiser and the other a gifted photographer. Nancy's got to wind up the case -- before a desperate con artist erases her for good!",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Buttons and Foes (Wwl Mystery, 487)",
        "Authors": "By Johnson, Dolores",
        "Description": "Hiring a private detective when a favorite customer dies suspiciously, intrepid dry cleaner Mandy Dyer recognizes the detective as a former disreputable who she once stood up in high school, and she becomes suspicious of his claims that he has changed. Reprint.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "WWL Mystery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "The Kennedys An American Drama",
        "Authors": "By Peter Collier, David Horowitz",
        "Description": "Tells the complete story of the triumphs and failures of the Kennedy family, a chronicle that encompasses the major events of the second half of this century",
        "Category": "",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1985"
        }
    },
    {
        "Title": "Living with Enthusiasm: How the 21-Day Smile Diet Can Change Your Life",
        "Authors": "By Mary Marcdante",
        "Description": "",
        "Category": "",
        "Publisher": "Inspired Life Publishing",
        "Price Starting With ($)": "12.11",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "She Went All the Way",
        "Authors": "By Cabot, Meg",
        "Description": "There are a few places screenwriter Lou Calabrese would rather be than crammed into a helicopter with Jack Townsend, star of her claim to fame, Copkiller, and whose ex just ran off with Lou's ex. Talk about uncomfortable. But when, halfway out to the isolated arctic location where Copkiller IV is currently shooting, their pilot turns murderous and their helicopter crashes, Lou realizes her day has just gotten a lot worse.Now, while family and friends back home fret over her disappearance, Lou is on the run in the arctic wilderness with America's sweetheart Jack Townsend and only the contents of her purse, his pockets, and their mutual knowledge of survival movie trivia to keep them alive. Can these two children of Hollywood put aside their differences and make it back home without killing each other? Or much, much worse, actually start to like one another?",
        "Category": " Fiction , Women",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Vampire Academy",
        "Authors": "By Mead, Richelle",
        "Description": "The story that kicked off the international #1 bestselling Vampire Academy series is NOW A MAJOR MOTION PICTURE! St. Vladimir’s Academy isn’t just any boarding school—it’s a hidden place where vampires are educated in the ways of magic and half-human teens train to protect them. Rose Hathaway is a Dhampir, a bodyguard for her best friend Lissa, a Moroi Vampire Princess. They’ve been on the run, but now they’re being dragged back to St. Vladimir’s—the very place where they’re most in danger. . . .Rose and Lissa become enmeshed in forbidden romance, the Academy’s ruthless social scene, and unspeakable nighttime rituals. But they must be careful lest the Strigoi—the world’s fiercest and most dangerous vampires—make Lissa one of them forever.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Razorbill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Past Due (Victor Carl Series, 4)",
        "Authors": "By Lashner, William",
        "Description": "It means something to be a client. It means he gets my loyalty, whether he deserves it or not. It means he gets my absolute best for the price of an hourly fee. It means in a world where every person has turned against him there is one person who will fight by his side for as long as there is a battle to be fought.—Victor CarlAuthor of the acclaimed novels Fatal Flaw, Bitter Truth, and Hostile Witness, bestselling writer William Lashner crafts dark, witty, engrossing tales of suspense involving one of the most intriguing characters of modern popular fiction: Victor Carl.A defense attorney who lives his life in shades of gray, Victor Carl fights all the right fights for all the wrong reasons. With a failing legal practice, a dead-end love life, a pile of unpaid traffic tickets, and a talent for mixing it up in tough working-class bars and sparring with obstinate cops, Victor skates on the razor's edge of legal ethics in search of the easy buck. But the one absolute in Victor's life is loyalty, especially to a client—even if he happens to be dead. Like Joey Cheaps, a no-account who takes a knife to the throat down on the waterfront, but not before he shares with his lawyer his part in a terrible crime.With his client murdered, Victor must search for a killer. But solving the crime means investigating the darkest spot in Joey Cheaps's misspent youth, sending Victor on a twisting journey that leads to a missing suitcase stuffed with money, photographs of a mysterious naked woman, and a Supreme Court justice with a secret to hide. And most dangerous of all, Victor steps into the crosshairs of a vengeful enemy with a past full of pain and a taste for blood.As thrilling as it is darkly evocative, Past Due is a superb tale of crime and justice that takes the intrepid Victor Carl into brilliant new territory and confirms William Lashner's place among the top suspense writers of our time.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Time Lapse (Worldwide Library Mystery)",
        "Authors": "By Law, Janice",
        "Description": "Hired to investigate the death of an action/adventure movie star, Anna Peters explores the actor's latest production site and finds that the truth is about as exciting as the victim's scripts. Reprint.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Worldwide Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Stealth",
        "Authors": "By Morris, M. E.",
        "Description": "Relinquishing his command of the U.S.S. Ford to take part in a top-secret military mission, Captain Joshua Dunne, aided by counterpart Sheila \"Frosty\" Kohn, must stop a nuclear terrorist in communist China. Original.",
        "Category": "",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Crushed",
        "Authors": "By McNeal, Laura and McNeal, Tom",
        "Description": "Audrey and her best friends Lea and C.C. have just arrived at Jemison High from the one-room private school where they spent grades six through ten, where they performed Gilbert and Sullivan musicals, where they adored Edith Wharton. They’re a nerdy little trio, so everyone is shocked when the handsome new guy, Wickham Hill, asks Audrey out. Audrey is soon so smitten that she hardly pays any mind to the vicious underground newspaper at school–or to that strange lurking guy in World Cultures. Before long, it seems everyone at Jemison High is worried about getting crushed–by friends, by enemies, by a mysterious reporter.",
        "Category": " Young Adult Fiction , School & Education , General",
        "Publisher": "Knopf Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Abraham Lincoln in Peace and War",
        "Authors": "By MIERS, Earl Schenck",
        "Description": "Illustrated account of Lincoln's life from his boyhood days to his Presidency",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1964"
        }
    },
    {
        "Title": "Call It Courage",
        "Authors": "By Sperry, Armstrong",
        "Description": "A boy tries to overcome his fear of the sea in this treasured classic and winner of the Newbery Medal.Maftu was afraid of the sea. It had taken his mother when he was a baby, and it seemed to him that the sea gods sought vengeance at having been cheated of Mafatu. So, though he was the son of the Great Chief of Hikueru, a race of Polynesians who worshipped courage, and he was named Stout Heart, he feared and avoided tha sea, till everyone branded him a coward. When he could no longer bear their taunts and jibes, he determined to conquer that fear or be conquered-- so he went off in his canoe, alone except for his little dog and pet albatross. A storm gave him his first challenge. Then days on a desert island found him resourceful beyond his own expectation. This is the story of how his courage grew and how he finally returned home. This is a legend. It happened many years ago, but even today the people of Hikueru sing this story and tell it over their evening fires.",
        "Category": " Juvenile Fiction , Social Themes , Self-Esteem & Self-Reliance",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Storm",
        "Authors": "By Starling, Boris",
        "Description": "When a chilling series of mutilation murders, crimes that bear a horrifying resemblance to perverted sacrifices rather that normal killings, terrorizes the city, veteran detective Kate Beauchamp enlists a most unlikely ally to find the killer. By the author of Messiah. Original.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "The Secrets of Boys",
        "Authors": "By Abbott, Hailey",
        "Description": "Eric: Loves surfing, has killer abs, an even better smile, and a heart of gold.  Joe: A sarcastic goofball who gives great advice, which no one ever takes.  Zach: Sophisticated college boy, wise in the ways of French painting as well as other French things.  A California girl like Cassidy Jones should be out on the beach, not stuck in summer school! But her life heats up when she meets the worldly and romantic Zach – she can't stop thinking about him, even though she already has a boyfriend. Cassidy wishes her pal Joe were around to help her figure out the secrets of boys, but he's hundreds of miles away. Will she be able to ignore her feelings for Zach – or will temptation be too strong to resist? Ages 14+",
        "Category": " Young Adult Fiction , Social Themes , Friendship",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Girl Stuff: A Survival Guide to Growing Up",
        "Authors": "By Pollak, Barbara (ILT), Blackstone, Margaret, and Guest, Elissa Haden",
        "Description": "Girls approaching puberty have lots of questions: What should they do if their period starts and they aren't prepared? Can they get rid of that zit before tomorrow? Why do they sometimes feel cranky and scared? This comprehensive, reassuring, and compassionate guide will help answer those questions, and many more. Useful sections explain both the physical and psychological changes that adolescence brings and how to cope with them. Written in a no-nonsense style--with quotes from dozens of girls about their own experiences--this essential resource provides practical information about the trials and tribulations of puberty.",
        "Category": " Juvenile Nonfiction , Health & Daily Living , Maturing",
        "Publisher": "Gulliver Books Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Getting Lost with Boys",
        "Authors": "By Abbott, Hailey",
        "Description": "Cordelia Packer hates the unexpected, but she's in for a surprise when Jacob Stein offers to be her travel companion, all the way from San Diego to her sister's place in northern California. Before she knows it, her neatly laid out summer plan has turned into a wild road trip, where anything can – and does – happen. Who knew getting lost with a boy could be so much fun?",
        "Category": " Young Adult Fiction , Social Themes , Friendship",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Best Science Fiction Novellas of the Year #2",
        "Authors": "By Carr, Terry (EDT)",
        "Description": "",
        "Category": " Fiction , Science Fiction , Short Stories",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "September",
            "Year": "1980"
        }
    },
    {
        "Title": "Marat Sade",
        "Authors": "By Peter Weiss",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Murder Without Icing",
        "Authors": "By Emma Lathen",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Winter Stalk",
        "Authors": "By James L Stowe",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1980"
        }
    },
    {
        "Title": "Second Deadly Sin",
        "Authors": "By Sanders, Lawrence",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "August",
            "Year": "1978"
        }
    },
    {
        "Title": "FULL DISCLOSURE",
        "Authors": "By Safire, William",
        "Description": "The press, his twenty-seven-year-old mistress, and the members of his Cabinet attempt to use the Twenty-fifth Amendment to remove the President from office",
        "Category": " Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "The Encyclopedia of Mythology: Gods, Heroes, and Legends of the Greeks and Romans",
        "Authors": "By Flaum, Eric and Pandy, David",
        "Description": "Organized alphabetically, this encyclopedia of mythology contains information about the figures who make up the mythologies of the Greco-Roman world and two hundred full-color photographs and illustrations.",
        "Category": " Religion , General",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "4.98",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "Garden Style Projects",
        "Authors": "By Better Homes and Gardens Books (EDT), Hallam, Linda (EDT), and Better Homes and Gardens Books (COR)",
        "Description": "These simple, affordable projects will motivate every homeowner to bring a fresh garden motif inside or decorate a fresh-air room for easy comfort. There are dozens of practical, doable ideas for furniture, finishes, fabrics, accessories and more.Affordable, original projects with easy, step-by-step instructions.Color photos of real homes, rooms and gardens that show off a treasure trove of creative ideas.",
        "Category": " House & Home , Decorating",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "6.53",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Interdisciplinary Curriculum: Design and Implementation",
        "Authors": "By Jacobs, Heidi Hayes (EDT)",
        "Description": "An introduction to an interdisciplinary approach in education explores six design options for an interdisciplinary curriculum and offers a process for integrating the teaching of science, math, language arts, social studies, and the arts.",
        "Category": " Education , Curricula",
        "Publisher": "Assn for Supervision & Curriculum",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Science Bulletin Boards (Easy to Make and Use Bulletin Board Series)",
        "Authors": "By Forte, Imogene and Pangle, Mary Ann",
        "Description": "",
        "Category": "",
        "Publisher": "Incentive Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "October Light",
        "Authors": "By Gardner, John",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1977"
        }
    },
    {
        "Title": "Honorary Consul",
        "Authors": "By Graham Greene",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1980"
        }
    },
    {
        "Title": "Modern Guitar Method: Grade 1",
        "Authors": "By Mel Bay Publications, Inc.",
        "Description": "",
        "Category": " Music , Instruction & Study , General",
        "Publisher": "Mel Bay Publications, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "Asimov on Astronomy",
        "Authors": "By Asimov, Isaac",
        "Description": "Brings together and updates essays originally published in The Magazine of Fantasy and Science Fiction, providing factual information on the moon, planets, and stars",
        "Category": " Science , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "13.46",
        "Publish Date": {
            "Month": "February",
            "Year": "1975"
        }
    },
    {
        "Title": "Ultimate Success",
        "Authors": "By Beaudine, Frank R.",
        "Description": "Successful businessman Frank Beaudine will show readers that the materialistic perspective is not the only perspective of success.Ultimate Success will show the reader that true success depends on a relationship with Jesus Christ and the fulfillment He provides in everyday living.",
        "Category": " Self-help , Personal Growth , Success",
        "Publisher": "Tyndale House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "I Can't Believe She Did That!: Why Women Betray Other Women at  Work",
        "Authors": "By Mooney, Nan",
        "Description": "I CAN’T BELIEVE SHE DID THAT! offers a new and compelling perspective on conflict and competition among women in the workplace. Nan Mooney explores how and why some women hurt each other on the job, and what we can do to begin cleaning up the mess. Based on real stories from real women, I CAN’T BELIEVE SHE DID THAT! provides a provocative social and cultural exploration of the often troubled and painful dynamics that unfold among women on the job. The massive influx of women into the workplace in the past thirty years means a whole new category of problems has arisen. Suddenly women are working over, under and alongside other women. Their professional relationships are subject to the pressures and conflicts of organizational culture, not to mention society at large. Women on the job have grown more comfortable with ambition, competition and success, but that hasn’t negated the value they place on communication and relationships, on being liked and being nice. Striking a balance between these two selves is a delicate undertaking and many women are uncertain how to interact in a workplace where such lines are regularly being blurred.   Working together, women have fostered a breathtaking degree of positive change. But there is another side to the story. If women are to continue moving forward, the time has come to examine — honestly and unequivocally — our very human impulse to compete with, hurt and even destroy one another to get what we want. In I CAN’T BELIEVE SHE DID THAT! Nan Mooney provides vivid insights on the emotional toll competition can take on working women and charts a path towards more productive and fulfilling relationships for professional women everywhere.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Today's Military Wife",
        "Authors": "By Cline, Lydia Sloan",
        "Description": "Provides essential information on military benefits, family services, financial affairs, protocol, housing, moving, and sponsorship for wives of American servicemen.",
        "Category": " Reference , General",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Classrooms That Work: They Can All Read and Write (3rd Edition)",
        "Authors": "By Cunningham, Patricia M. and Allington, Richard L.",
        "Description": "This education textbook provides strategies for helping children learn to read and write in elementary school.  The authors suggest specific activities for encouraging recognition of letter-sound patterns, decoding and spelling, thinking while writing, and interest in science and social studies.  The third edition adds chapters on multilevel instruction, assessment, and comprehension. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Education , Elementary",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Pillsbury Family Christmas Cookbook",
        "Authors": "By Pillsbury Company",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "The Vegetarian Planet: 350 Big-Flavor Recipes for Out-Of-This-World Food Every Day",
        "Authors": "By Emmons, Didi",
        "Description": "All the best flavors from all the Earth come to life in a soulful celebration of tasty and inventive food. From Didi Emmons, a terrific young cook who combines a passion for culinary adventure with a love for the honest pleasures of home cooking, these 350 recipes - with more than 150 main dishes - spell an end to boring and bland meatless meals. Full of farm-fresh produce ripe for the eating, hearty grains that warm the soul, and a whole world of new spices and flavors, they promise boundless pleasures for the everyday table.",
        "Category": " Cooking , Vegetarian",
        "Publisher": "Harvard Common Press",
        "Price Starting With ($)": "5.28",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Mosby's Manual of Diagnostic and Laboratory Tests",
        "Authors": "By Pagana, Kathleen Deska and Pagana, Timothy James",
        "Description": "The highly successful first edition of MOSBY'S MANUAL OF LABORATORY AND DIAGNOSTIC TESTS received rave reviews for itsfull-color design and illustrations, user-friendly organization and format,comprehensiveness, and readability. THE MANUAL is a complete resource for nurses and other health professionals in either academic or clinical settings. It is the first and only full-color lab test book available and is liberally illustrated with color photos and drawings that show exactly how various tests are performed. Virtually every clinically significant test is covered, including the latest tests for allergy blood testing, atrial natriuretic factor, homocysteine, N-telopeptide, and troponins. Patient teaching priorities are now noted with a special icon, and a dozen additional Home Care Responsibilities boxes have been added to support the increasing emphasis on early discharge and outpatient testing.",
        "Category": " Medical , Laboratory Medicine",
        "Publisher": "Mosby",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Dinosaurs I Have Known",
        "Authors": "By Polisar, Barry Louis and Stewart, Michael (ILT)",
        "Description": "A humorous survey of the more obscure species of dinosaurs, this book describes the appearance and habits of 18 outrageous creatures, including the Surfosaurus, Snifflesaurus, and Rockadopolis Rex.",
        "Category": " Young Adult Fiction , Humorous , General",
        "Publisher": "Rainbow Morning Music",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Creative Christmas Kitchen/21421 (Memories in the Making Series)",
        "Authors": "By Childs, Anne Van Wagner (EDT) and Leisure Arts, Inc. (COR)",
        "Description": "",
        "Category": " Crafts & Hobbies , Seasonal",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "The Clever Cook's Kitchen Handbook: 5,037 Ingenious Hints, Secrets, Shortcuts, and Solutions",
        "Authors": "By Joachim, David",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Pisces Rising",
        "Authors": "By Lawrence, Martha C.",
        "Description": "After seeing her fiance gunned down at the end of her last investigation, psychic detective Elizabeth Chase is reluctant to go back to detective work. But then an old friend calls in a favor. Elizabeth finds her unique talents pitted against her most brutal and baffling case yet - the pursuit of a vicious murderer wanted in connection with the scalping of a Native American casino owner.Elizabeth soon learns that the tranquil setting of the Temecu reservation belies a dangerous undercurrent of political scheming, racism, and pure human greed. As she struggles to figure out who can be trusted, Elizabeth must call upon all of her resources not only to solve the crime, but to restore her own spirit.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "St. Martin's Minotaur Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "The Coming Out Stories",
        "Authors": "By Wolfe, Susan J. and Penelope, Julia",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Persephone Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1980"
        }
    },
    {
        "Title": "Beowulf (Barnes & Noble Classics)",
        "Authors": "By Anonymous and McNamara, John",
        "Description": "Beowulf is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics:New introductions commissioned from today's top writers and scholarsBiographies of the authorsChronologies of contemporary historical, biographical, and cultural eventsFootnotes and endnotesSelective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the workComments by other famous authorsStudy questions to challenge the reader's viewpoints and expectationsBibliographies for further readingIndices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.Widely regarded as the first true masterpiece of English literature, Beowulf describes the thrilling adventures of a great Scandinavian warrior of the sixth century. Its lyric intensity and imaginative vitality are unparalleled, and the poem has greatly influenced many important modern novelists and poets, most notably J. R. R. Tolkien, author of The Lord of the Rings.Part history and part mythology, Beowulf opens in the court of the Danish king where a horrible demon named Grendel devours men in their sleep every night. The hero Beowulf arrives and kills the monster, but joy turns to horror when Grendel’s mother attacks the hall to avenge the death of her son. Ultimately triumphant, Beowulf becomes king himself and rules peacefully for fifty years until, one dark day, a foe more powerful than any he has yet faced is aroused—an ancient dragon guarding a horde of treasure. Once again, Beowulf must summon all his strength and courage to face the beast, but this time victory exacts a terrible price.New translation by John McNamara. Features an original map and genealogy chart.",
        "Category": " Fiction , Sagas",
        "Publisher": "Barnes & Noble Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2005"
        }
    },
    {
        "Title": "Bets You Can't Lose: How to Win Free Drinks... and Still Keep Your Friends (A Laughter Library Book)",
        "Authors": "By Sullivan, Patrick B.",
        "Description": "",
        "Category": "",
        "Publisher": "Price, Stern, Sloan Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1979"
        }
    },
    {
        "Title": "The Call of the Wild (Classic Starts)",
        "Authors": "By Corvino, Lucy (ILT) and Ho, Oliver",
        "Description": "Following Sterling's spectacularly successful launch of its children's classic novels (240,000 books in print to date),comes a dazzling new series: Classic Starts. The stories are abridged; the quality is complete. Classic Starts treats the world's beloved tales (and children) with the respect they deserve--all at an incomparable price.Here is the ultimate dog story, one filled with emotion, adventure, and excitement. During the Gold Rush, Buck is snatched away from his peaceful home and brought to the harsh and bitter Yukon to become a sled dog. Will he adapt, and learn to trust men? Or will his newly awakened primitive instincts lead him to search for the freedom he has never known?",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Union Square Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The Norton Anthology of English Literature, Volume C: The Restoration and the Eighteenth Century",
        "Authors": "By Greenblatt, Stephen (EDT), Lipking, Lawrence (EDT), and Noggle, James (EDT)",
        "Description": "Firmly grounded by the hallmark strengths of all Norton Anthologies—thorough and helpful introductory matter, judicious annotation, complete texts wherever possible—The Norton Anthology of English Literature has been revitalized in this Eighth Edition through the collaboration between six new editors and six seasoned ones. Under the direction of Stephen Greenblatt, General Editor, the editors have reconsidered all aspects of the anthology to make it an even better teaching tool.",
        "Category": " Literary Collections , European , English, Irish, Scottish, Welsh",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Ken Hom's Quick and Easy Chinese Cooking",
        "Authors": "By Hom, Ken and Berg, Paul",
        "Description": "Described by Craig Claiborne as \"one of the world's leading authorities on Chinese cooking,\" Ken Hom is also a master of quick cuisine. Ken Hom's Quick and Easy Chinese Cooking dishes up delicious Chinese fare in mere minutes with mouth-watering recipes and quick tips for healthy, nourishing meals in no time. Shopping lists, itemized preparation and cooking times, menu suggestions, and strategies for shortcuts beat the clock with everything from appetizers and soups to main dishes and desserts. Designed for today's household running on a hectic schedule, as well as for the cook who wants a gratifying dinner without much fuss, this book satisfies with home-cooked meals organized ahead of time, or tasty treats whipped up in minutes. In an era when even discerning cooks are tempted to compromise to save time, Ken Hom comes to the rescue with Ten Minute Salmon with Green Onion Sauce, or Papaya and Grapefruit Salad. Readers can serve up Quick Orange-Lemon Chicken in twenty minutes, or Elizabeth Chong's Noodle Salad in just seventeen minutes. Using shelves stocked with items from the book's suggested Basic Chinese Pantry, even the most reluctant cook can conjure up a fabulous meal. Lavish full-color photographs round out this truly indispensable resource for cooks on the go.",
        "Category": " Cooking , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "An Actor's Guide--Making It in New York City",
        "Authors": "By Alterman, Glenn",
        "Description": "For any actor in or on the way to New York City, this is the definitive source for advice, winning strategies, marketing techniques, and invaluable insights to being a successful New York actor. This new edition has been completely revised and updated to cover the significant changes in the New York theater landscape over the last nine years. This indispensable guide has also been expanded to include dozens of new interviews with top New York City actors and a completely improved Internet chapter equipped with the most up-to-date tools to thrive in the industry. Aspiring and established professionals will find this thorough and up-to-the-minute volume chock full of resources and advice about auditioning, making professional connections, promoting one's self, seeking opportunities in nontraditional venues, finding an apartment, securing \"survival jobs,\" understanding actor unions, getting headshots, and furthering one's actor training in New York. This guide also details working as a film extra, careers in print modeling, scams and rip-offs to avoid, opportunities for actors with disabilities, and using the Internet to the fullest advantage. Included are in-depth interviews with legendary show business figures such as actor Henry Winkler, casting director Juliet Taylor, and theater director Joseph Chaikin as well as top talents from the fields of film, television, stage, commercials, and talent agencies. Written by a professional New York actor with over thirty years of experience, this meticulously researched guide will give actors the tools they need to survive and thrive in New York show business.",
        "Category": " Performing Arts , Acting & Auditioning",
        "Publisher": "Allworth Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Dramatic Encounters With God (Women of Faith (Zondervan))",
        "Authors": "By Johnson, Nicole",
        "Description": "Walk with Christ through ancient Jerusalem as he encounters the man with the withered hand, John the Baptist, Judas, and four other New Testament characters in this book of dramatic sketches by Nicole Johnson, the Women of Faith dramatist. Nicole uses her talent for storytelling to help us be there with Christ and see the scenes with new eyes and understanding, bringing to life lessons that apply to our modern lives.",
        "Category": " Religion , Christian Living , Spiritual Growth",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Chrissa (American Girl Today)",
        "Authors": "By Jones, Richard (ILT), Casanova, Mary, and England, Tamara (EDT)",
        "Description": "When Chrissa starts fourth grade at a new school, some of the girls in her class play mean tricks on her, but when their teasing of another girl, Gwen, goes too far, Chrissa knows that she has to do something about it.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "American Girl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "The American Writer and the Great Depression",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Bobbs-Merrill",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Christopher Columbus (Sowers)",
        "Authors": "By Rhodes, Bennie",
        "Description": "",
        "Category": " Juvenile Fiction , Science & Technology",
        "Publisher": "Mott Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1976"
        }
    },
    {
        "Title": "False Logic Puzzles",
        "Authors": "By Willis, Norman D. and Sharpe, Jim (ILT)",
        "Description": "They're tough. They're varied. And they all contain at least one false statement.  They're False Logic Puzzles and this batch is set in many mysterious locales. These \"mind-benders\" are much more complicated than other games, often requiring the use of diagrams and the Hints Section. Good luck!    96 pages, 56 b/w illus., 5 3/8 x 8 1/4.",
        "Category": " Games , Puzzles",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The Trumpeter of Krakow",
        "Authors": "By Kelly, Eric Philbrook and Domanska, Janina (ILT)",
        "Description": "A Polish family in the Middle Ages guards a great secret treasure and a boy's memory of an earlier trumpeter of Krakow makes it possible for him to save his father.",
        "Category": " Young Adult Fiction , Historical , Europe",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "The Gig Bag Book Of Guitar Complete",
        "Authors": "By Marki Bridges",
        "Description": "",
        "Category": "",
        "Publisher": "Hal Leonard Corporation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Introduction to tagmemic analysis (Transatlantic series in linguistics)",
        "Authors": "By Cook, W.A.",
        "Description": "",
        "Category": "",
        "Publisher": "Holt Rinehart and Winston",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "The Pavilion",
        "Authors": "By Hilda Lawrence",
        "Description": "",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "6.6",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Java Enterprise in a Nutshell: A Desktop Quick Reference (In a Nutshell (O'Reilly))",
        "Authors": "By Flanagan, David, Crawford, William, Farley, Jim, and Magnusson, Kris",
        "Description": "Java Enterprise in a Nutshell is an indispensable quick reference for Java programmers who are writing distributed enterprise applications.  The book provides fast-paced tutorials on the following Java Enterprise APIs:JDBC, a vendor-independent API for accessing relational database systemsRMI, a Java-only approach to distributed computing that relies on remote method invocationJava IDL, a CORBA-based, language-independent approach to distributed computingJava servlets, a mechanism for extending a web server that allows Java code to perform tasks traditionally handled by CGI scriptsJNDI, a generic Java API for working with networked naming and directory servicesEnterprise JavaBeans, a component model that separates high-level business logic from low-level housekeeping chores like security and transaction managementThese APIs are the building blocks of the Java 2 Platform, Enterprise  Edition (J2EE), Sun's recently announced new platform for enterprise computing. J2EE is the standard Java 2 platform with a number of extensions for enterprise development.Java Enterprise in a Nutshell also contains O'Reilly's classic-style, quick-reference material for all of the classes in the various packages that comprise the Enterprise APIs.  This material includes the core Enterprise APIs that are part of Java 1.2, as well as numerous standard extensions.This book is a companion to both Java in a Nutshell, 3rd Edition, which covers the key non-graphical, non-enterprise APIs in Java 1.2, and Java Foundation Classes in a Nutshell, which describes the graphics- and GUI-related classes of Java 1.2.",
        "Category": " Computers , Programming Languages , Java",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "5.77",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Nellie's Promise (American Girl Collection)",
        "Authors": "By Andreasen, Dan (ILT), Tripp, Valerie, and McAliley, Susan (ILT)",
        "Description": "After being orphaned, Nellie and her two younger sisters find hope when Samantha's family in New York City wants to adopt the girls, but when Uncle Mike shows up and threatens to ruin it all, Nellie must find a way to keep her promise to her dying mother without losing her new family.After being orphaned, Nellie and her two younger sisters find hope when Samantha's family in New York City wants to adopt the girls, but when Uncle Mike shows up, he threatens to ruin it all.",
        "Category": " Juvenile Fiction , Historical , United States , 20th Century",
        "Publisher": "Pleasant Company Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Snakehead (Alex Rider)",
        "Authors": "By Horowitz, Anthony",
        "Description": "What goes up must come down, and when we last saw Alex Rider, he was as up as can be—in outer space. When he crash lands off the coast of Australia, the Australian Secret Service recruits him to infiltrate one of the ruthless gangs operating across South East Asia. Known as snakeheads, the gangs smuggle drugs, weapons, and worst of all, people. Alex accepts the assignment, in part for the chance to work with his godfather and learn more about his parents. What he uncovers, however, is a secret that will make this his darkest and most dangerous mission yet . . . and that his old nemesis, Scorpia, is anything but out of his life. From the slums of Bangkok to the Australian Outback to the middle of the Timor Sea, Snakehead is Alex Rider’s most action-packed adventure yet.Watch a QuickTime trailer for this book.",
        "Category": " Young Adult Fiction , Action & Adventure , General",
        "Publisher": "Philomel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "THE WAR LOVER (Book-of-the-Month Selection)",
        "Authors": "By John Hersey",
        "Description": "",
        "Category": "",
        "Publisher": "Alfred A. Knopf,",
        "Price Starting With ($)": "6.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "Black as He's Painted",
        "Authors": "By Marsh, Ngaio",
        "Description": "",
        "Category": "",
        "Publisher": "Jove Books",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Ulysses S. Grant:: Soldier & President",
        "Authors": "By Perret, Geoffrey",
        "Description": "A comprehensive biography of Ulysses S. Grant describes his varied careers as a military leader and as president of the United States, arguing that his accomplishments as a soldier outweigh his comparative failures as a politician. 15,000 first printing.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Farley Goes to the Doctor",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Goldencraft",
        "Price Starting With ($)": "9.3",
        "Publish Date": {
            "Month": "July",
            "Year": "1981"
        }
    },
    {
        "Title": "My First Dictionary",
        "Authors": "By SUSAN MILLER",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Daniel in the Lions Den:  Daniel 6 for Children",
        "Authors": "By Latourette, Jane",
        "Description": "",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Concordia Pub House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Rough Justice",
        "Authors": "By Higgins, Jack",
        "Description": "Dispatched by the President to report on the state of still troubled Kosovo, his trusted agent Blake Johnson runs into a military man there named Harry Miller, who has the same task from the British Prime Minister. They band together just in time to stop a Russian officer from torching a mosque - or rather, Miller stops him, with a bullet to the forehead.This action will have considerable consequences, not only for Miller and Johnson and their associates, including Britain's Sean Dillon, but for a great many people, all the way to the top of the governments of the United States, Britain, and Russia. Death begets death, and revenge leads only to revenge, and before the chain reaction of events is done - from Kosovo to London to Beirut to Ireland to Moscow - there will be plenty of both.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Prophets: Preachers for God (Biblearn Series)",
        "Authors": "By McMinn, Tom and Fields, Don",
        "Description": "Presents accounts of the lives of five Old Testament prophets: Elisha, Amos, Jeremiah, Jonah, and Micah. Discussion questions accompany each selection.",
        "Category": " Religion , General",
        "Publisher": "Baptist Sunday School Board",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1979"
        }
    },
    {
        "Title": "Goodness of Beans Peas and Lentils (Goodness of Series)",
        "Authors": "By Midgley, John and Sidaway, Ian (ILT)",
        "Description": "Outlines the nutritional benefits of beans, peas, and lentils and presents thirty recipes from different regions of the world",
        "Category": " Cooking , Specific Ingredients , Vegetables",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Scrap Patchwork & Quilting",
        "Authors": "By Michell, Marti",
        "Description": "Explains the reasons for the popularity of scrap quilts, provides a variety of traditional patterns, and shows each step in making a quilt",
        "Category": " Art , General",
        "Publisher": "Meredith Pr",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "All About Dolphins (Sea World Book)",
        "Authors": "By Kovacs, Deborah",
        "Description": "Presents information about dolphins, including how they move and eat, dolphin babies, types of dolphins, their role at Sea World, and the dangers they face",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Third Story Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Pattern on Pattern: Spectacular Quilts from Traditional Blocks",
        "Authors": "By McDowell, Ruth B.",
        "Description": "",
        "Category": " Crafts & Hobbies , Reference",
        "Publisher": "N T C/Contemporary Publishing Company",
        "Price Starting With ($)": "15.98",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Quilts from America's Heartland: Step-By-Step Directions for 35 Traditional Quilts (Rodale Quilt Book)",
        "Authors": "By Porter, Liz and Fons, Marianne",
        "Description": "Provides patterns and instructions for making a variety of Midwestern quilts, including nine patch, blue and white, star, flower, scrap, and other designs",
        "Category": " Art , General",
        "Publisher": "Rodale Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "The foolish immortals",
        "Authors": "By Gallico, Paul",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday & Company, Inc.",
        "Price Starting With ($)": "8.94",
        "Publish Date": {
            "Month": "January",
            "Year": "1953"
        }
    },
    {
        "Title": "Amazing Soy: A Complete Guide to Buying and Cooking This Nutritional Powerhouse With 240 Recipes",
        "Authors": "By Jacobi, Dana",
        "Description": "Dana Jacobi, the undisputed \"Queen of Soy,\" revolutionizes the art of cooking with soy -- the amazing, versatile power food.This definitive cookbook on soy includes240 great-tasting recipes for every occasion and eating style, including instant break-fasts, energy-boosting snacks, working lunches, elegant entertaining dishes, authentic Asian meals, and luscious desserts A comprehensive guide of soyfoods -- from familiar foods like tofu to lesser-known ingredients such as soymeat, soy cheese, miso, tempeh, and much more -- with helpful tips on how to buy, prepare, and cook with 36 of them Nutritional information for each recipeA directory of more than 105 soyfood companies with their websites and mail-order addresses.",
        "Category": " Cooking , Specific Ingredients , Natural Foods",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Too Long a Stranger (Women of the West, Book 9)",
        "Authors": "By Oke, Janette",
        "Description": "After struggling for years, denying herself basic necessities, to supply the funds to send her daughter to a proper boarding school, Sarah Perry is delighted to finally have Rebecca home, but she soon discovers that a vast distance lies between them. Original.",
        "Category": "",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Silent Grow the Guns and Other Tales of the Civil War",
        "Authors": "By KANTOR,MACKINLEY",
        "Description": "",
        "Category": "",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1958"
        }
    },
    {
        "Title": "Nixon: A Political Portrait",
        "Authors": "By Earl Mazo and Stephen Hess",
        "Description": "",
        "Category": "",
        "Publisher": "Popular Library; New York",
        "Price Starting With ($)": "109.92",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "I Want to be a Train Engineer",
        "Authors": "By Carla Greene",
        "Description": "",
        "Category": "",
        "Publisher": "Children's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "Priceless Weddings for Under $5,000",
        "Authors": "By Kennedy, Kathleen",
        "Description": "A priceless wedding is one that emphasizes the unique personalities of the couple getting married.Priceless Weddings for Under $5,000 proves that you can celebrate the spirit of love, hope, joy, and community -- without spending a fortune.Caterer and event planner Kathleen Kennedy offers insights on how to personalize a wedding inexpensively. She shares her savvy, insider techniques and tips to help couples save money on the many high-ticket items on their to-do list, showing where to cut corners and where to go all out. Included are:* A questionnaire to help the bride and groom decide on their top priorities Tips on how to find and book a great low-cost wedding site Guidelines on how to determine a budget, and stick to it* Negotiation tactics for dealing with caterers, florists, musicians, and photographers.Priceless Weddings for Under $5,000 covers every single aspect of your special day, including strategies for finding the perfect dress, great ideas for what to serve for the reception, sample wedding vows and readings, innovative decorations and invitations, and ways to incorporate children into the ceremony for second marriages. Throughout the book, inspiring stories of real-life priceless weddings, with complete budget breakdowns, show how resourceful couples around the country created their own unique celebrations.Priceless Weddings for Under $5,000 is the ultimate guide for couples who want their special day to live on in memory, not through bills.",
        "Category": " Reference , Weddings",
        "Publisher": "Potter Style",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Chuck Klosterman IV: A Decade of Curious People and Dangerous Ideas",
        "Authors": "By Klosterman, Chuck",
        "Description": "Coming off the breakthrough success of Sex, Drugs, and Cocoa Puffs and Killing Yourself to Live, bestselling pop culture guru Chuck Klosterman assembles his best work previously unavailable in book form—including the ground-breaking 1996 piece about his chicken McNuggets experiment, his uncensored profile of Britney Spears, and a previously unpublished short story—all recontextualized in Chuck’s unique voice with new intros, outros, segues, and masterful footnotes.Chuck Klosterman IV consists of three parts: Things That Are True—Profiles and trend stories: Britney Spears, Radiohead, Billy Joel, Metallica, Val Kilmer, Bono, Wilco, the White Stripes, Steve Nash, Morrissey, Robert Plant—all with new introductions and footnotes. Things That Might Be True—Opinions and theories on everything from monogamy to pirates to robots to super people to guilt, and (of course) Advancement—all with new hypothetical questions and footnotes. Something That Isn’t True At All—This is old fiction. There’s a new introduction, but no footnotes. Well, there’s a footnote in the introduction, but none in the story.",
        "Category": " Literary Collections , Essays",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "How Spider Saved the Baseball Game",
        "Authors": "By Kraus, Robert",
        "Description": "Spider cannot hit, field, or catch, so he becomes the pitcher, and at the bottom of the ninth it was up to him.",
        "Category": "",
        "Publisher": "Scholastic",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    }
]