[
    {
        "Title": "All Fishermen Are Liars: True Tales from the Dry Dock Bar",
        "Authors": "By Greenlaw, Linda",
        "Description": "Just before Christmas, Linda meets up with her best friend and fellow fisherman Alden Leeman for lunch and a drink at the Dry Dock, a well-worn watering hole in Portland, Maine. Alden, the captain of Linda's first fishing expedition, has seen his share of mishaps and adventures at sea. When Linda shares memories of navigating her ship through one of the craziest storms she's ever seen, Alden quickly follows up with his own tales. Then other fishermen, who are sitting on the periphery attentively listening, decide to weigh in with yarns of their own. All Fishermen Are Liars brims with true stories of the most eccentric crew member, the funniest episode, the biggest fish, and the wildest night at sea. Denizens of the Dry Dock drift in and out as the bar begins to swell with rounds of drinks and tales that increase in drama. Here are some of the greatest fishing stories ever--all relayed by Linda Greenlaw in her inimitable style. All Fishermen Are Liars will give readers what they have come to love and expect from Linda Greenlaw--luminous descriptions and edge-of-the-seat thrills. It's the perfect book for anyone who loves fishing and the sea.",
        "Category": " Sports & Recreation , Fishing",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "The Widow of the South",
        "Authors": "By Hicks, Robert",
        "Description": "",
        "Category": "",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Divining Women",
        "Authors": "By Gibbons, Kaye",
        "Description": "Autumn 1918. Rumors of peace are spreading across America, but spreading even faster are the first cases of Spanish influenza, whispering of the epidemic to come. Maureen Ross, well past a safe childbearing age, is experiencing a difficult pregnancy. Her husband, Troop -- cold and careless of her condition -- has battered her spirit throughout their marriage. Into this loveless ménage arrives Troop's niece, Mary Oliver, who has come to help Maureen in the last weeks of her confinement. Horrified by Troop's bullying, she realizes that her true duty is to protect her aunt.As the influenza spreads and the death toll grows, Troop's spiteful behavior worsens. He terrorizes the household, but when Mary fights back he begins to go over the edge. Maureen rallies, releasing a stunning thunderstorm of confrontation and, ultimately, finding spiritual renewal.This P.S. edition features an extra 16 pages of insights into the book, including author interviews, recommended reading, and more.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "What the IRS Doesn't Want You to Know: A CPA Reveals the Tricks of the Trade",
        "Authors": "By Kaplan, Martin and Weiss, Naomi",
        "Description": "Revised and updated for the year 2001, this taxpayer's guide draws on insider information to describe to all the savings, audit-prevention advice, and loopholes shares data that the IRS would prefer you did not have. Original. 25,000 first printing.",
        "Category": " Business & Economics , Personal Finance , Taxation",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.38",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The House of Christina : A Novel",
        "Authors": "By Haas, Ben",
        "Description": "A noble manor house in Vienna is the setting for plot and counterplot involving a Nazi, a militant Jew, an American writer, and the lovely and spoiled mistress of the house during the catastrophic thirties and forties",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1977"
        }
    },
    {
        "Title": "How to Apply the Bible",
        "Authors": "By Veerman, Dave",
        "Description": "",
        "Category": "",
        "Publisher": "Billy Graham Evangelistic Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Work of the Counselor",
        "Authors": "By Tyler, Leona Elizabeth",
        "Description": "",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "March",
            "Year": "1969"
        }
    },
    {
        "Title": "The Spirit of Christmas: Creative Holiday Ideas, Book 7",
        "Authors": "By Leisure Arts, Oxmoor House",
        "Description": "",
        "Category": " Cooking , Holiday",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.78",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Early Stages (Lively Arts Series)",
        "Authors": "By Gielgud, John, Sir",
        "Description": "Gielgud recounts his boyhood fascination with the theatre, memorable productions in the twenties and thirties, and associations with such personalities as Marion Terry, Alec Guinness, and Somerset Maugham",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Mercury House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Perspectives",
        "Authors": "By Downs, Hugh",
        "Description": "Perspectives is a wide-ranging collection of some of Hugh Downs's most interesting, informative, and entertaining essays, adapted from the ten-minute broadcasts that have become his hallmark. His topics include everything from ancient myth to space exploration, and include such subjects as the intangible value of gold, the meaning of true happiness, the trials of lefties in a right-handed world, and the role of the Iroquois Confederacy in shaping American political thought.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Turner Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Cooking with Herbs",
        "Authors": "By Hersey, Jean",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Scribners",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Richard Deacon's Microwave Cookery",
        "Authors": "By Deacon, Richard",
        "Description": "A complete beginner's guide to microwave cookery accompanies more than two hundred recipes, all of which may be used with the new variable-power ovens",
        "Category": " Cooking , General",
        "Publisher": "HP Books",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Night After Night",
        "Authors": "By Cooper, Diana Starr and Starr, Ivy (ILT)",
        "Description": "The circus is a world of magic, a place where performers - whether they be people or animals - call forth myths of old. In Night After Night, which relives a performance of The Big Apple Circus, the reader shares the same delight and surprise felt by the audience when the lights go up.Meet Katja Schumann, La Dame du Cirque, who enchants us with her equestrian wizardry and who gave birth to her second child after performing in the evening show; Zamoratte, the contortionist, who squeezes himself whole into a bottle; Anna May, the intuitive performer and seasoned pro, who happens to be a 49-year-old elephant; and Paul Binder, the Ringmaster, who is both master and servant of the spectacle. Diana Cooper spotlights the circus family with spellbinding stories from the performers themselves.Circus is more than mere entertainment: It is a classical art form that blends an immersion in fantasy with consummate skills and traditions. It is the only art form in which varied species work and play as equals. Citing philosophers, poets, and circus lore, Cooper illuminates the special relationship between humans and animals. She views circus as embodying a rich fount of ideas: human/animal coexistence, the beauties of diversity, the permutations of fantasy and reality, our relation to ourselves and the world around us, and notions of what is - and what is not - natural.For centuries circuses have evoked awe, fear, wonder, and joy. As Cooper writes, \"We need fantasies, and circus acknowledges that fantasy is reality wildly elaborated, reality in focus.\" Night After Night captures the poetry of that spirit, pervading and surrounding us with the total magic of circus.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Island Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "The Grand Design - Book Two of Tyrants and Kings",
        "Authors": "By Marco, John",
        "Description": "From John Marco comes the epic sequel to his thrilling debut military fantasy, The Jackel of Nar. An infamous warrior is once again caught between two irrexixtible forces, and his choice may change the world... Prince Richius Vantran, the Jackal of Nar, has fled into exile. Meanwhile, Nar has exploded in civil war. The conflict is being waged between the religious fanatics of Bishop Herrith, who follow the Light of God, and the ruthless followers of Count Biagio and his Black Renaissance. As the terrifying slaughter mounts, fueled by the development of hideous new war machines, Vantran is offered a chance to ally with a third faction and take his revenge against his ancient enemy Biagio. But Biagio, a master of deception and intrigue, has a grand design to gain total power that involves luring Vantran's new allies into a deadly trap. As for Vantran, Biagio has a special punishment: to strike the warrior-prince's only weakness...Vantran's innocent daughter. And Vantran himself will unwittingly seal the young girl's fate.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Spectra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Opening the Door, Volume II: Ghost Stories (Spirits Between the Bays)",
        "Authors": "By Okonowicz, Ed",
        "Description": "",
        "Category": "",
        "Publisher": "Myst & Lace Publishers, Incorporated",
        "Price Starting With ($)": "6.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Living World of Dance: Artistry in Motion",
        "Authors": "By Vartoogian, Jack, Vartoogian, Linda (PHT), and Garey, Carol Cooper (PHT)",
        "Description": "Photos depict the dance heritage of the world, including the lives of ballet dancers and other professionals, national and ceremonial dances, and social and recreational dancing",
        "Category": " Performing Arts , General",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Elephants (World of Nature)",
        "Authors": "By Heatwole, Alan",
        "Description": "Covers both African and Indian elephants and their habitats and behavior",
        "Category": " Science , General",
        "Publisher": "Smithmark Publishers",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Path to Bi-Culturalism",
        "Authors": "By Kramer, Marlene",
        "Description": "",
        "Category": "",
        "Publisher": "Contemporary Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "What a Girl Wants (Ashley Stockingdale, Book 3)",
        "Authors": "By Billerbeck, Kristin",
        "Description": "Ever felt like the last item left on the clearance rack?As a successful patent attorney, Ashley Stockingdale has all the makings of a perfect catch: the looks, the brains, even a convertible. But at 31, she's beginning to wonder if she's been passed over for good.Deciding to adopt a new attitude, Ashley suddenly becomes the romantic interest of three men within a matter of days. While her heart enjoys turning the tables on the dating game, the rest of her previously predictable world is being turned upside down. Is it more than Ashley can handle? Or is it exactly what she wants?Award-wining author Kristin Billerbeck combines comedy with spunk to create a memorable story inWhat a Girl Wants—an all-too-realistic picture of a single girl's search for being content with who she is . . . with or without a man.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "About the Author: The Passionate Reader's Guide to the Authors You Love, Including Things You Never Knew, Juicy Bits You'll Want to Know, and Hundreds of Ideas for What to Read Next",
        "Authors": "By Glossbrenner, Alfred and Glossbrenner, Emily",
        "Description": "A trivia guide for passionate readers, About the Author offers insider information on America's favorite writers, from Margery Allingham to Evelyn Waugh, from Michael Crichton to Charles Dickens. It gives background on the lives of the writers, what they did before becoming writers, facts about their fans, quirky tidbits, and recommendations for what to read next. Chosen for their popularity, their staying power, and the intensity of their following, this amazing range of writers will appeal to all types of readers. Find out what movies and television shows were adapted from their novels, how they decided to become writers, what the Nobel Prize for literature did for some, and what being an Oprah selection did for others. In addition, About the Author includes lists galore: from Pulitzers to fan clubs, from bestseller lists to book conventions, from reading groups to CD-ROMs. About the Author offers an engaging feast of information that any book lover will find hard to put down. Hailed as \"The Great Communicator\" by the New York Times, Alfred Glossbrenner is a freelance writer and author of some forty books on personal computers and other topics. Emily Glossbrenner has written numerous books and has just completed Search Engines for the World Wide Web. The authors live in Bucks County, Pennsylvania. Cader Books has created and produced more than 170 books. Among Cader bestsellers are Brush Up Your Shakespeare! and The Book of Questions: Love and Sex. A Michael Cader Book",
        "Category": " Reference , General",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Marketing for Non-profit Organizations (The Prentice-Hall series in marketing)",
        "Authors": "By Kotler, Philip",
        "Description": "",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "Tree Huggers: Victory, Defeat & Renewal in the Northwest Ancient Forest Campaign",
        "Authors": "By Durbin, Kathie",
        "Description": "",
        "Category": " Nature , Plants , Trees",
        "Publisher": "Mountaineers Books",
        "Price Starting With ($)": "6.54",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Four Cats Make One Pride",
        "Authors": "By Kytle, Elizabeth Larisey",
        "Description": "",
        "Category": "",
        "Publisher": "Seven Locks Press",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Psychics: The Investigators and Spies Who Use Paranormal Powers",
        "Authors": "By Moran, Sarah and Truzzi, Marcello (INT)",
        "Description": "Examines the aid psychics offer by using their extrasensory perceptions to help solve criminal investigations, including the infamous Boston strangler case and the Atlanta child murders.",
        "Category": " Body, Mind & Spirit , Parapsychology , General",
        "Publisher": "Quadrillion Pub",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Html Complete",
        "Authors": "By Coleman, Pat (EDT)",
        "Description": "",
        "Category": " Computers , Enterprise Applications , General",
        "Publisher": "Sybex Inc",
        "Price Starting With ($)": "6.1",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Poultry (Cooking With Bon Appetit)",
        "Authors": "By Bon Appetit (EDT)",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "The Knapp Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "The Great cooks' guide to crepes & souffles: America's leading food authorities share their home-tested recipes and expertise on cooking equipment and techniques",
        "Authors": "By Beard, James",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "A Season in Hell",
        "Authors": "By Higgins, Jack",
        "Description": "Frustrated in her efforts to investigate the circumstances of her son's drug-related death, socialite Sarah Talbot enlists the aid of Sean Egan, a former SAS sargeant to whom killing comes naturally",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "A Secret Affair",
        "Authors": "By Bradford, Barbara Taylor",
        "Description": "At thirty-three, Bill Fitzgerald, acclaimed American television foreign correspondent, is war-weary and exhausted after a long stint in Bosnia. In late November of 1995, he travels to Venice to meet Francis Xavier Peterson, an old friend and a war correspondent for Time magazine, for some much-needed rest and relaxation.While at the bar of the Gritti Palace Hotel on the Grand Canal with Frankie, Bill is struck by the dark beauty of a young woman seated alone at the other side of the bar. Unhappily married to show business lawyer Peter Smart, Vanessa Stewart is a twenty-seven-year-old glass designer from New York who is in town to visit the glass-blowing works in Murano. The three travelers decide that as Americans in Venice, they should celebrate Thanksgiving dinner together. That evening - full of warmth and camaraderie - begins an illicit though fateful love affair.Bill, a widower, has a six-year-old daughter named Helena, who is being raised by his mother, Drucilla Fitzgerald in Manhattan. When it is time to leave Venice, Bill plans a rendezvous with Vanessa - they will meet in New York in December for a Christmas lunch with his daughter and mother. After an idyllic time spent together, they are both completely committed and madly in love. With impediments preventing their relationship from continuing freely, they can only hope for a taste of joy with each other - a series of planned rendezvous. But on the third of these meetings, one of them does not appear.",
        "Category": " Fiction , General",
        "Publisher": "HARPER COLLINS PUBLISHERS",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Acquainted With the Night: And Other Stories",
        "Authors": "By Schwartz, Lynne Sharon",
        "Description": "The author presents her first collection of short stories, which reveal astute observations of middle-class life and targets the compromises that propriety and prudence demand of the heart",
        "Category": " Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Colgates Basic Sailing Theory",
        "Authors": "By Colgate, Stephen",
        "Description": "",
        "Category": "",
        "Publisher": "Van Nostrand Reinhold/co Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "The Two Dead Girls (Green Mile Series, Part 1)",
        "Authors": "By King, Stephen",
        "Description": "",
        "Category": " Fiction , Horror",
        "Publisher": "Signet",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Green Mile book 4: The Bad Death of Eduard Delacroix: The Green Mile, Part 4",
        "Authors": "By King, Stephen",
        "Description": "",
        "Category": " Fiction , Horror",
        "Publisher": "Signet",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "A Study in Scarlet",
        "Authors": "By Arthur Conan Doyle",
        "Description": "",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "8.06",
        "Publish Date": {
            "Month": "April",
            "Year": "1975"
        }
    },
    {
        "Title": "Boundless Energy: The Complete Mind/Body Program for Overcoming Chronic Fatigue (Perfect Health Library)",
        "Authors": "By Chopra, Deepak and Areheart, Shaye (EDT)",
        "Description": "In Boundless Energy, Dr. Chopra introduces an exciting new program for deriving more energy from food, minimizing energy-depleting behaviors, balancing behavioral patterns, and utilizing the power of personal growth to create a sense of natural stimulation and alertness. By following Dr. Chopra's suggestions, readers can fight chronic fatigue and reduce the demands on already stressful lives.Boundless Energy includes a body-type questionnaire based on the traditional Indian science of health known as Ayurveda. By completing this questionnaire, you can access five thousand years of wisdom and learn how to balance your lifestyle and fulfill the unlimited potential that nature intends for you.",
        "Category": "",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Gopalpur: A South Indian Village (Case Studies in Cultural Anthropology)",
        "Authors": "By Beals, Alan R.",
        "Description": "",
        "Category": "",
        "Publisher": "Holt, Rinehart & Winston, Incorporated",
        "Price Starting With ($)": "16.21",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "The Second Stage",
        "Authors": "By Friedan, Bet Franz",
        "Description": "The doyenne of the women's movement charts a plan for the future that emphasizes the family and the quality of life and supports liberation for men and women and a society free from repression and violence",
        "Category": " Social Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "October",
            "Year": "1981"
        }
    },
    {
        "Title": "Needlepoint",
        "Authors": "By Hanley, Hope",
        "Description": "",
        "Category": "",
        "Publisher": "Charles Scribner's Sons",
        "Price Starting With ($)": "13.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Getting Thin: All About Fat--How You Get It, How You Lose It, How You Keep It Off for Good",
        "Authors": "By Mirkin, Gabe and Foreman, Laura",
        "Description": "Combines a survey of up-to-date scientific research on weight control with practical advice on losing weight to present a diet and exercise plan",
        "Category": " Medical , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "The Hot & Cold Summer",
        "Authors": "By Hurwitz, Johanna and Owens, Gail (ILT)",
        "Description": "Poor Rory and Derek. just as the boys are looking forward to their best summer ever, they're ordered to play host to a girl, named Bolivia, visiting nearby. \"You'll love her,\" parents and neighbors insist -- but the ten-year-old best friends know better. After all, nobody consulted them about making their twosome a threesome. So the boys unleash Rory's revenge: clever schemes to avoid meeting or speaking with their unwanted guest.Sometimes, though, how you react to a new situation isn't quite the way you thought you were going to. Rory and Derek discover this -- and learn a few things about their own friendship, too -- during what turns out to be a most unpredictable summer.With her unerring ability to humorously evoke children's concerns and quandaries, Johanna Hurwitz has created yet another story sure to be popular with young readers.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Honest to God?",
        "Authors": "By Hybels, Bill",
        "Description": "In Honest to God? Bill Hybels challenges Christians to examine their lifestyles and honestly see if God has changed their lives. Some areas he addresses include: - family life - work - male and female role models - spiritual disciplines - sound physical fitness - emotional life - marriage values -- \"Christianity is a supernatural walk with a living, dynamic, personal God. Why, then, do so many Christians live inconsistent, powerless lives?\" Hybels answers this question with - Practical, down-to-earth advice on living the Christian life - 12 signs of inconsistent Christian living -- and what to do about them - How to go beyond just \"talking\" the faith - Honest personal examples about failures and successes -- Honest to God? is a clarion call to Christians to restore Christianity in their personal lives and thus influence the world.",
        "Category": " Religion , Christian Living , Personal Growth",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Illustrated Directory of the US Airforce",
        "Authors": "By Roberts, Michael",
        "Description": "A guide to the organization, bases, aircraft, missiles and space launches, and budget of the USAF",
        "Category": " Political Science , General",
        "Publisher": "Crescent",
        "Price Starting With ($)": "7.42",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "The Best Sailing Spots Worldwide",
        "Authors": "By Robinson, Bill",
        "Description": "Explores twenty of the best cruising locales around the world, ranging from British Columbia to New Zealand, and provides information on sights and activities, weather, and support services",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Until the Last Dog Dies (Joe Box Mystery Series, Book 1)",
        "Authors": "By Robinson, John Laurence",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Cook Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "The Kiss of Judas",
        "Authors": "By Scotti, R. A.",
        "Description": "Rome in 1978 is the setting for this tale of a Pope allied with the Soviets and a trusted cardinal who becomes convinced he must betray the Prince of the Church he is sworn to serve",
        "Category": " Fiction , General",
        "Publisher": "Donald I. Fine, Inc.",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "12 steps to living without fear",
        "Authors": "By Ogilvie, Lloyd John",
        "Description": "",
        "Category": "",
        "Publisher": "Word Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The Impossible Child in School--At Home: A Guide for Caring Teachers and Parents",
        "Authors": "By Doris J. Rapp, Dorothy Bamberg",
        "Description": "",
        "Category": "",
        "Publisher": "Practical Allergy Research Foundation",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Passion for Life: Psychology and the Human Spirit",
        "Authors": "By James, John",
        "Description": "Arguing that spirituality is an essential aspect of human psychology, the authors provide techniques for fulfilling spiritual needs and attaining personal realization",
        "Category": " Religion , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "6.78",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Love an Experience of ...",
        "Authors": "By McWilliams, Peter",
        "Description": "",
        "Category": " Poetry , Subjects & Themes , Inspirational & Religious",
        "Publisher": "Prelude Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "An Egyptian journal",
        "Authors": "By Golding, William",
        "Description": "",
        "Category": "",
        "Publisher": "Faber and Faber",
        "Price Starting With ($)": "30.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "One Better",
        "Authors": "By McMillan, Rosalyn",
        "Description": "Spice Witherspoon. Desperate to free her children from misery and poverty, Spice harnessed ambition with an unparalleled sense of style to establish Southern Spice, an elegant, world-renowned restaurant. She has since become one of Michigan's wealthiest, most respected community leaders. Yet in spite of her success, she must decide between the unexpected love of two very different men - even as she fights to shield her two troubled daughters from the devastating secrets that can destroy all she's fought to build.Sterling. Spice's brilliant, beautiful youngest daughter craves her mother's love - and courts it with rebellion. Trapped by a dangerous lover and the endless high of drugs, she finds herself sliding to a new low, where only a miracle love can save her.Mink. Sterling's older sister had a hunger to win that made her one of the nation's first female African-American airline pilots. Instead of rejoicing in her success, she pushes her goals ever higher, alienating herself from her family and plunging into a reckless affair.Golden Westbrook. A dynamic civil rights activist and leading preacher, he offered Spice a man's deepest love and commitment. He would inspire her in ways that would bring her joy, desire, and heartbreak - as well as the promise of life's sweetest rewards.",
        "Category": " Fiction , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Boy Clinton: The Political Biography",
        "Authors": "By Tyrrell, R. Emmett, Jr.",
        "Description": "A New York Times Bestseller!Boy Clinton traces the formative influence of the hustlers and rogues who populated the hometown of the young, fatherless Bill Clinton all the way to the drug-trafficking, tax evading governor and lying, obstructing president he would one day become.Tyrrell's classic expose continues to offer a penetrating and often humorous glimpse into the checkered past of Bill and Hillary long before Monica, Benghazi, and the shady Clinton Foundation dominated the spotlight.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "5.51",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Discovering Our Past: A Brief Introduction to Archaeology",
        "Authors": "By Ashmore, Wendy and Sharer, Robert J.",
        "Description": "",
        "Category": " Social Science , Archaeology",
        "Publisher": "Mayfield Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Arthur's Halloween Costume (I Can Read Book)",
        "Authors": "By Hoban, Lillian",
        "Description": "No one knows what Arthur’s funny-looking costume represents, but even his school principal calls it a winner!  ‘Arthur’s frustrations and hassles ring true, and kids will enjoy the constantly changing costumes.  Hoban’s expressive chimp faces catch the nuances of feeling, and the soft colors catch the action wonderfully well.’ —SLJ.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "Ask the Experts",
        "Authors": "By Reader's Digest Association",
        "Description": "More than six hundred experts representing fields ranging from architecture to sports to accounting present common-sense and useful advice on more than three hundred different subjects, in a handy reference that explains how to safely install a dimmer switch, the secrets of barbecue grilling, how to create a budget to meet long-term financial goals, and more.",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "The Inheritance: How Three Families and America Moved from Roosevelt to Reagan and Beyond",
        "Authors": "By Freedman, Samuel G.",
        "Description": "In a chronicle of three generations of three working-class families, award-winning journalist Samuel G. Freedman tells the human story of the political transformation of twentieth-century America - the rise and fall of FDR's New Deal coalition and its displacement by the new conservatism of Ronald Reagan and Newt Gingrich. This is the single most important political phenomenon of our times.Freedman has selected three families who are at once singular and broadly representative. They are families who reached this country just as the century was beginning and struggled as blacksmiths and domestics and butchers and plumbers to gain a foothold. They are families who acted on their beliefs not only by voting but also by organizing neighborhoods and leading union chapters, canvassing precincts and watching polls and marching in torch-light parades. These families were pillars of the Democratic coalition that largely led America from 1932 until 1968 - community activists, trade unionists, machine politicians, with loyalties based on religion, ethnicity, and social class. These families equally embody the forces that shifted the majority into Republican hands for all but four years between 1968 and 1992 - grievances about taxes, crime, and reverse discrimination; the rise of suburbia and a shift to a new political machine based on private financing for development rather than public works. They are individuals who shifted from New Deal Democrats to Reagan Republicans to a mixture of GOP stalwarts, hesitant Clinton backers, and political dropouts. And in so doing, they carried with them a nation's destiny.The Inheritance will change our understanding of how and why America selects its leaders.",
        "Category": " History , United States , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.78",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Aviation: From Our Earliest Attempts at Flight to Tomorrow's Advanced Designs (Smithsonian Guides)",
        "Authors": "By Lopez, Donald S.",
        "Description": "Hundreds of spectacular photographs help chronicle the landmarks of engineering and imagination in the history of flight, along with profiles of the Wright brothers, Lindbergh, Earhart, and others, and a survey of flying machines from balloons to the Concorde. Simultaneous.",
        "Category": " Technology & Engineering , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The Devil's Heart (Star Trek: The Next Generation)",
        "Authors": "By Carter, Carmen",
        "Description": "When communications are cut off from a remote archaeological outpost, the crew of the Enterprise is sent to investigate, only to discover a ravaged outpost, a dying scientist, and a mystery involving a legendary object of power.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Star Trek",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "The Waite Group's Object-Oriented Programming in Turbo C++",
        "Authors": "By Lafore, Robert",
        "Description": "",
        "Category": " Computers , General",
        "Publisher": "Waite Group Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "The Agenda: Inside the Clinton White House",
        "Authors": "By Woodward, Bob",
        "Description": "Working behind the scenes for the eighteen months following Bill Clinton's election, conducting hundreds of interviews with administration insiders and other key officials, and gaining access to confidential internal memos, diaries, and meeting notes, Bob Woodward has discovered how the Clinton White House really works.  Clinton's pledge for a new economic deal was the cornerstone of his 1992 campaign, and fulfilling it has been his central ambition and enterprise as president. By focusing on Clinton's efforts to pass a comprehensive economic recovery plan, Woodward takes us not only to the highest level meetings, the hard-fought debates, and the most difficult decisions but also to the very hear of this presidency -- and of this man.  With its day-by-day, often minute-by-minute account, it is one of the most intimate portraits of a sitting president ever published. President Clinton is shown as he debates, scolds, pleads, celebrates, and rages in anger and frustration. What emerges also is a group portrait of Clinton's innermost circle of advisers in action -- including his wife, Hillary; Vice President Al Gore; Treasure Secretary Lloyd Bentsen and the economic team; George Stephanopoulos and David Gergen and the White House staff; James Carville, Paul Begala, and the other outside political strategists; Congressional leaders; and Federal Reserve Chairman Alan Greenspan.   Using his proven research method -- returning time and again to key sources and relying on the paper trail of internal documentation -- Woodward has assembled an extensive archive of the early Clinton presidency. This microscopic examination of the Clintons and this administration, working under pressure on the nation's most important task, reveals the deep and still unsettled conflicts among President Clinton's advisers and within himself. The questions about the federal deficit, health care, welfare reform, taxes, jobs, government spending, interest rates, the roles and responsibilities of the middle class, the wealthy, and the poor are of lasting importance. How they are being answered affects each person in the country.",
        "Category": " Political Science , Government , Executive Branch",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "One of Us: Richard Nixon and the American Dream",
        "Authors": "By Wicker, Tom",
        "Description": "America's leading liberal journalist revisits the case of Richard Nixon, taking a fresh look at this political enigma and offering a rereading of contemporary history",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Nothin' but Good Times Ahead",
        "Authors": "By Ivins, Molly",
        "Description": "After twenty years building a reputation as one of the savviest political commentators in the country, Molly Ivins finally put together a book. Molly Ivins Can't Say That, Can She? was on the New York Times bestseller list for over twelve months. The field about her was strewn with the wounded carcasses of the Bushwazee, members of the Texas Legislature, and assorted other scoundrels, while the state of Texas, the democratic process, and Ann Richards had never looked better.Well, as they often say in Amarillo, \"Plus ca change, plus c'est la meme chose.\" Nothin' but Good Times Ahead is Molly Ivins's second collection, and she hasn't stopped callin' 'em as she sees 'em. But this time around she's had for material the only human activity that could possibly give Texas local politics a run for its money (not to mention our money!) - the 1992 presidential campaign. From the early battles of the Democratic pygmies to the Clinton campaign's bimbo eruptions, from Bush's bathos to the Republican National Convention, and from one end of H. Ross Perot to the other, it was a rare year for Molly's brand of political reporting.At the same time, Molly has had to cope with the vicissitudes of being a bestselling \"arthur,\" several months of unemployment after the death of the Dallas Times Herald, and the usual truckloads of tough talk, byplay, and backroom deals among the 181 miscreants, Bible-thumpers, indictees, and occasional honest men and women Texans have elected to govern them. Nothin' but Good Times Ahead does more than its part in the battle to inject common sense, quick wit, and wicked humor into American politics.",
        "Category": " Humor , Form , Essays",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The Bad Girl's Guide to the Open Road",
        "Authors": "By Tuttle, Cameron and Bettag, Susannah (ILT)",
        "Description": "From the author of the very funny and successful Paranoids Pocket Guide, comes the ultimate self-help book for women. It's a guide to the open road that's strictly AAAthat's attitude, adventure, and ass-kicking good times. Filled with indispensable information such as how to get out of a speeding ticket without crying and 14 ways to open a beer bottle on your car, The Bad Girl's Guide to the Open Road also gives the practical lowdown on what to do when your engine overheats, you get a flat, or you need a safe and legal place to spend the night in your car. The fabulous pocket format and indestructible cover make it perfect for flinging in the glove compartment (or stashing in your cubicle if you can't leave right away). For every woman who's about to break unless she gets a break, this hilarious book is the antidote to the doldrumswhether work-, man-, or self-induced. The Bad Girl's Guide to the Open Road: because sometimes a girl's just gotta go.",
        "Category": " Travel , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Great moments in American sports (Landmark giant, no. 24)",
        "Authors": "By Brondfield, Jerry",
        "Description": "Describes forty six great events in United States sports history from the first Rose Bowl in 1902 to Hank Aaron's record-breaking home run in 1974.Views the personalities and games that fashioned American sports between 1902 and 1974 against a backdrop of historical events in the nation",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "The New World Atlas of Golf",
        "Authors": "By Ward-Thomas, Pat (EDT)",
        "Description": "",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Vegetarian Cooking for Good Health",
        "Authors": "By Null, Gary and Null, Shelly",
        "Description": "Offers a broad range of low-sugar, low-sodium, and high-fiber vegetarian dishes, with recipes for breakfast foods, soups, salads, side dishes, main dishes, and desserts, and includes a selection of ethnic recipes",
        "Category": " Cooking , Vegetarian",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Under the Tarnished Dome: How Notre Dame Betrayed Ideals for Football Glory",
        "Authors": "By Yaeger, Don and Looney, Douglas S.",
        "Description": "The author of Undue Process and a senior writer for Sports Illustrated unite to tell the story of how Notre Dame has tarnished its halo in its soulless quest for football glory. 100,000 first printing. Major ad/promo.",
        "Category": " Sports & Recreation , Football",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Gather Round: Christian Fairy Tales for All Ages",
        "Authors": "By Aurelio, John R.",
        "Description": "Sixteen original fairy tales illustrating Christian principles",
        "Category": "",
        "Publisher": "Crossroad Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "The South: A Collection From Harper's Magazine",
        "Authors": "By Harper's Magazine",
        "Description": "",
        "Category": "",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Small Places: In Search of a Vanishing America",
        "Authors": "By Rawls, Thomas H.",
        "Description": "A celebration of small-town America presents a collection of essays that chronicle the past and present of individual communities across the country--from Stillwater, New Jersey, to Palmer, Alaska",
        "Category": " Social Science , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Freedom of Simplicity",
        "Authors": "By Foster, Richard J.",
        "Description": "Shows how Christians can make their lives models of simplicity and avoid dishonesty, status seeking, extravagance, and a loss of values",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Get Clark Smart",
        "Authors": "By Howard, Clark and Meltzer, Mark",
        "Description": "Clark Howard answers all these questions and many more in Get Clark Smart. With practical tips and on-line resources, Howard helps readers to get rich by saving money in unexpected places and investing those savings creatively. Howard has a passion for saving money and a zealots enthusiasm for sharing everything hes learned. His strategies for getting rich by saving wisely will turn readers into financial wizards.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "James Galway's Music in Time",
        "Authors": "By Mann, William",
        "Description": "A fascinating historical journey through the world of music, based on a sixteen-part television series hosted by the world-famous flutist, traces the development of music from its origins to the present",
        "Category": " Music , General",
        "Publisher": "Harry N Abrams Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "The Big Bang",
        "Authors": "By Silk, Joseph",
        "Description": "",
        "Category": "",
        "Publisher": "W H Freeman & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "California Seafood Cookbook - Cook's Guide To The Fish And Shellfish Of California, The Pacific Coast And Beyond",
        "Authors": "By Harlow, Jay, Johnson, Paul, and Cronin, Isaac",
        "Description": "",
        "Category": "",
        "Publisher": "Aris Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Learning through encounter (Experiential education in the church)",
        "Authors": "By Dow, Robert Arthur",
        "Description": "",
        "Category": "",
        "Publisher": "Judson Press",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The Linen Closet: How to Care for Your Fine Linens and Lace",
        "Authors": "By Clise, Michele Durkson",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Hanukkah Lights",
        "Authors": "By Smith, Dian G. and Kitchel, Joann (ILT)",
        "Description": "On this night, let us light five little candle fires. Dreidels spin, hope I win; five little candle fires. With this beautifully illustrated book, even the youngest child can take part in the celebration of Hanukkah. Each night, children count the shiny holographic foil flames on the family menorah as they follow the engaging text, based on a traditional holiday song. Additional text included explains the story of the Maccabees and special Hanukkah customs, including latkes and the dreidel game. A perfect accompaniment to family celebrations.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Hanukkah",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Complete Guide to Java Database Programming with FDBC",
        "Authors": "By Siple, Matthew D. and North, Ken",
        "Description": "",
        "Category": " Computers , Programming Languages , General",
        "Publisher": "Computing McGraw-Hill",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "W D BK GIFTS MAKE",
        "Authors": "By Woman's Day (COR)",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1976"
        }
    },
    {
        "Title": "Bingo Night at the Fire Hall: Rediscovering Life in an American Village",
        "Authors": "By Holland, Barbara",
        "Description": "A humorous portrait of the author's life in the Virginia Blue Ridge Mountains details a small town where everyone gets along and her adventures there, which include finding shelter in a bar during a blizzard and writing obituaries for the local paper.",
        "Category": " History , United States , State & Local , General",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Mutt Mugs (and Posh Pups too)",
        "Authors": "By Karen Prince",
        "Description": "",
        "Category": "",
        "Publisher": "Hylas Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Lower Your Cholesterol in 30 Days",
        "Authors": "By Cheraskin, E., Orenstein, Neil S., and Miner, Paul L.",
        "Description": "Outlines an easy-to-follow diet plan for lowering blood-cholesterol levels and includes menus, shopping lists, and more than thirty recipes",
        "Category": " Health & Fitness , General",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Alive in the city: memoir of an ex-commissioner",
        "Authors": "By Heckscher, August",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Microeconomics",
        "Authors": "By Parkin, Michael",
        "Description": "",
        "Category": " Study Aids , Study Guides",
        "Publisher": "Addison-Wesley",
        "Price Starting With ($)": "15.03",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Macs for Dummies",
        "Authors": "By Pogue, David",
        "Description": "A light-hearted guide to using the Mac cuts through the techno-babble to present helpful and witty advice on files, folders, copying, trashing, backing up, and other essential Mac functions. Original.",
        "Category": "",
        "Publisher": "IDG Books Worldwide, Inc.",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Cooking for company",
        "Authors": "By Cheney, Winifred",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Flowers for All Seasons: A Guide to Colorful Trees, Shrubs and Vines",
        "Authors": "By Cox, Jeff and Cox, Marilyn",
        "Description": "Features landscaping tips, a month-to-month guide to flowering plants, and charts highlighting more than three hundred colorful plants",
        "Category": " Gardening , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Annuals",
        "Authors": "By Walheim, Lance",
        "Description": "Illustrates and offers information on over one hundred different annuals, with tips on planting, watering, fertilizing, and pest control",
        "Category": " Gardening , Flowers , Annuals",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Eisenhower at War 1943-1945",
        "Authors": "By Eisenhower, Dwight D.",
        "Description": "The first volume of a multi-volume study of President Eisenhower, this book focuses on Eisenhower's conduct of the war and provides an extensively documented analysis of the political ramifications of the course of the war and Eisenhower's decisions",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "The Eagle and the Rose: A Remarkable True Story",
        "Authors": "By Altea, Rosemary",
        "Description": "The story of a gifted medium describes Rosemary Altea's ten experiences with the afterlife and introduces her spirit familiar, a Native American ghost who taught her how to heal, astral-travel, and perform soul rescues. BOMC & QPB Alt. Tour.",
        "Category": " Body, Mind & Spirit , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Where's My Teddy?",
        "Authors": "By Alborough, Jez and Alborough, Jez (ILT)",
        "Description": "Yikes!  Eddie's in for the surprise of his life when he discovers that his teddy bear has grown much too big to cuddle!  But there's fun in store when Eddie meets up with a real bear who's got just the opposite problem—his lost teddy bear has shrunk to a size that's much too small for such an enormous bear to cuddle.  Could it be a case of mistaken identity?  This fast-paced comedy of errors, illustrated with Jez Alborough's quirky artwork, is guaranteed to have children—and bears alike—reaching for their teddies!",
        "Category": " Juvenile Fiction , Toys, Dolls & Puppets",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Training the Body to Cure Itself: How to Use Exercise to Heal",
        "Authors": "By Prevention Magazine Health Books (COR) and Feinstein, Alice (EDT)",
        "Description": "The authors of The Doctors Book of Home Remedies show how to use exercise to heal back pain, arthritis, bursitis, stress, headaches, and more serious ailments, such as heart disease, cancer, and diabetes.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Rodale Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "West Point Fitness and Diet Book",
        "Authors": "By Cohen, Martin and Anderson, James Lee",
        "Description": "A personal conditioning program adapted from the Military Academy's famous fitness methods, provides chronologically arranged exercise programs for all ages, a weight-control plan, and special exercises",
        "Category": " Medical , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1978"
        }
    },
    {
        "Title": "How to Avoid Falling: A Guide for Active Aging and Independence",
        "Authors": "By Fredrikson, Eric",
        "Description": "Staying active without fear of falling.    The danger of falling increases substantially with age. This is especially true in developed countries where aging populations tend toward comfortable, inactive lifestyles.     How to Avoid Falling is a practical, non-technical guide to minimizing the occurrence of falls as well as their devastating effects.    The book recommends taking stock of one's current level of health, physical abilities, ongoing medical concerns and current medication. It covers the risk factors of falling, how to alleviate them, as well as some general practices for living a healthy life.     Exercise is key, especially walking every day. There are fitness and balance exercises that will improve health and a sense of well-being.     Fall-proofing a home is also covered, as is being aware of the best way to            respond to hazardous situations such as icy or slippery conditions.    A final section describes what to do after a fall starting with how to safely get up again, regaining confidence, as well as how to choose canes and walkers.",
        "Category": " Medical , Geriatrics",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Modern Paint Effects: A Guide to Contemporary Paint Finishes from Inspiration to Technique",
        "Authors": "By Sloan, Annie",
        "Description": "Modern Paint Effects is a colorful exploration of the newest paint products and how to use them to achieve exciting effects in the home.     Illustrated with dozens of specially commissioned full color photographs, Modern Paint Effects is materials-based and technique-oriented and opens with a detailed examination of the newest materials:Pearlized Paint;  Matte Paint;  Glossy Glaze Paint;  Metallic Paint;  Sparkly Paint;  Graphite Paint;  Mid-sheen Paint;  Marmorino.    Annie Sloan then demonstrates various decorative techniques using the new paint products, suggesting innovative applications and dynamic color combinations including:Colorwashing;  Sparkle paint;  Combing;  Sponge rollers;  Dragging;  Spotted stone;  Glazing checks;  Stamping;  Hand-painted stripes;  Stencilling and reverse stencilling;  High gloss paints;  Incising;  Stippling;  Masking;  Using a            long-pile roller;  Matte paints;  Using crackle medium;  Rubbing back;  Using pattern and (distressing) texture;  Semi gloss paintsand many more.    A glossary and a list of suppliers of these new products round out this excellent and inspirational decorating resource.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Sports Bloopers: All-star Flubs and Fumbles",
        "Authors": "By Wilson, Brad and Huebner, Mark",
        "Description": "Professional athletes at their worst.    Athletes are highly trained individuals whose superior conditioning, reflexes, and talents allow them to run, throw, skate, catch, aim, jump, and perform better than anyone else. That's why we enjoy the brief, fleeting moments when they perform more like mortal creatures.    Sports Bloopers is a collection of over 150 photographs that capture athletes in the most outrageous blunders, pratfalls, and slip-ups ever seen.    Highly recognizable athletes such as Derek Jeter and Robin Ventura make an appearance in Sports Bloopers.    Everyone makes mistakes. But not everyone makes them in front of millions of viewers. Sports fans of all ages will enjoy the antics and unexpected moments caught forever by some of the world's best sports photographers.    Almost every            professional and amateur sport is represented here including football, basketball, hockey, track and field, baseball, golf, auto racing, and soccer.",
        "Category": " Sports & Recreation , General",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Johns Hopkins Symptoms and Remedies: The Complete Home Medical Reference",
        "Authors": "By Margolis, Simeon (EDT)",
        "Description": "A comprehensive home medical reference describes a variety of both general and specific symptoms, ranging from back pain to heart disease, along with helpful guidelines on prevention, the latest therapeutic treatments, and effective medications. 12,500 first printing.",
        "Category": "",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "8.14",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "The Graywolf Annual Five: Multi-Cultural Literacy",
        "Authors": "By Walker, Scott and Rick, Simonsen (EDT)",
        "Description": "The issue of cultural literacy has been the subject of intense debate in the past two years. Several bestselling books about the deficiencies of our educational system as well as changes in basic curriculum at more than one major university have contributed to the fervor of this debate.Fueling the national controversy is the question of what body of knowledge constitutes cultural literacy. While many argue for a return to a \"back to basics\" curriculum, equally energetic voices call for a revised curriculum, one which embraces both traditional western classics and the classics of non-European cultures, among them African, Asian, and Latin American.This volume brings together thirteen essays which suggest the range of knowledge truly literate individuals need to possess. Essays by such writers as James Baldwin, Carlos Fuentes, Michelle Cliff, Paula Gunn Allen, Ishmael Reed, and Wendell Berry enlarge our perspective to include a variety of voices and heritages which contribute to the vibrant culture of the United States.Also included is a beginning list of names, places, dates, and concepts which are part and parcel of a multi-cultural fabric.",
        "Category": " Literary Collections , Essays",
        "Publisher": "Graywolf Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "The 25-Year War: America's Military Role in Vietnam (Children's Library)",
        "Authors": "By Palmer, Bruce",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    }
]