[
    {
        "Title": "The Heritage of British Literature",
        "Authors": "By Bowen, Elizabeth",
        "Description": "Provides a critical analysis of the history of British writing in the fields of drama, poetry, fiction, and diaries",
        "Category": "",
        "Publisher": "Thames & Hudson",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1986"
        }
    },
    {
        "Title": "Creating Sanctuary: A New Approach to Gardening in the Washington Metropolitan Area",
        "Authors": "By Mitchell, Sherry",
        "Description": "",
        "Category": " Gardening , Landscape",
        "Publisher": "Epm Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Spain (Culture Shock! A Survival Guide to Customs & Etiquette)",
        "Authors": "By Graff, Marie Louise",
        "Description": "Whether you travel for business, pleasure, or a combination of the two, the ever-popular \"Culture Shock!\" series belongs in your backpack or briefcase. Get the nuts-and-bolts information you need to survive and thrive wherever you go. \"Culture Shock!\" country guides are easy-to-read, accurate, and entertaining crash courses in local customs and etiquette. \"Culture Shock!\" practical guides offer the inside information you need whether you're a student, a parent, a globetrotter, or a working traveler. \"Culture Shock!\" at your Door guides equip you for daily life in some of the world's most cosmopolitan cities. And \"Culture Shock!\" Success Secrets guides offer relevant, practical information with the real-life insights and cultural know-how that can make the difference between business success and failure.Each \"Culture Shock!\" title is written by someone who's lived and worked in the country, and each book is packed with practical, accurate, and enjoyable information to help you find your way and feel at home.",
        "Category": " Travel , Europe , Spain & Portugal",
        "Publisher": "Graphic Arts Center Publishing Company",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Metropolitan Museum of Art: The Cloisters; the Building and the Collection of Medieval Art in Fort Tryon Park",
        "Authors": "By James Joseph Rorimer",
        "Description": "",
        "Category": "",
        "Publisher": "The Metropolitan Museum of Art",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1951"
        }
    },
    {
        "Title": "Second Treatise of Government",
        "Authors": "By John Locke",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1952"
        }
    },
    {
        "Title": "Worldwide Wonders",
        "Authors": "By Harris, Tina",
        "Description": "",
        "Category": "",
        "Publisher": "Education Insights",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Essential History of Art",
        "Authors": "By Editor",
        "Description": "",
        "Category": "",
        "Publisher": "Dempsey",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Where to Find It in the Bible: The Ultimate A to Z Resource",
        "Authors": "By Ken Anderson",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The German Panzers, from Mark I to Mark V \"Panther\" - Armor Series 2",
        "Authors": "By Feist, Uwe",
        "Description": "",
        "Category": "",
        "Publisher": "Aero Publishers",
        "Price Starting With ($)": "26.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "What Makes a Goya a Goya?",
        "Authors": "By Muhlberger, Richard",
        "Description": "Takes a close-up look at key paintings by Francisco Goya, analyzing composition, line, color, subject matter, and the world in which he lived to define the characteristics of his work",
        "Category": " Young Adult Nonfiction , Art , General",
        "Publisher": "Viking Juvenile",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "How to Be Your Dog's Best Friend: A Training Manual for Dog Owners",
        "Authors": "By Monks, New Skete",
        "Description": "",
        "Category": "",
        "Publisher": "Little Brown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "When All Hell Breaks Loose",
        "Authors": "By Spencer, Camika",
        "Description": "It's a Sunday morning, and while most people are thinking about getting the paper and breakfast, Gregory Alston has something other than eggs on his mind.  Today he's going to propose to Adrian Jenkins, his girlfriend of three years.  But when he actually does, all hell breaks loose and he gets a lot more than he bargained for.  His mother returns from France, where she's been living as a jazz singer since leaving her family in Texas nearly twenty years ago.  His Holy Roller sister, Shreese, complains that Adrian is too \"worldly\" for him, even though she herself is falling for the shady, charismatic pastor of her church.  And his boys-who run the gamut from player to buffoon-react to the news of his engagement with grief and disbelief. And if that's not enough, he's got Adrian, who has more skeletons in her closet than a haunted house.  What's a brother to do? When All Hell Breaks Loose is a debut novel about black twenty-somethings that is fast and funny.  It's also a peek into the minds of young black men.  Camika Spencer won't just have you laughing-she'll have you looking in the mirror to see if she's talking about you.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Gorgias (The Penguin Classics, L94)",
        "Authors": "By Plato and Hamilton, Walter",
        "Description": "Taking the form of a dialogue between Socrates, Gorgias, Polus and Callicles, the Gorgias debates crucial questions about the nature of government. While the aspiring politician Callicles propounds the view that might is right, and the rhetorician Gorgias argues that oratory and the power to persuade represent 'the greatest good', Socrates insists on the duty of politicians to consider the welfare of their citizens - a duty he believed had been dishonoured in the Athens of his time. The dialogue offers insights into how classical Athens was governed, as well as creating a theoretical framework that has been highly influential on subsequent political debate.",
        "Category": " Philosophy , General",
        "Publisher": "Viking Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1971"
        }
    },
    {
        "Title": "Quiet Times for Couples",
        "Authors": "By Wright, H. Norman",
        "Description": "Offers spiritual inspiration for couples to help them cope with the demands of daily life",
        "Category": " Religion , Devotional",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Herds of Thunder, Manes of Gold",
        "Authors": "By Coville, Bruce",
        "Description": "A collection of seventeen stories, poems, and excerpts from books about horses, by well-known authors over several centuries.A collection of seventeen stories, poems and excerpts from books about horses by well-known authors over several centuries",
        "Category": "",
        "Publisher": "Doubleday Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Transitions: Making Sense of Life's Changes",
        "Authors": "By Bridges, William",
        "Description": "Whether switching jobs or moving house, leaving school or retiring, change brings both opportunities and turmoil. Most of us struggle through such periods. This classic book shows how making a successful transition lets you recognize and seize new opportunities. Transitions has helped hundreds of thousands of readers to cope with changes by providing a road map of the transition process. With the understanding born of experience, William Bridges takes us step by step through the three stages of transition:Endings. Recognize endings as opportunities as well as losses, and even celebrate them with rituals designed to open new doors.The Neutral Zone. In this seemingly unproductive ?time-out,' we feel disconnected from the past and emotionally unconnected to the present. The most frightening stage of transition, the Neutral Zone is really an important time for reorientation.The New Beginning. A successful transition requires more than persevering: it means launching new priorities. Understand the external and internal signs that point the way to your future.",
        "Category": " Psychology , Developmental , Lifespan Development",
        "Publisher": "Da Capo Lifelong Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Beginner's Guide to Golf",
        "Authors": "By Lumb, Nick",
        "Description": "A practical introduction to the principles and techniques of golf that demonstrates the correct aim, grip, stance, body alignment, posture and swing for any situation, identifies common problems, and provides a concise survey of equipment",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "I am the fox,",
        "Authors": "By Winifred Van Etten",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "146.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1936"
        }
    },
    {
        "Title": "Secretaries of war and secretaries of the army: Portraits & biographical sketches (CMH pub)",
        "Authors": "By Bell, William Gardner",
        "Description": "",
        "Category": "",
        "Publisher": "For sale by the U.S. G.P.O., Supt. of Docs",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "A Contest of Faiths: Missionary Women and Pluralism in the America Southwest",
        "Authors": "By Yohn, Susan M.",
        "Description": "Susan M. Yohn here reconstructs the interactions between Presbyterian women missionaries in the southwest and the native Hispanic-Catholic people they set out to \"Americanize\" between 1867 and 1924. In the process, she reveals how many Protestant women reformers shared a series of experiences that contributed to a national dialogue about cultural pluralism.",
        "Category": " Religion , General",
        "Publisher": "Cornell University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The Single Parent's Money Guide",
        "Authors": "By Card, Emily and Kelly, Christie Watts",
        "Description": "Whether you're a single parent by choice or because of unexpected family circumstances, you may not be prepared for the many legal and financial responsibilities you must confront. This book will help you manage one of the hardest jobs in the world. Using her own experiences as a single parent as well as her professional skills as a lawyer, Emily Card will help you better manage your family's financial life. With useful quizzes, checklists, and advice boxes for you and your children, this book will show you how to negotiate alimony and child support, save money on household expenses, cope with emergencies such as job loss or medical catastrophe, find out what insurance coverage you need for your family, involve your children in setting financial goals, name a guardian for your children and write a will.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "F2f",
        "Authors": "By Finch, Phillip",
        "Description": "The Verba Interchange is an electronic bulletin board, a virtual meeting place where anyone with a computer and a modem can exchange views, flirt, or argue with complete anonymity. But an ingenious serial killer is using the vast potential of the Net to choose victims for a deadly f2f - a face-to-face meeting.",
        "Category": " Fiction , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Freud's Wishful Dream Book",
        "Authors": "By Welsh, Alexander",
        "Description": "Although it is customary to credit Freud's self-analysis, it may be more accurate, Alexander Welsh argues, to say that psychoanalysis began when The Interpretation of Dreams was published in the last weeks of the nineteenth century. Only by going public with his theory--that dreams manifest hidden wishes--did Freud establish a position to defend and embark upon a career. That position and career have been among the most influential in this century. In August 1899, Freud wrote to Wilhelm Fliess of the dream book in terms reminiscent of Dante's Inferno. Beginning from a dark wood, this modern journey features \"a concealed pass though which I lead the reader--my specimen dream with its peculiarities, details, indiscretions, bad jokes--and then suddenly the high ground and the view and the question, Which way do you wish to go now?\" Physician that he is, Freud appoints himself guide rather than hero, yet the way \"you\" wish to go is very much his prescribed way. In Welsh's book, readers are invited on Freud's journey, to pause at each concealed pass in his seminal work and ask where the guide is taking them and why. Along the way, Welsh shows how Freud's arbitrary turnings are themselves wishful, intended to persuade by pleasing the reader and author alike; that his interest in secrets and his self-proclaimed modest ambition are products of their time; and that the book may best be read as a romance or serial comedy. \"Some of the humor throughout,\" Welsh notes, \"can only be understood as a particular kind of fine performance.\" Welsh offers the first critical overview of the argument in Freud's masterpiece and of the author who presents himself as guide.",
        "Category": " Literary Collections , American , General",
        "Publisher": "Princeton University Press",
        "Price Starting With ($)": "18.0",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Ingenious Inventions of Domestic Utility",
        "Authors": "By Bragdon, Allen D.",
        "Description": "Shows examples of antique American household utensils, describes their function, and looks at nineteenth century home life",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1989"
        }
    },
    {
        "Title": "Complete Idiot's Guide to Parenting Your Teenager (The Complete Idiot's Guide)",
        "Authors": "By Kelly, Kate",
        "Description": "The Complete Idiot's Guide to Parenting a Teenager teaches you how to navigate adolescence successfully with your teen. Feel confident about knowing when to lay down the law, when to bend the rules, and when to let go. In this Complete Idiot's Guide you'll find solid information on becoming an effective and respected parent; friendly advice in an easy-to-understand format; tips, definitions, and warnings to help you along the way; and clear illustrations that show you exactly what to do!",
        "Category": " Social Science , Sociology , Marriage & Family",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Antiques Care & Repair Handbook",
        "Authors": "By Jackson, Albert and Day, David",
        "Description": "Eight hundred photographs and drawings complement authoritative, informative guidelines to the maintenance and repair of practically every kind of old or valuable object, from books to pottery and textiles",
        "Category": " Antiques & Collectibles , Care & Restoration",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "Great Pyramid: Its Secrets & Mysteries Revealed",
        "Authors": "By Smyth, Charles Piazzi",
        "Description": "Intriguing look into the architecture and construction of the Great Pyramid at Giza.  Full of details, dimensions, and amazing insights into its occult meanings and mysteries.  Facsimile of a beautiful, rare 1880 volume.  Over 40 black and white illustrations.  702 pages.",
        "Category": " History , World",
        "Publisher": "Bell Publishing Co.",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "Holy War Inc. Inside the Secret World of Osama Bin Laden",
        "Authors": "By Bergen, Peter L.",
        "Description": "On September 11, 2001, the world in which we live was changed forever. The twin towers of the World Trade Center came crashing down, one side of the Pentagon burst into flame, and more than six thousand men, women, and children lost their lives in the most deadly terrorist attack on American soil. As shocking as it was, it had been long in the making: The assault was the most sophisticated and horrifying in a series of operations masterminded by Osama bin Laden and his Jihad group -- an organization that CNN's terrorism analyst Peter Bergen calls Holy War, Inc.  One of only a handful of Western journalists to have interviewed the world's most wanted man face to face, Peter Bergen has produced the definitive book on the Jihadist network that operates globally and in secrecy. In the course of four years of investigative reporting, he has interviewed scores of insiders -- from bin Laden associates and family members to Taliban leaders to CIA officials -- and traveled to Afghanistan, Yemen, Egypt, Pakistan, and the United Kingdom to learn the truth about bin Laden's al Queda organization and his mission.  Immense in scope and unnerving in its findings, Holy War, Inc. reveals:   How bin Laden lives, travels, and communicates with his \"cells.\" How his role in the crushing defeat of the Soviet Union in Afghanistan made him a hero to Muslims all over the world -- and equipped him to endure a long and bloody siege. How the CIA ended up funding -- to the tune of three billion dollars -- radical, anti-American Afghan groups allied to bin Laden. How the attacks that foreshadowed the destruction of the World Trade Center -- among them the bombings of the American embassies in Africa and the warship USS Cole in Yemen -- were planned and executed. The dimensions of bin Laden's personal fortune, and why freezing his assets is both futile and nearly impossible. The ideology of bin Laden's number two, the man who has influenced him most profoundly in his holy war -- the Egyptian Ayman al Zawahiri. What we can expect from Islamist extremists in the future.   Above all, Peter Bergen helps us to see bin Laden's organization in a radically new light: as a veritable corporation that has exploited twenty-first-century communications and weapons technologies in the service of a medieval reading of the Koran and holy war. Holy War, Inc. is essential reading for anyone trying to understand tomorrow's terrorist threats and the militant Islamist movements that could determine the fate of governments -- and human lives -- the world over.  Both author and publisher will donate a portion of the proceeds from this book to United Way's September 11th Fund for the relief of victims of the World Trade Center attacks.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Flavor",
        "Authors": "By DiSpirito, Rocco, Leutwyler, Henry, and Sherer, Kris",
        "Description": "\"Knockout dining\" leaves fans breathless at this Gramercy New American \"paragon\" where \"rock star\" chef Rocco DiSpirito produces \"sublime,\" \"synergistic\" dishes. --Zagat, on Rocco DiSpirito's restaurant Union Pacific He runs one of the most successful restaurants in New York City. He is seen everywhere from David Letterman toGood Morning America to the Food Network. He has graced the cover of Gourmet magazine as \"America's Most Exciting Young Chef\"--and Zagat calls him a \"rock star.\" Now, Rocco DiSpirito unleashes his culinary magic withFlavor. In Flavor, DiSpirito shows readers how to create bold, intriguingly delicious food through combinations of ingredients both mundane and exotic. The cuisine is sophisticated but surprisingly easy for home chefs to replicate. Using the four flavors (sour, sweet, bitter, and salty) as basic building blocks, Rocco demonstrates how to combine and commingle flavors to create one-of-a-kind dishes. Some recipes included inFlavor are:Lemongrass Lobster Salad Baby Lettuces with Pickled Squash Blossoms and Yogurt-Tahini Vinaigrette Calamari with Coconut Curry and Green Papaya Braised Veal Roulade with Root Vegetables Cinnamon Glazed Duck Lavender Creme Brulee Peach-Phyllo Strudel with Goat Cheese Cream and much more",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "7.45",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Cinderella Cinderella Mini Book: Mini version (Fay's Fairy Tales)",
        "Authors": "By Wegman, William, Kismaric, Carole, and Heiferman, Marvin",
        "Description": "In her haste to flee the palace before her fairy godmother's magic loses effect, Cinderella leaves behind a glass slipper, in a retelling of the story that features dogs portraying the main characters",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Hyperion Books For Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "After the Boxes Are Unpacked",
        "Authors": "By Miller, Susan",
        "Description": "More than 40 million Americans move each year, and studies show it can be one of the heaviest strains on a marriage. For women especially, relocating can be a traumatic event. With true stories, ingenious insights, and helpful hints, this great book makes transitioning smoother so women can get on with their lives. Those who are moving will find this valuable book as important as packing tape.",
        "Category": " Religion , Christian Living , Women's Interests",
        "Publisher": "Focus on the Family",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "The Big Book of Gardening Skills",
        "Authors": "By Gardenway Book (EDT)",
        "Description": "Experienced masters give their tips and techniques on garden basics, flowers and vegetables, pest and disease control, attracting birds and butterflies, and equipment",
        "Category": " Gardening , Reference",
        "Publisher": "Garden Way Pub Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Eakins",
        "Authors": "By Schendler, Sylvan",
        "Description": "",
        "Category": "",
        "Publisher": "Little Brown",
        "Price Starting With ($)": "6.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Race relations (Prentice-Hall sociology series)",
        "Authors": "By Kitano, Harry H. L.",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "The Washington ethnic food store guide",
        "Authors": "By Lawson, Jim C",
        "Description": "",
        "Category": "",
        "Publisher": "Ardmore Publications",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Reflections in a Glass Eye: Works from the International Center of Photography Collection",
        "Authors": "By International Center of Photography (PHT), Hollander, Anne (EDT), Handy, Ellen (EDT), and Handy, Ellen",
        "Description": "A stunning celebration of the artistry and diversity of the photographic medium showcases the talents of Margaret Bourke-White, Richard Avedon, Henri Cartier-Bresson, Irving Penn, Cindy Sherman, and other remarkable photographers. 12,500 first printing.",
        "Category": " Photography , General",
        "Publisher": "Bulfinch Pr",
        "Price Starting With ($)": "8.08",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Getting Started in Powerboating",
        "Authors": "By Armstrong, Bob",
        "Description": "Get the most from your new powerboat from day one!There’s nothing like the thrill of skimming over the waves at the helm of a fast powerboat. And the thrill is even greater when you’re driving the boat that’s right for you and handling it with skill and confidence. This third edition of Getting Started in Powerboating gives you all the information you need to select the boat of your dreams, maneuver it like a master, and understand the rules and conventions of powerboating.Thoroughly updated with new developments and technologies, this new edition of the bestselling guide in its field covers all powerboats—big and small; single-engine, twin-engine, outboard, and sterndrive; trailerable and nontrailerable. You’ll discover the difference between a planing hull and a displacement hull, learn to compensate for the effects of wind and current, and master high-speed techniques. Plus this third edition features new photographs that illustrate key techniques and maneuvering sequences, including turning, backing, docking, and more. Must-have information includes:The latest on four-stroke outboardsJack plates, jet drives, and bow thrusters Piloting and navigation basics Anchors and anchoring techniquesAn updated market survey of popular powerboats State licensing requirements",
        "Category": " Sports & Recreation , Boating",
        "Publisher": "International Marine/Ragged Mountain Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Worth the Fighting For: A Memoir",
        "Authors": "By McCain, John and Salter, Mark",
        "Description": "In 1999, John McCain wrote one of the most acclaimed and bestselling memoirs of the decade, Faith of My Fathers. That book ended in 1972, with McCain’s release from imprisonment in Vietnam. This is the rest of his story, about his great American journey from the U.S. Navy to his electrifying run for the presidency, interwoven with heartfelt portraits of the mavericks who have inspired him through the years—Ted Williams, Theodore Roosevelt, visionary aviation proponent Billy Mitchell, Marlon Brando in Viva Zapata!, and, most indelibly, Robert Jordan. It was Jordan, Hemingway’s protagonist in For Whom the Bell Tolls, who showed McCain the ideals of heroism and sacrifice, stoicism and redemption, and why certain causes, despite the costs, are . . .Worth the Fighting ForAfter five and a half years as a prisoner of war in Vietnam, naval aviator John McCain returned home a changed man. Regaining his health and flight-eligibility status, he resumed his military career, commanding carrier pilots and serving as the navy’s liaison to what is sometimes ironically called the world’s most exclusive club, the United States Senate. Accompanying Senators John Tower and Henry “Scoop” Jackson on international trips, McCain began his political education in the company of two masters, leaders whose standards he would strive to maintain upon his election to the U.S. Congress. There, he learned valuable lessons in cooperation from a good-humored congressman from the other party, Morris Udall. In 1986, McCain was elected to the U.S. Senate, inheriting the seat of another role model, Barry Goldwater.During his time in public office, McCain has seen acts of principle and acts of craven self-interest. He describes both ex-tremes in these pages, with his characteristic straight talk and humor. He writes honestly of the lowest point in his career, the Keating Five savings and loan debacle, as well as his triumphant moments—his return to Vietnam and his efforts to normalize relations between the U.S. and Vietnamese governments; his fight for campaign finance reform; and his galvanizing bid for the presidency in 2000.Writes McCain: “A rebel without a cause is just a punk. Whatever you’re called—rebel, unorthodox, nonconformist, radical—it’s all self-indulgence without a good cause to give your life meaning.” This is the story of McCain’s causes, the people who made him do it, and the meaning he found. Worth the Fighting For reminds us of what’s best in America, and in ourselves.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Red Dragon Rising: Communist China's Military Threat to America",
        "Authors": "By Timperlake, Edward and Triplett, William C., II",
        "Description": "Timperlake, a former Marine fighter pilot and Triplett, a former Republican counsel to the Senate Foreign Relations Committee, characterize the Chinese government as a brutal, expansionist regime that has targeted America and its democratic allies with the most modern weapons of mass destruction. They also mention, in this election year, that the Clinton-Gore administration helped the Communists achieve their military ambitions and received campaign contributions from them. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "All the Way Home",
        "Authors": "By Giff, Patricia Reilly",
        "Description": "It’s August 1941, and Brick and Mariel both love the Brooklyn Dodgers. Brick listens to their games on the radio in Windy Hill, in upstate New York, where his family has an apple orchard; Mariel, once a polio patient in the hospital in Windy Hill, lives in Brooklyn near the Dodgers’ home, Ebbets Field. She was adopted by Loretta, a nurse at the hospital, and has never known what happened to her own mother. Someday, somehow, she plans to return to Windy Hill and find out. When a fire destroys their orchard, Brick’s parents must leave the farm to find work. They send him to live in Brooklyn with their friend Loretta, even though Brick knows that their elderly neighbors need his help to pick what’s left of the apples. The only good thing about Brooklyn is seeing the Dodgers play–that, and his friendship with Mariel. Maybe, together, they’ll find a way to return to Windy Hill, save the harvest, and learn the truth about Mariel’s past.",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Totline 123 Rhymes Stories & Songs ~ Open-Ended Language (1-2-3 Series) Ages 3-6",
        "Authors": "By Warren, Jean",
        "Description": "",
        "Category": "",
        "Publisher": "Warren Publishing House, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Pineapples, Penguins and Pagodas (Kids' Stuff)",
        "Authors": "By Keeling, Jan (EDT) and Jinkins, Barbara",
        "Description": "",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Incentive Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Book of Ch'I: Harnessing the Healing Forces of Energy",
        "Authors": "By Wildish, Paul",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Tuttle Pub",
        "Price Starting With ($)": "13.98",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Being Little in Cambridge When Everyone Else Was Big",
        "Authors": "By Abbott, Eleanor Hallowell",
        "Description": "",
        "Category": "",
        "Publisher": "D. Appleton-Century company, incorporated",
        "Price Starting With ($)": "29.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1936"
        }
    },
    {
        "Title": "The Hero Within",
        "Authors": "By Pearson, Carol S.",
        "Description": "A modern classic of Jungian psychology, The Hero Within has helped hundreds of thousands of people enrich their lives by revealing how to tap the power of the archetypes that exist within. Drawing from literature, anthropology, and psychology, author Carol S. Pearson clearly defines six heroic archetypes—the Innocent, the Orphan, the Wanderer, the Warrior, the Altruist, and the Magician—and shows how we can use these powerful guides to discover our own hidden gifts, solve difficult problems, and transform our lives with rich sources of inner strength.This book will speak deeply to the evolving hero in all of us and reverberate through every part of our lives. With poignant wisdom and prolific examples, it gives us enduring tools to help us develop our own innate heroic gifts—the Orphan's resilience, the Wanderer's independence, the Warrior's courage, the Altruist's compassion, the Innocent's faith, and the Magician's abiding power.",
        "Category": "",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "Western",
        "Authors": "By Yerby, Frank",
        "Description": "Harvard-educated Massachusetts Yankee Ethan Lovejoy, haunted by the brother he killed in the Civil War, travels west to Kansas, marries Anne Jeffreys along the way, and builds one of the Great Plains's largest homesteads",
        "Category": " Fiction , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "August",
            "Year": "1982"
        }
    },
    {
        "Title": "Numbers (Wipe-Off Activity Books)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Learning Horizons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Baroque Painting (Barron's Art Handbooks: Yellow Series)",
        "Authors": "By Parramon's Editorial Team (COR)",
        "Description": "",
        "Category": " Art , History , General",
        "Publisher": "Barron's Educational Series, inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "More Ghosts of Gettysburg: Spirits, Apparitions and Haunted Places of the Battlefield",
        "Authors": "By Nesbitt, Mark V.",
        "Description": "",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Thomas Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Pierre Franey's Cooking In America",
        "Authors": "By Franey, Pierre, Jarrett, Lauren (ILT), and Flaste, Richard",
        "Description": "A companion to the popular PBS series presents a culinary tour of America, featuring two hundred recipes for favorite American dishes from across the country. Reprint. TV tie-in. 25,000 first printing. Tour.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Greek Art (New Revised Edition)",
        "Authors": "By Boardman, John",
        "Description": "Explores the history and significance of the art and architecture of Classical Greece",
        "Category": "",
        "Publisher": "Thames & Hudson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "Utopia (Crofts Classics)",
        "Authors": "By More, Thomas, Sir, Saint and Ogden, H. V. S. (EDT)",
        "Description": "",
        "Category": " History , United States , General",
        "Publisher": "Appleton-Century-Crofts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Bias: A CBS Insider Exposes How the Media Distort the News",
        "Authors": "By Goldberg, Bernard",
        "Description": "In his nearly thirty years at CBS News, Emmy Award winner Bernard Goldberg earned a reputation as one of the preeminent reporters in the television news business. When he looked at his own industry, however, he saw that the media far too often ignored their primary mission: to provide objective, disinterested reporting. Again and again he saw that the news slanted to the left. For years, Goldberg appealed to reporters, producers, and network executives for more balanced reporting, but no one listened. The liberal bias continued.Now, breaking ranks and naming names, he reveals a corporate news culture in which the closed-mindedness is breathtaking and in which entertainment wins over hard news every time.",
        "Category": " Performing Arts , Business Aspects",
        "Publisher": "Regnery Publishing, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Plain and Simple: A Woman's Journey to the Amish",
        "Authors": "By Bender, Sue",
        "Description": "Twenty years ago, while walking through a men's clothing store in\" Sag Harbor, New York, Sue Bender found herself drawn to an array of old Amish quilts that served as a background to a display of tweeds. She was immediately struck by their deep, saturated colors, the geometric simplicity of their design, and their quiet power. \"They spoke directly to me,\" she writes. \"They knew something.They went straight to my heart.\" That was the beginning of her \"journey of the spirit.\"Plain and Simple, illustrated with the author's own drawings, is the gentle, eloquent story of that journey. Bender, a wife, a mother, and a dedicated artist from Berkeley, California, sought out Amish families that would allow her-one of the outsiders the Amish call the \"English\"-- to visit and share in their daily fives.In language as spare and vivid as Amish art, Bender recounts her venture into an entirely different world, the seemingly timeless world of the Amish, a landscape of immense inner quiet. With an inquiring eye, she describes the months she spent in Iowa and Ohio with two Amish families. She illuminates the everyday rhythms of their world and conveys the life of the people who taught her about simplicity, commitment, and the joy of doing what you do well.In nine chapters, as interrelated and well-crafted as a classic nine-patch Amish quilt, Bender speaks to the seeker in us all and reveals how she was drawn to -- and changed by -- the Amish values of austerity, humility, and the ordinary. \"How\" they live reflects what they believe\" she writes. \"Their life is their art!\"After living and working with these people whose values were so unlike her own, Bender was able to return home and rework her \"crazy quilt\" life into a new pattern. \"I thought I was going to learn more about their quilts,\" she writes, \"but the quilts were only guides, leading me to what I really needed to learn, to answer a question I hadn't yet formed: \"Is there another way to lead a good life?\"",
        "Category": " Religion , Christianity , Amish",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Twentieth-century art from the Nelson Aldrich Rockefeller collection",
        "Authors": "By LIEBERMAN, Nelson A",
        "Description": "",
        "Category": "",
        "Publisher": "Museum of Modern Art, NY",
        "Price Starting With ($)": "49.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "7 Simple Steps to Unclutter Your Life",
        "Authors": "By Smallin, Donna",
        "Description": "For readers who yearn for more balance in their lives, hundreds of quick tips and ideas for enhancing physical, emotional, and spiritual well-being, and creating a simpler, more rewarding lifestyle. Donna Smallin guides the reader through seven simple steps toward achieving a life with less stress and more enjoyment. Practical and inspirational advice on managing time, money, work, health, and relationships.",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Storey Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Virginia trout streams: A guide to fishing the Blue Ridge watershed",
        "Authors": "By Slone, Harry",
        "Description": "",
        "Category": "",
        "Publisher": "Backcountry Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "How to Fool Fish With Feathers: The Incompleat Guide to Fly-Fishing",
        "Authors": "By MacNelly, Jeff and Margolis, Jon",
        "Description": "A humorous but informative introduction to fly fishing features tips on casting, suiting up, equipment, techniques, flies, and finding where the fish are",
        "Category": " Humor , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Tom Brown's Schooldays (Oxford World's Classics)",
        "Authors": "By Sanders, Andrew, Hughes, Arthur, and Hughes, Thomas",
        "Description": "One of the classics of English children's literature, and one of the earliest books written specifically for boys, this novel's steady popularity has given it an influence well beyond the upper middle-class world that it describes. It tells a story central to an understanding of Victorian life, but its freshness helps to distinguish it from the narrow schoolboy adventures that it later inspired. The book includes an introduction and notes by Andrew Sanders.",
        "Category": " Juvenile Fiction , Classics",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Metamorphoses (Oxford World's Classics)",
        "Authors": "By Ovid, Melville, A. D. (TRN), and Kenney, E. J. (INT)",
        "Description": "Metamorphoses--the best-known poem by one of the wittiest poets of classical antiquity--takes as its theme change and transformation, as illustrated by Greco-Roman myth and legend. Melville's new translation reproduces the grace and fluency of Ovid's style, and its modern idiom offers a fresh understanding of Ovid's unique and elusive vision of reality.",
        "Category": " Poetry , European , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Germinal (Oxford World's Classics)",
        "Authors": "By Zola, Emile, Collier, Peter (TRN), and Lethbridge, Robert (TRN)",
        "Description": "Zola's masterpiece of working life, Germinal (1885), exposes the inhuman conditions of miners in northern France in the 1860s. By Zola's death in 1902 it had come to symbolize the call for freedom from oppression so forcefully that the crowd which gathered at his State funeral chanted \"Germinal! Germinal!\"  While it is a dramatic novel of working life and everyday relationships, Germinal is also a complex novel of ideas, given fresh vigor and power in this new translation. It is also the thirteenth book in the Rougon-Macquart cycle, which celebrates its centenary in October 1993 with a new film version of Germinal starring Gerard Depardieu.",
        "Category": " Fiction , Classics",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "The California Coastal Resource Guide",
        "Authors": "By California Coastal Commission, Caughman, Madge, and Ginsberg, Joanne S.",
        "Description": "This comprehensive and authoritative guide to the natural and cultural resources of California's magnificent 1,100-mile coastline is the companion to the best-selling California Coastal Access Guide. Whereas the Access Guide stressed public access to the California coast, the Resource Guide focuses on the rich and varied natural resources of the coast and its diverse habitats, including detailed descriptions of flora and fauna; the Guide also features accounts of the history of the coast, and includes numerous striking and informative drawings, photographs, and maps.Part One consists of sections of statewide interest divided into three categories: the first is coastal geography, which includes descriptions of coastal mountains, rivers, marine terraces, beaches, wetlands, nearshore waters, and the open ocean; the second is living resources, covering the flora and fauna of the coast; and the third is cultural resources, treating history, architecture, recreation, and economy, including such topics as parks and beaches, recreational fishing, amusement parks, lighthouses, offshore oil, tourism, agriculture, and other coastal industries.Part Two is composed of individual sections on each of California's coastal counties, as well as San Francisco Bay, the Farallon Islands, and the Channel Islands. This portion of the book includes 150 maps, lists of species of interest, a summary of each county's history, and site-by-site descriptions of parks, beaches, rivers, wetlands, coastal towns and cities, missions, museums, and other coastal resources; detailed information on the habitats, wildlife, and history of each site are included, as well as its address, and, where applicable, the phone number.Copiously illustrated, accessible, and above all, entertaining, this book is an indispensable reference guide for residents and vacationers as well as a fun book to browse in for anyone interested in California's coast.",
        "Category": " Nature , Reference",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Tools and Gadgets (Historic Communities (Paperback))",
        "Authors": "By Kalman, Bobbie",
        "Description": "Describes the tools used by colonial farmers, millers, woodworkers, metalworkers, printers, and others",
        "Category": " Juvenile Nonfiction , Lifestyles , Farm & Ranch Life",
        "Publisher": "Crabtree Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Matilda",
        "Authors": "By Gallico, Paul",
        "Description": "",
        "Category": "",
        "Publisher": "Coward-McCann Inc.",
        "Price Starting With ($)": "16.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "The Ultimate Book Of Paint Effects",
        "Authors": "By Salli Brand, Jullie Collins, Catherine Cumming, Tricia Greening, Katrina Hall, Frances Halliday, Clare Louise Hunt, Joanna Jones, Lawrence Llewelyn Bo",
        "Description": "",
        "Category": "",
        "Publisher": "BAY BOOKS",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Where No One Has Gone Before: A History in Pictures (Star Trek)",
        "Authors": "By Dillard, J. M. and Dillar, J. M.",
        "Description": "Star Trek: \"Where no one has gone before\" covers the entire, incredible Star Trek story, from the original show's genesis to the aborted second television series in the late 1970s to Star Trek's resurgence in the movies and two hit television shows, and on into the future with a special preview of STAR TREK's latest incarnation: Star Trek: Voyager.This ultimate, deluxe collector's edition features personal accounts, anecdotes, and full-color photographs from the actors, fans, and backstage professionals who helped make the show so incredibly popular.The entertaining and informative text provides a behind-the-scenes glimpse of the world of STAR TREK and includes essays by the master of science fiction and science fact, the late Dr. Isaac Asimov. The photo selection is the result of an exhaustive search for the best in Star Trek photography. Many of the images are from private collections and have never before been published.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Superdog: Raising the Perfect Canine Companion",
        "Authors": "By Fox, Michael W.",
        "Description": "Discusses canine behavior, offers advice on training, feeding and health care, and identifies the advantages of pet ownership",
        "Category": " Pets , Dogs , General",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Football America: Celebrating Our National Passion",
        "Authors": "By Barber, Phil and Didinger, Ray",
        "Description": "Vivid black-and-white and full-color photographs accompany an entertaining celebration of America's most popular sport, capturing the joy of the game through the eyes of players of all ages, from every region of the United States. 75,000 first printing. $75,000 ad/promo. Tour.",
        "Category": " Sports & Recreation , Football",
        "Publisher": "Turner Pub",
        "Price Starting With ($)": "7.62",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "In Our Own Image: Building an Artificial Person",
        "Authors": "By Caudill, Maureen",
        "Description": "From Arnold Schwarzenegger's Terminator, to C-3PO of the Star Wars trilogy, to the comic robot-butler in Woody Allen's Sleeper, the \"android\" has long been a familiar figure on the American imaginative landscape. But how far removed from reality are such fictitious creations? Will there ever be an intelligent robot in our future? Neural networks expert Maureen Caudill says yes. In fact, she argues that the development of intelligent androids is a mere twenty years away.    In Our Own Image reveals just how far we've come in developing an intelligent robot, describes what technical obstacles must still be cleared, and--perhaps most interesting of all--outlines the potentially massive social disruptions and tangled moral and legal dilemmas these \"human machines\" will cause. In a sweeping look at state-of-the-art breakthroughs in artificial intelligence, robotics, computer science, psychology, and neural networks, Caudill shows how these fields have advanced machine vision, language recognition, problem solving, memory, and other requisites of intelligent robots. She describes foot-long mechanical ants that can follow you around a room, robots that can crack eggs, shear sheep, play ping-pong, tighten wing-nuts, and other feats of dexterity. (One robot, WABOT-2, developed in Japan, can read simple sheet music and played the electric organ with the NHK Symphony Orchestra of Japan.) electric organ.) And she concludes that as our ability to make faster, smaller, cheaper computers blends with our ability to mimic the behavior of the human mind, the first truly intelligent machines come closer to fruition. But once an android has been perfected, Caudill warns, there will likely be some unexpected--and perhaps unpleasant--social changes. Androids may compete with human workers for jobs--and robots won't take vacations, won't have family problems, and might never leave the firm. Androids may also entangle our legal system in complex, difficult questions: Can an individual own an intelligent android? What rights should it have in society? Does ownership of an android imply the right to turn it off--the right to \"kill\" it? And does such ownership brand us as slaveholders?    The existence of intelligent androids will provoke these and other questions. Caudill concludes that we will soon be forced to come up with answers if we are to learn to share the world with another intelligent species--one of our own creation.",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Death and Deconstruction",
        "Authors": "By Fleming, Anne",
        "Description": "John Charter is cajoled by his former wife Sophie into abandoning an Irish fishing trip to instead spend his vacation investigating a series of hoaxes on the Coleridge and Other Romantic Poets Society. The intrigue starts in Venice during a Byron-Shelley tour of Italy, continues in the London Library and the Royal Institution, and culminates in murder and mayhem during an academic conference at Norman Abbey. Charter's investigation uncovers the possibility of a copy of a long-lost Byron memoir. As his search continues, he is initiated into the mysteries of Deconstructionism, Marxist-Feminism, and political correctness - and the tensions (sometimes violent) they cause in academe.",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "1990 BEST-RECIPES YEARBOOK",
        "Authors": "By \"Better Homes and Gardens\"",
        "Description": "Collects a variety of recipes for appetizers, breads, chicken, soups, beef, pork, candies, cakes, and vegetables",
        "Category": "",
        "Publisher": "Meredith Publishing Co.",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "People of the High Plateau",
        "Authors": "By Berman, Carl",
        "Description": "",
        "Category": "",
        "Publisher": "Howell Press@inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "The Education of the Heart: Readings and Sources for Care of the Soul, Soul Mates, and The Re-Enchantment of Everyday Life",
        "Authors": "By Moore, Thomas (EDT)",
        "Description": "Don&#39;t you ever,   You up in the sky,   Don&#39;t you ever get tired   Of having the clouds between you and us?  -- Nootka Prayer   There are Sweets of Pathos, when Sweets of Mirth have passed away -- -- Emily Dickinson   With their themes of restoring the soul, cultivating humanity and living a more harmonious and spiritual existence, Thomas Moore&#39;s classic books have touched and comforted millions of people across the country, created a burgeoning interest in soul work and made Thomas Moore a household name. To date, these books have sold two and a half million copies, and continue to hit bestseller lists every week.   The Education of the Heart   gives readers access to the wellspring of wisdom that Moore drew on when creating these seminal works. Ideal for reading groups, the book includes a study guide that offers suggestions for discussion. Selected not only for their brilliance in describing the soul, but for the beauty and power of their language, the essays, poems, songs and passages included here make the book a truly rewarding reading experience. Arranged into chapters devoted to topics such as marriage and intimacy, common life, dwelling and home and life passages, these selections are taken from a rich variety of sources: from Greek tragedies and ancient magical texts; from the Renaissance philosophers such as Marsilio Ficino and Pico della Mirandola; and from modern archetypal psychologists such as C. G. Jung and James Hillman.  As Thomas Moore says in his introduction, \"Meditate on the book, read the passages aloud, write them down for future reference, tell them to friends, commit them to memory; These are all ways of educating the heart.\"",
        "Category": " Religion , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Legends: Conversations With Baseball Greats",
        "Authors": "By Rust, Art and Marley, Michael",
        "Description": "Gathers interviews with DiMaggio, Feller, Musial, Spahn, Ashburne, Mantle, Carew, Schmidt, Winfield, and Mattingly",
        "Category": " Biography & Autobiography , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "6.23",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Out to Canaan (Book 4 of the Mitford Years)",
        "Authors": "By Karon, Jan",
        "Description": "Get to know the lovable cast of characters that populate the small town of Mitford in this inspirational novel in Jan Karon's #1 New York Times bestselling series.Millions of readers have come home to Mitford, the little town with the big heart, whose endearing and eccentric residents have become like family members. But now change is coming to the hamlet. Father Tim, the Episcopal rector, and his wife, Cynthia, are pondering retirement; a brash new mayoral candidate is calling for aggressive development; a suspicious realtor with plans for a health spa is eyeing the beloved house on the hill; and, worst of all, the Sweet Stuff Bakery may be closing. Meanwhile, ordinary people are leading the extraordinary lives that hundreds of thousands of readers have found so inviting and inspiring.",
        "Category": " Fiction , Religious",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Management and Organizational Behavior",
        "Authors": "By Hunsaker, Phillip L., Cook, Curtis W., and Coffey, Robert E.",
        "Description": "",
        "Category": " Business & Economics , Management",
        "Publisher": "Richard d Irwin",
        "Price Starting With ($)": "7.27",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "What Every Woman Needs to Know about Menopause: The Years Before, During, and After",
        "Authors": "By Minkin, Mary Jane, M.D. and Wright, Carol V.",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Garfield Book of Cat Names",
        "Authors": "By Davis, Jim and Wallace, Carol",
        "Description": "Is your cat cowering behind a dumb name? Garfield has the answer!Muffin. Kitty. Snowball. All inane names no self-respecting cats would have – if it weren’t for the inane humans who thought of them!Now Garfield offers the definitive guide to giving your cat a cool, creative name to be proud of. Music Names, Food Names, Foreign Names, even names to avoid…historical or hysterical, they’re all here!So, start reading - and find the right name for your fabulous feline!",
        "Category": " Humor , Topic , Animals",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1988"
        }
    },
    {
        "Title": "Introductory clinical pharmacology",
        "Authors": "By Jeanne C Scherer",
        "Description": "",
        "Category": "",
        "Publisher": "Lippincott",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Decorating with Wreaths, Garlands, Topiaries & Bouquets",
        "Authors": "By Mays, Steven (PHT) and Sterbenz, Carol Endler",
        "Description": "",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Prince Charles",
        "Authors": "By Brown, Michele",
        "Description": "",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1980"
        }
    },
    {
        "Title": "Laura Ashley Color: Using Color to Decorate Your Home",
        "Authors": "By Berry, Susan, Laura Ashley (Firm) (COR), Ashley, Laura, and Kuscenko, Valerie (EDT)",
        "Description": "Exploring the effects of color on home environments, a lavishly illustrated decorating guide applies five main color spectrums to a range of practical projects that can transform homes for a desired effect. 25,000 first printing.",
        "Category": "",
        "Publisher": "Harmony",
        "Price Starting With ($)": "7.13",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Shark Tank: Greed, Politics, and the Collapse of Finley Kumble, One of America's Largest Law Firms",
        "Authors": "By Eisler, Kim Isaac",
        "Description": "Chronicling the rise and fall of Finley Kumble, one of the most ambitious law partnerships in the history of the American legal system",
        "Category": " Law , Legal Profession",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Antiques as an Investment",
        "Authors": "By Rush, Richard H.",
        "Description": "",
        "Category": "",
        "Publisher": "Bonanza Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "The Real War on Crime: Report of the National Criminal Justice Commission, The",
        "Authors": "By National Criminal Justice Commission (U. S.) (COR) and Donziger, Steven A. (EDT)",
        "Description": "The National Criminal Justice Commission's comprehensive study of crime in America examines a wide range of issues, including prison populations, crime rates, law enforcement, racial bias in the criminal justice system, and alternatives to incarceration. Simultaneous. Tour.",
        "Category": " Political Science , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Ernie And His Merry Monsters (Sesame Street Good-Night Stories)",
        "Authors": "By Michaela Muntean",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Book",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Quarterlifer's Companion : How to Get on the Right Career Path, Control Your Finances, and Find the Support Network You Need to Thrive",
        "Authors": "By Wilner, Abby and Stocker, Catherine",
        "Description": "The one book every 20-something should own--from the coauthor of the bestselling Quarterlife CrisisAfter graduation, most students go into \"the real world\" with a stack of student loans and a million questions. But thanks to Abby Wilner, the coauthor of the bestselling book Quarterlife Crisis and creator of the website Quarterlifecrisis.com, and Catherine Stocker, you can navigate life's challenges with the ultimate \"field guide.\" The Quarterlifer's Companion is a must-have instruction manual for everything you never learned in school. This all-in-one guide includes practical information on:Finding a job Filing taxes Starting a 401(K) plan Creating contacts Building a support group Handling credit and loans Balancing work and play And much more This is the essential companion to the bestselling Quarterlife Crisis.",
        "Category": " Self-help , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Leaving Town Alive: Confessions of an Arts Warrior",
        "Authors": "By Frohnmayer, John",
        "Description": "Brimming with optimism, John Frohnmayer journeyed to Washington, D.C., in 1989 to serve a cause he believed in deeply: the arts in America. Appointed by President Bush to be chairman of the National Endowment for the Arts, he was abruptly fired two and a half years later in a storm of front-page controversy.Leaving Town Alive is Frohnmayer's lively and startlingly candid account of his trial by fire in the brutal world of power politics. Taking over the NEA amid the uproar about Robert Mapplethorpe's sexually explicit photographs, Frohnmayer stood at the center of the emotional debate over public funding for the arts. On the left were staunch defenders of free speech and the artists whose confrontational works came under attack. On the right were Jesse Helms and the fundamentalist proponents of traditional values.At first Frohnmayer assumed that he could negotiate anything and that everyone had the best interests of the country at heart. He was wrong: the White House, for instance, just wanted the problem of \"offensive art\" to go away, while right-wing fund-raisers wanted to keep the issue alive as long as possible. In the end, Frohnmayer's harrowing education changed him. He entered the fray a First Amendment moderate; he emerged a free-speech radical.John Frohnmayer had an insider's view of Washington during the Bush years, and he writes with remarkable frankness about the bitter battles over the government's involvement in the arts. Passionate, witty, and wonderfully readable, Leaving Town Alive is, finally, an eloquent plea for the liberation of American culture from the narrow concerns of partisan politics.",
        "Category": " Political Science , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "A Show of Hands: Say It in Sign Language",
        "Authors": "By Sullivan, Mary Beth and Bourke, Linda",
        "Description": "An introduction to the language used by many deaf and hearing-impaired people teaches youngsters how to spell messages in the air and how to order french fries without saying a word",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Trophy Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "Silent Sons: A Book for and About Men",
        "Authors": "By Ackerman, Robert J.",
        "Description": "It could be you or someone you love. Strong, silent types are everywhere, and it is their telltale silence that has kept their problems hidden until now. A silent son can come from a family that coped with violence, alcoholism, child abuse, extreme rigidity, or divorce, but all silent sons have certain common characteristics:   They keep things that bother them to themselves.  They deny that unpleasant events occur.  They fear letting people know them.  They have difficulty interacting with their parents, spouses, or children.  They have a strong fear of criticism.  They are often angry.   In Silent Sons, Dr. Robert Ackerman, a silent son himself, examines the problems that commonly confront silent sons, keeping them from experiencing the full range of human emotions. In a compassionate and hopeful voice, the author defines the silent son and examines the impact of parents, particularly fathers, on these men and shows how their dysfunctional upbringing affects their present relationships, especially with women.  By putting aside anger, finding peace with one's self, and looking for support from other silent sons, Dr. Ackerman feels every man can realize his full potential and become a well balanced, healthy survivor.",
        "Category": " Psychology , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Walker Evans: A Biography",
        "Authors": "By Evans, Walker and Rathbone, Belinda",
        "Description": "Walker Evan's photographs are American classics. His legendary images of southern sharecroppers in LET US NOW PRAISE FAMOUS MEN and his pictures documenting the Depression era make up a haunting protrayal of the American soul. Until now, though, the man behind those well-known images has remained elusive, by his own design. In this first full biography, a leading authority on Evans penetrates the anonymity of his legendary photographs to reveal A VERY RICH AND INCLUSIVE LIFE OF FOOLISHNESS, CRUELTY, AND SPLENDOR, SAN FRANCISCO CHRONICLE. A portrait of an artist who profoundly influenced the generation of photographers who followed him, WALKER EVANS also traces the artstically fecund times that nurtured him. His career provides a NEW AND PENETRATING ILLUMINATION, ST LOUIS POST-DISPATCH, of everything from the newly established Museum of Modern Art to President Roosevelt's troubled Farm Security Adminsistratiion. WALKER EVANS is a thoroughly engrossing biography of a unique American master.",
        "Category": " Biography & Autobiography , Artists, Architects, Photographers",
        "Publisher": "Mariner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Meteorology today: An introduction to weather, climate, and the environment",
        "Authors": "By Ahrens, C. Donald",
        "Description": "",
        "Category": "",
        "Publisher": "West Pub. Co",
        "Price Starting With ($)": "7.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Contest for a Capital: George Washington, Robert Morris, and Congress, 1783-1791, Contenders : Dramatized Events of America's Founding Years",
        "Authors": "By Loftin, T. L. and Zarambouka, Sofia (ILT)",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Tee Loftin Pubs",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Americas Glorious Quilts",
        "Authors": "By Duke, Dennis",
        "Description": "",
        "Category": "",
        "Publisher": "Hugh Lauter Levin Associates",
        "Price Starting With ($)": "10.56",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Cars 1886-1930",
        "Authors": "By Georgano, G. N.",
        "Description": "An historical presentation of the automobile offering chapters on the origin of gas, steam, and electric cars, technical progress, coach building, sports and luxury cars, mass manufacturing, and advertising",
        "Category": " Science , General",
        "Publisher": "Beekman House",
        "Price Starting With ($)": "7.67",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Dr Jekyll and Mr Hyde and Weir of Hermiston (Oxford World's Classics)",
        "Authors": "By Stevenson, Robert Louis and Letley, Emma",
        "Description": "This volume includes Stevenson's famous spine-chilling thriller Dr. Jekyll and Mr. Hyde as well asWeir of Hermiston, a brilliant autobiographical portrayal of a father-son relationship.",
        "Category": " Young Adult Fiction , Horror",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Spirited Americans: A Commentary on America's Optimists-From the Puritans to the Cybr-Century",
        "Authors": "By Jeffcoat, A. E.",
        "Description": "Examines the heritage of optimism in American history, discussing the character traits that have contributed to the nation's optimistic spirit",
        "Category": " History , United States , General",
        "Publisher": "Winslow House Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "What Went Wrong?: Western Impact and Middle Eastern Response",
        "Authors": "By Lewis, Bernard",
        "Description": "For many centuries, the world of Islam was in the forefront of human achievement--the foremost military and economic power in the world, the leader in the arts and sciences of civilization. Christian Europe, a remote land beyond its northwestern frontier, was seen as an outer darkness of barbarism and unbelief from which there was nothing to learn or to fear. And then everything changed, as the previously despised West won victory after victory, first in the battlefield and the marketplace, then in almost every aspect of public and even private life.    In this intriguing volume, Bernard Lewis examines the anguished reaction of the Islamic world as it tried to understand why things had changed--how they had been overtaken, overshadowed, and to an increasing extent dominated by the West. Lewis provides a fascinating portrait of a culture in turmoil. He shows how the Middle East turned its attention to understanding European weaponry and military tactics, commerce and industry, government and diplomacy, education and culture. Lewis highlights the striking differences between the Western and Middle Eastern cultures from the 18th to the 20th centuries through thought-provoking comparisons of such things as Christianity and Islam, music and the arts, the position of women, secularism and the civil society, the clock and the calendar.   Hailed in The New York Times Book Review as \"the doyen of Middle Eastern studies,\" Bernard Lewis is one of the West's foremost authorities on Islamic history and culture. In this striking volume, he offers an incisive look at the historical relationship between the Middle East and Europe.",
        "Category": " History , Middle East , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Lessons from the Fairway: Inspirational Stories from the Fairway for the Yound and Old Alike!",
        "Authors": "By Fisher, R. McKenzie",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "New Leaf Publishing Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Your Sacred Self",
        "Authors": "By Dyer, Wayne W.",
        "Description": "The author of Your Erroneous Zones combines psychological insights and guidelines for achieving spiritual fulfillment to present a three-step program designed to help readers look inside themselves to find a new sense of self-awareness and spiritual joy. 150,000 first printing. $150,000 ad/promo. Tour.",
        "Category": " Religion , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    }
]