[
    {
        "Title": "Terror in the town (An armchair mystery)",
        "Authors": "By Ronns, Edward",
        "Description": "",
        "Category": "",
        "Publisher": "David McKay Company",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1947"
        }
    },
    {
        "Title": "Understanding Cats",
        "Authors": "By Tabor, Roger",
        "Description": "Traces the historical origins of the cat, looks at breeds, and examines the changing nature of the human relationship with cats throughout history",
        "Category": " Pets , Cats , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Secrets of the Savvy Consumer: Save Big Money on Everything You Buy",
        "Authors": "By Sandler, Corey",
        "Description": "A step-by-step guide to negotiating encourages readers to explore the art of the deal when buying everything from groceries to plane tickets, and offers practical strategies that can benefit both individuals and small businesses. Original. 25,000 first printing.",
        "Category": " Business & Economics , Consumer Behavior",
        "Publisher": "Prentice Hall Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "His finest week",
        "Authors": "By Smith, James Roy",
        "Description": "",
        "Category": "",
        "Publisher": "The Upper Room",
        "Price Starting With ($)": "6.19",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "The Cow That Went OINK",
        "Authors": "By Most, Bernard",
        "Description": "Teased and tormented by the other farm animals, a cow who can only say \"oink\"--instead of \"moo\"--is delighted by the arrival of a pig who can only say \"moo.\" Children's BOMC. Reprint.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Ortho's 50 Quick Home Improvements (Ortho's All About Home Improvement)",
        "Authors": "By Ortho Books (COR), Ross, Sharon, Wattenmaker, Pamela Drury (ILT), Johnson, Karen (EDT), Egge, Mark (ILT), and Toht, David",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Ortho Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Pocket Bible Commentary",
        "Authors": "By Neil, William",
        "Description": "",
        "Category": " Religion , Biblical Commentary , General",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "5.74",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Tango Midnight",
        "Authors": "By Cassutt, Michael",
        "Description": "It's 2005, and the world has changed.  International terrorists have released a genetically modified disease, called X-Pox, on the world.  There is no greater challenge to medicine than finding a cure.   Biochem billionaire Tad Mikleszewski (called TM by nearly everyone) is a \"space junkie\" who has been the primary investor backing the Spacelifter project, a private attempt to build a single-stage to orbit vehicle.  But Spacelifter's crucial test firing has failed, and TM is going to pull the plug.  He has a better idea for getting himself into space....he'll buy research time on the International Space Station, to work on a cure for X-Pox.  The Russians will sell him a seat on the Soyuz taxi vehicle for a mere $30 million.But the equipment in the Harmony Laboratory module was salvaged from old Russian military labs, and perhaps TM's skills are a little bit out of date.  A tiny leak - a small hole in the seal of the isolation box where TM is manipulating the X-Pox pathogen, and Harmony is contaminated by the  disease that kills within three weeks.  Now it's a race against time, to rescue the crew and decontaminate the Space Station.  NASA has a shuttle a month from launch, and if Astronaut Kelly Gessner can be retrained in decontamination procedures they can push that up two weeks.  The Russians have a third Soyuz due off the assembly line, but Astronaut Mark Koskinen, NASA's chief of staff at Star City doesn't think they'll make it in time.  But whether Russian or American, someone is going to have to get up there, and fast.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "5.6",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "125 Best Chocolate Chip Recipes: Quick, Easy, Fun Ideas",
        "Authors": "By Hasson, Julie",
        "Description": "Chocolate chips are basic for any home baker.     125 Best Chocolate Chip Recipes features creative recipes for everything from cakes, pies, breads, puddings, bars, squares and muffins to hot and cold beverages and sauces. This reissue features an all-new cover and 16 new color photographs.     No cookbook on chocolate chips would be complete without cookie ideas, and Julie Hasson provides plenty of them, based on her vast baking experience. She streamlines all her recipes back to their basic form without sacrificing taste or flavor, while eliminating any intimidation factor completely. By simplifying complicated techniques, preparation and baking time are decreased significantly. These recipes are designed for maximum impression and superb taste with minimum fuss, and made in minutes.       Beverages    Cookies-and-Cream Shake, Chocolate Caramel Cream Shake,            Chocolatini     Breakfast    Chocolate Chip Hotcakes, Chocolate Cherry Chip Granola, Apricot Chip Scones     Cakes    Chocolate Espresso Lava Cake, Chocolate Mousse Cake, Coconut Cupcakes     Cookies    Chocolate Chip Meringues, The Quintessential Chocolate Chip Cookie, Oat Bars     Frozen Desserts    Coconut Chip Sorbet, Mississippi Mud Pie, Banana Chip Foster, Affogato     Muffins    Chocolate Chip Cranberry Muffins, High-Octane Espresso Chip Morning Muffins     Pies, Tarts and Puddings    Chocolate Chip Brownie Tart, Banana Fanna Pie, Chocolate Tiramisu.     Novice and experienced bakers alike will enjoy these sumptuous recipes.",
        "Category": " Cooking , Courses & Dishes , Cookies",
        "Publisher": "Robert Rose",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "net future",
        "Authors": "By Martin, Chuck",
        "Description": "What does tomorrow portend for executives, managers, their jobs and businesses in an even faster, more interactive and relentlessly competitive world? Welcome to Net Future. the prophetically plotted roadmap to a bold new world of commerce and consumerism. An interactive marketplace where success for the well-prepared will be no less than total. And all but impossible for those who are not. It's a world Chuck Martin, author of The New York Times Business Book Best Seller, The Digital Estate,  is well equipped to foretell. A future dictated by seven \"cybertrends\" already taking form. Discover  where they are, what they mean and how to get ready for all of them.",
        "Category": " Business & Economics , Management",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Pacific Bounty: Hawaii Cooks With Roy Yamaguchi",
        "Authors": "By Yamaguchi, Roy and Wentzel, Marty",
        "Description": "Introduces the cuisine of Hawaii, and shares recipes for appetizers, salads, soups, poultry, fish, seafood, meat, vegetables, and desserts",
        "Category": " Cooking , Regional & Ethnic , American , Western States",
        "Publisher": "Kqed",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Ageless Body, Timeless Mind: The Quantum Alternative to Growing Old",
        "Authors": "By Chopra, Deepak",
        "Description": "There is nothing inevitable about aging--that is the inspiring message from Dr. Deepak Chopra. \"Once again Dr. Chopra presents us with information that can help us live long, healthy lives. For all those interested in a long, full life, this book is a valuable resource.\"--Bernie Siegel, M.D., author of Love, Medicine and Miracles Over 1.5 million copies sold. National bestseller. Line drawings.",
        "Category": "",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "From Losers to Winners: How to Manage Problem Employees...and What to Do If You Can't",
        "Authors": "By Sherman, V. Clayton",
        "Description": "Recommends techniques to use to turn problem employees into productive workers and prevent problem behavior",
        "Category": " Business & Economics , Human Resources & Personnel Management",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "Fountain Society: A Novel",
        "Authors": "By Craven, Wes",
        "Description": "A veteran of more than thirty films, Wes Craven has become a household name synonymous with inventive genius, wit, and inspired, shocking thriller cult classics. Now he brings his wicked talents to bear on the novel of suspense with a spine-chilling tale that will leave readers breathless, a story of breakthrough medical technology run amok, a terrifying government conspiracy, and a life-after-death romance.  At the center of the novel is a sinister plot to confer immortality on a select, elite group of government scientists - a plot of such cold brutality and evil that it has been kept secret from everybody, even those who might one day benefit from it.  Dr. Peter Jance is a brilliant weapons scientist, dying of cancer just as he nears completion of his greatest invention. Beatrice is his beautiful scientist wife. Dr. Frederick Wolfe is the dark genius who with Beatrice's help, has discovered the secrets of immortality. Elizabeth and Hans, young lovers, healthy and strong, are the unknowing victims of Wolfe's sinister plans.  Featuring a unique and fascinating love triangle, and combining the elements of a state-of-the-art medical thriller with those of a great suspense caper, Wes Craven's Fountain Society is a book that chills, thrills, and satisfies like his own movies, building to a climax of unspeakable tension and shock.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Catwatching",
        "Authors": "By Morris, Desmond",
        "Description": "",
        "Category": " Pets , Cats , General",
        "Publisher": "Crown Publishers, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1987"
        }
    },
    {
        "Title": "The Misunderstood Child: A Guide for Parents of Children With Learning Disabilities",
        "Authors": "By Silver, Larry B.",
        "Description": "Describes common learning disabilities and the problems they can cause, explains how learning disabled children are diagnosed, and looks at the legal rights of children who require special education",
        "Category": " Medical , General",
        "Publisher": "Tab Books",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "A Remarkable Medicine Has Been Overlooked: Including an Autobiography and the Clinical Section of the Broad Range of Use of Phenytoin",
        "Authors": "By Dreyfus, Jack",
        "Description": "",
        "Category": " Biography & Autobiography , Business",
        "Publisher": "Continuum Intl Pub Group",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Atkins for Life Low-Carb Cookbook: More than 250 Recipes for Every Occasion",
        "Authors": "By Fink, Ben (PHT), Atkins, Veronica C., and Nathanson, Stephanie",
        "Description": "\"Controlling carbs works in virtually every situation, when you're having dinner with the family or hosting a dinner party, when you're in a hurry or spending the day creating delicacies in your kitchen.  If you like to take shortcuts or you enjoy starting from scratch, if you mostly tinker in the kitchen on the weekends or cook every day, here are the recipes that suit your lifestyle.\"- Veronica AtkinsAtkins for Life took the nation by storm, proving that doing Atkins is not a \"fad\" - it's a healthy and satisfying way of eating that you can follow for a lifetime.  With multiple weeks at the top of the New York Times bestseller list, Atkins for Life whet the appetites of millions of new and established Atkins followers, and had them clamoring for even more great-tasting recipes that complement the low-carb lifestyle.  Enter Atkins for Life Low-Carb Cookbook. Whether you're an Atkins devotee or you're just beginning to explore the benefits of controlling carbs, this all-purpose cookbook has the solutions you need to cook and eat appropriately - and enjoyably every day, at every meal, whether you're feeding your family, throwing a sit-down dinner party, or just looking for a healthy between-meal snack!This invaluable book makes low-carb cooking easier than ever before.  Illustrated with more than 80 full-color photographs, it includes 250 recipes for sumptuous dishes such as Pan-Seared Steak with Mustard Sauce, Clementine-Glazed Duck Breast, Ginger Ice Cream with Caramelized Pears, and more!  There are also a slew of home-style favorites you may not have thought you could enjoy on Atkins, including Pork Stew with Hominy and Collards, Mini Meatballs and Spaghetti, Mexican Chicken Wrap, and Creamy Lemon Bars.Although many of these recipes are tailored to fit the Pre-Maintenance and Lifetime Maintenance phases of Atkins, more than half of them are also appropriate for the Induction and Ongoing Weight Loss plan.  Inside you'll find:* More than 100 tips and sidebars including: Nuts About Nuts, Smart Snacks and Sides, and  Spotlight on Ginger* Complete nutritional information for every recipe, including Net Carbs and suitable Atkins phases* Helpful ideas for choosing the highest-quality foods and avoiding those full of hidden sugars or dangerous added trans fats* Countless bits of wisdom to simplify cooking and preparation, plus important low-carb cooking techniquesThe wide range of recipes fills the bill for:* Speedy weeknight suppers in under 30 minutes* Budget and vegetarian options* Family-friendly fare for healthy eating at any age* Outdoor grilling and barbecuing* Snacks and bag lunches* Luscious desserts to satisfy a sweet tooth - all without sugar* Special-occasion and party menus, including: Thanksgiving, New Year's, Super Bowl Sunday, Valentine's Day, Easter, Halloween, and more!  Now you don't have to give up your favorite dishes to control your carbs - you can simply make them the Atkins way.",
        "Category": " Cooking , Health & Healing , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Flight Lessons",
        "Authors": "By Gaffney, Patricia",
        "Description": "From the author of the New York Times bestsellers The Saving Graces and Circle of Three comes the poignant story of two women struggling to come to terms with the past that haunts them both.For sixteen years Anna has studiously avoided her Aunt Rose. Exchanging cards at holiday time -- that's as far as Anna is willing to go with the woman she once loved more than anyone else in the world. That love died the night Rose betrayed Anna and her mother -- Rose's own fatally ill sister -- and Anna can't forgive or forget. Years have passed since she's been back to her hometown on Maryland's Eastern Shore, where Rose still runs the aging family restaurant, the Bella Sorella. Anna has built a life elsewhere with a job she likes and a man she loves. Or so she thought.The problem, or one of them, was that circumstances had split her life down the middle. She was always of two minds, the hopeful half versus the skeptic, optimist against pessimist. Or maybe it had evened out and she was now a relativist, a contingency artist. Either way, it didn't help that at this late date a theme was taking shape -- a motif or whatever you wanted to call it, a pattern -- consisting of Anna walking in on trusted loved ones in bed with each other.Anna clearly needs an escape, but the only place for her to go is home: to the family, to the restaurant, to Rose, who has been trying for more than a decade to regain Anna's trust. And right now Rose needs her more than ever. Feelings between the two women remain as chilly as ever, even in the steamy kitchen of the Bella Sorella, where values clash and generations collide -- and outside it, where their personal lives become entangled in surprising ways. Anna is a reluctant partner in this intricate dance of forgiveness and reconciliation, insisting that her stay is only temporary. Her plan is to leave a second time, as soon as the restaurant is back on its feet and her own hurt is healed. But her determination to remain unaffected by Rose's longing to undo the past and create a future blinds Anna to a chance for human connection and she almost fails to recognize true love, even when it reaches in and grabs her by the heart.Touching, funny, poignant, and wise,Flight Lessons is a moving story of truth and loyalty, of the bonds that shape and sustain us and, ultimately, uplift us. Patricia Gaffney once again delivers a story told with grace and warmth, filled with the recognition of self and reminding us that there's no place like home.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Where You Belong",
        "Authors": "By Bradford, Barbara Taylor",
        "Description": "With all the glamour, drama, and passion that have made Barbara Taylor Bradford an international favorite, Where You Belong is the captivating story of a beautiful young woman making her way through a world filled with the dangers of war.A talented young American photographer, Valentine Denning leaves behind the comforts of her home in Paris to record the war in Kosovo from the front lines. Drawn together by the perils of war photojournalism, Val and one of her colleagues, the British Tony Hampton, find themselves in the throes of a romance that is tragically cut short when Val, Tony, and their American colleague Jake Newberg are caught in a nightmarish ambush. When Val wakes up in a Belgrade hospital, she learns that Tony has died.Later, when she and Jake attend Tony's memorial service in London, Val's memories of Tony are gravely shaken by the realization that throughout their relationship he had lied, telling her that he was divorced. Reeling from his death and betrayal, Val and Jake return home to Paris, where they recover from their wounds and try to make sense of Tony's lies to both of them. As they begin to build a relationship and leave the events of the war behind them, Jake confesses his longtime love for her.But for Val, peace with herself is elusive, as she tries to reconcile her love of photography with the perils of her career, not to mention the claims on her heart. The desire for a fresh new beginning leads her to trade the grueling world of war photojournalism for a glamorous position as a photographer of celebrities--which lands her in Mexico, snapping the dashing Alexander St. Just Stevens (born Bill Smith in Leeds, England), an artist of international renown whose reputation as a playboy doesn't steel him against a powerful attraction to Val. Finding a new mode of photojournalism--and a new admirer--still can't ease her sense of searching for something, a sense that will lead her to retrace paths she thought were left behind.Where You Belong is a moving story about a young woman's realization of her own inner strength and her ability to find her way to where she belongs in life...in love...and within herself.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "StarCraft Expansion Set: Brood War: Prima's Official Strategy Guide",
        "Authors": "By Bart Farkas",
        "Description": "",
        "Category": "",
        "Publisher": "Prima Games",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Spyder Web",
        "Authors": "By Grace, Tom",
        "Description": "The Spyder moves silently and stealthily on an invisible, globe-spanning web of computer networks, gathering, sifting, and sending out the most sensitive data. A tiny programmable device, Spyder can pry open the most heavily guarded computer networks in the world and do the work of hundreds of field agents and teams of elite computer hackers. Now the battle to control this confidential technology has begun, and a former U.S. Navy SEAL has walked into the middle of the fight.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Blow Fly",
        "Authors": "By Cornwell, Patricia Daniels",
        "Description": "In Blow Fly, Kay Scarpetta stands at the threshold of a new life after her work as Virginia's Chief Medical Examiner has come to a jarring end. At the close of The Last Precinct, she knew she would have to leave Richmond if she were to find any peace. She feared that she was about to be fired by the governor. More alarming, she was hounded in the media and in the courtroom, for what some claimed was her involvement in the murder of a deputy police chief. So Scarpetta packed up her belongings and set out for the warmth and solace of the Florida sun.She is settling into a new life as a private forensic consultant and is deep into a case that has left colleagues in Louisiana profoundly disturbed. A woman is found dead in a seedy hotel, dressed to go out, keys in her hand. Her history of blackouts, and her violent outbursts while under their spell, offer more questions than clues about the cause of her death. Then Scarpetta receives news that chills her to the core: Jean-Baptiste Chandonne - the vicious and unrepentant Wolfman, who pursued her to her very doorstep - asks to see her. From his cell on death row, he demands an audience with the legendary Dr. Scarpetta. Only to her will he tell the secrets he knows the authorities desire: the evidence that will bring a global investigation to a swift conclusion. Scarpetta, her niece Lucy, and her colleague Detective Pete Marino are left to wonder: After all the death and destruction, what sort of endgame could this violent psychopath have in mind? And could this request be somehow related to the Louisiana case?Her friends and family by her side, Scarpetta must unravel a twisting conspiracy with an international reach and confront the shock of her life - a blow that will force her to question the loyalty and trust of all she holds dear.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Putnam",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Reader's Digest Bible: Condensed from the Revised Standard Version Old and New Testaments",
        "Authors": "By Metzger, Bruce (EDT)",
        "Description": "Condenses all sixty-six books of the Old and New Testaments, based upon the Revised Standard Version text, retaining their traditional sequence and the essential parts and messages of their stories and poetry",
        "Category": " Religion , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "September",
            "Year": "1982"
        }
    },
    {
        "Title": "Transgressions: Ten Brand-New Novellas",
        "Authors": "By McBain, Ed (EDT)",
        "Description": "Forge Books is proud to present an amazing collection of novellas, compiled by New York Times bestselling author Ed McBain. Transgressions is a quintessential classic of never-before-published tales from today's very best novelists. Faeturing:    \"Walking Around Money\" by Donald E. Westlake: The master of the comic mystery is back with an all-new novella featuring hapless crook John Dortmunder, who gets involved in a crime that supposedly no one will ever know happened.  Naturally, when something it too good to be true, it usually is, and Dortmunder is going to get to the bottom of this caper before he's left holding the bag.\"Hostages\" by Anne Perry: The bestselling historical mystery author has written a tale of beautiful yet still savage Ireland today.  In their eternal struggle for freedom, there is about to be a changing of the guard in the Irish Republican Army.  Yet for some, old habits-and honor-still die hard, even at gunpoint.\"The Corn Maiden\" by Joyce Carol Oates: When a fourteen-year-old girl is abducted in a small New York town, the crime starts a spiral of destruction and despair as only this master of psychological suspense could write it.\"Archibald Lawless, Anarchist at Large: Walking the Line\" by Walter Mosley: Felix Orlean is a New York City journalism student who needs a job to cover his rent.  An ad in the paper leads him to Archibald Lawless, and a descent into a shadow world where no one and nothing is as it first seems.\"The Resurrection Man\" by Sharyn McCrumb\": During America's first century, doctors used any means necessary to advance their craft-including dissecting corpses.  Sharyn McCrumb brings the South of the 1850s to life in this story of a man who is assigned to dig up bodies to help those that are still alive.\"Merely Hate\" by Ed McBain: When a string of Muslim cabdrivers are killed, and the evidence points to another ethnic group, the detectives of the 87th Precinct must hunt down a killer before the city explodes in violence.\"The Things They Left Behind\" by Stephen King: In the wake of the worst disaster on American soil, one man is coming to terms with the aftermath of the Twin Towers-when he begins finding the things they left behind.\"The Ransome Women\" by John Farris: A young and beautiful starving artist is looking to catch a break when her idol, the reclusive portraitist John Ransome offers her a lucrative year-long modeling contract. But how long will her excitement last when she discovers the fate shared by all Ransome's past subjects? \"Forever\" by Jeffery Deaver: Talbot Simms is an unusual cop-he's a statistician with the Westbrook County Sheriff Department.  When two wealthy couples in the county commit suicide one right after the other, he thinks that it isn't suicide-it's murder, and he's going to find how who was behind it, and how the did it.\"Keller's Adjustment\" by Lawrence Block: Everyone's favorite hit man is back in MWA Grand Master Lawrence Block's novella, where the philosophical Keller deals out philosophy and murder on a meandering road trip from one end of the America to the other.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Forge Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Honeymoon with My Brother: A Memoir",
        "Authors": "By Wisner, Franz",
        "Description": "A funny thing happened to Franz Wisner on his way to the altar.For starters, his fiancee dumped him days before their large wedding at a remote resort on the northern California coast. But Franz is an optimist. He didn't panic (well, maybe just a little). With guests en route from as far away as Prague and Moscow and everything paid for, he decided to have his wedding anyway...just without a bride. Instead, seventy-five friends and family members gathered for a weekend tear-fest/confidence boost/red-wine bender.Franz returned to his home in Newport Beach, California, only to find that he'd been demoted at his job as a government-relations executive for one of the state's largest real-estate developers. The two loves of his life - his longtime girlfriend and his career - had suddenly evaporated.So Franz chose to continue the festivities. He grabbed his recently divorced brother, Kurt, and took off on his deluxe Costa Rican honeymoon. They canceled the honeymoon suite and flower arrangements, swapped champagne for beer, and promised not to carry each other over any thresholds.During the trip, Franz realized that having his life turned upside down might not be such a bad thing after all.He and Kurt decided to extend their honeymoon. Big time. They quit their jobs, sold their homes, gave away their clothes and furniture, discarded cell phones and pagers (Kurt used a nine iron on his), and continued the honeymoon for a couple of years through fifty-three countries in Eastern Europe, South America, Asia, and Africa.Honeymoon with My Brother is a book about the discoveries Franz and Kurt made during their two years on the road and how Franz exchanged heartbreak for a new view of himself and the world.",
        "Category": " Travel , Special Interest , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Beautiful Stranger",
        "Authors": "By Donahue, Hope",
        "Description": "Hope Donahue seemed to have it all: beauty, wealth, social status. She was an only child who grew up with the best private schools, debutante balls, and a home in Hancock Park, Los Angeles's old-money enclave. But beneath her family's facade of keeping up appearances, Hope hid a host of ugly truths, including an insecure, competitive mother, a family friend's sexual advances, and a father who gave in to the demands of his wife and coolly reserved parents. Hope became addicted to a quest for physical perfection in place of her self-esteem - and by the age of twenty-seven she had undergone seven plastic surgeries. Hope recounts her downward spiral that alienated her family and friends, and led her to theft, bankruptcy, and a sadistic relationship before she began her recovery.A response to a culture obsessed with extreme makeovers and risky procedures that promise flawlessness, Beautiful Stranger is a timely, cautionary tale.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Gotham",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Unlikely Angel: The Untold Story of the Atlanta Hostage Hero",
        "Authors": "By Smith, Ashley and Mattingly, Stacy",
        "Description": "In March 2005, Ashley Smith made headlines around the globe when she miraculously talked her way out of the hands of alleged courthouse killer Brian Nichols after he took her hostage for seven hours in her suburban Atlanta apartment. In this moving, inspirational account, the twenty-seven-year-old widowed mother of a six-year-old girl shares for the first time the little-known details of her traumatic ordeal and expands on how her faith and the bestselling book The Purpose-DrivenLife helped her survive and bring the killer's murderous rampage to a peaceful end. Like her captor, Smith too has faced darkness and despair. Yet even during the most desolate times of her life, she yearned for something better. Seeking a new life, she moved to Atlanta, got a job, enrolled in a medical assistant training program, and was beginning to find her way to becoming the kind of mom she wanted her little girl to have. Then Brian Nichols took her hostage. Just hours earlier, he'd allegedly shot to death a judge, a court reporter, a deputy, and a federal agent and escaped in a stolen vehicle. Ashley had paid only passing attention to media coverage of the unfolding manhunt. Now she found herself face-to-face with Nichols, a desperate, heavily armed man with nothing left to lose. Unlikely Angel is Ashley's gripping, powerful account of how this nightmare scenario developed into a remarkable connection between a man wanted for multiple murders and a single mother struggling to make a fresh beginning from her troubled past. Juxtaposing the minute-by-minute tale of her experience with the never-before-told tragedies and triumphs of her own life, Unlikely Angelis a story that will leave no reader untouched.Ashley has made appearances on Oprah, Good Morning America, 20/20, and Larry King Live.",
        "Category": " True Crime , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Dating",
        "Authors": "By Kuriansky, Judith",
        "Description": "You're no idiot, of course. You're quick with an opinion, can plan a party at the drop of a hat, and you drive a hard bargain. But when it comes to getting a date, you feel like the world's biggest wallflower. Don't throw in the towel yet! The Complete Idiot's Guide to Dating gives you the confidence, self-esteem, and smooth-talking tips you need to have a winning social life. Feel confident making the first move and starting a conversation. In this Complete Idiot's Guide you'll find solid information on where to go to meet quality singles; friendly advice in an easy-to-understand format; tips and warnings to help you along the way; and fun quizzes for charting your progress.",
        "Category": "",
        "Publisher": "Macmillan Distribution",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Men Like Women Who Like Themselves",
        "Authors": "By Carter, Steven and Sokol, Julia",
        "Description": "In Men Like Women Who Like Themselves, bestselling relationship experts Steven Carter and Julia Sokol move beyond the recent trend in self-help books to polarize the sexes and emphasize the differences between men and women. Instead, they team up to provide the kind of supportive advice that brings couples together, keeps them communicating, and celebrates each partner's individuality without sending either one off into a separate corner. With the wit and candor that marked their bestseller What Smart Women Know, they offer practical suggestions for women everywhere, whether they're already in a committed relationship or still looking for the right guy.In this witty, concise guide, you'll learn the real secrets of finding, keeping, and making the most of any relationship: how to keep the first date from turning into the last supper, why men don't like sexual pressure any more than women do, why it's smart to make up before you make out, how to say no even when your body is screaming yes, and why bringing home the bacon shouldn't make anyone the boss.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "The Time Trap",
        "Authors": "By MacKenzie, Alec",
        "Description": "Focusing on twenty major obstacles to effective time management, a guide to using time well offers practical solutions to the problem",
        "Category": "",
        "Publisher": "AMACOM",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Learning to Sing: Hearing the Music in Your Life",
        "Authors": "By Aiken, Clay and Glock, Allison",
        "Description": "“My mother prophesied years ago that my voice would take me places. She was certain that there was a reason I was able to sing. I am still discovering what that reason is, what it is that God wants to happen.”–CLAY AIKEN, from Learning to SingWhen he was a kid singing in his church choir, Clay Aiken never dreamed of becoming a pop music star. His ambition was to be a teacher, maybe even a high school principal. But Clay’s mother was right, and the music that was Clay’s joy in life was destined to lead him to unexpected triumphs.In Learning to Sing, Clay details what his astonishing success has meant to him. He writes from the heart about his life before and since his instant stardom on American Idol, how he has changed, and how he struggles to adapt to life in the public eye. He speaks candidly about his lonely childhood: the father who abandoned him, the school bullies who tormented him, the mother who taught him to be strong, and the friends and teachers who–more than they ever knew–kept him going. He describes his new high-profile life in Los Angeles– the awards shows, the free clothes, the unfortunate presence of avocado on all the food. More significant, he reveals what he has discovered from diving into the white-hot center of pop culture: what it takes for him to stay true to himself and remember the lessons he learned growing up in Raleigh, North Carolina.Clay shares his struggle to remain a man his mother can be proud of, and writes about the faith that sustains him today just as it did when he was an awkward, unpopular outsider. “I believe God has a direction for me. He did not give me this life just so I could buy a big house and an SUV. My job is to give back and to be a decent human being no matter how many people cheer my name.”Clay’s friends–the old ones from North Carolina and the millions of new ones who love his voice–will hold this inspiring memoir as close to their hearts as they do his music. Learning to Sing reminds you that anything is possible. Like a perfect song, it will send your spirit soaring.",
        "Category": " Music , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "The Way People Run: Stories",
        "Authors": "By Tilghman, Christopher",
        "Description": "In The Way People Run, one of America's finest writers gives us a new collection of short stories, fiction about the deep emotional connections, and disconnections, between people and within people's inner lives. Against the backdrop of vivid settings, especially the Chesapeake Bay region and the American West, Tilghman writes with passion, generosity, and grace about the ways people confront themselves and the lives they've created. In \"The Way People Run,\" chosen by Robert Stone for the 1992 Best American Short Stories volume, a man goes west to find a new job and, out of the framework of the familiar, loses his hold on his family and his old life. In \"Something Important,\" Peter Ramsey undertakes a reunion with his long-lost brother, and discovers that his wife is in love with someone else. In \"Things Left Undone,\" chosen by Tobias Wolff to appear in the 1994 Best American Short Stories, a young couple tries to survive a tragedy. As Andre Dubus said about In a Father's Place, Christopher Tilghman \"is a spiritual writer who often looks at things the rest of us cannot see.\" Life's truths are at the heart of these stories by a modern American master.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Picador USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Creating Excellence: Managing Corporate Culture, Strategy, and Change in the NewAge",
        "Authors": "By Hickman, Craig R. and Silva, Michael A.",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "The Ink Drinker",
        "Authors": "By Matje, Martin (ILT), Sanvoisin, Eric, and Moroz, Georges (TRN)",
        "Description": "Book lovers everywhere will adore this twist on an old tale:This young boy cannot think of a worse way to spend his summer: he has to help his Dad out with his bookstore, and he absolutely hates to read!  His job is to watch the store for shoplifters, but things take a twisted turn when he spies a pale character who seems to float through the aisles of the store.But this stranger is not trying to steal books--he is drinking the words out of them with a straw!  So the boy goes on a chase to find out what this fellow is all about and they both wind up in a cemetery, where the boy discovers a taste for something much more filling than ink!",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Delacorte Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Flinch",
        "Authors": "By Ferrigno, Robert",
        "Description": "At the center is Jimmy Gage, a tabloid writer for Slap magazine who's been contacted by someone calling himself \"The Eggman,\" a serial killer who has laid claim to six unsolved murders around Los Angeles - except the whole thing is declared a publicity hoax by the police, who've branded Jimmy a publicity hound.But then a year later, crime-scene photographs of the murders turn up in the possession of Jimmy's brother, Jonathan, a high-profile plastic surgeon. Although Jimmy acknowledges that this makes Jonathan a suspect, he also realizes that this might be simply one more round in the psychological games the brothers have been playing - and Jonathan mostly winning - since they were children. It's a twisted sibling rivalry newly charged by Jonathan's recent marriage to Jimmy's former girlfriend.Throw into the mix Jonathan's impeccable standing in the community (as compared to Jimmy's lack of one) ... the female detective who can't decide which brother to believe ... and the thugs, con-artists, baby-faced brainiacs, and hard-edged women who are potentially lethal distractions in Jimmy's life.But the distractions will have to wait: Jimmy's committed to discovering the identity of the killer, and no one gets a better pay-off from his obsession than the reader of this edgy, fast-forward, unstoppably entertaining novel.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "19.95",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Animosity",
        "Authors": "By Lindsey, David L.",
        "Description": "Ross Marteau is the toast of the international art world for his sensual sculptures of rich and famous women. But when a long-term relationship breaks up badly, he retreats to his Texas hometown - only to have his newfound peace of mind permanently, profoundly, shattered.One afternoon over lunch, Ross is approached by a woman to whom he feels an irresistible attraction. She introduces herself as Celeste Lacan and asks him to take on a new commission, a sculpture of her younger sister, Leda, promising that the job will present artistic challenges unlike any he has encountered before. Though reluctant, Ross can't help but be intrigued: by Celeste herself and by a photo of Leda's face, a portrait of incomparable beauty.When he meets her, Ross is stunned to discover that Leda's body is as startlingly unique as her face is beautiful. Just as Celeste predicted, he becomes consumed with portraying the duality of her body...and, perhaps, her soul. At the same time, he becomes increasingly aware that the enigmatic depth he sees in Celeste is as mesmerizing as the fathomless torment he sees in Leda. Soon he's romantically involved with one sister; his relationship with the other is much harder to define.As Ross begins to sculpt, Leda vacillates between seductiveness and a mystifying aloofness, while Celeste begins to withdraw from his touch. Then a sudden, violent murder draws him deeper into their world. Too late, Ross will learn that his bond with the women is older, darker - and more explosive - than he could ever have imagined.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Spadework",
        "Authors": "By Findley, Timothy",
        "Description": "Lust. Infidelity. Betrayal. Murder.On a summer evening in Stratford, Ontario, the errant thrust of a gardener's spade slices a telephone cable into instant silence. The resulting disconnection is devastating. With the failure of one call to reach the house, an ambitious young actor becomes the victim of sexual blackmail. The blocking of a second call leads tragically to murder. And when a Bell Canada repairman arrives to mend the broken line, his innocent yet irresistible male beauty has explosive consequences.In Spadework, Timothy Findley, a master storyteller and playwright, has created an electric wordplay of infidelity and morality set on the stage of Stratford, Ontario, Findley's home territory. In this fictional portrait of Canada's preeminent theater town, intrigue, passion, and ambition are always waiting in the wings. Findley peoples the town with theater folk, artists, writers, and visitors (both welcome and unwelcome), and with lives that are immediately recognizable as \"Findley-esque\" -- the lonely, the dispossessed, and the sexually troubled.A story that ripples with ever-widening repercussions, a sensual, witty, and completely absorbing novel, Spadework is another Timothy Findley winner.",
        "Category": " Fiction , Literary",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.65",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Comrades: Brothers, Fathers, Heroes, Sons, Pals",
        "Authors": "By Ambrose, Stephen E. and Friedman, Jon (ILT)",
        "Description": "Comrades is a celebration of male friendships. Acclaimed historian Stephen Ambrose begins his examination with a glance inward -- he starts this book with his brothers, his first and forever friends, and the shared experiences that join them for a lifetime, overcoming distance and misunderstandings. He next writes of Dwight D. Eisenhower, who had a golden gift for friendship and who shared a perfect trust with his younger brother Milton in spite of their apparently unequal stations. With great emotion, Ambrose describes the relationships of the young soldiers of Easy Company who fought and died together from Normandy to Germany, and he recalls with admiration three unlikely friends who fought in different armies in that war. He recounts the friendships of Lewis and Clark and of Crazy Horse and He Dog, and he tells the story of the Custer brothers who died together at the Little Big Horn. Ambrose remembers and celebrates the friends he has made and kept throughout his life.  Comrades concludes with the author's recollection of his own friendship with his father. \"He was my first and always most important friend,\" Ambrose writes. \"I didn't learn that until the end, when he taught me the most important thing, that the love of father-son-father-son is a continuum, just as love and friendship are expansive.\"",
        "Category": " Literary Collections , Essays",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Ship in bottle adventures",
        "Authors": "By Emmons, Conant H",
        "Description": "",
        "Category": "",
        "Publisher": "Ship in Bottle Press",
        "Price Starting With ($)": "11.05",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Godwrestling― Round 2: Ancient Wisdom, Future Paths",
        "Authors": "By Waskow, Arthur I.",
        "Description": "What do we need to do to turn our                 “religion” into our lives?               This 20th anniversary sequel to a seminal                 book of the Jewish renewal movement deals with spirituality in                 relation to personal growth, marriage, ecology, feminism,                 politics, and more. Including new chapters, Waskow outlines                 original ways to merge \"religious\" life and                 \"personal\" life in our society today.",
        "Category": " Religion , Judaism , General",
        "Publisher": "Jewish Lights",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Buried in Baltimore",
        "Authors": "By Titchener, Louise",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Hard Shell Word Factory",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Bartlett's Familiar Quotations : A Collection of Passages, Phrases, and Proverbs Traced to Their Sources in Ancient and Modern Literature",
        "Authors": "By Bartlett, John, Kaplan, Justin (EDT), and Kaplan, Justin",
        "Description": "First published in 1855 as a small booklet containing a mere 258 pages of quotes by 169 authors, Bartlett's Familiar Quotations has been completely revised and updated for the sixteenth edition by noted Pulitzer Prize-winning biographer Justin Kaplan. Bartlett's gives the reader a vast panorama of the world, from the ancient Egyptians to the latest movie, from the inspirational to the downright funny.In addition to John Bartlett's original criterion that quotations be \"household words,\" Mr. Kaplan has chosen quotes for their \"literary power, intellectual and historical significance, originality, and timeliness.\" Bartlett's, unrivaled as the classic and indispensable reference, mirrors the culture and the changes that have taken place since 1980, when the fifteenth edition was published. It contains many non-traditional sources for quotations; new additions represent television, movies, politics, pop and rock music, advertising slogans, and even street slang.The sixteenth edition contains over 20,000 quotations, representing 2,550 authors, 340 of whom are new to Bartlett's. Although Shakespeare and the Bible are still the most heavily quoted sources, this new edition casts a wider net than its predecessors in broadening Bartlett's cultural base. Newcomers include Russell Baker, Leonard Bernstein, Mel Brooks, Noam Chomsky, Annie Dillard, Elvis, M. F. K. Fisher, Stephen Hawking, Milan Kundera, John Lennon, Norman Mailer, Nelson Mandela, Salman Rushdie, Dr. Seuss, Sun-Tsu, the Talmud, Alice Walker, and Elie Wiesel.Mr. Kaplan, with the assistance of a number of scholars and the Little, Brown editorial staff, has given even the mainstays of Bartlett's close scrutiny. Not only has the general text been considerably revised, the supplementary information in the footnotes has been thoroughly edited and pruned. Several quotations that were formerly in the footnotes have been moved to the main text.In the famous Bartlett's tradition, authors are arranged in chronological order, which illuminates the prevailing influences and ideas surrounding any given quotation. The general index, more than 600 pages long, continues to be an invaluable resource for finding quotations by way of keywords; it has been painstakingly edited to be more accurate and complete.Whether for sheer enjoyment or literary pursuit, for inspiration or adding zest to conversation or a presentation, for research or for the ultimate source for \"Who said that,\" this new edition of Bartlett's is a map through our culture and history.",
        "Category": "",
        "Publisher": "Little & Brown",
        "Price Starting With ($)": "24.48",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "The Herb Companion Wish Book and Resource Guide",
        "Authors": "By McRae, Bobbi A.",
        "Description": "Lists mail order sources; books, newsletters, and videos; national and local organizations; public gardens; and festivals related to herbs and herbiculture",
        "Category": " Gardening , General",
        "Publisher": "Interweave Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Murder Among Friends",
        "Authors": "By Fager, Charles",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Kimo Pr",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "The Oxford Companion to the Mind",
        "Authors": "By Gregory, R. L. (EDT) and Zangwill, O. L. (EDT)",
        "Description": "With over 900 entries, ranging from brief definitions to substantial essays on major topics,The Oxford Companion to the Mind takes the reader on a dazzling tour of this endlessly fascinating subject, spanning many disciplines within the broad compass of philosophy, psychology and the physiology of the brain. An important feature of the book is the large number of articles on \"topics of mental life\", in which well-known writers discuss subjects in which they have a particular expertise. Noam Chomsky writes on his own theory of language, Idries Shah on Sufism, John Bowlby on attachment theory, B.F. Skinner on behaviorism, Oliver Sacks on nothingness, A.J. Ayer on philosophical views of the relation between mind and body, and R.D. Laing on interpersonal experience. The editor, Richard Gregory, contributes entries on aesthetics, phrenology, physiognomy, and illusions of perception.The Companion includes entries on such everyday events as sleep, humor, forgetting, and hearing, as well as specialized topics such as bilingualism, jet-lag, military incompetence, computer chess, and animal magnetism. What can, and all too often does, go wrong with the mind is also covered--many forms of mental illness are explored, as well as mental handicap, brain damage, and neurological disorders. Perception and the ways in which our senses are often deceived are treated in full, as are elements of personal development and learning, and the puzzling world of parapsychology with its altered states of consciousness, out-of-body experiences, and extra-sensory perception. The workings of the nervous system are explained in a special tutorial article.The text is supplemented by brief definitions of specialist terms and by biographies of major figures who have contributed to our understanding of the mind--individuals as varied as Plato, Johannes Kepler, William James, Sigmund Freud, and Alan Turing. The entries are arranged alphabetically and, following the style of other recent Companions, are linked by a network of helpful cross-references. The 160 illustrations have been carefully chosen to amplify the text, while specialist bibliographies provide suggestions for further reading.",
        "Category": " Philosophy , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "The Other Side of Silence: A Guide to Christian Meditation",
        "Authors": "By Kelsey, Morton T.",
        "Description": "A theologian and psychologist presents a rationale for and discusses the method of Christian meditation leading to an encounter with God",
        "Category": " Religion , Meditations",
        "Publisher": "Paulist Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1976"
        }
    },
    {
        "Title": "If God Loves Me, Why Can’t I Get My Locker Open? (Devotionals for Teens)",
        "Authors": "By Peterson, Lorraine",
        "Description": "Brief essays, Bible references, and discussion questions aid teenagers in applying Bible teachings to daily life",
        "Category": " Young Adult Nonfiction , Religion , Christianity",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The New Season: A Spectator's Guide to the 1988 Election",
        "Authors": "By Will, George F.",
        "Description": "Discusses the political patterns of the recent past and suggests what can, and what cannot, be predicted about the near future",
        "Category": " Political Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "The Read-Aloud Handbook (Penguin handbooks)",
        "Authors": "By Trelease, Jim",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Cat Lover's Book of Fascinating Facts",
        "Authors": "By Lucaire, Ed",
        "Description": "Facts and bits of feline trivia provide information on cat owners and their pets, famous cats, superstitions and myths, feline behavior and history, and other curiosities",
        "Category": " Technology & Engineering , General",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "The Time of Illusion",
        "Authors": "By Schell, Jonathan",
        "Description": "An analytical account of the nation's political life and key related events and presidential activities during the Nixon years, ascribing to them a logic, coherence, and meaning not discernable at the time",
        "Category": " History , United States , 20th Century",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1976"
        }
    },
    {
        "Title": "A Ride into Morning: The Story of Tempe Wick",
        "Authors": "By Rinaldi, Ann",
        "Description": "The Revolutionary War is raging. Food and firewood are scarce, and Tempe Wick is worried that she will not be able to care for her ailing mother and her family and still maintain the farm. Her ability to hold on to her world is threatened when a mutinous soldier demands that she lend him her beloved horse in exchange for keeping her brother’s rum-smuggling activities secret from the authorities. This dramatic historical novel is based on a real event that has been popularized into American legend.",
        "Category": " Juvenile Fiction , Historical , General",
        "Publisher": "Gulliver Books Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Send Me Down a Miracle",
        "Authors": "By Nolan, Han",
        "Description": "Things used to be normal in Casper, Alabama. Charity Pittman was a regular fourteen-year-old, the perfect daughter, following in her preacher father's footsteps. But then Adrienne arrived, with her big-city ways and artsy ideas. Reverend Pittman thinks she's the devil incarnate. Charity thinks she's amazing.But no one knows what to think of Adrienne when she claims she's seen Jesus.In the heartening and humorous book that made the National Book Award shortlist, Han Nolan visits a small town that's praying for a miracle but heading for disaster.Reader's guide and an interview with the author included.",
        "Category": " Young Adult Fiction , Religious , Christian , General",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "My War: A Love Story in Letters and Drawings",
        "Authors": "By Sugarman, Tracy",
        "Description": "A firsthand account of the author's experiences as a young naval ensign during World War II presents a rich supply of watercolor paintings, sketches, drawings, and photographs, combined with a narrative that describes life on the front lines, his feelings about being separated from his wife, and the events of the Allied invasion of Europe. 100,000 first printing.",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Dynasty: A Novel",
        "Authors": "By Elegant, Robert S.",
        "Description": "A saga of the rich and powerful Sekloong family, of mixed English and Chinese heritage, each of whose members, from the Boxer Rebellion to the Cultural Revolution, helps to shape the events of his or her day",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "McGraw Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1977"
        }
    },
    {
        "Title": "Piano Lessons: Music, Love, & True Adventures",
        "Authors": "By Adams, Noah",
        "Description": "Piano Lessons is Noah Adams's delightful and moving chronicle of his fifty-second year - a year already filled with long, fast workdays and too little spare time - as he answers at last a lifelong call: to learn to play the piano. The twelve monthly chapters span from January - when after decades of growing affection for keyboard artists and artisans he finally plunges in and buys a piano - through December, when as a surprise Christmas present for his wife he dresses in a tuxedo and, in flickering candlelight, snow falling outside the windows, he attempts their favorite piece of music, a difficult third-year composition he's been struggling with in secret to get to this very moment.Among the up-tempo triumphs and unexpected setbacks, Noah Adams interweaves the rich history and folklore that surround the piano. And along the way, set between the ragtime rhythms and boogie-woogie beats, there are encounters with - and insights from - masters of the keyboard, from Glenn Gould and Leon Fleisher (\"I was a bit embarrassed,\" he writes; \"telling Leon Fleisher about my ambitions for piano lessons is like telling Julia Child about plans to make toast in the morning\") to Dr. John and Tori Amos.As a storyteller, Noah Adams has perfect pitch. In the foreground here, like a familiar melody, are the challenges of learning a complex new skill as an adult, when enthusiasm meets the necessary repetition of tedious scales at the end of a twelve-hour workday. Lingering in the background, like a subtle bass line, are the quiet concerns of how we spend our time and how our priorities shift as we proceed through life. For Piano Lessons is really an adventure story filled with obstacles to overcome and grand leaps forward, eccentric geniuses and quiet moments of predawn practice, as Noah Adams travels across country and keyboard, pursuing his dream and keeping the rhythm.",
        "Category": " Music , General",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "12.96",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Ways & Means (The Esperti Peterson Institute contributory series)",
        "Authors": "By Esperti, Robert",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Acorn Alliance",
        "Price Starting With ($)": "6.24",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Man Who Listens to Horses: The Story of a Real-Life Horse Whisperer",
        "Authors": "By Roberts, Monty and Scanlan, Lawrence (INT)",
        "Description": "Monty Roberts is a real-life horse whisperer--an American original whose gentle training methods reveal the depth of communication possible between man and animal. He can take a wild, high-strung horse who has never before been handled and persuade that horse to accept a bridle, saddle, and rider in thirty minutes. His powers may seem like magic, but his amazing \"horse sense\"  is based on a lifetime of experience. Roberts started riding at the age of two, and at the age of thirteen he went alone into the high deserts of Nevada to study mustangs in the wild. What he learned there changed his life forever.     Monty Roberts has spent his whole life working with horses--schooling them, listening to them, and learning their ancient equine language. In The Man Who Listens to Horses, he tells about his early days as a rodeo rider in California, his problems with his violent horse-trainer father, who was unwilling to accept Monty's unconventional training methods, his friendship with James Dean, his struggle to be accepted in the professional horse-training community, and the invitation that changed his life--to demonstrate his method of \"join-up\"  to the Queen of England.     From his groundbreaking work with horses, Roberts has acquired an unprecedented understanding of nonverbal communication, an understanding that applies to human relationships as well. He has shown that between parent and child, employee and employer (he's worked with over 250 corporations, including General Motors, IBM, Disney, and Merrill Lynch), and abuser and abused, there are forms of communication far stronger than the spoken word and that they are accessible to all who will learn to listen. This inspirational and gentle man, first introduced to the American public on Dateline NBC, is part James Herriot, part Bill Gates, and part John Wayne. And his story is one you will never forget.",
        "Category": " Technology & Engineering , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Second Daughter: Growing Up in China, 1930-1949",
        "Authors": "By Quinn, Terry, Wei, Katherine, and Wei-Sender, Kathie",
        "Description": "China in the 1930s through the 1940s is the setting for this memoir of Wei's girlhood, a life story of family rivalries, unrequited love, jealousy, greed, and courage",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1984"
        }
    },
    {
        "Title": "Love: A User's Guide: A Novel",
        "Authors": "By Naylor, Clare",
        "Description": "Working for Vogue, Amy spends her days dressing waif models in London's latest apparel while fending off insults from the Gucci-garbed staff. Hardly the glamorous job she hoped it would be. But that won't stop her from fantasizing about the jet-set life she knows she's destined for--or the prince who's bound to redeem her from a less than glowing record in romance.However, beneath her dreamy exterior, Amy has a sure streak of common sense. So when the impossible happens--and her path crosses that of London's hottest film star--she swoons with longing, expecting nothing in return. But Orlando Rock has other ideas. For Amy is just the kind of girl he's after--smart and witty, with a penchant for quoting from the classics, different from the daft supermodels and vain leading ladies he's dated before. Or is she? For with fame, fortune, and true love just around the corner, Amy's head is spinning, her jet-fueled imagination poised for takeoff. Is her love for Orlando stronger than her lust for the limelight--or is she merely fated to be the paparazzi's latest prey . . .?Hip and hilarious, this enchanting, sizzlingly sexy tale of a winsome twenty-something caught between romance and reality will have you rooting her on through each outrageous mishap and daring plunge toward love. . . .",
        "Category": " Fiction , Romance , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "The Best of Gourmet 1990 Edition",
        "Authors": "By Gourmet",
        "Description": "An anthology culled from issues of Gourmet magazine features menu plans for intimate and formal entertaining, and recipes for hors d'oeuvres, breads, soups, main dishes, side dishes, sauces, and desserts, as well as special presentations on the foods of specific areas",
        "Category": " Cooking , Methods , Gourmet",
        "Publisher": "Random House",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Husband, Lover, Spy: A True Story",
        "Authors": "By Pennington, Janice and De Abreu, Carlos",
        "Description": "The television hostess recounts her search for her husband, who disappeared while mountain climbing, and may have been working for the CIA",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Custos Morum Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "The Expendables",
        "Authors": "By Scott, Leonard B.",
        "Description": "Follows the lives and deaths of Vinnie, Blake, Eugene, Flynn, and others, during the thirty-five day battle of Ia Drang",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "The Late Night with David Letterman Book of Top Ten Lists",
        "Authors": "By Letterman, David and O'Donnell, Steve",
        "Description": "The popular television personality presents a collection of 175 of his infamous top-ten lists, from Donald Trump's favorite pick-up lines to the top ten rejected Donahue topics",
        "Category": " Humor , General",
        "Publisher": "POCKET",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "King and I",
        "Authors": "By Pritikin, Karin and Barker, Kent (PHT)",
        "Description": "",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Playing from the Heart",
        "Authors": "By Crawford, Roger and Bowker, Michael",
        "Description": "Roger Crawford--the only severely handicapped athlete ever to achieve professional status from the U.S. Professional Tennis Association--tells the inspiring story of his battle to overcome seemingly insurmountable physical obstacles",
        "Category": " Religion , Inspirational",
        "Publisher": "Prima Lifestyles",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "The First Universal Nation",
        "Authors": "By Wattenberg, Ben J.",
        "Description": "Offering a blueprint of the future of the United States, an accessible synopsis of national indicators analyzes the trends and patterns of social, political, demographic, and business life in the nation",
        "Category": " Social Science , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "The Ten Commandments: The Significance of God's Laws in Everyday Life",
        "Authors": "By Schlessinger, Laura and Vogel, Stewart",
        "Description": "Everybody knows the Ten Commandments, right? Let&#39;s see. There&#39;s something about stealing, lying, murdering...ah...but that&#39;s only three...what are the rest? More people claim to live by the Ten Commandments than seem to know what they are, let alone what they mean. And in this modern, jet-propelled, nuclear, genetic-engineered world, how important are they?  Each day we make innumerable decisions about things that don&#39;t really seem earth-shattering in importance. So what if we break a promise? So what if we are married but find passion in another bed? So what if we are too focused on work, TV, or clubs to spend time with family? In The Ten Commandments, Dr. Laura Schlessinger, America&#39;s \"Mommy\" and the conscience of talk radio, reminds is that it is in everyday decisions that we give meaning to our lives or diminish it; and  she shows us why adhering to the higher ideals and consistent morality found in the Commandments can create a life of greater purpose, integrity, value, and lasting joy.  The Ten Commandment&#39;s  are the first direct communication between a people and God. Designed to elevate our lives above mere frantic, animal existence to the sublime levels humanity is capable of experiencing, they are the blueprint of God&#39;s expectations of us and His plan for a meaningful, just, loving, and holy life. Each of the Ten Commandments asserts a principle, and each principle is a moral focal point for real-life issues relating to God, family, sex, work, charity, property, speech, and thought. These principles, and the Commandments they are based upon, are as relevant today as they were in Biblical times.  Written in collaboration with Rabbi Steward Vogel, The Ten Commandments is a modern application of God&#39;s laws, incorporating lively discussion on the Bible and the Judeo-Christian values derived from it. Filled with passion, emotion, and provocative, profound insight. The Ten Commandments will move, enlighten, inspire, educate, and entertain you. You won&#39;t be able to look at  even mundane moments in your life the same way again.  I am the Lord, your God, who has taken you out of the land of Egypt, from the house of slavery  Acceptance of God as the ultimate author of morality and leaning of life.  You shall not recognize the gods of others in My presence  Beware of idolatry. Attaining money, power, stimulation, professional success, and accumulating possessions, while legitimate pursuits, are not the ultimate purpose of life. You shall not take the Name of the Lord, your God, in vain  How we acknowledge or deny God and godliness through our words and deeds. Remember the Sabbath day to sanctify it  Recognize the value of time by refocusing on the most important elements of life; family, obligations to others, prayer, kindness, justice, and decency.  Honor your Father and your Mother  The obligation to parents reinforces the concepts of treating others responsibly in spite of sentiment or situation. You shall not murder  Each human being is the essence of uniqueness, yet equally created in God&#39;s image. Not only can a life by physically taken, but demoralization and humiliation can kill our souls.  You shall not commit adultery  Sexual relations are made special and hole through a consonantal marriage. The honoring of commitments provides the family stability necessary for individual growth and health, community peace, and societal welfare. You shall not steal  Respecting the property and reputation of others provides mutual safety, peace, and prosperity.  You shall not bear false witness against your fellow   While we should keep far from falsehood, knowing when information could or should be shared can make the differences between destroying and helping others. You shall not covet  Desire for the possessions of others destroys relationships and leads us to violate the other Commandments.",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "101 BEST HOME-BASED BUSINESSES FOR WOMEN, 3rd Edition",
        "Authors": "By Huff, Priscilla Y.",
        "Description": "",
        "Category": "",
        "Publisher": "RANDOM HOUSE TRADE @",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "20 Years of Rolling Stone: What a Long, Strange Trip It's Been",
        "Authors": "By Wenner, Jann S. (EDT)",
        "Description": "",
        "Category": " Music , General",
        "Publisher": "Friendly Pr",
        "Price Starting With ($)": "8.14",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Holt McDougal Library, Middle School with Connections: Student Text Lupita Manana 1998",
        "Authors": "By Holt Mcdougal (COR)",
        "Description": "To help her poverty-stricken family, thirteen-year-old Lupita enters California as an illegal alien and starts to work while constantly on the watch for \"la migra.\"",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Holt McDougal",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The Frugal Gourmet Whole Family Cookbook: Recipes and Reflections for Contemporary Living",
        "Authors": "By Smith, Jeff and Wollam, Craig",
        "Description": "Compiles chapters about tempting vegetables for kids, traditional breads, ice cream creations, and food for the elderly, in a volume designed to bring the whole family together around the table. TV tie-in. 400,000 first printing. $300,000 ad/promo. Tour.",
        "Category": " Cooking , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "National Geographic Desk Reference",
        "Authors": "By National Geographic Society",
        "Description": "This meticulously detailed, invitingly readable reference is nothing less than a vivid portrait of our world, packed with information about the Earth and its peoples -- past and present. Highlighted by 300 illustrations, photographs, maps, charts, and diagrams, and presented in an easy-to-use format, it combines an authoritative text by some of America's most renowned professional geographers with the stunning graphics that have been the National Geographic Society's hallmark for more than a century.  The book presents up-to-the-minute facts and definitive figures on each of the planet's 191 nations, but there's much more. A concise history of geography introduces the greatest cartographers and explorers and chronicles the mapmaker's craft as it developed from speculative art to exacting science. A second fascinating section surveys the physical world: the slow, inexorable processes that create continents and oceans, the ceaseless swirl of weather patterns, the evolution of climates and ecologies, and the impact of humankind. Yet another chapter traces Earth's peoples as small, scattered bands of prehistoric hominids transform into great civilizations.  This reference also delves into the roots of language, religion, culture, and technology to show how human ingenuity and the challenges of nature have interacted for millennia to produce the modem world. Finally, an alphabetical, country-by-country overview presents precise, specific data and statistics on everything from political structure to agricultural and industrial production to ethnic, religious, and linguistic makeup.  Boasting some 80 superb maps and over 200 photographs, diagrams, and charts, along with a comprehensive index, an inclusive glossary, and extensive lists of further resources, this is the ultimate geographic reference from the ultimate authority -- the National Geographic Society.  This meticulously detailed, invitingly readable reference is nothing less than a vivid portrait of our world, packed with information about the Earth and its peoples -- past and present. Highlighted by 300 illustrations, photographs, maps, charts, and diagrams, and presented in an easy-to-use format, it combines an authoritative text by some of America's most renowned professional geographers with the stunning graphics that have been the National Geographic Society's hallmark for more than a century.  The book presents up-to-the-minute facts and definitive figures on each of the planet's 191 nations, but there's much more. A concise history of geography introduces the greatest cartographers and explorers and chronicles the mapmaker's craft as it developed from speculative art to exacting science. A second fascinating section surveys the physical world: the slow, inexorable processes that create continents and oceans, the ceaseless swirl of weather patterns, the evolution of climates and ecologies, and the impact of humankind. Yet another chapter traces Earth's peoples as small, scattered bands of prehistoric hominids transform into great civilizations.  This reference also delves into the roots of language, religion, culture, and technology to show how human ingenuity and the challenges of nature have interacted for millennia to produce the modem world. Finally, an alphabetical, country-by-country overview presents precise, specific data and statistics on everything from political structure to agricultural and industrial production to ethnic, religious, and linguistic makeup.  Boasting some 80 superb maps and over 200 photographs, diagrams, and charts, along with a comprehensive index, an inclusive glossary, and extensive lists of further resources, this is the ultimate geographic reference from the ultimate authority -- the National Geographic Society.",
        "Category": " Reference , General",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "7.72",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Asylum",
        "Authors": "By McGrath, Patrick",
        "Description": "Stella Raphael, a woman of great beauty and formidable intelligence, is married to Max, a staid and unimaginative forensic psychiatrist. Max has taken a job in a huge top-security mental hospital in rural England and Stella, far from London society, finds herself restless and bored. Then into her lonely existence comes Edgar Stark, a brilliant sculptor confined to the hospital after killing his wife in a psychotic rage. He comes to Stella's garden merely to rebuild an old, Victorian conservatory, but there's an overwhelming physical attraction to this desperate man that Stella is powerless to ignore. Their explosive affair pits them against Stella's husband, her child, and the entire institution. When the crisis comes, Stella makes her decision - one that will destroy several lives and precipitate an appalling tragedy that could only be fueled by illicit sexual love.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Men Talk: How Men Really Feel About Women, Sex, Relationships, and Themselves",
        "Authors": "By Baraff, Alvin S.",
        "Description": "A guide to how men think about themselves and others takes readers inside twenty-four sessions of an all-male therapy group, presenting the men's progress over six months as they learn to trust the doctor, themselves, and others",
        "Category": " Psychology , General",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "The Joy of Photographing People",
        "Authors": "By Eastman Kodak Co",
        "Description": "",
        "Category": "",
        "Publisher": "Addison-Wesley Publishing Company",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Use Light (Learn photography series)",
        "Authors": "By H. P. Books (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "HP Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "John Hedgecoe's Taking Great Photographs",
        "Authors": "By Hedgecoe, John",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Wallflower: A Janek Novel",
        "Authors": "By Bayer, William",
        "Description": "The murder and sadistic sexual mutilation of his goddaughter in Central Park leads Manhattan detective Frank Janek on the trail of a savage serial killer, a search that leads him to a female psychiatrist with a self-esteem problem that could prove fatal",
        "Category": " Fiction , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "June",
            "Year": "1991"
        }
    },
    {
        "Title": "Now You See Her",
        "Authors": "By Howard, Linda",
        "Description": "From Dream Man to Kill and Tell, Linda Howard's New York Times bestsellers are a tantalizing blend of scintillating sensuality and high-voltage thrills. \"Linda Howard meshes hot sex, emotional impact and gripping tension in this perfect example of what romantic suspense ought to be,\" raved Publishers Weekly in their starred review of Kill and Tell. Now, with a wonderful new pageturner, this daringly original storyteller makes her smashing hardcover debut.  A talented landscape painter and portrait artist in her early thirties, Paris Sweeney has achieved enviable success: her work sells at an exclusive New York City gallery owned by her friend, Candra Worth, and her popularity is at an all-time high. Sweeney, as she is affectionately called by those close to her, loves her work and is content with her life.  Then she begins to notice odd changes: traffic lights turn green when she approaches. Her plants are in full bloom out of season. Perhaps they're jist coincidences, but she can't ignore her dreams -- lush, vivid, and drenched in vibrant hues -- which are influencing her artwork. And she can't deny her growing restlessness....Suddenly, impulsively, Sweeney finds herself unable to resist a night of intense passion with millionaire Richard Worth, Candra's estranged husband. But the true dangers of her all-consuming urges are about to be revealed where Sweeney least expects it: in her paintings.  After a creative frenzy she can barely recall, Sweeney discovers she has rendered a disturbing image -- a graphic murder scene. Against her better instincts, she returns to the canvas time and again, filling out each chilling detail piece by piece -- a shoe, the body of a victim, and soon, the victim's face. But when a shattering, real-life murder mirrors her creation, Sweeney is thrust into suspicious light. Now, with every stroke of her brush, she risks incriminating herself with her inexplicable knowledge of a deadly crime. And every desire -- including her hungry attraction to Richard -- is loaded with uncertainty and terrifying discovery as Sweeney races to unmask a killer.  With the breathless excitement that distinguishes all of her blockbusters of romantic suspense, Linda Howard grips the imagination and touches the heart as only she can in Now You See Her.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Gallery Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Watch Me",
        "Authors": "By Holt, A. J.",
        "Description": "FBI Special Agent Jay (nee Janet) Fletcher is very good at what she does. An agency hacker, Jay can use computers to find out anything about anybody - but she doesn't always go through the proper channels. When Jay blows a murder case by obtaining evidence before she gets a warrant, she's bounced from D.C. to Santa Fe, where helping out on an arson detail is supposed to keep her out of trouble. Missing the power, the thrill, of her old assignment, she practices using her computer tracking system on an ongoing investigation into Santa Fe's own serial killer. To her amazement, her system works - and this time she meets the killer in person, not just on-line. When she discovers that the murderer is hooked into a secret network of people - gruesome killers like himself - who play an all-too realistic computer simulation game, she embarks on a personal quest that takes her far beyond the safe boundaries marked by warrants, Bureau procedure, and due process.Jay's presence on the network has alerted the man who invented this grisly game - a serial killer the Bureau has been hunting for nearly twenty years. Jay and this killer move ever closer toward a shattering confrontation, with Jay's former colleagues close behind them, in one of the most exciting and thought-provoking thrillers to come along in years.",
        "Category": " Fiction , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Wonderful Years, Wonderful Years",
        "Authors": "By Higgins, George V.",
        "Description": "Bucky, who works for a well-known Bay State contractor and will do anything to protect him, is charged with keeping his boss's schizophrenic wife from blowing the whistle on her husband",
        "Category": " Fiction , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "The Anniversary",
        "Authors": "By Canon, Rachel",
        "Description": "She was president of the United States. She was idealistic, charismatic, a winner. And then, suddenly, Melanie Lombard was dead.One year later, on the first anniversary of Melanie's assassination, her best friend, Nora Whitney, finds herself at the center of a political and personal maelstrom. Mysterious \"accidents\" keep occurring; Nora is under pressure from the new president to mobilize Melanie Lombard's on-the-edge political network for his programs; she is shocked to discover that the woman she thought she knew so well may have had a secret life. As Nora struggles to avoid scandal, and searches for the truth, someone tries to love her, even as someone else tries to stop her - permanently.",
        "Category": " Fiction , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Equation for Evil: A Novel",
        "Authors": "By Caputo, Philip",
        "Description": "Equation for Evil examines the anatomy of a horrific crime: a lone gunman, Duane Boggs, has opened fire on a busload of Asian-American children in rural California, then turned the gun on himself after the attack. In response to public outcry, Gabriel Chin, special agent for the California Department of Justice, and forensic psychiatrist Leander Heartwood are ordered to conduct a \"psychiatric autopsy\" of Boggs to determine his motive and state of mind at the time of the attack. Their investigation leads them through Boggs's sordid history, his involvement with white supremacist groups, and his teenage years on the streets.But the trail takes an unexpected turn when they begin to suspect that Boggs was driven by something more than his inner demons. Following hunches, Chin and Heartwood are led to Boggs's half brother and then to Mace Weathers, outwardly a personable college student but in reality a man compelled by inner forces that may be more malevolent than the killer's. With the help of rural sheriff Phil Youngblood, evidence specialist Jean Sheldon, and Joyce DeLuca, a teacher and survivor of the massacre who must come to terms with the horror, Chin and Heartwood set out to unravel what really lay behind the crime. Along the way Chin encounters shocking realizations about his own violence and prejudices, while Heartwood confronts a disturbing truth: There are evils in the human spirit that psychiatry and medicine can neither explain nor cure.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Violet & Claire",
        "Authors": "By Block, Francesca Lia",
        "Description": "This is the story of two girls, racing through space like shadow and light. A photo negative, together they make the perfect image of a girl. Violet is the dark one, dressed in forever black, dreaming Technicolor dreams of spinning the world into her very own silver screen creation. Claire is like a real-life Tinker Bell, radiating love and light, dressing herself in wings of gauze and glitter, writing poems to keep away the darkness. The setting is L.A., a city as beautiful as it is dangerous, and within this landscape of beauty and pain Violet and Claire vow to make their own movie. Together they will show the world the way they want it to be, and maybe then the world will become that place --a place where people no longer hate or fight or want to hurt. But when desire and ambition threaten to rip a seamless friendship apart, only one thing can make two halves whole again--the power of love.Francesca Lia Block's latest novel is a beautifully told story that boldly combines the world of film with the lyrical graceful language of poetry. The voices of two friends -- one dark, one light -- combine to tell a larger tale of love and loss, and the strength that comes from believing in dreams.2000 Quick Picks for Young Adults (Recomm. Books for Reluctant Young Readers)",
        "Category": " Young Adult Fiction , Social Themes , Friendship",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Dr. Bob Arnot's Guide to Turning Back the Clock",
        "Authors": "By Arnot, Bob",
        "Description": "A medical correspondent for CBS News presents his own active lifestyle as an example of how men can enjoy a lifetime of fitness with the most recent information on building healthy muscles, eating right, and having fun. 50,000 first printing. Tour.",
        "Category": " Health & Fitness , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Win, Lose or Die",
        "Authors": "By Gardner, John",
        "Description": "Bond is transferred to sea duty aboard the HMS Illustrious to guard the British, Russian, and American admirals on board, only to have the aircraft carrier captured by terrorists",
        "Category": " Fiction , General",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Inadmissible Evidence",
        "Authors": "By Friedman, Philip",
        "Description": "In this major new novel by the author of the nation-wide bestselling and critically acclaimed Reasonable Doubt, a prosecutor finds that the trial of a lifetime is full of unexpected hazards that will test his courtroom skills to the extreme and make him confront his most deeply felt assumptions about his life and the law.Manhattan prosecutor Joe Estrada is assigned to retry millionaire real-estate developer and community hero Roberto Morales for the brutal rape/murder of his mistress. Estrada, a man of conviction, discovers early on that his case is far weaker than he thought. The trial he thought would make his career could just as easily ruin it.Searching to develop a viable replacement for evidence declared inadmissible when Morales' earlier conviction was reversed, Estrada turns up information that puts him in a hammerlock. Any move he makes will have serious, indeed dangerous, personal and professional consequences.As he searches for a way out of his bind, Estrada must face the prosecutor's ultimate question: Did the man who stands accused actually commit the crime? It is only at the last minute that he discovers the route to the truth. And what he finds is - Inadmissible Evidence.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Types of drama: Plays and essays",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Little & Brown",
        "Price Starting With ($)": "6.83",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The personal computer book",
        "Authors": "By McWilliams, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "Prelude Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Jyl Steinback's Countertop Magician",
        "Authors": "By Steinback, Jyl",
        "Description": "Jyl Steinback shows how to make the most of kitchen appliances. With chapters such as Yearlong Indoor Grilling, Microwave Mania, and Smooth Sailing with Blenders and Food Processors, Countertop Magician can minimize the time spent slaving over a hot stove. At last, a cookbook that not only shows how to get kitchen gizmos in gear-it also has loads of easy healthful recipes to go along with them...",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Little League® Drills and Strategies",
        "Authors": "By McIntosh, Ned",
        "Description": "Suggests drills for hitting, pitching, defense, base running, and pre-game warmups, and discusses parents, training for umpires, managers, and coaches, fund raising, talent evaluation, and winning strategies",
        "Category": " Sports & Recreation , Coaching , Baseball",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Death Below Deck",
        "Authors": "By Kiker, Douglas",
        "Description": "Invited by old flame Bitsy Binford to visit her Cape Cod estate, Mac McFarland stumbles upon the corpse of Bitsy's son-in-law, Peter, a discovery that embroils Mac in a tangled web of dark secrets, greed, scandal, and murder",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "The Wealth of Choices: How the New Economy Puts Power in Your Hands and Money in Your Pocket",
        "Authors": "By Murray, Alan S.",
        "Description": "Taking a postive view of the new economy and offering practical advice on how to exploit it, the author shows ordinary people how to take advantage of the new economy, covering topics ranging from credit cards to college tuition to retirement planning. 60,000 first printing.",
        "Category": " Business & Economics , Personal Finance , Investing",
        "Publisher": "Crown Business",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Eat Away Illness",
        "Authors": "By Carlson Wade",
        "Description": "",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Complete Guide to Videocassette Recorder Operation and Servicing",
        "Authors": "By Lenk, John D.",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "August",
            "Year": "1982"
        }
    },
    {
        "Title": "Upgrading and Repairing PCs",
        "Authors": "By Mueller, Scott",
        "Description": "Includes information from the most basic, such as how to get into a computer, to fairly technical specifications of various components. Generally focuses on determining whether upgrading or repairing is a good idea and if so finding the best way. Includes primary components, input/output hardware, mass storage, system maintenance, troubleshooting, and applications. The accompanying CD-ROM contains searchable versions of six technical books. The explanations and suggestions are applicable to any type and brand of personal computer. Includes a glossary without pronunciation.  No bibliography. New editions have come out frequently since the first in 1988. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Computers , Hardware , Personal Computers , PCs",
        "Publisher": "Que Pub",
        "Price Starting With ($)": "8.61",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Frederic Remington",
        "Authors": "By Peter Hassrick",
        "Description": "",
        "Category": "",
        "Publisher": "Bonanza/Abrams",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Fourth Codex",
        "Authors": "By Houston, Robert",
        "Description": "Quintus Paz, Special Agent for the U.S. Customs Service, searches for a stolen ancient Indian parchment, through Mexico and Latin America and is forced to confront an old love affair, dodge bullets, and battle disgruntled Mayan spirits",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "6.84",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    }
]