[
    {
        "Title": "Lost and Found: A Novel",
        "Authors": "By Parkhurst, Carolyn",
        "Description": "Laura is awakened in the middle of the night by her teenage daughter, Cassie, who has barely spoken a word to her in months. Following Cassie up to her attic room, Laura learns her daughter's shocking secret.Abby's wedding day was one of the happiest of her life, when the shame of her past fell away and she could finally make a fresh start. But lately she has been consumed by doubts. Can she really stay in this marriage?In the glory days of her celebrity, Juliet could barely get out of a limo without flashbulbs going off in her face. Now she's lucky to get the lead role in an infomercial. But Hollywood hasn't seen the last of Juliet Jansen.What do these people have in common?They have all been selected to compete on Lost and Found, the daring new reality show. In teams of two, they will race across the globe - from Egypt to Japan, from Sweden to England - to battle for a million-dollar prize. They must decipher encrypted clues, recover mysterious artifacts, and outwit their opponents to stay in play.But the rigors of competition are not the only challenges. Will Laura be able to heal her fractured relationship with Cassie before she loses her altogether? Will Justin and Abby be able to spread their message of faith, or will their love pale in the limelight? Will Juliet betray her only friend to make her dreams of superstardom come true? And can any of the players keep their most painful secrets hidden even as the show's creators scheme to reveal them to the world?What started as a lark turns deadly serious as the number of players is whittled down, temptations beckon, and the bonds between partners strain and unravel. The question now is not only who will capture the final prize, but at what cost.",
        "Category": " Fiction , Literary",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Summer Lovin' (Costas Sisters, Book 2)",
        "Authors": "By Phillips, Carly",
        "Description": "Zoe's a security specialist and a Costas through and through. Her eccentric, rather dubious family runs an Atlantic City spa that's just this side of legit. So Zoe isn't inclined to trust handsome, charming Ryan Baldwin when he shows up claiming to be related to Sam, the girl the Costas family is about to adopt. But Ryan is Sam's uncle and one of the famously rich and snooty Boston Baldwins.Ryan's search for his sister Faith has led him to news of her death, and to a niece he's never met. But someone else has also tracked Sam down — someone who never wanted the child to be found. Ryan is determined to protect Sam and find out what really happened to his sister. And Zoe \"Whatever-It-Takes\" Costas is just the woman to help him do it&#133;",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HQN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Jim the Boy: A Novel",
        "Authors": "By Earley, Tony",
        "Description": "Capturing the pleasures and fears of youth in America, a new novel by the author of Here We Are in Paradise describes the life of a young boy in a small southern town in the early twentieth century as he begins to explore the confusing adult world that surrounds him and starts to take his own first steps toward maturity. 25,000 first printing.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Setting Free the Bears",
        "Authors": "By Irving, John",
        "Description": "It is 1967 and two Viennese university students want to liberate the Vienna Zoo, as was done after World War II. But their good intentions have both comic and gruesome consequences, in this first novel written by a twenty-five year old John Irving, already a master storyteller.",
        "Category": " Fiction , Literary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "A Tale of Two Cities (Bantam Classics)",
        "Authors": "By Dickens, Charles",
        "Description": "With his sublime parting words, \"It is a far, far better thing that I do, than I have ever done...\" Sidney Carton joins that exhalted group of Dickensian characters who have earned a permanent place in the popular literary imagination. His dramatic story, set against the volcanic fury of the French Revolution and pervaded by the ominous rumble of the death carts trundling toward the guillotine, is the heart-stirring tale of a heroic soul in an age gone mad. A masterful pageant of idealism, love, and adventure -- in a Paris bursting with revolutionary frenzy, and a London alive with anxious anticipation -- A Tale of Two Cities is one of Dickens's most energetic and exciting works.",
        "Category": "",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Sealed with a Kiss (Ty and Hunter, Book 2)",
        "Authors": "By Phillips, Carly",
        "Description": "On the outside, Molly Gifford has it all&#151;a hot legal career and Daniel Hunter, her equally hot boyfriend. But what she really wants is a family. So when she discovers her real father, she doesn't hesitate to pack her bags. Even though it means leaving her old life behind&#151;A year later Daniel Hunter's still trying to get on with his life. Then Molly shows up at his door, begging for help. Her newfound father is under arrest for murder, and she's convinced Hunter is the only attorney with the skill and reputation to get him off.Hunter can't resist helping an innocent man. But this time he'll be the one walking away&#151; even if it breaks both their hearts to do it.&#151;",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "HQN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Summer at Willow Lake (Lakeshore Chronicles, Book 1)",
        "Authors": "By Wiggs, Susan",
        "Description": "Real estate expert Olivia Bellamy reluctantly trades a trendy Manhattan summer for her family's old resort camp in the Catskills, where her primary task will be renovating the bungalow colongy for her grandparents, who want one last summer together filled with fun, friends and family. A posh resort in its heyday, the camp is now in disarray and Olivia is forced to hire contractor Connor Davis &#151; a still-smoldering flame from her own summers at campBut as the days grow warm, not even the inviting blue waters of Willow Lake can cool the passions flaring or keep shocking secrets at bay. The nostalgic joy of summers past breathes new promise into a special place and people&#133;a promise meant to last long after the season ends.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Mira",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "H.R.H.: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "In a novel where ancient traditions conflict with reality and the pressures of modern  life, a young European princess proves that simplicity, courage, and dignity win  the day and forever alter her world. In blue jeans and a pullover, Princess Christianna  is a young woman of her times: born in Europe, educated in America, worried about  the future of the world she lives in, responsible beyond her years.  Christianna  is the only daughter of the Reigning Prince of a European nation that takes its royalty  seriously–and her father has ironclad plans for Christianna’s life, a burden that  is almost unbearable. Now, after four years at Berkeley, life in her father’s palace  cannot distract Christianna from what she sees outside the kingdom–the suffering  of children, the ravages of terrorism and disease.  Determined to make a difference  in the world, she persuades His Royal Highness, her father, to let her volunteer  for the Red Cross in East Africa.  And for Christianna, a journey of discovery, change,  and awakening begins. Under a searing East African sun, Christianna plunges into  the dusty, bustling life of an international relief camp, finding a passion and a  calling among the brave doctors and volunteers.  Finally free from the scrutiny of  her royal life, Christianna struggles to keep her identity a secret from her new  friends and coworkers–even from Parker Williams, the young doctor from Doctors Without  Borders who works alongside Christianna and shares her dedication to healing.  But  as violence approaches and invades the camp, and the pressures of her royal life  beckon her home, Christianna’s struggle for freedom takes an extraordinary turn.   By a simple twist of fate, in one shocking moment, Christianna’s life is changed  forever–in ways she never could have foreseen. From the splendor of a prince’s palace  to the chaos of war-torn nations, Danielle Steel takes us into fascinating new worlds.   Filled with unforgettable images and a remarkable cast of characters, H.R.H. is  a novel of the conflict between old and new worlds, responsibility versus freedom,  and duty versus love.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "The 36 Hour Day: A Family Guide to Caring for Persons with Alzheimer Disease, Related Dementing Illnesses, and Memory Loss in Later Life",
        "Authors": "By Nancy l. Mace, Peter V. Rabins",
        "Description": "",
        "Category": "",
        "Publisher": "Time Warner Book Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Windcatcher (BookFestival)",
        "Authors": "By Avi",
        "Description": "Tony can hardly believe it. He's sailing with the wind, maneuvering through the narrow channels between the offshore islands with amazing skill. And he'sjust learned to sail! But suddenly Tony is confused. Which way had he come? Which way is he headed? And who are the mysterious couple with the high powered motor boat who are to busy searching beneath the water to answer his call for help?Tony does some searching on his own. What he discovers leads him on a daring hunt for a 200-year-old shipwreck . . . and a dangerous confrontation with treasure hunters who will stop at nothing to keep Tony from learning their secret.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Americas: An Anthology",
        "Authors": "By Kincaid, A. Douglas, Rosenberg, Mark B., and Logan, Kathleen (EDT)",
        "Description": "",
        "Category": " History , Latin America , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "Cape Light (Cape Light Series, Book 1)",
        "Authors": "By Kinkade, Thomas and Spencer, Katherine",
        "Description": "Inspired by the beloved artistic vision of world-renowned landscape painter Thomas Kinkade'and imbued with the light of his uplifting message'this heartwarming new novel introduces us to the quaint town of Cape Light, and the unique residents who call it home' Nestled in New England is the picturesque seaside hamlet of Cape Light, where everyone knows everyone, and folks still care about one another. But Cape Lighters have their share of hidden dreams, desires, and doubts, too. Like Mayor Emily Warwick, who sometimes feels that her job and her identity are inseparable, and her sister and rival, Jessica, who has torn herself away from the big city's excitement and sophistication to come home and care for their ailing mother. Or Reverend Ben, who counsels and consoles an entire town while coming to grips with his own private sorrows, and Charlie, the owner of the local diner, who isn't shy about letting the mayor know that he is after her job. They are friends and neighbors, doers and dreamers. They laugh and love and build their lives together in the town of Cape Light'and they will work their way into your heart'",
        "Category": " Fiction , Sagas",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "Refuting Evolution 2",
        "Authors": "By Sarfati, Jonathan and Matthews, Mike",
        "Description": "",
        "Category": " Religion , Religion & Science",
        "Publisher": "Creation Book Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "Miracles On the Water: The Heroic Survivors of a World War II U-Boat Attack",
        "Authors": "By Nagorski, Tom",
        "Description": "An unforgettable story of children in wartime, of heroism at sea, and--above all--of courage and the power of the human spirit.On September 17, 1940, at a little after ten at night, a German submarine torpedoed the passenger liner S.S. City of Benares in the North Atlantic. There were 406 people on board, but the ship's prized passengers were 90 children whose parents had elected to send their boys and girls away from Great Britain to escape the ravages of World War II. They were considered lucky, headed for quiet, peaceful, and relatively bountiful Canada.The Benares sank in half an hour, in a gale that sent several of her lifeboats pitching into the frigid sea. They were more than five hundred miles from land, three hundred miles from the nearest rescue vessel.Miracles on the Water tells the astonishing story of the survivors--not one of whom had any reasonable hope of rescue as the ship went down. The initial \"miracle\" involves one British destroyer's race to the scene, against time and against the elements; the second is the story of Lifeboat 12, missed by the destroyer and left out on the water, 46 people jammed in a craft built and stocked for 30. Those people lasted eight days on little food and tiny rations of drinking water. The survivors have grappled ever since with questions about the ordeal: Should the Benares have been better protected? How and why did they persevere? What role did faith and providence play in the outcome?Based on first-hand accounts from the child survivors and other passengers, including the author's great-uncle, Miracles on the Water brings us the story of the attack on the Benares and the extraordinary events that followed.  Tom Nagorski is currently the Executive Vice President of the Asia Society following a three-decade career in journalism - having served most recently as Managing Editor for International Coverage at ABC News. Nagorski has won eight Emmy awards and the Dupont Award for excellence in international coverage, as well as a fellowship from the Henry Luce Foundation. He lives in Brooklyn with his wife and two children.",
        "Category": " History , Military , World War II",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "Deep South (Anna Pigeon Mysteries)",
        "Authors": "By Barr, Nevada",
        "Description": "The handwritten sign on the tree says it all: REPENT. For Anna Pigeon, this should be reason enough to turn back for her beloved Mesa Verde. Instead she heads for the Natchez Trace Parkway and the promotion that awaits her there. Almost immediately, she finds herself in the midst of controversy: as the new district ranger, she faces resentment so extreme that her ability to do her job may be compromised, and her life may very well be in danger. But all thoughts of personal safety are set aside with the discovery of a young girl's body near an overgrown country cemetery, a sheet around her head, a noose around her neck.The bizarre connection to a best-forgotten past is not the only hurdle Anna must clear in the course of the investigation. Locals reluctant to talk with a northerner - and a woman - hinder her progress; a band of Civil War reenactors questions her motives; and a vicious attack very nearly claims the life of her closest companion. Only when Anna herself is brutally beaten does the puzzle begin to come together. If she can only stay conscious long enough to make the final pieces fit...The kudzu is thick and green, the woods dark and full of secrets. And the ghosts of violence are all too present as Anna struggles for answers to questions that, perhaps, should never be asked.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "India-Culture Smart!: the essential guide to customs & culture",
        "Authors": "By Grihault, Nicki",
        "Description": "Culture Smart! provides essential information on attitudes, beliefs and behavior in different countries, ensuring that you arrive at your destination aware of basic manners, common courtesies, and sensitive issues. These concise guides tell you what to expect, how to behave, and how to establish a rapport with your hosts. This inside knowledge will enable you to steer clear of embarrassing gaffes and mistakes, feel confident in unfamiliar situations, and develop trust, friendships, and successful business relationships.Culture Smart! offers illuminating insights into the culture and society of a particular country. It will help you to turn your visit-whether on business or for pleasure-into a memorable and enriching experience. Contents include:* customs, values, and traditions* historical, religious, and political background* life at home* leisure, social, and cultural life* eating and drinking* do's, don'ts, and taboos* business practices* communication, spoken and unspoken\"Culture Smart has come to the rescue of hapless travellers.\" Sunday Times Travel\"... the perfect introduction to the weird, wonderful and downright odd quirks and customs of various countries.\" Global Travel\"...full of fascinating-as well as common-sense-tips to help you avoid embarrassing faux pas.\" Observer\"...as useful as they are entertaining.\" Easyjet Magazine\"...offer glimpses into the psyche of a faraway world.\" New York Times",
        "Category": " Travel , Asia , India & South Asia",
        "Publisher": "Kuperard",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The Troll Treasure (Ready-For-Chapters)",
        "Authors": "By Vornholt, John",
        "Description": "SORCEROR SHOWDOWN!  Just when all the trials appear to be over for Rollo, the evil sorceror Stygius Rex returns, demanding that the new troll king surrender the lands of Bonespittle to him. As an incentive, Stygius produces Rollo's father and his former bridge mentor as hostages!  The only way to stop Stygius is for the trolls to find a legendary treasure that was created by a troll king long ago and left with the elves in the Great Chasm for safekeeping. Now Rollo must figure out a way to make peace with the elves, find some treasure he isn't sure exists, rescue his father, and defeat Stygius, all the while hoping he can free his little fairy friend Clipper from the evil spell she's under. Will the new troll king ever make it to his coronation?",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Richard Scarry's Hop Aboard! Here We Go!",
        "Authors": "By Scarry, Richard",
        "Description": "Illustrations and text depict the joys of riding in trains, buses, trucks, airplanes, boats, ships, and space vehicles",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Golden Pr",
        "Price Starting With ($)": "6.78",
        "Publish Date": {
            "Month": "July",
            "Year": "1972"
        }
    },
    {
        "Title": "Eamon de Valera: The man who was Ireland",
        "Authors": "By Coogan, Tim Pat",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes Noble",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Annual Editions: Developing World 06/07",
        "Authors": "By Griffiths, Robert J. (EDT)",
        "Description": "This sixteenth edition of ANNUAL EDITIONS: DEVELOPING WORLD provides convenient, inexpensive access to current articles selected from the best of the public press.  Organizational features include: an annotated listing of selected World Wide Web sites; an annotated table of contents; a topic guide; a general introduction; brief overviews for each section; a topical index; and an instructor’s resource guide with testing materials. USING ANNUAL EDITIONS IN THE CLASSROOM is offered as a practical guide for instructors. ANNUAL EDITIONS titles are supported by our student website, www.dushkin.com/online.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "McGraw-Hill/Dushkin",
        "Price Starting With ($)": "5.52",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "The Substitute Teacher (Full House, Michelle)",
        "Authors": "By Dubowski, Cathy East",
        "Description": "Learning that her class will have a substitute teacher, Michelle and her friends plan a ton of pranks and enjoy tormenting the substitute, who retaliates by placing Michelle in charge and then acting like a brat. Original.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Simon Spotlight",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Locomotion",
        "Authors": "By Woodson, Jacqueline",
        "Description": "",
        "Category": "",
        "Publisher": "Speak",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "The Power To Heal : Ancient Arts & Modern Medicine by Rick Smolan (1990) Hardcover",
        "Authors": "By Rick Smolan",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "8.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Lt. Robin Crusoe, U.S.N.",
        "Authors": "By Bill Ford",
        "Description": "",
        "Category": "",
        "Publisher": "Tempo Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Allure: Confessions of a Beauty Editor",
        "Authors": "By Wells, Linda and Allure Magazine (EDT)",
        "Description": "The editor-in-chief of Allure shares an array of beauty tips and tricks from the pages of the popular magazine, covering essential makeup techniques, hair and skin care, anti-aging products, emergency fixes, and how to get the best products for one's money, accompanied by full-color photographs and illustrations, expert advice, and informational sidebars.",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "Bulfinch",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Terror Cruise (Bartlett Brothers Adventure Series)",
        "Authors": "By Elwood, Roger",
        "Description": "Teenage brothers Ryan and Chad and their father, a secret agent for the CIA, are on board a cruise ship when terrorist bombs explode, causing them to call for God's help.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Getting What You Came For: The Smart Student's Guide to Earning an M.A. or a Ph.D.",
        "Authors": "By Peters, Robert L.",
        "Description": "Is graduate school right for you? Should you get a master's or a Ph.D.? How can you choose the best possible school? This classic guide helps students answer these vital questions and much more. It will also help graduate students finish in less time, for less money, and with less trouble. Based on interviews with career counselors, graduate students, and professors, Getting What You Came For is packed with real-life experiences. It has all the advice a student will need not only to survive but to thrive in graduate school, including: instructions on applying to school and for financial aid; how to excel on qualifying exams; how to manage academic politics—including hostile professors; and how to write and defend a top-notch thesis. Most important, it shows you how to land a job when you graduate.",
        "Category": " Study Aids , Graduate School Guides",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "From Baghdad, With Love: A Marine, the War, and a Dog Named Lava",
        "Authors": "By Roth, Melinda and Kopelman, Jay",
        "Description": "Love and hope often arrive in the strangest places and in the strangest ways. During his tour of duty in Iraq, Lt. Colonel Jay Kopelman of the U.S. Marines suffered the emotional ravages common for those involved in the bloody battle for Fallujah. Breaking the strict military rules forbidding pets, Kopelman and his comrades adopted an abandoned puppy left behind after the battle in the dangerous red zone. The dog (named Lava) befriended the marines and journalists, and was eventually smuggled out of Iraq by the soldiers, with the help of NPR reporters, ABC cameramen, Iraqi citizens, and the Iams Pet Food Company.",
        "Category": " Pets , Dogs , General",
        "Publisher": "The Lyons Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "The Nutrition Desk Reference",
        "Authors": "By Somer, Elizabeth and Garrison, Robert H.",
        "Description": "An introduction to the fundamentals of human nutrition explains how they relate to such health-care problems as heart disease, cancer, AIDS, Alzheimer's, and more and discusses the role of antioxidants in disease prevention, phytochemicals, and other key topics. 30,000 first printing. $40,000 ad/promo. IP.",
        "Category": " Health & Fitness , Nutrition",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Berlitz Swahili for Travellers",
        "Authors": "By Berlitz Publishing Company",
        "Description": "",
        "Category": "",
        "Publisher": "Berlitz Guides",
        "Price Starting With ($)": "6.97",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "The Workbook on Virtues and the Fruit of the Spirit",
        "Authors": "By Reisman, Kimberly Dunnam and Dunnam, Maxie D.",
        "Description": "The Workbook on Virtues & the Fruit of the Spirit.This study leads readers to remember that God empowers us for lives of love and mercy and helps us to be the persons we were created to be through focus on daily virtues.",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "The Upper Room",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "A Whole New Ball Game: The Story of the All-American Girls Professional Baseball League",
        "Authors": "By Macy, Sue",
        "Description": "Describes the activities of the members of the AAGPBL, the women's professional league that existed between 1943 and 1954",
        "Category": " Juvenile Nonfiction , Sports & Recreation , General",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Dog Training For Dummies",
        "Authors": "By Volhard, Joachim and Volhard, Wendy",
        "Description": "A well-trained dog is the result of education – actually, more yours than your dog’s. You need to know what makes a dog a dog: how he thinks, reacts, grows, and expresses himself; what his needs are; and most important, why he does what he does. When you understand your dog, you will achieve a mutually rewarding relationship. Dogs aren't homogeneous. Each one is unique, and in their differences lie the challenge.Dog Training For Dummies can help anyone who has just brought home a puppy or is thinking of getting one. Even if you have experience with dog training, you’ll find useful information for a wide variety of dog breeds and personalities. This book is also for you ifYou want your dog to be well behaved – for his sake as well as yours.You have little or no knowledge of proper dog training techniquesYou have done some reading on the subject, but have had limited success with your dog.Your dog is partially trained but needs to learn a few more thingsFind out what it takes to have a well-behaved pooch by recognizing your dog's instinctive behaviors and determining its personality profile. Understand what your expectations are and know how your attitude affects your dog's training. This handy reference guide also covers the following and more:Dealing with barking and chewingCoping with separation anxietyHousetraining a puppyWalking and heelingRetrieving on commandTraining for competitive dog titlesTeaching your dog to be a Companion DogDealing with aggressionUnderstanding your dog's healthGoing to obedience schoolThe important thing about dog training is to get started today. The sooner you train your dog to behave the way you want him to, the sooner the two of you can live in peace together, and the more problems you can prevent down the road. So get going! Your dog will thank you for it.",
        "Category": " Pets , Dogs , General",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Managing Projects in Organizations: How to Make the Best Use of Time, Techniques, and People (Jossey-Bass Management Series)",
        "Authors": "By Frame, J. Davidson",
        "Description": "Sound advice for product, engineering, and service-based organizationsUnlike other project management books that focus on engineering and manufacturing settings, this resource encompasses product, engineering, and service-based organizations. It also covers important new developments in software, outsourcing, quality, and related issues. Much more than a mere checklist of techniques, Managing Projects in Organizations provides you with a sound, overall methodology for dealing with information-age projects. You get advice on overcoming problems at the organizational, team and individual levels, managing human resources, selecting the best team structure,  identifying customer needs, defining project requirements, and managing the inevitable politics every project presents, plus much, much more!",
        "Category": " Business & Economics , Project Management",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "9.24",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Utilization-Focused Evaluation",
        "Authors": "By Patton, Michael Quinn",
        "Description": "The second edition of Patton's classic text retains the practical advice of the original. It shows how to conduct an evaluation in a way that will be useful -- and actually used. Patton has included new stories, new examples, new research findings, and more of his evaluation humour. He adds to the original book's insights into the changes in evaluation during the past decade and incorporates recent research on utilization.",
        "Category": " Social Science , Research",
        "Publisher": "SAGE Publications, Inc",
        "Price Starting With ($)": "6.49",
        "Publish Date": {
            "Month": "May",
            "Year": "1986"
        }
    },
    {
        "Title": "Improving Risk Communication",
        "Authors": "By National Research Council",
        "Description": "Issues addressed include why risk communication has become more difficult in recent decades, what the major problems are, and how common misconceptions often hamper communication campaigns. Cloth edition ($39.95) not seen by  SciTech . Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Technology & Engineering , General",
        "Publisher": "National Academies Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "Our sexuality",
        "Authors": "By Robert Crooks, Karla Baur",
        "Description": "",
        "Category": "",
        "Publisher": "Benjamin/Cummings Pub. Co",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Long Road Home: One Step at a Time",
        "Authors": "By Trudeau, G. B.",
        "Description": "On a road outside Fallujah, an RPG blows apart a Humvee and upends the life of a former football star. As a medevac chopper swoops down, the wounded Guardsman hears \"Not your time, bro. Not today,\" and his remarkable healing journey begins.Thousands of U.S. soldiers have suffered grievous wounds in Iraq, but only one of them is a Doonesbury character. The Long Road Home: One Step at a Time chronicles seven months of cutting-edge cartooning, during which B.D.-and readers of the strip-got an up-close schooling in a kind of personal transformation no one seeks.Deprived not only of leg but also his ubiquitous trademark helmet, B.D. survives first-response Baghdad triage, evacuation to Landstuhl&#39;s surgeon-rich environment, and visits by innumerable morale-boosting celebs, both red and blue in hue. He&#39;s awed in turn by morphine, take-no-guff nurses, his fellow amps, and his family, including the daughter who hand-delivers succor, one aspirin at a time.Transferred stateside to Walter Reed&#39;s Ward 57, B.D. is inspired by the wisdom of physiatrists, warmed by the dedicated ministrations of real-life fellow-amp heroes like Jim the Milkshake Man, and dazzled by high-tech prostheses that cost more than luxury cars. He&#39;s annoyed by his own bouts with self-pity, by the bedside awkwardness of friends more comfortable regarding his stump from e-mail distance, and by Zonk&#39;s unwavering commitment to supplementing his care with organic meds.As their journey continues, B.D. and Boopsie are cared for by Fisher House, a home-next-door-to-the-hospital for families whose lives revolve around therapy. B.D. finds himself painfully engaged in building his future, one sadistically difficult physical therapy session at a time. \"To Lash, Helga, and the Marquis!\" toast the band of differently limbed brethren, raising their glasses to their PT masters as they prepare for reentry into the ambulatory world.From rebuilding tissue to rebuilding social skills to rebuilding lives, B.D&#39;s inspiring, insightful, and darkly humorous story confirms that it can take a village, or at least a ward, to raise a soldier when he&#39;s gone down. \"Thank you for getting blown up,\" offers one of B.D.&#39;s visiting players. Replies the coach, \"Just doing my job.\"",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "14.96",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "I Can Cut and Stick (Usborne Playtime)",
        "Authors": "By Gibson, Ray",
        "Description": "",
        "Category": " Juvenile Nonfiction , Activity Books",
        "Publisher": "Usborne Pub Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Language and Human Behavior (Jessie & John Danz Lectures)",
        "Authors": "By Bickerton, Derek",
        "Description": "According to Bickerton, the behavioral sciences have failed to give an adequate account of human nature at least partly because of the conjunction and mutual reinforcement of two widespread beliefs: that language is simply a means of communication and that human intelligence is the result of the rapid growth and unusual size of human brains.Bickerton argues that each of the properties distinguishing human intelligence and consciousness from that of other animals can be shown to derive straightforwardly from properties of language. In essence, language arose as a representational system, not a means of communication or a skill, and not a product of culture but an evolutionary adaptation.The author stresses the necessity of viewing intelligence in evolutionary terms, seeing it not as problem solving but as a way of maintaining homeostasis - the preservation of those conditions most favorable to an organism, the optimal achievable conditions for survival and well-being.The term protolanguage is used to describe the stringing together of symbols that prehuman hominids employed. \"It did not allow them to turn today's imagination into tomorrow's fact. But it is just this power to transform imagination into fact that distinguishes human behavior from that of our ancestral species, and indeed from that of all other species. It is exactly what enables us to change our behavior, or invent vast ranges of new behavior, practically overnight, with no concomitant genetic changes.\"Language and Human Behavior should be of interest to anyone in the behavioral and evolutionary sciences and to all those concerned with the role of language in human behavior",
        "Category": " Language Arts & Disciplines , Linguistics , General",
        "Publisher": "Univ of Washington Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Beer: A Connoisseur's Guide to the World's Best",
        "Authors": "By Finch, Christopher and Welkerson, D. Phillips",
        "Description": "Briefly traces the history of beer, discusses the brewing process, and describes the beer industry in Europe, the U.S., and other nations",
        "Category": "",
        "Publisher": "Abbeville Pr",
        "Price Starting With ($)": "5.23",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "A Baby Sister for Frances (I Can Read Level 2)",
        "Authors": "By Hoban, Russell and Hoban, Lillian (ILT)",
        "Description": "Frances has a new baby sister . . . and she&#39;s not happy about it.With the new addition to the family, no one pays much attention to Frances anymore. At least that&#39;s the way it seems to her. So Frances decides to run away. Not too far, though—just far enough so she can hear how much she&#39;ll be missed, even by baby Gloria!",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Magic Merry-Go-Round, The (Wonder World Books)",
        "Authors": "By Beers, V. Gilbert",
        "Description": "",
        "Category": "",
        "Publisher": "The Southwestern Company",
        "Price Starting With ($)": "15.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Competitive Strategy: Techniques for Analyzing Industries and Competitors",
        "Authors": "By Porter, Michael E.",
        "Description": "What forces drive competition in an industry? What moves will competitors make? How will one's industry evolve? How do strategic planners respond to competitive actions? How can a firm be best positioned to compete in the long run?  Michael Porter's Competitive Strategy is the definitive work on the subject of \"competitive strategy,\" the hottest new concept in American business today. The book addresses major questions of vital concern to managers, and presents a comprehensive set of analytical techniques for understanding a business and the behavior of its competitors.  Step-by-step, Porter provides the techniques and tools managers need to successfully conduct an industry and competitor analysis. Just a few examples:     The fundamental factors determining the nature of competition in a business.   The three generic competitive strategies for coping with industry structure: cost leadership, differentiation, and \"focus.\"   How to recognize and act on \"market signals\" from competitors.   Forecasting how the structure of an industry will evolve.   The costs, risks, and returns of a \"preemptive\" strategy.   Competing effectively in an emerging industry.   Selecting new industries to enter.    Beginning with a comprehensive set of tools and techniques for analyzing any industry and any array of competitors, the book moves on to examine competitive strategies for fragmented industries, emerging industries, maturing industries, declining industries and global industries. The final section of the book provides analytical techniques for making the important strategic decisions that confront firms -- vertical integration, major capacity expansion, divestment and entry into new businesses.   This book will enable managers to anticipate and prepare for -- rather than simply react to -- sudden competitor moves, new entries into their business, and shifts in industry structure, as well as to take forceful positive action to improve a company's position through tested competitive strategies. Competitive Strategy is destined to become the Bible for Fortune 500 managers, company advisers, and securities analysts.",
        "Category": "",
        "Publisher": "Free Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "The Candy Corn Contest (The Kids of the Polk Street School)",
        "Authors": "By Giff, Patricia Reilly",
        "Description": "It's almost Thanksgiving, and Richard Best can't stop thinking about Ms. Rooney's Candy Corn contest. Whoever can guess the exact number of yellow-and-orange candies in the jar on Ms. Roney's desk gets to keep them all. The only problem is Richard has to read a page in a library book for each guess.Smelly Matthew, who sits in front of him, knows they'll never win. \"We're the worst readers in the class, \" he says. But Richard won't give up. He can already taste those Candy Corns. And before he knows it, he has. Three fat juicy ones.What will Ms. Rooney do when she finds out?",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Islands of Holiness: Rural Religion in Upstate New York, 1790–1860 (Longman Linguistics Library)",
        "Authors": "By Johnson, Curtis D.",
        "Description": "Through an examination of religious life in a typical northern rural locale—Cortland County, New York—from 1790 to 1860, Curtis D. Johnson adds to our understanding of the Second Great Awakening, an intellectual and religious watershed in American history. Offering both quantitative and qualitative analyses of churches' memberships, ideologies, and activities, he maintains that scholars have misunderstood the historical significance of evangelicalism.Johnson contends that these churches did not constitute society, nor were they microcosms of it; rather, they evolved from embattled congregations of the saved—\"islands of holiness\"—to ideologically conservative, organizationally unified, integrated parts of society. He uncovers the many diversities of Protestantism in the form of splits between evangelicals and non-evangelicals, formalists and anti-formalists, Arminians and Calvinists, Old School traditionalists and Oberlin perfectionists, church members and religious society members.At the heart of the revivalistic impulse, he argues, was ideological conflict—primarily between Calvinists and Arminians—with gender politics and internal church dynamics also contributing to the evangelical tumult. With a special interest in the Awakening's impact on congregational life, Johnson focuses on rural community experience to challenge the findings of historians who have concentrated exclusively on urban religious expression. He concludes that the importance of the various factions of evangelicalism lies in their common exhortation to republicanism and reform: these congregations, he says, influenced social change out of proportion to their numbers because activism was a central tenet of their religion.Islands of Holiness is a gem of local history. A meticulously researched book, it makes a valuable contribution to an enduring aspect of the social history of American religious expression.",
        "Category": " Religion , Christianity , History",
        "Publisher": "Fall Creek Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "Nature's Prescription: Foods, Vitamins, and Supplements That Prevent Disease",
        "Authors": "By Frank W. Cawood and Associates (EDT)",
        "Description": "",
        "Category": " Health & Fitness , Naturopathy",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Pal and Sal (Penguin Young Readers, Level 2)",
        "Authors": "By Ogden, Betina (ILT) and Herman, R. A.",
        "Description": "Every day, Billy rides Pal to school. Then Pal waits alone, while Billy plays with his school friends. If only Pal had a friend, too?.Our favorite pony rides again in this easy-to-read sequel to Pal the Pony.R. A. Herman lives in New York City.Betina Ogden lives in Australia.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Hush Money (Spenser Mystery)",
        "Authors": "By Parker, Robert B.",
        "Description": "",
        "Category": "",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Trick or Treat, Little Critter",
        "Authors": "By Mayer, Gina and Mayer, Mercer",
        "Description": "Jack-o-lanterns, masks, and candy make Halloween lots of fun for Little Critter, both at home and at school, but deciding what costume to wear is quite a different story. Reissue.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Halloween",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Handbook for Writers",
        "Authors": "By Millward, C. M.",
        "Description": "",
        "Category": "",
        "Publisher": "Holt; Rinehart; Winston",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Hide-And-seek with Big Bird (Peek-A-Board Books)",
        "Authors": "By Cooke, Tom",
        "Description": "Big Bird doesn't see Grover hiding behind the couch or Bert concealed in a tire, but children will be sure to spot them behind the die-cut peek-a-boo holes",
        "Category": " Juvenile Fiction , Toys, Dolls, Puppets",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Dreaming in Cuban",
        "Authors": "By Garcia, Cristina",
        "Description": "“Impressive . . . [Cristina García’s] story is about three generations of Cuban women and their separate responses to the revolution. Her special feat is to tell it in a style as warm and gentle as the ‘sustaining aromas of vanilla and almond,’ as rhythmic as the music of Beny Moré.”—Time   Cristina García’s acclaimed book is the haunting, bittersweet story of a family experiencing a country’s revolution and the revelations that follow. The lives of Celia del Pino and her husband, daughters, and grandchildren mirror the magical realism of Cuba itself, a landscape of beauty and poverty, idealism and corruption. Dreaming in Cuban is “a work that possesses both the intimacy of a Chekov story and the hallucinatory magic of a novel by Gabriel García Márquez” (The New York Times). In celebration of the twenty-fifth anniversary of the novel’s original publication, this edition features a new introduction by the author.Praise for Dreaming in Cuban “Remarkable . . . an intricate weaving of dramatic events with the supernatural and the cosmic . . . evocative and lush.”—San Francisco Chronicle   “Captures the pain, the distance, the frustrations and the dreams of these family dramas with a vivid, poetic prose.”—The Washington Post   “Brilliant . . . With tremendous skill, passion and humor, García just may have written the definitive story of Cuban exiles and some of those they left behind.”—The Denver Post",
        "Category": " Fiction , Literary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "The Cryptic Clue (Heather Reed Mystery)",
        "Authors": "By Janney, Rebecca Price",
        "Description": "When her neighbor Professor Samra mysteriously disappears, sixteen-year-old Heather Reed tries to find out what has happened to him and discovers a CIA agent involved with terrorists",
        "Category": " Young Adult Fiction , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Mouse Tales (I Can Read Level 2)",
        "Authors": "By Lobel, Arnold",
        "Description": "When Papa's seven little mouse boys ask for a bedtime story, Papa does even better than that—he tells seven stories, one for each boy!This Level Two I Can Read is geared toward kids who read on their own but still need a little help.This sweet bedtime tale is from Arnold Lobel, the beloved author and illustrator of the Newbery Honor and Caldecott Honor award-winning Frog and Toad books.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1978"
        }
    },
    {
        "Title": "Joni",
        "Authors": "By Eareckson, Joni",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1980"
        }
    },
    {
        "Title": "What Janie Found",
        "Authors": "By Cooney, Caroline B.",
        "Description": "Janie’s two families appear to have made peace. Life seems almost normal. She’s even decided to speak to her former boyfriend, Reeve, again. But then Janie’s Connecticut father suffers a sudden stroke, and this tragedy leaves her mother reeling. Janie must step in to manage family finances and to support her mother emotionally. While handling her father’s business matters, Janie discovers the one undeniable fact that could destroy both of her beloved families. And she alone must decide what to do.",
        "Category": " Young Adult Fiction , Mysteries & Detective Stories",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Anastasia, Ask your Analyst",
        "Authors": "By Lowry, Lois",
        "Description": "No one understands thirteen-year-old Anastasia  Krupnic, least of all her parents and her little  brother, Sam, who happens to be a genius. They're  such an embarrassment. Why can't they be normal, like  Anastasia?Then-presto! Anastasia  realizes that she has the problem--not her  relatives--and she must find help immediately. There's  not a moment to lose.Though her  parents insist she's normal and won't send her to an  analyst, that doesn't stop  Anastasia.What will happen if they find out that  Anastasia is secretly telling her troubles to the most  famous analyst in the world?",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Cool it, Carrie (Making Friends, No.2)",
        "Authors": "By Andrews, Kate",
        "Description": "",
        "Category": "",
        "Publisher": "Troll",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Anastasia at your Service (Anastasia Krupnik Series)",
        "Authors": "By Lowry, Lois",
        "Description": "A long, boring summer--that's what Anastasia has to look forward to when her best friend goes off to camp. She's thrilled when old Mrs. Bellingham answers her ad for a job as a Lady's Companion. Anastasia is sure her troubles are over--she'll be busy and earn money!But she doesn't expect to have to polish silver and serve at Mrs. Bellingham's granddaughter's birthday party as a maid! As if that isn't bad enough, she accidentally drops a piece of silverware down the garbage disposal and must use her earnings to pay for it! Is the summer destined to be a disaster?",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "A Jar of Dreams",
        "Authors": "By Uchida, Yoshiko",
        "Description": "Eleven-year-old Rinko grows up in a closely-knit Japanese American family in California during the Depression, a time of great prejudice.",
        "Category": " Young Adult Fiction , Historical , United States , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "All About Sam (Sam Krupnik Series)",
        "Authors": "By Lowry, Lois",
        "Description": "Everyone knows Sam Krupnik. He's Anastasia's pesty but lovable younger brother.This is Sam's big chance to tell things exactly the way he sees them.  He has his own ideas about haircuts, nursery school, getting shots, and not eating broccoli.  Sam thinks a lot about being bigger and stronger, about secret codes and show-and-tell.Make way for your little brother, Anastasia.  Here for the first time is Sam Krupnik's life story.  What a life!",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Help! I'm Trapped in My Sister's Body",
        "Authors": "By Strasser, Todd",
        "Description": "With his on-line pen pal Sumi coming for a visit, Jake Sherman worries because he has led her to believe that he is a star athlete and exchanges bodies with the only athlete in the family, his sister, Jessica, with chaotic results. Original.",
        "Category": "",
        "Publisher": "Apple",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "The Bread Machine Cookbook V: Favorite Recipes from 100 Kitchens (Nitty Gritty Cookbooks)",
        "Authors": "By German, Donna Rathmell",
        "Description": "Readers from across the country present their favorite recipes in this delightful collection. Combined with the best bread-baking tricks and troubleshooting tips, these recipes are perfect for sharing. Each is fully tested on more than 40 makes and models of bread machines.",
        "Category": " Cooking , Courses & Dishes , Bread",
        "Publisher": "Nitty Gritty Cookbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "The Official SAT Study Guide: For the New SAT (tm)",
        "Authors": "By College Board",
        "Description": "In March 2005, the College Board will begin to administer a new SAT®.  To help prepare all students for the new SAT and college success™, the College Board introduces:The Official SAT Study Guide: For the New SAT™Here's the successor to the College Board's #1 best seller 10 Real SAT®s. This new book is the only source of practice tests created by the test maker according to proprietary new SAT specifications. With the book's 700+ pages and 21 chapters, students:o Gain experience by taking 8 practice tests and receiving estimated scores.o Raise confidence by reviewing concepts, test-taking approaches, and practice questions.o Increase understanding of the new PSAT/NMSQT® and the new SAT.Plus, book buyers receive free online score reports and a discount on The Official SATOnline Course™ with auto essay scoring. Changes to the new SAT include:o The name of the current SAT verbal section will be changed to critical reading, analogies will be eliminated and short reading passages will be added to existing long reading passages. o A new section called the SAT writing section will be added, which will contain multiple-choice grammar and usage questions and a student- written essay.o The SAT math section will be expanded to include topics from third-year college- preparatorymath (also known as Algebra II); in addition, quantitative comparisons will be eliminated fromthis section.The Official SAT Study Guide: For the New SAT is part of the College Board's new SAT Readiness Program™ of print, online, and professional development resources.  collegeboard.com/srp.New SAT 2005 NATIONAL EXAM DATES:March 12May 7June 4",
        "Category": " Study Aids , Study Guides",
        "Publisher": "College Entrance Examination Board",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Loch",
        "Authors": "By Zindel, Paul",
        "Description": "",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Little, Brown Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Smith",
        "Authors": "By Garfield, Leon",
        "Description": "\"Leon Garfield is unmatched for sheer, exciting storytelling.\" --Lloyd AlexanderThis brilliant, picaresque novel follows the adventures of an illiterate young ragamuffin known only as Smith. Smith picks the pocket of a stranger, only to witness immediately the strangers murder. Smiths booty from the theft is an Important Document, no doubt worth quite a lot to somebody, which is proved by the pursuit of Smith by two very shady characters. Smith artfully dodges them and winds up in the odd company of a wealthy blind man, who takes Smith into his home and provides him with an education. But this new comfort is lost when Smith himself is suspected of the very murder he witnessed. Smith was a Boston Globe--Horn Book Honor Book, winner of the Phoenix Award, and a Carnegie Honor Book.",
        "Category": " Juvenile Fiction , Historical , Europe",
        "Publisher": "Farrar, Straus and Giroux (BYR)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Kids' Book of Questions",
        "Authors": "By Stock, Gregory",
        "Description": "Now more than ever, parents are told how important it is to talk meaningfully to their kids. This is the book that makes it happen. A revised and expanded second edition, The Kids' Book of Questions, with 634,000 copies in print, makes it easy to ask hard questions and fun to answer them. Questions to challenge, questions to provoke. Questions to entertain and expand young minds. Questions about right or wrong, about fears and hopes, ethics, religious beliefs, about why parents act the way they do--even about ruling the world.Updated to include questions on subjects that have arisen since the book's original publication in 1988--from the internet to issues like school violence and terrorism--the book is a sure way to prod young people into discovering who they really are and what they really believe. There are inquiries into values: \"If you knew you wouldn't get caught, would you cheat on a test by copying someone else's answers?\" Intriguing fantasies: \"If you could email any famous person and know they'd read and answer your note, who would you write to and what would you say?\" Philosophical queries: \"Have you had any personal experiences that lead you to believe in God?\" Provocative scenarios: \"After being given a truth pill, what would you say if you were asked to describe your family?\"Kids, and parents, will be amazed to find how far one little question will lead.",
        "Category": " Juvenile Nonfiction , Philosophy",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "How to Be School Smart (School Survival Guide)",
        "Authors": "By James, Elizabeth, Barkin, Carol, and James, Carol",
        "Description": "These easy-to-understand handbooks How to Be School Smart, How to Write Terrific Book Reports, How to Do your Best on Tests, and How to Write Super School Reports have offered students clear, commonsense advice on how to successfully organize and carry out school assignments for over a decade. Now these great guides have been completely revised to reflect the needs of today's technology-savvy kids.",
        "Category": " Juvenile Nonfiction , Study Aids , General",
        "Publisher": "HarperColl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "The Tale of Troy: Retold from the Ancient Authors (Puffin Classics)",
        "Authors": "By Baynes, Pauline (ILT) and Green, Roger Lancelyn",
        "Description": "Retells the legends of the Trojan War, from the beginning of the quarrel at the marriage of Peleus and Thetis, through the siege and fall of Troy itself, to the wanderings of Odysseus",
        "Category": " Young Adult Fiction , Classics",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Lucy Sullivan Is Getting Married",
        "Authors": "By Keyes, Marian",
        "Description": "What happens when a psychic tells Lucy that she'll be getting married within the year? Her roommates panic! What is going to happen to their blissful existence of eating take-out, drinking too much wine, bringing men home, and never vacuuming?Lucy reassures her friends that she's far too busy arguing with her mother and taking care of her irresponsible father to get married. And then there's the small matter of not even having a boyfriend.But then Lucy meets gorgeous, unreliable Gus. Could he be the future Mr. Lucy Sullivan? Or could it be handsome Chuck? Or Daniel, the world's biggest flirt? Or even cute Jed, the new guy at work?Maybe her friends have something to worry about after all....",
        "Category": " Fiction , Women",
        "Publisher": "Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "The Long Secret",
        "Authors": "By Fitzhugh, Louise",
        "Description": "Harriet spends her summer at the beach town of Water Mill looking for the person who is sending mysterious notes to the townspeople",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Trophy Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Rescue: A Police Story (Police Work Books)",
        "Authors": "By Hart, Alison and Sutton, Dennis (ILT)",
        "Description": "When armed robbers take hostages at a bank in downtown Staunton, Virginia, specialized units within the Police Department coordinate their efforts to diffuse the situation, in a Stepping Stone title that includes reenactment photographs and a police badge sticker. Simultaneous.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Make Your Own Web Page--for Kids!",
        "Authors": "By Evans, Nate (ILT), Price Stern Sloan, Inc., Pedersen, Ted, and Moss, Francis",
        "Description": "Explains how to set up your own website, including guidelines for basic planning and design, help on writing HTML and creating hypertext links, and tips on adding graphics. IBM and MacIntosh compatible instructions.",
        "Category": " Juvenile Nonfiction , Computers , Internet",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Abortion: Toward an Evangelical Consensus",
        "Authors": "By Fowler, Paul",
        "Description": "Describes the arguments on each side of the abortion question, examines the teachings of the Scriptures, and argues that compassion has been a barrier to consensus",
        "Category": " Religion , General",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1984"
        }
    },
    {
        "Title": "Aching for Love: The Sexual Drama of the Adult Child : Healing Strategies for Women",
        "Authors": "By Klausner, Mary Ann and Hasselbring, Bobbie",
        "Description": "Explains how growing up in a dysfunctional family affects an adult woman's sexuality, and discusses actual cases",
        "Category": " Social Science , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "Henry and Beezus (Henry Huggins)",
        "Authors": "By Cleary, Beverly",
        "Description": "Henry wins fifty dollars worth of beauty shop services and finds an ingenious way to convert it into cash for a bicycle.Henry wins fifty dollars worth of beauty shop services and finds an ingenious way to convert it into cash for a bicycle",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1979"
        }
    },
    {
        "Title": "Adam of the Road",
        "Authors": "By Gray, Elizabeth",
        "Description": "",
        "Category": "",
        "Publisher": "Scholastic",
        "Price Starting With ($)": "142.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "The Jaguar's Jewel (A to Z Mysteries)",
        "Authors": "By Gurney, John Steven (ILT) and Roy, Ron",
        "Description": "Help Dink, Josh, and Ruth Rose solve mysteries from A to Z!    Kids love collecting the entire alphabet and super editions! With over 8 million copies in print, the A to Z Mysteries® have been hooking chapter book readers on mysteries and reading for years. Now this classic kid favorite is back with a bright new look!   J is for Jewel . . . New York is the emerald city! Dink’s uncle’s museum there has a new treasure—a golden jaguar statue with an emerald between its paws. But someone swaps the jewel for a fake! Who stole the jaguar’s jewel? Dink, Josh, and Ruth Rose are sure to find out!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Student Study Guide for Biology, 6th Edition",
        "Authors": "By Campbell, Neil A., Taylor, Martha R., and Reece, Jane B.",
        "Description": "",
        "Category": " Science , Life Sciences , Biology",
        "Publisher": "Benjamin Cummings",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Pampered Chef:  All The Best From our Kitchens to Yours",
        "Authors": "By The Pampered Chef",
        "Description": "",
        "Category": "",
        "Publisher": "The Pampered Chef, Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Personal Reminiscences, Anecdotes, and Letters of Gen Robert E Lee",
        "Authors": "By J William Jones",
        "Description": "",
        "Category": "",
        "Publisher": "D. Appleton and Compan;y",
        "Price Starting With ($)": "94.96",
        "Publish Date": {
            "Month": "January",
            "Year": "1875"
        }
    },
    {
        "Title": "Horses",
        "Authors": "By Driscoll, Laura, Roth, Harold, Roth, Harold (PHT), and Lundell, Margo",
        "Description": "Saddle up   for a look at kids' favorite horses&apos;sporting horses, working horses, and   different breeds, too&apos;in this stunning photographic book for the youngest   horse lovers.",
        "Category": " Juvenile Nonfiction , Animals , Horses",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "My Little Pony: Wishes Do Come True!",
        "Authors": "By Capalija, Ann Marie and Fletcher, Lyn (ILT)",
        "Description": "When Twinkle Twirl gives her friends all her party stuff, she realizes she has nothing to wear for herself.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Festival",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Stevie B. Sea Horse: A Tale of a Proud Papa (No. 15 in Suzanne Tate's Nature Series)",
        "Authors": "By Tate, Suzanne and Melvin, James (ILT)",
        "Description": "Tells the story of how Stevie B. Sea Horse takes care of his children",
        "Category": " Juvenile Fiction , Animals , Horses",
        "Publisher": "Nags Head Art, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "A Field Full of Horses: Read and Wonder",
        "Authors": "By Hansard, Peter and Lilly, Kenneth (ILT)",
        "Description": "\"No horsefeathers, this is a surefire bet for young equestrians.\" — BooklistDo you love horses? Do you love the way their noses are silky-soft but bristly too? And the way a horse's tail slowly swishes as he rests in the shade with eyes half-shut? Do you love to see them trot, canter, gallop, buck and rear? Every child who has ever clambered up the back of a pony or dreamed of owning a horse will delight in A Field Full of Horses. Full of interesting facts about horses, this handsome book captures the very essence of horses for the very young.",
        "Category": " Juvenile Nonfiction , Animals , Horses",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Cinderella - First Readers",
        "Authors": "By Retold by Gabby Goldsack",
        "Description": "",
        "Category": "",
        "Publisher": "Parragon Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Sweet and Spooky Halloween (Disney Princess) (Pictureback(R))",
        "Authors": "By Lagonegro, Melissa and Marrucchi, Elisa (ILT)",
        "Description": "Trick or treat! It's Halloween and the Disney Princesses are celebrating this sweet and spooky season! Cinderella carves pumpkins, Ariel dresses up in costume, and Belle explores the creepy corners of the Beast's castle in this 24-page storybook featuring all-new illustrations.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Halloween",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Curious George The Donut Delivery (CGTV 8x8)",
        "Authors": "By Perez, Monica and Fallon, Joe",
        "Description": "Curious George adds a few extra zeroes to his donut order and doesn’t realize just how big his delivery problem is going to become. This paperback picture book explores the concepts of zero and counting by tens.",
        "Category": " Juvenile Fiction , Animals , Apes, Monkeys, etc.",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Hand, Hand, Fingers, Thumb (Bright & Early Board Books)",
        "Authors": "By Perkins, Al and Gurney, Eric (ILT)",
        "Description": "Illus. in full color. A madcap band of dancing, prancing monkeys explain hands, fingers, and thumbs to beginning readers.",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Baby Animals (Touch and Feel)",
        "Authors": "By Dorling Kindersley, Inc. (COR)",
        "Description": "Invites young readers to find out how baby rabbits, elephants, ducklings, calves, and gorillas must feel to the touch",
        "Category": " Juvenile Nonfiction , Animals , General",
        "Publisher": "DK Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Afghan Favorites",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Needlecraft Shop",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Gardening Naturally: A Guide to Growing Chemical-Free Flowers, Vegetables, and Herbs",
        "Authors": "By Reilly, Ann",
        "Description": "Tells how to fertilize a garden naturally, discusses natural insect and disease control, and describes the care requirements of popular flowers, vegetables, and herbs",
        "Category": " Gardening , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Bones: A Forensic Detective's Casebook",
        "Authors": "By Scammell, Henry and Ubelaker, Douglas H.",
        "Description": "Dr. Ubelaker is curator of anthropology at the Smithsonian and regular consultant in forensic anthropology for the FBI laboratories. His collaboration with Scammell has produced a casebook written with verve, without sacrificing science. The two authors convey a substantial amount of anthropological information along with a view into the methods of those who piece together puzzles for a living, whether they be murder or anthropological mysteries. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Social Science , Criminology",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "650 Best Selling Home Plans",
        "Authors": "By",
        "Description": "",
        "Category": " House & Home , House Plans",
        "Publisher": "Garlinghouse Co",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "How to Think Like Leonardo da Vinci: Seven Steps to Genius Every Day",
        "Authors": "By Gelb, Michael J.",
        "Description": "Michael Gelb's How to Think Like Leonardo Da Vinci is an inspiring and inventive guide that teaches readers how to develop their full potential, using the principles of Da Vincian thought identified by the author. Beginning with a brief historical biography of Da Vinci and an overview of the astounding advances made in the arts and sciences during the Renaissance, Gelb illustrates the seven fundamental elements of Da Vinci's thought process:Questionare: A questing, insatiably curious approach to life Dimostrazione: A commitment to test knowledge through experience Sensazione: The continual refinement of the senses, especially sight, as the means to clarify experience Sfumato: A willingness to embrace ambiguity, paradox and uncertainty Arte/Scienza: The development of the balance between science and art, logic and imagination. \"Whole-brain\" thinking Corporalita: The cultivation of ambidexterity, fitness and poise Connessione: A recognition and appreciation for the interconnectedness of all things and phenomena. \"Systems\" thinking.Loaded with practical exercises, quotes, sidebars, illustrations and material drawn directly from Da Vinci's personal notebooks, How to Think Like Leonardo Da Vinci is both a tribute to his great achievements and a call to carry on his legacy in our everyday lives by utilizing our potential to the best of our ability.",
        "Category": " Self-help , Creativity",
        "Publisher": "Delacorte Press",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Walking in Circles Before Lying Down: A Novel",
        "Authors": "By Markoe, Merrill",
        "Description": "Dawn Tarnauer’s life isn’t exactly a success story. Already twice divorced, the young Californian is too busy job-hopping to start a career, her current boyfriend insists on living “off the grid,” her Life Coach sister perpetually interferes with incomprehensible affirmations, her eccentric mother is busy promoting the culmination of her life’s work: The Every Holiday Tree, and her father is ending his brief third marriage while scheduling two dates for the same night. Dawn’s only source of security and comfort, it seems, is Chuck, a pit-bull mix from the pound. So, when her boyfriend announces that he’s leaving her for another woman, a despairing Dawn turns to Chuck for solace. “I should have said something sooner,” Chuck confides, as he tries to console her. “Couldn’t you smell her on his pants?” Dawn is stunned. It’s one thing to talk to your pets, but what do you do when they start talking back? It’s not just Chuck, either; she can hear all dogs–and man’s best friend has a lot to say. The ever-enthusiastic Chuck offers his tried-and-true advice on the merits of knocking over garbage and strewing it everywhere, auxiliary competitive peeing etiquette, and the curative powers of tossing a ball. Doubtful of her own sanity, Dawn considers that, in the ways of life and love, it might be better to trust Chuck’s doggie instincts instead of her own. Filled with sharp wit, biting humor, and canine conversation that would make Doctor Dolittle’s jaw drop, Merrill Markoe’s engaging, cleverly written novel is about the confusing search for love and the divine acts of dog.From the Hardcover edition.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2007"
        }
    },
    {
        "Title": "Joy of Gardening Cookbook",
        "Authors": "By Chesman, Andrea, Ballantyne, Janet, and Rankin, Dottie",
        "Description": "Presents harvesting tips, quick preparation and cooking techniques, and recipes for vegetable dishes featuring garden produce at its seasonal best",
        "Category": " Cooking , Reference",
        "Publisher": "Storey Publishing, LLC",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Increasing Student Learning Through Multimedia Projects",
        "Authors": "By Simkins, Michael (EDT)",
        "Description": "Addressed to K-12 teachers, discusses enhancing student achievement through project-based learning with multimedia and offers principles and guidelines to insure that multimedia projects address curriculum standards.",
        "Category": " Education , Computers & Technology",
        "Publisher": "ASCD",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Mystery of the Cross",
        "Authors": "By Hume, Basil Cardinal",
        "Description": "",
        "Category": " Religion , Spirituality",
        "Publisher": "Paraclete Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    }
]