[
    {
        "Title": "Observations from the Bar",
        "Authors": "By Nash, Leslie Ann",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "10.41",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Monterey Bay: Ultimate Guide: The Ultimate Guide From Santa Cruz to San Simeon",
        "Authors": "By Jaconette, Lucinda",
        "Description": "Covers a broad range of attractions found in the stretch of California's Central Coast bounded by the Monterey Bay National Marine Sanctuary, including walking and driving tours, day trips, outdoor recreation, accommodations, restaurants, flora, fauna, and history. Annotation c. by Book News, Inc., Portland, Or.",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Feminist Theory: The Intellectual Traditions of American Feminism",
        "Authors": "By Donovan, Josephine",
        "Description": "Traces the development of the American feminist movement, looks at important leaders and theorists, and describes the influence of Marxism, Freud, and existentialism",
        "Category": "",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "World without trees",
        "Authors": "By Lamb, Robert,",
        "Description": "",
        "Category": "",
        "Publisher": "Paddington Press : distributed by Grosset & Dunlap",
        "Price Starting With ($)": "6.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Nationalism and Development in Africa: Selected Essays",
        "Authors": "By Coleman, James Smoot and Sklar, Richard L. (EDT)",
        "Description": "James Smoot Coleman was the leading theorist of his time in African political studies. His work fused liberal-democratic idealism and scientific realism. These essays represent the evolution of his thought from deep insight into African nationalism to a refined theory of modernization. The collection is an indispensable contribution to the intellectual history of comparative African politics, essential to scholars and others who grapple with problems in African development.",
        "Category": " History , Africa , General",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "The Pardoner's Tale",
        "Authors": "By Wain, John",
        "Description": "Parallel tales of two men, each enthralled by women who exert unexpected power over them, center around a good samaritan who rescues a drowning woman and a novelist who visits a dying fan",
        "Category": " Fiction , General",
        "Publisher": "The Viking Press",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "April",
            "Year": "1979"
        }
    },
    {
        "Title": "Social studies for the preschool-primary child",
        "Authors": "By Seefeldt, Carol",
        "Description": "",
        "Category": "",
        "Publisher": "Merrill",
        "Price Starting With ($)": "6.28",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Whitewater VI",
        "Authors": "By McBriarty, Douglas",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Walker & Co",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Lincoln Steffens (Modern literature monographs)",
        "Authors": "By Stinson, Robert",
        "Description": "Reappraising the journalistic and autobiographical works of the early-twentieth-century social critic, Stinson views Steffen's writings as works of literary art and underscores the importance of viewing journalism as a legitimate part of serious literature",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Ungar Pub Co",
        "Price Starting With ($)": "7.97",
        "Publish Date": {
            "Month": "December",
            "Year": "1979"
        }
    },
    {
        "Title": "Scientific American: Triumph of Discovery : A Chronicle of Great Adventures in Science (Henry Holt Reference Book)",
        "Authors": "By Scientific American",
        "Description": "Commemorating 150 years of Scientific American, the world's premier science magazine, Triumph of Discovery is a tour of the past century and a half of scientific innovation and discovery. Nearly fifty new essays created especially for this book by some of the world's best-known and highly respected scientific thinkers address subjects of both topical and historical interest profiled over the life of Scientific American.Beautifully illustrated in color throughout, with decade-by-decade chronologies of important scientific and historical events, Triumph of Discovery is a fascinating celebration of the advancement of science and technology over the last 150 years and a fitting tribute to the contribution Scientific American has made to our understanding of these disciplines.",
        "Category": " Science , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Biology: An Introduction (Benjamin/Cummings series in the life sciences)",
        "Authors": "By Johnson, Kenneth D.",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Benjamin-Cummings Pub Co",
        "Price Starting With ($)": "7.53",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "When It's Your Turn to Decide",
        "Authors": "By Belgum, David",
        "Description": "",
        "Category": "",
        "Publisher": "Augsburg Fortress Pub",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "NBA Basketball Offense Basics",
        "Authors": "By Vancil, Mark",
        "Description": "Discusses the importance of offense to the game of basketball, analyzing dribbling, passing, shooting, rebounding, and team play.",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Cruickshank's Photographs of Birds of America",
        "Authors": "By Cruickshank, Allan D.",
        "Description": "Great ornithologist, photographer presents 177 closeups, groupings, panoramas, flightings of about 150 different birds. Expanded Wings in the Wilderness. \"...can only be described as superb...At twice the price, this marvelous book would be a bargain.\" ? The Florida Naturalist. \"The most magnificent bird photographs in the world...\" ? Commonweal.",
        "Category": " Photography , History",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "Why War? Ideology, Theory, and History (Campus)",
        "Authors": "By Nelson, Keith L and Olin, Spencer C.",
        "Description": "\"Instead of proposing another theory of war, their goal is a more modest one of raising the theoretical consciousness of historians. Specifically, they argue that &#39;1) ideology does influence theory, 2) historians do have ideologies as well as theories . . . about which they are not always conscious or consistent, and 3) we can better understand, compare, and evaluate what historians are saying when we comprehend their ideological and theoretical perspectives.&#39; They attempt then, to classify historical interpretations of war according to their ideological/ theoretical orientations, however covert.\" --Perspective \"Nelson and Olin .. . are concerned with enhancing history&#39;s social utility by advancing its capacity to produce generalizations that can explain or predict events and are subject to empirical testing. Their exploration of historical generalization focuses on an issue itself of the highest importance, the causes of war; but their aim is also to create a model for historical generalization applicable to other issues. They argue that to understand generalizations in history, one must recognize their roots in theory, and that historians&#39; theories in turn proceed from their own ideologies. To demonstrate, they survey theories about the causes of war that have come out of conservative, liberal, and radical ideologies. . . . any historian will profit from this rigorous approach to the problem.\" --Choice \"Learned and suggestive, this book clarifies much of what is already known, and points toward new ways of understanding.\"--Library Journal",
        "Category": " Political Science , History & Theory",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "6.09",
        "Publish Date": {
            "Month": "August",
            "Year": "1980"
        }
    },
    {
        "Title": "AFRICA (A Touchstone book)",
        "Authors": "By Ungar, Sanford J.",
        "Description": "Focusing on South Africa, Kenya, Nigeria, and Liberia, and including virtually every African country",
        "Category": " History , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Penchants and Places: Essays and Criticism",
        "Authors": "By Leithauser, Brad",
        "Description": "In his first collection of essays and criticism, the celebrated poet and novelist focuses on subjects exceptionally close to his heart. He considers the ghost story as a literary form and through the prism of two of its prominent practitioners - Henry James and M. R. James. He writes about the spiritual world of Flannery O'Connor, the alternate universe of Salman Rushdie's Satanic Verses, the mind of H. G. Wells. He brilliantly makes clear for the layperson the possibilities of computer chess and the future of thinking machines, and acquaints us with the biographies of three mathematical geniuses - Niels Bohr, Werner Heisenberg, and India's Ramanujan.He also writes about two countries he's lived in and feels passionate about - introducing us to Japan through essays on recently published books by Tanizaki, Kobo Abe, and Murakami; and to Iceland with an homage to Independent People by the Nobel Prize-winning Halldor Laxness, the novel Leithauser calls the \"book of my life.\"Provocative, witty, thoughtful, Leithauser's new book has the power to kindle and ignite our interest in the uncommon people, places, and things that deeply engage him.",
        "Category": " Literary Criticism , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "58.61",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "God Said It, Don't Sweat It: How to Keep Life's Petty Hassles from Overwhelming You",
        "Authors": "By Warren, Neil Clark",
        "Description": "It's the little things that make a difference, especially when it comes to leading a worry-free life.  Instead of getting bogged down in frustration and annoyance let the wisdom of the apostle Paul keep you on a steady course.  From being the first one to forgive to learning to see difficult situations through the eyes of faith.  100 biblical principles give you tried and true ways to live life more fully, effectively, and joyfully.",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson Pub.",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Simple to Sew Needlepoint",
        "Authors": "By More, Hilary",
        "Description": "",
        "Category": "",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Selections from the Book of Psalms: Authorized King James Version (Pocket Canons)",
        "Authors": "By Pocket Canons",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Grove Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Choices in Healing: Integrating the Best of Conventional and Complementary Approaches",
        "Authors": "By Lerner, Michael",
        "Description": "a rare and remarkable guidebook for cancer patients and health professionals, providing a comprehensive overview of the available choices, both in treatment and in living with cancer. Lerner objectively presents detailed explanations and evaluations of a wide range of complementary therapy programs, including spiritual and psychological approaches, nutritional therapies, physical therapies, pharmacological therapies, and traditional medicines from around the world. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Health & Fitness , Diseases , Cancer",
        "Publisher": "The MIT Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Forgotten Children of the AIDS Epidemic (Yale Fastback Series)",
        "Authors": "By Geballe, Shelley, Gruendel, Janice, and Andiman, Warren (EDT)",
        "Description": "\"Mommy, why can`t the doctors make you better?\"...\"You won`t be there, will you? Who`ll take care of me?\"—Rachel, age 5 AIDS breaks the rules of dying. It strikes the young rather than the old, decimating families and devastating communities. It will leave as its legacy a generation of orphans—traumatized by multiple losses, isolation, stigma, and grief. By the turn of the century, more than a hundred thousand children and youth in the United States—and ten million worldwide—will lose their parents to AIDS.Written by professionals in medicine, law, social work, anthropology, psychiatry, and public policy, this volume is the first full-length look at the issues facing children whose parents and siblings are dying of AIDS: what children experience, how it affects them, how we can meet their emotional needs and help them find second families, how we counter the stigmas they face. Authors explore ways to promote resilience in these AIDS-affected children. Stories of the children and their caretakers, told in their own words, are woven throughout.Pioneering and practical, the book presents an action agenda and resource directory for our nation`s policymakers as well as for parents and those who work with children in both formal and informal settings. This book is produced in conjunction with a video, Mommy, Who`ll Take Care of Me? Forgotten Children of the AIDS Epidemic, which will be shown on PBS and is also available from Yale University Press.",
        "Category": " Political Science , Public Policy , Social Services & Welfare",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "To a Distant Island: 2",
        "Authors": "By McConkey, James",
        "Description": "In 1890 Anton Chekhov - thirty and already a famous writer - left his home and family in Moscow to travel 6,500 miles across Russia, over frozen land and sea, by train, ferry, and troika, to visit the island of Sakhalin, a penal colony off the coast of Siberia.",
        "Category": " Fiction , Historical",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Eventide",
        "Authors": "By Haruf, Kent",
        "Description": "One of the most beloved novels in recent years, Plainsong was a best-seller from coast to coast—and now Kent Haruf returns to the High Plains community of Holt, Colorado, with a story of even more masterful authority.When the McPheron brothers see Victoria Roubideaux, the single mother they’d taken in, move from their ranch to begin college, an emptiness opens before them—and for many other townspeople it also promises to be a long, hard winter. A young boy living alone with his grandfather helps out a neighbor whose husband, off in Alaska, suddenly isn’t coming home, leaving her to raise their two daughters. At school the children of a disabled couple suffer indignities that their parents know all too well in their own lives, with only a social worker to look after them and a violent relative to endanger them further. But in a small town a great many people encounter one another frequently, often surprisingly, and destinies soon become entwined—for good and for ill—as they confront events that sorely test the limits of their resilience and means, with no refuge available except what their own character and that of others afford them. Spring eventually does reach across the land, and how the people of Eventide get there makes for an engrossing, profoundly moving novel rich in the wisdom, humor, and humanity for which Kent Haruf is justly acclaimed.",
        "Category": " Fiction , Psychological",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.54",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "How to Find and Buy Your Business in the Country",
        "Authors": "By Kirkpatrick, Frank",
        "Description": "Describes the advantages and disadvantages of rural life, explains how to evaluate businesses and communities, and offers advice on financing, insurance, and business planning",
        "Category": "",
        "Publisher": "Garden Way Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "Laura Ashley Bedrooms",
        "Authors": "By Irvine, Susan",
        "Description": "Illustrates how to adapt such different bedroom design schemes as Rustic, Period, and Romantic to today's homes and offers detailed information on choosing accessories",
        "Category": "",
        "Publisher": "Harmony",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Games Calculators Play",
        "Authors": "By Wallace Judd",
        "Description": "",
        "Category": "",
        "Publisher": "Warner Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Green Fuse: An Ecological Odyssey",
        "Authors": "By Harte, John and Kamp, Len (ILT)",
        "Description": "A widely respected ecological scientist and activist draws on the poet's image and his own environmental research to demonstrate the many interconnections among the world's ecosystems. John Harte takes us from Alaskan salmon runs and the Florida everglades to South Pacific coral reefs and the bleak Tibetan plateau. The result is that rare book that bridges the cultures of science and art. Lyrical, vivid portraits of natural wonders and the threats to them are combined with precise scientific accounts of natural processes and their disturbances. The Green Fuse will show nonscientists the fascination of ecological detective work and renew scientists' love for the beauty of the world under their microscopes.Harte's stories illuminate, without sermonizing, the damage to natural systems brought about by technological hubris and calculated political ruthlessness. \"The green fuse\" symbolizes the basic unity behind natural diversity. But a fuse may also be the weak link in an overloaded system or the slow burning wick on an ecological bomb. As The Green Fuse reminds us, the energies that created human liberation from nature can also be those that lead to the human destruction of nature.",
        "Category": " Science , Life Sciences , Biology",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Loner",
        "Authors": "By Johnston, Joan",
        "Description": "",
        "Category": "",
        "Publisher": "Dell Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Ordinary Time: Cycles in Marriage, Faith, and Renewal",
        "Authors": "By Mairs, Nancy",
        "Description": "A New York Times Notable Book of the Year 1993An unconventional spiritual autobiography, told in a remarkable, outspoken voice and rooted in the messy realities and questions—the 'ordinary time'—of one woman's life, from infidelity to living with multiple sclerosis, to death, to renewing a marriage.",
        "Category": " Literary Criticism , General",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Ruined By Reading: A Life in Books",
        "Authors": "By Schwartz, Lynne Sharon",
        "Description": "\"Without books how could I have become myself?\" In this wonderfully written meditation, Lynne Sharon Schwartz offers deeply felt insight into why we read and how what we read shapes our lives. An enchanting celebration of the printed word.\"This slender rhapsody on the joys of reading will be gobbled up like the rarest and finest chocolates.\" -Jonathan Yardley, The Washington Post",
        "Category": " Biography & Autobiography , Literary Figures",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "African American Women in Congress: Forming and Transforming History",
        "Authors": "By Gill, Laverne McCain",
        "Description": "Shirley Chisholm, the first Black woman in the U.S. House of Representatives, was elected in 1968. That was nearly a hundred years after the election of the first African American man to Congress and fifty years after the first woman. A quarter of a century after Chisholm's election, the first Black woman, Carol Moseley-Braun, was elected to the United States Senate. It was not until 1993, when ten additional Black women won seats in the 103rd Congress, that African American women were allowed to serve their country and their constituencies in any substantial numbers. In 1997 that historic moment will very likely be lost as congressional districts are redrawn by court order. This remarkable book by LaVerne Gill preserves the history of the struggles and accomplishments of these fifteen courageous women, and will move others to learn from and follow their example.African American Women in Congress details the life and career histories of Shirley Chisholm, Barbara Jordan, Yvonne Burke, Cardiss Collins, Katie Hall, Eleanor Holmes Norton, Maxine Waters, Barbara-Rose Collins, Carol Moseley-Braun, Corinne Brown, Carrie Meek, Cynthia McKinney, Eva Clayton, Eddie Bernice Johnson, and Sheila Jackson-Lee. Each profile contains a picture of its subject, interview material, and resumés. Arranged chronologically, the book introduces the reader to issues of vital importance to the Black community—Reconstruction, enfranchisement, lynchings and harassment, civil rights struggles, the founding of advocacy groups, the power of the Congressional Black Caucus, the creation of majority minority districts that allowed greater representation in Congress, the struggle of largely Black Washington, D.C., for representation, and the recent dismantling of past gains by a Republican majority. Gill also describes the uphill battles for social justice and the rights of women that the fifteen women had to wage even within their own political parties, political organizations, and districts.For general readers, high school and college students, and anyone interested in the political process, this book is illuminating and inspiring reading.",
        "Category": " Political Science , American Government , Legislative Branch",
        "Publisher": "Rutgers Univ Pr",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "We Write for Our Own Time: Selected Essays from Seventy-Five Years of the Virginia Quarterly Review",
        "Authors": "By Burnham, Alexander (EDT)",
        "Description": "In 1925, Edwin A. Alderman, president of the University of Virginia, fulfilled a long-held dream by establishing a magazine at the institution founded by Thomas Jefferson just over one hundred years earlier. Not only did Alderman initiate publication of the Virginia Quarterly Review, he contributed an essay to its inaugural issue.Appearing as the first selection in this new volume of nonfiction from the VQR, Alderman's \"Edgar Allan Poe and the University of Virginia\" reflects the rare combination of literary sensibility and immersion in the political and social issues of the day, which has characterized the journal throughout its seventy-five-year history. As Alderman writes, \"I may be frank and say that there was a time when Poe did not greatly appeal to me. I felt the sheer, clear beauty of his song..., but his detachment from the world of men, where my interests most centered, left me unresponsive and simply curious.... I have come, however, to see the limitations of that view, and to behold something admirable and strange and wonderful in this proud, gifted man.\"While the style and diction of the contributions have changed in the years since that first spring issue, a similar clarity of thought, deep intelligence, candor, and command of language can be found in every one of the fifty one essays assembled here by Alexander Burnham. From its home at One West Range, a few doors down from Poe's own room, the VQR has welcomed to its pages scholars such as Dumas Malone and Robert Coles, and writers whose books have become international bestsellers, including Arthur C. Clarke and Frances Mayes.Included here are some of the twentieth century's most brilliant thinkers and stylists, such international literary, political, and intellectual figures as Andre Gide, D. H. Lawrence, Aldous Huxley, Evelyn Waugh, T. S. Eliot, Eleanor Roosevelt, Thomas Mann, Jean-Paul Sartre, Bertrand Russell, and Robert Graves. George F. Kennan muses on \"The Experience of Writing History,\" Henry Steele Commager asks \"Do We Have a Class Society?,\" and Edmund S. Morgan considers the aloof character of George Washington. Carlos Baker tracks Ezra Pound through Venice, and Scott Donaldson ponders \"The Jilting of Ernest Hemingway.\" These leading lights share space, as they do in every volume of the journal, with lesser-known but no less talented writers ruminating on the Battle of the Bulge, the Berlin Wall, the Bomb, and Vietnam, on growing up in Hollywood and living in Charlottesville, Virginia.Writers of the South are fittingly represented by Thomas Wolfe, Mary Lee Settle, and Louis D. Rubin Jr., but a quick scan of the table of contents reveals that the VQR has never been a regional magazine. As the current editor, Staige D. Blackford writes in his preface, \"Since its inception, the Virginia Quarterly Review has tried to offer its readers a variety of essays on a variety of topics ranging from foreign affairs to domestic politics, from literature to travel, from sports to sex, from music to medicine.\"On the occasion of its seventy-fifth anniversary, We Write for Our Own Time amply and entertainingly reflects what the VQR's masthead has always proclaimed as its identity: \"A National Journal of Literature and Discussion.\"",
        "Category": " Literary Criticism , Books & Reading",
        "Publisher": "University of Virginia Press",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "The Great Land: Reflections on Alaska",
        "Authors": "By Hedin, Robert A. (EDT) and Holthaus, Gary (EDT)",
        "Description": "Takes readers whale watching, glacier viewing, and visiting the town of Cordova in the wake of the great Exxon Valdez oil spill. More than a scenic tour, it offers observations of the Aleuts by a Russian Orthodox priest, remembrances of changing lifeways by a young Eskimo, and recollections of the first white explorers by a 120-year-old Athabaskan woman. It features contributions by visiting naturalists John Muir and Edward Hoagland, literary views from John Dos Passos, and contributions by native Alaskans whose names are not as well known but who know their land and their neighbors as no outsider can.",
        "Category": " Travel , United States , West , Pacific (AK, CA, HI, OR, WA)",
        "Publisher": "University of Arizona Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "Changing Channels: Television and the Struggle for Power in Russia",
        "Authors": "By Mickiewicz, Ellen",
        "Description": "New in paperbackRevised and expandedDuring the tumultuous 1990s, as Russia struggled to shed the trappings of the Soviet empire, television viewing emerged as an enormous influence on Russian life. The number of viewers who routinely watch the nightly news in Russia matches the number of Americans who tune in to the Super Bowl, thus making TV coverage the prized asset for which political leaders intensely—and sometimes violently—compete. In this revised and expanded edition of Changing Channels, Ellen Mickiewicz provides many fascinating insights, describing the knowing ways in which ordinary Russians watch the news, skeptically analyze information, and develop strategies for dealing with news bias.\t Covering the period from the state-controlled television broadcasts at the end of the Soviet Union through the attempted coup against Gorbachev, the war in Chechnya, the presidential election of 1996, and the economic collapse of 1998, Mickiewicz draws on firsthand research, public opinion surveys, and many interviews with key players, including Gorbachev himself. By examining the role that television has played in the struggle to create political pluralism in Russia, she reveals how this struggle is both helped and hindered by the barrage of information, advertisements, and media-created personalities that populate the airwaves. Perhaps most significantly, she shows how television has emerged as the sole emblem of legitimate authority and has provided a rare and much-needed connection from one area of this huge, crisis-laden country to the next. \tThis new edition of Changing Channels will be valued by those interested in Russian studies, politics, media and communications, and cultural studies, as well as general readers who desire an up-to-date view of crucial developments in Russia at the end of the twentieth century.",
        "Category": " Performing Arts , Television , General",
        "Publisher": "Duke University Press Books",
        "Price Starting With ($)": "5.62",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "American Spectator's Enemies List: A Vigilant Journalist's Plea for a Renewed Red Scare",
        "Authors": "By O'Rourke, P. J. (EDT)",
        "Description": "Written with the same acerbic wit and infectious humor that has made P. J. O'Rourke one of the most popular political satirists of all time, The Enemies List will keep you howling and his enemies scowling. From Noam Chomsky to Yoko Ono, from Peter, Paul, and Mary (yes, they're still alive) to all the people who think quartz crystals cure herpes, from Ralph Nader to the entire country of Sweden, P. J. O'Rourke has created a roster of the most useless, politically disgraceful, and downright foolish people around. Although a rating system of S=Silly, VS=Very Silly, SML=Shirley MacLaine was ultimately cast aside, the distinguishing feature of the cluster of dunces presented here is silliness, not political subversion. The Enemies List began as an article in the American Spectator and, as readers contributed their own suggestions, quickly grew into a hilarious and slashing commentary on politicians and celebrities alike. Now they have been named, we just need to figure out what to do with them. \"To say that P. J. O'Rourke is funny is like saying that the Rocky Mountains are scenic - accurate but insufficient.\" - Chicago Tribune",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Atlantic Monthly Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Morne-Payson: A Peasant Village in Martinique",
        "Authors": "By Horowitz, Michael M.",
        "Description": "",
        "Category": "",
        "Publisher": "International Thomson Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1967"
        }
    },
    {
        "Title": "ATM and Multiprotocol Networking",
        "Authors": "By Sackett, George C. and Metz, Christopher Y.",
        "Description": "",
        "Category": " Computers , Data Transmission Systems , Broadband",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Kurt Wolff: A Portrait in Essays and Letters",
        "Authors": "By Schneider, Deborah Lucas (TRN) and Ermarth, Michael (EDT)",
        "Description": "Kurt Wolff (1887-1963) was a singular presence in the literary world of the twentieth century, a cultural force shaping modern literature itself and pioneering significant changes in publishing. During an intense, active career that spanned two continents and five decades, Wolff launched seven publishing houses and nurtured an extraordinary array of writers, among them Franz Kafka, Lou Andreas-Salomé, Boris Pasternak, Günter Grass, Robert Musil, Paul Valéry, Julian Green, Lampedusa, and Anne Morrow Lindbergh.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Women's Health -- Missing from U.S. Medicine (Race, Gender, & Scie)",
        "Authors": "By Rosser, Sue V.",
        "Description": "\"... an important book for all women. It fosters an awareness that physicians may lack adequate knowledge to diagnose and treat women appropriately, and that greater attention must be paid to women's health concerns.\" -- American Women in Science Magazine\"This fine critical analysis and thorough literature review of androcentrism in medicine is very highly recommended... \" -- Choice\"... a timely account about the historical fact that women are the forgotten gender in health and mental health research.\" -- Science Books and Film\"... Rosser's reasoned critique is quite digestable and competently frames the key issues facing medical educators charged with improving their focus on women's health.\" -- Academic MedicineThe male-centered focus of clinical research has led to the inattention to and underfunding of women's diseases, the exclusion of women from experimental drug trials, and the failure to understand the health of the elderly, most of whom are female. Sue Rosser critiques male-focused medical research and health care practice and explores how medical education could make women's health and well-being share the attention of the medical profession.",
        "Category": " Medical , General",
        "Publisher": "Indiana University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "The Kindness of Sisters: Annabella Milbanke and the Destruction of the Byrons",
        "Authors": "By Crane, David",
        "Description": "An original account, revolutionary in technique, examining the character of the great Romantic poet Lord Byron through the lives and deadly rivalry of the two women he left behind.The heart of David Crane's account is the lifelong feud between Augusta - Byron's half sister with whom he had a passionate affair - and Annabella, his society wife, both of whom bore him daughters. Crane reimagines the famous meeting between the two women years after Byron's death, a chillingly dramatic scene through which he explores the emotional and sexual truths that lay at the center of these tragic relationships. In the encounter between the two women - one in chronic ill health, the other dying - we have the ultimate display of their mutual obsession with the memory and compulsive influence of Byron that makes their story that of the Romantic Age itself.It is a story full of dubious motives, especially Annabella's \"saving\" of Augusta and her child, Medora, and her twisted revenge on them both. And as the curses of incest and abuse play themselves out in the fates of Byron's daughters, we see their lives assuming the shape of Greek tragedy.In the meeting of the two women and the consequences of their battle, Crane shows us the Romantic Age in its terrible collision with the new world of the Victorians. The Kindness of Sisters establishes Crane as a biographer of formidable gifts.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Fuzzy Math: The Essential Guide to the Bush Tax Plan",
        "Authors": "By Bush, George W. and Krugman, Paul R.",
        "Description": "Economist Paul Krugman analyzes the Bush and other tax proposals, showing who wins, who loses, and how quickly the tax cuts will consume the surplus. He argues that although the tax cut might not be a matter of economic life or death, it has become a central political issue that has a distorting effect on the debate on other issues and discourages crusaders from telling the truth about their own proposals. He also maintains that reporters and TV commentators don't understand the basics about the federal government and that they, together with politicians, have confused the public. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Business & Economics , Taxation , General",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Help for Dyslexic Children",
        "Authors": "By Miles, T. R. and Miles, Elaine",
        "Description": "Offers guidance for parents and teachers on instructing dyslexic children in the basic skills of reading, spelling, and arithmetic",
        "Category": " Education , General",
        "Publisher": "Routledge",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "Doctor Who: Four to Doomsday (The Doctor Who Library, Book 77)",
        "Authors": "By Dicks, Terrance",
        "Description": "After Doctor Who materializes on an alien spaceship, the Monarch commander of the ship, offers to replicate the doctor as an android",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Target / W. H. Allen",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1983"
        }
    },
    {
        "Title": "Queen Elizabeth II",
        "Authors": "By Campbell, Judith",
        "Description": "Illustrated with more than one hundred photographs, this portrait of Elizabeth II from her birth to the Silver Jubilee offers insights into the balance she has successfully maintained between her public and private life",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "5.92",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Berries: A Cookbook",
        "Authors": "By Berkley, Robert",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Shadow : Five Presidents and the Legacy of Watergate",
        "Authors": "By Woodward, Bob",
        "Description": "A New York Times Notable Book of the YearTwenty-five years ago, after Richard Nixon resigned the presidency, Gerald Ford promised a return to normalcy. “My fellow Americans, our long national nightmare is over,” President Ford declared. But it was not. The Watergate scandal, and the remedies against future abuses of power, would have an enduring impact on presidents and the country. In Shadow, Bob Woodward takes us deep into the administrations of Ford, Carter, Reagan, Bush and Clinton to describe how each discovered that the presidency was forever altered. With special emphasis on the human toll, Woodward shows the consequences of the new ethics laws, and the emboldened Congress and media. Powerful investigations increasingly stripped away the privacy and protections once expected by the nation's chief executive. Shadow is an authoritative, unsettling narrative of the modern, beleaguered presidency.",
        "Category": " History , World",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Something Worth Doing: The Sub-Arctic Voyage of Aqua Star",
        "Authors": "By Chopra, Judith Wright",
        "Description": "On May 18, 1985, pursued by a heavy spring rain, Leslie Sike's meticulously crafted steel cutter, Aqua Star, slipped out of Toronto's harbor on the first leg of the voyage to Churchill, Manitoba, on the western shore of the treacherous Hudson Bay. Sike, an adventurer with a yearning to make the record books, had discovered that since Hudson himself, only oceangoing tankers and fishing trawlers had plowed through the bay's wind-whipped and iceberg-studded expanses. He vowed to be the first to sail across the bay, and so began Aqua Star's sub-Arctic adventure.Sike and his wife, Carolann, whose sailing experiences went no further than dinghy lessons on Calgary's Glenmore Reservoir and correspondence courses on navigation, dedicated all of their energy and resources to making their unlikely dream come true. As Sike completed the building of the 41-foot steel yacht, Carolann set out to attract media attention and sponsorship. They found an eager crew in Gay Currie, an experienced sailor who signed on as cook, and David Farr, a nonsailor who undertook to photograph the voyage.For the outdoor enthusiast, Something Worth Doing is an exciting and unusually candid adventure story that records, in the sailors' own words, their exceptional journey, and captures, in vivid full-color photographs, the remote beauty of northern Canada.",
        "Category": " Sports & Recreation , Boating",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Wales and the War of the Roses",
        "Authors": "By Evans, H. T.",
        "Description": "A new edition of the 1915 classic, long unavailable. Evans' study focuses on \"the struggle between Lancaster and York from the standpoint of Wales and the Marches\". Use is made of Welsh poets as sources, and a chapter on their validity as evidence is included, as well as essays on the principal players in the wars and their connections with Wales and the Welsh.",
        "Category": " History , General",
        "Publisher": "Sutton Publishing Ltd",
        "Price Starting With ($)": "5.48",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "Daw 30th Anniversary Science Fiction Anthology (Daw Book Collectors)",
        "Authors": "By Wollheim, Elizabeth R. (EDT) and Gilbert, Sheila E. (EDT)",
        "Description": "In honor of the thirtieth anniversary of DAW Books, a remarkable anthology of short fiction by some of science fiction's most important authors features works by Brian Stableford, Ron Goulart, C. J. Cherryh, Brian Aldiss, Tad Williams, Robert Sheckley, C. S. Friedman, and other notables.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "DAW Books",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Recasting Autobiography: Women's Counterfictions in Contemporary German Literature and Film (Reading Women Writing)",
        "Authors": "By Kosta, Barbara",
        "Description": "\"How did we become the way we are?\" The question that haunts Christa Wolf's autobiographical work Patterns of Childhood has prompted many other writers and filmmakers to examine their identities as postwar German women. In one of the first books to address the New German Cinema from a feminist perspective, Barbara Kosta looks closely at two autobiographical films; Helma Sanders-Brahms's Germany, Pale Mother and Jutta Bruckner's Years of Hunger, and at two books, Ruth Rehmann's Der Mann auf der Kanzel: Fragen an einen Vater (The man in the pulpit: Questions for a father,) and Wolf's Patterns of Childhood. In different ways, Kosta shows, these works of the 1970s and 1980s have recast traditional autobiography, offering fresh characters in new roles exploring innovative forms of expression, and confronting long-repressed themes such as the devaluation of the female voice and the horror of Germany's fascist past.Kosta perceives in autobiographies by German women a conflict between the need to accept their sociocultural heritage and the desire to uncover and respond to its destructive aspects. As they struggle to redefine relationships among family, history, and self, Wolf and Rehmann write of the psychic structures, that were shaped by a childhood under the Third Reich in their films, Sanders-Brahms and Bruckner, who grew up after the war, explore issues of gender relations as well as re-enacting German history. For all four, Kosta demonstrates, autobiography is at once a process of remembering and working through national and personal trauma, a task of mourning and healing, and an act of self-invention.",
        "Category": " Literary Criticism , General",
        "Publisher": "Cornell University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1994"
        }
    },
    {
        "Title": "Goldmine Roots of Rock Digest",
        "Authors": "By Goldmine Magazine (EDT)",
        "Description": "",
        "Category": " Music , General",
        "Publisher": "Krause Pubns Inc",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Working family's kitchen guide",
        "Authors": "By Kennedy, Sheila",
        "Description": "",
        "Category": "",
        "Publisher": "distributed to the book trade in the U.S. by Scribner",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Gardens of Williamsburg",
        "Authors": "By Colonial Williamsburg Foundation",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Colonial Williamsburg Foundation",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1979"
        }
    },
    {
        "Title": "The Nutcracker",
        "Authors": "By Thomson, Sarah L. and Hague, Michael",
        "Description": "Adventure, fantasy, romance...a world full of toys and sweets...and, of course, Christmas&#151;these are the hallmarks of this timeless story, brought theatrically to life by one of America's favorite illustrators. It is the unforgettable dream of a peculiar Christmas gift&#151;a nutcracker that leads a young girl into a magical realm, where she boldly helps save a boy living under an evil curse. This elegant retelling combines E. T. A. Hoffman's original version with beloved elements of the ballet in a readable picture book format.Michael Hague, celebrated for his lavish interpretations of classics, now makes this tale accessible to a new generation. From the sweeping drama of the battle scene to the magnificent illusions of rich, draped fabrics, every detail will be cherished.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "SeaStar",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Mars: Uncovering the Secrets of the Red Planet",
        "Authors": "By Raeburn, Paul and Golombek, Matthew P. (FRW)",
        "Description": "Unimaginably distant, and yet at the same time the most Earthlike of the planets, Mars has exerted a powerful pull on the human imagination for thousands of years. It mesmerized the millions who watched as the small robot known as Sojourner explored its faraway surface from July to September 1997.  Now, with a definitive book on this compelling subject, National Geographic presents a state-of-the-art report on the planet itself, the technology that allows us to explore it, and the prospects for further exciting discoveries. Highlighted by an astonishing collection of more than 125 full-color photographs, Mars includes a stunning, 3-dimensional, 8-page panoramic gatefold with images that capture the genuine wonder of discovery at the Pathfinder landing site.",
        "Category": " Science , Astronomy",
        "Publisher": "National Geographic",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Toward a New Psychology of Women",
        "Authors": "By Miller, Jean Baker",
        "Description": "In the twenty years since its publication, this best-selling classic (which has sold more than 200,000 copies) has become famous for its groundbreaking demonstration of how sexual stereotypes restrict men's and women's psychological development. Toward a New Psychology of Women revolutionized concepts of strength and weakness, dependency and autonomy, emotion, success, and power.",
        "Category": " Psychology , Social Psychology",
        "Publisher": "Beacon Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Cries of the Spirit",
        "Authors": "By Sewell, Marilyn (EDT)",
        "Description": "Gathers readings, poems and prose by women, includes works by Maya Angelou, Alice Walker, Joyce Carol Oates and others",
        "Category": "",
        "Publisher": "Beacon Press, 1991",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "London",
        "Authors": "By Russell, John",
        "Description": "",
        "Category": " History , Europe , Great Britain",
        "Publisher": "Abradale/Abrams",
        "Price Starting With ($)": "6.38",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Lung Cancer Chronicles",
        "Authors": "By Meyer, John A.",
        "Description": "Along with information on the diagnosis, treatments, and prognosis of lung cancer, the author offers stories of people he has treated in order to bring the warning of the dangers of smoking down to a more personal level",
        "Category": " Health & Fitness , General",
        "Publisher": "Rutgers University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "Complete Rottweiler",
        "Authors": "By Freeman, Muriel",
        "Description": "",
        "Category": " Technology & Engineering , General",
        "Publisher": "Howell Book House",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "Cop: A True Story",
        "Authors": "By Middleton, Michael L.",
        "Description": "What's it like to sit in the front seat of a patrol car, cruising darkened city streets, when the radio crackles to life and sends you down an alley to a \"robbery in progress,\" the outcome of which you can't possibly predict? What's it like to knock on a crack-house door, service revolver drawn, not knowing who - or what - is behind it? What's it like, heart pounding in your chest, to stare down the barrel of a gun pointed straight at you by a murderously high suspect?Cop shows you what it's like. It's the explosive story of Sergeant Michael Middleton, a now-retired veteran of the LAPD and survivor of what may be the most brutal urban war zone in the country. From handling the call to his first homicide as a rookie cop to making his last collar, Middleton's story is a nerve-shattering, eyewitness account of life on America's meanest streets. In his two decades on the force, he investigated more than 20,000 felony crimes, was at the scene of nearly 600 murders - including those of five officers killed in the line of duty - and made over 3,000 arrests.In Cop, Middleton writes urgently and knowingly of those years on the streets. It's a pulse-quickening - and often heartbreaking - insider's view of life as a foot soldier in America's war on crime. With the threat of violence never far away, Middleton and his fellow officers daily faced drug dealers, desperate addicts, thieves, gun-crazy gangs, rapists, and murderers. And in telling the riveting stories of these encounters, Middleton uses them to make larger points - which will often surprise and shock you - about good, evil, heroism, racism, and more.Gripping, poignant, and brutally honest, Cop is an unforgettable portrait of life as a police officer on urban America's mean and gritty streets.",
        "Category": " True Crime , General",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Baseball: The Fan's Game",
        "Authors": "By Cochrane, Gordon S.",
        "Description": "",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Society for Amer Baseball",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Reasons Why Skeptics Ought to Consider Christianity",
        "Authors": "By McDowell, Josh",
        "Description": "",
        "Category": "",
        "Publisher": "Here's Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Easy-Care Landscape Plans: 41 Professional Designs for Do-It-Yourselfers",
        "Authors": "By Roth, Susan A., Ireland-Gannon Associates (COR), Lang, Susan, Skibinski, Ray (EDT), and Susan A. Roth & Company (COR)",
        "Description": "Presents front and backyard landscape plans for a variety of homes, and lists regional plants for each area",
        "Category": " Gardening , Landscape",
        "Publisher": "Home Planners",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Art of Accompaniment: Making Condiments",
        "Authors": "By Brooks, Jeffree Sapp",
        "Description": "Provides recipes for vinegars, oils, dressings, mustards, pickels, chutneys, sauces, marinades, preserves, syrups, and fruit butters",
        "Category": " Cooking , General",
        "Publisher": "North Point Pr",
        "Price Starting With ($)": "37.58",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "Almost Innocent",
        "Authors": "By Bosworth, Sheila",
        "Description": "Clay-Lee Calvert is the love child of two people who are as beautiful as models in a magazine but whose similarity ends there. Her father, Rand, is an artist - easygoing, dreamy, principled, and chronically jobless. Her mother, Constance, is the blue-blooded, pampered, delicate but determined daughter of a state supreme court justice. How their intense passion for each other plays out against the sumptuousness and decay of 1950s New Orleans is something to which no innocent should be privy.In Sheila Bosworth's mesmerizing first novel, the era, the place, the people, of Clay-Lee's childhood all form an air as real as our own pasts, alternately dim and indelible, where everyone bears some guilt, and all are almost innocent.",
        "Category": " Fiction , General",
        "Publisher": "LSU Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Sandra Gustafson's Great Eats Paris",
        "Authors": "By Gustafson, Sandra",
        "Description": "Savvy travelers trust Sandra Gustafson for real finds and great value when eating and sleeping abroad. Completely revised, with new maps and more detailed neighborhood coverage, these beloved guides offer first-time and veteran visitors alike in-the-know tips on the best-priced places to eat and stay in the City of Light--each revisited or newly discovered for these new editions. Proven favorites in this popular series, Sandra's lively, detailed, and personal reviews combine to create the essential travel guide and the perfect companion for anyone in search of the out-of-the-way, unusual, fun, and true flavor of Paris. With practical advice on transportation, reservations, holidays, and even shopping tips, here's the ticket to discovering Paris at its best.",
        "Category": " Travel , Europe , France",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Notorious & Notable New Englanders",
        "Authors": "By Stevens, Peter F.",
        "Description": "",
        "Category": " Biography & Autobiography , Cultural, Ethnic & Regional , General",
        "Publisher": "Down East Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "A Still and Icy Silence (Stuart Mallory Mystery Series)",
        "Authors": "By Roat, Ronald Clair",
        "Description": "As Lansing, Michigan, private eye Stuart Mallory prepares to close his office, he is propelled into a case involving fraud, arson, graft, and murder",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Story Line Press",
        "Price Starting With ($)": "17.96",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Athenais: The Life of Louis XIV's Mistress, the Real Queen of France",
        "Authors": "By Hilton, Lisa",
        "Description": "Athenais de Montespan reigned as official mistress to Louis XIV during the most glorious period of \"the splendid century.\" As lovely and charming as she was witty and cunning, Athenais quickly rose to far greater prominence than the King's own spouse. It was Madame de Montespan who was known as \"the real Queen of France,\" the symbol of the apotheosis of French culture in the seventeenth century. As a lover, she risked the disgrace of adultery to conduct an affair that scandalized Europe; as a patron, she supported many of the leaders of the cultural renaissance; as a mother, she is the ancestor of most of the royal houses of Europe.In her superb new biography, Lisa Hilton chronicles the life of this extraordinary woman. She vividly describes Athenais's unhappy marriage to a gamester nobleman, her entry into the decadent and intricate world of court politics, and her brilliant seduction of France's most desired suitor, the King himself. Athenais transformed Louis from a shy, awkward young monarch into the polished Sun King of legend.Throughout the \"age Montespan,\" Athenais used her wit and beauty to stave off the intrigues of courtiers, the machinations of Versaille's clerics, and the wiles of lovely young pretenders to the King's heart - all doggedly seeking to unseat her. It was not until the Affair of the Poisons, a bizarre witch-hunt that uncovered conspiracy in the highest echelons of the nobility, that Athenais's hold on the King and court faltered. Though the mystery remains unsolved, Athenais's implication in the sinister dealings of sorcerers and poisoners caused a fall from grace almost as precipitous as her rise.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Little, Brown and Company",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Christmas Every Day",
        "Authors": "By Howells, William Dean, Evans, Richard Paul, and Dimarco, Gina (ILT)",
        "Description": "\"'Here is a charming Christmas tale. Read this to your little one.' I took the book from her outstretched arm and examined the title, Christmas Every Day by William Dean Howells.\"So wrote Richard Paul Evans in his bestselling The Christmas Box, which captivated millions of readers across America, awakening hearts to the often forgotten true meaning of Christmas.Now, at last, here is the delightful story that is central to The Christmas Box: Christmas Every Day by William Dean Howells. In this engaging tale, written in 1892, a little girl begs her father for a new Christmas story, and he lovingly obliges. These precious moments, shared by parents and children throughout the years, are here for all of us to treasure in Christmas Every Day.Lavishly illustrated, this deluxe edition enchances the timeless appeal of Howells' classic for a new generation of parents and children.",
        "Category": " Fiction , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "I'm New Here",
        "Authors": "By Howlett, Bud",
        "Description": "Jazmin Escalante arrives in California from El Salvador with her family, and although she speaks no English, through perseverance she is accepted into the fifth grade and begins to make friends.",
        "Category": " Juvenile Nonfiction , School & Education",
        "Publisher": "Houghton Mifflin Books for Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Elizabeth II: 40 Glorious Years",
        "Authors": "By McGowan, Helene",
        "Description": "A grand album records the life and achievements of the queen who modernized the role of the royal family through more than one hundred photographs by famed royal photographers.",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Grills & Greens: Recipes for Salads and Sandwiches",
        "Authors": "By Zimmerman, Linda and Gilliland, Gerri",
        "Description": "The author of Puddings, Custards and Flans and a renowned restauranteur have collaborated on a collection of more than seventy simple, delicious recipes for salads and sandwiches. 20,000 first printing. National ad/promo. Tour.",
        "Category": " Cooking , Methods , Special Appliances",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Hamlet (Cambridge School Shakespeare)",
        "Authors": "By Shakespeare, William, Gibson, Rex (EDT), and Andrews, Richard (EDT)",
        "Description": "This new edition of one of Shakespeare's most popular plays takes into account the work of the Shakespeare and Schools Project, the national curriculum for English, developments at GCSE and A-level, and the probable development of English and Drama throughout the 1990s. Cambridge School Shakespeare considers Hamlet as theatre and its text as script, enabling students to inhabit the imaginative world of the play in an accessible, meaningful and creative way. It approaches the play in a new way, encouraging students to participate actively in examining it, to work in groups as well as individually, to treat the play as a script to be re-created, and to explore the theatrical/dramatic qualities of the text. The editorial comments cater for pupils of all ages and abilities, providing clear, helpful guidelines for school study. The format is also designed to help teachers, whether experienced or inexperienced.",
        "Category": " Drama , Shakespeare",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Part of the Solution: Portrait of a Revolutionary (New Directions Books)",
        "Authors": "By Randall, Margaret",
        "Description": "",
        "Category": " Biography & Autobiography , General",
        "Publisher": "New Directions Publishing Corporation",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Child Welfare",
        "Authors": "By Everett, Joyce E. (EDT), Chipungu, Sandra S. (EDT), and Leashore, Bogart R. (EDT)",
        "Description": "Child Welfare,  twenty-one educators call attention to racial disparities in the child  welfare system by demonstrating how practices that are successful for  white children are often not similarly successful for African American  children. Moreover, contributors insist that policymakers and care  providers look at African American family life and child development  from a culturally-based Africentric perspective. Such a perspective, the  book argues, can serve as a catalyst for creativity and innovation in  the formulation of policies and practices aimed at improving the welfare  of African American children.",
        "Category": " Social Science , Children's Studies",
        "Publisher": "Rutgers University Press",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "The Invisible Thread: A Portrait of Jewish American Women",
        "Authors": "By Bletter, Diana and Grinker, Lori",
        "Description": "",
        "Category": " Social Science , Women's Studies",
        "Publisher": "Jewish Publication Society",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "The Backyard Landscaper: 40 Professional Designs for Do-It-Yourselfers",
        "Authors": "By Ireland-Gannon Association",
        "Description": "Presents forty professional landscape design plans to suit the needs of homeowners everywhere, as well as plans for special garden features, with tips on the principles of landscaping, types of gardens, care on various species of plants, and more. Original.",
        "Category": " Gardening , Landscape",
        "Publisher": "Home Planners",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "Cultivating the Cook's Garden: Deliciously Fresh Things to Eat, Just Outside Your Kitchen Door",
        "Authors": "By James, Theodore",
        "Description": "Master gardener Ted James tells you everything you need to know to plant and grow your own backyard garden. This classic guide will soon have you eating the freshest, most nourishing imaginable salads, stir- fries, omelets, soups, and pastas made with fresh produce, still pearled with the garden dew, picked from right outside your kitchen door. Fun to read, replete with tips to make backyard gardening easy, and packed with useful information, Cultivating the Cook&#39;s Garden is beloved by folks learning to grow and eat locally.",
        "Category": " Cooking , Specific Ingredients , Natural Foods",
        "Publisher": "Council Oak Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Second Christmas",
        "Authors": "By Untermeyer, Louis",
        "Description": "",
        "Category": "",
        "Publisher": "Hallmark Cards",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "Toward Distant Suns",
        "Authors": "By Heppenheimer, T. A.",
        "Description": "Addresses the problems of technology and lifestyle which will confront future space explorers and settlers, suggesting solutions to space construction, work in space, tourism, space war, and interstellar colonization",
        "Category": " History , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1980"
        }
    },
    {
        "Title": "Journey to the Center of Our Galaxy: A Voyage in Space and Time",
        "Authors": "By Davis, Joel",
        "Description": "Combines historical research, scientific fact, and selections from science fiction to explore the Earth's galaxy--the Milky Way",
        "Category": " Science , General",
        "Publisher": "Contemporary Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "The upper crust: The aristocrats of automobiles",
        "Authors": "By Bolster, John",
        "Description": "",
        "Category": "",
        "Publisher": "Follett Pub. Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "How to Kill Your Girlfriend's Cat",
        "Authors": "By Daphne, Robert",
        "Description": "Offers tongue in cheek ways to do in an unwanted cat, including kitty litter quicksand, breeding a giant mouse, or using a catapult",
        "Category": " Humor , General",
        "Publisher": "Doubleday Dolphin Book",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Christmas With Southern Living 2000",
        "Authors": "By ed. Rebecca Brennan~Lauren Brooks~Julie Fisher Gunter",
        "Description": "Filled with decorating ideas, gifts, and kitchen-tested recipes from the South, this book brings the best of Southern hospitality to the holiday season with instructions for the projects and recipes listed",
        "Category": " Cooking , Holiday",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.88",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Spy-In (The Mod Squad #4)",
        "Authors": "By Deming, Richard",
        "Description": "",
        "Category": "",
        "Publisher": "Pyramid",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Dear Kilroy: A Dog to Guide Us (Capital Ideas)",
        "Authors": "By Harrison, Nora Vitz",
        "Description": "Kilroy, a yellow Labrador retriever, started life as a potential guide for the blind. His life took a detour when he was dropped from the program. Nora’s sister, Alice, adopted him as a pet. The love he brought to her life eased her through a very difficult time - the dissolution of her 18-year marriage. Watching and participating in this special relationship reminded Nora that success takes many forms. Kilroy \"failed\" as a guide dog, but he succeeded in changing Alice’s life for the better. He became her guide as she made her journey from grief to new happiness.     Some of the best teachers in this world have four legs and bark. Dogs help us make friends, transcend tragedies, grieve the loss of loved ones and just plain enjoy life. According to researchers, pets improve our human immune-system functions - a fancy way to say they make us feel good. \"Dear Kilroy,\" a collection of inspirational stories, photographs, and imaginary canine correspondence, celebrates this magical relationship between people and dogs. The book’s true-life stories follow a few special dogs and the human lives they change. As the dogs in these stories strive to fulfill their potential - whether to become a guide for the visually impaired or to become the best, most-trusted pet of someone in need - they teach us all how to become better human beings.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Capital Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Mass Murder",
        "Authors": "By Drummond, John Keith",
        "Description": "When an assistant priest is poisoned during Mass, Jolliston Valley winemaker Matilda Worthing delves into the death, uncovering a murky morass lying beneath the surface of the wealthy parish",
        "Category": " Fiction , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "On Passover",
        "Authors": "By Fishman, Cathy Goldberg and Hall, Melanie W. (ILT)",
        "Description": "\"Dy-dy-enu, dy-dy-enu\" my father sings in Hebrew.  \"It would be enough.\"  A young girl hears her father singing these words and knows it is time to get ready for Passover. Time to eat special food on special Passover dishes. Time to tell the Passover story and take part in the Seder. During the celebration of Passover, there are many things to see, taste, smell, hear, and feel. And as the girl follows her senses and asks questions about all she encounters, she discovers in her own heart what Passover really means.",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Passover",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "A Christmas Treasury: The Children's Classic Edition",
        "Authors": "By Birmingham, Christian (ILT) and Bucher, Elaine M. (EDT)",
        "Description": "A brightly illustrated, cheerful compilation of classic Christmas stories, poems, and carols ranges from Clement C. Moore's Twas the Night Before Christmas to the biblical text of the very first Christmas in Bethlehem.",
        "Category": "",
        "Publisher": "Courage Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Managing from the Heart",
        "Authors": "By Bracey, Hyler, Rosenblum, Jack, Sanford, Aubrey, and Trueblood, Roy",
        "Description": "From the brain trust at The Atlanta Consulting Group comes a simple method hailed as a revolution in management practice: learning to care.   Caring isn’t a frill. It delivers results. And for some unenlightened managers, learning to care can be a matter of corporate life or death. Managing from the Heart is the story of Harry Hartwell, a composite character drawn from decades of the authors’ field experience on the front lines of management reform. Known by his staffers as “the Abominable No Man,” Harry’s remarkable transformation into a caring and compassionate manage offers an easy-to-apply business parable—and an absolutely painless, one-of-a-kind learning experience. Acquire the five principles of caring management. Your people will be glad you did. And so will everyone who keeps an eye on your bottom line.   Praise for Managing from the Heart   “Outstanding! Delivers the right message at a critical time.”—Lee A. Robbins, VP and CFO, Puritan Bennett   “Five powerful principles, so simple they are arresting. Their application by every manager can catapult a company to new heights of greatness.”—Don M. Schrello, chairman, Schrello Direct Marketing, Inc.   “Much needed!”—Norman Vincent Peale   “Managing from the Heart is a gift you should give to yourself and your people. It outlines a beautiful philosophy that if applied will not only impact human satisfaction in your organization, but bottom line results.”—Kenneth Blanchard, Ph.D., co-author of The One Minute Manager",
        "Category": " Business & Economics , Management",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Dayworld Rebel (Dayworld Trilogy, II)",
        "Authors": "By Farmer, Philip Jose",
        "Description": "Jefferson Caird joins an outlaw band of daybreakers and uncovers the layers of deception that world government has inflicted on the people it has sworn to protect",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ace Putnam",
        "Price Starting With ($)": "93.98",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Women's Growth In Connection: Writings from the Stone Center",
        "Authors": "By Miller, Jean Baker, Jordan, Judith V., Kaplan, Alexandra G., Stiver, Irene P., and Surrey, Janet L.",
        "Description": "Overly emotional, hysterical, dependent, frivolous, fickle... Why have women been so consistently defined as deficient in maturity, self-mastery, and independence according to the models of human development inspired by male culture? The authors of WOMEN'S GROWTH IN CONNECTION, a sampling of the influential working papers from the Stone Center, Wellesley College, have sought to answer this question by studying developmental theory and reformulating it to reflect women's experience more accurately. These papers, about women's ways of being in the world, frame an innovative relational perspective on women's psychological development. The authors--clinicians, clinical supervisors, and teachers--have been searching for therapeutic models that take into account women's meaning systems, values, and organization of experiences, all of which often revolves around relationships rather than the self. By offering a new perspective on women's development, WOMEN'S GROWTH IN CONNECTION stands at the forefront of the ongoing feminist movement to examine and reshape psychological theory and practice. The authors offer this volume as an invitation to the reader to join in the building of new models of women's development.",
        "Category": " Social Science , Women's Studies",
        "Publisher": "The Guilford Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "The Hungry Years: America in an Age of Crisis, 1929-1939",
        "Authors": "By Watkins, T. H.",
        "Description": "The acclaimed author of Righteous Pilgrim delivers this dramatic account of the Great Depression as seen by those who lived through it. Less concerned with the power brokers in Washington than with the daily struggles of ordinary people at the grass roots, The Hungry Years draws on little-known oral histories, memoirs, local press, and scholarly monographs to capture the voices of Americans in a time of unprecedented crisis. The result is narrative history at its best: a comprehensive single volume that traces the stages of the disaster chronologically without losing touch with the wounds it inflicted or the ways people responded. Humane and compassionate, historically sound, full of story and anecdote, The Hungry Years puts the reader at the very heart of the maelstrom that was the American Depression.",
        "Category": " History , United States , General",
        "Publisher": "Henry Holt and Co.",
        "Price Starting With ($)": "5.13",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The Runaway Brain: The Evolution Of Human Uniqueness",
        "Authors": "By Wills, Christopher",
        "Description": "The human brain is astonishingly different from the brain of any other animal. Why? Have we somehow fooled Mother Nature and escaped from the laws of evolution?Written like a detective story, this book brings together a wealth of new research from paleontology, genetics, and neurobiology to explain the runaway evolution of the human brain. Evolutionists and human paleontologists have tended to assume that our intellect began to burgeon when our ancestors developed the ability to walk upright, to grasp and carry objects, or to form cooperative groups for hunting. While these and many other factors are important, this book shows that they are only some of the latest steps in a long evolutionary story that began a billion years ago. By now, the brains of many different animals are much larger than those of their predecessors and are superbly adapted to environments that have slowly become more complex. But our own distant ancestors were the only ones to enter a new evolutionary path, a feedback loop that involved their brains, their bodies, and an ever more complicated environment that they largely created themselves. The result, for better and sometimes for worse, is our own astonishing species.The author shows how this view of our evolution as a runaway process casts light on a number of major questions that recent discoveries have raised about our past. These include the identity and true role of the mitochondrial Eve, the origin of human diversity, and the confusion and controversy surrounding our fossil record. Two major views of recent human evolution hinge on the time at which people like ourselves first arose. Did they do so in several different parts of the Old World, the so-called \"multiple origins\" model, or did they appear suddenly and recently, perhaps driving all the more primitive hominids to extinction? The first model is favored by many anthropologists; the second, by many geneticists. While it is not yet possible to decide with certainty between the two, the book details how the driving force of runaway brain evolution is so great that it can easily account for multiple origins.Turning to the evolution of the brain itself, the author recounts the escape of our ancestors from the \"stupidworlds\" of the past. He shows how, as a result of this escape, our brains have evolved into sponges for knowledge. They are so versatile, and have been driven by such strong evolutionary pressures, that fundamental human capabilities such as language can be traced to many different parts of the brain that have simultaneously increased in complexity. Using a vivid series of examples, the book details scientists' growing knowledge of the kinds of genetic changes that have powered the runaway process.Written by a scientist whose previous books have explored the whole sweep of evolution and the complexities of the human genome, The Runaway Brain casts a brilliant light on human intellect and human nature.",
        "Category": " Science , General",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Thorns in Eden (Thorns in Eden Series #1)",
        "Authors": "By Boggs, Dallas E.",
        "Description": "",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "PublishAmerica",
        "Price Starting With ($)": "17.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Frederic Remington: Selected Writings",
        "Authors": "By Remington, Frederic",
        "Description": "Gathers illustrated stories and articles about the West, the life of the cowboy, and skirmishes between cavalry and the Indians, written by the successful painter",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Castle, Book Sales",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "Out of the Blue",
        "Authors": "By Jenkins, Jerry B. and Hershiser, Orel",
        "Description": "",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Wolgemuth & Hyatt Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    }
]