[
    {
        "Title": "When in Rome...: A Novel",
        "Authors": "By Townley, Gemma",
        "Description": "When in Rome, do as Audrey Hepburn would do. Failing that, run off with your ex-boyfriend, carry suspicious packages through customs, and lie to the person who loves you. . . .Georgie Beauchamp is totally happy and in love with her wonderful, dependable boyfriend, David. So why does she always daydream about running into her gorgeous ex-boyfriend Mike? It can’t mean she’s still in love with him—especially since the cad dumped her so horribly. As luck would have it, when Georgie’s daydream actually comes true, she is dressed in unglamorous sweats and carrying a curtain rod down the street, while Mike is driving an expensive sports car and looking better than Brad Pitt at the Oscars. She longs to have the glamorous life Mike can offer—and starts to think that he might want her back in his arms.But when he invites her for a weekend in Rome, Georgie is torn. David has always said he’d take her there for the romantic getaway of a lifetime, but his work keeps him totally tied up. So she must choose: David, all comfort and reliability, or Mike, all flirtation and butterfly-stomachs. The decision isn’t too hard to make, and faster than she can say Vespa, she’s off to Rome with Mike, full of plans to frolic on the Spanish Steps and sip wine in intimate trattorias. But when David shows up unexpectedly, this roman holiday gets a hell of a lot more complicated. . . .",
        "Category": " Fiction , Romance , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Connections: Using Personality Types to Draw Parents and Kids Closer",
        "Authors": "By Brawner, Jim and Jaenicke, Duncan",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Moody Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Bon Marche (Dewey Annals, Vol 1)",
        "Authors": "By Hagan, Chet",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "The Penkovskiy Papers",
        "Authors": "By Oleg Penkovskiy",
        "Description": "",
        "Category": "",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "PRAGMATISM",
        "Authors": "By James, William",
        "Description": "",
        "Category": "",
        "Publisher": "Meridian Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Quarantine: A Novel",
        "Authors": "By Crace, Jim",
        "Description": "Winner of the Whitbread Novel of the Year and a Booker finalist:  a controversial novel of faith and mystery about a group of desert travellers and their encounter with JesusQuarantine is Jim Crace's imaginative and powerful retelling of Christ's fabled 40-day fast in the desert.  In Crace's account, Jesus travels to a cluster of arid caves where he crosses paths with a small group of exiles who are on a pilgrimage to find redemption.  One wealthy and manipulative quarantiner recognizes characteristics in Christ that he believes are divine.  Evoking the strangeness and beauty of the desert landscape, Crace provocatively interprets one of our most important stories.",
        "Category": " Fiction , Literary",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Why Cats Do That: A Collection of Curious Kitty Quirks",
        "Authors": "By Anderson, Karen and Christenson, Wendy (ILT)",
        "Description": "A celebration of feline idiosyncrasies shares lighthearted explanations of such perplexing behaviors as getting stuck in trees, delivering kills to the doorstep and landing on their feet, in a volume complemented by evocative black-and-white pencil illustrations.",
        "Category": " Pets , Cats , General",
        "Publisher": "Willow Creek Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Justice, Crime, and Ethics",
        "Authors": "By McCarthy, Belinda Rodgers (EDT), Braswell, Michael (EDT), and McCarthy, Bernard J. (EDT)",
        "Description": "The contributions in this book examine ethical dilemmas pertaining to the administration of criminal justice and professional activities in the field. Comprehensive coverage is achieved through focus on law enforcement, legal practice, sentencing, corrections, research, crime control policy and philosophical issues. The seventh edition includes three new chapters focusing on deception in police interrogation; using ethical dilemmas in training police; and terrorism and justice. Essays are enhanced with case studies and exercises designed to stimulate critical and creative thinking regarding ethical issues in crime and justice.Discussion questions and lists of key concepts focus students and help them to understand ethics in the context of the criminal justice system.",
        "Category": " Law , Criminal Law , General",
        "Publisher": "Routledge",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Kidding Around Washington, D.C.: A Fun Filled, Fact Packed Travel & Activity Book (1st ed)",
        "Authors": "By Levy, Debbie",
        "Description": "A guidebook to Washington, D.C. covering such areas as Capital Hill, the Mall museums, monuments, parks, Georgetown, and nearby Maryland and Virginia",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "John Muir Pubns",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Dancing in the Arms of God",
        "Authors": "By Neal, Connie",
        "Description": "Deep within, every woman longs for her own Cinderella experience: to rise from her humble past, discover the best in herself, and be appreciated by a true, lasting love. Yet, her own efforts to fill the yearning often end in tatters. And no man can rescue her. In Dancing in the Arms of God, the Cinderella fairy tale provides a powerful allegory for women's deepest hopes and dreams and the God who longs to fill them. It's a message proved true in the life of author Connie Neal. For all of us who have wrestled with disillusionment, abandonment, our own limitations, and the lies that whisper we're not beautiful, Connie's true-life insights reveal what it means to dance with God . . . following his lead until every promise he's ever made proves true.",
        "Category": " Religion , Christian Life , Women's Issues",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "The Victorian Frame of Mind, 1830-1870",
        "Authors": "By Houghton, Walter E",
        "Description": "“It is now forty years,” Walter Houghton writes, “since Lytton Strachey decided that we knew too much about the Victorian era to view its culture as a whole.”  Recently the tide has turned and the Victorians have been the subject of sympathetic “period pieces,” critical and biographical works, and extensive studies of their age, but the Victorian mind itself remains blurred for us—a bundle of various and often paradoxical ideas and attitudes.  Mr. Houghton explores these ideas and attitudes, studies their interrelationships, and traces their simultaneous existence to the general character of the age.  His inquiry is the more important because it demonstrates that to look into the Victorian mind is to see some of the primary sources of the modern mind.",
        "Category": " History , Europe , Great Britain , General",
        "Publisher": "Yale University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1963"
        }
    },
    {
        "Title": "Alex the Life of a Child as Seen on ABC",
        "Authors": "By Deford, Frank",
        "Description": "",
        "Category": "",
        "Publisher": "New American Library",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "The Hunt Ball: A Novel (\"Sister\" Jane)",
        "Authors": "By Brown, Rita Mae",
        "Description": "“A rich, atmospheric murder mystery . . . rife with love, scandal . . . redemption, greed and nobility,” raved the San Jose Mercury News about Outfoxed, Rita Mae Brown’s first foxhunting masterpiece. In The Hunt Ball, the latest novel in this popular series, all the ingredients Brown’s readers love are abundantly present: richness of character and landscape, the thrill of the hunt, and the chill of violence.The trouble begins at Custis Hall, an exclusive girls’ school in Virginia that has gloried in its good name for nearly two hundred years. At first, the outcry is a mere tempest in a silver teapot–a small group of students protesting the school’s exhibit of antique household objects crafted by slaves–and headmistress Charlotte Norton quells the ruckus easily. But when one of the two hanging corpses ornamenting the students’ Halloween dance turns out to be real–the body of the school’s talented fund-raiser, in fact–Charlotte and the entire community are stunned. Everyone liked Al Perez, or so it seemed, yet his murder was particularly unpleasant. Even “Sister” Jane Arnold, master of the Jefferson Hunt Club, beloved by man and beast, is at a loss, although she knows better than anyone where the bodies are buried in this community of land-grant families and new-money settlers. Aided and abetted by foxes and owls, cats and hounds, Sister picks up a scent that leads her in a most unwelcome direction: straight to the heart of the foxhunting crowd. The chase is on, not only for foxes but also for a deadly human predator.No one has created a fictional paradise more delightful than the rolling hills of Rita Mae Brown’s Virginia countryside, or has more charmingly captured the rituals of the hunt. No one understands human and animal nature more deeply. The Hunt Ball combines a rounded, welcoming world with an edge of unforgettable white-knuckled menace.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Toxic Bachelors: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "Danielle Steel explores the perils of dating, relationships, and love in a novel  that takes us into the intoxicating, infuriating world of three charming single men,  also known as… Toxic Bachelors They were the best of friends and the most daunting  of bachelors....Charlie Harrington, a handsome philanthropist, has such high expectations  for his perfect bride that no mortal need apply....Adam Weiss, a forty-something  celebrity lawyer, prefers his women very young, very voluptuous, and very short-term….And  for Gray Hawk, a gifted artist with a knack for attracting troubled relationships,  women are fine; it’s just the idea of family he can’t imagine (particularly the family  of the woman he’s dating).  Now the three friends, spending their annual summer  vacation cruising the Mediterranean aboard Charlie’s majestic yacht, are about to  have their bachelorhood rocked. By autumn all three will fall precipitously into  relationships they never saw coming. Charlie begins dating a crusading social worker  who couldn’t be further from his ideal–until he makes a stunning discovery about  her. Adam gets involved with his usual twenty-something bombshell–only this one has  a remarkable mind of her own. And Gray, who has avoided both business and family  like the plague, has managed to fall head over heels for a successful career woman– who just happens to be a mother as well. As another holiday on the yacht approaches,  and with it a turning point in each man’s life, the three bachelors are forced to  face the things that scare them most: their phobias about relationships, the wounds  of the past–and the kind of women who challenge their deepest terrors. What happens  next will spark big changes for Charlie, Adam, and Gray–and might just put an end  to their carousing days forever. For as the once-carefree trio is about to discover,  love is the most unpredictable adventure of all. Filled with all the joy, complexity,  and unexpected surprises of life, Toxic Bachelors is Danielle Steel at her poignant  and penetrating best.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "The Science Explorer: The Best Family Activities and Experiments from the World's Favorite Hands-On Science Museum",
        "Authors": "By Murphy, Pat, Klages, Ellen, Exploratorium (Organization), Shore, Linda, and Gorski, Jason (ILT)",
        "Description": "Instructions for more than one hundred hands-on experiments, activities, and tricks provide young readers with a fascinating, interactive introduction to the world of scientific exploration. Original.",
        "Category": " Science , Experiments & Projects",
        "Publisher": "Owl Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "A Boy Named Charlie Brown",
        "Authors": "By Schulz, Charles M.",
        "Description": "Good grief! Charlie Brown is going to New York City to compete in a big spelling bee. Charles M. Schultz’s hapless hero, with the entire Peanuts® gang, has won the affection of readers everywhere, and A Boy Named Charlie Brown is an absolute classic. Originally released in 1969, it features more than 100 beautifully reproduced full-color illustrations from the film on which it is based, along with Schultz’s incomparable, heartwarming, and funny storytelling.",
        "Category": " Fiction , Media Tie-In",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.38",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Atlas Of American Wars",
        "Authors": "By Kirk, John G",
        "Description": "Charts the progress of all the major conflicts in which the United States has been involved, and describes the strategy and conduct of the major campaigns and battles",
        "Category": " Reference , General",
        "Publisher": "Arch Cape Press",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "March",
            "Year": "1986"
        }
    },
    {
        "Title": "Sheridan in the Shenandoah: 2nd Edition (Stackpole)",
        "Authors": "By Stackpole, Edward J",
        "Description": "Recounts the dimatic 1864 campaign. Updated with commentary by D. Scott Harwig and foreword by William C. Davis.",
        "Category": " History , United States , General",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Cliffs Notes On Bronte's Jane Eyre",
        "Authors": "By Snodgrass, Mary Ellen and Jacobson, Karin",
        "Description": "The original CliffsNotes study guides offer expert commentary on major themes, plots, characters, literary devices, and historical background. The latest generation of titles in this series also feature glossaries and visual elements that complement the classic, familiar format.Question Victorian—and present-day—society as you study Charlotte Bronte&#39;s popular novel with CliffsNotes on Jane Eyre. What is women&#39;s position in society? What is the relationship of dreams and fantasy to reality? What is the basis of an effective marriage? Bronte tackles all these questions and more through the story of her heroine Jane Eyre.CliffsNotes provides detailed plot summaries, critical commentaries, and a helpful character map to help you uncover all the insight this novel has to offer. Make your study of this timeless novel a success with CliffsNotes on Jane Eyre. Other features that help you study includeCharacter analyses of major playersCritical essaysA review section that tests your knowledgeBackground on the author, including career highlightsClassic literature or modern-day treasure—you&#39;ll understand it all with expert information and insight from CliffsNotes study guides.",
        "Category": " Literary Criticism , Books & Reading",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Let's Meet on Platform 8 (Red Dress Ink)",
        "Authors": "By Matthews, Carole",
        "Description": "When she is knocked over by gorgeous and charming Jamie Duncan while waiting for the 6:07 train, Teri Carter believes she has found the perfect man, until she discovers that he is married, which forces her to reevalutate her own personal values. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Red Dress Ink",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Heinerman's Encyclopedia of Healing Juices",
        "Authors": "By Heinerman, John",
        "Description": "Shows how to use vegetable and fruit juices to help alleviate allergies, constipation, hypoglycemia, skin problems, joint pain, colitis, ulcers, and other ailments",
        "Category": " Health & Fitness , Alternative Therapies",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "13.43",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "The Sherbrooke Twins: Bride Series",
        "Authors": "By Coulter, Catherine",
        "Description": "Two Sherbrooke brothers—identical twins—find themselves caught up in a storm of passion and mystery in this “madly romantic, supremely sexy adventure” (Booklist) from #1 New York Times bestselling author Catherine Coulter.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Ranger Mosby",
        "Authors": "By Jones, Virgil Carrington",
        "Description": "",
        "Category": "",
        "Publisher": "Epm Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "The Penguin Book of First World War Poetry: Revised Edition (Classic, 20th-Century, Penguin)",
        "Authors": "By Silkin, Jon (EDT)",
        "Description": "Presents a collection of poetry from the First World War by such authors as Thomas Hardy, Edward Thomas, Siegfried Sassoon, Rudyard Kipling, Wilfred Owen, and Isaac Rosenberg.",
        "Category": " Poetry , Anthologies (multiple authors)",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Cows Are in the Corn (Hello Reader! Level 2)",
        "Authors": "By Young, James",
        "Description": "When Brother wakes up and discovers that the cows are in the corn, goats are in the oats, the pigs are in the figs, and the rams are in the yams, chaos ensues on the farm, in a rollicking rhythmic story that will delight young readers. Reissue.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "John Lennon: Young Rock Star",
        "Authors": "By Santrey, Laurence and Beier, Ellen (ILT)",
        "Description": "A brief biography of the English rock musician with emphasis on his early years and the formation of the famous Beatles",
        "Category": " Music , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Busy Trains (Pictureback(R))",
        "Authors": "By Lippman, Peter J.",
        "Description": "Provides an informative introduction to the many kinds of trains--including commuter, passenger, freight, and special work trains--and to engineers, repair crews, and other railroad workers",
        "Category": " Juvenile Fiction , Transportation , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1981"
        }
    },
    {
        "Title": "Being God's Man in the Face of Temptation: Real Life. Powerful Truth. For God's Men (The Every Man Series)",
        "Authors": "By Arterburn, Stephen, Wendorff, Todd, and Luck, Kenny",
        "Description": "All men are tempted to compromise. But not all men do. Some have learned the secret of being undivided between what they believe and how they actually think and live. They possess integrity. They’ve gained new perspectives on the trials and temptations they face, new tools to help them survive automatic human responses to challenging situations, and new actions which produce humility and flexibility in God’s strength. You can be a man of integrity too.Confession breaks the power of temptation in men of integrity; connection with other men sustains the victory. Being God’s Man…in the Face of Temptation will help you–whether in individual or group study–confront this pervasive problem in God’s wisdom and strength. And begin to live the undivided life.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "WaterBrook",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Miracle of Miracles",
        "Authors": "By Nevisa, Mina",
        "Description": "",
        "Category": "",
        "Publisher": "Long Wood Communications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "City of Truth",
        "Authors": "By Morrow, James",
        "Description": "Jack Sperry is a loyal citizen of Veritas, the City of Truth, until tragedy strikes his life, and he must hide from truth in order to save his son's life. By the author of Only Begotten Daughter.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "What is That? Said the Cat (Scholastic Hello Reader, Level 1)",
        "Authors": "By MacCarone, Grace, Scherer, Jeffrey, and Scherer, Jeffrey (ILT)",
        "Description": "An entertaining group of animals narrates an entertaining story in rhyme, in a simple easy-to-read book, complemented by whimsical cartoon artwork, that introduces youngsters to basic vocabulary words. Original.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Cartwheel",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Horse Sense for People : Using the Gentle Wisdom of Join-Up to Enrich Our Relationships at Home and at Work",
        "Authors": "By Roberts, Monty",
        "Description": "Rich in anecdotes about horses and people, a lifetime of lessons learned from horses demonstrates how trust, respect, and communication are the keys to fruitful relationships, and that with humans as with horses, the gentle way is the better way. 150,000 first printing.",
        "Category": " Self-help , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Corduroy: 2",
        "Authors": "By Freeman, Don",
        "Description": "",
        "Category": "",
        "Publisher": "Viking Juvenile",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1968"
        }
    },
    {
        "Title": "Trotsky's Run",
        "Authors": "By Hoyt, Richard",
        "Description": "Presents a comic thriller in which the Americans and Russians exchange espionage gambits and a presidential candidate thinks he's Leon Trotsky",
        "Category": "",
        "Publisher": "Pinnacle Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "Half a Life",
        "Authors": "By Naipaul, V. S.",
        "Description": "One of the finest living writers in the English language, V. S. Naipaul gives us a tale as wholly un-expected as it is affecting, his first novel since the exultantly acclaimed A Way in the World, published seven years ago.Half a Life is the story of Willie Chandran, whose father, heeding the call of Mahatma Gandhi, turned his back on his brahmin heritage and married a woman of low caste—a disastrous union he would live to regret, as he would the children that issued from it. When Willie reaches manhood, his flight from the travails of his mixed birth takes him from India to London, where, in the shabby haunts of immigrants and literary bohemians of the 1950s, he contrives a new identity. This is what happens as he tries to defeat self-doubt in sexual adventures and in the struggle to become a writer—strivings that bring him to the brink of exhaustion, from which he is rescued, to his amazement, only by the love of a good woman. And this is what happens when he returns with her—carried along, really—to her home in Africa, to live, until the last doomed days of colonialism, yet another life not his own.In a luminous narrative that takes us across three continents, Naipaul explores his great theme of inheritance with an intimacy and directness unsurpassed in his extraordinary body of work. And even as he lays bare the bitter comical ironies of assumed identities, he gives us a poignant spectacle of the enervation peculiar to a borrowed life. In one man’s determined refusal of what he has been given to be, Naipaul reveals the way of all our experience. As Willie comes to see, “Everything goes on a bias. The world should stop, but it goes on.” A masterpiece of economy and emotional nuance, Half a Life is an indelible feat of the imagination.",
        "Category": " Fiction , Literary",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Treasures in Heaven",
        "Authors": "By Buntain, Huldah",
        "Description": "",
        "Category": "",
        "Publisher": "Whitaker House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "A Dangerous Fortune: A Novel",
        "Authors": "By Follett, Ken",
        "Description": "A breathtaking thriller featuring \"political and amorous intrigues, cold-blooded murder, and financial crises\" (San Francisco Chronicle), from the #1 New York Times bestselling author of A Column of FireIn 1866, tragedy strikes the exclusive Windfield School when a young student drowns in a mysterious accident. His death and its aftermath initiate a spiraling circle of treachery that will span three decades and entwine many lives.   From the exclusive men’s clubs and brothels that cater to every dark desire of London’s upper class to the dazzling ballrooms and mahogany-paneled suites of the manipulators of the world’s wealth, one family is splintered by a shared legacy. But greed, fed by the shocking truth of a boy’s death, must be stopped, or the dreams of a nation will die.  Praise for A Dangerous Fortune “A terrific page-turner.”—Los Angeles Times  “Political and amorous intrigues, cold-blooded murder, and financial crises . . . old-fashioned entertainment.”—San Francisco Chronicle   “Breathlessly plotted . . . relentlessly suspenseful.”—The New York Times   “Gripping, complex plot . . . sexual intrigue . . . fascinating characters . . . You won’t be able to put down this exciting page-turner.”—Lexington Herald-Leader “Follett [builds] to a dramatic climax with the same masterful control that guided Eye of the Needle and The Pillars of the Earth.”—Playboy “I don’t usually enjoy historical thrillers but admit to being totally captivated by Ken Follett’s A Dangerous Fortune.”—Chicago Tribune “Highly entertaining . . . Follett’s characters are drawn with broad, realistic strokes . . . this story of greed and retribution should win Follett new fans.”—Publishers Weekly  “Rich, complex, thrilling, suspenseful, well plotted . . . A Dangerous Fortune is dangerous reading. You won’t be able to put it down.”—Authors and Critics",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Philadelphia: Picture Memory",
        "Authors": "By Harris, Bill",
        "Description": "",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "From Iraq to Armageddon: The Final Showdown Approaches",
        "Authors": "By Intrater, Keith",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Destiny Image Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Mine Till Midnight (The Hathaways, Book 1)",
        "Authors": "By Kleypas, Lisa",
        "Description": "When an unexpected inheritance elevates her family to the ranks of the aristocracy, Amelia Hathaway discovers that tending to her younger sisters and wayward brother was easy compared to navigating the intricacies of the ton. Even more challenging: the attraction she feels for the tall, dark, and dangerously handsome Cam Rohan.Wealthy beyond most men's dreams, Cam has tired of society's petty restrictions and longs to return to his \"uncivilized\" Gypsy roots. When the delectable Amelia appeals to him for help, he intends to offer only friendship—but intentions are no match for the desire that blindsides them both. But can a man who spurns tradition be tempted into that most time-honored arrangement: marriage? Life in London society is about to get a whole lot hotter….in Lisa Kleypas's Mine Till Midnight.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Christmas Wishes (A Blossom Street Novel)",
        "Authors": "By Macomber, Debbie",
        "Description": "Katherine O'Connor (known as K.O.) adores her five-year-old twin nieces— and  strongly  objects  to  her  sister's plans  to  dispense  with  Christmas. Zelda  is  following  the  theories  of child psychologist Wynn Jeffries, author of The Free Child (and, as it happens, K.O.'s neighbor). K.O. is particularly horrified by his edict to \"bury Santa under the sleigh,\" and she's out to prove that Wynn and his ideas are full of…snow. He's not going to ruin her nieces' Christmas! Too bad the guy's so darned attractive….RAINY DAY KISSES is a delightful romantic comedy at Christmas—or any other time of year!Seventeen years ago Susannah Simmons was a career girl who knew  nothing  about  babies.  But  after  babysitting  her  infant niece, Michelle, Susannah learned that one determined— and screaming—baby can make the corporate world look like…child's play. Thank goodness for her charming neighbor Nate Townsend. Now he's her charming husband, and Susannah's a mother as well as an aunt. And every Christmas Eve, Michelle tells her cousins how their mom met their dad— a story in which she plays a starring role!",
        "Category": " Fiction , Romance , General",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Lover Unbound (Black Dagger Brotherhood, Book 5)",
        "Authors": "By Ward, J. R.",
        "Description": "The ruthless and brilliant brother Vishous possesses a destructive curse and a frightening ability to see the future. As a member of the Brotherhood, he has no interest in love or emotion, only the battle with the Lessening Society. But when a mortal injury puts him in the care of a human surgeon, Dr. Jane Whitcomb compels him to reveal his inner pain and taste true pleasure for the first time-until a destiny he didn't choose takes him into a future that does not include her...",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Calder Storm",
        "Authors": "By Dailey, Janet",
        "Description": "Filled with passion, suspense, heartbreak, and hope, Calder Storm is an enthralling love story. With his rugged-cowboy looks, Trey Calder could have his pick of women. But he's been holding out for someone special, and the minute he lays eyes on photographer Sloan Davis, he knows he's found her, and within weeks the two are married.  It's a dream come true for the orphaned Sloan.  .  .until Trey makes a startling discovery about just who Sloan is and what she's really after. Passion turns into suspicion and a dangerous game is set in motion, putting everything the Calders have worked for over the generations on the line. A formidable enemy has been lying in wait. Someone who will use whatever means necessary to control their land, their lives, and their legacy forever. Trey Calder has been trained to take over his family's ranch, to protect what is theirs. Now the time has come for a Calder son to make a stand and hope that his way is the right way.  .  . \"The passion, spirit and strength readers expect from a Calder story--and a Calder hero--shine through.  .  .\" --Publishers Weekly on Lone Calder Star",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "The Gift: Home For Christmas\\All I Want For Christmas\\Gabriel's Angel",
        "Authors": "By Roberts, Nora",
        "Description": "Home for ChristmasAfter years spent abroad, reporter Jason Law returned home determined to win back the girl he left behind. It would take all his skills&#151;and then some&#151;to win Faith back. But this time, nothing would stand in his way&#151;it was time faith was rewarded.All I Want for ChristmasIdentical twin boys Zeke and Zach wanted only one gift from Santa this year: a new mom! But convincing their love-wary dad that their music teacher, Miss Davis, was his destiny and part of Santa's plan wasn't as easy as they'd hoped&#151;.Gabriel's AngelAll Gabriel Bradley wanted was solitude. But when Laura ended up at his remote cabin during a blizzard, desperate, alone and on the run, the modern-day Scrooge couldn't turn her away. For she brought him the gift of passion, life, hope&#151;if he had the courage to reach for it.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Her Secret Fantasy: A Novel (Spice Trilogy)",
        "Authors": "By Foley, Gaelen",
        "Description": "Regency London’s elegant ballrooms mask a daring world of erotic adventure. In this second novel in Gaelen Foley’s Spicy Trilogy, a mysterious beauty with a devastating secret discovers, in the arms of a bold and fearless cavalry officer, passion that breaks all boundaries.Some say the aristocratic Balfour clan is cursed, a once-great family now in slow decline. Graceful Lily Balfour is her family’s last hope, and she has come to London with one goal–to marry a rich man. Her well-laid plans are balked, however, by the irresistible Major Derek Knight, a handsome highborn soldier and adventurer newly returned from India. Hardened by battles on India’s lawless frontiers, Derek is not just a fighter but a skilled and insatiable lover–a master of the Eastern arts of pleasure. Though Derek finds no shortage of willing women in London, it is the untouchable, aloof Lily who haunts him. After one stolen moment, he hungers for nights of sensual abandon to fulfill her fantasies and free her from her self-imposed prison. But he has come to England on a vital mission, and when Lily is pledged to a wealthy man suspected of corruption, Derek must thwart the treachery that ensnares them both–for only then will ecstasy and the sweet promise of her heart be his to claim.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "Cousy: His Life, Career, and the Birth of Big-Time Basketball",
        "Authors": "By Reynolds, Bill",
        "Description": "It was an era when the game was played for the love of it, and a fledgling NBA struggled for mainstream attention. Bob Cousy was at the heart of basketball's emergence as premier entertainment, a dynamo whose talent and ingenuity dazzled fans and players. The MVP of the 1957 season and veteran of six NBA championships with the Boston Celtics, his trademark behind-the-back dribble and no-look pass gave us basketball as no one had seen it before -- a one-man revolution that set the stage for Wilt Chamberlain, Elgin Baylor, Bill Russell, and others. Here is the fascinating, in-depth story of Cousy's life -- his tenement childhood, his drives and motivations, his little-known personal life, and his record-breaking career -- set against one of the most exciting generations in sports history.",
        "Category": " Sports & Recreation , Basketball",
        "Publisher": "Pocket Star",
        "Price Starting With ($)": "5.52",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Glitter Baby (Wynette, Texas)",
        "Authors": "By Phillips, Susan Elizabeth",
        "Description": "Welcome to the world of the Glitter BabyFleur Savagar is the most beautiful woman in the world . . . to everyone but herself. With her oversized hands and paddle-boat feet, her streaky blond hair and funny green eyes, she lives a life filled with secrets that began before she was born. That was when her bewitching mother left home to find James Dean and met Errol Flynn instead. Now Fleur has to grow up quickly, and life won't make that easy.Jake Koranda is both New York's most brilliant playwright and Hollywood's hottest actor. Difficult, talented, and tormented, he has no patience for international glamour girls, not even ones with beautiful bodies and smart-aleck mouths. But there's more to the Glitter Baby than shine, and Fleur's tougher than Jake expects. Even with the odds stacked against her, she's fiercely determined to discover the woman she's destined to be.An ugly duckling who can't believe she's turned into a swan . . . A tough-guy movie star with a haunted past . . . In a land of broken dreams, can two unlikely lovers trust their hearts?",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Forgotten: A Novel",
        "Authors": "By Stewart, Mariah",
        "Description": "From New York Times bestselling author Mariah Stewart comes a novel of sexy romantic suspense for fans of Nora Roberts, Catherine Coulter, and Karen Robards.WHO SPEAKS FOR THE DEAD WHEN THEY SCREAM BLOODY MURDER? Sheldon Woods kidnapped  and killed an untold number of boys, then escaped the death penalty by making a plea  bargain for multiple life sentences in exchange for revealing the whereabouts of  some of his victims. More than a decade later, the full extent of his crimes is still  unknown, and many of the dead have never been accounted for. But Lisa Walsh is certain  her brother Christopher was one of them, and to honor her mother’s dying wish, she’s on a mission to learn the truth and recover the little boy’s remains. FBI agent  Portia Cahill, tasked with confronting the caged killer, is obliged to play his mind  games to get what she’s after, but she ends up with more than she bargained for when  the remains of another boy’s body are discovered. Determined to ID the mystery child,  Portia reluctantly teams with James Cannon, the attorney who once defended Woods.  But chasing a killer’s grisly legacy, and the bones of the forgotten dead, will lead  them into the lethal orbit of a monster who’s seeding the graves of the past with  a fresh wave of innocent victims.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "365 Day Brighteners; Celebrating God's Grace",
        "Authors": "By DaySpring Cards Inc.",
        "Description": "",
        "Category": "",
        "Publisher": "Garborg's, brand of DaySpring",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Gaining a Yard: The Building of Baltimore's Football Stadium",
        "Authors": "By Morgan, Jon",
        "Description": "",
        "Category": "",
        "Publisher": "Baltimore Sun",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Fresh Faith: What Happens When Real Faith Ignites God's People",
        "Authors": "By Cymbala, Jim and Merrill, Dean",
        "Description": "One thing moves God: faith. Not doctrinal savvy. Not willpower. Trust in God alone stirs him to move miraculously on our behalf. Time and again, Jim Cymbala, author of Fresh Wind, Fresh Fire, has seen the power of faith displayed in the lives of the ordinary people in his church -- and in his own life. He has seen drug addicts and prostitutes set free, marriages restored, and sinners transformed by the love of Jesus Christ. All through the kind of radical, living faith described in this book. Read about it -- and discover how fresh faith can change your life, too.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Shaped by God's love",
        "Authors": "By Briscoe, D. Stuart",
        "Description": "",
        "Category": "",
        "Publisher": "World Wide Publications",
        "Price Starting With ($)": "5.33",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Chicken Soup for the Soul: Woman to Woman: Women Sharing Their Stories of Hope, Humor, and Inspiration",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), and Newmark, Amy (COM)",
        "Description": "1.  Books represent a new thematic experience, even for readers of past books, as Chicken Soup has tightened the content, and books contain only relevant stories.  Out-of-date stories were eliminated.2.  Each book contains 101 stories recompiled from dozens of past Chicken Soup titles.3.  \"Our 101 Best Stories\" collection is an efficient way for new readers to obtain books covering Chicken Soup's most popular topics.4.  Every book has a warm and moving foreward from Jack Canfield and Mark Victor Hansen explaining the company's rebirth and its return to 101 stories per book.Women have always been wonderful sources of inspiration and support for each other.  They are willing to lay bare their souls and share their experiences, even with perfect strangers.  Put two random women together in a room, on an airplane, in a line at the supermarket, and the sharing begins, often at the deepest level. The first Chicken Soup for the Soul book was published in 1993, and became a publishing industry sensation, ultimately selling eight million copies.  The company went on to publish more than 150 Chicken Soup titles, selling more than 100 million copies, and becoming a household name. Chicken Soup for the Soul has won dozens of awards over the past 15 years, and its founders, Jack Canfield and Mark Victor Hansen have become celebrity motivational speakers and authors.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Chicken Soup for the Soul",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Bernstein Remembered",
        "Authors": "By Fluegel, Jane (EDT)",
        "Description": "A pictorial tribute to the late Leonard Bernstein (1918-1990), capturing his expressiveness as composer, conductor, pianist, and teacher, and capturing many other music-world luminaries as well. With an introduction by Donal Henahan and a preface by Isaac Stern. 9x12\". Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Carroll & Graf Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Sea Kayaking Along the Mid-Atlantic Coast: Coastal Paddling Adventures from New York to Chesapeake Bay (AMC Paddlesports S)",
        "Authors": "By Venn, Tasmin",
        "Description": "Recommends kayak routes along the coastal waters of New York, New Jersey, Delaware, Maryland, and Virginia, offers advice on planning a kayak trip, and includes tips on equipment and safety",
        "Category": " Sports & Recreation , Kayaking",
        "Publisher": "Appalachian Mountain Club Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Five on a Hike Together (Knight Books)",
        "Authors": "By Blyton, Enid",
        "Description": "",
        "Category": "",
        "Publisher": "Knight",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1978"
        }
    },
    {
        "Title": "Book of Magic Tricks (Magic Guides Series)",
        "Authors": "By Heddle, R.",
        "Description": "",
        "Category": " Juvenile Nonfiction , Games & Activities , Magic",
        "Publisher": "Usborne Pub Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "That's My Son: How Moms Can Influence Boys to Become Men of Character",
        "Authors": "By Johnson, Rick",
        "Description": "Why are boys so different? Why would a trip to the garbage dump be such a highlight in a boy's life? What do boys need to learn in order to become good men? A mother's influence on her sons is unique and valuable, but still sometimes moms don't understand what makes their boys tick. They want to help their sons grow up to become men of honor and integrity, but that's a tremendous challenge. With refreshing honesty and a man's insight, author Rick Johnson offers the advice, understanding, and support every mom is looking for when it comes to raising godly sons. Using extensive research and humorous personal experiences, he addresses tough issues, such as communication, discipline, sexuality, and respect.Mothers, including single moms as well as grandmothers and teachers, will find wise counsel and reassurance in this practical and helpful book.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Revell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "This Side of Heaven",
        "Authors": "By Kingsbury, Karen",
        "Description": "Annie Warren always wanted the best for her son, Josh. But years of failure and bad choices created a heartbreaking distance that has grown far worse since the day Josh was hit by a drunk driver. Now on medical disability, Josh has put his life on hold for years, waiting for the insurance company to send a settlement that never seems to come. Worse, he believes the story of a scheming woman who claims they have a seven-year-old daughter named Savannah.  Despite the unlikelihood and complete lack of evidence, Josh dreams of being a father and is determined to one day claim the child. His family doesn't know the full story. They don't know what happened the night of the accident that was worth the chronic pain Josh suffers every waking minute, or that he is turning his life around. They haven't seen that Savannah's eyes are his, and they don't know how desperately the little girl needs her family.  When the settlement that rightly belongs to Josh is threatened, Annie sets out to defend her son. But she might find a treasure more valuable than money, one she never expected, one that is the greatest gift her son could ever give her--THIS SIDE OF HEAVEN.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Center Street",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Happy Baby Animals",
        "Authors": "By Douglass, Jo and Graham, Neville",
        "Description": "Happy Baby: Animals from bestselling children's book author Roger Priddy'Soft-to-touch' with simple clear images labelled to increase your child's vocabulary--truly a first book for your baby. -Ideal for 0-18 months.-'Soft-to-touch' cover.-Clear photography introduces babies to the world around them.",
        "Category": " Juvenile Nonfiction , Animals , General",
        "Publisher": "Priddy Books US",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Happy Baby Colors",
        "Authors": "By Priddy, Roger",
        "Description": "A soft-to-touch board book, Roger Priddy’s Happy Baby: Colors is one in a series of perfect first books for your baby.With clear photographic images and simple text labels identifying everyday things and animals—and their colors—this is an ideal introductory book for 0-18 month-olds offering fun and clever ways to increase a child’s vocabulary.",
        "Category": " Juvenile Nonfiction , Concepts , Senses & Sensation",
        "Publisher": "Priddy Books US",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Cuddly Puppies (Feels Real Books)",
        "Authors": "By Gunzi, Christiane",
        "Description": "Boys and girls touch a puppy's thick and fluffy fur, his soft, silky ears, and his  shiny  rubber bone. The lively  Feels Real board books for toddlers are filled with vivid color photos of friendly animals that children love to pet. But Feels Real Books  are more than ordinary picture books. Each of them has a different texture patch on every one of its two-page spreads--surfaces for very young boys and girls to touch. Different textures allow kids to experience the touch of animals' fur or skin. When little hands have opportunity to touch and feel, the animals in these books suddenly come to life.",
        "Category": " Juvenile Nonfiction , Animals , Dogs",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "To the Gates of Richmond: The Peninsula Campaign",
        "Authors": "By Sears, Stephen W.",
        "Description": "An account of the largest campaign of the Civil War weaves together narrative, military analysis, and firsthand testimony from the diaries and letters of Union and Confederate soldiers to reflect on the influence of individuals on events. 25,000 first printing.",
        "Category": " History , Military , General",
        "Publisher": "Ticknor & Fields",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1992"
        }
    },
    {
        "Title": "What if...?",
        "Authors": "By Cowley, Robert (EDT) and Ambrose, Stephen E. (EDT)",
        "Description": "Essays by respected military historians, including Stephen Ambrose, David McCullough, James McPherson, and John Keegan, consider the consequences if history had turned out differently, such as if the weather on D-Day had been worse or if Washington had not escaped from Long Island. 35,000 first printing.",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Secret War for the Union: The Untold Story of Military Intelligence in the Civil War",
        "Authors": "By Fishel, Edwin C.",
        "Description": "Previous histories of the Civil War have explained victory or defeat in terms of the skill of commanders, the fighting qualities of the troops, and resources in men and materiel. Intelligence has been largely ignored, not because it wasn't critically important - Lincoln called it the most difficult problem faced by the Union - but because so little has been known about it. At the end of the war most of the intelligence records disappeared, and they remained hidden for almost a century, until Edwin Fishel uncovered them during the forty years of research that has resulted in this monumental book. The Secret War for the Union is unique among Civil War histories in its reliance on original, previously unknown sources. It is the first book to examine in detail the impact of intelligence, and this intelligence explanation alters, sometimes radically, history's understanding of virtually every campaign. Both enthralling and authoritative, The Secret War for the Union is one of the most important books ever published about the Civil War.",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "The Black Tattoo",
        "Authors": "By Enthoven, Sam",
        "Description": "Jack’s best friend, Charlie, is in serious trouble, possessed by an ancient demon called the Scourge who plans to use Charlie to bring about its evil ends—which, unfortunately, involve the destruction of the entire universe.Now Jack and the butt-kicking, sword-wielding Esme must contend with floating sharks, intelligent jelly, oversized centipedes, gladiator pits, and vomiting bats, all for the sake of saving Charlie from the Scourge.And, hopefully, saving the universe from total and utter annihilation.",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "Razorbill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Spanish Step by Step (Language guides)",
        "Authors": "By Berlitz, Charles",
        "Description": "Read it, speak it, understand it! This contemporary approach enables students of all ages to learn conversational Spanish without frustration.",
        "Category": " Foreign Language Study , Spanish",
        "Publisher": "Wynwood",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Ike and Monty: Generals at War",
        "Authors": "By Gelb, Norman",
        "Description": "Focuses on the pivotal and often volatile military relationship between two great generals of World War II, Dwight Eisenhower, the Supreme Allied Commander, and Bernard Law Montgomery, the prominent British leader",
        "Category": "",
        "Publisher": "Quill",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "American Psychiatric Association's Psychiatric Glossary",
        "Authors": "By Werner, Arnold (CON)",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "Amer Psychiatric Pub Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1984"
        }
    },
    {
        "Title": "The Symphony Orchestra and Its Instruments",
        "Authors": "By Kruckenberg, Sven",
        "Description": "A finely illustrated, comprehensive yet easy-to-use guide by an experienced orchestra administrator explains every facet of the orchestra--its instruments, history, composers, development, and repertoire--for the benefit of beginner and connoisseur alike.",
        "Category": " Music , Genres & Styles , Ballet",
        "Publisher": "Crescent Books",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The Piano",
        "Authors": "By Siepmann, Jeremy",
        "Description": "",
        "Category": " Music , Musical Instruments , Piano & Keyboard",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Sweet Liar",
        "Authors": "By Deveraux, Jude",
        "Description": "Beloved bestselling author Jude Deveraux follows a savvy young woman into the intriguing heart of a past mystery—and into the arms of a once-in-a-lifetime love.It was her father's dying wish that Samantha Elliot search for her grandmother, who'd disappeared from Louisville when she was a baby. So here she was in New York City...her parents dead, her divorce final, and she was all alone....  Michael Taggert was Samantha’s landlord—and she was charmed by this handsome, life-loving man. Yet every time Mike tried to get closer to Samantha, he ran into a brick wall. Now, as he helps her unravel her grandmother’s past—and the dangerous truth about a fateful spring night in 1928 and a seductive jazz singer—Mike slowly reawakens the joy and affection Samantha had buried long ago…",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "The ACT For Dummies",
        "Authors": "By Vlk, Suzee",
        "Description": "There's no escaping the ACT. Many colleges require that you suffer through the ordeal of taking this entrance exam before they will even look at your application. Some colleges emphasize ACT scores to compensate for grade inflation; that is, some high schools may give students A's for doing the same level work that would gain them C's in other high schools. Because the ACT is the same for everyone (students nationwide take the exact same exam), colleges use ACT scores to get inside your head to see what's really in there. Think of this as an opportunity, not a crisis – after all, good ACT scores can overcome low GPAs.No matter how good your high school teachers are, their main goal is to prepare you for the real world – and not the world of the ACT. That's where The ACT For Dummies, 3rd Edition, takes over. Newly revised for the latest version of the exam, this book takes a substantive, but easy-to-understand, approach to helping you prepare for the exam, while at the same time presenting its information in the typical Dummies style – with humor and fun. If anything can make preparing for the ACT enjoyable, this book can.Here's a sampling of what you'll find in The ACT For Dummies, 3rd Edition:An overview of the test: Understanding the format and how the scoring worksStress-busters: How to survive exam dayThings to double-check and things to avoid while taking the testReviews of grammar and spelling, algebra and geometry, reading, and science reasoningPlenty of practice questions for all parts of the testThree full-length ACT practice tests (no, not the real thing!)Top Ten lists debunking ACT rumors, differences between the ACT and SAT, and true ACT storiesYou know you have to take the ACT seriously; after all, it can determine the college you go to, which will, in turn, affect the rest of your life. (Talk about pressure!) So why not be prepared? With The ACT For Dummies, 3rd Edition, you'll be as prepared for the exam as anyone can be, and you may just have a little fun in the process.",
        "Category": " Study Aids , SAT",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Get Fuzzy Experience: Are You Bucksperienced (Volume 4)",
        "Authors": "By Conley, Darby",
        "Description": "Syndicated by United Feature Syndicate, Get Fuzzy appears in 250 newspapers, from the Los Angeles Times to the Detroit Free Press to the Philadelphia Enquirer. Darby Conley's first book, This Dog Is Not a Toy, sold more than 115,000 copies; his second book, Fuzzy Logic, more than 85,000.When he was a child, Darby Conley used to wonder what his beloved pooch was thinking. That curiosity led to his creation of the hilarious strip Get Fuzzy in 1999, which has rapidly become one of the most popular cartoons in newspaper syndication. Showcasing the relationship between Bucky, a temperamental cat with an attitude; the sweet and sensitive dog Satchel; and their mild-mannered human companion, Rob Wilco, Get Fuzzy has cornered the market on anthropomorphic antics.Anyone who finds animals both amazing and amusing will find this new Get Fuzzy collection one of the most bitingly funny books ever printed.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Educating Alice: Adventures of a Curious Woman",
        "Authors": "By Steinbach, Alice",
        "Description": "This funny and tender book combines three of Alice Steinbach’s greatest passions: learning, traveling, and writing. After chronicling her European journey of self-discovery in Without Reservations, this Pulitzer Prize—winning columnist for the Baltimore Sun quit her job and left home again. This time she roamed the world, taking lessons and courses in such things as French cooking in Paris, Border collie training in Scotland, traditional Japanese arts in Kyoto, and architecture and art in Havana. With warmth and wit, Steinbach guides us through the pleasures and perils of discovering how to be a student again. She also learns the true value of this second chance at educating herself: the opportunity to connect with and learn from the people she meets along the way.",
        "Category": " Travel , Special Interest , Adventure",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "First Home with Style (Better Homes & Gardens)",
        "Authors": "By Better Homes and Gardens Books (EDT) and Kramer, Brian (EDT)",
        "Description": "Decorating ideas for kitchens, dining areas, work spaces, bathrooms, living rooms, and bedroomsA decorating primer discusses hanging wall coverings, adding architecture details, and moreA special chapter shows how to create a total look throughout the homeHelps homeowners size up the house shell, take inventory, and work within a budgetShows how to tackle prep work for making decorating changes, adding built-in storage, and injecting personal style",
        "Category": " House & Home , Decorating",
        "Publisher": "Better Homes and Gardens",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Frommer's Rome Day by Day (Frommer's Day by Day - Pocket)",
        "Authors": "By Hogg, Sylvie",
        "Description": "These attractively priced, four-color guides offer dozens of neighborhood and thematic tours, complete with hundreds of photos and bulleted maps that lead the way from sight to sight. Day by Days are the only guides that help travelers organize their time to get the most out of a trip. Full-color package at an affordable priceStar ratings for all hotels, restaurants, and attractionsFoldout front covers with maps and quick-reference informationTear-resistant map in a handy, reclosable plastic walletHandy pocket-sized trimFeatures: Rome's Best Piazzas, Underground Rome, The best museums, and moreFeatures neighborhood walks through Campo de' Fiori, Testaccio, Aventine, and Piazza NavonaIncludes excursions to destinations outside Rome, including Pompeii and TivoliSpecialized tours include Underground Rome, Romantic Rome, and Rome's Best PiazzasDownload a free companion podcast at Frommers.com and learn more about Rome",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Frommer's",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Fodor's Florence's 25 Best, 6th Edition (Full-color Travel Guide)",
        "Authors": "By Perry, Susannah",
        "Description": "25 Best Bets in Florence - Plus a Full Color, Pull-Out Map And the Best of the RestBest museums and galleries • Best Renaissance structures • Best Tuscan cuisine • Best bags, gloves, and shoesEverything you need to explore Florence. ·Top lodging and dining picks for every budget·The Renaissance classics–Il Duomo, Il Campanile, and the palazzi Pitti and Medici-Riccardi·Follow in the steps of Michelangelo, from Casa Buonarroti, his home, to David, his most famous sculpture·What kids want: gelato in every imaginable flavor, Fiorentina soccer matches, canoe rides on the Arno·Great spots for Tuscany's favorite food and wine, including bistecca alla fiorentina, crostini, and Chianti classico·Side trips to Siena, Pisa, and the Tuscan countryside",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "The Children of Green Knowe (Voyager/HBJ Book)",
        "Authors": "By Boston, L. M.",
        "Description": "Tolly comes to live with his great-grandmother at the ancient house of Green Knowe and becomes friends with three children who lived there in the seventeenth century.",
        "Category": "",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "16.17",
        "Publish Date": {
            "Month": "September",
            "Year": "1977"
        }
    },
    {
        "Title": "Captain Kate",
        "Authors": "By Reeder, Carolyn",
        "Description": "While the Civil War rages all around them, Kate enlists the aid of her stepbrother Seth to ferry coal from Cumberland, Maryland, to Georgetown for the good of her family. Reprint.",
        "Category": " Juvenile Fiction , Historical , United States , General",
        "Publisher": "Avon Camelot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The Teachers' Book of Wisdom: A Celebration of the Joys of Teaching",
        "Authors": "By Freeman, Criswell (COM)",
        "Description": "Teachers touch the lives of their students on countless occasions. Each time a single life is touched, even in some small way, eternity is refashioned. Teachers change the ways in which their students look at the world. They provide essentials tools for life beyond the classroom. What is more important than this? The quotations in this book celebrate the joys of teaching. Sources for quotations include Fanny Jackson Coppin, Walt Disney, Ralph Waldo Emerson, William Glasser M.D., Albert Schweitzer, and others.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Walnut Grove",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "John Perkins, land where my father died",
        "Authors": "By PERKINS",
        "Description": "",
        "Category": "",
        "Publisher": "Regal Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The Little Book of Scientific Principles, Theories, & Things",
        "Authors": "By Verma, Surendra",
        "Description": "What is Pythagoras’ Theorem? Who developed the World Wide Web? What is the difference between circadian rhythms and the popular concept of biorhythms? Find out the answers here, where serious science is presented simply, clearly, and chronologically for the layperson. This fascinating and jam-packed little book explains 175 of the most important laws, principles, equations, and theories that form the foundation of the field as we know it. All the great names are featured, including Galileo, Newton, Darwin, and Einstein, as well as more recent contributors such as Rachel Carson, James Lovelock, and Stephen Hawking. It’s an invaluable resource.",
        "Category": " Science , History",
        "Publisher": "Sterling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "The Knopf Collector's Guide to American Antiques: Furniture: Volume 2 - Chests, Cupboards, Desks & Other Pieces (The Knopf Collectors' Guides to American Antiques)",
        "Authors": "By Ketchum, William C., Jr.",
        "Description": "Shows American antique furnishings, lists information about historical background and construction, and price range for each item",
        "Category": "",
        "Publisher": "Knopf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1982"
        }
    },
    {
        "Title": "Mothers And Sons (The Love Between Series)",
        "Authors": "By Exley, Helen (EDT)",
        "Description": "Inspirational quotations",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Prayer Moments with God",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Campbell's Collection: 3 Cookbooks in 1",
        "Authors": "By Ltd. Publications International",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Test Prep: Grade 6 (Flash Kids Harcourt Family Learning)",
        "Authors": "By Flash Kids Editors",
        "Description": "Based on subject areas covered by most state standardized tests, these colorful workbooks provide practice pages, strategies, tips, and full length practice tests to build test taking confidence and skills in subjects such as reading comprehension, vocabulary, language, and math. Harcourt Family Learning Workbooks are a comprehensive line of workbook developed through a partnership with Harcourt, a leading educational publisher. Based on national teaching standards, these workbooks provide complete practice in math, reading, and other key subject areas.",
        "Category": " Juvenile Nonfiction , Language Arts , Vocabulary & Spelling",
        "Publisher": "Flash Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "My Little Word Book (My Little Books)",
        "Authors": "By Priddy, Roger",
        "Description": "Developing language skills and finding out about the world is simple and fun in this fantastic book. Associating simple first words with beautiful pictures will help build your child's vocabulary and encourage speaking and reading skills.",
        "Category": " Juvenile Nonfiction , Language Arts , Vocabulary & Spelling",
        "Publisher": "Priddy Books US",
        "Price Starting With ($)": "5.8",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "The Mystery of Edwin Drood (Oxford Illustrated Dickens)",
        "Authors": "By Dickens, Charles",
        "Description": "The Mystery of Edwin Drood was Dickens' final novel, left unfinished at his death.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "Sports Illustrated 50 Years: The Anniversary Book",
        "Authors": "By Sports Illustrated (EDT) and Deford, Frank (INT)",
        "Description": "A fiftieth anniversary compilation of the best from the Sports Illustrated archives features memorable photographs and articles from the pages of the popular sports magazine since its launch in 1954, offering an entertaining and informative look at great moments in American sports history. 100,000 first printing.",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "Sports Illustrated",
        "Price Starting With ($)": "7.36",
        "Publish Date": {
            "Month": "October",
            "Year": "2004"
        }
    },
    {
        "Title": "Utterly Me, Clarice Bean",
        "Authors": "By Child, Lauren and Child, Lauren (ILT)",
        "Description": "\"Fans of Child's irrepressible, impulsive picture-book heroine — as well as kids who have not yet had the pleasure of making her acquaintance — will devour her first chapter-book adventure.\" — Publishers WeeklyIt's not easy to concentrate at school when mysterious things are happening all around you. In fact, Clarice Bean is starting to feel just like her favorite heroine: Ruby Redfort, schoolgirl detective. Clarice and her utterly best friend, Betty Moody, are planning to ace their book project about Ruby and win the class prize, until Betty disappears into thin air, and horrible teacher Mrs. Wilberton teams Clarice up with the naughtiest boy in school. Will her new partner ruin everything? Will Betty ever come back? And what on earth happened to the silver trophy everyone's hoping to win? Lauren Child brings her trademark wacky wit and eccentric visual energy to a full-length, fastpaced Clarice Bean episode that will charm even the most capricious reader.",
        "Category": " Juvenile Fiction , School & Education",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Accounting The Basis for Business Decisions",
        "Authors": "By Meigs, Robert F. (EDT)",
        "Description": "",
        "Category": " Business & Economics , Accounting , General",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "MIDDLE SCHOOL LIFE SCIENCE: STUDENT TEXT",
        "Authors": "By Jefferson County Public School District",
        "Description": "",
        "Category": " Young Adult Nonfiction , Science & Nature , General",
        "Publisher": "Kendall Hunt Publishing",
        "Price Starting With ($)": "7.04",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Charlie Brown's 'Cyclopedia: Super Questions and Answers and Amazing Facts, Vol. 6: Featuring Planes and Other Things that Fly",
        "Authors": "By Schulz, Charles",
        "Description": "",
        "Category": "",
        "Publisher": "Funk & Wagnalls Co",
        "Price Starting With ($)": "41.75",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "WATERMELON MAGIC Seeds of Wisdom Slices of Life",
        "Authors": "By Wally & Stu Glauberman Amos",
        "Description": "",
        "Category": "",
        "Publisher": "Beyond Words Publishing",
        "Price Starting With ($)": "10.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "1001 Books You Must Read Before You Die",
        "Authors": "By Boxall, Peter (EDT) and Ackroyd, Peter (AFT)",
        "Description": "For discerning bibliophiles and readers who enjoy unforgettable classic literature, 1001 Books You Must Read Before You Die is a trove of reviews covering a century of memorable writing. Each work of literature featured here is a seminal work key to understanding and appreciating the written word.The featured works have been handpicked by a team of international critics and literary luminaries, including Derek Attridge (world expert on James Joyce), Cedric Watts (renowned authority on Joseph Conrad and Graham Greene), Laura Marcus (noted Virginia Woolf expert), and David Mariott (poet and expert on African-American literature), among some twenty others.Addictive, browsable, knowledgeable—1001 Books You Must Read Before You Die will be a boon companion for anyone who loves good writing and an inspiration for anyone who is just beginning to discover a love of books. Each entry is accompanied by an authoritative yet opinionated critical essay describing the importance and influence of the work in question. Also included are publishing history and career details about the authors, as well as reproductions of period dust jackets and book designs.",
        "Category": " Literary Criticism , Books & Reading",
        "Publisher": "Universe",
        "Price Starting With ($)": "7.8",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "The Voyages of Doctor Dolittle (Doctor Dolittle Series)",
        "Authors": "By Lofting, Hugh",
        "Description": "The classic Newbery Medal winner that was transformed into a beloved film.Doctor Dolittle heads for the high seas in perhaps the most amazing adventure ever  experienced by man or animal!Told by 9-and-a-half-year-old Tommy Stubbins, crewman and future naturalist, Doctor Dolittle and company survive a perilous shipwreck and land on the mysterious, floating Spidermonkey Island. There he meets the Great Glass Sea Snail who holds the key to the biggest mystery of all.",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "A Book about Your Skeleton (Hello Reader!)",
        "Authors": "By Bjorkman, Steve (ILT) and Gross, Ruth Belov",
        "Description": "Provides an understanding of the vital tasks performed by the skeleton, which range from protecting soft organs to manufacturing bloodcells",
        "Category": "",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Celebrate!",
        "Authors": "By Lukins, Sheila, Kaminsky, Peter, and Acevedo, Melanie (PHT)",
        "Description": "Time to celebrate! With one purpose only-to bring family and friends together-Sheila Lukins presents Celebrate!, a full-color extravaganza of a book with 46 festive menus, 350 foolproof, with-a-twist recipes in the Silver Palate style, 200 color photographs, and throughout, the passion that's made her one of America's most creative cooks and best-loved food writers.  Here are menus to re-energize traditional holidays-for Thanksgiving serve Maple Ginger Turkey with a piquant Cornbread Chorizo Stuffing. Menus that will turn impromptu gatherings into yearly events--a hearty selection of bowl foods for Super Bowl Sunday, a red-white-and-blue menu for a Memorial Day barbecue, an easy weekday Cozy Dinner for Two. And menus that will inspire whole new reasons to throw a party--The Big Raise (featuring a Blushing Lobster Cocktail), When Spring Has Sprung, The First Summer Tomatoes, a Celebrate Morocco Dinner with Moorish Carrot Soup, Lamb Tagine, Orange Flower Sorbet. Celebrate! is a blueprint for joy, making any time the right time to celebrate and showing just how to pull it off.",
        "Category": " Cooking , Courses & Dishes , General",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "12.96",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    }
]