[
    {
        "Title": "Fortress Introduction to the Gospels",
        "Authors": "By Powell, Mark Allan",
        "Description": "",
        "Category": " Religion , Biblical Studies , New Testament , General",
        "Publisher": "Fortress Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Snakes! (Know-It-Alls)",
        "Authors": "By Nicholas, Christopher and Maydak, Michael S. (ILT)",
        "Description": "Introduces various kinds of snakes, and discusses their habitat, groups, food, communications, defenses, and life cycles",
        "Category": " Juvenile Nonfiction , Animals , Reptiles & Amphibians",
        "Publisher": "McClanahan Book Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Save Me",
        "Authors": "By Scottoline, Lisa",
        "Description": "From the New York Times bestselling author of Think Twice and Look Again comes an emotionally powerful novel about a split-second choice, agonizing consequences, and the need for justice Rose McKenna volunteers as a lunch mom in her daughter Melly’s school in order to keep an eye on Amanda, a mean girl who’s been bullying her daughter. Her fears come true when the bullying begins, sending Melly to the bathroom in tears. Just as Rose is about to follow after her daughter, a massive explosion goes off in the kitchen, sending the room into chaos. Rose finds herself faced with the horrifying decision of whether or not to run to the bathroom to rescue her daughter or usher Amanda to safety. She believes she has accomplished both, only to discover that Amanda, for an unknown reason, ran back into the school once out of Rose's sight. In an instance, Rose goes from hero to villain as the small community blames Amanda’s injuries on her. In the days that follow, Rose's life starts to fall to pieces, Amanda’s mother decides to sue, her marriage is put to the test, and worse, when her daughter returns to school, the bullying only intensifies. Rose must take matters into her own hands and get down to the truth of what really happened that fateful day in order to save herself, her marriage and her family. In the way that Look Again had readers questioning everything they thought they knew about family, Save Me will have readers wondering just how far they would go to save the ones they love. Lisa Scottoline is writing about real issues that resonate with real women, and the results are emotional, heartbreaking and honest.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2011"
        }
    },
    {
        "Title": "Shopping for Identity: The Marketing of Ethnicity",
        "Authors": "By Halter, Marilyn",
        "Description": "In America today, you can connect to your ethnic heritage in dozens of ways, or adopt an identity just for an evening. Our society is not a melting pot but a salad bar--a bazaar in which the purveyors of goods and services spend close to $2 billion a year marketing the foods, clothing, objects, vacations, and events that help people express their (and others') ethnic identities. This is a huge business, whose target groups are the \"hyphenated Americans\"--in other words, all of us.As immigrant groups gain economic security, they tend to reinforce--not relinquish--their ethnic identification. Marilyn Halter demonstrates that, to a great extent, they do it by shopping. And their purchasing power is enormous. How has the marketplace responded to this hunger? Instantly and wholeheartedly: tweaking old products and inventing new ones; launching new brands in supermarkets, new music groups, vacation itineraries, language courses, toys, greeting cards, et cetera. This nexus of business and ethnicity is already seen as the hottest consumer development of this decade, and Halter is uniquely qualified to describe its origins, the exponential growth of products and advertising, and the phenomenal sales of items from salsa to Chieftains CDs.She addresses her subject with an abundance of anecdotal evidence, telling examples of ethnic marketing, and interviews with entrepreneurs (many of them immigrants) who are vigorously seizing the opportunities offered by the business of ethnicity.Shopping for Identity is provocative, intriguing, and farseeing, illuminating an important aspect of our contemporary way of life while validating the yearning we all feel for connection to our roots.",
        "Category": " Business & Economics , Consumer Behavior",
        "Publisher": "Schocken",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "The Weird World of Wes Beattie",
        "Authors": "By Harris, John Norman",
        "Description": "The youngest sprig of a stuffy Toronto family, Wes Beattie is one of life's losers, with a tendency to lie. His fibs have tended to inspire a certain fond exasperation, but now he's gone too far. After narrowly escaping jail for swiping a woman's handbag from a sleazy motel, the hapless Wes is on trial for murder: His uncle has been bludgeoned to death, and the weapon is covered in Wes's fingerprints. Wes's explanations about a frame-up, a villainous gang, and a mysterious sexpot only enrage his already mortified family. But Sidney Gargoyle Grant, a disreputable young lawyer, is irritated by the rush to condemnation, and resolves to untangle the truth.",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Felony & Mayhem",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "New Lives: Survivors of the Holocaust Living in America",
        "Authors": "By Rabinowitz, Dorothy",
        "Description": "The experiences and memories of more than one hundred individuals underly an account of how surviving Jews rebuilt their lives after their liberation from the Nazi death camps",
        "Category": " History , Holocaust",
        "Publisher": "Random House Inc",
        "Price Starting With ($)": "5.59",
        "Publish Date": {
            "Month": "October",
            "Year": "1976"
        }
    },
    {
        "Title": "The Little Mac Iapps Book: A Guide to Apple's Applications, Mac.Com, and More",
        "Authors": "By Williams, Robin and Tollett, John",
        "Description": "The Little Mac Book has taught a generation of readers how to use the Mac and spawned a best-selling series of Little Books that remove the fear from learning by adopting a gentle, non-techie approach to technical topics. It's hard to call a book little, however, when it becomes so thick and chock-full of info that it takes two people to lift it—which is exactly what would have happened if author Robin Williams had tried to fit a detailed discussion of Apple's powerful OS X iApps into her latest edition of The Little Mac Book—called Robin Williams Mac OS X Book, Jaguar Edition. Thus was born this handy companion volume: The Little Mac iApps Book.The Little Mac iApps Book provides detailed coverage of each powerful iApp that Mac OS X installs on your computer: Mail, iCal, iChat, Rendezvous, iPhoto, iTunes, iMovie, Preview, and iDVD. Through tips, techniques, and tutorials, best-selling authors John Tollett and Robin Williams teach not just how to use the individual iApps, but how to use them together and interactively. The book also discusses the benefits of setting up a .Mac account—all in the friendly, funny, unintimidating style you've come to expect from this popular series. If you want to tap the power of Mac OS X's iApps—whether you're a beginner or a veteran Mac user—you need this book.",
        "Category": " Computers , Hardware , Personal Computers , Macintosh",
        "Publisher": "Peachpit Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Financial Freedom: Seven Secrets to Reduce Financial Worry",
        "Authors": "By Linder, Ray",
        "Description": "How much is enough? Having money is becoming increasingly more important in our society.  When questioned, many Americans answered that being financially well-off was more important than raising a family and helping others.  And this is not a phenomenon that is occurring only on the outside of the Church.  Christians are finding themselves lured into the financial freedom trap, as well.Join Ray Linder as he takes a look at what God says about money and our use of it.  See how changing your attitude about what you have is what truly sets you free.  Gain a new perspective on your finances and reduce financial worry with these seven truths:  1. Financial freedom is an attitude, not an amount.  2. Give God you heart, not your money.  3. Spend wisely your money, whatever the amount.  4. Take steps to reduce and control debt.  5. Invest by the book, not by your emotions.  6. Good stewards consider relationships in their decision-making.  7. Trust in the Lord with all your heart. Don't wait any longer.  Now is the time to banish financial worry forever.",
        "Category": " Business & Economics , Personal Finance , Money Management",
        "Publisher": "Moody Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Outside Shooter",
        "Authors": "By Dygard, Thomas J.",
        "Description": "A first-year coach attempts to shape up an uncontrollable yet invaluable player who alienates himself from his team with his outrageous behavior",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Puffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "The Importance of Being Earnest: A Play in Three Acts (Actor's Edition)",
        "Authors": "By Wilde, Oscar",
        "Description": "",
        "Category": "",
        "Publisher": "Samuel French, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "There's a Dead Person Following My Sister Around",
        "Authors": "By Vande Velde, Vivian",
        "Description": "When Ted's five-year-old sister Vicki invents an imaginary friend, no one is too concerned...until they realize that her friend can move things. Ted is sure that Vicki's \"friend\" Marella is a ghost.  But why would a ghost haunt Vicki?  And why does Marella seem to be terrified of another ghost-a dark figure that is haunting Ted? Edgar Award-winner Vivian Vande Velde's blend of history, humor, and suspense is sure to keep middle readers turning the pages!\"A fast-paced story that mixes scares and history for some can't-put-it-down fun.\"-Kirkus Reviews",
        "Category": " Juvenile Fiction , Horror & Ghost Stories",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "A Dictionary of Liturgical Terms",
        "Authors": "By Pfatteicher, Philip H.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Trinity Pr Intl",
        "Price Starting With ($)": "25.04",
        "Publish Date": {
            "Month": "November",
            "Year": "1991"
        }
    },
    {
        "Title": "Excel for Dummies Quick Reference (For Dummies Computer Book)",
        "Authors": "By Walkenbach, John",
        "Description": "This handy quick reference to Excel explains the ins and outs of the popular spreadsheet program in an easy-to-understand text full of practical advice. Original.",
        "Category": " Computers , Desktop Applications , Spreadsheets",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Garden Greetings: Cards, Invitations, and Stationery Inspired by Nature",
        "Authors": "By Jaworski-Stranc, Susan",
        "Description": "",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "Quarry Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "That's No Angry Mob, That's My Mom: Team Obama's Assault on Tea-Party, Talk-Radio Americans",
        "Authors": "By Graham, Michael",
        "Description": "Responsible. Independent. Hard-working. These are qualities which used to define Americans. But now we’re a nation of whiners, blamers, and excuse-makers. So says Michael Graham&#8212radio talk show host, former GOP campaign consultant, and journalist&#8212in his new book, That’s No Angry Mob, That’s My Mom. That’s No Angry Mob, That’s My Mom taps into the frustration and anxiety felt by hundreds of thousands of taxpayers at Tea Parties nationwide. Frustration that the government is taking over our lives; punishing success while rewarding failure; and fostering a society of Americans who don’t take responsibility for their actions and then expect the government&#8212and their fellow citizens&#8212to pick up the bill. Graham, known for his searing wit and controversial comments, also explains who the tea party &#147;activists” really are: ordinary, everyday citizens pushed into action by the threat of higher taxes and increased government intrusion. Tackling everything from the economy and education to health care and the housing market, Graham argues that it’s up to us to take control back from the government bureaucrats and to restore the home-spun values of hard work, fair play, and individual responsibility. That’s No Angry Mob, That’s My Mom shows us how.",
        "Category": " Political Science , Political Ideologies , Conservatism & Liberalism",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2010"
        }
    },
    {
        "Title": "The Next Decade: Empire and Republic in a Changing World",
        "Authors": "By Friedman, George",
        "Description": "The author of the acclaimed New York Times bestseller The Next 100 Years now focuses his geopolitical forecasting acumen on the next decade and the imminent events and challenges that will test America and the world, specifically addressing the skills that will be required by the decade’s leaders. In the long view, history is seen as a series of events—but the course of those events is determined by individuals and their actions. During the next ten years, individual leaders will face significant transitions for their nations: the United States’ relationships with Iran and Israel will be undergoing changes, China will likely confront a major crisis, and the wars in the Islamic world will subside. Unexpected energy and technology developments will emerge, and labor shortages will begin to matter more than financial crises. Distinguished geopolitical forecaster George Friedman analyzes these events from the perspectives of the men and women leading these global changes, focusing in particular on the American president, who will require extraordinary skills to shepherd the United States through this transitional period. The Next Decade is a provocative and fascinating look at the conflicts and opportunities that lie ahead.",
        "Category": " Political Science , General",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2012"
        }
    },
    {
        "Title": "Start Shooting",
        "Authors": "By Newton, Charlie",
        "Description": "“The best way I can describe the Four Corners neighbor­hood of Chicago is find a length of rebar, scratch a big cross into the concrete, set your feet solid in the quadrant you like best, lean back, and start shooting.” Officer Bobby Vargas is hard-edged but idealistic, a Chicago cop who stands at the epicenter of a subterranean plot that will have horrific ramifications for both himself and the entire city. Twenty-five years earlier, a gruesome murder rocked the unforgiving streets of Four Corners. Now, sud­denly, a dying Chicago paper is running a serial exposé on new evidence in that old case, threatening to implicate Bobby and his older brother, Ruben—a decorated, high-ranking detective and cop- prince of the streets. The smear campaign stirs up decades-old bad blood, leading the Vargas brothers down an increasingly twisted and terrifying path, where the sins of the past threaten to destroy what remains of the truth. As readers and critics discovered in his first novel, Calumet City, Charlie Newton’s Chicago is a landscape as brutal and poignant as any in modern crime fiction—a multi-faceted, shockingly violent labyrinth of gangland politics, political backstabbing, corporate malfeasance, and, possi­bly, hope. Start Shooting is a riveting read.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2012"
        }
    },
    {
        "Title": "Citizen-in-Chief: The Second Lives of the American Presidents",
        "Authors": "By Benardo, Leonard and Weiss, Jennifer",
        "Description": "“[A] remarkably revealing history.…This well-researched, opinionated account does a fine job of filling a surprisingly empty historical niche.”—Publishers Weekly Citizen-in-Chief, The Second Lives of the American Presidents, is a smartly researched, surprising, often witty, and always revealing look at former presidents from George Washington to George W. Bush. Authors Leonard Benardo and Jennifer Weiss offer readers entertaining true stories of the radical turns, provocative rehabilitations, and tragic trajectories of presidential lives after the White House. Washington Post columnist Richard Cohen calls Citizen-in-Chief, “an engrossing book, Benardo and Weiss tell a fascinating tale,” and he properly states that where our nation’s leaders went after leading is often “more interesting than the presidency itself.”",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "Food & Wine Reinventing the Classics",
        "Authors": "By Cowin, Dana (EDT)",
        "Description": "Here is an extraordinary collection of recipes from FOOD & WINE, all classics given a unique spin to make them fresh and fun. You'll love these great dishes:  FastSkillet Chicken & Mushroom PotpieChile-Lime Crab Salad Italian-Sausage Burgers with Garlicky Spinach HealthyGuacamole with Charred JalapeñoShrimp & Vegetable Summer RollsGrilled-Chicken Tacos ComfortFlatbread LasagnaCheddar BLT Burgers with Russian DressingApple Pie Bars Chef Recipes Made EasyChilled Spring Pea SoupBucatini CarbonaraButterscotch Sticky Buns International FlavorsShiitake & Scallion Lo MeinThai Green Curry Chicken WingsKorean Beef Stew with Napa Cabbage",
        "Category": " Cooking , General",
        "Publisher": "TI Inc. Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Lonely Planet Jamaica (Serial)",
        "Authors": "By Baker, Christopher P.",
        "Description": "Explores Jamaica's lesser-known attractions, discusses its history and culture, and recommends hotels and restaurants",
        "Category": " Travel , Caribbean & West Indies",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Yes, You Can!: Home Repairs Made Easy",
        "Authors": "By Pastor, Amy Wynn",
        "Description": "America’s favorite carpenter from Trading Spaces uses her years of experience to write the most thorough guide to everyday home repairs.Demystifies repair techniques by providing information other books leave out.Shows how to install a dimmer switch, fix leaky faucets, clean gutters, replace doorknobs, repair broken windows, and more.Pastor’s expert advice can save on costly repair and maintenance bills. A great value and handy resource for any home bookshelf.Gives novice DIYers confidence to fix practically anything.",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "Meredith Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Glam Knits: 25 Designs For Luxe Yarns",
        "Authors": "By Japel, Stefanie",
        "Description": "Chic Knits for Day and NightWhen you see glamour, you know it. Whether it's a woman's perfectly tailored clothing, her expertly chosen accessories, or just something about the way she carries herself, true glam is unmistakable. Glam Knits showcases 26 totally glam designs, all knit with decadent luxe yarns. Whether you choose to knit a sinfully soft cashmere cardigan, a sparkling silk cami or an eye-catching metallic dress, you'll be the walking definition of glamour when you wear your finished creation. And don't forget to knit that special finishing touch. The Glam Knits collection is rounded out with stylish accent pieces like a lacy scarf and a pair of handbags to complete your look.In this follow up to her best-selling Fitted Knits, Stefanie Japel's trademark top-down construction makes the patterns easy to tailor for a perfect fit. All of the patterns are given from extra small to extra large - plus instructions in the front of the book walk you through the ins and outs of modifying a pattern for further easy customization. Go ahead, knit glam. You deserve it.",
        "Category": " Crafts & Hobbies , Needlework , Knitting",
        "Publisher": "North Light Bks",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Great American Brand Name Cookbook Collectors Edition - 1993 publication.",
        "Authors": "By Publications International",
        "Description": "",
        "Category": "",
        "Publisher": "Pub Intl,1993",
        "Price Starting With ($)": "9.45",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Chronological and Background Charts of Church History",
        "Authors": "By Walton, Robert C.",
        "Description": "Charts provide a synthesis and visual overview of information that helps in teaching, learning, and review. Facts, relationships, parallels, and contrasts are grasped easily and quickly. The 84 charts in Chronological and Background Charts of Church History provide a summary of key persons, events, dates, and ideas throughout church history -- from ancient to modern European and American.",
        "Category": " Religion , Christianity , History",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "Programming Jakarta Struts",
        "Authors": "By Cavaness, Chuck",
        "Description": "Web tier frameworks have really taken off in the past year or so.  Developers who used to spend hours and hours writing low-level features have realized the enormous benefits of using well-written frameworks to build the presentation tier so they can get to coding the \"good stuff\", the business logic at the core of the program.The Struts Framework, originally created by Craig R. McClanahan and donated to the Apache Software Foundation's Jakarta project in 2000, has become one of the most popular presentation frameworks for building web applications with Java Servlet and JavaServer Pages (JSP) technology.  It encourages application architecture based on the Model-View-Controller (MVC) design paradigm, colloquially known as the Model 2 approach.As popular as Struts is becoming, the online documentation is inadequate, focusing on the most basic functionality and leaving out information crucial to developers writing today's complex web applications.  O'Reilly's Programming Jakarta Struts was written by Chuck Cavaness after his internet company decided to adopt the framework, then spent months really figuring out how to use it to its fullest potential.  He calls the books, \"the culmination of lessons learned (the hard way) during the building of our application.\"Readers will benefit from the real-world, \"this is how to do it\" approach Cavaness takes to developing complex enterprise applications using Struts, and his focus on the 1.1 version of the Framework makes this the most up-to-date book available.Programming Jakarta Struts covers:An overview of the concepts involved in writing web applicationsDetailed installation and configuration instructions to get Struts up and running quicklyA thorough discussion of how Struts implements the Model-View-Controller pattern, and how to interface with that pattern in your own applicationsJSP and Jakarta Tag Libraries for authoring complex web pagesLogging, Validation, and Exception Handling with StrutsUsing the new Struts template framework, Tiles.Writing internationalization and localization code using StrutsPractical, real-world best practices for web applicationsCraig McClanahan, originator of Struts, says of the book, \"One thing a lot of open source packages lack is a comprehensive guide to all of the features -- something that goes far enough past \"hello, world\" to get you into solving real application design problems, and it looks like you've hit just the right level for a lot of people.\"",
        "Category": " Computers , Programming , General",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Cook's Illustrated 1999",
        "Authors": "By Cook's Illustrated Magazine (EDT)",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Boston Common Press",
        "Price Starting With ($)": "6.91",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Forbidden Knowledge Sex: 101 Sensual Acts NOT Everyone Should Know How to Do",
        "Authors": "By Bailey, Clare",
        "Description": "This is the sex book to end all sex books, as it promises to turn the heat up on your sex life and leave you with a burning sensation, in a good kind of way. It’s risky; it’s sexy; and it’s sure to blow your mind - and plenty of other things. Guaranteed to teach some new tricks (internal ejaculation?) and give plenty of pointers on old favorites (the deluxe handjob - for him and her), each of these 101 entries will provide a titillating and stimulating addition to sex lovers’ erotic arsenals. Within the pages of this four-color pleasure guide, you will learn how to: break out the rope for a tied-up good time; pull off a standing 69; double your pleasure with a ménage à trios; experience a tantric orgasm; get wet and wild with hydro-sex; and more! This book contains all the erotic info you will ever need to push the limits of your sexual fantasies.",
        "Category": " Self-help , Sexual Instruction",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Your Job Survival Guide: A Manual for Thriving in Change",
        "Authors": "By Gunther, Robert E. and Shea, Gregory P., Ph.D.",
        "Description": "Selected by IBM Competitive Edge Book Club Selection.        \"The beauty of this book on top of its life-saving timeliness is its capacity to give the reader concrete steps to live the good life and enjoy it.  The book made me understand that work can be more fun than fun.”   –Warren Bennis, Ph.D., University Professor, University of Southern California, coauthor, Judgment: How Great Leaders  Make Winning Calls and Transparency: How Leaders Create  a Culture of Candor       Change. It’s your job. It just won’t stop. It’s relentless. It keeps coming at you like never-ending rapids in a permanent whitewater river. Change will burn you out if you don’t learn how to handle it. This book is not, however, about mere survival.  It is about thriving amidst the challenges of your permanent whitewater world at work.       •Protect your career, improve your resilience, and seize the opportunities in turbulent times   •Take charge, learn to pace yourself, set your own course, and lead others in ad-hoc teams   •Ride the rapids and rediscover play and adventure in today’s demanding work environment    •Learn from research and the experiences of hundreds of professionals in industries from energy to telecommunications to financial services to health care     There’s nothing abstract or cute about the way this book talks about change: This is practical, grounded knowledge for managing your life in a business world that’s churning with change. Gregory Shea, Ph.D. and Robert Gunther show how to keep your working life on course instead of being pushed beyond your limits...find fun and fulfillment...regroup and rebound from failure...protect yourself from events you can’t predict...take charge of your life, an your future!",
        "Category": " Business & Economics , Organizational Behavior",
        "Publisher": "FT Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Sex and Power",
        "Authors": "By Estrich, Susan",
        "Description": "A hard-hitting look at power dynamics from the first female president of the Harvard Law Review and the author of Making the Case for Yourself offers deep insight into the sexual divide in American culture and politics. 40,000 first printing.",
        "Category": " Social Science , General",
        "Publisher": "Riverhead Hardcover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Expert One-to-One J2EE Development",
        "Authors": "By Johnson, Rod and Hoeller, Juergen",
        "Description": "What is this book about?  Expert One-on-One J2EE Development without EJB shows Java developers and architects how to build robust J2EE applications without having to use Enterprise JavaBeans (EJB). This practical, code-intensive guide provides best practices for using simpler and more effective methods and tools, including JavaServer pages, servlets, and lightweight frameworks. What does this book cover? The book begins by examining the limits of EJB technology — what it does well and not so well. Then the authors guide you through alternatives to EJB that you can use to create higher quality applications faster and at lower cost — both agile methods as well as new classes of tools that have evolved over the past few years. They then dive into the details, showing solutions based on the lightweight framework they pioneered on SourceForge — one of the most innovative open source communities. They demonstrate how to leverage practical techniques and tools, including the popular open source Spring Framework and Hibernate. This book also guides you through productive solutions to core problems, such as transaction management, persistence, remoting, and Web tier design. You will examine how these alternatives affect testing, performance, and scalability, and discover how lightweight architectures can slash time and effort on many projects. What will you learn from this book? Here are some details on what you'll find in this book:  How to find the simplest and most maintainable architecture for your application Effective transaction management without EJB How to solve common problems in enterprise software development using AOP and Inversion of Control Web tier design and the place of the Web tier in a well-designed J2EE application Effective data access techniques for J2EE applications with JDBC, Hibernate, and JDO How to leverage open source products to improve productivity and reduce custom coding How to design for optimal performance and scalability",
        "Category": " Computers , Data Processing",
        "Publisher": "Wrox",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Crafting with Flea Market Fabrics",
        "Authors": "By Harding, Deborah",
        "Description": "A fun and practical guide to sewing, cutting, and gluing bargain acquisitions into decorative accessories, toys, ornaments, and gifts features advice on cleaning and preparing delicate fabrics for trimming, embroidery techniques, patterns, and more.",
        "Category": " Crafts & Hobbies , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "The Bully at Work: What You Can Do to Stop the Hurt and Reclaim Your Dignity on the Job",
        "Authors": "By Namie, Gary and Namie, Ruth, Ph.D.",
        "Description": "The high profile experts on workplace bullying have now completely updated and revised their classic book. A landmark book that blazed light on one of the business world's dirtiest secrets, The Bully at Work exposed the destructive, silent epidemic of workplace bullying that devastates the lives, careers, and families of millions. In this completely updated new edition based on an updated survey of workplace issues, the authors explore new grounds of bullying in the 21st century workplace. Gary and Ruth Namie, pioneers of the Campaign Against Workplace Bullying, teach the reader personal strategies to identify allies, build their confidence, and stand up to the tormentor - or decide when to walk away with their sanity and dignity intact. The Namies' expertise on workplace bullying has been featured in such media outlets as The Early Show, CBS Radio, The Howard Stern Show, CNN, PBS, NPR, USA Today, and the Washington Post. \"Sheds light on one of the business world's dirtiest secrets - corporate bullying.\" -Dayton Business Journal \"Filled with remedies for an ailment that is ravaging workplaces...\" -Harvey A. Hornstein, PhD",
        "Category": " Business & Economics , Workplace Culture",
        "Publisher": "Sourcebooks, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Kiss, Bow, Or Shake Hands: Europe: How to Do Business in 25 European Countries",
        "Authors": "By Morrison, Terri and Conaway, Wayne A.",
        "Description": "Morrison and Conaway present a guide to business travel and etiquette in Europe. They consulted with embassies, representatives from private and public sectors, and academic institutions to compile the information. Contents are arranged by country and address business-related tips; the background of the country (language, history, type of government, viewpoint); natural and human hazards; cultural orientation; business practices such as punctuality and negotiating; and protocol for greetings, forms of address, dress, and the like. A list of resources is included, but there is no bibliography. This edition takes into account countries that have dissolved or emerged since the previous one. Morrison is affiliated with an internet product and training firm for global business travelers. Conaway has co-authored several books on cross-cultural communication. Annotation ©2007 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Business & Economics , International , General",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Macroeconomics (Web-enabled Edition) (4th Edition)",
        "Authors": "By Abel, Andrew B and Bernanke, Ben",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Addison-Wesley",
        "Price Starting With ($)": "7.17",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "First and Forever: The Archdiocese of Baltimore, A People's History",
        "Authors": "By Rafael Alvarez",
        "Description": "",
        "Category": "",
        "Publisher": "Editions du Signe",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Real Goods Solar Living Sourcebook-12th Edition: The Complete Guide to Renewable Energy Technologies & Sustainable Living",
        "Authors": "By Schaeffer, John (EDT) and Pratt, Doug (EDT)",
        "Description": "",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "New Society Publishers",
        "Price Starting With ($)": "8.78",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Teaching at Its Best: A Research-Based Resource for College Instructors (JB - Anker Series)",
        "Authors": "By Nilson, Linda Burzotta",
        "Description": "This best-selling handbook is an essential toolbox—a compilation of hundreds of practical teaching techniques, formats, classroom activities, and exercises—meant to give classroom instructors a go-to guide for help teaching any subject matter. It is for those who teach in traditional contexts as well as those who teach adult and diverse student populations; it is for those who use considerable technology and multimedia resources as well as those who rely on conventional classroom methods.Newly revised and expanded, this edition covers more on the topics relevant to today's classroom such as technology and the Internet, simulations and games, diversity, service learning, and faculty evaluation systems. It also includes entirely new sections on teaching with laptops, course portfolios, three new sections on teaching problem solving, and a new chapter on getting your students to do readings. Other new sections include adult learning, the learning-centered syllabus, the cognitive profile learning styles model, and newly written chapters on classroom management, academic honesty, and grading.Rich with quick tips on a wide range of current issues, this is a guide that all teachers will continuously refer to for development and support of their teaching.Contents include 31 chapters on relevant topics such asUnderstanding your studentsThe complete syllabusYour first day of classMaking the most of office hoursMotivating your studentsTeaching to different learning stylesGetting your students to do the readingsWriting-to-learn activities and assignmentsTeaching students to think and write in the disciplinesScience in the laboratoryAssessing students’ learning in progressTest construction/preparing students for testsEvaluating and documenting teaching effectiveness",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Prevention's Health & Weight-Loss Breakthroughs 2010",
        "Authors": "By Editors of Prevention",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale Press, Inc.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "The 1 Book: How Many People Does it Take to Make a Difference?",
        "Authors": "By Potter, Steve (ILT), Yamada, Kobi, Zadra, Dan, and Wills, Kristel (EDT)",
        "Description": "",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Compendium Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Swing Dancing: Put on Your Dancing Shoes and Get With Hip-Swinging, Toe-Tapping Swing Dancing",
        "Authors": "By Selmon, Simon",
        "Description": "How do you want to get in the swing of things? Perhaps with the East Coast version, with its cool turns? How about the syncopated Hollywood style, filled with footwork? Or maybe you want the jumping and jiving, kick-it-lively, acrobatic lindy hop. Whichever you choose, these dances are loads of fun, not to mention great exercise. And, when you're guided by these show-it-all sequences, that teach you the movement in full, you won't have to worry about having two left feet when you step onto the floor! So--all you have to do is swing, swing, swing!",
        "Category": " Music , Genres & Styles , Dance",
        "Publisher": "ing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Easy Beaded Knits",
        "Authors": "By Trotman, Jeanette",
        "Description": "",
        "Category": " Crafts & Hobbies , Needlework , Knitting",
        "Publisher": "Krause Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Woman on Top: A Sexy, Delicious Fairy Tale",
        "Authors": "By Torres, Fina, Blasi, Vera, and Gasquet, Justine (ILT)",
        "Description": "\"Share it with someone you love.\"An enchanting fable of love, magic, heartbreak, and fabulous cooking, Woman on Top introduces us to Isabella and Toninho, two fiery young lovers whose ardor for each other is matched only by the heat of the spicy, sensuous Brazilian dishes that Isabella creates.Blessed by the gods with incredible beauty and a magic touch for cooking, Isabella was born with only one small flaw: motion sickness so extreme that she must control all of her movements--especially when she makes love to her husband, the dashing Toninho. But when this position problem comes between man and wife, Toninho makes a very unmanly decision that sets in motion a story that sweeps you from the beaches of Brazil to the vibrant streets of San Francisco--a tale of passion so fierce that even the gods can't stop it.With real Brazilian recipes and an authentic spell for reversing the chains of love, Woman on Top is a sexy, playful fairy tale that will stir the heart and tantalize the taste buds.",
        "Category": " Fiction , Fairy Tales, Folk Tales, Legends & Mythology",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Struggle Against History: U.S. Foreign Policy in an Age of Revolution",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "Share the Good News: ESV Outreach Bible",
        "Authors": "By Crossway (COR)",
        "Description": "The ESV Share the Good News® Outreach Bible is a full-size Bible with extra helps. At $4.99, it’s one of Crossway’s most affordable Bibles.",
        "Category": " Bibles , English Standard Version , Text",
        "Publisher": "Crossway",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Putting God on the Guest List, Third Edition: How to Reclaim the Spiritual Meaning of Your Child's Bar or Bat Mitzvah",
        "Authors": "By Salkin, Jeffrey K.",
        "Description": "PMA Best Religion Book of the Year!The inspiring guide to spiritual celebration used in hundreds of congregations—Reform, Conservative, Reconstructionist—revised and expanded!\"Parents and their children acutely feel the social pressures that surround bar and bat mitzvah. But they want to feel the spiritual promise of the event, the pull of the divine, and the knowledge that they are participating in an event that has meaning both in the ancient past and in the very immediate present. They want to know that the steep incline before them is their family's own version of Sinai, the summit where, in every generation, Jews meet God, individually and as a people. They want to know that bar and bat mitzvah can be a path to that summit. And they want to know how to get there. . . . This book can be their guide.\"—from \"Why This Book Was Born\"Helps people find core spiritual values in American Jewry's most misunderstood ceremony—bar and bat mitzvah. In a joining of explanation, instruction and inspiration, Rabbi Salkin helps both parent and child truly be there when the moment of Sinai is recreated in their lives.Rabbi Salkin asks and answers questions that make parents and children more comfortable with the event and able to experience it more joyfully. How did bar and bat mitzvah originate? What is the lasting significance of the event? What are the ethics of celebration? What specific things can you do to reclaim the spiritual meaning of the event? How to further develop spirituality? What spiritual values can parents and young people build together?To help guide friends and family who are not Jewish through this important Jewish life cycle event, Rabbi Salkin provides a brief, welcoming overview: \"What Non-Jews Should Know About the Bar and Bat Mitzvah Service.\"",
        "Category": " Religion , Judaism , Rituals & Practice",
        "Publisher": "Jewish Lights",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Radical Reliance: Living 24/7 with God at the Center",
        "Authors": "By Stowell, Joseph M.",
        "Description": "God alone can sustain and satisfy our souls. Do we know this reality? Do we thirst for it? Exploring the biblical background of the answers to these questions, nationally known Bible teacher Joe Stowell shows the way to make these truths real in our daily lives. When God is at the center of our lives 24/7, this is radical reliance - total trust - and it's the way God meant it to be. Follow the author on his journey of faith and meet Christ anew. Begin to walk by a deeper faith and enjoy the delight and security of His presence.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Our Daily Bread Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "When God Prayed",
        "Authors": "By Wilton, Don",
        "Description": "",
        "Category": "",
        "Publisher": "B&H Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "The Tulip Tree: a Novel",
        "Authors": "By Howard Rigsby",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Liberated Latin,",
        "Authors": "By Shaw, Dick",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1951"
        }
    },
    {
        "Title": "Pebble Pets: 30 Lovable Companions Crafted from Pebbles and Paper",
        "Authors": "By Biddle, Steve and Biddle, Megumi",
        "Description": "Pebble Pets features a unique collection of delightful rock animal designs that are packed with personality, making them the perfect desktop companion. The 30 loveable creatures are created with easy techniques including layering rocks with paper, molding details out of modeling clay and creating faux fur. Plus, cute accessory projects accompany the pets, including collars, bones, dishes and beds. The easy-to-follow techniques and clear step-by-step instructions combined with adorable photography make it hard to resist these newfound friends.",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "David and Charles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2009"
        }
    },
    {
        "Title": "Storm Gathering (The Storm Series #2)",
        "Authors": "By Gutteridge, Rene",
        "Description": "In this exciting prequel to The Splitting Storm, we meet Mick Kline at a time when his life is spiraling out of control. Mick finds himself accused of the kidnapping of a woman he hardly knows, and he refuses to turn to his estranged brother for help.",
        "Category": " Fiction , Religious",
        "Publisher": "Tyndale House Publishers, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "1,001 Old-Time Garden Tips",
        "Authors": "By ROGER, EDITOR YEPSEN",
        "Description": "",
        "Category": "",
        "Publisher": "RODALE, 1997",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Instant Meditation for Stress Relief: Breathing Techniques and Mental Exercises for an Immediate Sense of Calm and Well-Being (The New Life Library Series)",
        "Authors": "By Hudson, John",
        "Description": "",
        "Category": " Self-help , Meditations",
        "Publisher": "Lorenz Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "No More Debt!: God's Strategy for Debt Cancellation",
        "Authors": "By Dollar, Creflo A.",
        "Description": "",
        "Category": " Religion , Christianity , Literature & the Arts",
        "Publisher": "Creflo Dollar Ministries",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Trophies: Student Edition Grade 1-5 Gather Around 2005",
        "Authors": "By Beck, Isabel L., Farr, Roger C., Strickland, Dorothy S., Ada, Alma Flor, and Brechtel, Marcia",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "HARCOURT SCHOOL PUBLISHERS",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Culture and Values: Alternate Edition",
        "Authors": "By Cunningham, Lawrence S. and Reich, John J.",
        "Description": "",
        "Category": "",
        "Publisher": "Holt, Rinehart & Winston",
        "Price Starting With ($)": "6.87",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "Lose 200 Lbs This Weekend: It's Time to Declutter Your Life",
        "Authors": "By Aslett, Don, Lagory, Craig (ILT), and Cartaino, Carol (EDT)",
        "Description": "",
        "Category": " House & Home , Cleaning, Caretaking & Organizing",
        "Publisher": "Marsh Creek Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Hey, Diddle, Diddle: and other favorite nursery rhymes",
        "Authors": "By Wood, Hannah (ILT)",
        "Description": "Introduces children to the three little kittens, Old Mother Hubbard, the Muffin Man, Peter Piper and other beloved characters, in a lively board book with soft padded covers, rounded corners and sturdy board pages. 35,000 first printing.",
        "Category": " Juvenile Fiction , Imagination & Play",
        "Publisher": "Tiger Tales",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2012"
        }
    },
    {
        "Title": "The Everything Body Language Book: Decipher signals, see the signs and read people’s emotions―without a word!",
        "Authors": "By Hagen, Shelly",
        "Description": "Shifty eyes? Your boss is lying. Wide, open eyes? Your blind date is definitely interested. Crossed arms? Your mother-in-law is feeling defensive.You can read anyone's body language&#151;if you know how and where to look. Master the art of nonverbal communication and you'll unlock the secrets of everyone you meet&#151;yourself included!Learn how to:Identify an aggressive handshakeRecognize a genuine smileDisplay self confidenceTell when your child is fibbingShow your date you're interested When you can interpret body language, you're literally clued in to the world around you&#151;and everyone in it. Whether you're at work, at home, or even on a blind date, The Everything Body Language Book is your ticket to understanding people&#151;one wink, blink, and nod at a time!",
        "Category": " Self-help , Emotions",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Adventures of Biscuit: Five Stories of Everyone's Favorite Puppy (I Can Read Series)",
        "Authors": "By Alyssa Satin Capucilli",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes_Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Guide for recreation hand crafts",
        "Authors": "By Picareff, Anton",
        "Description": "",
        "Category": "",
        "Publisher": "[Printed by Brailow Press for A.P. Hand Crafts Studios]",
        "Price Starting With ($)": "19.71",
        "Publish Date": {
            "Month": "January",
            "Year": "1936"
        }
    },
    {
        "Title": "The Miracle of Intention: Defining Your Success",
        "Authors": "By Pat Davis",
        "Description": "",
        "Category": "",
        "Publisher": "Network Marketing Tutor, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "My Guardian Angel: Helper and Friend",
        "Authors": "By Donaghy, Thomas J.",
        "Description": "Describes the origin and role of the guardian angel in the Roman Catholic tradition, and shows the many ways in which Catholics believe that guardian angels guide and help children.",
        "Category": " Juvenile Nonfiction , Religion , Christianity",
        "Publisher": "Catholic Book Pub Co",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Patterns in Java, Volume 1, A Catalog of Reusable Design Patterns Illustrated with UML",
        "Authors": "By Grand, Mark",
        "Description": "\"This is the best book on patterns since the Gang of Four's Design Patterns. The book manages to be a resource for three of the most important trends in professional programming: Patterns, Java, and UML.\" -Larry O'Brien, Founding Editor, Software Development, on Patterns in Java, Volume 1  Picking up where he left off in his bestselling Patterns in Java, Volume 1, Mark Grand arms you with 50 new and reusable Java patterns-some available for the first time-that help you create more elegant and reusable designs. As with Volume 1, each pattern is documented in UML and, where appropriate, a code example or an example in the core Java API is provided. Volume 2 gives you: * 7 GRASP patterns that show you how to assign responsibilities to classes * 12 GUI Design patterns * 13 Organizational Coding patterns that help you to structure your code for readability and easier maintenance * 5 Coding Optimization patterns help to improve your program's performance in ways that a compiler's automatic optimizations cannot * 5 Code Robustness patterns * 8 Testing patterns that describe different methods for software testing, including Black Box, Clean Room, and System Testing * Real-world case studies that illustrate when and how to use the patterns * A tutorial for writing your own designs in UML * Pointers on using UML and patterns in development analysis, implementation, and testing * Tons of sample code  The CD-ROM contains: * All the code examples found in the book * Evaluation versions of Together/J Whiteboard Edition from Object International (www.togetherj.com), OptimizeIt from Intuitive Systems, AssertMate version 1.0 from Reliable Software Technologies, and jtest! and CodeWizard for Java(TM) from ParaSoft",
        "Category": " Computers , Programming , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Enemy in Sight!",
        "Authors": "By Kent, Alexander",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley Medallion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Cooking Kosher the New Way",
        "Authors": "By Kinderlehrer, Jane",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , Jewish & Kosher",
        "Publisher": "Jonathan David Pub",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "A Bride Unveiled: The Bridal Pleasures Series",
        "Authors": "By Hunter, Jillian",
        "Description": "Violet Knowlton is betrothed to the sensible, if tedious, Sir Godfrey  Maitland. When Godfrey escorts her to a fencing demonstration, she  looks forward to the adventurous diversion, but everything changes when  she realizes the swordsman displaying his skill-and dashing good looks- is none other than her childhood friend Kit. Soon the flames of their forbidden past ignite into a passion neither  can refuse. Although Violet has been promised to another, Kit remains  her first and only love. He vows he will possess her, no matter what  stands in his way...",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2011"
        }
    },
    {
        "Title": "Perl Graphics Programming: Creating SVG, SWF (Flash), JPEG and PNG files with Perl",
        "Authors": "By Wallace, Shawn",
        "Description": "Graphics programmers aren't the only ones who need to be proficient with graphics. Web and applications programmers know that a dull web page can be quickly transformed into one that's interesting and lively with the use of well-planned graphics. And fortunately, you don't need the skills of a fulltime graphics programmer to use graphics effectively. From access counters and log report graphs to scientific plots and on-the-fly animated GIFs, graphics scripting is within the grasp of most web programmers.  Using open source software, like Perl, you have the power to dynamically generate graphics based on user input and activity, easily manipulate graphics content, and optimize graphics for compression and quality.Geared toward Perl users and webmasters, Perl Graphics Programming focuses on open-source scripting programs that manipulate graphics files for use on the Web.  The book demystifies the manipulation of graphics formats for newcomers to the Web with a practical, resource-like approach.  With this book you'll learn to:Generate dynamic web graphics with charts, tables, and buttonsAutomate graphics tasks (thumbnails and borders)Create dynamics web documents (PDF, Postscript)Produce rich Internet experiences with Flash and SVGYou'll begin with a tour of the most common web graphic file formats--PNG, JPEG, GIF, SWF, SVG, Postscript and PDF--then you'll explore the most powerful tools and Perl modules available for manipulating these graphics, such as GD, PerlMagick, and GIMP. Included in this part of the book is a thorough description of the Ming module for creating on-the-fly Flash files. Next, a \"cookbook\" section includes practical, all purpose recipes: GIF animation, generating images within a dynamic application, communicating between SWF front-end and Perl back-end, XSLT transformations, compression, and much more.Perl programmers naturally turn to Perl to tackle whatever challenge they have at hand, and graphics programming is no exception.  Perl Graphics Programming provides all the tools you need to begin programming and designing graphics for the Web immediately. This book will change how you think about generating and manipulating graphics for the Web.",
        "Category": " Computers , Programming Languages , JavaScript",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "NIV Student Bible Compact Edition",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Artful Spaces: DIY Wall Art for the Home",
        "Authors": "By Smith, Gerard",
        "Description": "Create Wall Art that Reflects Your Style Looking for quick, creative ways to add art to the spaces in your home? You?ll find them here. Artful Spaces gives you just what you want - art projects that actually look good and take hardly any time at all. And the best part: There?s no experience needed. Artful Spaces demonstrates basic techniques in a humorous, unpretentious way that lacks jargon but is full of practical advice - from selecting the best paints, brushes and surfaces (while staying on a budget) to choosing the right colors for a painting and even hanging the finished canvas.    There?s no end to the creative ideas in the book?s 24 projects. Learn how to create designs with stencils, CDs, bottles, coffee cups, potatoes and even the side of a cereal box. Add texture to your canvas with collages of decorative paper, tissue paper or  posters. Use spray paint and markers to create paintings inspired by street art. The possibilities are endless. Complete materials lists, step-by-step photos, tips and templates make the projects easy to complete. There?s also information on where to find inspiration and how to create a visual journal to help you create designs of your own. Grab some paint and a canvas, and start transforming your walls!",
        "Category": " House & Home , Decorating & Furnishings",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Chicken Soup for the Shopper's Soul: Celebrating Bargains, Boutiques and the Never-Ending Quest for the Perfect Pair of Shoes (Chicken Soup for the Soul)",
        "Authors": "By Canfield, Jack (COM), Hansen, Mark Victor (COM), and Peluso, Theresa (COM)",
        "Description": "Shopaholics Unite!You know it when you find it: the perfect black dress, the welcome mat for your first home, the yellow bunny sheets for your best friend's baby shower, the laundry basket your nephew will never use in college. Whatever the mission, shopping for yourself and others marks life's milestones, celebrates your passions and expresses your individuality. And most important, shopping is just plain fun!Whether your preferred stomping ground is an antique shop or a mega mall, a bargain basement or a boutique, a flea market or Fifth Avenue, you'll be thoroughly entertained, inspired and validated by the true-life shopping adventures of like-minded people like you—people who freely admit they were Born to Shop—and who never cease to find fulfillment, enjoyment and a few great buys while doing it.Chicken Soup for the Shopper's Soul is the ultimate celebration of the ultimate pastime. Let the bargains begin!",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "HCI",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "The Happy Egg",
        "Authors": "By Krauss, Ruth and Johnson, Crockett (ILT)",
        "Description": "The magical transition between a chick’s immobilization in its egg to its first moments of hatched life as a walking, chirping, and wing-flapping creature is told in a simple tale with colorful illustrations.",
        "Category": " Juvenile Fiction , Animals , Birds",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "February",
            "Year": "2005"
        }
    },
    {
        "Title": "Dolls' Houses: Life in Miniature",
        "Authors": "By Glubok, Shirley",
        "Description": "Presents twenty-six miniature historic houses reflecting the arts and cultures of various times and places, from the seventeenth century to the present.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Olympic Marketing Corp",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "Guests of God: Stewards of Divine Creation",
        "Authors": "By Hellwig, Monika K.",
        "Description": "",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Paulist Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Wild Roses",
        "Authors": "By Caletti, Deb",
        "Description": "Cassie is falling in love with her stepfather Dino’s brilliant young violin student, all while trying to cover up his increasingly erratic behavior, in this story of intense love, family, and secrets from Printz Honor medal winner and National Book Award finalist Deb Caletti.Seventeen-year-old Cassie Morgan lives with a time bomb, a.k.a. her stepfather, Dino Cavalli. To the public, Dino is a world-renowned violin player and composer. To Cassie, he’s an erratic, self-centered bully. And he’s getting worse. Dino no longer sleeps, and he grows increasingly paranoid. Before, Cassie was angry. Now she is afraid. Enter Ian Waters: a brilliant young violinist, and Dino’s first-ever student. The minute Cassie lays eyes on Ian she knows she’s doomed to fall head-over-heels in love with him. Cassie thought she understood that love could bring pain, but this union will have consequences she could not have imagined.",
        "Category": " Young Adult Fiction , Family , Blended Families",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "The Templar Salvation (A Templar Novel)",
        "Authors": "By Khoury, Raymond",
        "Description": "From New York Times bestselling author Raymond Khoury comes a “a full-throttle action-adventure thriller” (Library Journal) that's even more shocking and explosive than The Last Templar…   Constantinople, 1203: As the ravaging armies of the Fourth Crusade lay siege to the city, a secretive band of Templars infiltrate the imperial library. Their target: a cache of documents that must not be allowed to fall into the hands of the Doge of Venice. They escape with three heavy chests, filled with explosive secrets that these men will not live long enough to learn...   Vatican City, present day: FBI agent Sean Reilly infiltrates the Pope's massive Vatican Secret Archives of the Inquisition. No one but the Pope's trusted secondi is allowed in--but Reilly has earned the Vatican's trust, a trust he has no choice but to violate. A vicious, uncompromising terrorist bent on revenge has kidnapped Tess Chaykin, and the key to her freedom lies in this underground crypt, in the form of a document known as the Fondo Templari—the secret history of the infamous Templars...",
        "Category": " Fiction , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2011"
        }
    },
    {
        "Title": "The Skeptic's Guide to Conspiracies: From the Knights Templar to the JFK Assassination: Uncovering the [Real] Truth Behind the World's Most Controversial Conspiracy Theories",
        "Authors": "By Cook, Monte",
        "Description": "Did the noble order of the Knights Templar guard a secret about Jesus’ birth?Was the moon landing faked in a Hollywood movie studio?Is the government keeping the remains of an alien spacecraft in the top-secret Area 51?Monte Cook takes a look at conspiracy theories—ranging from the historically complex to the seriously whacked out. With a disbelieving eye, he traces the history of some of the world's weirdest ideas and even includes a chart showing readers how to make up conspiracy theories for themselves.Scattered through the book are the paranoid \"notes\" of an anonymous reader who claims to know what's really going on. You can make up your own mind as to who's telling the truth!",
        "Category": " Reference , Trivia",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "9.01",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Webster's Dictionary for Students, New Edition",
        "Authors": "By Merriam-Webster (EDT)",
        "Description": "Updated with the words kids need to know now, this is the ideal dictionary for students in the second through sixth grades.  The word list is based on expert research incorporating age-appropriate vocabulary.  Definitions are clear and easy to understand.  This value-priced dictionary is a teacher-approved resource for home and school.Features of this Book: More than 32,000 words and phrases; Kid-friendly definitions are written in clear, concise language; Special sections include: Abbreviations, Confused, Misused, or Misspelled Words, Ten General Spelling Rules, Ten Rules for Forming Plurals, Frequently Misspelled Words; Ideal for students learning dictionary skills",
        "Category": " Juvenile Nonfiction , Reference , Dictionaries",
        "Publisher": "Federal Street Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "How to Take Over Teh Wurld: A LOLcat Guide 2 Winning",
        "Authors": "By Professor Happycat and Icanhascheezburger. com",
        "Description": "In I Can Has Cheezburger?, Professor Happycat brought LOLcats to the wurld. Nao he has gone back to his lair for 200 all-new LOLcats that give all aspiring kittehs the lessons they need to take over teh world (or at least their hoomins). A LOLcat is a picture of a cat with a funny, misspelled, caption. LOLcats are from the Internets and are full of win!!1!] icanhascheezburger.com was founded in January 2007 and has been at the center of the worldwide LOLcat craze ever since. The same folks run failblog.org, graphjam.com, and other sites.",
        "Category": " Humor , Topic , Animals",
        "Publisher": "Avery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "diary of a wimpy kid. rodrick rules",
        "Authors": "By Jeff Kinney",
        "Description": "",
        "Category": "",
        "Publisher": "Abrams",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Walt Disney's the Jungle Book: Mowgli's Journey (A Surprise Lift-the-Flap Book)",
        "Authors": "By Mateu, Frank (ILT)",
        "Description": "Young readers will discover their favorite characters from the animated film, The Jungle Book--Baloo, King Louie, Kaa, and others--hidden under cleverly designed flaps.",
        "Category": "",
        "Publisher": "Disney Pr (Juv Trd)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Daddy Long Legs",
        "Authors": "By webster, jean",
        "Description": "An anonymous benefactor offers to pay for the education of seventeen-year-old Jerusha Abbott, the oldest orphan at the John Grier Home",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "Coastal Ghosts: Haunted Places from Wilmington North Carolina to Savannah Georgia",
        "Authors": "By Rhyne, Nancy",
        "Description": "Tales of mysterious and inexplicable happenings in various places in North Carolina, South Carolina, and Georgia.",
        "Category": " Body, Mind & Spirit , Unexplained Phenomena",
        "Publisher": "Sandlapper Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Scholastic Reader Level 1: Clifford: Clifford's Busy Week",
        "Authors": "By Bridwell, Norman",
        "Description": "It only takes a little to BE BIG!It's Sunday, and Clifford and Emily Elizabeth are going to visit her grandma. But Clifford can't find Mr. Squeaky, his favorite toy mouse! Emily Elizabeth and Clifford return to the places they visited the previous week to look for Mr. Squeaky. Where could he be?The BE BIG campaign invites everyone, big and small, to take action and raise awareness for how CLIFFORD'S BIG IDEAS can make the world a better place.Clifford's Big Ideas are:Be a Good Friend * Share * Be Kind * Help Others * Be Truthful * Have Respect * Be Responsible * Play Fair * Work Together * Believe in Yourself",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Cartwheel Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "365 Ways to Get a Good Night's Sleep",
        "Authors": "By Kotler, Ronald L., M.D., Karinch, Maryann, and Cantor, Charles R. (FRW)",
        "Description": "We spend about one third of our lives asleep—but we still feel tired. Without a good eight hours, we end up head-bobbing at work and drinking enough coffee to fuel a jet!This book addresses the surprisingly complex issue of sleep in easy-to-tackle steps. This exhaustive guide brings shuteye within reach as it explains how to:Pay back a sleep debtNap without throwing off nighttime rest Deter disturbing dreamsHandle a sleepwalker (or night-eater!)Take a bite out of teeth grinding, and more!It’s usually not a good thing for a book to put you to sleep. But this one-way ticket to dreamland will help you go from counting sheep to fast asleep!",
        "Category": " Health & Fitness , Sleep & Sleep Disorders",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2009"
        }
    },
    {
        "Title": "Abnormal Psychology, Fourth Edition",
        "Authors": "By Emery, Robert E. and Oltmanns, Thomas F.",
        "Description": "This new edition retains the book's engaging and innovative systems approach, integrating the biological, psychological, and social perspectives in one concurrent story. Scientific methods are presented in a clear and non-threatening manner, and are based on the most current research.  Chapter topics include personality disorders, eating disorders, substance use disorders, sexual and gender identity disorders, schizophrenic disorders, mood disorders and suicide, treatment of psychological disorders, and more.  For psychologists, psychiatrists, and professionals in the mental health field.",
        "Category": " Psychology , Psychopathology , General",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "8.06",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Astronauts (Rookie Read-About Science)",
        "Authors": "By Bredeson, Carmen",
        "Description": "Introduces the work of astronauts, including special jobs they might have on the space shuttle and experiments they might perform in space.",
        "Category": " Juvenile Nonfiction , Technology , Aeronautics, Astronautics & Space Science",
        "Publisher": "Childrens Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Langenscheidts Universal-Worterbuch Englisch (English-German and German-English Dictionary) (English and German Edition)",
        "Authors": "By Anonymous",
        "Description": "",
        "Category": "",
        "Publisher": "Langenscheidt Pub Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1981"
        }
    },
    {
        "Title": "Dating the Younger Man: A Complete Guide to Every Woman's Sweetest Indulgence",
        "Authors": "By Targosz, Cyndi",
        "Description": "Remember back when women traded on their beauty and men traded on their wealth and power? Well, the times, they are a changin’. As women grow more successful and financially independent, they are abandoning their mothers’ “marry rich” mantra in favor of “it’s as easy to fall in love with a handsome man as an ugly one.” In this book, the sensational Cyndi Targosz teaches women of all ages the ins and outs of these lusty, and surprisingly long-lasting, affairs. Sprinkled with real-life stories of successful alliances, readers learn the truth about relationships with the sometimes younger, always sexier, hunky men women increasingly love to call their own.",
        "Category": " Psychology , Interpersonal Relations",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "AIR POWER AND WARFARE",
        "Authors": "By Alfred Hurley",
        "Description": "",
        "Category": "",
        "Publisher": "Department of the Air Force",
        "Price Starting With ($)": "8.9",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The Wall Street Journal Guide to Understanding Personal Finance, 3rd Edition: Mortgages, Banking, Taxes, Investing, Financial Planning, Credit, Paying for Tuition",
        "Authors": "By Morris, Kenneth M. and Siegel, Alan M.",
        "Description": "An updated third edition of this classic financial tool offers readers a comprehensive guide to virtually every real-life financial decision they might face, as well as a thorough explanation of underlying issues and pitfalls. Original. 75,000 first printing.",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Simple Solutions: Bathrooms",
        "Authors": "By Cahill, Coleen and Steves, Gale C. (FRW)",
        "Description": "From handling an awkwardly shaped space, planning for recessed cabinets, and acquiring a slip-resistant tub to fitting a home spa, adding light and ventilation, and bringing in a touch of the outdoors, these simple solutions resolve your decorating problems quickly and thoroughly.  “Provides ideas on redesigning existing baths as well as converting other spaces into bathrooms.”—Library Journal.",
        "Category": " House & Home , Decorating",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Innovation: Create an Idea Culture. Redefine Your Business. Grow Your Profits",
        "Authors": "By Gorman, Tom",
        "Description": "",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "6.44",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Spanish Grammar (SparkCharts)",
        "Authors": "By SparkNotes (EDT)",
        "Description": "SparkChartsTM?created by Harvard students for students everywhere?serve as study companions and reference tools that cover a wide range of college and graduate school subjects, including Business, Computer Programming, Medicine, Law, Foreign Language, Humanities, and Science. Titles like How to Study, Microsoft Word for Windows, Microsoft Powerpoint for Windows, and HTML give you what it takes to find success in school and beyond. Outlines and summaries cover key points, while diagrams and tables make difficult concepts easier to digest.  This four-page chart reviews:NounsArticlesAdjectivesPronounsParticiplesVerb tenses and irregularitiesReflexivesSubjunctivesAdverbsImperativesPrepositions and conjunctionsSpecial verbsExpressions of duration, time, negation, and suffixes",
        "Category": " Study Aids , General",
        "Publisher": "SparkCharts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Flash and Bones",
        "Authors": "By Reichs, Kathy",
        "Description": "Kathy Reichs—#1 New York Times bestselling author and producer of the FOX television hit Bones—returns with a riveting new novel set in Charlotte, North Carolina, featuring America’s favorite forensic anthropologist, Dr. Temperance Brennan. Just as 200,000 fans are pouring into town for Race Week, a body is found in a barrel of asphalt next to the Charlotte Motor Speedway. The next day, a NASCAR crew member comes to Temperance Brennan’s office at the Mecklenburg County Medical Examiner to share a devastating story. Twelve years earlier, Wayne Gamble’s sister, Cindi, then a high school senior and aspiring racer, disappeared along with her boyfriend, Cale Lovette. Lovette kept company with a group of right-wing extremists known as the Patriot Posse. Could the body be Cindi’s? Or Cale’s? At the time of their disappearance, the FBI joined the investigation, only to terminate it weeks later. Was there a cover-up? As Tempe juggles multiple theories, the discovery of a strange, deadly substance in the barrel alongside the body throws everything into question. Then an employee of the Centers for Disease Control and Prevention goes missing during Race Week. Tempe can’t overlook the coincidence. Was this man using his lab chemicals for murder? Or is the explanation even more sinister? What other secrets lurk behind the festive veneer of Race Week? A turbocharged story of secrets and murder unfolds in this, the fourteenth thrilling novel in Reichs’s “cleverly plotted and expertly maintained series” (The New York Times Book Review). With the smash hit Bones about to enter its seventh season and in full syndication—and her most recent novel, Spider Bones, an instant New York Times bestseller—Kathy Reichs is at the top of her game.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Scribner",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "August",
            "Year": "2011"
        }
    },
    {
        "Title": "Seizure (Virals #2)",
        "Authors": "By Reichs, Kathy",
        "Description": "The second novel in the Virals trilogy from #1 bestselling author and inspiration for the TV series Bones - Kathy Reichs!Ever since Tory Brennan and her friends rescued Cooper, a kidnapped wolf pup with a rare strain of canine parvovirus, they've turned from regular kids into a crime-solving pack! But now the very place that brought them together - the Loggerhead Island Research Institute - is out of funding and will have to shut down. That is, unless the Virals can figure out a way to save it!So when Tory learns of an old Charleston legend about a famous she-pirate, Anne Bonney, whose fortune was never found, she can't believe her luck - buried treasure is exactly what she needs to save the Institute on Loggerhead! Trouble is, she and her friends aren't the only ones looking for it. And this time, the Virals' special powers may not be enough to dig them out of trouble . . .",
        "Category": " Young Adult Fiction , Health & Daily Living , Diseases, Illnesses & Injuries",
        "Publisher": "Razorbill",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "October",
            "Year": "2011"
        }
    },
    {
        "Title": "The Dukan Diet: 2 Steps to Lose the Weight, 2 Steps to Keep It Off Forever",
        "Authors": "By Dukan, Pierre",
        "Description": "# 1 international bestselling diet book coming to North America Devised by Dr. Pierre Dukan, a French medical doctor who has spent his career helping people to lose weight, the Dukan Diet rejects counting calories and promises permanent weight loss while allowing adherents to eat as much as they like.  Originally published in 2000, the Dukan Diet swept across France, championed by people who successfully lost weight following its unique four phase regime. The Dukan Diet has helped millions in France, where it has been number one for more than ten years and adopted in twenty countries, including the United Kingdom, Poland, Korea and Brazil. All together, The Dukan Diet has sold more than 3 million copies worldwide.  The Diet: 4 Easy Steps to Permanent Weight Loss Phase one: AttackUsing Dr. Dukan's True Weight calculator, dieters determine a reasonable and healthy weight loss goal. Then they begin the Dukan Attack phase a two-to-seven-day period during which only unlimited lean protein and a daily Oat bran galette (or pancake) are consumed and dramatic weight loss is achieved. Phase Two: CruiseDieters alternate days of unlimited lean protein with days of protein combined with healthful vegetables until they reach their True Weight.  Phase Three: ConsolidationDieters stay on this phase for 5 days for every pound lost. At this point the diet allows unlimited protein and vegetables, and other foods (such as cheese and bread) are reintroduced.  Dieters are also allowed two weekly celebration meals to stave off boredom. Phase Four: StabilizationThis is the maintenance portion of the plan, in which followers are allowed to eat whatever they like without regaining weight – provided that they follow 3 unbreakable rules including eating only unlimited lean protein one set day per week.   For each phase, The Dukan Diet offers clear simple guidelines for long term success.  The Dukan Diet is the perfect diet for people who want fast weight loss, that can be maintained without counting calories or weighing portions.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Crown Archetype",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "April",
            "Year": "2011"
        }
    },
    {
        "Title": "In Pictures Mount Rainier: The Continuing Story",
        "Authors": "By Dengler, William",
        "Description": "",
        "Category": " Travel , Pictorials",
        "Publisher": "KC Publications, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Business Ethics",
        "Authors": "By Ferrell, O. C. and Fraedrich, John",
        "Description": "",
        "Category": " Business & Economics , Home-Based Businesses",
        "Publisher": "Houghton Mifflin College Div",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "Advanced C++ Programming Styles and Idioms",
        "Authors": "By Coplien, James O.",
        "Description": "Assuming a background in C++ basics, this book helps programmers to develop their programming expertise by giving a feel for the styles and idioms of the language. The approach is organized around the abstractions that C++ supports: abstract data types, combining types in inheritance structures, object-oriented programming, and multiple inheritance. Also explored are idioms that the core of the C++ language does not support directly, such as virtual constructors, prototype objects, and advanced garbage collection techniques. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Computers , Programming Languages , C++",
        "Publisher": "Addison-Wesley Professional",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    }
]