[
    {
        "Title": "Peppers: A Cookbook",
        "Authors": "By Berkley, Robert, Jacobson, Eric (PHT), and Jacobson, Eric",
        "Description": "Shares recipes for breads, soups, stuffings, salads, dips, side dishes, and main dishes that feature either mild or hot peppers",
        "Category": " Cooking , Reference",
        "Publisher": "Fireside Book, Simon & Schuster",
        "Price Starting With ($)": "5.4",
        "Publish Date": {
            "Month": "July",
            "Year": "1992"
        }
    },
    {
        "Title": "Brando: Songs My Mother Taught Me",
        "Authors": "By Brando, Marlon and Lindsey, Robert",
        "Description": "This is Marlon Brando's own story, and his reason for telling it is best revealed in his own words: \"I have always considered my life a private affair and the business of no one beyond my family and those I love. Except for moral and political issues that aroused in me a desire to speak out, I have done my utmost throughout my life, for the sake of my children and myself, to remain silent...But now, in my seventieth year, I have decided to tell the story of my life as best I can, so that my children can separate the truth from the myths that others have created about me, as myths are created about everyone swept up in the turbulent and distorting maelstrom of celebrity in our culture.\"To date there have been over a dozen books written about Marlon Brando, and almost all of them have been inaccurate, based on hearsay, sensationalist or prurient in tone. Now, at last, fifty years after his first appearance onstage in New York City, the actor has told his life story, with the help of Robert Lindsey.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Random House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Field photography: Beginning and advanced techniques",
        "Authors": "By Blaker, Alfred A.",
        "Description": "",
        "Category": "",
        "Publisher": "W H Freeman & Co",
        "Price Starting With ($)": "7.2",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Country Barbecue (All Time Favorites)",
        "Authors": "By Publications International Ltd",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Music: The Illustrated Guide to Music Around the World from Its Origins to the Present Day",
        "Authors": "By Blackwood, Alan",
        "Description": "Surveys music throughout the ages, including musical instruments, the development of classical music, jazz, folk music, Eastern music, opera, pop music, and the mechanics of broadcasting and recording",
        "Category": " Music , General",
        "Publisher": "Bdd Promotional Book Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Will the Defense Please Rest?: A Guide to Marital Harmony",
        "Authors": "By Carter, Les",
        "Description": "",
        "Category": "",
        "Publisher": "Baker Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Painted Woodcraft",
        "Authors": "By Walton, Stewart, Walton, Sally, and Montgomery, David (PHT)",
        "Description": "",
        "Category": " Crafts & Hobbies , Woodwork",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "Future Crime",
        "Authors": "By Bova, Ben",
        "Description": "Future Crime is a novel by Ben Bova, author of more than a hundred works of science fact and fiction.At the publisher's request, this title is being sold without Digital Rights Management software (DRM) applied.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "The Mystery of the Yellow Hands: The Baker Street Mysteries (#1) (The Baker Street Brigade)",
        "Authors": "By Thoene, Jake, Thoene, Luke, and Ihoene, Jake",
        "Description": "The three friends--Danny, Peachy, and Duff assist Sherlock Holmes in solving the mystery of the kidnapping of children in London during the 1880s.",
        "Category": " Young Adult Fiction , Mysteries & Detective Stories",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "The Precious Moments of Our Lives",
        "Authors": "By Butcher, Samuel J. (ILT) and Grace, Angela",
        "Description": "The beauty of life lies in the possibility for precious moments that each and every day can bring. But in times as hectic as these, it’s easy to become distracted and miss them completely. Many of us need a gentle reminder to take the time to stop and smell the roses . . . and to celebrate life’s little joys: a blooming garden or a new friend, as well as cherished milestones: a wedding or a new baby. The Precious Moments of Our Lives is that touchstone. Each page of this lovely book offers an inspirational phrase to fill the heart with love and hope as well as a photograph of favorite dolls and figurines from the Precious Moments collection. As beautiful and touching as a smile on a rainy day, The Precious Moments of Our Lives is both a comforting keepsake and the perfect gift to pass along to someone you care about.",
        "Category": " Religion , Inspirational",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "On Turning Sixty-Five: Notes from the Field",
        "Authors": "By Jerome, John",
        "Description": "The author of The Elements of Effort tenderly recounts his journey from delicate neurosurgery to a canoe trip in Canada, tracing his journey into old age with wit and pathos. 20,000 first printing.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Far Horizons:: All New Tales From The Greatest Worlds Of Science Fiction",
        "Authors": "By Silverberg, Robert (EDT)",
        "Description": "The universe of the mind is a limitless expanse of wonders, filled with worlds and secrets that cannot be fully explored within the pages of a single novel. Avid readers of science fiction have long appreciated the myriad joys of returning to fictional galaxies already experienced; delighting in the ever-unfolding mysteres of Frank Herbert's Dune or Asimov's Foundation series, for example.In Far Horizons--edited by acclaimed author Robert Silverberg-- a veritable \"Who's Who\" of science fiction's most beloved and highly honored writers once again revisit the remarkable worlds they created and made famous. Ursula K. Le Guin sends representatives of the Ekumen into the violent later years of a planetary civil war. Dan Simmons once again billiantly  mixes allegory and space adventure in his dangerous, religion-dominated cosmos of Hyperion. Greg Bear reexplores his artificial universe, \"The Way\", from Eon, Eternity and Legacy.Orson Scott Card recounts the momentous first meeting of his time-and-planet-hopping protagonist Ender Wiggin with Ender's computer based, soon to be companion, Jane.Gregory Benford rockets us back to the Galactic Center, Anne McCaffrey's Ship Who Sang sings again, and Joe Haldeman's Forever War rages on eternally. Here, also, are new stories by David Brin, Nancy Kress, Frederik Pohl, and Robert Silverberg himself--each venturing further into univestigated corners of familiar galaxies to delve into the perilous mystery of being human.Perhaps the greatest concentration of science fiction talent ever in one volume, Far Horizons is an unprecedented masterpiece -- one that reopens vast empires of imagination and adventure to new explorations and appreciations. It is a major SF event, sure to bring unparalleled joy to the hearts of serious fans everywhere.",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Harper Voyager",
        "Price Starting With ($)": "24.33",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Approaching Autumn",
        "Authors": "By MacLay, Elise",
        "Description": "Poems describe the different ways older men and women have adjusted to retirement and found new interests and challenges",
        "Category": " Social Science , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1981"
        }
    },
    {
        "Title": "Go East,Young Man: The Early Years:",
        "Authors": "By Douglas, William O.",
        "Description": "Anecdotes and reflections are shared in Justice Douglas' personal record of his life, family, acquaintances, and concerns",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1974"
        }
    },
    {
        "Title": "Red Azalea",
        "Authors": "By Goethe, Johann Wolfgang Von",
        "Description": "Goethe’s masterpiece and perhaps the greatest work in German literature, Faust has made the legendary German alchemist one of the central myths of the Western world. Here indeed is a monumental Faust, an audacious man boldly wagering with the devil, Mephistopheles, that no magic, sensuality, experience, or knowledge can lead him to a moment he would wish to last forever. Here, in Faust, Part I, the tremendous versatility of Goethe’s genius creates some of the most beautiful passages in literature. Here too we experience Goethe’s characteristic humor, the excitement and eroticism of the witches’ Walpurgis Night, and the moving emotion of Gretchen’s tragic fate.This authoritative edition, which offers Peter Salm’s wonderfully readable translation as well as the original German on facing pages, brings us Faust in a vital, rhythmic American idiom that carefully preserves the grandeur, integrity, and poetic immediacy of Goethe’s words.",
        "Category": " Fiction , Classics",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "The Executive Résumé Book",
        "Authors": "By Foxman, Loretta D.",
        "Description": "An executive résumé doesn't look like other résumés. This guide--based on research with those who hire executives--reveals what employers look for, and shows how to develop the résumé. The approach is based on the strategic thinking and planning required by any successful business plan. This book provides the tools to construct the résumé, then get the job offer.",
        "Category": " Business & Economics , Careers , Resumes",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.49",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Lee Bailey's Country Weekends (Recipes for Good Food and Easy Living)",
        "Authors": "By Bailey, Lee",
        "Description": "Presents a guide to cooking and entertaining that includes one hundred recipes that emphasize simple, fresh, and seasonal foods, easy menus, and a minimum of fuss",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "The Disappearance",
        "Authors": "By Freedman, J. F.",
        "Description": "On a soft summer night, she vanishes. With her friends sleeping nearby. With her parents' wealth and power guarding her. Someone walks into the bedroom of her Montecito home and takes fourteen-year-old Emma Lancaster away. That is the first crime. A frantic search begins. Eight days later, abduction becomes murder. Police hunt for Emma Lancaster's killer. A year later, they make an arrest.With an outraged town crying out for blood, powerful media tycoon Doug Lancaster vows to see his daughter's accused murderer convicted and put to death. One man stands in his way. He believes that the rush to judgment in itself is a crime. Once a hard-driving, take-no-prisoners Santa Barbara D.A., Luke Garrison sent a defendant to the death chamber - only to discover he was innocent. The last thing he needs is to come back to a place crawling with memories and bad dreams.But there's something strange about the Emma Lancaster case - too many loose ends that don't add up. Although his instincts tell him to leave it alone, Luke is determined to get at the truth. If he plays it right, it could give him back his life. If he's wrong, he could die. And a killer could walk.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Dutton Adult",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Cat Tales: Classic Stories from Favorite Writers",
        "Authors": "By Amory, Cleveland and Upward, Robin",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Viking Studio Books",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Country Home Cooking & Crafts",
        "Authors": "By Staff of International Masters Publishers AB",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Mediterranean Vegetarian Cooking",
        "Authors": "By Swarbrick, Janet",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , Mediterranean",
        "Publisher": "Book Sales",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Two from Galilee",
        "Authors": "By Holmes, Marjorie",
        "Description": "",
        "Category": "",
        "Publisher": "Fleming H Revell Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1972"
        }
    },
    {
        "Title": "Thoughts from a Queen-Sized Bed",
        "Authors": "By Schwartz, Mimi",
        "Description": "In this startlingly funny and wonderfully honest book of essays, Mimi Schwartz describes what it means to be married for almost forty years. She writes with a keen and amused eye about growing up in an immigrant Jewish family, coming of age in New York in the 1950s, marrying her high school beau, and then arriving at feminist consciousness in the 1970s like so many others of her generation. But unlike many of her contemporaries who left first marriages for independence, Schwartz stayed loyal to her marriage. With refreshing candor Schwartz describes the ongoing challenge of marriage, where success is never without ambivalence and humor. Her essays are wise and warm without being sentimental, and the characters in Schwartz's world are quirky and as charming, well rounded, and complex as those found in any novel.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "University of Nebraska Press",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Easy & Elegant Christmas Trees",
        "Authors": "By Callery, Emma and Worthington, Claire",
        "Description": "Easy-to-follow instructions and full-color photographs show readers how to deck the halls and dress the Christmas tree in colorful, extraordinary style with the help of marzipan angels, metallic paper chains, stars of beaded glass, and much more. BOMC Crafter's Choice Main.",
        "Category": " Crafts & Hobbies , Reference",
        "Publisher": "Checkmark Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Dedication Services for Every Occasion",
        "Authors": "By Holck, Manfred",
        "Description": "",
        "Category": " Religion , Faith",
        "Publisher": "Judson Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Walking with Angels: A Host of Inspirational and Uplifting Thoughts",
        "Authors": "By Gibson",
        "Description": "",
        "Category": "",
        "Publisher": "The C. R. Gibson Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Baltimore Orioles",
        "Authors": "By Topps Co, Schultz, Jim",
        "Description": "",
        "Category": "",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "24.94",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Yield to Jesus Promise Book",
        "Authors": "By Word Publishing",
        "Description": "As we draw near the end of the 20th century, God's Word remains our most reliable source of strength, comfort, and confidence. This handy collection of more than 1,200 Scripture verses covering 56 different subjects-including what Jesus means to us-promises security for the new millennium and offers hope and assurance that the Lord is faithful. It's a great reminder that in the midst of changing times or chaotic circumstances, the best preparation any heart can make is to yield to Jesus.",
        "Category": " Religion , Spirituality",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "A place among the fallen",
        "Authors": "By Cole, Adrian",
        "Description": "",
        "Category": "",
        "Publisher": "Arbor House Publishing",
        "Price Starting With ($)": "6.46",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Touring the Western North Carolina Backroads (Touring the Backroads)",
        "Authors": "By Sakowski, Carolyn",
        "Description": "",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Blair",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Why Farm Wives Age Fast",
        "Authors": "By Jacobs, Eleanor (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Country Store Reiman Pubs",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "The School Survival Guide for Kids With Ld*: (*Learning Differences",
        "Authors": "By Espeland, Pamela, Cummings, Rhoda Woods, and Fisher, Gary L.",
        "Description": "Discusses how children with \"learning differences\" can get along better in school.",
        "Category": " Education , Special Education , General",
        "Publisher": "Free Spirit Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "The Spirit of Christmas (Creative Holiday Ideas)",
        "Authors": "By Leisure Arts Staff",
        "Description": "",
        "Category": " Crafts & Hobbies , Seasonal",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "How to become naturally thin by eating more: The anti-diet book",
        "Authors": "By Antonello, Jean",
        "Description": "",
        "Category": "",
        "Publisher": "Heartland Book Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Find a Federal Job Fast: How to Cut the Red Tape and Get Hired",
        "Authors": "By Krannich, Ronald L. and Krannich, Caryl Rae",
        "Description": "Discusses the advantages and disadvantages of working for the federal government, examining job vacancies, employment applications, job search strategies, and the hiring process",
        "Category": "",
        "Publisher": "Impact Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Simple Pasta Step by Step",
        "Authors": "By Atkinson, Catherine (EDT)",
        "Description": "",
        "Category": " Cooking , Methods , Quick & Easy",
        "Publisher": "Thunder Bay Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Experiencing Spiritual Breakthroughs : The Powerful Principle of the Three Chairs",
        "Authors": "By Wilkinson, Bruce H.",
        "Description": "It happens in almost every part of life. We wear down, burn out, and lose hope. While nothing is fail-safe, there are things you can do to halt the downward slide in your family. This book gives dynamic biblical solutions to people who are asking: - Why don't I have passion in my spiritual life? - Is it still possible to restore my marriage? - Can I raise my children to be \"on fire\" for God? - Where do I start? Bruce Wilkinson shows how, in the midst of a society without morals, a passionate relationship with Jesus is possible -- not just a \"mountaintop experience,\" but an everyday vibrant relationship. This popular book is newly released with an updated cover!",
        "Category": " Religion , Inspirational",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "Light for My Path For Grandparents: Illuminating Selections from the Bible",
        "Authors": "By Humble Creek",
        "Description": "",
        "Category": "",
        "Publisher": "Humble Creek / Barbour Publishing Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Manners Matter: Living the Golden Rule for Kids of All Ages",
        "Authors": "By Hartley, Hermine and Hartley, Al (ILT)",
        "Description": "",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "The Gershwins",
        "Authors": "By Robert Kimball, Alfred Simon",
        "Description": "The public and private lives of George and Ira Gershwin are revealed in photographs, diaries, letters, and the words and music to their songs",
        "Category": "",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "7.98",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Ready To Teach: Adult Bible Studies To Prepare In Just Minutes",
        "Authors": "By Kitchen, Robert L. (EDT) and Theresa C. Hayes (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Standard Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Attack the Messenger: How Politicians Turn You Against the Media (American Political Challenges)",
        "Authors": "By Crawford, Craig",
        "Description": "Politicians and the media are natural enemies, but in recent times, the relationship has exploded into all-out war. Think about bimbo eruptions, DUI arrests, cocaine parties, National Guard service records, Swift Boat veterans. Think about two generations of Bush presidents up against Dan Rather. Think about who lost. Visit our website for sample chapters! Craig Crawford has seen it all up close and personal, and he is disturbed by what he sees. When politicians turn the public against the media, everyone loses—especially unbiased and courageous news reporting. When veteran White House correspondent Helen Thomas is banished from her front row post, as she has been in the current administration, the American public is denied the chance to consider her pointed questions, even if they go unanswered. Worse, when traditional reporters and media are displaced, the pundits and alternative media take over. Rush, the O'Reilly Factor, Comedy Central's Jon Stewart, and the bloggers have their place in American politics, and the 2004 elections showed the incredible power of the Internet. These media, however, are a different breed, as Crawford points out—they serve a purpose, but at a cost. They become \"opinion merchants,\" bartering outrageous assertions for audience appeal with little attention to the truth. These days, the truth is hard to find. If the press is not believed—or believable—because politicians have turned the public against it, then the press is not free, but under the thumbs of politicians. Without a free press, there is no democracy. That, says Craig Crawford, is where we find ourselves today. If you don't like the news, attack the messenger, and it will go away. Going, going, gone.",
        "Category": " Political Science , Political Process , General",
        "Publisher": "Rowman & Littlefield Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Mary Poppins",
        "Authors": "By Travers, P. L and Shepard, Mary (ILT)",
        "Description": "By P.L. Travers, the author featured in the movie Saving Mr. Banks. From the moment Mary Poppins arrives at Number Seventeen Cherry-Tree Lane, everyday life at the Banks house is forever changed. It all starts when Mary Poppins is blown by the east wind onto the doorstep of the Banks house. She becomes a most unusual nanny to Jane, Michael, and the twins. Who else but Mary Poppins can slide up banisters, pull an entire armchair out of an empty carpetbag, and make a dose of medicine taste like delicious lime-juice cordial? A day with Mary Poppins is a day of magic and make-believe come to life!",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Sandpiper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "September, September",
        "Authors": "By FOOTE, SHELBY",
        "Description": "In September 1957 the South is mesmerized by events in Little Rock, Arkansas, whose governor has called out the National Guard as part of his attempt to halt the integration of Central High School. And in Memphis, two white men and a white woman are planning to capitalize on the confrontation between the races by kidnapping the grandson of a wealthy black entrepreneur and pinning the crime on white supremacists. The problem is that Podjo, Rufus, and Reeny have only an amateur's understanding of what a kidnapping entails -- and a total, terrifying incomprehension of their victims.In September September a magisterial historian of the Civil War charts its distant repercussions in the streets of the contemporary South. By turns wryly comic, ribald, and chilling, Shelby Foote's novel is at once a convincing thriller and a powerful tragicomedy of race.September September has been adapted by Larry McMurtry for the Turner Network Television film Memphis, starring Cybill Shepherd.",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Knopf Doubleday Publishing Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Bridget Jones : The Edge of Reason",
        "Authors": "By Fielding, Helen",
        "Description": "Bridget's new relationship with Mark Darcy should have improved her self-confidence, but the difficult adjustments of sharing an apartment and Rebecca's eagerness to cause trouble are making Bridget more uncertain than ever",
        "Category": " Fiction , Humorous , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "The Woman's Book of Soul",
        "Authors": "By Thoele, Sue P.",
        "Description": "",
        "Category": "",
        "Publisher": "M. J. F. Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "The golden encyclopedia of freshwater tropical aquarium fishes",
        "Authors": "By Mills, Dick",
        "Description": "",
        "Category": "",
        "Publisher": "Western Pub. Co",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "The Art of Sign Language",
        "Authors": "By Christopher Brown",
        "Description": "",
        "Category": "",
        "Publisher": "PRC Publishing 2002",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Home Cooking With Amy Coleman, Vol. 3",
        "Authors": "By Coleman, Amy and Furlani, Darla (PHT)",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Bristol Publishing Enterprises Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "SOCIAL STUDIES 2003 PUPIL EDITION GRADE 2 PEOPLE AND PLACES",
        "Authors": "By Scott Foresman",
        "Description": "",
        "Category": " Juvenile Nonfiction , Social Science , General",
        "Publisher": "Scott Foresman",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "People of the Lake: Mankind & Its Beginnings",
        "Authors": "By Lewin, Roger and Leakey, Richard E.",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Apollo 15 At Hadley Base. EP-94",
        "Authors": "By National Aeronautics And Space Administration",
        "Description": "",
        "Category": "",
        "Publisher": "NASA",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "How to Raise an Mvp",
        "Authors": "By Hubbard, Steve, Robinson, Ambrose, and Robinson, Freda",
        "Description": "Voted the NBA's Most Valuable Player as the center for the San Antonio Spurs, David Robinson is perhaps its Most Versatile Person as well. A classical pianist, SAT whiz, computer genius, graduate of Annapolis, naval officer, Dream Team Olympics member, philanthropist, community activist, and Christian, he's a true Renaissance athlete. Yet this thirty-year-old husband and father still asks his parents for advice. Wouldn't you like to sit in the Robinsons' living room and learn why David thinks he has the greatest parents on earth?How to Raise an MVP lets you feel like you're at a warm and personal family gathering. Ambrose and Freda Robinson, along with their three children, David, Kimberly, and Chuck, share anecdotes of family life and offer insight into successful parenting. In the Robinson house there were no TV baby-sitters, no back talkers, and no underachievers. But there were three children who knew they were loved and that they had the potential to dream and to do anything they wanted to do.From bringing a baby home for the first time to watching their children leave the nest, Ambrose and Freda tell about raising a family - and the lessons they learned along the way. They talk frankly about the hard times as well as the good times, and discuss specific issues such as honesty, academics, curfews, sibling rivalry, dating and sex, racism, anger, communication, building a career, and more.",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Becoming a Vessel God Can Use",
        "Authors": "By Partow, Donna",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "How Does Aspirin Find a Headache?",
        "Authors": "By Feldman, David and Schwan, Kassie (ILT)",
        "Description": "The best-selling author of Do Penguins Have Knees? answers some of the baffling enigmas of human life, including Do snakes sneeze?, What does Barney Rubble do for a living?, and Why doesn't glue get stuck in the bottle? Reprint.",
        "Category": " Reference , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Murder Most",
        "Authors": "By Greenberg, Martin H., Et. Al. (Edited by)",
        "Description": "",
        "Category": "",
        "Publisher": "Gramercy Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "The Ultimate Healthy Eating CookSheasby, Anne (1998) Hardcover",
        "Authors": "By Sheasby, Anne",
        "Description": "",
        "Category": "",
        "Publisher": "Hermes House",
        "Price Starting With ($)": "9.56",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Betsy and Tacy Go Over the Big Hill (Betsy-Tacy, 3)",
        "Authors": "By Lovelace, Maud Hart and Lenski, Lois (ILT)",
        "Description": "Betsy, Tacy, and Tib can't wait to be ten. After all, getting two numbers in your age is the beginning of growing up—exciting things are bound to happen. And they do! The girls fall in love with the King of Spain, perform in the School Entertainment, and for the first time, go all the way over the Big Hill to Little Syria by themselves. There Betsy, Tacy, and Tib make new friends and learn a thing or two. They learn that new Americans are sometimes the best Americans. And they learn that they themselves wouldn't want to be anything else. Ever since their first publication in the 1940s, the Betsy-Tacy stories have been loved by each generation of young readers.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Mandie and the Secret Tunnel (Mandie, Book 1)",
        "Authors": "By Leppard, Lois Gladys",
        "Description": "In 1900, Mandie is searching her dead uncle's mansion for a missing will when she finds a secret tunnel and strangers who claim to be her relatives",
        "Category": " Juvenile Fiction , Religious , Christian , General",
        "Publisher": "Bethany House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1983"
        }
    },
    {
        "Title": "Building Bridges: An Egypt-U.S. Free Trade Agreement",
        "Authors": "By Galal, Ahmed (EDT) and Lawrence, Robert Z. (EDT)",
        "Description": "In April 1997, Egyptian President Mubarak and U.S. Vice President Gore agreed to explore the possibility of creating a Free Trade Agreement (FTA) between Egypt and the United States. The very idea of such an agreement has been met by controversy and skepticism from critics in both countries. The authors of this book, however, believe that the case for considering an FTA between the U.S. and Egypt rests on solid economic and political grounds. An agreement could help promote Egyptian economic reform and growth, while providing substantial economic benefits to the U.S. Politically, it could strengthen American ties with an ally who plays a crucial role in helping to achieve peace in the region and in maintaining a stable supply of oil in the Middle East.This book offers U.S. and Egyptian policymakers answers to such pertinent questions as: What form should an FTA agreement take? Should it concentrate on border barriers or cover other aspects such as investments and services? What are the likely implications for both countries? And how will such an agreement affect the rest of the region? Its conclusions will be relevant to policymakers elsewhere in their pursuit of similar regional trade agreements.Copublished with the Egyptian Center for Economic Studies",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Brookings Institution Press",
        "Price Starting With ($)": "16.67",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Carnival: Entertainments and posthumous tales",
        "Authors": "By Dinesen, Isak",
        "Description": "",
        "Category": "",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Life Laughs Last",
        "Authors": "By Kunhardt, Philip B.",
        "Description": "",
        "Category": " Photography , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1989"
        }
    },
    {
        "Title": "Steve Mizerak's Complete Book of Pool",
        "Authors": "By Mizerak, Steve and Panozzo, Michael E.",
        "Description": "The most comprehensive catalog of pool how-tos.",
        "Category": " Sports & Recreation , Reference",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Ransomed Bride (Brides of Montclair, Book 2)",
        "Authors": "By Peart, Jane",
        "Description": "\"I won't lose you now!\" said Cam in a voice ragged with emotion. The moon moved across the sky from behind the sheltering trees, and suddenly the two of them were enveloped in moonlight. \"I love you, and yet I know I have no right to speak to you of this. I'm not free. I’m engaged--\" \"Oh, Cam, don’t!\" she begged. \"It cannot be. It is too late. There is no way--\" A tremor coursed through her -- a premonition of danger. This was madness, she knew. The two were as much star-crossed lovers as Romeo and Juliet, theirs as forbidden a love by all the same barriers of family, church, and honor. \"There has to be a way. There must be. We'll find a way!\" Cam declared as he drew her into his arms. \"Cam, let me go. We must forget this ever happened.\" \"How can we?\" he asked in anguish. Ransomed Bride is a historical romance that brings to life a young couple's choice between duty and love.",
        "Category": " Fiction , Religious",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Gandhi the Man",
        "Authors": "By Easwaran, Eknath",
        "Description": "Easwaran's moving portrait of the great Indian leader seeks to uncover the personal and spiritual qualities which shaped Gandhi's life and made him the charismatic leader of millions",
        "Category": "",
        "Publisher": "Nilgiri Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1978"
        }
    },
    {
        "Title": "Eloquent Executive",
        "Authors": "By Parkhurst, William",
        "Description": "Offers advice on voice control, openings, closings, diction, humor, and hostile questions, and suggests ways to improve one's speaking skills",
        "Category": "",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "The Art of Imperfection: Simple Ways to Make Peace with Yourself",
        "Authors": "By Vienne, Veronique and Lennard, Erica (PHT)",
        "Description": "Complemented by rich duotone photographs, a collection of ten inspirational and meditative essays offers insights into how to celebrate the flaws that make us unique, fascinating, and lovable individuals. 50,000 first printing.",
        "Category": " Psychology , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The Redemption of Sarah Cain",
        "Authors": "By Lewis, Beverly",
        "Description": "Stunned by news of her sister's and her brother-in-law's deaths, Sarah Cain journeys to Lancaster County to claim her five orphaned nieces and nephews, who have been brought up as members of the Amish community, and finds her life irrevocably altered by her encounter with the Plain people of the region. Simultaneous.",
        "Category": " Fiction , Christian , General",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Freedom from the Ties That Bind: The Secret of Self Liberation",
        "Authors": "By Finley, Guy",
        "Description": "You can find an inexhaustible source of strength within that allows you to leave all self-punishing patterns behind.You can have the power to choose the life you really want. You can truly know that you won't have to go through this life alone. You can start living the life you dream of when you read Freedom From the Ties that Bindby Guy Finley. In this amazing book, you will learn hundreds of breakthrough secrets of self-liberation that show you exactly how to be fully independent and free of any unhappy condition. Even the most difficult people won't be able to try your temper or get you flustered. You'll feel anxieties and doubts about your future fade away. You'll enjoy solid, meaningful relationships based on your conscious choices rather than self-defeating compromises. Included are:·Forty ways to determine your level of inner freedom ·Thirty keys to change your destiny ·Eleven laws that lift you to the next life level ·Means to clear up the source of all painful confusion ·Ways to make the fear of being \"no one\" fade away ·How to turn any sorrow into a higher self-healing Stop being an unwilling victim of your own fears! Freedom From the Ties that Bindwill give you life-healing insights that will allow you to take command of any challenging situation. And finally, you'll discover the greatest spiritual secret of all, who you really are is already everything you've ever wanted to be!Author Guy Finley presents over 75 seminars each year on self-liberation. Now the essence of the secrets he shares have been distilled and expanded upon inFreedom From the Ties that Bind. This is a book that is truly healing and gives the gift of life and freedom. Get your copy today.",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "Llewellyn Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Gracious Living in a New World: How to Appreciate Each Day More",
        "Authors": "By Stoddard, Alexandra",
        "Description": "In our rush for newer, quicker, better, we seem to be missing out on what we fundamentally crave, a calmer, gentler, sweeter, and more gracious life.Is it easy to achieve such a life?Definitely not.Is it possible?Absolutely, positively, certainly, yes.In today's world of modern conveniences (voice mail, electronic mail, facsimiles, etc.) the work day for most North Americans has not been shortened, as anticipated and promised by the creators of these technologies. In fact, the opposite holds true, with management often expecting that more work will be produced in less time. People today are juggling family responsibilities, jobs, and social obligations. In their haste to achieve it all, something is still lacking.In Gracious Living in a New World, Alexandra Stoddard offers her ideas for achieving a gracious lifestyle. Her inspiration stems from the experiences she shared with her husband, Peter, when they moved from New York City to a little cottage in a tiny sea-side Connecticut village.  Alexandra Stoddard's message is positive and practical. It is also relevant to everyone. City-slickers and village dwellers alike will find relief and refuge amongst Alexandra's trademark colorful pages.  But most importantly, readers will find the inspiration to live a gracious life.",
        "Category": " Body, Mind & Spirit , Inspiration & Personal Growth",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Breaking the Da Vinci Code: Answering the Questions Everybody's Asking",
        "Authors": "By Bock, Darrell L. and Moloney, Francis J. (FRW)",
        "Description": "Many who have read the New York Times bestseller The Da Vinci Code have questions that arise from seven codes-expressed or implied-in Dan Brown's book. In Breaking the Da Vinci Code: Answers to the Questions Everyone's Asking, Darrell Bock, Ph.D., responds to the novelist's claims using central ancient texts and answers the following questions: Who was Mary Magdalene?Was Jesus Married?Would Jesus Being Single be Un-Jewish?Do the So-Called Secret Gnostic Gospels Help Us Understand Jesus?What Is the Remaining Relevance of The Da Vinci Code?Darrell Bock's research uncovers the origins of these codes by focusing on the 325 years immediately following the birth of Christ, for the claims of The Da Vinci Code rise or fall on the basis of things emerging from this period. Breaking the Da Vinci Code, now available in trade paper, distinguishes fictitious entertainment from historical elements of the Christian faith. For by seeing these differences, one can break the Da Vinci code.",
        "Category": " Religion , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Danger After Dark (Creative Girls Club Mystery Book Series)",
        "Authors": "By Ellie McDonald",
        "Description": "",
        "Category": "",
        "Publisher": "Annie's Attic / DRG Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Oxycise!",
        "Authors": "By Johnson, Jill R.",
        "Description": "",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Oxycise Intl",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The Trumpet Shall Sound.",
        "Authors": "By H. M. Tomlinson",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "8.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1957"
        }
    },
    {
        "Title": "Summerland: A Novel",
        "Authors": "By Chabon, Michael",
        "Description": "When Summerland, a remarkable area known for its perfect weather and controlled by tiny beings known as ferishers, is threatened by an ancient enemy, they enlist the aid of baseball player Ethan Feld, who, along with his friend Jennifer T. Rideout, a friendly werefox, and other companions, sets out to vanquish giants, goblins, and a magical ball club. Reprint.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Disney Hyperion",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "Real Man",
        "Authors": "By Cole, Edwin Louis",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "This Hebrew Lord",
        "Authors": "By Spong, John Shelby",
        "Description": "In This Study I Found A Lord, a center for my being. Behind the supernatural framework of the first century...I discover a life I wanted to know; a life that possessed a power I wanted to possess; a freedom, a wholeness for which I had yearned for years.\"Illuminating the \"figure who stands at the center of all the Christian Church is,\" John Shelby Spong explores Jesus under the light of the Hebrew tradition into which he was born. Candid, personal, and soundly argued, this is Spong's spiritual and intellectual pilgrimaged to the Christ he discovered in Jesus of Nazareth.",
        "Category": " Religion , Christianity , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Six Armies in Normandy: Unforgettable Account of The Allied Invasion of France",
        "Authors": "By Keegan, John",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1983"
        }
    },
    {
        "Title": "Wooden Toys and Games - Patterns and Assembly Instructions For 30 Projects",
        "Authors": "By Parkinson, Ralph F.",
        "Description": "",
        "Category": "",
        "Publisher": "Chilton Book Company",
        "Price Starting With ($)": "5.03",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Going to Sleep on the Farm",
        "Authors": "By Lewison, Wendy Cheyette and Wijngaard, Juan (ILT)",
        "Description": "As a father helps his young son get ready for bed, the child asks how the various animals in the barnyard prepare fo the night, in a beautifully illustrated bedtime story.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Dial Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1992"
        }
    },
    {
        "Title": "Encyclopedia of Little Known Secrets of Perfect Natural Health",
        "Authors": "By Failes, Janice M., Cawood, Frank W.",
        "Description": "",
        "Category": "",
        "Publisher": "Peachtree City, Georgia, U.S.A.: F C & A Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "A Justice for All: William J. Brennan, Jr., and the Decisions That Transformed America",
        "Authors": "By Eisler, Kim Isaac",
        "Description": "Justice William J. Brennan, Jr., was both a radical egalitarian and a prime mover on the United States Supreme Court. From 1956 to 1990 - through the Warren, Burger, and Rehnquist eras - he effected both judicial and social change via decisions on racial desegregation, pornography, the application of the Bill of Rights to the states, privacy, and abortion. Brennan's stamp is on nearly every contemporary American social issue. A Justice for All, the first biography of Justice Brennan, gathers his considerable achievements in the context of his times and his life.Brennan had been the original \"stealth\" nominee to the United States Supreme Court. Having served eight years as a state court judge in New Jersey, Brennan was a total unknown on the national stage when President Eisenhower limited his search for a new justice to a Northeastern Catholic currently serving on a state court. In a rancorous confirmation hearing that foreshadowed events of the eighties and nineties, Brennan tangled with Senator Joseph McCarthy. Taking his place on a Supreme Court bench surrounded by such towering figures as Earl Warren, Felix Frankfurter, Hugo Black, William Douglas, and John Harlan, Brennan observed, \"I felt a little like the mule at the Kentucky Derby.\"But in a career that would span one-third of a century, Brennan proved to be one of the most visionary and influential justices in the history of the Supreme Court. Not content merely to interpret the Constitution, Brennan rewrote American law in the fields of obscenity, criminal rights, affirmative action, and privacy.This account of the life of an extremely private and little-understood man brings the reader face to face with the clash of intellectual forces that created the landmark rulings of the Warren court. In the midst of these colliding giants was an unpresuming lawyer from Newark who took Warren's broad concepts and wrote them into law; who convinced a firebrand like William O. Douglas, that, at times, it paid to compromise; and who willingly braved personal and professional confrontations with his former Harvard University law professor, Felix Frankfurter.In his three years of research, author Kim Isaac Eisler utilized the private papers of Justices Brennan, Douglas, Harlan, Warren, and Black, among others; interviewed dozens of former Brennan clerks; and found childhood friends and onetime law partners to reveal what lit the fire inside this history-making judicial activist.A Justice for All is the remarkable tale of a man who operated within the marble walls of the Supreme Court with the consummate skills of a dealmaker, creating majorities, writing laws, and all the while steering clear of political fire. In so doing, he succeeded in changing American law and society.",
        "Category": " Biography & Autobiography , Lawyers & Judges",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "The Vagina Monologues: The V-Day Edition",
        "Authors": "By Ensler, Eve",
        "Description": "A poignant and hilarious tour of the last frontier, the ultimate forbidden zone, The Vagina Monologues is a celebration of female sexuality in all its complexity and mystery. Hailed as the bible for a new generation of women, it has been performed in cities all across America and at hundreds of college campuses, and has inspired a dynamic grassroots movement—V-Day—to stop violence against women. Witty and irreverent, compassionate and wise, Eve Ensler's Obie Award-winning masterpiece gives voice to real women's deepest fantasies and fears, guaranteeing that no one who reads it will ever look at a woman's body, or think of sex, in quite the same way again.",
        "Category": " Performing Arts , Theater , Playwriting",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Four Seasons Salads (Creative Cuisine)",
        "Authors": "By Burrow, Jackie",
        "Description": "Shares recipes for dressings, mousses, terrines, and salads which feature seafood, meat, poultry, fruit, or vegetables",
        "Category": " Cooking , General",
        "Publisher": "HP Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Roses: Inspirations for Practical Gifts, Crafts and Displays",
        "Authors": "By Love, Gilly",
        "Description": "",
        "Category": " Gardening , Flowers , Roses",
        "Publisher": "Anness",
        "Price Starting With ($)": "6.01",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Snow White",
        "Authors": "By Barthelme, Donald",
        "Description": "Presents a unique, satiric refurbishing of the classic fairy tale to provide an absurd reflection of modern life",
        "Category": "",
        "Publisher": "Scribner Paper Fiction",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1972"
        }
    },
    {
        "Title": "Dinosaurs and Prehistoric Creatures",
        "Authors": "By Michael Teitelbaum",
        "Description": "",
        "Category": "",
        "Publisher": "Modern Publishing",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Lemony Snicket: The Unauthorized Autobiography",
        "Authors": "By Snicket, Lemony",
        "Description": "In anticipation of the forthcoming release of The Slippery Slope (A Series of Unfortunate Events Book the Tenth) don't miss this depressing opportunity to warn even more readers off Lemony Snicket. Finally, here is the definitive – and only – book for anyone interested in learning more about the alarmingly elusive author.  Ages 10+",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "HarperColl",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Go, Stitch, Go! (Step-Into-Reading, Step 2)",
        "Authors": "By Kulling, Monica",
        "Description": "What happens when a lonely little Hawaiian girl adopts a pet that is actually an experiment-gone-wrong from an alien planet? Join the fun with the ever-lovable Lilo and Stitch in this captivating Step 1 Step into Reading book!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Take Effective Control of Your Life",
        "Authors": "By Glasser, William",
        "Description": "Explains the inner basis of all our behavior and feelings and the way by which we may control our emotions and actions for healthier, productive lives",
        "Category": " Psychology , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "The Planet Earth ( Today's World Ser. )",
        "Authors": "By Dixon, Doug",
        "Description": "",
        "Category": "",
        "Publisher": "Shooting Star Press",
        "Price Starting With ($)": "9.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Bread Machine Cookbook (Nitty Gritty Cookbooks)",
        "Authors": "By German, Donna Rathmell",
        "Description": "The first bread machine cookbook on the market offers more than 130 recipes for white, wholegrain, cheese, fruit, vegetable, herb and spice breads, sourdough loaves, rolls, croissants and breadsticks. Recipes appear in 3 sizes to accommodate any machine make or model. Author Donna German continues to test these recipes on over 50 types of bread machines. This book is so popular, it inspired a 6-book series.",
        "Category": " Cooking , Courses & Dishes , Bread",
        "Publisher": "Nitty Gritty Cookbooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "Women and Psychotherapy: An Assessment of Research and Practice",
        "Authors": "By Brodsky, Annette M. and Hare-Mustin, Rachel T.",
        "Description": "",
        "Category": " Psychology , Clinical Psychology",
        "Publisher": "The Guilford Press",
        "Price Starting With ($)": "7.13",
        "Publish Date": {
            "Month": "October",
            "Year": "1980"
        }
    },
    {
        "Title": "Intimate Male: Candid Discussions About Women, Sex and Relationships",
        "Authors": "By Barbach, Lonnie and Levine, Linda",
        "Description": "Based on numerous interviews with a wide cross-section of American men varying in age, residence, marital status, and sexual orientation this book explores male expectations and experiences of sex",
        "Category": " Social Science , Men's Studies",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1983"
        }
    },
    {
        "Title": "Ancient Ruins of the Southwest: An Archaeological Guide",
        "Authors": "By Noble, David Grant",
        "Description": "",
        "Category": "",
        "Publisher": "Northland Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "75 Creative Ways to Publish Students' Writing (Grades 2-6)",
        "Authors": "By Sunflower, Cherlyn",
        "Description": "Illustrated, step-by-step directions for creating all kinds of books-pop-ups, corrals, fold-downs, flaps, see throughs-and lots of other ideas too, including collages, student-made newspapers, banners, and mobiles. For use with Grades 2-6.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Teaching Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "50 Ways With Pasta",
        "Authors": "By Blakemore, Katharine",
        "Description": "",
        "Category": "",
        "Publisher": "Little, Brown",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Favorite Brand Name Best-loved Chocolate Recipes",
        "Authors": "By Publications International Ltd",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.77",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Executive's Guide to Successful Mrp II",
        "Authors": "By Wight, Oliver W",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "Powerful Communication Skills: How to Communicate With Confidence, Clarity and Credibility",
        "Authors": "By McKenna, Colleen",
        "Description": "",
        "Category": " Language Arts & Disciplines , Communication Studies",
        "Publisher": "Natl Seminars Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    }
]