[
    {
        "Title": "Goat Brothers",
        "Authors": "By Colton, Larry",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Missing Person",
        "Authors": "By Grumbach, Doris",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Putnam Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1981"
        }
    },
    {
        "Title": "Don't Eat Your Heart Out Cookbook",
        "Authors": "By Piscatella, Joseph C.",
        "Description": "",
        "Category": " Cooking , Reference",
        "Publisher": "Workman Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "When Your Corporate Umbrella Begins to Leak: A Handbook for White Collar Re-Employment",
        "Authors": "By Davis, Paul D.",
        "Description": "",
        "Category": "",
        "Publisher": "Natl Pr Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Amy Spangler's Breastfeeding : A Parent's Guide",
        "Authors": "By Spangler, Amy",
        "Description": "",
        "Category": "",
        "Publisher": "Amy Spangler",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "The Foundation of Leadership: Enduring Principles to Govern Our Lives",
        "Authors": "By Short, Bo",
        "Description": "",
        "Category": "",
        "Publisher": "Excalibur Press",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Chicken Soup for the Soul: 101 Stories to Open the Heart and Rekindle the Spirit",
        "Authors": "By Canfield, Jack (COM) and Hansen, Mark Victor (COM)",
        "Description": "",
        "Category": " Self-help , Personal Growth , Self-Esteem",
        "Publisher": "Health Communications Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1993"
        }
    },
    {
        "Title": "Journey Through Heartsongs",
        "Authors": "By Stepanek, Mattie J. T.",
        "Description": "Collects poems written by the eleven-year-old muscular dystrophy patient, sharing his feelings and thoughts about his life, the deaths of his siblings, nature, faith, and hope.",
        "Category": " Poetry , General",
        "Publisher": "VSP Books",
        "Price Starting With ($)": "19.96",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "In Search of Melancholy Baby",
        "Authors": "By Aksyonov, Vassily, Heim, Michael Henry, and Bouis, Antonina W.",
        "Description": "The Russian author offers an affectionate chronicle of life in the United States, with discussions of such topics as the European charm of Washington, D.C., and the American immigration bureaucracy",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Christmas Cookies",
        "Authors": "By Eakin, Katherine M. and Deaman, Joane (EDT)",
        "Description": "",
        "Category": " Cooking , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "12.98",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "The Dieter's Guide to Weight Loss During Sex",
        "Authors": "By Smith, Richard",
        "Description": "A humor classic, this tongue-in-cheek diet plan bases calorie counts on sexual activity and charts the exact number of calories burned.\"You and your friends can read this book aloud while sitting on the beach and shed a combined total of ten thousand calories in thirty-three minutes. Yes, it's that funny.\"-Glamour. Selection of the Quality Paperback Book and Playboy book clubs and a New York Times Bestseller. 935,000 copies in print.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Germs : Biological Weapons and America's Secret War",
        "Authors": "By Miller, Judith, Engelberg, Stephen, and Broad, William J.",
        "Description": "Deadly germs sprayed in shopping malls, bomb-lets spewing anthrax spores over battlefields, tiny vials of plague scattered in Times Square -- these are the poor man's hydrogen bombs, hideous weapons of mass destruction that can be made in a simple laboratory. In this groundbreaking work of investigative journalism, Judith Miller, Stephen Engelberg, and William Broad of The New York Times uncover the truth about biological weapons and show why bio-warfare and bio-terrorism are fast becoming our worst national nightmare.  Among the startling revelations in Germs:   How the CIA secretly built and tested a model of a Soviet-designed germ bomb, alarming some officials who felt the work pushed to the limits of what is permitted by the global treaty banning germ arms. How the Pentagon embarked on a secret effort to make a superbug. Details about the Soviet Union's massive hidden program to produce biological weapons, including new charges that germs were tested on humans. How Moscow's scientists made an untraceable germ that instructs the body to destroy itself. The Pentagon's chaotic efforts to improvise defenses against Iraq's biological weapons during the 1991 Persian Gulf War. How a religious cult in Oregon in the 1980s sickened hundreds of Americans in a bio-terrorism attack that the government played down to avoid panic and copycat strikes. Plans by the U.S. military in the 1960s to attack Cuba with germ weapons.   Germs also shows how a small group of scientists and senior officials persuaded President Bill Clinton to launch a controversial multibillion-dollar program to detect a germ attack on U.S. soil and to aid its victims -- a program that, so far, is struggling to provide real protection.  Based on hundreds of interviews with scientists and senior officials, including President Clinton, as well as on recently declassified documents and on-site reporting from the former Soviet Union's sinister bio-weapons labs, Germs shows us bio-warriors past and present at work at their trade. There is the American scientist who devoted his professional life to perfecting biological weapons, and the Nobel laureate who helped pioneer the new biology of genetically modified germs and is now trying to stop its misuse. We meet former Soviet scientists who made enough plague, smallpox, and anthrax to kill everyone on Earth and whose expertise is now in great demand by terrorists, rogue states, and legitimate research labs alike.  A frightening and unforgettable narrative of cutting-edge science and spycraft, Germs shows us why advances in biology and the spread of germ weapons expertise to such countries as Iran, Iraq, and North Korea could make germs the weapon of the twenty-first century.",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "The Genesis of Ethics",
        "Authors": "By Visotzky, Burton L.",
        "Description": "",
        "Category": " Religion , Ethics",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Good Book: Reading the Bible with Mind and Heart",
        "Authors": "By Gomes, Peter J.",
        "Description": "\"The Bible and the social and moral consequences that derive from its interpretation are all too important to be left in the hands of the pious or the experts, and too significant to be ignored and trivialized by the uninformed and indifferent.",
        "Category": " Religion , Biblical Biography , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "All over but the Shoutin'",
        "Authors": "By Bragg, Rick",
        "Description": "A New York Times Notable Book of the YearThis haunting, harrowing, gloriously moving recollection of a life on the American margin is the story of Rick Bragg, who grew up dirt-poor in northeastern Alabama, seemingly destined for either the cotton mills or the penitentiary, and instead became a Pulitzer Prize-winning reporter for The New York Times. It is the story of Bragg's father, a hard-drinking man with a murderous temper and the habit of running out on the people who needed him most.But at the center of this soaring memoir is Bragg's mother, who went eighteen years without a new dress so that her sons could have school clothes and picked other people's cotton so that her children wouldn't have to live on welfare alone. Evoking these lives--and the country that shaped and nourished them--with artistry, honesty, and compassion, Rick Bragg brings home the love and suffering that lie at the heart of every family. The result is unforgettable.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Oilers and Sweepers and Other Stories",
        "Authors": "By Dennison, George",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Prince William",
        "Authors": "By Garner, Valerie",
        "Description": "",
        "Category": "",
        "Publisher": "Benford Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Emperor's New Mind",
        "Authors": "By Penrose, Roger",
        "Description": "",
        "Category": " Philosophy , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Touching Fire: Erotic Writings by Women",
        "Authors": "By Thornton, Louise, Sturtevant, Jan, and Sumrall, Amber Coverdale (EDT)",
        "Description": "",
        "Category": "",
        "Publisher": "Carroll & Graf Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Hill Rat: Blowing the Lid Off Congress",
        "Authors": "By Jackley, John L.",
        "Description": "As a top aide to powerful Texas Congressman Ronald Coleman, John Jackley watched the nation's highest elected officials lie, manipulate media images, and spend millions of taxpayer dollars to stay in power. The mind-boggling scope of the abuse of perks and privilege by both legislators and their staffers finally shocked him into reality.What began as a secret journal for his children to clear his conscience has become Hill Rat, a journey behind Congress' closed doors and into the corrupt back alleys of power. With both humor and outrage, Jackley reveals how the promise of Congress has been hijacked and corrupted by the current crop of careerist incumbents. \"Today,\" he writes, \"a successful congressman has the fundraising ability of a hooker trying to make cab fare home and the morals of a big-time football coach!\"His account is laced with the names of Capitol Hill's most prominent legislators--Majority Leader Richard Gephardt, Speaker of the House Thomas Foley, Ron Dellums, Bill Alexander, Minority Whip Newt Gingrich, Thomas Luken, and scores of others. Jackley also reveals, with names, dates, and examples, the outrageous power of Congressional staffers--\"Hill Rats\"--who \"run the engines of democracy on a daily basis and pride themselves on their ability to do anything in the name of their cause.\"To show the flagrant abuse of taxpayers' money for re-election purposes, Jackley points out that in just forty-eight hours in early 1992, the House mailed more than 58 million newsletters and postcards. In 1990, the first post-Jim Wright, post-congressional scandal election, 96% of the incumbents who ran were reelected. Even in 1988, only six Members running for re-election were defeated, a turnover rate less than that of the Soviet Politburo.From previously untold Congressional involvement in Oliver North's contra re-supply network to Democratic complicity in the S&L crisis to the taxpayer-funded incumbent protection plan, Hill Rat reveals secrets backed by hard evidence that will shake the House and shock the nation.",
        "Category": " Political Science , General",
        "Publisher": "Regnery Publishing, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "The Great ABC Treasure Hunt: A Hidden Picture Alphabet Book (Time-Life Early Learning Program)",
        "Authors": "By Time-Life for Children (Firm) (COR), Singer, Muff, and Hoggan, Pat (ILT)",
        "Description": "",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Personality of the Cat",
        "Authors": "By Aymar, Brandt (EDT)",
        "Description": "A delightful collection of reflections on the feline contains selections from famous artists, writers, poets, and essayists, such as Pablo Picasso, Rudyard Kipling, T. S. Eliot, and others.",
        "Category": " Pets , Cats , General",
        "Publisher": "Bonanza Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Murdering Mr. Monti: A Merry Little Tale of Sex and Violence",
        "Authors": "By Viorst, Judith",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "In Re Alger Hiss:  Petition for a Writ of Error Coram Nobis",
        "Authors": "By Edith Tiger",
        "Description": "",
        "Category": "",
        "Publisher": "Hill & Wang",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1979"
        }
    },
    {
        "Title": "Black Holes and Baby Universes and Other Essays",
        "Authors": "By Hawking, Stephen W.",
        "Description": "",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Relativity: The Special and the General Theory",
        "Authors": "By Albert Einstein",
        "Description": "",
        "Category": "",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1961"
        }
    },
    {
        "Title": "Betrayal : How the Clinton Administration Undermined American Security",
        "Authors": "By Gertz, Bill",
        "Description": "Gertz, writer for the Moonie-influenced  Washington Times  newspaper and a reporter  with the highest right-wing credentials (including praise from Rush Limbaugh and G. Gordon Liddy on the jacket) uses declassified documents and unnamed Pentagon sources to recount how President Clinton has weakened the military and made innumerable secret deals with \"enemy\" countries. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , General",
        "Publisher": "Regnery Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Shadow Song",
        "Authors": "By Kay, Terry",
        "Description": "It was a wonderful summer, a great memory, the kind of love everybody ought to have. It changed my life - or almost did - and I think about it more than I should, but that was a long time ago.Amid the breathtaking beauty of the Catskill Mountains, Avrum Feldman listened to the haunting voice of Amelita Galli-Curci ringing over the Shandaken Valley - a voice no one else could hear. When he died at age one hundred six, his obsession for the famous opera diva had lasted three-quarters of a century. Most people considered Avrum crazy, someone preoccupied with romantic nonsense. But Madison Lee \"Bobo\" Murphy was not among them, for he, too, had a love that changed his life, or almost did: Amy Lourie.In the summer of 1955, Bobo was a waiter at the Catskill's Pine Hill Inn; a rural Southerner who had never heard the word meshugge until Avrum - a retired furrier, teacher, and translator from New York City - became his unlikely friend. For Bobo nothing about that summer ever lost its glow: his first taste of kartoffel suppe; the exotic mingling of Yiddish and German in the dining room; the girl he met and loved....In everyone's life, Avrum had instructed, there is one grand, undeniable moment of change that never stops mattering. It came for Bobo in his first meeting with Amy, the most beautiful girl he had ever seen. He was too naive to comprehend the gulf between their worlds, and she was too smitten by him to care. But for a wealthy Jewish girl and a Georgia farm boy, the summer had to end, leaving Bobo to learn the painful lesson of loving someone and believing you cannot be with them.Now, thirty-eight years later, Avrum is gone, leaving a will that beckons Bobo north to the Catskills once more. In the places he'd walked so often on the paths of memory, he embraces the ghosts of old friendships and the haunting hints of Amy's presence, until she unexpectedly appears. Nothing has dimmed the passion of their youth, yet two lifetimes and a thousand Catskills sunsets stand between who they were and who they have become. The strikes against them are different now, but mysteriously, miraculously, as Bobo carries out Avrum's last wishes for a strange Kaddish, he hears the dreams of his youth, of the young man who went forth and became part of a love larger than himself....",
        "Category": " Fiction , General",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Undercurrents: A Therapist's Reckoning With Her Own Depression",
        "Authors": "By Manning, Martha",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "The Road Less Traveled and Beyond: Spiritual Growth in an Age of Anxiety",
        "Authors": "By Peck, M. Scott",
        "Description": "",
        "Category": " Psychology , Psychopathology , Anxieties & Phobias",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Kiss: A Memoir",
        "Authors": "By Harrison, Kathryn",
        "Description": "",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Codebreakers' Victory: How the Allied Cryptogaphers Won World War II",
        "Authors": "By Haufler, Hervie",
        "Description": "For the first time ever, veteran World War II cryptographer Hervie Haufler details how American and British codebreakers were the decisive factor in the Allied victory. From the Purple Machine to the Navajo Talkers to the breaking of Japan's JN-25 Naval Code to the shadowy world of decoding units like Hut-8 in Bletchley Park, he shows how crucial information-often obtained by surreptitious and violent means-was the decisive edge in the Battle of Britain, at Midway and against the U-Boats in the North Atlantic, and how Allied intelligence saved the Soviet Union from almost certain defeat.  In an accessible account based on years of research, interviews and exclusive access to previously top-secret archives, Haufler demonstrates how cryptography enabled Nimitz and MacArthur to persevere in the Pacific and helped Eisenhower and Patton mount the assaults on Normandy. In compelling detail, Haufler shows us how it was done-as only one who was on the frontlines of the \"secret war\" could tell it.",
        "Category": " History , Military , World War II",
        "Publisher": "NAL Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "A Manual for Writers of Term Papers, Theses, and Dissertations, Fifth Edition",
        "Authors": "By Turabian, Kate L.",
        "Description": "",
        "Category": "",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "The Price of Loyalty: George W. Bush, the White House, and the Education of Paul O'Neill",
        "Authors": "By Suskind, Ron",
        "Description": "",
        "Category": " Political Science , Government , Executive Branch",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Best New American Voices 2003",
        "Authors": "By Kulka, John (EDT), Danford, Natalie (EDT), and Oates, Joyce Carol (EDT)",
        "Description": "Since its launch in 2000, the Best New American Voices series has been acclaimed for the range and originality of its selections, which represent the writers who promise to become the literary stars of tomorrow. The 2003 collection continues the tradition, featuring innovative, powerful stories selected by one of our finest writers of contemporary fiction, Joyce Carol Oates. With pieces culled from more than one hundred prestigious writing programs around the country and Canada, including the Iowa Writers' Workshop and the Sewanee Conference, this volume showcases a remarkable array of talent--and offers the excitement of discovering a new generation of writers.A Harvest Original",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Escape from the CIA: How the CIA Won and Lost the Most Important KGB Spy Ever to Defect to the U.S.",
        "Authors": "By Kessler, Ronald",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Meditations: On the Monk Who Dwells in Daily Life",
        "Authors": "By Moore, Thomas",
        "Description": "Sometimes in their chanting monks will land upon a note and sing it in florid fashion, one syllable of text for fifty notes of chant. Melisma, they call it.Living a melismatic life in imitation of plainchant, we may stop on an experience, a place, a person, or a memory and rhapsodize in imagination. Some like to meditate or contemplate melismatically, while others prefer to draw, build, paint, or dance whatever their eye has fallen upon.Living one point after another, is one form of experience, and it can be emphatically productive. But stopping for melisma gives the soul its reason for being.",
        "Category": " Religion , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Links Lore",
        "Authors": "By Stevens, Peter F.",
        "Description": "",
        "Category": " Sports & Recreation , History",
        "Publisher": "POTOMAC BOOKS",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Jackie by Josie: A Novel",
        "Authors": "By Preston, Caroline",
        "Description": "Follows a thirtyish graduate who unexpectedly finds herself helping a celebrity biographer research the life of Jacqueline Kennedy Onassis, and ends up discovering surprising parallels between her own life and that of the queen of Camelot",
        "Category": " Fiction , Literary",
        "Publisher": "Scribner",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Joshua and the City",
        "Authors": "By Girzone, Joseph F.",
        "Description": "A contemporary city faces turmoil and devastation until it is visited by the serene figure of Joshua, who presents an alternative, love-based approach to life while addressing such issues as poverty, racism, and AIDS. 150,000 first printing. $150,000 ad/promo.",
        "Category": " Religion , Inspirational",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "The Book of Courtly Love: The Passionate Code of the Troubadours",
        "Authors": "By Hopkins, Andrea",
        "Description": "A treasury of French medieval lore combines the tales of Lancelot and Guinevere, Tristan and Isolde, Troilus and Criseyde, and several songs and poems with sixty accompanying illustrations from classic manuscripts and romantic art.",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "How Good Do We Have to Be? A New Understanding of Guilt and Forgiveness",
        "Authors": "By Kushner, Harold S.",
        "Description": "From the author of When Bad Things Happen to Good People comes an inspiring new bestseller that puts human feelings of guilt and inadequacy in perspective - and teaches us how we can learn to accept ourselves and others even when we and they are less than perfect. How Good Do We Have to Be? is for everyone who experiences that sense of guilt and disappointment. Harold Kushner, writing with his customary generosity and wisdom, shows us how human life is too complex for anyone to live it without making mistakes, and why we need not fear the loss of God's love when we are less than perfect. Harold Kushner begins by offering a radically new interpretation of the story of Adam and Eve, which he sees as a tale of Paradise Outgrown rather than Paradise Lost: eating from the Tree of Knowledge was not an act of disobedience, but a brave step forward toward becoming human, complete with the richness of work, sexuality and child-rearing, and a sense of our mortality. Drawing on modern literature, psychology, theology,,and his own thirty years of experience as a congregational rabbi, Harold Kushner reveals how acceptance and forgiveness can change our relationships with the most important people in our lives and help us meet the bold and rewarding challenge of being human.",
        "Category": " Religion , Psychology of Religion",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Eat More, Weigh Less: Dr. Dean Ornish's Life Choice Program for Losing Weight Safely While Eating Abundantly",
        "Authors": "By Ornish, Dean and Brown, Shirley Elizabeth (EDT)",
        "Description": "",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Majorca: Culture and Life",
        "Authors": "By Konemann Inc. (EDT)",
        "Description": "",
        "Category": " Photography , Subjects & Themes , Regional",
        "Publisher": "Konemann",
        "Price Starting With ($)": "8.83",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "Written by Herself: Autobiographies of American Women: An Anthology",
        "Authors": "By Conway, Jill Ker (EDT)",
        "Description": "The bestselling author of The Road from Coorain presents an extraordinarily powerful anthology of the autobiographical writings of 25 women, literary predecessors and contemporaries that include Jane Addams, Zora Neale Hurst, Harriet Jacobs, Ellen Glasgow, Maya Angelou, Sara Josephine Baker, Margaret Mead, Gloria Steinem, and Maxine Hong Kingston.",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Vintage",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "The Universe of Galaxies",
        "Authors": "By Hodge, Paul",
        "Description": "",
        "Category": "",
        "Publisher": "W H Freeman & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "Ice Bound: A Doctor's Incredible Battle For Survival at the South Pole",
        "Authors": "By Nielsen, Jerri and Vollers, Maryanne",
        "Description": "",
        "Category": " Biography & Autobiography , Women",
        "Publisher": "Miramax",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Healing Benefits of Garlic",
        "Authors": "By Heinerman, John",
        "Description": "",
        "Category": " Cooking , Specific Ingredients , Herbs, Spices, Condiments",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Me and Ted Against the World : The Unauthorized Story of the Founding of CNN",
        "Authors": "By Schonfeld, Reese",
        "Description": "",
        "Category": " Business & Economics , Management",
        "Publisher": "Harperbusiness",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Magnet Therapy: The Pain Cure Alternative",
        "Authors": "By Lawrence, Ronald Melvin, Plowden, Judith, and Rosch, Paul",
        "Description": "",
        "Category": " Medical , Holistic Medicine",
        "Publisher": "Prima Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Controlling Cholesterol: Dr. Kenneth H. Cooper's Preventative Medicine Program",
        "Authors": "By Cooper, Kenneth H.",
        "Description": "",
        "Category": " Health & Fitness , Diet & Nutrition , Food Content Guides",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1989"
        }
    },
    {
        "Title": "George Meany And His Times: A Biography",
        "Authors": "By Robinson, Archie",
        "Description": "Draws on interviews and unpublished documents to re-create the life and times of the outspoken and influential labor leader and the drama of the labor movement in which he played a central role",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "American Dreams: Lost & Found",
        "Authors": "By Terkel, Studs",
        "Description": "A cross-section of Americans--from an embittered Miss America to Arnold Schwarzenegger, from Jesse Helms to a KKK member, from businessmen and Brahmins to activists and immigrants--speak of their hopes, expectations, and disappointments",
        "Category": "",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1980"
        }
    },
    {
        "Title": "Sharing the Pie : A Citizen's Guide to Wealth and Power",
        "Authors": "By Brodner, Steve (ILT) and Brouwer, Steve",
        "Description": "",
        "Category": " Business & Economics , Economic Conditions",
        "Publisher": "Holt Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Love, Love, and Love",
        "Authors": "By Bernhard, Sandra",
        "Description": "Even if you know Sandra Bernhard as an actress, singer, comedian, and performer, you're in for quite a shock with this, her second book. A mix of memoir, fiction, invented memoir, and fiction that rings with the truth, Love Love and Love charts the state of romance, sex, and relationships - the need to love and be loved - in several cities, and several sexes, around the world. The same biting wit, fragile irony, and arresting candor of Sandra's performances are all here, but Love Love and Love is also filled with an intimacy and an insight that are all new... and all Bernhard.Here are the stories of a relationship built on the weapon of romance; of an elusive girl, and the various drugs she gives and takes; of dreams and daydreams that melt into truth; of the touch of a lover's skin at the break of dawn; and of all the pain and cruelty that go along so well with the ecstasy we all want to possess. This is a book about relationships born of chance meetings on the street at night; about sexual obsessions, frayed emotions, and haunting memories of both the quick and the dead. Love Love and Love is by turns shocking and exhilarating, angry and passionate, analytical and sexy; it's all about that strange state of being that merges sensations only of the moment with an emotion that has existed since the birth of humankind.As Sandra herself notes: \"Love is the only shocking act left on the face of the earth.\"",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Conflicting Accounts: The Creation and Crash of the Saatchi and Saatchi Advertising Empire",
        "Authors": "By Goldman, Kevin",
        "Description": "On December 16, 1994, a bloodletting took place in the stylish sixth-floor boardroom at Saatchi & Saatchi Company PLC, once the world's largest advertising agency holding company. Maurice Saatchi, the 48 year-old chairman who co-founded the company in 1970 with his older brother Charles, was fired by the board of directors under threat by the firm's largest shareholders. Less than a month later, Maurice started a rival ad agency and quickly snapped up former Saatchi & Saatchi clients, most importantly British Airways. Kevin Goldman, the former daily advertising columnist for the Wall Street Journal, spoke to everyone connected with this headline-making saga -- including Maurice Saatchi and his reclusive brother Charles -- and witnessed important business meetings, including Maurice Saatchi's winning pitch to British Airways. Goldman traces every step the Saatchi brothers took, from their youth as Iraqi Jewish immigrants in North London to their business merger in 1970, when, with little more than sheer audacity, the opened an ad agency with a full-page announcement ad in the London Sunday Times. Through bold and brash actions, the agency began an acquisitions binge, taking over many of the ad industry's giants -- including Ted Bates, Backer & Spielvogel, Dancer Fitzgerald Sample, and Garland-Compton -- to become the number one ad company in the world. But, once they acquired a company, the brothers lost interest, often refusing to meet with its executives again. This disdain would come back to haunt them. Also chronicled is the brothers' rich lifestyle, which critics claim was funded by the company. This tale features a rich cast of supporting players: Jeremy Sinclair, a creative advertising genius who was fiercely loyal to the brothers, was one of the executives who resigned after Maurice was fired. Bill Muirhead, another loyalist, was responsible for keeping clients happy. Robert Louis-Dreyfus, a globe-trotting native of France, was brought in by the Saatchis in 1989 when the company was teetering on the edge of bankruptcy. Louis-Dreyfus brought in Charles Scott, a self-described numbers cruncher uncomfortable with the glitzy world of advertising, to help sort out the company's complex finances. And leading the anti-Maurice movement was David Herro, a thirty-three-year-old American money manager whose group owned approximately 10 percent of Saatchi stock. Built into the Saatchi story is the bigger picture of the dramatic changes in advertising in the 1980s, such as the merger mania and ad agency consolidations that swept Madison Avenue, including the British takeover of major agencies. The story of the decline and crash of Saatchi & Saatchi is a universal tale of corporate greed and ineffective management. It is the story of an ugly, publicly fought civil war in an industry that is supposed to know the steep price paid for an image run amok.",
        "Category": " Business & Economics , Advertising & Promotion",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "What Went Wrong at Enron: Everyone's Guide to the Largest Bankruptcy in U.S. History",
        "Authors": "By Fusaro, Peter C. and Miller, Ross M.",
        "Description": "",
        "Category": " Business & Economics , Finance , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The Addictive Organization: Why We Overwork, Cover Up, Pick Up the Pieces, Please the Boss, and Perpetuate S",
        "Authors": "By Schaef, Anne Wilson and Fassel, Diane",
        "Description": "",
        "Category": " Psychology , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "From the Silent Earth: A Report on the Greek Bronze Age",
        "Authors": "By Joseph Alsop",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "6.22",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "Panic Disorder and Its Treatment (Medical Psychiatry Series)",
        "Authors": "By Pollack, Mark H. (EDT) and Rosenbaum, J. F. (EDT)",
        "Description": "Practical in approach and up to date in content, Panic Disorder and Its Treatment provides a clear and clinically relevant summary of the current knowledge on this challenging illness, covering symptoms, care, cost, comorbidities, and quality of life. Contains algorithms and tables offering at-a-glance drug treatment options and an appendix with measures for assessing symptom severity and therapeutic response! Written by leading authorities on the etiology, course, and management of this condition, Panic Disorder and Its Treatmentpromotes improved recognition of symptoms in pychiatric and nonpsychiatric settings, including the primary care physician's office or the emergency room reviews evidence from numerous sources on the prognosis of panic disorder, emphasizing the potential for chronicity and recurrence examines the latest advances implicating neurochemical, neurophysiological, and functional neuroanatomical abnormalities in the pathogenesis of panic disorder analyzes risk factors for the illness, including genetics, temperment, developmental experiences, and life events explores available pharmacotherapies for panic disorders, including selective serotonin-reuptake inhibitors investigates panic attacks and panic disorder from a cognitive-behavioral perspective, detailing specific therapies targeted to control physical sensations presents clinical strategies for treatment-refractory patients, assuring optimal diagnostic and therapeutic efforts for nonresponders and more! Panic Disorder and Its Treatment serves as insightful reading for psychiatrists and behavioral scientists, clinical psychopharmacologists, neuropsychiatrists, clinical psychologists, clinical social workers, and medical students, residents, and fellows in these disciplines. It is also useful for primary care physicians, including internists, family doctors, and generalists, as well as emergency room staff, who are often the first health care professionals to evaluate the patient.",
        "Category": " Psychology , Psychopathology , General",
        "Publisher": "Informa Healthcare",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Henry VIII (English Monarchs Series)",
        "Authors": "By Scarisbrick, J. J.",
        "Description": "This detailed biography concentrates on the domestic life of the monarch, foreign affairs in which he was involved and his influence on religion. Bibliogs",
        "Category": " Biography & Autobiography , Military",
        "Publisher": "University of California Press",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "October",
            "Year": "1972"
        }
    },
    {
        "Title": "The Moral Intelligence of Children",
        "Authors": "By Coles, Robert",
        "Description": "The award-winning author of The Spiritual Life of Children shares his thoughts on how to teach morality to children, defining moral intelligence and explaining how to foster a child's conscience and spiritual growth. 75,000 first printing. Tour.",
        "Category": " Psychology , General",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Concordance to the New English Bible, New Testament,",
        "Authors": "By Elder, E",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan Pub. House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Life at the Edge: Readings from Scientific American Magazine",
        "Authors": "By Gould, James L. and Gould, Carol Grant (EDT)",
        "Description": "Readings from  Scientific American  on life in extreme environments. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "W H Freeman & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Cook Healthy: Cook Quick",
        "Authors": "By Wesler, Cathy A.",
        "Description": "",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Images Of War: The Artist's Vision of World War II",
        "Authors": "By McCormick, Ken",
        "Description": "",
        "Category": "",
        "Publisher": "Orion Books",
        "Price Starting With ($)": "10.02",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Becoming Soul Mates: Cultivating Spiritual Intimacy in the Early Years of Marriage",
        "Authors": "By Parrott, Les",
        "Description": "Every couple has a restless aching, not just to know God individually but to experience God together. But how? How do you really allow God to fill the soul of your marriage? Becoming Soul Mates gives you a road map for cultivating rich spiritual intimacy in your relationship. Written by the creators of the dynamic Saving Your Marriage Before It Starts book and program, becoming Soul Mates is a unique and insightful devotional that helps you dig deep for a strong spiritual foundation in your marriage. Fifty-two practical weekly devotions help you and your partner cross the hurdles of marriage to grow closer than you&apos;ve ever imagined. In each session, you&apos;ll find: - An insightful devotion that focuses on marriage-related topics - A key passage of Scripture - Questions that will spark discussions on crucial issues - Insights from real-life soul mates like Pat and Shirley Boone, Bill and Vonette Bright, Norm and Joyce Wright, and John and Barbi Townsend - Questions that will help you and your partner better understand each other&apos;s unique needs and remember them in prayer during the week - A brief prayer that will help you both draw closer together and close to God. Becoming Soul Mates is a valuable resource for mining the rich potential of your marriage. Its principles, proven in the Parrotts&apos; own relationship, will help you make your journey as a couple all God intends it to be. With the strength that comes from a deeply shared spiritual intimacy, your marriage can flourish in the midst of life&apos;s challenges. Start building on the closeness you&apos;ve got today -- and reap the rewards of a deeper, more satisfying relationship in the years ahead.",
        "Category": " Family & Relationships , Reference",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Care of the Soul : A Guide for Cultivating Depth and Sacredness in Everyday Life",
        "Authors": "By Moore, Thomas",
        "Description": "A therapist draws on the world's religions, music, art, and his own experiences with patients to examine the connections between spirituality and the problems of individuals and society. Reprint. 150,000 first printing. $200,000 ad/promo.",
        "Category": " Self-help , General",
        "Publisher": "HarperPerennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Victims of Progress",
        "Authors": "By Bodley, John H.",
        "Description": "",
        "Category": "",
        "Publisher": "Cummings Pub.Co.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1975"
        }
    },
    {
        "Title": "Inside the Tornado: Marketing Strategies from Silicon Valley's Cutting Edge",
        "Authors": "By Moore, Geoffrey A.",
        "Description": "\"The chasm is where high-tech fortunes are lost... the tornado is where they are made.\"-- Steve Jobs, Founder & CEO, Next Computer, Inc.    Now, in this fascinating sequel, Moore shows how to capitalize on the profit-rich niches and hyper-growth markets beyond the chasm. Continuing to chart the impact of the Technology Adoption Life Cycle, he explores its effects not just on marketing but on overall business planning, especially strategic partnerships, competitive advantage, positioning and organizational leadership. Moore's most startling lesson is: \"As markets move from stage to stage in the Life Cycle, the winning strategy does not just change -- it actually reverses the prior strategy. The very skills that you've just perfected become your biggest liabilities; and if you can't put them aside to acquire new ones, then you're in for tough times.\" As challenging as this lesson is to apply, Moore leads the way. Using actual examples of cutting-edge firms, he applies the Life Cycle model to all aspects of managing a market-focused business strategy, including how to manage people effectively through each phase of the cycle. There are significant management implications: Chasm-crossers who love the customer intimacy of niches may rebel against the depersonalizing power of the tornado; tornado managers who relish the gales of hyper-growth may resist the inevitable return to the niche, in the guise of mass customization, once the rush to the new paradigm subsides. All industries relying on technology -- not just computer hardware, software and telecommunications, but entertainment, publishing, broadcasting, banking, insurance, health care, aerospace, defense, utilities, pharmaceuticals and retail -- must master Moore's lessons to see the year 2000. If you are marketing technology-based products or managing the people who do, then you will find yourself Inside the Tornado.",
        "Category": " Business & Economics , Marketing , General",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Sunset at Rosalie: A Novel",
        "Authors": "By McLaughlin, Ann L.",
        "Description": "Tells the story of a young girl and her family's country life in Mississippi during the years prior to World War I",
        "Category": " Fiction , General",
        "Publisher": "Daniel & Daniel Pub",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "The Girlfriends' Guide to Surviving the First Year of Motherhood, Packaging May Vary",
        "Authors": "By Iovine, Vicki",
        "Description": "When it comes to your new baby, everyone from Dr. Spock to Dr. Brazleton has an armful of advice. But no one's delivering any tips on how you can care for yourself. Now, four-time delivery room veteran Vicki Iovine answers your questions, calms your fears, and cracks you up as only a girlfriend can, with straight advice and hilarious observations on... \"Baby euphoria\": Is it a mind-altering drug?\"Husband? What Husband?\": Taking care of the big baby, as well as the little baby\"I Want My Old Body Back!\": What you can fix and what you can't\"The Droning Phenomenon\": The inability to discuss anything but your baby for more than thirty seconds\"Do I Have to Become Carol Brady?\": Conquering your fear of being a less-than-perfect mother\"Competitive Mothering\": Coping with know-it-alls, finger-pointers, and others who try to \"Out-Mom\" youNOTE: Pausing to read this book may be the only selfish thing you do all year, since you'll have time for nothing else!",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Sherlock Holmes and the Red Demon by John H. Watson, M.D.",
        "Authors": "By Watson, John H. and Millett, Larry (EDT)",
        "Description": "It is the story of how the world's most beloved private detective, Sherlock Holmes, and Watson traveled to Minnesota in 1894 to find and stop a murderous arsonist, known only as the Red Demon, who is threatening both Hill and his Great Northern Railway. Homes's pursuit of this malignant and cunning villain presents the great man \"with the most remarkable case of his celebrated career.\"In Minnesota, Holmes comes face-to-face with all manner of frontier characters, including two-fisted railroad men, rough-and-tumble lumberjacks, a one-eyed teamster, and an unsavory town marshal. But he also encounters the proprietress of the North Woods' most opulent sporting house, Mary Robinson, a woman as clever as she is beautiful. In response to a churlish remark from Dr. Watson about the morality of her establishment, she replies: \"Morality is a matter of power, nothing more and nothing less. The rich impose it on the poor, men impose it on women, and the forces of reaction impose it upon those who seek a better world.\"Needless to say, Holmes becomes especially attentive to this suspect's articulate charm. But charm gives way to terror in the exciting climax of the tale, a chase on the rails that ends with Holmes and the Red Demon squared off on a lonely bridge in a fiery circle of death. \"Never,\" says Watson, \"was Holmes more magnificent than at that moment.\"",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Viking",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "New Lands, New Men",
        "Authors": "By Goetzmann, William H.",
        "Description": "Examines the adventures of the explorers during the seventeenth through the nineteenth centuries and shows how the impetus to explore transcended national interests and imperialist ambitions",
        "Category": " Biography & Autobiography , Adventurers & Explorers",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1986"
        }
    },
    {
        "Title": "Reinventing Government: How the Entrepreneurial Spirit is Transforming the Public Sector (Plume)",
        "Authors": "By Osborne, David and Gaebler, Ted",
        "Description": "Describes how decentralization and entrepreneurship can revitalize government and outlines ten principles guiding an entrepreneurial public organization",
        "Category": " Political Science , American Government , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Proverbs For The People",
        "Authors": "By Price-Thompson, Tracy (EDT) and Stovall, Taressa (EDT)",
        "Description": "Featuring contributions from such noted writers as Pearl Cleage, Omar Tyree, Timmothy McCann, and Earl Sewell, a dramatically rendered anthology of stories, drawn from African, African-American, and Biblical proverbs, is filled with an abundance of wit, inspiration, and wisdom.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Great American Countryside",
        "Authors": "By Landi, Val",
        "Description": "",
        "Category": " Travel , United States , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1982"
        }
    },
    {
        "Title": "Rob Whitlock: A Pioneer Boy in Old Ohio",
        "Authors": "By Jackson, Kathryn",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1951"
        }
    },
    {
        "Title": "British Hospitals (Britain in Pictures)",
        "Authors": "By A. G. L. Ives",
        "Description": "",
        "Category": "",
        "Publisher": "London : Collins",
        "Price Starting With ($)": "18.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1948"
        }
    },
    {
        "Title": "An essay on morals",
        "Authors": "By Wylie, Philip",
        "Description": "",
        "Category": "",
        "Publisher": "Rinehart & Company, Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1947"
        }
    },
    {
        "Title": "Kid, You Sing My Songs of Love, and Loss, and Hope",
        "Authors": "By Wyse, Lois and Rogers, Lilla (ILT)",
        "Description": "",
        "Category": " Humor , Form , Limericks & Verse",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Re-Inventing the Corporation: Transforming Your Job and Your Company for the New Information Society",
        "Authors": "By Naisbitt, John and Aburdene, Patricia",
        "Description": "Describes how the new information society is altering the nature of the workplace and how some corporations are responding",
        "Category": " Business & Economics , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "A Sister Is Forever: A Blue Mountain Arts Collection for One of the Most Beautiful People You'll Ever Know",
        "Authors": "By Morris, Gary (EDT) and Blue Mountain Arts Collection (COR)",
        "Description": "",
        "Category": " Family & Relationships , Siblings",
        "Publisher": "Blue Mountain Arts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Practical Stylist",
        "Authors": "By Baker, Sheridan Warner",
        "Description": "",
        "Category": "",
        "Publisher": "Crowell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "The Periodic Kingdom: A Journey Into The Land Of The Chemical Elements (Science Masters Series)",
        "Authors": "By Atkins, P. W.",
        "Description": "",
        "Category": " Science , Applied Sciences",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Titanic",
        "Authors": "By Kirkland, Douglas, Marsh, Ed W., and Kirkland, Douglas (PHT)",
        "Description": "",
        "Category": " Performing Arts , Film , General",
        "Publisher": "Harper Paperbacks",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "A Woman of Egypt",
        "Authors": "By Sadat, Jehan",
        "Description": "",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Civilization III: Instruction Manual",
        "Authors": "By Meier, Sid",
        "Description": "",
        "Category": "",
        "Publisher": "Infogames Interactive",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Alcatraz '46;: The anatomy of a classic prison tragedy,",
        "Authors": "By Don DeNevi, Philip Bergen",
        "Description": "",
        "Category": "",
        "Publisher": "Leswing Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Elvis in the Morning",
        "Authors": "By Buckley, William F.",
        "Description": "This is a novel about friendship, a novel that spans the decades that changed America forever. Orson is a young boy whose mother works at a U.S. Army base in Germany in the 1950s. There, he becomes a fan of a G.I. stationed at the base, one Elvis Presley, whose music is played over and over on the radio. When Orson is caught stealing recordings of Elvis's tunes from the PX, the attendant publicity catches the star's attention, and he comes to visit his young fan. Thus begins a lifelong friendship. As Elvis's career rockets ever higher and his behavior becomes ever more erratic, the two share many adventures. The sixties explode, and Elvis becomes the icon of the nation, while Orson, a college demonstrator, drifts away from regular life while looking for something of substance to believe in. Each man is an emblem of his time, as social conventions crumble, barriers fall, and the cultural landscape changes forever.A panorama of change and dissent, of the ability of friends to stay true despite distance and time, Elvis in the Morning portrays a nation in change and the effects of celebrity on innocence.",
        "Category": " Fiction , Fantasy , Historical",
        "Publisher": "Harvest Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Fat Free, Flavor Full: Dr. Gabe Mirkin's Guide to Losing Weight and Living Longer",
        "Authors": "By Mirkin, Gabe and Rich, Diana",
        "Description": "A collection of 250 appetizing, meatless recipes provides a plan that lowers cholesterol and reduces the risk of heart disease, cancer, and diabetes by cutting down on fat intake without compromising on taste and variety. 35,000 first printing. Tour.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "White Gold Wielder - Book Three of The Second Chronicles of Thomas Covenant",
        "Authors": "By Donaldson, Stephen R.",
        "Description": "",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "From Image to Likeness: A Jungian Path in the Gospel Journey",
        "Authors": "By Grant, W. Harold, Thompson, Magdala, and Clarke, Thomas E.",
        "Description": "",
        "Category": " Psychology , Movements , Jungian",
        "Publisher": "Paulist Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "ON THE WING: The Life of Birds: From Feathers to Flight",
        "Authors": "By Brooks, Bruce",
        "Description": "Takes a close-up look at the remarkable physiology and behavior of birds",
        "Category": " Science , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "19.25",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Bringing Down the House: The Inside Story of Six M.I.T. Students Who Took Vegas for Millions",
        "Authors": "By Mezrich, Ben",
        "Description": "The #1 national bestseller, now a major motion picture, 21—the amazing inside story about a gambling ring of M.I.T. students who beat the system in Vegas—and lived to tell how.Robin Hood meets the Rat Pack when the best and the brightest of M.I.T.’s math students and engineers take up blackjack under the guidance of an eccentric mastermind. Their small blackjack club develops from an experiment in counting cards on M.I.T.’s campus into a ring of card savants with a system for playing large and winning big. In less than two years they take some of the world’s most sophisticated casinos for more than three million dollars. But their success also brings with it the formidable ire of casino owners and launches them into the seedy underworld of corporate Vegas with its private investigators and other violent heavies.",
        "Category": " Games & Activities , Gambling , Table",
        "Publisher": "Atria",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Future Space: Beyond Earth",
        "Authors": "By Quigley, Sebastian (ILT) and Jefferis, David",
        "Description": "",
        "Category": "",
        "Publisher": "Tangerine Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The young Jefferson, 1743-1789,",
        "Authors": "By Bowers, Claude Gernade",
        "Description": "",
        "Category": "",
        "Publisher": "Houghton Mifflin Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1945"
        }
    },
    {
        "Title": "Mayo Clinic On Hearing: Strategies for Managing Hearing Loss, Dizziness and Other Ear Problems (\"MAYO CLINIC ON\" SERIES)",
        "Authors": "By Olsen, Wayne, Ph.D. (EDT)",
        "Description": "",
        "Category": " Health & Fitness , Hearing & Speech",
        "Publisher": "Kensington Pub Corp",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Trust Me, Mom-Everyone Else Is Going!: The New Rules for Mothering Adolescent Girls",
        "Authors": "By Cohen-Sandler, Roni, Ph.D.",
        "Description": "From \"queen bees\" to \"gamma girls\" to the \"odd girl out,\" adolescent girls are all over the news. But whether a girl is popular or struggling to fit in, outgoing or reserved, her mother worries about how she is coping with her new, often scary, teenage social world: Who is she with, what is she really doing, is she safe and, of course, is she happy? In this essential survival guide, Roni Cohen-Sandler teaches parents to \"use their BRAIN\"—Be flexible, Respectful, Attuned, Involved, and Non-controlling—to build trust and help their daughters navigate these complex social waters. Addressing such issues as popularity, boyfriends, parties and partying, discipline, privacy, body image, and identity, Cohen-Sandler provides a new model for parenting adolescent daughters for today's generation of mothers.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "I Hate School: How to Hang in and When to Drop Out",
        "Authors": "By Wirths, Claudine G. and Bowman-Kruhm, Mary",
        "Description": "",
        "Category": " Young Adult Nonfiction , General",
        "Publisher": "Trophy Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    }
]