[
    {
        "Title": "Familiar Strangers: Uncommon Wisdom in Unlikely Places",
        "Authors": "By Chopra, Gotham",
        "Description": "A flip through the newspaper or a glance at the evening news reveals a world in which old ways are dying and new worlds are beginning, often in the midst of violence and chaos. In the face of these massive changes and disruptions, many people are questioning their roles as individuals: Why am I here? What is my purpose? In Familiar Strangers, Gotham Chopra travels from China, Sri Lanka, and Kashmir to Chechnya and the Yucatán in search of answers to these age-old spiritual questions. Everywhere he goes, he encounters people who have had to dig within themselves to survive horrible realities and bear heart-wrenching losses. From his New York to Los Angeles flight on September 11, 2001 to a harrowing week spent among young boys toting guns in the contested hills of Kashmir and a sojourn in a small Yucatán village where he witnesses firsthand the collision between the romance of the past and the uncertain promise of the future, Chopra shares the wisdom, idealism, and sense of purpose he found in ordinary people living under extraordinary circumstances. Rich in drama and insights into cultures far different from our own, the stories Chopra recounts articulate, as well, anxieties and fears we all share. While acknowledging that his travels often take him to the extreme edges of civilized society, Chopra shows that the questions that arise in times of peril or in the face of great dangers are not so different from what many of us ask in the course of our daily lives–whether after a grueling eighty-hour work week, a six-hour exam, or a fiery argument with a lover. The challenge, he argues, is to use these moments of revelation as the first step in moving beyond self-imposed fears and limits and embracing new opportunities for spiritual growth.",
        "Category": " Religion , Spirituality",
        "Publisher": "Harmony",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "The Complete Jack the Ripper",
        "Authors": "By Rumbelow, Donald",
        "Description": "Explains the theories and facts surrounding the Whitechapel murders. This book sets the crimes firmly in their historical setting, examines the evidence comprehensively and scrupulously, disposes of a number of theories and legends and relates the murder to popular literature and to later similar sex crimes.",
        "Category": " True Crime , General",
        "Publisher": "Gardners Books",
        "Price Starting With ($)": "8.74",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Night of the Mary Kay Commandos Featuring Smell O-Toons",
        "Authors": "By Breathed, Berke",
        "Description": "The oddball denizens of Bloom County smell trouble when armed cosmeticians invade their home, in a collection of the best cartoons from the past year, complete with a sample of the Commandos' famous fragrance",
        "Category": " Humor , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Joseph Conrad",
        "Authors": "By Reilly, Jim",
        "Description": "",
        "Category": "",
        "Publisher": "Wayland",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Dr. Gary Chapman on The Marriage You've Always Wanted",
        "Authors": "By Chapman, Gary D.",
        "Description": "After the leftover wedding cake has been consumed and the thank-you notes written, the blissful couple often uncovers some jarring realities: a trail of dirty socks on the floor, conflicting opinions on how much money is too much for a bottle of shampoo, and a general wonderment at the question, \"What does it mean to merge the worlds of two very different people?\" <BR><BR>In an updated version of <EM>Toward a Growing Marriage</EM>, beloved relationship expert and marriage counselor Gary Chapman offers his trademark practical wisdom on the many issues young married couples face. His basic message: to enjoy the marriage you've always wanted, we have to be the person Jesus has always wanted us to be. He looks at such areas as meaningful communication, expectations about who does what around the house, and the challenges of money management. 'Your Turn' questions inspire further interaction between wives and husbands. This book makes a superb sequel to <EM>The Five Love Languages</EM> as it takes the next step in making unselfish relationships a reality.",
        "Category": " Religion , Christian Life , Love & Marriage",
        "Publisher": "Moody Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Learn to Sleep Well",
        "Authors": "By Idzikowski, Chris",
        "Description": "Sick of tossing and turning? Ready to sleep soundly through the night? Mr. Sandman has arrivedin book form! The latest title in our best-selling self-help series (more than 300,000 sold),Learn to Sleep Well is a dreamily illustrated passageway to those vitally important hours of sleep that for some people are impossible to attain. It gives reliable suggestions and practical exercises on how to deal with those marauding nighttime \"sleep thieves\" such as snoring partners, restless children, and nightmares, as well as expert advice on natural remedies for a deeper, more restful sleep, including meditation, massage, herbalism, and aromatherapy.Learn to Sleep Well tackles all aspects of sleep from combating the various types of fatigue to creating an environment most conducive to uninterrupted rest. An inspiring guide to promoting natural health through improved sleep, this book shows how we can tune up our sleep patterns the natural waywith major benefits for health and well-being in our waking life.",
        "Category": " Body, Mind & Spirit , Mindfulness & Meditation",
        "Publisher": "Chronicle Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "4th of July (Women's Murder Club, No 4)",
        "Authors": "By Patterson, James",
        "Description": "The world's bestselling detective series has never been more suspenseful. Trapped in deadly showdowns, courtroom trials, and dangerous secrets, the Women's Murder Club must fight for their lives.In a deadly late-night showdown, San Francisco police lieutenant Lindsay Boxer fires her weapon and sets off a dramatic chain of events that leaves a police force disgraced, a family destroyed, and Lindsay herself at the mercy of twelve jurors. During a break in the trial, she retreats to a picturesque town that is reeling from a string of grisly murders-crimes that bear a link to a haunting, unsolved case from her rookie years.Now, with her friends in the Women's Murder Club, Lindsay must battle for her life on two fronts: in a trial rushing to a climax, and against an unknown adversary willing to do anything to hide the truth about the homicides-including kill again?",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Warner Vision Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Here's to You, Rachel Robinson",
        "Authors": "By Blume, Judy",
        "Description": "From the New York Times bestselling author of Are You There God? It’s Me, Margaret and the adult bestseller In the Unlikely Event comes a tale of family, friendship, and pre-teen life like only JUDY BLUME can deliver. The companion to Just As Long As We’re Together.  CAN YOU BE too perfect? From the outside, Rachel looks like the perfect daughter in the perfect family. She’s a straight-A student, a gifted musician, and a good friend. But Rachel feels as if it’s all falling apart. Her brother, Charles, was just kicked out of boarding school and is now at home, wreaking havoc. Her sister, Jessica, has problems of her own, which Rachel thinks it’s her job to help solve. And Rachel herself is considering adding drama club, community service, and class president to her already crowded roster of activities. Rachel’s best friends, Stephanie and Alison, urge Rachel to lighten up and enjoy the end of seventh grade. Easy for them to say. Not so easy for Rachel. Not even when Jeremy Dragon, the coolest boy in ninth grade, notices her. Is it possible that perfection isn’t the key to an exciting life? An ALA Best Book for Young Adults “A master.” —SLJ",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Yearling",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "To recover confidence",
        "Authors": "By Barry, Frank Russell",
        "Description": "",
        "Category": "",
        "Publisher": "SCM Press",
        "Price Starting With ($)": "8.55",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Dave Barry Hits Below the Beltway: A Vicious and Unprovoked Attack on Our Most Cherished Political Institutions",
        "Authors": "By Barry, Dave",
        "Description": "Just in time, Dave Barry supplies the wholly original, much needed history and guide to the new American politics and its three capitals, Washington, D.C., Austin, and South Florida. No surprise: it's hilarious.Understanding the urgent need for a deeply thoughtful balanced book to explain our national political process, Dave Barry has not even come close. Though he himself has covered many campaigns, run for President several times, and run for cover at the rainy inauguration of George W. Bush (the man will spare nothing for his art) Barry has instead outdone himself.Below the Beltway includes Barry's stirring account of how the United States was born, including his version of a properly rewritten Declaration (When in the course of human events it behooves us, the people, not to ask \"What can our country do for us, anyway?\" but rather whether we have anything to fear except fear itself...)and a revised Constitution (Section II: The House of Representatives shall be composed of people who own at least two dark suits and have not been indicted recently.).Dave also cracks the income tax code, explains the growth(s) of government, congressional hearing difficulties, and the persistent rumors of the influence of capital in the Capitol. Among other civic contributions, his tour of Washington, D.C., should end school class trips forever.",
        "Category": " Humor , Topic , Politics",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Orson Welles: The Rise and Fall of an American Genius",
        "Authors": "By Higham, Charles",
        "Description": "This full-scale, illustrated biography provides an in-depth profile of the visionary actor/writer/director whose prodigious talents, gargantuan appetites, and personal demons contributed to a tumultuous life and career marked by brilliant accomplishments and abysmal failures.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "21.95",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "The Case of the Golden Slipper (The New Adventures of Mary Kate & Ashley, No. 20)",
        "Authors": "By Metz, Melinda",
        "Description": "Trenchcoat Twins Case Report...from Mary-Kate and AshleyIt was like a fairy tale come true: Ashley and I got invited to a royal ball in honor of a real live princess! We couldn't wait to meet Princess Glorianna.But right before the ball, the princess was kidnapped! Our only clue was a golden slipper we found outside her room--and a note warning us not to call the police, or else!It was up to Olsen and Olsen to find the princess--or this fairy tale would have a very unhappy ending!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "HarperEntertainment",
        "Price Starting With ($)": "9.82",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Psychiatric Dictionary (Oxford Medicine Publications)",
        "Authors": "By Hinsie, Leland E & Campbell, Robert Jean",
        "Description": "",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1981"
        }
    },
    {
        "Title": "Small Time Operator Edition",
        "Authors": "By Kamoroff, Bernard",
        "Description": "",
        "Category": "",
        "Publisher": "Bell Springs Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Carolina: Mountain Man, Smoky Mountain Sunrise, Call of the Mountain, Whiter Than Snow (Inspirational Romance Collections)",
        "Authors": "By Lehman, Yvonne",
        "Description": "",
        "Category": "",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Conversations : Strategies for Teaching, Learning, and Evaluating",
        "Authors": "By Routman, Regie",
        "Description": "\"Talking the process of change and teaching is a necessity for our intellectual and social well-being,\" says acclaimed author Regie Routman. Now, in this long-awaited volume, Routman continues the discussion she began in the best-selling Invitations and further explores the full universe of an effective language arts and literacy program across the curriculum. Filled with an array of field-tested teaching ideas, detailed strategies, reviews of theory, teacher-crafted lessons, and lists of resources, Conversations is all you need to become an informed, confident professional, sensitive to your students' needs and interests. What's more, it incorporates Routman's perspective on important topical issues such as curricular rigor, direct teaching, specific skills, and daily monitoring.  Conversations is grounded in the belief that the connections, interactions, reflections, and new thinking that evolve from rich dialogue define what we know. It was written, in part, to spur teachers to challenge assumptions, clarify their own learning, and take the lead in their own professional development. While this is not a book about a particular methodology, Routman does explore current theory and practice, and supports her views with classroom-based and scientific research. The book is upbeat and practical; each chapter is self-contained and can be read in any order. As Routman shares her own experiences and resources - through narratives, anecdotes, step-by-step demonstrations, and examples of students' work - we may find ourselves questioning, modifying, validating, or changing our own practices. Most of all, we will find ourselves talking. And here is where the conversation begins.  Text chapters: 656pp  -  The Blue Pages: Resources for Teachers: 240pp",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Heinemann",
        "Price Starting With ($)": "7.46",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Always at Ease",
        "Authors": "By McCullough, Christopher J.",
        "Description": "The author discusses social anxiety, tracing shyness to the psychological and philosophical issues of self-esteem and offering tested methods for treating this anxiety at its roots",
        "Category": " Psychology , General",
        "Publisher": "Tarcher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Handcrafted Cards: From Elegant to Whimsical 60 Distinctive Designs to Make",
        "Authors": "By Gilchrist, Paige",
        "Description": "“The cards...go beyond simple greetings...and are small works of art. Twenty-two designers contributed projects to Gilchrist’s book using collage, fabric, printing, and photocopies decorated and embellished to make one-of-a-kind creations....Recommended for public libraries.”—Library Journal. “This is a beautiful book with handsome, inspiring projects....Easily is one of the top books of the past year.”—RubberStampMadness.",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "Lark Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Emily of New Moon (The Emily Books, Book 1)",
        "Authors": "By Montgomery, L. M.",
        "Description": "From the author of Anne of Green Gables, the first book of the beloved Emily trilogy—recently seen on Netflix’s hit show Russian Doll!Emily Starr never knew what it was to be lonely—until her beloved father died. Now Emily's an orphan, and her snobbish relatives are taking her to live with them at New Moon Farm. Although she's sure she'll never be happy there, Emily deals with her stern aunt Elizabeth and her malicious classmates by using her quick wit and holding her head high.In this first volume of the celebrated Emily trilogy, Lucy Maud Montgomery draws a more realistic portrait of a young orphan girl's life on early twentieth-century Prince Edward Island. Along with Emily Climbs and Emily’s Quest, Emily of New Moon insightfully portrays the beauty and anguish of growing up.",
        "Category": "",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1983"
        }
    },
    {
        "Title": "How To Think Like Einstein - Simple Ways To Break The Rules And Discover Your Hidden Genius",
        "Authors": "By Thorpe, Scott",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Elementary and Middle School Mathematics: Teaching Developmentally (4th Edition)",
        "Authors": "By Van De Walle, John A.",
        "Description": "John A. Van de Walle has written a book that helps readers make sense of mathematics and become confident in their ability to teach mathematics to children K to 8. Elementatry and Middle School Mathematics  consists of 16 chapters reflecting the view that all mathematics can be taught through a problem-solving approach that motivates children and builds their confidence as they learn.   This book thoroughly discusses the new standards and clearly develops four key aspects of teaching mathematics: the nature of mathematics as a science of pattern and order; an understanding of how children learn mathematics; a problem solving view of teaching mathematics; and specific methods for integrating assessment with instruction.  Simple yet effective classroom activities are woven throughout the chapters as well as suggestions for technology and literature.     For teachers, future teachers, and educators.        nt Code",
        "Category": " Education , Elementary",
        "Publisher": "Longman Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Happy Quilts: Cheerful Projects to Brighten Your Home",
        "Authors": "By Fall, Cheryl",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "5.74",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "A Swiftly Tilting Planet",
        "Authors": "By L'Engle, Madeleine",
        "Description": "Meg Murry O'Keefe and her family are just sitting down to Thanksgiving dinner when her father gets a phone call from the White House about a madman's threat of nuclear war. Only an old Irish rune seems to hold a clue to averting worldwide disaster, and and when Meg's brother Charles Wallace, now fifteen, recites it, a radiant white beast--the unicorn Gaudior--appears to join him on his quest. But there are only twenty-four hours in which to stop tragedy from occurring. Can Charles Wallace, with the help of Gaudior and Meg, possibly succeed?",
        "Category": "",
        "Publisher": "Yearling",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "1980"
        }
    },
    {
        "Title": "Christmas Keepsakes (Christmas Remembered)",
        "Authors": "By Young, Anne Van Wagner, editor",
        "Description": "",
        "Category": " Crafts & Hobbies , Seasonal",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Southern Living 1998 Annual Recipes (Southern Living Annual Recipes)",
        "Authors": "By Adams, Kaye Mabry (editor)",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Stars and Stripes in Peril (Stars & Stripes Trilogy)",
        "Authors": "By Harrison, Harry and Tomlinson, Angela (ILT)",
        "Description": "In an alternative American history set in post-Civil War America, the sequel to Stars & Stripes Forever, the North and South are forced into an uneasy alliance as they join forces to combat a new threat--the British.",
        "Category": " Fiction , Alternative History",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Traveling with the Dead",
        "Authors": "By Hambly, Barbara",
        "Description": "Down through the deathless centuries, the vampires had drunk human blood for sustenance and for sport. They preyed where they willed, for no mortal humans could resist their unclean powers. But now came the ultimate perversion, the unthinkable: someone was conscripting the vampires into the secret service of a foreign power.No government agency or bureaucrat could control the Undead. The idea was absurd, as Dr. James Asher knew all too well.Years in His Majesty's service had taught Asher the finer points of espionage. And he knew the secrets of the vampires - a familiarity hard-won in unwilling service to Don Simon Ysidro, oldest and most subtle of the hunters of the London night. What Asher didn't know was why one of England's established vampires would risk everything to travel across the European continent at the behest of a ruthless spymaster.But he could see the terrifying potential of such an unholy alliance...",
        "Category": " Fiction , Horror",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "The Turing Option: A Novel",
        "Authors": "By Harrison, Harry and Minsky, Marvin",
        "Description": "The world's foremost authority on artificial intelligence is shot by terrorists, and it is up to a brilliant surgeon to reconstruct the scientist's brain using the research he pioneered. 35,000 first printing. $35,000 ad/promo.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Do one thing different (and Other Uncommonly Sensible Solutions to Life's Persistent Problems)",
        "Authors": "By Bill O'Hanlon",
        "Description": "",
        "Category": "",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Economy to Come",
        "Authors": "By William R. Goetz",
        "Description": "",
        "Category": "",
        "Publisher": "Horizon House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Lucky You",
        "Authors": "By Hiaasen, Carl",
        "Description": "Grange, Florida, is famous for its miracles--the weeping fiberglass Madonna, the Road-Stain Jesus, the stigmata man. And now it has JoLayne Lucks, unlikely winner of the state lottery.Unfortunately, JoLayne's winning ticket isn't the only one. The other belongs to Bodean Gazzer and his raunchy sidekick, Chub, who believe they're entitled to the whole $28 million jackpot. And they need it quickly, to start their own underground militia before NATO troops invade America.But JoLayne Lucks has her own plans for the Lotto money--an Eden-like forest in Grange must be saved from strip-malling. When Bode and Chub brutally assault her and steal her ticket, JoLayne vows to track them down, take it back--and get revenge.The only one who can help is Tom Krome, a big-city investigative journalist now bitterly consigned to writing frothy features for a midsized central Florida newspaper. With a persuasive nudge from JoLayne, Krome is about to become part of a story that's bigger and more bizarre than anything he's ever covered.Chasing two heavily armed psychopaths down the coast of Florida is reckless enough, but Tom's got other problems--the murderous attention of a jealous judge; an actress wife who turns fugitive to avoid divorce court; an editor who speaks in tongues; and Tom's own growing fondness for the future millionairess with whom he's risking his neck.The pursuit takes them from the surreal streets of Grange to a buzzard-infested island deep in Florida Bay, where they finally catch up with the fledgling militia--Chub, Bode Gazzer, a newly recruited convenience-store clerk and their baffled hostage, a Hooters waitress.The climax explodes with the hilarious mayhem that is Carl Hiaasen's hallmark. Lucky You is his funniest, most deliriously gripping novel yet.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Things to Do (Child's First Library of Learning)",
        "Authors": "By Virginia Time Life Books - Alexandria",
        "Description": "Instructions for making such challenging projects as seashell mobiles, peanut puppets, paper airplanes, and vegetable animals, presented in a question and answer format.",
        "Category": " Art , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Fabric Savvy: The Essential Guide for Every Sewer",
        "Authors": "By Betzina, Sandra",
        "Description": "Fabric Savvy is a handy, spiral-bound reference on virtually every fabric imaginable--from the newest to the old favorites. It's a must for anyone who has ever felt overwhelmed in a fabric store by all the fabric and notion choices. Fabrics are listed alphabetically for easy reference. Specific information for each fabric includes preshrinking instructions, layout, marking, interfacing, needle and thread options, stitch length, seam finishing, pressing, topstitching, closures, hemming, and more!",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "Taunton Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Vest Book: Create and Customize Your Own Vests Using Embroidery, Fabric Painting, Beadwork, Applique, and a Host of Other Techniques",
        "Authors": "By Farrell, Jacqueline",
        "Description": "Provides step-by-step instructions to embellish plain vests using a variety of materials, such as velvet, silk, linen, ribbon roses, paints, and beads",
        "Category": " Crafts & Hobbies , Fashion",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Machine Applique",
        "Authors": "By Perna, Sharon",
        "Description": "Discusses fabrics, tools, and techniques, shows a variety of projects, and includes diagrams and patterns",
        "Category": " Art , General",
        "Publisher": "Sterling Pub Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "501 Sewing Hints",
        "Authors": "By Nancy Zieman",
        "Description": "",
        "Category": "",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Holiday Crafts Under $10 (Clever Crafter Series)",
        "Authors": "By Childs, Anne Van Wagner (EDT) and Trimble, Linda L. (EDT)",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Life Blood/a Novel of Suspense",
        "Authors": "By Llewellyn, Caroline",
        "Description": "Caroline Llewellyn, acclaimed author of The Masks of Rome and The Lady of the Labyrinth, returns with the powerful and evocative story of a long-ago murder, a lost novel, a neolithic burial mound, and the way in which they interweave to troubling effect in the imagination of a young woman.It's spring when recently widowed Jo Treleven arrives with her baby son, Max, in the picturesque Cotswold village of Shipcote to take possession of a cottage left to her by her grandmother.Jo, a children's book writer and illustrator, hopes to find here the peace that has eluded her since her husband's mysterious death. Instead, she learns that she's living in the house where a woman was brutally murdered fifty years ago. The killer was never caught, but the murderer's identity may have been revealed in a novel written by Jo's grandmother. Strangely, all copies of the published book, Life Blood, seem to have been destroyed.Far from home and alone, Jo discovers, to her surprise, that she's distantly related to an influential local family, the Mallabys, who both attract and unsettle her. She reaches out to a young single mother, Sophie Dymock, and feels herself increasingly drawn to a divorced American, David Cornelius, and his eleven-year-old son, Rafe.But whom can she trust? As her search for Life Blood leads her to disturbIng truths about the past, Jo realizes that she may have put herself and her baby in mortal danger.A born storyteller, Llewellyn brings elegance and style to her superb novels of suspense. Life Blood is the best yet from this gifted author.",
        "Category": " Fiction , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Live Your Dreams",
        "Authors": "By Brown, Les",
        "Description": "Here is Les Brown's personal formula for success and happiness -- positively charged thoughts, guidance, examples, plus an Action Planner to help you focus your thoughts on specific goals...and achieve them all. The answers are all here in this astonishing book -- with one simple, powerful message: We may not always be able to control what is put in our path, but we can always control what we are...and what we will become.",
        "Category": "",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "July",
            "Year": "1994"
        }
    },
    {
        "Title": "Elegant Choices, Healing Choices",
        "Authors": "By Sinetar, Marsha",
        "Description": "Explains how small day-to-day choices can lead us to our personal goals, tells how to overcome fears, and stresses the importance of love",
        "Category": " Psychology , Developmental , General",
        "Publisher": "Paulist Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "My Mother My Self",
        "Authors": "By Friday, Nancy",
        "Description": "A candid exploration of the mother-daughter relationship probes the private emotions, pains, joys, and secrets and charts the stages of a woman's life",
        "Category": "",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1987"
        }
    },
    {
        "Title": "From Conception to Birth: A Life Unfolds",
        "Authors": "By Tsiaras, Alexander and Werth, Barry",
        "Description": "The splendor and beauty of a child’s growth and development in the womb--seen through unforgettable images made possible by revolutionary advances in visualization technologyWhat’s happening with the baby now?  All expectant parents ask this question throughout the exhilirating months of pregnancy.  Fuzzy sonograms and doctor’s explanations can provide basic information, but through Alexander Tsiaras’ remarkable achievements in medical imaging technology, parents can see, for the first time, the awe-inspiring process of a new life unfolding, in stunning, vivid detail.The milestones of pregnancy which before could only be described can now be witnessed:  the heart’s first beats; the appearance of color in the eye; the emergence of toes and teeth; the brain and nervous system directing development; the first movement of tiny legs and arms; the first indications of gender; the wondrous symbiosis of mother and child; the symphony of the body’s systems coming into being and working in concert. The book tracks the development of a baby from the moment of conception, through the explosively complex early stages of development and the amazing stages of growth as the baby is nurtured by the mother, ending with the joy of birth.All this is made possible by revolutions in two sciences.  As biologists have decoded the molecular basis of life, computer scientists have developed non-invasive, three-dimensional techniques for visualizing the body.  Alexander Tsiaras has been a pioneer in merging these explorations and discoveries.  He has created a virtual camera studio that enables him to view a human body or any part of it individually, scan it, enlarge it, rotate it, adjust its transparency so that we can view inside a living being, and light it from any angle.  The result is an ability to illuminate the unseen elements that make us who we are, and the miraculous images in From Conception to Birth.",
        "Category": " Medical , Nursing , Maternity, Perinatal, Women's Health",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Door Number Three",
        "Authors": "By O'Leary, Patrick",
        "Description": "John Donelly's life is changed forever the day Laura, a young therapy patient, tells him that she has been left for a year on Earth by the Holock, an alien race. If she can convince one person - and she has chosen him - that she is telling the truth, she can stay when they come back for her. And she exposes her breasts as evidence, revealing square nipples. His least profound response is to drop his cigarette into the crease in his chair. So begins the wildest SF novel since the passing of Philip K. Dick. Patrick O'Leary's Door Number Three is a constant wellspring of surprise and wonder, a novel about a young man of today and a woman from somewhere else who is out to love or kill him - or both. The whole, apparently real, world and everything in it can never be the same again.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "No Easy Answers - The Learning Disabled Child At Home and At School",
        "Authors": "By Sally L. Smith",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Reposition Yourself: Living Life Without Limits",
        "Authors": "By Jakes, T. D.",
        "Description": "\"If you don't like the way your life is going, redesign it. Redeem the years you lost. Restore your vision, revive your passion for living, and reclaim what was dormant inside of you. I cannot give you the dream but I can give you the tools to reach the dreams you have inside. I have seen what successful people do over and over again. I want to show you how to Reposition Yourself so you can do it, too. I have learned that minor adjustments make a big difference.\"-- T.D. JakesIn his latest book, Reposition Yourself, bestselling author T.D. Jakes shares insights that will help readers adjust to the many changes that life brings. This is a shrill wake-up call to take charge of your life now. Not only does it confront areas where subtle passivity or even poor choices may have stifled the reader's creativity, but it also instructs how to manage change and maximize life now. Using wisdom collected from his more than thirty years of counseling and working with everyday and high-profile people, Jakes covers financial, relational, and spiritual creativity and shows how adapting to transitional moments in your life is the path to an enriched existence filled with contentment at every stage.Reposition Yourself offers reality-based plans for those seeking to make the years ahead even more productive. Jakes accepts the inevitability of change, teaching how to embrace and expect it rather than fear it. Mixing both sacred and secular insights, he shares a unique blend of practical and pragmatic steps coupled with the sage wisdom of Scripture for which he is noted.This new book is without question a makeover for the soul. It gives you permission to succeed and the how-to's necessary to position yourself for the limitless potential that comes from making minor adjustments in your thinking and plans. Jakes believes there is nothing more important than your next decision. Before you make another choice, this is a must-read!",
        "Category": " Religion , Christian Living , Personal Growth",
        "Publisher": "Atria Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Router Basics (Basics Series)",
        "Authors": "By Spielman, Patrick",
        "Description": "Hundreds of tips, backed by more than 200 close-up, step-by-step photos and drawings. “A good starter volume.”—Booklist. “Includes a useful glossary of bit types and a list of safety rules....Well-photographed instructions on how to make various cuts—straight, arcs, freehand routing—and includes instructions for a practical application for each of them.”—Woodworker’s Journal.",
        "Category": " House & Home , Power Tools",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1990"
        }
    },
    {
        "Title": "The Sacrament of Reconciliation",
        "Authors": "By Lovasik, Lawrence G.",
        "Description": "",
        "Category": "",
        "Publisher": "Catholic Book Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Who's So Scary (Monsters, Inc.)",
        "Authors": "By RH Disney",
        "Description": "\"The monsters like to play a game.  Who's so scary? is its name.  Inside this touch and feel book, you'll find sticky monsters, furry monsters, smooth monsters--and more!\"--P. [4] of cover.",
        "Category": " Juvenile Fiction , Bedtime & Dreams",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Backyard Animals (Eyes on Nature)",
        "Authors": "By Acker, Kerry",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Bears (Eyes on Nature)",
        "Authors": "By Olson, Donald",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Rudolph the Red-Nosed Reindeer (Little Golden Storybook)",
        "Authors": "By Arkadia",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Mountain, Get Out of My Way: Life Lessons and Learned Truths",
        "Authors": "By Williams, Montel and Paisner, Daniel",
        "Description": "Born in Baltimore's black ghetto, Montel Williams was the youngest of four children in a family that was hardworking but loving. At the suggestion of a family friend, he joined the Marine Corps. There he acquired an education, a sense of direction, and a respect for discipline - values he would never forget.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "The Clue in the Crumbling Wall (Nancy Drew No. 22)",
        "Authors": "By Keene, Carolyn",
        "Description": "When Nancy is asked to find a professional dancer who disappeared several years before, the young detective becomes involved in a mystery reaching far beyond a missing-person’s case. During Nancy’s investigation at Heath Castle, she and her friends Bess and George realize that its crumbling walls contain a secret, but what is it? And who are their enemies that try to foil their every attempt to unravel the intricate puzzle? Danger lurks in a castle tower and throughout the vine-tangled grounds of the estate. The girls’ gripping adventures culminate in a dramatic climax when Nancy exposes a sinister plot to defraud the dancer of her inheritance.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1973"
        }
    },
    {
        "Title": "Nancy Drew 24: the Clue in the Old Album",
        "Authors": "By Keene, Carolyn",
        "Description": "Nancy Drew witnesses a purse snatching and runs after the thief. She rescues the purse, but not its contents, then is asked by the owner, a doll collector, to do some detective work. Readers will enjoy Nancy's clever ways of finding all she seeks, and bringing happiness to a misunderstood child and her lonely grandmother.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1947"
        }
    },
    {
        "Title": "Soul Matters",
        "Authors": "By Sanders, Yolonda Tonnette",
        "Description": "Discovering that her unfaithful husband has infected her with a sexually transmitted disease, pregnant teacher Wendy struggles with the prospect of ending her marriage while continuing to set a Christian example for her younger sister, a situation that is compromised by the ostracism of their grandmother. Original. 10,000 first printing.",
        "Category": " Fiction , Religious",
        "Publisher": "Walk Worthy Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Nancy Drew 43: the Mystery of the 99 Steps",
        "Authors": "By Keene, Carolyn",
        "Description": "Nancy Drew must search for a flight of 99 steps to solve the mystery of a friend’s weird dream. Her search leads her to France, but before she leaves the United States, an unknown person calling himself Monsieur Neuf warns the young sleuth not to pursue her mission.With her friends Bess and George, Nancy arrives in Paris to join her father who is working on another case: to find out what, or who, is frightening wealth financier Monsieur Leblanc into selling large amounts of securities. Startling discoveries convince the young detective that Mr. Drew’s case and her own mystery are linked by the 99 steps, and that a mysterious man has a strong hold over Leblanc. Is it blackmail? Nancy’s quest for further clues leads to the romantic chateau country in the Loire Valley, where a web of danger closes in tightly around the three girls.",
        "Category": " Juvenile Fiction , Girls & Women",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1965"
        }
    },
    {
        "Title": "Budgeting Fundamentals for Nonfinancial Executives and Managers (McGraw-Hill paperbacks)",
        "Authors": "By Sweeny, Allen",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1977"
        }
    },
    {
        "Title": "161 Waterfowling Secrets",
        "Authors": "By Ducks Unlimited (EDT), Young, Matt (EDT), Salber, Lee D. (ILT), and Difrisco, Michael (ILT)",
        "Description": "Covers a wide range of waterfowling tips and advice from DU members.",
        "Category": " Sports & Recreation , Fishing",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "The Ring of Five Dragons (The Pearl)",
        "Authors": "By Lustbader, Eric",
        "Description": "A towering multi-volume fantasy, The Pearl, is launched by Eric Van Lustbader in The Ring of Five Dragons. Lustbader, one of the most famous and popular writers of the last three decades, returns to the fantasy genre with his most ambitious work yet. Filled with action, colour, and the myriad details of another world, The Pearl is the first great new fantasy series epic of the new millennium, set to rival Robert Jordan, David Eddings, and Terry Goodkind in popular appeal. The Kundalan people have suffered for a century under the viciously oppressive, technologically-superior Vornn invaders. In the resulting crisis of faithwhy hasnt their goddess Miina saved them?Kundalan religion falls under the control of evil forces from within. They, pretending to have no magic of their own and forbid the teaching of traditional sorcery. The Vornns mysterious leaders, the Gyrgon, search for the lost Ring of Five Dragons, the key to the door of the fabled Kundalan Storehouse, and perhaps to Kundalan sorcery as well. Misused, the ring triggers seemingly inexorable annihilation for Vornn and Kundalan alike. Now, from among the oppressed, must arise the hero of prophecy, the Dar Sala-at, who alone can wield the sorcerous power to save the world. Thus begins a huge epic, rooted in the conflict between spiritual and technological civilizations, that confronts difficult moral and cultural questions in a manner reminiscent of Frank Herberts Dune.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Tor Books",
        "Price Starting With ($)": "5.09",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "The land of miracles",
        "Authors": "By Etling, Harold",
        "Description": "This series of studies is ideal for Sunday school, new members' classes, prayer meeting topics, or individual use. It presents a brief historical background and the beliefs and practices of the Fellowship of Grace Brethren Churches.Some of the highlights of this important series of studies include the emphasizing of the fact that the Fellowship of Grace Brethren Churches accepts the Bible to be the foundation for teaching and guidance, the meaning of salvation and what it includes, baptism, the service of feet washing, the Lord's Supper, the anointing of the sick, separation, and the Second Coming of Christ. These topics and a number of others are included in the excellent 13-chapter study guide.",
        "Category": " Religion , Christian Rituals & Practice , General",
        "Publisher": "BMH Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Cross: Also published as ALEX CROSS (Alex Cross, 12)",
        "Authors": "By Patterson, James",
        "Description": "Alex Cross faces the most cunning, psychotic killer of his career in the blockbuster James Patterson novel that inspired a major motion picture.Alex Cross was a rising star in the Washington, D. C. Police Department when an unknown shooter gunned down his wife in front of him. Alex's need for vengeance was placed on hold as he faced another huge challenge: raising his children without their mother.Years later, Alex is making a bold move in his life. He has left the FBI and set up practice as a psychologist once again. His life with Nana Mama, Damon, Jannie, and little Alex finally feels like it's in order. He even has a chance at a new love.Then Cross's former partner, John Sampson, calls in a favor. Now Cross must go on the hunt for the most cunning, psychotic killer he has ever faced. . . and it pushes him dangerously close to the breaking point.",
        "Category": " Fiction , Thrillers",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Funny Stuff: Over 300 Clean Jokes You Can Tell Your Grandma",
        "Authors": "By Murdock, Clyde",
        "Description": "",
        "Category": " Humor , Form , Jokes & Riddles",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Writing Papers in the Biological Sciences",
        "Authors": "By Mcmillan, Victoria E.",
        "Description": "Written by a professional biologist who is also an experienced writing teacher, this comprehensive guide for students writing in biology, zoology, and botany provides detailed instruction on researching, drafting, revising, and documenting papers, reviews, poster presentations, and other forms of writing.",
        "Category": " Science , Essays",
        "Publisher": "Bedford/St Martins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "St Mawr & the Man Who Died",
        "Authors": "By Lawrence, D. H.",
        "Description": "",
        "Category": "",
        "Publisher": "VINTAGE (DIV OF RANDOM HOUSE)",
        "Price Starting With ($)": "6.63",
        "Publish Date": {
            "Month": "January",
            "Year": "1928"
        }
    },
    {
        "Title": "The Big Golden Book Of Wild West",
        "Authors": "By Biggs, Gene",
        "Description": "Surveys the history of the American West, describes Indian culture, and looks at settlers, cowboys, the Gold Rush, and pioneer life",
        "Category": "",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Reach for the Rainbow: Advanced Healing for Survivors of Sexual Abuse",
        "Authors": "By Finney, Lynne D.",
        "Description": "A question-and-answer format outlines self-healing techniques for survivors of sex abuse and addresses such sensitive issues as cult abuse, multiple personality disorder, flashbacks, suicidal thoughts, and legal repercussions. Original.",
        "Category": " Self-help , Abuse",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "The Sparrow: A Novel (The Sparrow Series)",
        "Authors": "By Russell, Mary Doria",
        "Description": "A visionary work that combines speculative fiction with deep philosophical inquiry, The Sparrow tells the story of a charismatic Jesuit priest and linguist, Emilio Sandoz, who leads a scientific mission entrusted with a profound task: to make first contact with intelligent extraterrestrial life. The mission begins in faith, hope, and beauty, but a series of small misunderstandings brings it to a catastrophic end.   Praise for The Sparrow   “A startling, engrossing, and moral work of fiction.”—The New York Times Book Review    “Important novels leave deep cracks in our beliefs, our prejudices, and our blinders. The Sparrow is one of them.”—Entertainment Weekly   “Powerful . . . The Sparrow tackles a difficult subject with grace and intelligence.”—San Francisco Chronicle   “Provocative, challenging . . . recalls both Arthur C. Clarke and H. G. Wells, with a dash of Ray Bradbury for good measure.”—The Dallas Morning News   “[Mary Doria] Russell shows herself to be a skillful storyteller who subtly and expertly builds suspense.”—USA Today",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Promise Me (Myron Bolitar, No. 8)",
        "Authors": "By Coben, Harlan",
        "Description": "#1 New York Times bestselling author Harlan Coben reveals the deadly consequences that can be born of the best intentions.  As the school year winds down, Myron Bolitar is determined to help keep his friends’ children safe from the dangers of drinking and driving. So he makes two neighborhood girls promise him that if they are ever in a bind but are afraid to call their parents, they must call him. Several nights later, the call comes at two a.m. The next day, a girl is missing and Myron is the last person who saw her. Racing to find her before she’s gone forever, Myron must outrun his own troubled past and decide once and for all who he is and what he will stand up for...",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Dutton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Girl Meets God: A Memoir",
        "Authors": "By Winner, Lauren F.",
        "Description": "The child of a Jewish father and a lapsed Southern Baptist mother, Lauren F. Winner chose to become an Orthodox Jew. But even as she was observing Sabbath rituals and studying Jewish law, Lauren was increasingly drawn to Christianity. Courageously leaving what she loved, she eventually converted. In Girl Meets God, this appealing woman takes us through a year in her Christian life as she attempts to reconcile both sides of her religious identity.Here readers will find a new literary voice: a spiritual seeker who is both an unconventional thinker and a devoted Christian. The twists and turns of Winner’s journey make her the perfect guide to exploring true faith in today’s complicated world.Praise for Girl Meets God:“A passionate and thoroughly engaging account of a continuing spiritual journey within two profoundly different faiths.” –The New York Times Book Review“A charming, humorous, and sometimes abrasive recollection of a religious coming-of-age . . . a compelling journey from Judaism to Christianity.”–The Atlanta Journal-Constitution“A book to savor . . . Winner is an all-too-human believer, and the rest of us can see our own struggles, theological and otherwise, in hers.”–Fort Worth Star-Telegram“[A] memoir, literary and spiritual, sharing Anne Lamott’s self-depreciating intensity and Stephen J. Dubner’s passion for authenticity . . . Winner’s record of her own experiences so far is a page-turning debut by a young writer worth watching.”–Publishers Weekly (starred review)“[The] narrative’s real strength . . . is its addictive readability combined with the author’s deep knowledge of, delight in, and nuanced discussion of both Christian and Jewish teachings. . . . Intriguing, absorbing, puzzling, surprisingly sexy, and very smart.”–Kirkus Reviews (starred review)",
        "Category": " Religion , Christianity , General",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Romantic Virginia: More Than 300 Things to Do for Southern Lovers (Romantic South Series)",
        "Authors": "By Sutcliffe, Andrea",
        "Description": "",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "John F Blair Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Pashazade (Arabesk)",
        "Authors": "By Grimwood, Jon Courtenay",
        "Description": "Part mystery, part speculative fiction, and wholly unforgettable, Jon Courtenay Grimwood’s celebrated Arabesk series portrays the dark, hard-boiled story of a man out to prove his innocence in an alternate world where the  facts aren’t always the same as the truth . . . and murder isn’t the worst that can happen.It’s a twenty-first century hauntingly familiar—and yet startlingly different from our own. Here the United States brokered a deal that ended World War I, and the Ottoman Empire never collapsed. And lording it over all sits the complex, seductive, and bloodthirsty North African metropolis of El Iskandryia. Almost nothing is what it seems to be in El Isk, and Ashraf Bey is no exception. Neither the rich Ottoman aristocrat everyone thinks he is, nor the minor street criminal once shipped off to prison when he fell foul of his Chinese Triad employers–the fact is that Raf has as little idea who he is as anyone else. With few clues and no money, all Raf has is a surname hinting at noble heritage and an arranged marriage to a woman who hates him. But nothing Ashraf al Mansur learns about himself is as unexpected—or as terrifying—as the brutal murder he’s accused of committing. Now, as a hunted man with the welfare of a precocious young girl in his irresponsible hands, Raf must race after a killer through an unforgiving city as foreign to him as the truth he'll uncover about himself.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Spectra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The Bridesmaids ~ Inside the Privileged World of Grace Kelly and Six Intimate Friends",
        "Authors": "By Quine, Judith Balaban",
        "Description": "Offers an intimate portrait of the Princess of Monaco through the eyes of her bridesmaids--from Kelly's rise to Hollywood stardom to her spectacular wedding",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "Prisoner's Dilemma",
        "Authors": "By Powers, Richard",
        "Description": "Something is wrong with Eddie Hobson Sr., father of four, sometime history teacher, quiz master, black humorist and virtuoso invalid. His recurring fainting spells have worsened, and with his ingrained aversion to doctors, his worried family tries to discover the nature of his sickness.  Meanwhile, in private, Eddie puts the finishing touches on a secret project he calls Hobbstown, a place that he promises will save him, the world and everything that&#39;s in it.A dazzling novel of compassion and imagination, Prisoner&#39;s Dilemma is a story of the power of invalid experience.",
        "Category": " Fiction , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "17.49",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Aunt Erma's Cope Book",
        "Authors": "By Bombeck, Erma",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "Motherhood the Second Oldest Profession",
        "Authors": "By Bombeck, Erma",
        "Description": "A witty study of the many diverse roles of a mother takes a compassionate, original, and hilarious look at the frustrations and fulfillments, trials and tribulations of modern motherhood",
        "Category": "",
        "Publisher": "Bantam Doubleday Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1984"
        }
    },
    {
        "Title": "Silver Linings",
        "Authors": "By Krentz, Jayne Ann",
        "Description": "When Seattle art dealer Mattie Sharpe runs into her old flame, professional adventurer Hugh Abbott, in an island jungle, they are both running for their lives, facing danger, and rediscovering the passion they lost years before",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "The Warlock's Companion",
        "Authors": "By Stasheff, Christopher",
        "Description": "",
        "Category": "",
        "Publisher": "Ace Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1988"
        }
    },
    {
        "Title": "Behind the Locked Door (Adventures in Odyssey Fiction Series #4)",
        "Authors": "By McCusker, Paul",
        "Description": "Mark's curiosity leads him into trouble when he stays with Mr. Whittaker, the owner of Whit's End, while his mother is in Washington, D.C., trying to work out her differences with Mark's father",
        "Category": " Juvenile Fiction , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "The Panther Mystery (66) (The Boxcar Children Mysteries)",
        "Authors": "By Warner, Gertrude Chandler and Tang, Charles (ILT)",
        "Description": "The Aldens travel to the Florida Everglades to search for a missing park ranger. While gathering clues, they learn about about his interest in the endangered Florida panther. Does the wild cat hold the secret to the ranger’s whereabouts?",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Albert Whitman & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Close To The Bone",
        "Authors": "By Wiltse, David",
        "Description": "Terrorism, murder, and an icepick-wielding assassin are the pieces of a deadly puzzle John Becker must assemble before the killer strikes again, in this harrowing prequel to Prayer for the Dead.\"A spellbinding thriller,\" Wrote Publishers Weekly of Wiltse's Prayer for the Dead. \"Bloodcurdling and insanely original,\" said The New York Times Book Review.Now FBI agent John Becker is back to face Roger Bahoud, a mercurially violent international assassin who has descended on New York City for his latest victim: a visiting diplomat who holds the key to peace in the Middle East. A wild card too unpredictable for the KGB handlers who trained him, Bahoud is employed this time as a mercenary by Islamic fundamentalists.In the end, Becker must battle against time and his own psychological demons to outwit and outstep the ruthless Bahoud before the assassin can strike. The tension mounts and cuts close to the bone as Becker and Bahoud stalk each other in this taut, chilling thriller.",
        "Category": " Drama , General",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "10.08",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Sealed with a Kiss (Disney Princess) (Step into Reading)",
        "Authors": "By Lagonegro, Melissa and Marrucchi, Elisa (ILT)",
        "Description": "Ariel loves playing hide-and-seek with her little seal friend. But when the princess can’t find him anywhere she begins to worry. After a long search through the ocean, Ariel finally finds him. The happy princess gives the seal a huge hug—and seals it with a kiss! This sweet Step 2 book features the Little Mermaid in her very first Step into Reading.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Checkmate (Tom Clancy's Splinter Cell)",
        "Authors": "By Clancy, Tom",
        "Description": "Third Echelon special operative Sam Fisher is pitted against one of the greatest enemies of the free world when a cargo freighter, armed with radioactive material, heads straight for the U.S. coast, while another strike renders a small New Mexico town helpless due to radiation poisoning. Original.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Flyer: A Tale of the Wright Dog (No. 5 in Suzanne Tate's History Series)",
        "Authors": "By Tate, Suzanne and Melvin, James",
        "Description": "Based on the true story of Flyer, a dog owned by Wilbur Wright when he flew in France during 1908-1909.",
        "Category": " Juvenile Nonfiction , Animals , Dogs",
        "Publisher": "Nags Head Art, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "The Kingfisher Illustrated Pocket Dictionary",
        "Authors": "By Crawley, Angela (EDT)",
        "Description": "A completely new and original illustrated children's dictionary that offers comprehensive and up-to-date coverage with more than 12,000 entries and 15,000 definitions.  Definitions have been carefully written for children, ages 9-12, and include sample sentences that clarify usage questions.   More than 200 clearly labeled, informative, full-color illustrations further aid comprehension. Detail-packed entries include multiple definitions, pronounciation and part of speech guides, as well as irregular plural forms, alternate spellings, idioms, verb forms, and syllabication. This convenient pocket dictionary is perfect for using at home or carrying to school.",
        "Category": " Juvenile Nonfiction , Reference , Dictionaries",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Rumpole and the Angel of Death",
        "Authors": "By Mortimer, John Clifford",
        "Description": "In John Mortimer's latest collection of Rumpole stories the comic, courageous, and corpulent \"great defender of muddled and sinful humanity\" is joined by a winning cast of villains and victims in tales whose wry humor and sparkling wit deftly send up the British legal system.In Rumpole and the Angel of Death our hero achieves new, resounding triumphs over the forces of prejudice and mean-mindedness. \"Rumpole and the Way through the Woods\" involves Rumpole in the world of hunters and the hunted, animal rights and human wrongs. In \"Rumpole and the Rights of Man,\" he finds at the European Court of Human Rights that international justice is as fallible as the domestic variety. And for the first time, Hila, She Who Must Be Obeyed, tells a story all her own.This richly entertaining volume will delight fans who have been waiting, Rumpoleless, for more than two years, and will convert new adherents to the faith.",
        "Category": " Fiction , Mystery & Detective , Traditional",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Glory of God",
        "Authors": "By Chapman, Rex",
        "Description": "",
        "Category": "",
        "Publisher": "SCM-Canterbury Press Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "If You Could See Me Now",
        "Authors": "By Ahern, Cecelia",
        "Description": "From the bestselling author of P.S. I Love You and Love, Rosie, Cecelia Ahern, comes an enchanting novel that leads you to wonder if Not Seeing is believing!Readers and critics alike adore Cecelia Ahern for her lighthearted yet insightful stories about modern women and their often unusual situations. In If You Could See Me Now, she takes that theme a step further, offering us a heroine who is entirely believable, and the new man in her life who is, well, slightly less so.Elizabeth Egan's life runs on order: Both her home and her emotions are arranged just so, with little room for spontaneity. It's how she counteracts the chaos of her family--an alcoholic mother who left when she was young, an emotionally distant father, and a free-spirited sister, who seems to be following in their mother's footsteps, leaving her own six-yearold son, Luke, in Elizabeth's care. When Ivan, Luke's mysterious new grown-up friend, enters the picture, Elizabeth doesnt know quite what to make of him. With his penchant for adventure and colorful take on things large and small, Ivan opens Elizabeth's eyes to a whole new way of living. But is it for real? Is Ivan for real?If You Could See Me Now is a love story with heart--and just a touch of magic.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Encyclopedia Brown and the Case of the Mysterious Handprints",
        "Authors": "By Owens, Gail and Sobol, Donald J.",
        "Description": "The ten-year-old detective continues his war on crime in Idaville through ten more cases, for which the reader is invited to guess the solution before it is revealed",
        "Category": " Juvenile Fiction , Mysteries & Detective Stories",
        "Publisher": "Skylark",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "New Cinema in the U. S. A. (Picturebacks)",
        "Authors": "By Manvell, Roger",
        "Description": "",
        "Category": "",
        "Publisher": "Littlehampton Book Services Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "The Mind Field: A Personal Essay",
        "Authors": "By Ornstein, Robert E.",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "6.79",
        "Publish Date": {
            "Month": "February",
            "Year": "1978"
        }
    },
    {
        "Title": "It Happened to Nancy: By an Anonymous Teenager, A True Story from Her Diary",
        "Authors": "By Sparks, Beatrice (EDT)",
        "Description": "A teenaged victim of AIDS recounts her battle with the disease in her diary, describing her first love, the night she was date-raped, her diagnosis of AIDS, and her thoughts and dreams. Original.",
        "Category": "",
        "Publisher": "HarperTeen",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Introductory Lectures on Psychoanalysis",
        "Authors": "By Freud, Sigmund, Gay, Peter (INT), and Strachey, James (TRN)",
        "Description": "In reasoned progression he  outlined core psychoanalytic concepts, such as  repression, free association and libido. Of the  various English translations of Freud's major  works to appear in his lifetime, only one was  authorized by Freud himself: The Standard  Edition of the Complete Psychological Works of  Sigmund Freud under the general editorship of  James Strachey.Freud approved the overall  editorial plan, specific renderings of key words and phrases, and the addition of valuable notes,  from bibliographical and explanatory. Many of  the translations were done by Strachey himself;  the rest were prepared under his supervision.  The result was to place the Standard Edition in  a position of unquestioned supremacy over all  other existing versions.Newly designed in a  uniform format, each new paperback in the  Standard Edition opens with a biographical essay on Freud's life and work —along with a note on  the individual volume—by Peter Gay, Sterling  Professor of History at Yale.",
        "Category": " Psychology , Movements , Psychoanalysis",
        "Publisher": "Liveright",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "Pathfinders",
        "Authors": "By Sheehy, Gail",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Doubleday Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1982"
        }
    },
    {
        "Title": "Lisa, Bright and Dark",
        "Authors": "By Neufeld, John",
        "Description": "Sixteen-year-old Lisa, smart, attractive, and outwardly successful, suffers from a nervous breakdown that only her closest friends seem to notice and care enough about to try to find a way to help her",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "Civilization and Its Disco",
        "Authors": "By Freud, Sigmund",
        "Description": "",
        "Category": "",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1950"
        }
    },
    {
        "Title": "Elizabeth",
        "Authors": "By Taraborrelli, J. Randy",
        "Description": "After briefly recapping Elizabeth Taylor's rise to fame in Hollywood, this admiring new biography characterizes her love affairs and eight marriages as well as her emotional state during different stages of her life. Interviews with friends, magazine articles, and spousal biographies serve as sources. Fifty black-and-white photographs are provided. Annotation ©2006 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Biography & Autobiography , Rich & Famous",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.04",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "How to Speak Like a Pro",
        "Authors": "By Fletcher, Leon",
        "Description": "This book contains step-by-step strategies to help you develop both the confidence and skills necessary to become a good speaker, and features a handy \"checklist\" at teh end of each chapter.From the Paperback edition.",
        "Category": " Language Arts & Disciplines , Public Speaking & Speech Writing",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1985"
        }
    },
    {
        "Title": "Lectures on psychoanalytic psychiatry (A Vintage book)",
        "Authors": "By Brill, A. A.",
        "Description": "",
        "Category": "",
        "Publisher": "Vintage Books",
        "Price Starting With ($)": "9.97",
        "Publish Date": {
            "Month": "January",
            "Year": "1955"
        }
    },
    {
        "Title": "Light for My Path for the Workplace",
        "Authors": "By n-a",
        "Description": "",
        "Category": "",
        "Publisher": "Humble Creek",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Lucky Jim",
        "Authors": "By Amis, Kingsley and Lodge, David (INT)",
        "Description": "A young Englishman embarks on a humorous crusade against traditional class structures",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    }
]