[
    {
        "Title": "Marriage Savers: Helping Your Friends and Family Avoid Divorce",
        "Authors": "By McManus, Michael J",
        "Description": "",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Pastors At Risk: Help for Pastors, Hope for the Church",
        "Authors": "By Wiseman, Neil B. and London, H. B.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Victor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "LITERACY THROUGH LITEATURE",
        "Authors": "By Johnson, Terry D. and Louis, Daphne R.",
        "Description": "",
        "Category": " Education , General",
        "Publisher": "Heinemann",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Grounded in the Word: A Guide to Mastering Standardized Test Vocabulary and Biblical Comprehension",
        "Authors": "By Williams, Eugene, Jr.",
        "Description": "Vocabulary book based on the words from the New King James version of the Bible to improve vocabulary, reading comprehension, and verbal tests scores on standardized tests",
        "Category": " Reference , General",
        "Publisher": "Comptex Associates, Incorporated",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2017"
        }
    },
    {
        "Title": "Simple Stencil Designs for Your Home",
        "Authors": "By Ann Kooping",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International, Ltd.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "To Walk and Not Grow Weary (Fran Sciacca Series)",
        "Authors": "By Sciacca, Francis",
        "Description": "In this book’s 12 lessons, study the lives of 12 men and women of God who went through hard times yet triumphed through His grace. In so doing, we can learn how our souls can be restored in times of tragedy, hurt, or depression.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "NavPress",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2016"
        }
    },
    {
        "Title": "Prayer Summits",
        "Authors": "By Aldrich, Joseph C.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Multnomah Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Foliage Plants for Modern Living",
        "Authors": "By Editor",
        "Description": "",
        "Category": "",
        "Publisher": "Merchants Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "The Real ACT Prep Guide: The Only Official Prep Guide from the Makers of the ACT",
        "Authors": "By ACT Inc.",
        "Description": "A guide to preparing for the ACT offers advice on test-taking, information on the new optional Writing Test, and three practice ACTs previously used in actual test administrations.",
        "Category": " Study Aids , ACT",
        "Publisher": "Peterson's",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Medical Terminology: A Systems Approach (Medical Terminology Systems)",
        "Authors": "By Gylys, Barbara A. and Wedding, Mary Ellen",
        "Description": "",
        "Category": " Medical , Dictionaries & Terminology",
        "Publisher": "F A Davis Company",
        "Price Starting With ($)": "5.74",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Fighter Aircraft",
        "Authors": "By BILL GUNSTON",
        "Description": "",
        "Category": "",
        "Publisher": "Treasure Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "Heart Whispers: Benedictine Wisdom for Today",
        "Authors": "By Canham, Elizabeth",
        "Description": "Benedict, an Italian monk from the sixth century, gained a fresh perspective on Christian spirituality as he lived by three simple vows: stability, obedience, and conversion. From these he developed spiritual practices that allowed ordinary people to grow spiritually while dealing with the challenges of the everyday. Elizabeth Canham offers accessible insights from Benedict that will help us find a place of inner security in the midst of a mobile, transitory world. Canham guides us to a daily rhythm that balances work and rest, study and play, prayer and compassion. We discover anew that life with God is a journey that grows richer and more blessed as we hear and respond to divine grace. Upper Room.",
        "Category": " Religion , Christianity , Catholic",
        "Publisher": "Upper Room",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "When the Tripods Came",
        "Authors": "By Christopher, John",
        "Description": "When it comes to alien invasions, bad things come in threes.  Three landings. One in England, one in Russia, and one in the United States.  Three long legs, crushing everything in their paths, with three metallic arms, snaking out to embrace -- and then discard -- their helpless victims.  Three evil beings, called Tripods, which will change life on this planet forever.",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1990"
        }
    },
    {
        "Title": "No Flying in the House (Harper Trophy Books (Paperback))",
        "Authors": "By Tripp, Wallace (ILT) and Brock, Betty",
        "Description": "A funny and fantastical novel about a young girl who makes a life-changing discovery about who she really is. Perfect for fans of The Tail of Emily Windsnap—or anyone who has wondered if they might have some magic in them.Most little girls have parents to take care of them, but not Annabel Tippens. She has Gloria, a tiny white dog who talks and wears a gold collar. Annabel never thought it was strange that she had Gloria instead of real parents. Until one day a wicked, wicked cat named Belinda comes to tell her the truth—she's not just a little girl, she's half-fairy!And she can do lots of things that other kids can't do, such as kiss her own elbow and fly around the house. But being a fairy isn't all fun and games, and soon Annabel must make a choice. If she chooses to be a fairy, she'll have to say good-bye to Gloria forever. But how can she decide between her newly found magic and her dearest friend?",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2020"
        }
    },
    {
        "Title": "BEACH RIDE (Saddle Club)",
        "Authors": "By Bryant, Bonnie",
        "Description": "In Florida for her winter break, Carole enjoys days at a theme park with her cousin Sheila, a big family reunion, and a chance to ride horses along Florida's beautiful beaches. Original.",
        "Category": "",
        "Publisher": "Skylark",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Words to Die for: Verses That Shaped the Lives of 30 People Who Changed the World",
        "Authors": "By Kimbrough, Lawrence",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "Holman Reference",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Change is Like a Slinky",
        "Authors": "By Finzel, Hans and Maxwell, John (FRW)",
        "Description": "A practical guide to navigate change in today's organizational climate.  Change or perish: this is a current motto for leaders in all types of organizations.  But how does one adapt to such fast and furious change and effectively lead the  organization through change? Hans Finzel provides a proven strategy in Change  is Like a Slinky, exploring the six major phases in the cycle of change. As  he says, \"Change is a lot like a Slinky... A slinky can be a lot of fun, but  it is also completely unpredictable.\" Instead of grudgingly wading through  inevitable change, readers will find themselves equipped and fired up to tackle  it head on.",
        "Category": " Business & Economics , Organizational Behavior",
        "Publisher": "Northfield Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Zebra Wall",
        "Authors": "By Henkes, Kevin",
        "Description": "When ten-year-old Adine's mother has a new baby, eccentric Aunt Irene comes to stay and shares Adine's bedroom--an event which requires a great deal of adjustment.",
        "Category": " Juvenile Fiction , Family , New Baby",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1989"
        }
    },
    {
        "Title": "A New Dawn of Liberty: The Story of the American Founding",
        "Authors": "By Gregory Wolfe",
        "Description": "",
        "Category": "",
        "Publisher": "The Henry Salvatori Found.",
        "Price Starting With ($)": "6.42",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Christmas Countdown (Fabulous Five, Book 13)",
        "Authors": "By Haynes, Betsy",
        "Description": "Melanie Edwards and the rest of her superlative group pound the pavements in a rare display of civic duty when they attempt to prevent the Christmas Eve killings of animals at a local shelter.",
        "Category": "",
        "Publisher": "Skylark",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Ordering Your Private World",
        "Authors": "By MacDonald, Gordon",
        "Description": "",
        "Category": "",
        "Publisher": "O. Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "In the Beginning: Genesis (Nelson Impact Bible Study Guide)",
        "Authors": "By Thomas Nelson",
        "Description": "The Nelson Impact Bible Study series will introduce in-depth Bible study to Christian laypeople. Each book will help readers experience the true meaning of the messages in the book of Genesis, and in turn, empower the reader to truly make a difference in the world for Christ.Designed for individual or group study, the study guide will provide a foundation for Bible study and encourage the reader to return to the Bible. All necessary background information will be given so that the reader needs only a Bible and the study guide. The messages will be thorough but easily understood and will be complimented by application questions to guide the readers into a deeper relationship with the Bible that will impact their lives with the gospel of Jesus Christ.Other study guides in the series include:1 Corinthians ISBN: 1418506192Exodus ISBN: 1418506168Genesis ISBN: 1418506087Isaiah ISBN: 1418506095John ISBN: 1418506109Mark ISBN: 1418506184Romans ISBN: 1418506117Ruth & Esther ISBN: 1418506176",
        "Category": " Religion , Christian Life , General",
        "Publisher": "HarperChristian Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Toward the End of Time: A Novel",
        "Authors": "By Updike, John",
        "Description": "Set in the near future of 2020, this disconcerting philosophical fantasy depicts an America devastated by a war with China that has left its populace decimated, its government a shambles, and its natural resources tainted. The hero is Ben Turnbull, a sixty-six-year-old retired investment counselor, who, like Thoreau, sticks close to home and traces the course of one Massachusetts year in his journal. Something of a science buff, he finds that his disrupted personal history has been warped by the disjunctions and vagaries of the “many-worlds” hypothesis derived from the indeterminacy of quantum theory. His identity branches into variants extending back through the past and forward into the evolution of the universe, as both it and his own mortal, nature-haunted existence move toward the end of time.",
        "Category": " Fiction , Literary",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Putter Principle, The: Golf's Greatest Legends Discuss the Ultimate Stroke",
        "Authors": "By Freeman, Criswell (EDT)",
        "Description": "The golfer who wishes to lower his handicap must first improve his putting skills. But putting woes are notoriously difficult to cure. Success around the greens requires a unique blend of physical skill and mental disciple. Criswell Freeman examines the mysterious art of putting through the words of golf's greatest teachers and practitioners.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Walnut Grove",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Boards That Make a Difference: A New Design for Leadership in Nonprofit and Public Organizations (J-B Carver Board Governance Series)",
        "Authors": "By Carver, John",
        "Description": "\"This book should be in the library of everyone who serves--or aspires to serve--on the governing board of any organization, large or small, nonprofit or corporate. Better than any other available resource, it tells what the roles of board members are and what they must and shouldn't do. An indispensable guidebook to leadership excellence.\"--George Weber, secretary general, International Federation of Red Cross and Red Crescent Societies, Geneva\"John Carver's Boards That Make a Difference was required reading for board members of the Calgary Philharmonic Society. It provided a clear and concise road map with which we carried out significant governance restructuring of the society.\" James M. Stanford, president & CEO,, Petro-Canada, and past chairman of the Calgary Philharmonic Society, Calgary, Alberta, CanadaJohn Carver's groundbreaking Policy Governance model has influenced the way public and nonprofit boards operate around the world. Now, as widespread experience with the model continues to grow, Carver enriches his definitive exposition with updated policy samples, a new chapter on the process of policy development, and additional resources for various types of boards. He debunks the entrenched beliefs about board roles and functions that hamper dedicated board members. With creative insight and commonsense practicality, Carver presents a bold new approach to board job design, board-staff relationships, the chief executive role, performance monitoring, and virtually every aspect of the board-management relationship. In their stead, he offers a board model designed to produce policies that make a difference, missions that are clearly articulated, standards that are ethical and prudent, meetings, officers, and committees that work; and leadership that supports the fulfillment of long-term goals.",
        "Category": " Business & Economics , Nonprofit Organizations & Charities , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "The Giggler Treatment",
        "Authors": "By Doyle, Roddy and Ajhar, Brian (ILT)",
        "Description": "A talking dog, the Mack children, and the small elf-like Gigglers themselves must try to stop the prank that the Gigglers have mistakenly set in motion to punish Mr. Mack for being mean to his children.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Arthur A. Levine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "The Math Wiz (Puffin Chapters)",
        "Authors": "By Duffey, Betsy and Wilson, Janet (ILT)",
        "Description": "Does \"Math Wiz\" have to equal \"Sports Dud\"?Marty Malone thinks no problem is too complicated for him. Then he starts third grade--and learns that being a math wiz won't stop him from getting picked last in gym class. Kids like tom Ballan are so much better at sports that Marty will never be able to catch up. Trying harder doesn't work. Trying to get out of gym doesn't work. But what if Marty makes a friend in class? And what if that friend is a math wiz, too?",
        "Category": " Juvenile Fiction , Social Themes , Adolescence & Coming of Age",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Visitor from the Beyond (CYBER ZONE)",
        "Authors": "By Black, S. F.",
        "Description": "After Amanda and Jeff move to the country, they expect to keep in touch with their old friends through the Internet, but every time they try to contact their friends, a strange presence who seems to live in their house takes over the computer",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Paddington at Large",
        "Authors": "By Bond, Michael",
        "Description": "Trouble begins for the Browns when Paddington, the English bear, becomes overly enthusiastic about his flower and vegetable garden",
        "Category": " Juvenile Fiction , Animals , Bears",
        "Publisher": "Yearling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1970"
        }
    },
    {
        "Title": "Is There a Cow in Moscow?: More Beastly Mispronunciations and Sound Advice : Another Opinionated Guide for the Well-Spoken",
        "Authors": "By Elster, Charles Harrington",
        "Description": "A sequel to  There is no zoo in zoology . The author has selected 475 commonly mispronounced words and written short essays on how each word is spoken and mis-spoken. Includes many of this reader's favorites, among them,  chimera  (pronounced  ky-MEER-uh,  not  SHIM-er-uh ). Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Collier Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "A Different Beat",
        "Authors": "By Boyd, Candy Dawson",
        "Description": "Jessie soon discovers the difficulties of studying acting at Oakland Performing Arts Middle School, as she copes with a full schedule, the need to keep up her grades, a prejudiced teacher, and an eloquent rival. By the author of Chevrolet Saturdays. Original.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Camy Baker's How to Be Popular in the Sixth Grade (Camy Baker's Series)",
        "Authors": "By Baker, Camy",
        "Description": "In a lighthearted, lively guide to charisma, a fictional twelve-year-old girl presents thirty ways to become popular based on being oneself and being good to others, explained in detail and accompanied by examples from her own life. Reprint.",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Skylark",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Zapp! Empowerment in Health Care: How to Improve Patient Care, Increase Employee Job Satisfaction, and Lower Health Care Costs",
        "Authors": "By Byham, William C.",
        "Description": "\"Couldn't have come at a better time! The message is definitely on target. People who work with staff and volunteers in any profession would gain from reading, re-reading, and practicing the concepts in this book.\"John PaulVice President, American Heart AssociationWilliam C. Byham's book, ZAPP! THE LIGHTNING OF EMPOWERMENT took the business world by storm. Now ZAPP! EMPOWERMENT IN HEALTH CARE is packed with step-by-step, hands-on information to help health-care providers revitalize medicine and help control costs by taking control of their jobs, improving existing processes, sharing decision-making, and more, as well as zeroing in on the special needs, rights, and responsibilities of patients.",
        "Category": " Medical , Administration",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Zeely.",
        "Authors": "By Virginia Hamilton",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill Book Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Shoeless Joe & Me (Baseball Card Adventures)",
        "Authors": "By Gutman, Dan",
        "Description": "When Joe Stoshack hears about Shoeless Joe Jackson -- and the gambling scandal that destroyed the star player's career -- he knows what he has to do. If he travels back in time with a 1919 baseball card in his hand, he just might be able to prevent the infamous Black Sox Scandal from ever taking place. And if he could do that, Shoeless Joe Jackson would finally take his rightful place in the Baseball Hall of Fame.But can Stosh prevent that tempting envelope full of money from making its way to Shoeless Joe's hotel room before the big game?",
        "Category": " Juvenile Fiction , Sports & Recreation , Baseball & Softball",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "The Christian calendar: A complete guide to the seasons of the Christian year telling the story of Christ and the saints, from Advent to Pentecost",
        "Authors": "By Cowie, Leonard W.",
        "Description": "",
        "Category": "",
        "Publisher": "G. & C. Merriam Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Getting Ready to Negotiate: The Getting to Yes Workbook (Penguin Business)",
        "Authors": "By Fisher, Roger and Ertel, Danny",
        "Description": "This companion volume to the negotiation classic Getting to Yes explores the negotiation process in depth and presents case studies, charts, and worksheets for blueprinting and personalized negotiating strategy.",
        "Category": " Business & Economics , Motivational",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Heart of Conflict",
        "Authors": "By Muldoon, Brian",
        "Description": "Offers a practical method to move through the stages of conflict common to all human situations, from business to the bedroom, and resolve it, through the use of four strategies--containment, confrontation, compassion, and collaboration",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Perigee Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Corporate Finance (Irwin/Mcgraw-Hill Series in Finance, Insurance, and Real Estate)",
        "Authors": "By Ross, Stephen A., Westerfield, Randolph, and Jaffe, Jeffrey",
        "Description": "",
        "Category": " Business & Economics , Corporate Finance",
        "Publisher": "Richard D Irwin",
        "Price Starting With ($)": "7.77",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "Introduction to Financial Management",
        "Authors": "By Brigham, Eugene F., Campsey, B J, and Dickerson, Bodil",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Harcourt College Pub",
        "Price Starting With ($)": "8.48",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "A Summer of Horses (Bullseye Books)",
        "Authors": "By Fenner, Carol",
        "Description": "Looking forward to a summer on the horse farm, ten-year-old Faith fears it will be a long vacation when she discovers that she is afraid of horses and that her sister is a talented rider",
        "Category": " Young Adult Fiction , Animals , Horses",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Fund Financ Mangmnt Blueprints",
        "Authors": "By Brigham",
        "Description": "",
        "Category": "",
        "Publisher": "South-Western, Div of Thomson Learning",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Writing Literature Reviews: A Guide for Students of the Social and Behavioral Sciences",
        "Authors": "By Galvan, Jose L.",
        "Description": "• Guides students in the preparation of literature reviews for term projects, theses, and dissertations.• Most chapters are conveniently divided into easy-to-follow guidelines, sequential steps, or checklists. Numerous examples throughout the book show students what should and should not be done when writing reviews.• Emphasizes critical analysis of reports of empirical research in academic journals—making it ideal as a supplement for research methods courses. This book makes it possible for students to work independently on a critical literature review as a term project.• Nine model literature reviews at the end of the book provide the stimulus for homework assignments and classroom discussions.• The activities at the end of each chapter keep students moving toward their goal of writing a polished, professional review of academic literature.• Most examples include material from recently published research. Includes nine model literature reviews for discussion and evaluation. Table of ContentsChapters1 Writing Reviews of Academic Literature: An Overview2 Considerations in Writing Reviews for Specific Purposes 3 Selecting a Topic and Identifying Literature for Review4 General Guidelines for Analyzing Literature5 Analyzing Quantitative Research Literature6 Analyzing Qualitative Research Literature7 Building Tables to Summarize Literature8 Synthesizing Literature Prior to Writing a Review9 Guidelines for Writing a First Draft 10 Guidelines for Developing a Coherent Essay11 Guidelines on Style, Mechanics, and Language Usage12 Incorporating Feedback and Refining the First Draft13 Preparing a Reference List 14 Comprehensive Self-Editing Checklist for Refining the Final DraftModel Literature Reviews for Discussion and EvaluationReview A: Cyberbullying Among College Students Journal of School ViolenceReview B: Waterpipe Smoking Among College Students in the United StatesJournal of American College HealthReview C: The Effect of Student Discussion Frequency on Mathematics Achievement The Journal of Experimental EducationReview D: Behaviors in Couples With a History of Infidelity Journal of Family PsychologyReview E: The Prevalence of Stalking Among College Students Journal of American College Health Review F: School Social Workers’ Experiences With Youth Suicidal BehaviorChildren & Schools Review G: Demographic and Academic Trends in Drinking Patterns and Alcohol-Related ProblemsJournal of Alcohol and Drug EducationReview H: Overnight Stays and Children’s Relationships With Resident and Nonresident Parents After DivorceJournal of Family IssuesReview I: Language Brokering: An Integrative Review of the Literature Hispanic Journal of Behavioral Sciences Professor Reviews“Students have found Writing \"Literature reviews one of the most helpful books.... Even students not in the course have gone to the bookstore looking for this book.”— Kathleen N. Bondy, University of Central Arkansas“Lucid, readable, and concise. Excellent detailed table of contents. Good full-length examples of literature reviews.”— Paul K. Dezendorf, East Carolina University“Excellent. A concise, ‘task analytic’ presentation of the complex steps necessary in writing literature reviews.”— Tom Cooke, Sonoma State University“Readable, concise, clear overview of the subject. My students rave about it. One said, ‘I will keep this book for my whole master’s [in nursing] program.'\"— Madge M. D",
        "Category": " Language Arts & Disciplines , Writing , General",
        "Publisher": "Routledge",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Heads or Tails (Jack Henry)",
        "Authors": "By Gantos, Jack",
        "Description": "From the Newbery Medal–winning author of Dead End in Norvelt, eight more hysterical semi-autobiographical Jack Henry stories about a sixth grader's trials and tribulationsJack's life is a crazy roller-coaster ride. At his fifth school in six years, he has a crackpot teacher who won't give him a break about his lousy handwriting and a secret crush who wants to be a policewoman. At home, he has a pesky little brother with a knack for getting hurt whenever Jack's supposed to be looking after him, a terror for an older sister, all sorts of weird neighbors, and, last but not least, ferocious alligators in the canal behind his house.Writing in his diary about his good days and bad days is one way Jack survives his up-and-down year. But he's also a kid who knows that life can go any which way at any given moment. A Common Core title.",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Square Fish",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Harcourt School Publishers Collections: Chapter Book Grade 5 Tarantula In/Purse",
        "Authors": "By Hb (COR)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "Houghton Mifflin School",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Back to the Day Lincoln Was Shot! (Travelers Through Time)",
        "Authors": "By Gormley, Beatrice",
        "Description": "When their grandfather invents a time machine, Matt and Emily, accompanied by their scientific genius friend Jonathan, journey back to the night when President Lincoln was shot in the hopes of preventing the assassination. Original.",
        "Category": "",
        "Publisher": "Apple",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1995"
        }
    },
    {
        "Title": "God's Leading Lady: Out of the Shadows and into the Light",
        "Authors": "By Jakes, T. D.",
        "Description": "Bishop T. D. Jakes, the #1 bestselling author of The Lady, Her Lover, and Her Lord and Soar!, offers women a plan for taking charge of their lives.Providing the inspiration and the tools women need to face life’s challenges, Bishop Jakes teaches women to star in the unique role God has chosen for them to play in the world. With a foundation of Christian values and faith in God’s plan, this book encourages women to: • Triumph in the face of adversity • Recognize the Lord’s calling • Create a godly and successful legacy—that will inspire and influence generations to come",
        "Category": " Religion , Inspirational",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Helping Your Chemically Dependent Teenager Recover: A Guide for Parents and Other Concerned Adults",
        "Authors": "By Cohen, Peter R.",
        "Description": "Helping Your Chemically Dependent Teenager Recover is written for the parent whose child has serious problems with alcohol or other drugs. It recognizes that both teenager and parent need to recover from the disease of chemical dependence. This book encourages readers to educate themselves about recovery, work hard and take new risks, and experience being successful as parents. Helping a teenager recover from chemical dependence is one of the most loving things a parent can do. This book provides a step-by-step guide on how to do it. Helping Your Chemically Dependent Teenager Recover Describes teenage recovery as a slow but steady process of growth and change unique to the developing adolescent. Outlines four stages of recovery: crisis control, stability and structure, consistency and balance, and attachment. Details problems faced by both teens and parents at each recovery stage. Explains tasks to accomplish that lead teens and parents through each recovery stage.Empowers parents to help their teenager recover and to find personal relief from the pain of their child's chemical dependence. Parents seeking clear information about their teenager's chemical dependence, its effects, and the recovery process will find this book an informative and invaluable guide.",
        "Category": " Family & Relationships , Life Stages , Teenagers",
        "Publisher": "Hazelden",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The Trolls",
        "Authors": "By Horvath, Polly",
        "Description": "Aunt Sally is beyond any of Melissa, Amanda, and Pee Wee's expectations. She has come all the way from Vancouver Island, Canada, to take care of the children while their parents are away, and right from the start Aunt Sally enchants them with tales of her childhood with their father. Odd characters figure largely in the stories, like Maud, a hunter rumored to have killed eighty cougars; Great-uncle Louis, a health nut who insists everyone should gnaw on sticks for extra fiber; and Fat Little Mean Girl, the star of a cautionary tale involving witchcraft and candy. All of Aunt Sally's reminiscences lead up to a crucial story about trolls, sinister creatures who supposedly lurked along the shore at night. The trolls had the power to change Aunt Sally's life forever, and their legacy may change the lives of the three present-day children as well.  Aunt Sally is beyond any of Melissa, Amanda, and Pee Wee's expectations. She has come all the way from Vancouver Island, Canada, to take care of the children while their parents are away, and right from the start Aunt Sally enchants them with tales of her childhood with their father. Odd characters figure largely in the stories, like Maud, a hunter rumored to have killed eighty cougars; Great-uncle Louis, a health nut who insists everyone should gnaw on sticks for extra fiber; and Fat Little Mean Girl, the star of a cautionary tale involving witchcraft and candy. All of Aunt Sally's reminiscences lead up to a crucial story about trolls, sinister creatures who supposedly lurked along the shore at night. The trolls had the power to change Aunt Sally's life forever, and their legacy may change the lives of the three present-day children as well.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , General",
        "Publisher": "Farrar, Straus and Giroux (BYR)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "BACKUP GOALIE (Angel Park Soccer Stars)",
        "Authors": "By Hughes, Dean and Lyall, Dennis (ILT)",
        "Description": "When goalie Nate Matheson is injured, Jared Trajillo must learn to play the position of goalie, just before the championship game. Simultaneous.",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1992"
        }
    },
    {
        "Title": "My Mercedes is Not for Sale: From Amsterdam to Ouagadougou...An Auto-Misadventure Across the Sahara",
        "Authors": "By Van Bergeijk, Jeroen and Antonides, John (TRN)",
        "Description": "“Oh Lord, won’t you buy me a Mercedes Benz?”—Janis JoplinA journalist’s intrepid endeavor to sell his used car abroad results in a high-spirited and revealing look at West Africa.“Look, there’s my car,” I say, pointing at my Mercedes in the parking lot. “Where?” a fellow desert traveler asks.“There, that Mercedes,” I say.He looks at me, questioning. “You want to drive that through the Sahara?” Jeroen van Bergeijk came up with what seemed like a great scheme for making a quick profit: buy a clunker of a car in his native Amsterdam and resell it in the Third World, where a market even for jalopies still thrives. His chariot of choice is a rusted-out 1988 Mercedes 190D with 220,000 kilometers on its odometer; his route will take him from Holland through Morocco, across the Sahara, and into some of the least trodden parts of Africa. My Mercedes Is Not for Sale is a rollicking tale of an innocent abroad. The author finds himself facing a driving challenge akin to the Dakar Rally but encounters obstacles never dreamed of by race-car drivers: active minefields, occasional banditry—mostly by the border guards—and a teenage, chain-smoking desert guide with a fondness for Tupac lyrics. Food and water are scarce, sandstorms are frequent, and all he has to patch up his many car breakdowns thousands of miles from civilization is a bar of soap, some duct tape, and a pair of women’s nylons. Then there’s the coup he survived. My Mercedes Is Not for Sale captures more than the adventure—it vividly portrays the impact of globalization on Africa through a surprise-filled journey into its thriving car culture, while asking the question: is the white man’s burden really a used car?",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Broadway Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Samurai William: The Englishman Who Opened Japan",
        "Authors": "By Milton, Giles",
        "Description": "With all the adventure, derring-do, and bloodcurdling battle scenes of his earlier book, Nathaniel’s Nutmeg, acclaimed historian Giles Milton dazzles readers with the true story of William Adams—the first Englishman to set foot in Japan (and the inspiration for James Clavell’s bestselling novel Shogun). Beginning with Adams’s startling letter to the East India Company in 1611—more than a decade after he’d arrived in Japan—Samurai William chronicles the first foray by the West  into that mysterious closed-off land. Drawing upon the journals and letters of Adams as well as the other Englishmen who came looking for him, Samurai William presents a unique glimpse of Japan before it once again closed itself off from the world  for another two hundred years.",
        "Category": " History , Asia , Japan",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "The Light beyond the Forest: The Quest for the Holy Grail (Arthurian Trilogy)",
        "Authors": "By Sutcliff, Rosemary and Felts, Shirley (ILT)",
        "Description": "In the last days of Arthurian England, Lancelot, his son Galahad, and several other knights of the Round Table set out on a long and dangerous quest for the Holy Grail",
        "Category": " Young Adult Fiction , Historical , Medieval",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Anna Karenina (Barnes & Noble Classics)",
        "Authors": "By Tolstoy, Leo, Garnett, Constance Black, and Mandelker, Amy (INT)",
        "Description": "Anna Karenina, by Leo Tolstoy, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics:    New introductions commissioned from today&#39;s top writers and scholars    Biographies of the authors    Chronologies of contemporary historical, biographical, and cultural events    Footnotes and endnotes    Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work    Comments by other famous authors    Study questions to challenge the reader&#39;s viewpoints and expectations    Bibliographies for further reading    Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader&#39;s understanding of these enduring works. Vladimir Nabokov called Leo Tolstoy’s Anna Karenina “one of the greatest love stories in world literature.” Matthew Arnold claimed it was not so much a work of art as “a piece of life.” Set in imperial Russia, Anna Karenina is a rich and complex meditation on passionate love and disastrous infidelity. Married to a powerful government minister, Anna Karenina is a beautiful woman who falls deeply in love with a wealthy army officer, the elegant Count Vronsky. Desperate to find truth and meaning in her life, she rashly defies the conventions of Russian society and leaves her husband and son to live with her lover. Condemned and ostracized by her peers and prone to fits of jealousy that alienate Vronsky, Anna finds herself unable to escape an increasingly hopeless situation. Set against this tragic affair is the story of Konstantin Levin, a melancholy landowner whom Tolstoy based largely on himself. While Anna looks for happiness through love, Levin embarks on his own search for spiritual fulfillment through marriage, family, and hard work. Surrounding these two central plot threads are dozens of characters whom Tolstoy seamlessly weaves together, creating a breathtaking tapestry of nineteenth-century Russian society. From its famous opening sentence—“Happy families are all alike; every unhappy family is unhappy in its own way”—to its stunningly tragic conclusion, this enduring tale of marriage and adultery plumbs the very depths of the human soul.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Sterling Publishing",
        "Price Starting With ($)": "16.45",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Midnight Magic",
        "Authors": "By Gordon, Amy and Clifford, Judy (ILT)",
        "Description": "While Uncle Harry is babysitting his nephews for the weekend, the Tooth Fairy leaves a gold key meant for the Ogre in \"Puss in Boots\"",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "5.97",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Her Father's House: A Novel",
        "Authors": "By Plain, Belva",
        "Description": "Beloved storyteller Belva Plain understands the rich tapestry of the human heart like no other. Her many dazzling New York Times bestsellers probe the shifting bonds of marriage and family with insight, compassion, and uncommon grace. And her new novel is no exception. A tale of fathers and daughters, lovers and families, acts of love and acts of betrayal, Her Father’s House is Belva Plain’s most powerful and unforgettable novel yet.It is the spring of 1968 when Donald Wolfe, a young graduate of a midwestern law school, arrives in New York. Filled with ambition and idealism, he is dazzled not only by the big city but by the vivacious, restless Lillian, whom he marries in the heat of infatuation. Surely theirs is no marriage made in heaven, but they have a child, Tina, and she is the love of Donald’s heart. For her he would give up everything--his home, his distinguished career, and his freedom. When his flawed marriage begins to fail, a choice must be made. Shall he consider a step that would force him into flight and a life of hiding?From her earliest years, Tina is exceptional, a brilliant student and a joyous, loving spirit. At the university she falls in love with Gilbert, who graduates from law school just as she is about to enter medical school. Together they go to New York, where she learns the truth about her family’s past, a truth that must change her regard for the father who has protected and cherished her. When a terrible lie has been told out of love, can it be forgiven?With courage and compassion, Belva Plain paints a moving portrait of the choices that shape the course of our lives, the secrets that haunt us, and the love that helps us heal and move on. It is a work of riveting storytelling and rare emotional power by one of the most gifted novelists of our time.",
        "Category": " Fiction , Women",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "The Logic Of American Politics",
        "Authors": "By Kernell, Samuel and Jacobson, Gary C.",
        "Description": "The authors (of the U. of California at San Diego) of this introductory textbook on American politics emphasize the centrality of institutions in enabling and constraining collective decision making in the United States. They first offer chapters on what they see as the foundational elements of American national politics, the Constitution, federalism, civil rights, and civil liberties, explaining their development over time. They then examine Congress, the presidency, the bureaucracy, and the federal judiciary, discussing how the politics and logic of their development shaped their organizational features, practices, and relations with one another. Next come chapters examining the historical development, political logic, and present-day operations and activities of the institutions that link citizens with government officials, covering public opinion; voting, campaigns, and elections; political parties; interest groups; and the news media. A final chapter explores the dilemmas of institutional reform. Annotation ©2005 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , Political Process , Campaigns & Elections",
        "Publisher": "Cq Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "MacArthur's Undercover War: Spies, Saboteurs, Guerrillas, and Secret Missions",
        "Authors": "By Breuer, William B. and MacArthur, Douglas",
        "Description": "Guadalcanal . . . Midway . . . the battle for the Philippines. In each of these critical conflicts, intelligence played a crucial role in bringing about an Allied victory. General MacArthur's brilliant Pacific campaign was designed around espionage and guerrilla warfare. This is the story of his undercover war Praise for William B. Breuer's Previous Works.. \"An exciting narrative presented by a first-rate story teller.\" —Publishers Weekly on The Great Raid on Cabanatua  \"A first-class historian.\" —The Wall Street Journa \"Another smasher by Breuer, who specializes in thrilling reports of WWII spycraft and warfare.\" —Kirkus Reviews on Race to the Moo \"Fast-paced, detailed, and satisfyingly dramatic.\" —World War II magazine on Devil Boat \"Vivid . . . skillfully written.\" —Los Angeles Times on Retaking the Philippine \"Brings to life how airborne soldiers survived, how the human will prevails . . . against overwhelming enemies, tactical failures, and even death.\" —The New York Times on Geronimo: American Paratroopers in World War I MACARTHUR'S UNDERCOVER WA The covert war General Douglas MacArthur waged against Japanese forces in the Pacific arena was the largest undercover operation ever undertaken. Here, for the first time, is the complete story of the legendary exploits and heroism of the thousands of courageous individuals who fought as spies, guerrillas, propagandists, and saboteurs behind enemy lines When the Japanese war juggernaut overran the Philippines, it took a near miraculous PT-boat escape for MacArthur to make his way to safety in Australia. He left behind a force of seventy thousand American and Philippine troops marooned on the Bataan Peninsula. To these brave men the general vowed, \"I shall return. Against overwhelming odds, MacArthur succeeded. Crucial to his success was his massive covert war effort. MacArthur created his own undercover warfare agency, the super-secret Allied Intelligence Bureau (AIB), to organize the many far-flung resistance groups. They were the coast watchers—jungle-wise miners, traders and planters, missionaries, and telegraph operators who occupied remote Pacific islands, living in the most primitive conditions while keeping a constant vigil for Japanese movement. They were American soldiers who escaped the Bataan Peninsula and were commanding guerrilla armies in the interior mountain and jungle locations of the Philippines. And they were double agents operating right under the noses of the Japanese in Manila, occupying positions close to the Imperial Army and in the collaborationist Philippine government The phenomenal success of MacArthur's island-hopping \"hit-'em-where-they-ain't\" campaign was built on the accuracy of the intelligence gathered by the AIB. Early in the conflict, the Americans cracked the secret Japanese naval code and established a chain of intelligence radio-monitoring posts circling the Japanese empire from Alaska to Australia. The information garnered from their interceptions of Japanese transmissions and from operatives on the ground allowed MacArthur to pick soft targets—islands the Japanese had left relatively unguarded—for invasion. It was the steel nerves and unbounded resourcefulness of those who fought the secret war that paved the way for MacArthur's \"Great Return\" to the Philippines and saved the lives of countless American soldiers In an action-packed narrative, MacArthur's Undercover War tells of thrilling feats of valor and derring-do—impossible missions to blow up harbors, kidnap heads of state, undermine currency, and arrange prison escapes, all deep within enemy territory. Firsthand interviews with veterans and information from previously unpublished documents reveal a riveting tale of World War II that has never been fully told",
        "Category": " History , Military , World War II",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.61",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "The Luckiest Girl (Young Love)",
        "Authors": "By Cleary, Beverly",
        "Description": "A young girl leaves her home and friends in Oregon to spend her exciting senior year in a California high school.A young girl leaves her home and friends in Oregon to spend her exciting senior year in a California high school",
        "Category": "",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1980"
        }
    },
    {
        "Title": "Writers Complete Crime Reference Book",
        "Authors": "By Martin Roth",
        "Description": "A handbook for writers of detective fiction covers details on police and FBI procedures and the courtroom process",
        "Category": "",
        "Publisher": "Writer's Digest Books",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Road to Wealth: A Comprehensive Guide to Your Money",
        "Authors": "By Orman, Suze",
        "Description": "Suze Orman's #1 bestsellers The 9 Steps to Financial Freedom and The Courage to Be Rich changed the way people think about their money, helping them overcome their emotional roadblocks to financial freedom.  Now, Suze delivers a fully accessible and authoritative resource, loaded with information critical to every stage of readers' financial lives. The Road to Wealth provides readers with practical answers to all the questions they might-or should-have about their financial futures. Sound, straightforward, fiercely honest, and easy-to-understand, Suze's advice gives them the knowledge and power to:  ? Create a strong, debt-free foundation ? Amass assets and protect them through economic downturns ? Buy a home to provide for loved ones ? Invest with confidence and navigate the market in good times and bad ? Secure reliable income for their later lives",
        "Category": " Business & Economics , Personal Finance , General",
        "Publisher": "Riverhead Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "England in the Nineteenth Century (1815-1914) [Volume 8 of The Pelican History of England]",
        "Authors": "By Thomson, David",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1951"
        }
    },
    {
        "Title": "A Girl Named Disaster",
        "Authors": "By Farmer, Nancy",
        "Description": "Orchard Classics is a collectible hardcover line of Newbery award-winning titles from the Orchard backlist that have fresh, beautiful new designs and include author prefaces and discussion guides.A GIRL NAMED DISASTER is the humorous and heartwrenching story of young girl who discovers her own courage and strength when she makes the dangerous journey from Mozambique to Zimbabwe. Nhamo is a Shona girl living in a traditional village in Mozambique in 1981. When her family tries to force her into a marriage with a cruel man, she flees. What was supposed to have been a short boat trip across the border into Zimbabwe, where she hoped to find her father, turns into an adventure filled with challenges and danger that lasts a year.",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Orchard Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Mr. Capone: The Real - and Complete - Story of Al Capone",
        "Authors": "By Schoenberg, Robert J.",
        "Description": "All I ever did was to sell beer and whiskey to our best people. All I ever did was to supply a demand that was pretty popular.    Why, the very guys that make my trade good are the ones that yell the loudest about me. Some of the leading judges use the stuff.    When I sell liquor, it's called bootlegging. When my patrons serve it on silver trays on Lake Shore Drive, it's called hospitality.-- Al Capone",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "Creating from the Spirit: A Path to Creative Power in Art and Life",
        "Authors": "By Wakefield, Dan",
        "Description": "Analyzes the traditional myths associated with creative inspirations and uses twenty real-life examples to explain how to unlock natural perceptions and inner creative resources. Reprint. Tour.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "One World/Ballantine",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "False Pretenses (Contemporary Romantic Thriller)",
        "Authors": "By Coulter, Catherine",
        "Description": "#1 New York Times bestselling author Catherine Coulter’s first contemporary suspense novel: the explosive story of how one woman survives the destruction of her perfect life—and the dubious intentions of three mysterious men...A famous concert pianist married to a wealthy international business tycoon, Elizabeth Carleton is the envy of all—until the night her husband is stabbed in the chest with an ice pick and everything falls apart.Accused of murder, Elizabeth has little hope of being exonerated until a surprise witness appears to give her an airtight alibi. The jury finds her not guilty. The only thing is: She’s never met the man who testified on her behalf. Free and completely bewildered, Elizabeth must now cope with the financial empire her husband left behind and his family, who want to destroy her. Then three men suddenly appear in her life. Can she trust any of them? Or is one of them a murderer?",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Riptide (An FBI Thriller)",
        "Authors": "By Coulter, Catherine",
        "Description": "Agents Dillon Savich and Lacey Sherlock must protect the life of a young political speechwriter in this New York Times bestseller in Catherine Coulter’s FBI Thriller series.A senior speechwriter for the governor of New York, Becca Matlock is at the top of her professional game when she receives a disturbing phone call that threatens everything: “Stop sleeping with the governor or I’ll kill him.” The thing is, she’s not sleeping with her boss, but that fact doesn’t stop the calls from the man who refers to himself as her “boyfriend.” When her stalker murders an innocent in New York City and the governor is shot in the neck, Becca comes under suspicion and takes off for the sanctuary of Riptide, an isolated community on the coast of Maine. But she soon finds herself at even greater risk...FBI special agents Savich and Sherlock are in Riptide to help out an old friend of Savich’s father, and soon become embroiled in Becca’s deadly situation. But as enemies new and old circle closer, time is running out for them all.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "129.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2001"
        }
    },
    {
        "Title": "Sudden Death: A Novel of Suspense (FBI Trilogy)",
        "Authors": "By Brennan, Allison",
        "Description": "Fast, furious and fatal . . . a pair of killers seek brutal revenge. When a homeless veteran is found dead in a squalid Sacramento alley,  FBI special agent Megan Elliott vows to find the murdered hero’s killer. Her investigation  gets complicated fast, for the victim, a former Delta Force soldier, is just one  link in a nationwide spree of torture and murder. Straight off a job rescuing medical  missionaries, soldier-for-hire Jack Kincaid returns to his home base in the Texas  border town of Hidalgo only to receive the news that one of his closest colleagues–also  ex-military–has been brutally murdered. Faced with an inept local police force, Jack  takes matters into his own hands. Now, as part of a national task force to stop  the sadistic killings, by-the-book Megan and burn-the-book Jack form a tense alliance,  sparked with conflict and temptation. But they struggle against more than passion,  for a vicious pair of killers has only just begun a rampage of evil . . . and the  primary target is much closer than Megan suspects.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2009"
        }
    },
    {
        "Title": "Language and Responsibility: Based on Conversations With Mitson Ronat",
        "Authors": "By Chomsky, Noam",
        "Description": "The distinguished linguist and controversial political critic combines both aspects of his life and work in this wide-ranging and informative discussion that presents his political, moral, and linguistic views on current issues",
        "Category": "",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Emma Hamilton",
        "Authors": "By Lofts, Norah",
        "Description": "",
        "Category": "",
        "Publisher": "Coward, McCann & Geoghegan",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "HOW THE SUN WAS BROUGHT BACK TO THE SKY Adapted From A Slovenian Folk Tale",
        "Authors": "By Ginsburg, Mirra",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan Publishing Co., Inc, New York",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "Work as a Spiritual Practice",
        "Authors": "By Richmond, Lewis",
        "Description": "An executive and ordained Zen priest draws on Buddhist ideas, real-life examples, and simple physical exercises to help overburdened readers find more fulfillment at work, set a sensible pace, and achieve spiritual wholeness. Tour.",
        "Category": " Religion , Buddhism , General",
        "Publisher": "Broadway",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Up Close and Dangerous: A Novel",
        "Authors": "By Howard, Linda",
        "Description": "A mysterious plane crash . . . a dangerous trek through the Idaho wilderness . . . a smoldering attraction . . . and a deadly game of cat and mouse. In her latest tour de force of romantic suspense, New York Times bestselling author Linda Howard blends these elements into a gripping story that will keep readers breathless–and leave them begging for more. For in Linda Howard’s world, trust can be a weapon, a kiss can be a threat, and intimacy can be deadly.Bailey Wingate’s scheming adult stepchildren are surprised when their father’s will leaves Bailey in control of their fortune, and war ensues. A year later, while flying from Seattle to Denver in a small plane, Bailey nearly dies herself when the engine sputters–and then fails.Cam Justice, her sexy Texan pilot, manages to crash-land the aircraft. Stranded in the wilderness, and struggling to douse her feelings for the ruggedly handsome man by her side, Bailey begins to wonder whether this was a mere accident. Who tampered with their plane? Who’s trying to reunite Bailey and her husband in the afterlife? Cut off from the world, and with little hope of rescue, Bailey must trust her life–and heart–to Cam, as they battle the harsh elements to find a way out of the unforgiving wilds and back to civilization . . . where a killer may be waiting to finish the job.Sexy, suspenseful, and lightning fast, Up Close and Dangerous showcases a beloved author at her dazzling best.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Confronting Crime",
        "Authors": "By Currie, Elliott",
        "Description": "Probes the social, political, and economic factors behind America's crime problem, challenges conservative views of permissiveness and judicial weakness, and calls for a new approach to solving the crime crisis",
        "Category": " Social Science , General",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Class Warfare: Interviews with David Barsamian",
        "Authors": "By Chomsky, Noam and Barsamian, David",
        "Description": "This collection of interviews offers Chomsky's views on himself and on such political issues as deficit spending, how free markets destroy competition, and why \"family values\" crusades destroy family life",
        "Category": " Political Science , Security (National & International)",
        "Publisher": "Common Courage Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "Passages: Predictable Crises of Adult Life",
        "Authors": "By Sheehy, Gail",
        "Description": "Identifies patterns of age-related change and compares the developmental rhythms of men and women, deepening understanding of the stresses experienced by couples during the various stages of adult life",
        "Category": "",
        "Publisher": "Bantam Doubleday Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Hanna's Daughters",
        "Authors": "By Marianne Fredriksson",
        "Description": "",
        "Category": "",
        "Publisher": "Orion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "The Fire Fighters' Counting Book(A Little Golden Book)",
        "Authors": "By Polly Curren",
        "Description": "",
        "Category": "",
        "Publisher": "Western Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1983"
        }
    },
    {
        "Title": "Black Orchid",
        "Authors": "By Harper, Karen",
        "Description": "Black Orchid by Karen Harper released on Apr 25, 2006 is available now for purchase.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Evening in Byzantium",
        "Authors": "By Shaw, Irwin",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1974"
        }
    },
    {
        "Title": "The Immigrants",
        "Authors": "By Fast, Howard",
        "Description": "A multigeneration saga of California focuses on the life of Dan Lavette who, born in a railroad worker's boxcar, becomes a self-made shipping tycoon",
        "Category": " Fiction , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "German exile literature in America, 1933-1950. A history of the free German press and book trade",
        "Authors": "By Cazden, Robert E",
        "Description": "",
        "Category": "",
        "Publisher": "American Library Association",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Ghost Recon (Tom Clancy's Ghost Recon, Book 1)",
        "Authors": "By Michaels, David",
        "Description": "The U.S. Army&apos;s Special Forces are known for their highly specialized training and courage behind enemy lines. But there&apos;s a group that&apos;s even more stealthy and deadly. It&apos;s comprised of the most feared operators on the face of the earth&apos;the soldiers of Ghost Recon.",
        "Category": " Fiction , War & Military",
        "Publisher": "Berkley Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Arthurian Romances (Everyman's library ; no. 1698)",
        "Authors": "By Chretien, de Troyes",
        "Description": "",
        "Category": "",
        "Publisher": "DENT: DUTTON",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "February",
            "Year": "1975"
        }
    },
    {
        "Title": "The Courtship",
        "Authors": "By Coulter, Catherine",
        "Description": "The stunning Regency-era romance from #1 New York Times bestselling author Catherine Coulter.     Characters from two of Coulter’s most beloved novels in the Sherbrooke Bride series find each other in The Courtship. Helen Mayberry of Mad Jack has one passion: to track down a mystical treasure. That is, until she meets the thoroughly wicked Spenser Heatherington in a clash of the titans.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Every Woman's Marriage: Igniting the Joy and Passion You Both Desire (The Every Man Series)",
        "Authors": "By Ethridge, Shannon and Ethridge, Greg",
        "Description": "Set Your Husband’s Heart Ablaze Are you a “desperate housewife,” committed to marriage yet longing for a deeper, more intimate connection with your husband? Believe it or not, you can have the marriage you long for–if you’re willing to take desperate measures. If you’re ready to stop the blame game and pursue the marriage of your dreams, let authors Shannon and Greg Ethridge show you how to reignite your relationship with spiritual, emotional, and physical passion. Drawing on real-life stories from both men and women, as well as lessons from their own less-than-satisfying early years of marriage, they offer penetrating insights about what it takes to nurture a dynamic marriage, including…·what makes a husband’s heart grow cold–and how you can fan the embers into flame·the difference between being “right” and being “righteous”·how to fight fair·how to guard your heart against unhealthy comparisons·the dynamic power of getting spiritually and emotionally naked·what your husband really wants most (It’s not what you think!) Every Woman’s Marriage will give you practical tools and wise biblical counsel for transforming a listless marriage into a vibrant, exciting relationship. Get ready to set your husband’s heart ablaze!",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Waterbrook Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Getting Back Together: How To Reconcile With Your Partner - And Make It Last",
        "Authors": "By Youngs, Bettie B., Goetz, Masa, and Farbman, Suzy (FRW)",
        "Description": "You can save your relationship!The divorce courts are littered with broken marriages--and broken lives. Yet most people would save their marriages--if only they knew how.Getting back together is the solid, comprehensive guide you can count on to get your relationship back on track. No matter what issues you may face, this step-by-step program shows you how to take the initiative, reconcile your differences, and remake your relationship--from the ground up.In this completely revised edition, Drs. Young and Goetz provide the most current studies and relationship evaluation tools available. They also include numerous inspiring real-life stories of couples that have resurrected and renewed their relationships.Packed full of valuable information and comforting advice, Getting Back Together helps couples beat the odds and build a new, happier life together--forever.",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Bible Cure For Depression/Anxiety (Fitness and Health)",
        "Authors": "By Colbert, Don",
        "Description": "You can overcome depression and anxiety! As you take the positive steps outlined in this booklet, hope will replace depression, and the inner peace will overcome anxiety! Do You Suffer from depression or anxiety? In this concise, easy-to-read booklet you'll discover a wealth of usable information to help you break free from depression and anxiety! Learn biblical secrets on health and the latest medical research on how to win the war against depression and anxiety. This book contains findings that your doctor may have never told you!    the best antidepressant    the vital link between omega-3 fatty acids and brain activity    powerful foods that fight and win over depression    a joy-filled strategy of victory over depression using essential vitamins, minerals, and supplementsYou want to be healthy. God wants you to be healthy. Now at last here's a source of information that will help you get healthy-body, mind, and spirit.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Siloam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Love Is a Decision",
        "Authors": "By Smalley, Gary",
        "Description": "In this practical book, family counselor and best-selling author Gary Smalley, with John Trent, reveals a simple yet profound plan for a marriage of depth, warmth, and excitement.  Guide your marriage for a lifetime by learning how to make your spouse feel truly honored, keep courtship alive, rebuild trust, and become best friends with your family.  According to Smalley, good marriages are no accident.  And deciding to love-in the practical ways outlined here-can result in relationships that are tougher than tough times.",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "An Unladylike Offer",
        "Authors": "By Merrill, Christine",
        "Description": "Miss Esme Canville's brutal father is resolved to marryher off&#151;but she won't submit tamely to his decree. Instead, she'll offer herself to notorious rakeCaptain St. John Radwell and enjoy all the freedomof a mistress!St. John is intent on mending his rakish ways. He won'tseduce an innocent virgin. But Esme is determined,beautiful and very, very tempting&#133;.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Harlequin Historical",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Magnolia Moon (Callahan Brothers Trilogy)",
        "Authors": "By Ross, JoAnn",
        "Description": "JoAnn Ross's breathtaking novels have made her one of the most popular authors of contemporary romantic fiction. Here, set amid the sultry grandeur of Blue Bayou, is the eagerly awaited conclusion to her captivating Callahan Brothers trilogy.L.A. homicide detective Regan Hart's life is turned upside down with the discovery that she was adopted. Following a trail left in her birth mother's journal, she lands in Louisiana's Blue Bayou, where she's determined not to let Nate Callahan, the town's handsome, sweet-talking mayor, distract her from her search.Nate Callahan loves women -- and they've always loved him right back. No-nonsense Regan couldn't be more different from his usual type, but as they spend time together, unlocking the puzzles of Regan's past, neither can deny the attraction sizzling between them -- and both come to realize that family bonds are forged not through blood ties, but through choices of the heart.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Murder at the Opera (Capital Crimes, No. 22)",
        "Authors": "By Truman, Margaret",
        "Description": "Margaret Truman, who knows where all the bodies are buried inside the Beltway, has written her most thrilling novel of suspense yet. Murder at the Opera features the popular crime-fighting couple Mac Smith and his wife, Annabel Reed-Smith, as they navigate the glitz, glamour, and grime that is Washington, D.C.It ain’t over till the fat lady sings . . . but the show hasn’t even started yet when a diva is found dead. The soprano in question, a petite young Asian Canadian named Charise Lee, was scarcely a star at the Washington National Opera. But when the aspiring singer is stabbed in the heart backstage during rehearsals, she suddenly takes center stage.Georgetown law professor Mac Smith thought he’d just be carrying a rapier in Tosca as a favor for his beloved Annabel, but now they’re both being pressured by the panicked theater board to unmask a killer. Providing accompaniment will be former homicide detective, current P.I., and eternal opera fan Raymond Pawkins.Soon the Smiths find themselves dangerously improvising among an expanding cast of suspects with all sorts of scores to settle. What they uncover is an increasingly complex case reaching far beyond Washington to a dark world of informers and terror alerts in Iraq, and climaxing on a fateful night at the opera attended by none other than the President himself.From the Hardcover edition.",
        "Category": " Fiction , Political",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Change of Heart: A Novel (Wsp Readers Club)",
        "Authors": "By Picoult, Jodi",
        "Description": "The acclaimed #1 New York Times bestselling author presents a spellbinding tale of a mother's tragic loss and one man's last chance at gaining salvation.Can we save ourselves, or do we rely on others to do it? Is what we believe always the truth? One moment June Nealon was happily looking forward to years full of laughter and adventure with her family, and the next, she was staring into a future that was as empty as her heart. Now her life is a waiting game. Waiting for time to heal her wounds, waiting for justice. In short, waiting for a miracle to happen. For Shay Bourne, life holds no more surprises. The world has given him nothing, and he has nothing to offer the world. In a heartbeat, though, something happens that changes everything for him. Now, he has one last chance for salvation, and it lies with June's eleven-year-old daughter, Claire. But between Shay and Claire stretches an ocean of bitter regrets, past crimes, and the rage of a mother who has lost her child. Would you give up your vengeance against someone you hate if it meant saving someone you love? Would you want your dreams to come true if it meant granting your enemy's dying wish? Once again, Jodi Picoult mesmerizes and enthralls readers with this story of redemption, justice, and love.",
        "Category": " Fiction , Family Life , General",
        "Publisher": "Washington Square Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "Close Enough To Kill",
        "Authors": "By Barton, Beverly",
        "Description": "Determined to prove herself to her new partner, Sheriff Bernie Granger takes on the case of a serial killer who romances his victims then brutally murders them, trapping Bernie in a deadly game with a brilliant psychopath who can read her mind--and his next move is all too personal. Original.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "The Penwyth Curse (Song Novels)",
        "Authors": "By Coulter, Catherine",
        "Description": "Blending beloved characters from Earth Song and Rosehaven with brand new heroes and heroines, an enchanting historical romance follows a young woman, who at the tender age of eighteen is four times a widow, as she tries to break the dreadful curse that plagues her. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Devil's Waltz",
        "Authors": "By Kellerman, Jonathan",
        "Description": "The doctors call it Munchausen by proxy, the  terrifying disease that causes parents to induce  illness in their own children. Now, in his most  frightening case, Dr. Alex Delaware may have to prove  that a child's own mother or father is making her  sick. Twenty-one-month-old Cassie Jones  is bright, energetic, the picture of health. Yet  her parents rush her to the emergency room night  after night with medical symptoms no doctor can  explain. Cassie's parents seem sympathetic and  deeply concerned. Her favorite nurse is a model of  devotion. Yet when child psychologist Alex  Delaware is called in to investigate, instinct tells him  that one of them may be a monster. Then  a physician at the hospital is brutally murdered.  A shadowy death is revealed. And Alex and his  friend LAPD detective Milo Sturgis have only hours  to uncover the link between these shocking events  and the fate of an innocent child.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "River Thunder",
        "Authors": "By Hobbs, Will",
        "Description": "Jessie, Troy, and the rest of the crew from Downriver have returned to the Grand Canyon for adventure down the Colorado River. In the year since they last were together, each has changed; each feels more mature. But how will they interact now that they are facing new challenges--challenges greater than anything they've had to deal with at home?For Troy, it is a chance to prove he can be a team player, someone worthy of friendship and love. For Jessie, the river is the ultimate test. Does she have what it takes to row down the mighty Colorado? The only way to find out is to get into the raft and set off to face the thundering rapids and the powerful emotions that the river unleashes.",
        "Category": " Young Adult Fiction , Action & Adventure , General",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "The Tender Stranger",
        "Authors": "By Davidson, Carolyn",
        "Description": "",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Harlequin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Billy Graham: The Great Evangelist (Heroes of the Faith)",
        "Authors": "By Wellman, Sam",
        "Description": "Presents the life and times of the evangelist whose message of hope and love has brought him world-wide following and fame.",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "The Maid of the White Hands (Tristan and Isolde Novels, Book 2)",
        "Authors": "By Miles, Rosalind",
        "Description": "Isolde’s day has come. In Ireland her mother, the Queen, lies dying. The throne of the Emerald Isle, one of the last strongholds of the Goddess, awaits her. But while Ireland is her destiny, Isolde is already Queen of Cornwall, trapped in a loveless marriage to the mean-spirited King Mark. Her true love is his nephew, Tristan of Lyonesse, who has never married, remaining faithful to Isolde.Across the sea in France, a young princess who shares Isolde’s name enters the story. King Hoel named his daughter in honor of Isolde of Ireland, but young Isolde of France has always been determined to outdo Queen Isolde. She, too, is a physician and is called “Blanche Mains,” for her white hands and healing touch. Blanche is of an age to be married, and she has chosen her husband—Tristan of Lyonesse. Her father objects, but fate favors Blanche. King Mark has become suspicious of his wife and nephew, and when Tristan is wounded in battle, he sees a chance to separate them for good. Mark sends Tristan to France to be healed by Blanche, who makes the most of the opportunity. Tristan’s letters to Isolde are intercepted, and he is told that she has given him up. Near death from his wounds, Tristan sends one last desperate letter to Isolde by a trusted servant. He is dying, he tells her, and asks for one final sign of their love. If she can forgive him for marrying another, she must come to France in a ship set with white sails. If the ship’s sails are black, he will know that she no longer loves him. Isolde immediately leaves for France, but when Blanche sees the white sails from the castle window, she pulls the curtains and tells Tristan that they are black. To her horror, he turns his face to the wall and dies.There ends the traditional medieval story of Tristan and Isolde—with betrayal, death, and grief. But the original Irish legend ends differently, and so does this book, with magic and drama as only Rosalind Miles can write it.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Crown",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    }
]