[
    {
        "Title": "Just Plain Folks: Original Tales of Living, Loving, Longing, and Learning, As Told by a Perfectly Ordinary, Quite Commonly Sensible, and Absolutely Awe-Inspiring colore",
        "Authors": "By Johnson-Coleman, Lorraine",
        "Description": "A collection of short stories pays homage to the ordinary people in African American history and culture",
        "Category": " Fiction , Fairy Tales, Folklore & Mythology",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1998"
        }
    },
    {
        "Title": "The Sign of the Seahorse",
        "Authors": "By Base, Graeme",
        "Description": "In which the villainous Gropmund Grouper devises a dastardly scheme to rob the innocent folk of Reeftown of their homes and money, but is foiled by the efforts of the intrepid Pearl Trout, her fiery brother, Finneus, and brave Corporal Bert of the Soldiercrab Army.Graeme Base, who created Abrams' best-selling Animalia and The Eleventh Hour, now offers The Sign of the Seahorse, a sweeping drama of intrigue and excitement set in the beautiful but fragile underwater world of a coral reef.Beginning at the famous Seahorse Cafe, social hub of the Old Reef, The Sign of the Seahorse takes us on a great journey. We travel from the doomed coral gardens of Reeftown to a sunken wreck and an underwater junkyard, across the barren expanse of the Withered Plain, and into the vast, uncharted chasms of the Deep, before arriving finally at the utmost edge of the Great Continental Shelf.Readers of all ages will delight in the rhyming text and gloriously detailed illustrations of this undersea adventure. The wonderfully drawn characters will capture the imagination as The Sign of the Seahorse is enjoyed again and again.",
        "Category": " Juvenile Fiction , Animals , Marine Life",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Hugs and Kisses",
        "Authors": "By James, J. Alison (TRN), Loupy, Christophe, and Tharlet, Eve",
        "Description": "An irresistibly appealing puppy named Hugs sets out one morning on a quest. He asks every animal he meets for a kiss, and they are all happy to oblige. The pup discovers that duck's kisses are hard and wet; a horse's kiss is a little sticky, but very warm; the pig's kiss is a little muddy and bristly, tickley but tender. He collects lots of wonderful kisses, but when he returns home, he discovers that the best kiss of all is the one he gets from his loving mother.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "North-South Books Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "The Londoners: Life in a Civilized City",
        "Authors": "By Nelson, Walter Henry",
        "Description": "",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Flash 5 In An Instant (Visual Read Less, Learn More)",
        "Authors": "By Kinkoph, Sherry, Toot, Michael, and Kinkoph, Willard",
        "Description": "Using the award-winning Visual learning system, this compact, value-priced guide shows visual learners how to get up and running on the core program features in Flash 5 -- which you'll use over and over again. Flash 5 in an Instant covers the most popular features of Flash 5, including creating both simple and complex graphics, layering, animation with motion and shape tweening, and adding sounds. Its concise, step-by-step instructions and consistent placement of elements make fast learning of essential Flash 5 tasks.",
        "Category": " Computers , Interactive & Multimedia",
        "Publisher": "Visual",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Physical Geography: A Laboratory Manual",
        "Authors": "By Hidore, John J.",
        "Description": "",
        "Category": " Science , Earth Sciences , Geography",
        "Publisher": "Burgess Intl Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1978"
        }
    },
    {
        "Title": "McDuff Moves In",
        "Authors": "By Jeffers, Susan (ILT) and Wells, Rosemary",
        "Description": "A little gray dog that nobody seems to want finds just the right home--and a name.",
        "Category": " Juvenile Fiction , Animals , Dogs",
        "Publisher": "Disney Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Precious Moments Bible Promises",
        "Authors": "By Butcher, Samuel J. and Butcher, Samuel J. (ILT)",
        "Description": "A collection of verses from the Contemporary English Version and the International Children's Bible, New Century Version, grouped by the topics of \"Peace,\" \"Mercy,\" and \"Love.\"",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The man Mencken;: A biographical and critical survey,",
        "Authors": "By Isaac Goldberg",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "30.45",
        "Publish Date": {
            "Month": "January",
            "Year": "1925"
        }
    },
    {
        "Title": "Blacklist (V.I. Warshawski Novel)",
        "Authors": "By Paretsky, Sara",
        "Description": "From one of the most distinguished writers in American crime fiction - her most brilliant and daring novel yet.  This is a story of secrets and betrayals that stretch across four generations-secrets political, social, sexual, financial: all of them with the power to kill. Eager for something physical to do in the spirit-exhausting wake of 9/11, V.I. accepts a request from an old client to check up on an empty family mansion; sub-sequently surprises an intruder in the dark; and, giving chase, topples into a pond. Grasping for something to hold on to, her fingers close around a lifeless human hand.  It is the body of a reporter who had been investigating events of forty-five years earlier, during the McCarthy era, and V.I.'s discovery quickly sucks her into the history of two great Chicago families-their fortunes intertwined by blood, sex, money, and the scandals that may or may not have resulted in murder all these years later. At the same time, she inadvertently becomes involved in the story of a missing Egyptian boy whose possible terrorist connections make him very much sought after by the government. As the two cases drive her forward-and then shockingly tumble together-she finds that wealth and privilege, too, bear a terrible price; and the past has no monopoly on patriotic scoundrels. Before everything is over, at least two more people will lie dead . . . and V.I. might even be one of them.  A novel as passionate, complex, and powerfully entertaining as its acclaimed heroine, Blacklist is a stunning achievement.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "Better Homes and Gardens Complete Guide to Home Repair, Maintenance and Improvement",
        "Authors": "By Hufnagel, James A.",
        "Description": "",
        "Category": " House & Home , General",
        "Publisher": "Better Homes & Gardens Books",
        "Price Starting With ($)": "8.35",
        "Publish Date": {
            "Month": "February",
            "Year": "1980"
        }
    },
    {
        "Title": "Tantrika: Traveling the Road of Divine Love",
        "Authors": "By Nomani, Asra Q.",
        "Description": "When I began this trip, I had jetted to the Best Western in Santa Cruz, California, to learn the secrets of sexual ecstasy. For a little over four years, I confronted dualities, and they confronted me. Hinduism versus Islam. East versus West. Male energy versus female. True spirituality versus false opportunism. I had to choose the values with which I wanted to live.Tantrika tells the compelling story of a woman whose world travels and spiritual journey bring her face-to-face with the most fundamental dichotomy of her identity. Born in India and raised in the foothills of West Virginia, Nomani moves away from her Muslim upbringing to pursue the Hindu and Buddhist path of divine love.What began as a professional assignment for the Wall Street Journal to write about America’s hottest new fad, Tantra, became a very personal odyssey. While Tantra is popularly conceived as an ancient form of yoga or as \"sacred sex,\" the author's Muslim parents warn her it is a cult of black magic. In her search for the full story, Nomani travels from Santa Cruz to the feet of the Dalai Lama in Northern India, from meditation caves in Thailand to the homes of orthodox Muslims in Pakistan. Nomani's journey through the geography of her own spiritual conflict is a journey of self-discovery, of reconciling her Hindu ancestry and Muslim upbringing. She confronts darkness in ways she could never have imagined, but ultimately finds the path of the divine within herself and all women -- all \"tantrikas.\"",
        "Category": " Religion , Eastern",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "14.54",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "The Adventures of Tom Sawyer (Penguin Classics)",
        "Authors": "By Twain, Mark",
        "Description": "The classic adventure story of boyhood escapades on the shores of the Mississippi",
        "Category": " Fiction , Classics",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1987"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Pro Wrestling",
        "Authors": "By Sugar, Bert Randolph, Albano, Lou, and Woodson, Roger",
        "Description": "You're no idiot, of course.  You know Hollywood Hogan used to be known as Hulk Hogan and wrestling events are the biggest draws on cable TV.  But when it comes to knowing the ins and outs of the wrestling ring, you feel like you're caught between the ropes.  Don't be pinned to the canvas!  Captain Lou Albano and Bert Randolph Sugar are here to get you off the couch and screaming into the arenas.  In their book The Complete Idiot's Guide to Pro Wrestling, Lou and Bert teach you all of the tricks of the trade.  In this Complete Idiot's Guide, you get:",
        "Category": " Sports & Recreation , Wrestling",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "The Motley Fools Rule Breakers Rule Makers : The Foolish Guide To Picking Stocks",
        "Authors": "By Gardner, David and Gardner, Tom",
        "Description": "THE NEW YORK TIMES BESTSELLER  From the bestselling authors of The Motley Fool Investment Guide and its successful, savvy prequel, The Motley Fool's You Have More Than You Think, here's an engaging, humorous, and practical stock-picking guide, packed with Foolish insights, that caps off this invaluable personal finance trilogy from David and Tom Gardner.  The Motley Fool's Rule Breakers, Rule Makers presents the sophisticated, yet easy-to-understand stock-picking methods that have kept the Motley Fool portfolio beating the Standard & Poor's averages by more than 30 percent. The key is investing in small start-up companies that have historically offered the greatest investment returns (the \"rule breakers\") as well as huge companies that maintain legal monopolies in their fields (the \"rule makers\"). The Gardner brothers explain  * How to identify the best investments in today's public markets: the rule breakers and the rule makers * The definition of a \"tweener\" -- a maturing rule breaker -- and how to detect the Tweener Death Rattle * When to buy and when to sell, and how to manage your portfolio on a regular basis  In their first two books, the Fools got you started in investing and freed you from the fees and worries that Wall Street's Wise Men have been imposing on investors for decades. Now, by sharing their methods for picking rule breakers and rule makers, they guide you through a stock market that has seen company valuations soar to unprecedented heights and that promises to continue providing roller-coaster thrills. The Motley Fools are the ultimate companions to bring along for a safe, fun, and profitable ride.",
        "Category": " Business & Economics , Personal Finance , Investing",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Soul Stories",
        "Authors": "By Zukav, Gary",
        "Description": "True Stories That Transform Lives  Writing with profound psychological and spiritual insight, prize-winning author Gary Zukav has had a major impact on the consciousness of millions. In his New York Times number-one bestseller, The Seat of the Soul, he explained how the expansion of human perception beyond the five senses leads to a new understanding of power -- the alignment of the personality with the soul -- which in turn leads to an awareness of our extraordinary creative abilities. Now, in one of the most important and useful books you will ever read, Soul Stories, Zukav shows how this new understanding of power -- authentic power -- transforms lives in countless ways.  Soul Stories is filled with marvelous stories that show how concepts such as intuition, harmony, cooperation, sharing, and reverence for life actually express themselves in people's lives. Best of all, the stories lead to practical advice on how you can discover your own Soul Stories and the truths they reveal about the deepest sources of your being. Wonderfully readable, Soul Stories is a wise and inspirational book.",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "11.68",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    },
    {
        "Title": "Inc. Yourself: How to Profit by Setting Up Your Own Corporation",
        "Authors": "By McQuown, Judith H.",
        "Description": "Guides readers through the legal and financial steps of incorporation, discussing federal and state laws, medical benefits, employees, and more",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "On the Edge: The Clinton Presidency",
        "Authors": "By Drew, Elizabeth",
        "Description": "Bill Clinton's Presidency has been the most turbulent in recent history, as this talented but flawed and perplexing man has struggled to govern. On the Edge is the first full-spectrum report on the Clinton Presidency. From its first days, Drew spoke with the President's top advisers, key Cabinet officers, and members of Congress as she watched -- up close -- as policies were hammered out and crises confronted. Drew tells the remarkable story of this fascinating term and deciphers what it means for this country.",
        "Category": " Political Science , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Front Row at the White House : My Life and Times",
        "Authors": "By Thomas, Helen",
        "Description": "\"Thank You, Mr. President.\"  From the woman who has reported on every president from Kennedy to Clinton comes a privileged glimpse into the White House -- and a telling record of the ever-changing relationship between the presidency and the press.  Helen Thomas wanted to be a reporter from her earliest years. She turned a copy-aide job at the Washington Daily News into a powerful and successful career spanning thirty-seven years and eight U.S. presidents. Assigned to the White House press corps in 1961. Thomas was the first woman to close a press conference with \"Thank you. Mr. President.\" She was also the first female president of the White House Correspondents Association and the first woman member, later president, of the Gridiron Club.  In this revealing memoir, which includes hundreds of anecdotes, observations, and personal details. Thomas looks back on a career spent with presidents at home and abroad, on the ground and in the air. Providing a unique view of the past four decades of presidential history. Front Row at the White House offers a seasoned study of the relationship between the chief executive officer and the press -- a relationship that is sometimes uneasy, sometimes playful, yet always integral to the democratic process.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Scribner",
        "Price Starting With ($)": "8.56",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "The Back Rub Book",
        "Authors": "By Rush, Anne Kent",
        "Description": "Teaches the fine art of giving and receiving great back rubs that offers a respite from life's stresses and responsibilities. Hundreds of tailored backrubs to fit the mood and situation. Funky illustrations.",
        "Category": " Health & Fitness , Health Care Issues",
        "Publisher": "Vintage",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1989"
        }
    },
    {
        "Title": "The Monster Under The Bed",
        "Authors": "By Davis, Stan and Botkin, James W.",
        "Description": "Companies in the business of providing knowledge -- for profit -- will dominate the 21st-century global marketplace.  Can your business compete?  In today's fast-paced world, knowledge is doubling nearly every seven years, while the life cycle of a business grows increasingly shorter. The best way -- and perhaps the only way -- to succeed is to become a \"knowledge-based\" business. In The Monster Under the Bed, Stan Davis and Jim Botkin show how:  * Every business can become a knowledge business * Every employee can become a knowledge worker * Every customer can become a lifelong learner  The Monster Under the Bed explains why it's necessary for businesses to educate employees and consumers. Consider the fact that the vast majority of 60 million PC owners, for example, learned to use their computers not at school but at work or at home. Davis and Botkin explain how any high-tech, low-tech, or no-tech company can discover new markets and create new sources of income by building future business on a knowledge-for-profit basis -- and how, once it does, its competitors must follow or fail.  Filled with examples of high-profile companies that are riding the crest of this powerful wave, The Monster Under the Bed is an insightful exploration of the many ways that the knowledge-for-profit revolution will profoundly affect our businesses, our educational processes, and our everyday lives.",
        "Category": " Business & Economics , Leadership",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Lesbian And Gay Families Speak Out Understanding The Joys And Challenges Of Diverse Family Life",
        "Authors": "By Drucker, Jane, Ph.D.",
        "Description": "\"An important book whose time has come!\"-Adele Starr, First President of PFLAG (Parents and Friends of Lesbians and Gays) National, and Larry Starr, Co-Founder of PFLAG, Los Angeles, CaliforniaWith an estimated six to fourteen million children living with a gay or lesbian parent, there is a real need for accurate information for and about the realities of these families. With honesty and compassion, Lesbian and Gay Families Speak Out explores the variety of issues they face: from interpersonal relationships and sexual and psychological development, to coming out, dealing with prejudice, and finding a spiritual foundation. Using the compelling stories of over two dozen families in which gay fathers and lesbian mothers are raising children in a wide variety or settings and styles, Drucker proves that children thrive in an environment of love, regardless of the number, gender, or sexual orientation of the adults who provide that love.",
        "Category": " Social Science , LGBT Studies , Gay Studies",
        "Publisher": "Da Capo Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "The Choice",
        "Authors": "By Woodward, Bob",
        "Description": "The intimacy and the detail of this book render human the 1996 race for the White House, showing its personal toll on the candidates and their wives.  The Choice also exposes how political money, public opinion polling, attack advertising, handlers, consultants, and staff too often drive modern presidential politics.  It is the essential story of the nation's most intense political drama.",
        "Category": " Political Science , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Kenneth Clark: A Biography",
        "Authors": "By Secrest, Meryle",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "What the Rest of Us Can Learn from Homeschooling: How A+ Parents Can Give Their Traditionally Schooled Kids the Academic Edge",
        "Authors": "By Dobson, Linda",
        "Description": "Lessons from the annals of homeschooling are collected here and applied to conventional schools in six principles of \"successful learning\"--curiosity, fun in learning, desire for success, practice (not study), applying learned material to life, and intrinsic motivation. Original. 10,000 first printing.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Children Learn What They Live: Parenting to Inspire Values",
        "Authors": "By Harris, Rachel and Nolte, Dorothy Law",
        "Description": "The timeless New York Times bestselling guide to parenting that shows the power of inspiring values through example.   A unique handbook to raising children with a compassionate, steady hand—and to giving them the support and confidence they need to thrive. Expanding on her universally loved poem “Children Learn What They Live,” Dorothy Law Nolte, with psychotherapist Rachel Harris, reveals how parenting by example—by showing, not just telling—instills positive, true values in children that they will carry with them throughout their lives. Addressing issues of security, self-worth, tolerance, honesty, fear, respect, fairness, patience, and more, this book of rare common sense will help a new generation of parents find their own parenting wisdom—and draw out their child’s immense inner resources.  If children live with criticism they learn to condemn. If children live with sharing, they learn generosity. If children live with acceptance, they learn to love.   And more wisdom.",
        "Category": " Philosophy , Ethics & Moral Philosophy",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Last Stand! Famous Battles Against the Odds (Cassell Military Classics)",
        "Authors": "By Perrett, Bryan",
        "Description": "Custer's wasn't the only one! A \"last stand\" remains one of the most compelling wartime scenarios, where outnumbered warriors fight on, hoping to defy the odds and win the day. This best-selling collection gathers 13 examples of such battles, which often influence entire campaigns. Alongside less well-known cases, appear some of the most unforgettable campaigns: Napoleon at Waterloo, the Alamo, Little Big Horn, Rorke's Drift, and Arnhem Bridge. \"...part of the...Cassell Military Classics series...hair-raising stories of military skirmishes throughout history.\"--Library Journal.",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "Cassell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1998"
        }
    },
    {
        "Title": "Resurrection The Capstone In The Arch Of Christianity",
        "Authors": "By Hanegraaff, Hank",
        "Description": "In this definitive work, popular Christian apologist Hank Hanegraaff offers a detailed defense of the Resurrection, the singularly most important event in history and the foundation upon which Christianity is built. Using the acronym F.E.A.T., the author examines the four distinctive, factual evidences of Christ's resurrection-Fatal torment, Empty tomb, Appearances, and Transformation-making the case for each in a memorable way that believers can readily use in their own defense of the faith.",
        "Category": " Religion , Christian Theology , Apologetics",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Live from Golgotha: The Gospel According to Gore Vidal",
        "Authors": "By VIDAL, GORE",
        "Description": "Timothy (later St. Timothy) is in his study in Thessalonika, where he is bishop of Macedonia. It is A.D. 96, and Timothy is under terrific pressure to record his version of the Sacred Story, since, far in the future, a cyberpunk (the Hacker) has been systematically destroying the tapes that describe the Good News, and Timothy's Gospel is the only one immune to the Hacker's deadly virus. Meanwhile, thanks to a breakthrough in computer software, an NBC crew is racing into the past to capture—live from the suburb of Golgotha—the Crucifixion, for a TV special guaranteed to boost the network's ratings in the fall sweeps.As a stream of visitors from twentieth-century America channel in to the first-century Holy Land—Mary Baker Eddy, Shirley MacLaine, Oral Roberts and family—Timothy struggles to complete his story. But is Timothy's text really Hacker-proof? And how will he deal with the truth about Jesus' eating disorder? Above all, will he get the anchor slot for the Big Show at Golgotha without representation by a major agency, like CAA 1,896 years in the future? Tune in.",
        "Category": " Fiction , Literary",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Another Use For . . .: 101 Common Household Items",
        "Authors": "By Lansky, Vicki and Campbell, Martha (ILT)",
        "Description": "ANOTHER USE FOR... has a 10 page index making it easier to find the solutions to household problems. Common household items are listed alphabetically, followed by five to ten additional and often surprising uses for that item. Beginning with ALCOHOL (to remove grass stains from clothing), ALUMINUM FOIL (to wrap doorknobs before painting to avoid drips), to WAX PAPER (to rub across closet rods for easy-sliding hangers.) You will be amazed at the ingenious ways you can use the ordinary things you have at home.Whimsical line drawings add a touch of humor to this clever compendium of handy suggestions for recycling, reusing or repositioning common items. Frugality is the watchword. This book should help throwaway habits and strike back at planned obsolescense.",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "Book Peddlers, The",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "The PDR Family Guide Encyclopedia of Medical Care: The Complete Home Reference to Over 350 Medical Problems and Procedures from the Publishers of The ... Desk Reference® (Family Medical Guides)",
        "Authors": "By Medical Economics (EDT)",
        "Description": "A guide to hundreds of medical problems from the publishers of The Physicians' Desk Reference includes detailed instructions for what to do after seeing a doctor, summaries of each problem's causes, symptoms, and treatment, and much more. Original. 75,000 first printing.",
        "Category": " Health & Fitness , Health Care Issues",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Diet-Free Solution: For Safe, Healthy, and Permanent Weight Loss",
        "Authors": "By Mellin, Laurel",
        "Description": "You‘ve tried everything : the pills, the shakes, the diets, even the surgery, and it‘s been a losing battle. But permanent weight loss isn‘t impossible. Not anymore . . .  Now dietary expert Laurel Mellin offers a scientifically proven, agony–free, breakthrough program for weight loss that doesn‘t require deprivation or superhuman willpower. The Diet–Free Solution presents a practical six–step plan that succeeds where other diets fail because it identifies the psychological, physical, and lifestyle causes of weight problems : the powerful mind and body drives that lead to overeating and inactivity栮d offers the cure for each. You can change your body, and ultimately your whole life 執ith:   The Nurturing Cure: How to become aware of your feelings and meet your own needs  The Limits Cure: How to control your actions and set appropriate, realistic expectations  The Body Pride Cure: How to turn off negative stereotypes about fat  The Good Health Cure: How to become aware of body health and stay healthy  The Eating Cure: How to eat regular meals and maintain a healthy diet  The Activity Cure: How to maintain an exercise program and find personal time  Until you understand the whole truth about your weight problem, you can‘t solve it. Whether you‘re trying to lose those last five pounds, end a compulsive eating problem, or shed more weight than you ever thought you‘d carry, let The Diet–Free Solution work for you now and for the rest of your life!  The ability to self–nurture and set effective limits is the root of human maturity, and the foundation for emotional, behavioural, and spiritual balance. Fortunately, the skills to self–nurture and set effective limits can be fine–tuned and readers will learn them via a wealth of practical examples, colourful case histories, and scientific findings that are both fascinating and easy to understand. These skills are effective for a wide range of psychological and addictive problems––from alcoholism and other addictions to overeating, overworking, overspending, and perfectionism.",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "An Unexpected Light: Travels in Afghanistan",
        "Authors": "By Elliot, Jason",
        "Description": "Part historical evocation, part travelogue, and part personal quest, An Unexpected Lightis the account of Elliot's journey through Afghanistan, a country considered off-limits to travelers for twenty years. Aware of the risks involved, but determined to explore what he could of the Afghan people and culture, Elliot leaves the relative security of Kabul. He travels by foot and on horseback, and hitches rides on trucks that eventually lead him into the snowbound mountains of the North toward Uzbekistan, the former battlefields of the Soviet army's \"hidden war.\" Here the Afghan landscape kindles a recollection of the author's life ten years earlier, when he fought with the anti-Soviet mujaheddin resistance during the Soviet occupation of Afghanistan.Weaving different Afghan times and visits with revealing insights on matters ranging from antipersonnel mines to Sufism, Elliot has created a narrative mosaic of startling prose that captures perfectly the powerful allure of a seldom-glimpsed world.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Picador USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Fathers and Babies: How Babies Grow and What They Need from You, from Birth to 18 Months",
        "Authors": "By Marzollo, Jean, Trivas, Irene (ILT), and Trivas, Irene",
        "Description": "Fathers and Babies is the one and only baby care book written expressly for fathers.  Fathers and Babies is a light and reassuring introduction into the world of fatherhood. Fathers today want to be, and are expected to be, involved parents who bond with their children and help them thrive. Yet, sadly, many new fathers feel excluded from the loop of child care.  Because most fathers don't get to spend  as much time with their babies as mothers do, men don't learn the everyday skills of baby care. When they attempt to help out during evenings and on weekends, they frustrate themselves and those they are trying to help. Instead of becoming closer to their children, many fathers withdraw, conceding the domain of parenting to mothers. This is unfair to mothers, fathers, and their children.  What fathers desperately need is a special baby care training manual that will teach them how to fix a bottle, soothe a bay in the middle of the night, and help a child learn to talk. Fathers who are primary caregivers gain these skills easily. But most fathers are not primary caregivers; and because they can't spend more time with their children, they need help in order to become the great fathers they want to be.  Fathers and Babies provides step-by-step instructions accompanied by humorous, real-life pictures that show fathers what to do. The book also explains the important perceptual abilities, language skills, muscular coordination, strength, and concepts of trust and self-esteem that babies need to develop during the first eighteen months of life. The more fathers know about these critical developments, the more fathers will be able to help their babies achieve and the more worthy they will feel as parents.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Clara Callan: A Novel",
        "Authors": "By Wright, Richard Bruce",
        "Description": "In a small town in Canada, Clara Callan reluctantly takes leave of her sister, Nora, who is bound for New York. It's a time when the growing threat of fascism in Europe is a constant worry, and people escape from reality through radio and the movies. Meanwhile, the two sisters -- vastly different in personality, yet inextricably linked by a shared past -- try to find their places within the complex web of social expectations for young women in the 1930s.While Nora embarks on a glamorous career as a radio-soap opera star, Clara, a strong and independent-minded woman, struggles to observe the traditional boundaries of a small and tight-knit community without relinquishing her dreams of love, freedom, and adventure. However, things aren't as simple as they appear -- Nora's letters eventually reveal life in the big city is less exotic than it seems, and the tranquil solitude of Clara's life is shattered by a series of unforeseeable events. These twists of fate require all of Clara's courage and strength, and finally put the seemingly unbreakable bond between the sisters to the test.",
        "Category": " Fiction , Literary",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "Gobs and Gobs of Free Stuff!",
        "Authors": "By Mary Ann Martello Matthew Lesko",
        "Description": "",
        "Category": "",
        "Publisher": "Information USA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Octopus and the Orangutan: New Tales of Animal Intrigue, Intelligence, and Ingenuity",
        "Authors": "By Linden, Eugene",
        "Description": "The author of The Parrot's Lament presents another collection of true anecdotes that offer evidence about animal intelligence, sharing stories of animal friendship, survival, and unexpected behavior while continuing many of the tales introduced in the first book. Reprint.",
        "Category": " Nature , Animals , General",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "First Christians: Pentecost and the Spread of Christianity",
        "Authors": "By Maier, Paul L.",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Little Elephant",
        "Authors": "By Jessica Potter Broderick",
        "Description": "",
        "Category": "",
        "Publisher": "Rand McNally",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "The Outcasts of 19 Schuyler Place",
        "Authors": "By Konigsburg, E. L.",
        "Description": "The summer she's twelve -- the same year that Cabbage Patch dolls are popular, that Sally Ride becomes the first American woman in space, that El Niño affects weather patterns worldwide and causes disasters on almost every continent of the planet Earth -- Margaret Rose Kane must confront a catastrophe brewing in her own backyard.  Freshly rescued from a miserable experience at Camp Talequa, where she was housed with seven cruel cabin mates, Margaret is looking forward to spending the rest of her summer with her beloved great-uncles, Morris and Alexander. Little does she know, the Uncles themselves are in need of a rescue.  For the last forty-five years, the Uncles have been building three giant towers in their backyard from scrap metal and shards of glass and porcelain. But now, bowing to pressures from some powerful home owners, the towers have been declared a blight on the neighborhood. Even worse, the city council has voted to have them destroyed.  Margaret Rose is outraged. She knows the towers for what they truly are: irreplaceable works of art. To Margaret, the towers sing. They sing of the joy of making something big and beautiful out of bits and pieces; of integrity; but perhaps most important of all, they sing of history. And Margaret Rose is determined to make sure they always will.  This companion story to the acclaimed Silent to the Bone is a rousing tale of art, history, and the fierce preservation of individuality, as only the incomparable E. L. Konigsburg could write it.",
        "Category": " Juvenile Fiction , Social Themes , General",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2004"
        }
    },
    {
        "Title": "St. Paul's Cathedral",
        "Authors": "By Various",
        "Description": "",
        "Category": "",
        "Publisher": "Pitkin Unichrome Ltd",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Christian Religious Education",
        "Authors": "By Groome, Thomas H.",
        "Description": "Uses contemporary educational theory, biblical scholarship, and social theory to define the purpose and approach of modern Christian education",
        "Category": " Religion , Christian Education , General",
        "Publisher": "Harper San Francisco",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "The Cerebral Symphony: Seashore Reflections on the Structure of Consciousness",
        "Authors": "By Calvin, William H.",
        "Description": "Neurobiologist William Calvin explores the human brain, positing that the neurons in the brain operate in an accelerated version of biological evolution, evolving ideas through random variations and selections, and supports his hypothesis with numerous case studies",
        "Category": " Psychology , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Modern Madness: The Hidden Link Between Work and Emotional Conflict",
        "Authors": "By Labier, Douglas",
        "Description": "Based on a seven-year study of the emotional lives of young professionals, the author demonstrates how striving to fit into the highly competitive corporate world can result in depression, emotional strain, and burnout",
        "Category": " Psychology , Mental Health",
        "Publisher": "Touchstone Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Becoming a Man: Half a Life Story",
        "Authors": "By Monette, Paul",
        "Description": "The critically and popularly acclaimed coming of age/coming out story from the author of Borrowed Time: An AIDS Memoir. \"Witty as it is anguished and as full of understanding as of anger, this is Monette's best book.\"--Booklist",
        "Category": " Social Science , LGBT Studies , Gay Studies",
        "Publisher": "HarperSanFrancisco",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "The Diabetes Snack, Munch, Nibble, Nosh Book",
        "Authors": "By Glick, Ruth",
        "Description": "Collects recipes suited for more frequent but smaller meals, including pizza puffs, biscuits, stuffed artichoke hearts, vegetable wraps, and Hawaii meatballs",
        "Category": " Cooking , Health & Healing , Diabetic & Sugar-Free",
        "Publisher": "American Diabetes Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Seldom Disappointed: A Memoir",
        "Authors": "By Hillerman, Tony",
        "Description": "In this affectionate and unvarnished recollection of his past, Tony Hillerman looks at seventy-six years spent getting from hard-times farm boy to bestselling author. Using the gifts of a talented novelist and reporter, Hillerman draws brilliant portrait not just of his life, but of the world around him.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Extreme Lo-Carb Cuisine: 250 Recipes With Virtually No Carbohydrates",
        "Authors": "By Long, Sharron",
        "Description": "Presents a variety of recipes for appetizers, salads, breakfast foods, entrees, side dishes, and desserts that contain less than ten grams of carbohydrates.",
        "Category": " Cooking , Health & Healing , Weight Control",
        "Publisher": "F+W Media, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2003"
        }
    },
    {
        "Title": "WHY DONT YOU GET A HORSE, SAM ADAMS? (PAPERBACK) 1996 PUFFIN",
        "Authors": "By Hyman, Trina Schart (ILT) and Fritz, Jean",
        "Description": "This lively biography, by Newbery Honor-winning author Jean Fritz, is a nice, personal look at a leader and his times.In early America, when all the men wore ruffled shirts and rode grandly on horseback, one man refused to follow suit. He was the rebel leader Sam Adams, a plainspoken gent who scorned ruffles, refused to ride a horse, and had little regard for the King.",
        "Category": " Juvenile Nonfiction , History , United States , Colonial & Revolutionary Periods",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Locks and Cream Cheese",
        "Authors": "By Mild, Rosemary and Mild, Larry",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "AmErica House",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Ancient Mexico: Aztec, Mixtec, and Maya Landscapes (Touring North America)",
        "Authors": "By Stuart, George E. and Swanson, Winfield",
        "Description": "Discover Mexico's past and present hand-in-hand with the experts!This travel guide offers a unique ten-day tour of the sites of Mexico's pre-Columbian cultures, starting in Mexico City and ending in Cancœn. As you visit the remains of the great early civilizations in Teotihuac†n, Oaxaca Valley, Uxmal, ChichŽn Itza, Cob†, and Cancœn, this eye-opening book will tell you just what makes these places and cultures so special. Stuart and Swanson comment on everything that's likely to catch your attentionñfrom the lay of the land to the taste of the food, from Mayan Sacred Wells to colonial Spanish cathedrals, from Aztec pyramids to the thatched oval houses of today's Maya villages, from sisal plantations to glimpses of the beautiful turquoise-crested motmot.        Ancient Mexico: Aztec, Mixtec, and Maya Landscapes makes the best of traveling companions: compact, informed, and lively. You'll want to read and re-read it as you plan, take, and relive your trip!      George E. Stuart, National Geographic Society, is an authority on Mesomerican archeology. Winfield Swanson is the managing editor of the journal National Geographic Research & Exploration.    A volume in Touring North America, a new series of thirteen guides by geographers for the curious traveler. The guides provide stop-by-stop tours to the most interesting places in the United States, Canada, Mexico, and the Caribbean. They tell you what to seeñand what it means! This innovative series, specially commissioned for the 27th International Geographical Congress 1992 and featuring maps by National Geographic Society cartographers, will be invaluable to the visitor and the native alike.",
        "Category": " Travel , Mexico",
        "Publisher": "Rutgers University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "Ursula's Umbrella and Other Stories: Five-Minute Tales for Bedtime (Children's Storytime Collection)",
        "Authors": "By Derek Hall, Alison Morris, Louisa Somerville",
        "Description": "",
        "Category": "",
        "Publisher": "PARRAGON",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Prayer and Power in the Capital",
        "Authors": "By Innis, Pauline (COM)",
        "Description": "",
        "Category": " Religion , Prayer",
        "Publisher": "Devon Publishing Company",
        "Price Starting With ($)": "26.36",
        "Publish Date": {
            "Month": "August",
            "Year": "1982"
        }
    },
    {
        "Title": "The Day Before America/Changing the Nature of a Continent",
        "Authors": "By MacLeish, William H.",
        "Description": "History and prehistory come alive in this extraordinary account of America as it was before it got its name. William H. MacLeish paints a heartrending portrait of the lush, miraculous New World on the eve of the Encounter - the arrival of the first Europeans, after which nothing was the same. Drawing on the work of anthropologists, geologists, and other academic experts, MacLeish roams over 18,000 years of the continent's history, exploring the roles of climate and human activity in preparing the world that we have inherited. The Day Before America is studded with fascinating information on the awesome transformations of the ice age (and the inevitability of its return), on the ecological effects of hunting and early agriculture, and on the astonishing variety of \"native\" civilizations. The book is informed by a deep commitment to the wonder and sanctity of the natural world, and at bottom, it is a statement of belief in an unsentimental environmentalism -- an effort to see our world i",
        "Category": " History , United States , General",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Animal ecology",
        "Authors": "By Dowdeswell, W. H",
        "Description": "",
        "Category": "",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1961"
        }
    },
    {
        "Title": "ABCs of the Bible",
        "Authors": "By Reader's Digest Editors",
        "Description": "A collection of more than four hundred questions and answers sheds light on the teachings of the Bible, and discusses patriarchs, prophets, judges, kings, apostles, disciples, and more",
        "Category": " Religion , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Bloody Sundays: Inside the Dazzling, Rough-and-Tumble World of the NFL",
        "Authors": "By Freeman, Michael",
        "Description": "In Bloody Sundays, award-winning sportswriter Mike Freeman delivers an eye-opening appraisal of football, capturing the complexities and controversies of America's new national pastimeWith fascinating insights, Freeman goes beyond day-to-day newspaper journalism and ESPN highlights to take us deep inside the game and reveal the NFL in ways that will surprise even the most avid football fans. He travels to the sidelines and into the locker rooms to interview hundreds of players and coaches on their expertise. Breaking the game down to its three essential elements -- coaching, offense, and defense -- Freeman profiles in depth three of today's football elite: Jon Gruden, head coach of the Tampa Bay Buccaneers; Michael Strahan, defensive end for the New York Giants; and Emmitt Smith, the legendary running back. Packed with football history and anecdotes, Bloody Sundays goes behind the scenes of the \"secret society\" of gay players who play in fear of their lives and careers. Freeman offers an exclusive and disturbing look at the life of a current player, the first time an active player addresses homosexuality and the warrior culture NFL. Freeman also studies how the violence of the game ravages the bodies of players only too willing to suit up and endure extraordinary pain every Sunday, damn the consequences. There is also the matter of how teams are only too willing to look the other way if a player's off-the-field violence doesn't affect his on-the-field performance.Bloody Sundays takes us into the owners' offices to look at the worst franchise in football, how teams spy on their players, and how intelligence tests determine whether or not a player will be drafted.Part tribute, part exposé, Bloody Sundays is a vivid portrait of professional football, the men who strap on their helmets every Sunday, and the men who lead them.",
        "Category": " Sports & Recreation , Football",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.36",
        "Publish Date": {
            "Month": "September",
            "Year": "2003"
        }
    },
    {
        "Title": "The evidence of Washington",
        "Authors": "By Walton, William",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "7.82",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Getting Started in Options",
        "Authors": "By Thomsett, Michael C.",
        "Description": "",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Baseball...a Laughing Matter!",
        "Authors": "By Wolff, Rick, Fusselle, Warner, Zevnik, Brian, and Wilson, Bill (ILT)",
        "Description": "",
        "Category": " Sports & Recreation , Baseball , Essays & Writings",
        "Publisher": "Sporting News",
        "Price Starting With ($)": "6.05",
        "Publish Date": {
            "Month": "March",
            "Year": "1987"
        }
    },
    {
        "Title": "Sweet Seasons: Baseball's Top Teams Since 1920",
        "Authors": "By Siner, Howard",
        "Description": "Recounts the seasons of the twenty-five most successful major league baseball teams and describes the key elements in each team's success",
        "Category": " Fiction , Romance , Regency",
        "Publisher": "Pharos Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1988"
        }
    },
    {
        "Title": "Eva Moves the Furniture: A Novel",
        "Authors": "By Livesey, Margot",
        "Description": "On the morning of Eva McEwen's birth, six magpies congregate in the apple tree outside the window--a bad omen, according to Scottish legend. That night, Eva's mother dies, leaving her to be raised by her aunt and heartsick father in their small Scottish town. As a child, Eva is often visited by two companions--a woman and a girl--invisible to everyone else save her. As she grows, their intentions become increasingly unclear: Do they wish to protect or harm her? A magical novel about loneliness, love, and the profound connection between mother and daughter, Eva Moves the Furniture fuses the simplicity of a fairy tale with the complexity of adult passions.",
        "Category": " Fiction , Literary",
        "Publisher": "Picador",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Gwyneth Paltrow",
        "Authors": "By Milano, Valerie",
        "Description": "Oscar-winning actress Gwyneth Paltrow has lived the life of a Hollywood princess &#151; despite her parents’ attempts to shelter her from the glare of the spotlight. The daughter of producer Bruce Paltrow and actress Blythe Danner, her family moved to New York from California when she was 11 years old, where she studied at elite East-coast prep schools. But Hollywood beckoned, and she returned to the West coast to attend college and pursue her own acting career. This biography will take a close look at those early days, when Gwyneth was better known for club-hopping with her pal Emily Lloyd than for her acting talents. It describes how Paltrow soon grew weary of being a part of the L.A. party scene, and got serious about her acting when she performed opposite her mother in the Williamstown Theater production of Picnic.Since 1991, Paltrow has appeared in 20 films &#151; including Shakespeare in Love, Great Expectations, Emma, Sliding Doors, and The Talented Mr. Ripley &#151; and has become the undisputed queen of the &#147;A” list of independent actresses. Despite all these credits and accompanying accolades, Gwyneth is more famous for her off-screen love life than her on-screenperformances. Gwyneth Paltrow will offer a detailed look into her private life, including her relationships with Brad Pitt, Ben Affleck, and, most recently, Scott Speedman &#151; all of which began as on-set romances. In addition, her family life &#151; particularly her close relationships with her father, mother, brother, and grandfather &#151; are brought to life through the words of friends and associates. No doubt because she was (literally) raised on movie sets, Paltrow tends to remain aloof around both fans and the media. But as this book reveals, behind Gwyneth’s cool blonde reserve lies a complex, intelligent, ambitious woman who has positioned herself to be in the forefront of Hollywood happenings well into the next millennium.",
        "Category": " Biography & Autobiography , Entertainment & Performing Arts",
        "Publisher": "ECW Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Zazoo Pa",
        "Authors": "By Mosher, Richard",
        "Description": "Zazoo is Vietnamese by birth but feels entirely French. She has lived with her adoptive Grand-Pierre in France in an old stone mill between the river and the canal since she was two, sharing poetry, adventures, and the predictable rhythms of the seasons. Then one misty October morning, a young man on a bicycle rides into Zazoo’s small village and asks a question from which many stories begin to unfold. A love story within a love story.",
        "Category": " Young Adult Fiction , Family , Orphans & Foster Homes",
        "Publisher": "Graphia",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Escape from Intimacy: Untangling the ``Love'' Addictions: Sex, Romance, Relationships",
        "Authors": "By Schaef, Anne Wilson",
        "Description": "The author applies her theory of addiction to the problems of sex, love, and romance to show how addiction to each of these leads to shame, guilt, and violence and away from intimacy",
        "Category": " Psychology , General",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Control Theory in the Practice of Reality Therapy: Case Studies",
        "Authors": "By Glasser, Naomi",
        "Description": "\"Case studies provide the reader with a variety of interesting examples of ways that control theory can be translated into the practice of reality therapy. . . . [Dr. Glasser's] commentaries . . . are one of the strengths of the book.\"--Gerald Corey",
        "Category": " Psychology , Movements , Behaviorism",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1989"
        }
    },
    {
        "Title": "Pet Care in the New Century: Cutting-Edge Medicine For Dogs & Cats",
        "Authors": "By Shojai, Amy",
        "Description": "Incorporating the latest research into veterinary medicine, a timely handbook, alphabetically organized for easy access, provides definitive information on a wide range of ailments affecting dogs and cats, the various treatments available, preventice care, and other ways to promote the health and happiness of one's pets. Original.",
        "Category": " Pets , Cats , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "VBScript Programmers Reference",
        "Authors": "By Kingsley-Hughes, Adrian, Kingsley-Hughes, Kathie, Wilton, Paul, Updegrave, Stuart, Nelson, Erick, Prussak, Piotr, Thomsen, Carsten, Clark, Susanne, Read, Daniel, Matsik, Brian, and De Donatis, Antonio",
        "Description": "",
        "Category": " Computers , Programming Languages , General",
        "Publisher": "Wrox Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The Cassandra Compact: A Covert-One Novel",
        "Authors": "By Ludlum, Robert and Shelby, Philip",
        "Description": "Yuri Danko, a deep-cover Russian asset for Covert-One, is on the run. His last communication was a cryptic and urgent plea for extraction. With no hint of what sudden danger Danko encountered or information he uncovered that could have driven him to such extreme action, Covert-One operative Jon Smith is sent to the pre-arranged meeting place with instructions to bring Danko out. Ten days later, in Venice, Danko arrives breathless and bedraggled at Jon Smith's table at an outdoor cafe. But he barely opens his mouth before his body is ripped apart by a spray of assassins' bullets. Smith, eluding the hail of bullets, gives chase - only to witness the assassins themselves falling prey to a brutal execution. With only the scant clues left behind by Danko to go on, Jon Smith and Covert-One quickly conclude that someone is out to do the unthinkable - attempt to steal Russia's store of the smallpox virus. Now completely eradicated, smallpox is the deadliest of viruses and could well cause an epidemic of an undreamed-of scale should it be released in the general population. Smith and his Covert-One colleagues try to prevent the virus from being stolen. But their unseen adversaries are several steps ahead of them, and the virus is en route to the United States. Now they must unravel the complex scheme, overcome their powerful and invisible opponents, and recover or destroy the virus before the power of total Armageddon rests comfortably in the arms of a madman.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "Never Too Much",
        "Authors": "By Foster, Lori",
        "Description": "Determined to show Sierra Murphy his expertise in sensual pleasure, Ben Badwin launches an all out campaign to seduce her, but Sierra wants nothing to do with him, until desire gets the better of her, forcing her to turn the tables on Ben by offering him her body for one night - and one night only. Original. 50,000 first printing.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Kensington",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "The Everything One-Pot Cookbook",
        "Authors": "By Rogak, Lisa and Shaw, Lisa Angowski Rogak",
        "Description": "More than three hundred recipes for dishes that can all be cooked in one pot, for the easiest preparation of all, offers dishes ranging from stew to casseroles to appetizers, all presented in an easy-to-use format. Original.",
        "Category": " Cooking , General",
        "Publisher": "Everything",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Your Outta Control Adopted Dog",
        "Authors": "By Adamson, Eve",
        "Description": "Offers advice for adopting dogs of all ages and with a range of training needs, discussing how to socialize an adopted dog and solve problems including hyperactivity, separation anxiety, shyness, excessive barking, and digging.",
        "Category": " Pets , Reference",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "American Horticultural Society Practical Guides: Small Gardens (AHS Practical Guides)",
        "Authors": "By Moreland, John",
        "Description": "Tells how to create a small garden, solve design problems, and select useful plants",
        "Category": " Gardening , Reference",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "NIGHT & DAY: A Novel",
        "Authors": "By Leslie, John",
        "Description": "Assuming a low profile throughout the raucous festivities of Key West's Hemingway Days celebration, pianist Gideon Lowry is approached by the sultry Asia to help her find her estranged missing husband. Reprint.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "POCKET",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Alien & Possum: Friends No Matter What",
        "Authors": "By Johnston, Tony and DiTerlizzi, Tony (ILT)",
        "Description": "When Possum, a grey creature who enjoys his cabbage, meets up with a multi-colored alien who dines on high voltage, an unexpected and special friendship forms in this easy reader with full-color illustrations. Reprint.",
        "Category": " Juvenile Fiction , Readers , Intermediate",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Blood & Burning",
        "Authors": "By Algis Budrys -",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1978"
        }
    },
    {
        "Title": "With My Face to the Enemy: Perspectives on the Civil War",
        "Authors": "By Cowley, Robert (EDT) and Donald, David Herbert (EDT)",
        "Description": "A collection of essays on the Civil War explores every aspect of the conflict from Lee's role in the Confederacy to the tactics that won and lost the war, with contributions from James M. McPherson, David Herbert Donald, and other notable historians.",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Putnam Adult",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Golden Horn (The Hound and the Falcon Trilogy)",
        "Authors": "By Tarr, Judith",
        "Description": "Alfred, a healer with special powers, and Thea, a shapechanger, are captured when Crusaders capture the city of Constantinople",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "September",
            "Year": "1985"
        }
    },
    {
        "Title": "Laugh-eteria",
        "Authors": "By Florian, Douglas",
        "Description": "Karate KidsOne was a black belt. One was a brown. One had a loose belt; His pants fell down.Silly, irreverent, and always clever, these poems showcase Douglas Florian’s talent for turning plain old language into outrageously entertaining verse. Page after page of witty wordplay and droll black-and-white drawings are guaranteed to knock the socks off devoted poetry fans and newcomers alike.",
        "Category": " Juvenile Nonfiction , Art , General",
        "Publisher": "Harcourt Childrens Books",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Organized Living",
        "Authors": "By Chislett, Helen and Walter, Dawna",
        "Description": "Explores innovative storage options for every decor while offering advice on assessing storage needs and planning space to suit one's lifestyle",
        "Category": " House & Home , Decorating",
        "Publisher": "Antique Collectors Club Ltd",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "How to Start a Home-Based Gift Basket Business (Home-Based Business Series)",
        "Authors": "By Frazier, Shirley George",
        "Description": "Offers advice on starting a gift basket business, including tips on how to write a business plan, manage cash flow, and publicize your business",
        "Category": " Business & Economics , Home-Based Businesses",
        "Publisher": "Globe Pequot",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "The Third Child: A Novel",
        "Authors": "By Piercy, Marge",
        "Description": "Under her mother's constant scrutiny and lost in the shadow of her famous senator father, Melissa is the third child in the politically prominent Dickenson family, where ambition comes first and Melissa often comes last. In college, she meets Blake, a man of mixed race and apparently unknown parentage. His adoptive parents are lawyers whose defense of death-row cases in the past brought them head-to-head with Melissa's father when he was the governor of Pennsylvania.While Melissa and Blake's attraction is immediate and fiery, a dangerous secret lurks beneath their relationship -- one that could destroy them ... and their families.Provocative and beautifully written, and dealing with themes of love, honesty, identity, and the consequences of ambition, The Third Child is a remarkable page-turner.",
        "Category": " Fiction , Psychological",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "A Snowman Named Just Bob",
        "Authors": "By Crouch, Karen Hillard (ILT) and Moulton, Mark Kimball",
        "Description": "",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Lang Holdings Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Data Structures With C++",
        "Authors": "By Ford, William and Topp, William R.",
        "Description": "",
        "Category": "",
        "Publisher": "PRENTICE HALL",
        "Price Starting With ($)": "7.65",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "The Perils of Prosperity, 1914-32",
        "Authors": "By Leuchtenburg, William E.",
        "Description": "",
        "Category": "",
        "Publisher": "University of Chicago Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1958"
        }
    },
    {
        "Title": "Endometriosis",
        "Authors": "By Older, Julia",
        "Description": "Examines an often undetected disease, which may cause infertility and other problems, and explains how to recognize symptoms and obtain medical help",
        "Category": " Health & Fitness , Exercise",
        "Publisher": "Wiley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "The military establishment;: Its impacts on American society",
        "Authors": "By Yarmolinsky, Adam",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1971"
        }
    },
    {
        "Title": "Hillary's Scheme: Inside the Next Clinton's Ruthless Agenda to Take the White House",
        "Authors": "By Limbacher, Carl",
        "Description": "Hillary's Scheme confirms the worst fear of tens of millions of Americans: that Hillary Clinton indeed plans to run for president within the next few years. This explosive, behind-the-scenes book by investigative journalist Carl Limbacher blows the lid off the New York senator's plans for a grand political coup, something she has been carefully and quietly plotting far more than 20 years. Limbacher conducted extensive interviews with Clinton insiders - and even questioned Hillary herself - to bring you the real story. What he uncovers are the truly juicy morsels, the backroom deals, and the insider wrangling around Hillary's presidential ambitions that aren't being reported in the mainstream press. If you love to hate Hillary or are just curious about one of America's most controversial figures, there's plenty in this book to get your blood boiling.",
        "Category": " Political Science , General",
        "Publisher": "Crown Forum",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Three Roads Home",
        "Authors": "By Thrasher, Travis",
        "Description": "Choices made.  Promises broken.Three Roads Home explores the painful heart-trials that all couples must weather and the unexpected shelter they find in the restorative love of God.  Brimming with honesty and hope, these stories offer moving portraits of how we grow in love despite the storms of life.  SomebodyCharissa Thomas didn’t hear much after the phrase, “there’s been an accident.” All she could remember was the way Trevor stormed out that morning on his way to the airport.  As she awaits news of his overseas flight, she rediscovers the man she fell in love with years ago, even as she fears she’ll never see him again.  In Care ofWhen successful author Stephen Conroy receives an email from first love Nicole Marsh, he starts to question his wedded bliss.  Could he still be in love with her?  Or is he simply curious about an old friend?   Stephen must decide if he can confront the love of his past without risking the future with his wife.  Still Life at SunsetAnna Williams returns to her small hometown in hopes of making peace with her father and finally opening a mysterious package from her ex-husband.  Determined to tie up loose ends, Anna finds herself unnerved by old flame, Brad, who’s more intent now than ever before to win her back.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "WaterBrook Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Golf Dreams: Writings on Golf",
        "Authors": "By Updike, John",
        "Description": "John Updike has been writing about golf since he took the game up at the age of twenty-five. In the nearly forty years of pleasurable bafflement that have followed, he has composed essays for Golf Digest and short stories for The New Yorker concerning the sport; he has contributed to tournament programs and walked such fictional characters as Rabbit Angstrom and Tom Marshfield (of A Month of Sundays) through the details of a round. Golf is neither work nor play, he asserts: \"Golf is a trip.\"Golf has been the subject of many books and the province of many experts, but few have written as sympathetically, as knowingly, about the peculiar charms of bad golf, and the satisfactions of an essentially losing struggle. The camaraderie of golf, the perils of its present boom, how to relate to caddies, and how to manage short putts are among the many topics covered. These thirty pieces of pure gold have been dug up from a great variety of sources. Some have been published in one or another of Mr. Updike's other collections; most have not.",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Knopf",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Home to Harmony",
        "Authors": "By Gulley, Philip",
        "Description": "Welcome to Harmony ...In this acclaimed inaugural volume in the Harmony series, master American storyteller Philip Gulley draws us into the charming world of  minister Sam Gardner in his first year back in his hometown, capturing the essence of small-town life with humor and wisdom.",
        "Category": " Fiction , Religious",
        "Publisher": "HarperOne",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Father to Son: Life Lessons on Raising a Boy",
        "Authors": "By Harrison, Harry H., Jr.",
        "Description": "Warm and fuzzy, anchored in values, and filled with simple words of wisdom, this beloved, bestselling book for parents speaks to the important business of raising sons, and distills their timeless lessons into one nugget of wisdom per page—some lighthearted, some serious, some practical, and some intangible, and all supported by a strong moral backbone.Freshly updated, the book begins with the Five Keys of Parenting, a guide to navigating the extraordinary, even if sometimes exasperating, journey of parenthood. It’s filled with the importance of nurturing responsibility: Teach him that the world will judge him by his actions, not his intentions. Fun stuff: Have tea with him in the afternoons. Serve cookies. And when he’s ready to go: Hug him fiercely.",
        "Category": " Family & Relationships , Parenting , Fatherhood",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Lab Fever: Living, Loving and Laughing With America's #1 Pet",
        "Authors": "By Cochran, Bruce",
        "Description": "",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "Willow Creek Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Krazy Kat: A Novel in Five Panels",
        "Authors": "By Cantor, Jay",
        "Description": "Krazy Kat, Ignatz Mouse, and other Coconino County residents travel to Alamogordo, New Mexico, where Krazy is awed by a giant tower and Ignatz falls for J. Robert Oppenheimer",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Alfred A. Knopf",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Still Sexy: How The Boomers Are Doing It",
        "Authors": "By Bakos, Susan Crain",
        "Description": "Boomers tell all: sex then, sex now, and the sex secrets that bring erotic satifsaction at any ageSeventy percent of Baby Boomers still listen to rock'n' roll.  They still take drugs--only now they're hormones, Prozac and Viagra.  Now, the question is: Are they still having sex? And if so--how good is it?In this provocative portrait of a generation's sexual habits, Susan Crain Bakos reveals what's really going on behind the Boomers' bedroom doors.  You'll be surprised by which couples make love most frequently--and at the sexual practices preferred by the men and women who rocked at Woodstock and marched on Washington.  Best of all, she shares their wisdom and wild experiences in tips and advice about lovemaking.  The result is a holistic approach to great sex for any generation, before or during mid-life--and beyond.  Don't miss:Making love the second time around, and why older women and younger men are a great fitThe new need for foreplay for men, and the most delicious ways to turn him onLovemaking secrest: Boomers share their best moves from three X-rated Oriental tricks to favorite intercourse positions for sore knees and bad backsLongtime marriages, lots of sex: find out what keeps lovemaking sensational after 25 yearsDifferent strokes: bisexual, straight, gay, or kinky, Boomers are still breaking down barriers.Discover how!",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "St. Martin's Paperbacks",
        "Price Starting With ($)": "11.26",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "V Was for Victory: Politics and American Culture During World War II",
        "Authors": "By Blum, John Morton",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt Brace Jovanovich, (c1976)",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Thunder in the Desert",
        "Authors": "By Blackwell, James",
        "Description": "A former Army major and CNN's Gulf War military affairs analyst examines the planning, the buildup, and the execution of the Allied air and ground attacks on Iraqi forces from both a tactical and operational perspective",
        "Category": " History , General",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Symptom Solver: Understanding and Treating the Most Common Male Health Concerns (Men's Health Life Improvement Guides)",
        "Authors": "By Bauman, Alisa, Kaufman, Brian Paul, and Men's Health Books",
        "Description": "Describes common ailments and their symptoms, suggests self-treatments, and explains when to consult a doctor",
        "Category": " Health & Fitness , Men's Health",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1996"
        }
    },
    {
        "Title": "Jeffrey Lyons' 101 Great Movies for Kids",
        "Authors": "By Lyons, Jeffrey",
        "Description": "Culled from twenty-five years of movie reviewing, here are 101 of the finest films for children and families, handpicked by Sneak Previews critic Jeffrey Lyons. Jeffrey Lyons' 101 Great Movies for Kids is filled with detailed plot summaries, critical observations, historical perspectives, and little-known anecdotes about the movies and their stars. Covering the classics, recent films, and often overlooked screen gems, Jeffrey Lyons directs you to the best and most age-appropriate selections to share with your kids, from the youngest family members to teenagers.",
        "Category": " Performing Arts , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1996"
        }
    },
    {
        "Title": "Growing Older & Wiser: Coping With Expectations, Challenges, and Change in the Later Years",
        "Authors": "By Billig, Nathan",
        "Description": "This guide to understanding the mental health of older people reveals how to cope with the normal aging process and see its potentially positive aspects while dealing with its problems.",
        "Category": " Psychology , General",
        "Publisher": "Lexington Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    }
]